{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Place for a Relaxing Vacation”", "Author": "Ramon_from_Boston", "ReviewID": "UR128219947", "Content": "Great resort for extended vacations. Very friendly personnel, quiet rooms and accessible to shopping centers and attractions. The villas are kind out-dated and need some care. The facilities and pool are great. You have direct access to the hotel's private beach. Compared to the other Hyatt Vacation Resorts, this could be a 5 in the scale to 10. The area is great, location is superb but the rooms need some care.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corozal", "Title": "“Stay here every summer! fully stocked Kitchen!”", "Author": "NorbetBooks", "ReviewID": "UR128203162", "Content": "We stay her every summer and get the 2 bedroom with kitchen fully stocked, washer dryer, jacuzzi on the beach olympic pool and exercise room.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san juan puerto rico", "Title": "“Own Two Weeks Here”", "Author": "travelgreattimes", "ReviewID": "UR128143592", "Content": "I have always used my weeks. This place is wonderful and I have now reserved the weeks of June 2 thru 9 and July 28 thru August 4, 2012. You will love the Atlantic Ocean and beach view from my 6th floor balconies. Each apartment has two balconies. Each apartment sleeps up to 8 people. This is a great experience for nature lovers and beach goers. The beach is a stone throw away and the breeze is so pleasant. Dorado offers great restaurants, magnificent golf, great supermarket, unique location near San Juan so you can visit the Fortress, the Old San Juan and best restaurants in the Carribbean. You will get a great value for a full week of fun. If you want my personal review please contact me at jormalv@aol.com. Thanks and enjoy the review.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York, United States", "Title": "“If you're looking for a place to relax in the sun...”", "Author": "DoradoLover", "ReviewID": "UR128057315", "Content": "this is the place for you. We came as part of the Vacation Club in April 2012. This is a beautiful ocean front property with a large pool, kiddie pool, hot tub (which was nice and clean), spa, fitness center and a private beach with just enough surf to make it fun for younger kids. The hotel was only about 1/3 occupied, so there was no need to \"stake out\" beach chairs or pool chairs. All rooms face the ocean/pool. However, lower level rooms get a view a bit blocked by palm trees (we were on the 6th floor of 8...perfect) and rooms to the far left (as you face the hotel) get a partial view of the abandoned hotel next door. The pool and beach area has a lot of space with plenty of shade in the form of palm trees and umbrellas to complement the sun-lover areas. At night or after it rains, the palm trees come alive with bird calls and coqui. We had a 2 bedroom suite, which sleeps 8 for two adults and two teens (16 and 17.) The suite room has a bathroom/shower, jacuzzi tub, full kitchen, living/dining room with pull-out, balcony seating 4 and bedroom with king bed. The 1 bedroom/studio has considerably less space...bed, pull-out, microwave, mini-fridge, bathroom/shower, balcony. Both rooms have access to washer/dryer. The rooms were clean, quiet and relatively well maintained. The bathrooms do show their age a little bit. There is a small though pretty well stocked market store on the property with basics (milk, bread, soda, etc.) and pool/ocean toys. There is an outdoor bar that serves breakfast, lunch and dinner with limited hours, but no restaurant on property. You will need a car if you stay here. There are no restaurants/activities/grocery within walking distance. The hotel does provide some tour information/sign up, but it's pricey. There are several good restaurants in Dorado (The Greenhouse, Made in PR, Faccio Pizza), a SuperMax grocery, etc. We ate a few meals in town but spent most of the week exploring in the afternoons so we ate in Old San Juan and in other parts of the island. It is a bit of a drive to get to Old San Juan or other points of interest (National Rainforest, Ponce, etc.) If you enjoy resorts buzzing with activity, this is probably not the place for you. However, if you're looking for a peaceful, relaxing place to stay as a jumping off point for your adventures in PR, this is the place!", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Lovely vacation spot”", "Author": "CricketNut91", "ReviewID": "UR127305467", "Content": "We have been owners at the Hacienda Del Mar for 12 years, so we are well aware of the history concerning the Hyatt Cerromar closing several years ago, along with most of the restaurants and the river pool. We decided to return this year, after a 2-year absence, because we had heard that things were happening next door (the old Hyatt Dorado). The grounds of the property are still impeccably maintained, as was our unit (we have a 2-bedroom). At the owners meeting last Monday morning we were told that plans are underway for redecorating the rooms. However, despite some prior reviews saying the decor is \"dated\" we feel that the units are still in excellent shape. We also learned at the owners' meeting that the Fairmount organization has recently decided that they are not interested in being the operator of the hotel that will be at the site of the old Cerromar and that the developer of the project, which is the property of the former Dorado and Cerromar, is looking for a new operator. Let me just digress for a moment and say that we drove around the old Dorado site, which is heavily under construction! Major events are happening there - it will reopen in December 2012 as a Ritz Carlton resort and it looks like it will be amazing. We were even able to have dinner at the beachfront restaurant Friday night. We hope that the rebirth of the Dorado will have a very positive effect on the Hacienda Del Mar. Once the Ritz Carlton/Dorado is open, the developer hopes to build a 400-room hotel and casino at the old Cerromar property. The new hotel, however, will be adjacent to the golf course, not on top of the Hacienda like the old hotel is. Anyway - we found that there was more activity this year at the Hacienda than at any year we have gone after the hotel closed. While it was far from crowded, we noticed that there was a variety of guests - seniors, families with children of all ages, couples, and a couple groups of spring-breakers who behaved very well! I must say, when we were there 2 years ago it was a little dead with no kids for our kids to pal around with. It is nice to go somewhere and not have to get up at 7am to put towels on the chairs so you have a spot at the beach or the pool. The hotel still has the Blu Bohio, which serves breakfast, lunch and dinner (make sure you check the dinner hours). Food and drinks were very good, with a nice variety. I think someone's grandmother was in the back making the rice and beans - they were amazing! We had a car, so we were able to stock up at the nearby Amigo supermarket, and we also had dinner at the Chop House (sushi), La Terratza (great mofongo) and the Metropol (?) - a Puerto Rican and Cuban place in the shopping center that has the Starbucks. All in all, we are very hopeful that the Hacienda Del Mar is on its way back to being the preferred destination of 10 years ago. As I said above, it is still carefully maintained, with plans for improvement underway. We know that some of the owners have given up and relinquished their rights to their timeshare - we are very happy that we have stuck it out and are looking forward to our next visit!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Solid Property in a Remote Location”", "Author": "ViajeNut", "ReviewID": "UR126642895", "Content": "I stayed at the Hyatt Hacienda Del Mar, a vacation club property, in February 2012 for some R&R and my Wife's B'Day. The property is about a half hour drive from San juan Int'l. I had a rental car because a cab ride is allegedly $50 each way. The property is located in Dorado, which is a suburb about 20 minutes from the tourist section of Condado and Old San Juan. Because of that, If your looking for excitement and lots of activity, this isn't the place for you!!!!! Overall, this is a solid, well-maintained property. The rooms and grounds are clean and the staff is pleasant. However, the resort is dated and in need of an update. I had a 1 bedroom villa with a spacious living area and master suite. Everything was in working order, clean and functional; just not very modern. Since I had a full kitchen, I stocked up on water and a small amount of groceries from a local supermarket. We did half our dining in the room and half at the resort and around the neighborhood. I would definitely recommend El Vacahon, a neighborhood restaurant. Its absolutely fantastic!!! Also, i would recommend Zafra, an upscale restaurant in Plantation Village, a neighboring golf club location. There is only 1 restaurant on site and it closes early!!! We ate there a few times. It had a typical beach bar and grill menu with a Latin Flair. The food was good, but nothing to go crazy over. The pool area was large and there were plenty of seats available no matter what time of day. The beach was extremely windy and almost chilly!!! I'm not sure if it was the time of year or just rough seas during my time there. At times, people had towels over themselves because the breeze was so strong. A rental car is a must unless you intend to stay at the resort all day. You can't walk to anything in the area. Getting a Cab can be near impossible at certain times of the day. That is just the way it is in this area. Another couple told us that they were at the Embassy Suites down the road for dinner 1 evening and they couldn't get a cab. It was 8pm when they tried, so it wasn't even late in the evening. The surrounding area is in transition. A Ritz Carlton Reserve resort and residence is being constructed in the next few years, so the neighborhood is on the rise. Allegedly, If your a guest of this resort, you'll have access to the Ritz's facilities. I'll believe that when I see it. Overall, this is a resort I would come back to as long as I have a car available.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "feeding hills, ma", "Title": "“Great stay”", "Author": "tbass", "ReviewID": "UR126629878", "Content": "I was a little worried reading some of the negative reviews, but I realized quickly that most negative reviews are not based on the property, but on the people writing the reviews. You must go into a vacation realizing that you are not going to be the only ones there, there are others that are vacationing as well and we all must share that. That being said, sometimes its better to , as they say, not sweat the small stuff. As mch as we would like, things won't always be perfect. On arrival at the airport, we were greeted by our Dorado Tours shuttle driver John with a placard with our names on it so it was easy to locate. John greeted us and even stopped at the local grocery store on the way to the hotel so that we could stock up. That saved us a trip out later on. John also gave us information on tours that we might like. We took advantage of that and he brought us to Old San Juan and the Bacardi tour. It seemed like John was our own personal driver for the day! He dropped us off at the ferry, made sure we were all set with tickets and gave us times to get back so that he could pick up up(right on time waiting for us) and take us to the Bacardi factory. Once again he got out and set us up with the tours tickets (we could have easily done that), and waited for us to finish the tour. Again, on the way back to the hotel he asked us if we needed to stop anywhere while we were out. He was GREAT! All of the Staff at the hotel were very cordial the entire stay. In my opinion, you only get attitude if you give it! Had a problem with the in room safe, fixed within the hour! Rooms were nice, clean, and very comfortable. The unit had everything we needed. We never had any problems with noisy neighbors (first time in a long time on vaca we didn't have noisy neighbors). Being a home owner I realize that nothing stays brand new forever. Sure, some things need updating, but it never took away from the stay. The closed hotel next door never bothered us either, we were too busy enjoying the beach and the pool to really even notice! The beach was awesome, a little rough and windy, but whatever. Still a great time. Were there some negatives? Sure, but again, we didn't let those little things ruin our stay!! The night shuttle driver Felix, was awesome as well! He recommended places to eat ( he was always right!), got out and made sure we had tables, never made us wait, and also stopped at a store for us. He was great company and an all around nice guys, thanks! La Marena (sp) had great food. The Greenhouse Cafe was awesome as well! Great Ribs! went again just for the ribs, best I have had. The Pika Restaraunt was within walking distance. It was ok, to us, nothing to rave about. We walked that night to Pika, and on the way back at the beginning of the hotel entrance, Felix was driving by and told us to hop in to get a ride back. We would have enjoyed the walk back, but appreciated Felix for offering. My wife and I didn't do much but enjoy a relaxing time at the Hyatt. Thanks everyone.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, TX", "Title": "“Great Vacation--A little lacking for Hyatt”", "Author": "timoray", "ReviewID": "UR126410414", "Content": "We were here during spring break 2012. The walls are paper thin and the floors are tile which I love be offer no sound barrier. We had noisy neighbors in all directions and there isn't much you can do about it except request an upper floor which is better for ocean views anyway. The reviews about the resort are all accurate: great beach, nice pool, rooms and resort are dated, great fitness facility, great tennis courts, very helpful staff. They will do anything to make your stay as pleasant as possible. We asked for an upgrade from a 1 to a 2 BR unit which they did for $50/night. The sofa bed was terrible and the sofa itself was pretty gross with big stains on the cushions. We thought it was well worth it. We were there a week and I wish we had more time to explore San Juan. It's about 30 - 40 minutes away but I didn't find the traffic all that bad. Perhaps if you are from rural America it would be overwhelming but so would any big US city. We found an outstanding restaurant in San Juan called Juan Enrique's. It was in an interesting area with live music on Saturday night, funky bars and clubs all around and seemed to be quite safe. GO THERE! The food was moderately priced, great atmosphere and great service. We loved Old San Juan and I wish we had another day there. We went to Camuy Caverns and that was a fun day trip. It's not the biggest or best but it's a pleasant drive and about an hour away. We toured the Bacardi Rum distillery and that was pretty fun. There is a lot to do at the resort in the way of activities but we are pretty physical people who love tennis, the beach, working out, etc. If you are a couch potato who doesn't do much physical the resort doesn't have great restaurants or night club entertainment. We would probably go back, not for the resort itself but PR is beautiful with Caribbean culture, good beaches, great restaurants and mostly friendly people.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "North Brunswick, New Jersey", "Title": "“Very good experience, visited March 5-10, 2012.”", "Author": "wudwork", "ReviewID": "UR125993164", "Content": "Pool area is very nice. We did observe some folks putting towel on chair and not returning for hours. I suppose the ultra-private/secluded beach was so much better they stayed there ? The green fence, blocking view of neighboring & closed hotel is NOT an eyesore or any trouble at all. That being closed assured us a VERY large and private beach; just like others have reported here. Our room was on 5th floor so we were higher than the pool area palm trees thus able to clearly see ocean and never ending waves. Very nice! We had great slush drinks at poolside bar. Exercise room is well equipped, yet the elliptical machines seem more home-style than those rated for gym (non-stop) use. The elliptical I used worked fine but clearly would have benefited from a tune-up. They supply wipes to pre, and post, clean your machine. The weight machines were abundant, in good shape, and no lines. Staff was top notch. As others have reported, this place is not physically far from San Juan, but when you add traffic, its a nightmare to try and return to hotel between 4 and 7pm. I truly wish Obama would provide New Jersey the highway funding that somehow Puerto Rico gets.There are orange cones on EVERY roadway and construction guys at all hours of day doing work. About 1 mile outside hotel property is a very large and well stocked grocery store. Its accross street from CVS. The hotel has 2 BBQ propane grills on the beach, so you can easily grill up anything you get at store. The folks around San Juan are truly friendly. While the Policia are EVERYWHERE!!!, we never felt need for them.I asked about getting cigars and I was surprised how many speak english and truly wanted to help me. We got the strong sense that the locals wanted us to be happy. Bottom Line: If trip is to tour San Juan (which I strongly recommend) then this hotel location is not good (again, due to traffic). If trip is to bum around the pool, hands down, stay here!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Private and relaxing”", "Author": "omni81", "ReviewID": "UR125616391", "Content": "The good and the bad. First, the bad: traffic is absolutely horrendous in Puerto Rico, so if you are planning on doing a lot of exploring (like I usually like to do) please be aware that this location is not at all convenient for exploring -- otherwise, if you plan on just sitting on the beach or by the pool, this is a nice option. Also note that there is only one \"restaurant\" on the property and it closes at 8pm, but it will suit your needs and is probably perfect for kids AND there are great restaurants within a short drive of the resort. The units could use some updating, but they are otherwise clean we thought them to be spacious and just fine. The good: The rooms all have ocean views (above the 4th floor)!!! We had a lovely view on the 7th floor and could see the ocean from our living room/balcony. The beach here is gorgeous and private - we drove around to a few public beaches and it's worth it just to stay here; it was the nicest we found within a 30 min drive. The grounds are gorgeous and the staff is friendly. The property next to the Hyatt is closed but we actually found that this added to the privacy - so it didn't bother us one bit. We would come back again but probably wouldn't stay again for an entire week, only because traffic is so crazy and I would love to see more of the island!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Fenwick Island, Delaware", "Title": "“Shame on Hyatt.”", "Author": "leisuresusie", "ReviewID": "UR125413807", "Content": "We stayed here because it was a Hyatt. We went to our room and all we smelled was mold. The furnishings in the room are old and awful. The restaurant is no better than any fast food restaurant. The only saving grace is the beach. The pools are also good. There is something spooky about the worn green fence that separates the next property. Again about the mold don't go here if you have lung conditions. I used my inhaler more in two days than I have in two years. There are three great employees. The towel guys and the male bartender. The front desk staff were the worst of our three weeks here in Puerto Rico.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very clean and genually nice people.”", "Author": "jkjkxoxo", "ReviewID": "UR124862964", "Content": "The waterside in the back of the Olympic swimming pool and the georgeous lazy river and water falls are closed. Also the other side of the hotel and the casino arre closed. Please enjoy climbing on the rocks off the beach", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cape May Court House, New Jersey", "Title": "“Beautiful grounds & it's beachfront”", "Author": "Mazzahs", "ReviewID": "UR123382314", "Content": "OK, I loved this place from get-go. My girlfriend & I pulled in while transversing the island & traveling east from Arecibo/Rincon/Isabela. We had one night left before embarking on our last night in Old San Juan. I always wanted to venture into Dorado, so we pulled into town blindly. I aimlessly drove down the road looking for a resort (price was no option since we were tired and wanted a \"resort\" type place to call home for the night.) We finally found the resort and were stopped at the gate by a guard. He called ahead (a bit surprised at our lack of a reservation), & received the go ahead for our impromptu entrance. The grounds are stellar and vast to say the least. The rate for a studio apt (larger than many studios; this place was built in the 60's-70's I believe) was ideal and much less than the pricier San Juan Metro area. The building iteself is set back a bit from the ocean, but the waves are visible & heard nonetheless. So, I woke from a nap around 7PM prior to out dinner adventure into town & was surprised to see a LARGE section of the property (a separate buliding to the East) from our balcony that was completely DARK. I initially thought that the complex was slow but upon some quick internet research, I realized that this building used to be a part of the hotel (or separate back in the 90's). The building was sinking and included a casino, restaurants, etc. There was also a world famous \"lazy pool\" that surrounded the hotel that is now fenced off from the remaining 2 Hyatt buildings. I've read and heard conflicting reports that this hotel is being renovated & due for demolition and reconstruction. However, it was an ominous & strange sight since the darkness is ever present being so close to a major resort/hotel. (This would be a great stop for the current cable \"ghost\" shows to venture into!) It is THAT EERIE.... The rooms are a bit dated, but this in no way detracts from the wonderful amenities & grounds/location. Town center is a mere 5 mins away and the beachfront spot makes up for the semi-dated rooms and abandoned adjacent building. Give this place a shot if you want to venture outside of the SJ Metro area and if you want to experience less traffic & a more authentic PR community.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“Hyatt Del Mar”", "Author": "wisess", "ReviewID": "UR123319313", "Content": "A bit misleading. The travel guides all said it had a river pool. I guess its the closed down hotel next door that had the river pool. Looks like its been closed a very long time. It was very disappointing. The Hyatt still has a pool, just not very exciting. The hotel itself was otherwise nice and well maintained. Front desk people were fine, though not impressive. Restraunt hours were very limited. Location was good as it gets you out of San Juan but not too far. You will need a rental car if you want to do anything besides the beach and pool on the premises. Not a bad stay but not up to par with other Hyatt's I have stayed at.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Rest and Relaxation with a sprinkle of FUN!”", "Author": "alicialeanna", "ReviewID": "UR123268772", "Content": "In need of some serious R&R- 3 of us decided on the Hyatt Hacienda Del Mar. We were a bit hesitate after reading the reviews but after a 1 min discussion (yes literally I minute) we realized its Puerto Rico, with tropical weather, next to the ocean what can be bad about that? Most importantly we are in a safe environment and will not have to worry about being isolated at a resort because of precautions. And maybe I am not a 5-star hotel snob like some people *ahem* (I hate to point fingers but I am pointing fingers some of these reviewers). The hotel was fineâ€¦ the rooms were nice- yea there was no flat screen but who needs a tv when you have the beach, and a private beach at that!!! The resort was very accommodating- the pool was nice, the restaurant was not bad either, and I have been to up-to-date hotels where the wireless was much worse. So I say bring a book to the beachâ€¦ again who needs technology when you have a serene atmosphere. The staff was great, answered all questions and was very accommodating. If you stay at this resort make sure you rent a car. The â€œcar serviceâ€� better known as â€œGypsy cabsâ€� are a bit pricey. The money we spent on transportation could have equaled a car plus gas. The restaurants in Dorado are good and I was able to go to the store to stock up on snacks and beverages. The 3 of us are in our twenties and made the BEST time out of our stay. Needless to say I thoroughly enjoyed myself, the Hyatt is a good destination hotel and I would recommend this property.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Myrtle Beach, SC", "Title": "“Had a great time.”", "Author": "carolinagirl50", "ReviewID": "UR123182647", "Content": "I am a timeshare owner here at the Hyatt and I am happy to report that the area is on it's way back to what it once was. The Ritz Carlton will be one of the hotels that is being built here and will be done by the end of the year. The Cerromar will be coming down when that project is done. The rooms are also in the planning to be renovated. Had a great week the people here are wonderful. I suggest eating at the local restaurants and stay away from the tourist type of restaurants.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "NJ", "Title": "“A Peaceful, Quiet Resort with an Attentive Staff”", "Author": "DarleneMAM", "ReviewID": "UR122892193", "Content": "We arrived in Puerto Rico on a Continental flight under sunny skies. The pilot dropped the plane like a brick, hit the brakes hard, overcorrected his steering and the plane fishtailed to a stop. Welcome to Puerto Rico! We rented a car to drive to our destination: the Hyatt Vacation Club in Dorado called the Hyatt Hacienda Del Mar. Tooling along the highway from the airport toward old San Juan and beyond to the Hyatt, my husband Mike ambled along as the rest of the world sped by. I noticed the pure decrepitude of many of the vehicles passing us. I saw cars missing front bumpers, back bumpers, and fenders. I saw rust buckets and dent machines. As Mike drove past Old San Juan and on toward Dorado the lanes on the highway were narrow, the construction plentiful and the potholes abundant. My back teeth began to hurt with every impact from every pothole we hit. Those were nothing, though, compared with the mother of all potholes Mike hit on the way into a CVS parking lot. Even my brother-in-law Bid went quiet at the moment of impact; I think his teeth hit his tongue. My sister Cindyâ€˜s butt may even have left her seat. I was sure we had a broken axel at the very least. Mike parked and we all got out of the car and raced to the front of the vehicle to see what weâ€™d broken. Miraculously, nothing was. We laughed and headed toward the storeâ€™s door; we passed a car missing its front bumper, grill, and fenders. We thought our car would look like it by weekâ€™s end. And Iâ€™d need to have my rear fillings replaced. Itâ€™s an easy life at Hyattâ€™s Hacienda Del Mar. With no other resort nearby (and a hotel/casino long closed still stands right next door) the Hyatt is very quiet. We started our first day next to the pool â€“ the pristine, empty pool. We lounged and swam for a while, until our feet started to fry on the concrete apron that surrounds the pool. So we picked up our towels and moved to the beach, mere steps from the pool. Edged in palm trees and with a blue sky above, the ocean cove was breezy and the sand didnâ€™t burn our feet. Every few hours a small raincloud would pass over; sometimes it was hard to tell if it was raining at all â€“ the raindrops were light and warm. We lazed our first day away. Mike and I want to return to the Hacienda Del Mar because it is peaceful and quiet. If you are looking for a fun and lively nightlife, this is not the timeshare resort for you; however, if you are in the mood to chill out and spend meaningful time with your significant other, we highly recommend the resort. We rented a car so we could leave the resort any time we chose; that said, the Hacienda Del Mar does arrange for shuttle services (based on demand) to Old San Juan casinos, the rain forest and other places. A fee is paid directly to the driver. We used a shuttle to go to Old San Juan one evening since parking there is difficult, at best; our driver was chatty, the vehicle well maintained and we got back and forth safely. The rooms at the Hacienda Del Mar, although not brand new, are clean and pleasant; our balcony provided a wonderful view of the cove and ocean beyond. The staff was friendly and kind. If youâ€™d like to see more photos of the resort, please visit my Flickr album: http://www.flickr.com/photos/8164453@N05/sets/72157627781184557/", "Date": "January 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Need updating!”", "Author": "Bumscoop", "ReviewID": "UR122757856", "Content": "The beach and view are very nice. The staff helpful. The resort old with one resturant and in a residential area . You have to drive far for a good resturant . Not the best location at all.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Pittsburgh, Pennsylvania, United States", "Title": "“Nice hotel, but for a Hyatt lacks alittle”", "Author": "Jody A", "ReviewID": "UR122118015", "Content": "Expected more for a Hyatt. It is West of San Juan, all the fun stuff - rain forest, bioluminescent kayaking, catamarant excursions, good beaches all are east - so you have to drive thru San Juan with crazy drivers and it can take an hour, it can take 3 hours. The rooms were nice,the kitchen comes equiped with everything you would need for a meal, but the bathrooms could use some updating. Half the games in the \"game room\" do not work. Only one \"restaurant\" on site - kitchen is behind the outdoor bar. The closed hotel next door is an eye soar - spooky at night. Did not like the empty pool right next to the fence with standing water in it. The front desk staff were very helpful and friendly. If we ever return to PR - will definately stay east of San Juan!!", "Date": "December 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice staff but hotel needs improvements”", "Author": "Ninjareview", "ReviewID": "UR121470173", "Content": "Staff is friendly and has a great location on the beach. Rooms need work as bathrooms are really outdated and old. The room we stayed in I'd have a view of the beach. The building next door used to be their casino but now is evacuated since it was sinking. I hope Hyatt renovates the property so it is up to their standards since i am a big hyatt fan. We stayed at st Regis in rio grande (45 min away and near rainforest) a few days later which was a lot nicer hotel.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Friendly, helpful staff; beautiful location”", "Author": "MJchemist", "ReviewID": "UR120834346", "Content": "We had a great time at Hyatt Hacienda Del Mar. We went in November, just before Thanksgiving week, when the weather is pretty good but prices are low and the facility is not crowded. We have stayed here before and will come back. The staff is very friendly and took excellent care of us. One thing that I did not care for - the pillows. The pillows are high, not very soft, and not comfortable for me, but that is a personal preference. The pool was sunny and not crowded. I also saw very few people on the golf course and on the beach. We had a nice ocean view, and I believe that most rooms do.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlottesville, Virginia", "Title": "“Very Nice Hotel”", "Author": "MattieF", "ReviewID": "UR120428696", "Content": "My wife and I stayed here for 3 nights. I will say that I had earned some free night certificates from a company I sell for, so we didn't actually have to pay... That said, I wouldn't hesitate to come here. The staff is very pleasant and the beach is quite nice. If I were to nitpick, the rooms are a bit dated with older finishings, television etc, but ours did have a fabulous ocean view! Additionally, self-service laundry facilities were available immediately outside the room. The wifi was a bit slow, but at least that keeps you from spending all your time online! Finally, the closed hotel right next to the Hyatt was a bit depressing. The restaurant is hit or miss. Some items are great and a good deal and some items are dramatically overpriced. The first night I had the burger for $7.95. It was big and the flavor was excellent. My wife had the beefsteak sandwich for a dollar more and it was cold, the beef was tough and it left a strange taste in our mouths for a while after. The next night we had salads, which were very expensive for what they were. $14-16 each for a very average salad. Finally, we ate breakfast before leaving the last day. The food was great, portions were big and the price was good. $8 for 2 eggs, 2 pancakes and sausage. However, coffee was $1.80, refills were $.90 and a can of Sprite was $2.50! Moral of the story, choose carefully and the meal might be worth it. The other thing to keep in mind is the location. Dorado is west of San Juan, so if you are driving anywhere in the South or going to the West via the South, you may have to pass through the traffic hell that is San Juan in both directions. Example: One day we took a trip to El Yunque to go hiking. Leaving at about 12:30pm It took us around an hour and a half to get there, even with a short stop o eat and stroll through an outlet mall. On the way home (left the forest at 6pm) it took us over 2 hours, including sitting on 22E in what resembled a parking lot more than a highway. Of course that's driving in PR I suppose! All in all, I really enjoyed the visit at the Hyatt and would recommend it if you were headed to Dorado.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "hillside, NJ", "Title": "“Can't wait to come back!”", "Author": "bczgrl", "ReviewID": "UR119682818", "Content": "I am an owner at Hacienda Del Mar but had not been back in at least 4 years. As the previous reviewer stated it was disappointing to see the river pool and restaurants at the old Cerromar closed but it did not impact the wonderful time I enjoyed. Check in was effortless and the front desk staff very accomodating in giving me a top floor room with a direct view of the ocean. The 2 bedroom unit was very clean and well appointed. I did not notice a \"musty\" smell at all. In the off season the restaurant hours are somewhat limited (No breakfast) but the Market has everything you need to whip up breakfast. Another change is to the town of Dorado itself. You can now find a Starbucks, Applebees and Popeyes just 10 minutes down the road. If you want local cuisine the restaurants mentioned by other reviewers are great. If you don't feel like driving, the hotel arranges for a nominal fee, outings a couple of evenings a week to the casinos and restaurants in San Juan. The beach is beautiful, the staff is warm and accomodating. I will definitely be back!!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "queens, New York", "Title": "“better than expected”", "Author": "jwaldvo773", "ReviewID": "UR119585398", "Content": "We are owners at Hacienda Del Mar but have not been back for 6 years. We came to \"scout things out\" for our annual family vacation. There was some concern because of the negative reviews. It is sad to see the big green fence and the absence of the river pool, slides, grottos, etc. but we had a wonderful time. The beach is as beautiful as ever. The rooms are clean, comfortable and adequately furnished. The staff is lovely and accomdating. There are several delightful restaurauts very close by and we had wonderfully presented meals at Pika and The Greenhouse. Would we come back? Can't wait", "Date": "October 22, 2011"}, {"Ratings": {"Location": "3", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Loved It!”", "Author": "Shanna W", "ReviewID": "UR118204108", "Content": "I recently traveled to Puerto Rico and stayed at the Hyatt Hacienda Del Mar with a group of 4 girls in our 20s. I was nervous at first because of all the bad reviews I had read. We ended up arriving late at night because we missed our flight, and then lost our luggage on top of that. The staff was so nice, they checked us in quickly and kept us updated on the status of our luggage. The room was nice, didn't see any roaches or other bugs, as previous reviews stated. Pool is warm and clean, beach is beautiful and private. I would stay here again. Although there isn't much to do around the hotel, we used the tour service listed on the hotel website for our transportation. Our drivers names were Sigfredo and Mercie. They were AMAZING!! Sigfredo took us all over Puerto Rico showing us the sites, taking us to local restaurants and he even set up and booked all our excursions for us. I would highly recommend using him and if I ever get the chance to go back, I will call him again. Our trip would not have been what it was if it weren't for him and Mercie!", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“No Complaints”", "Author": "Rekon", "ReviewID": "UR118135050", "Content": "I traded a timeshare for the week that I stayed at the Hyatt in Dorado Puerto Rico. In order to enjoy the area you must have a car. I had a one bedroom unit to trade-in, instead I got a lockoff two bedroom unit which it was a nice touch because we traveled with a couple and this added the extra privacy and convenience for all parties involved. The main unit had a complete kitchen, living room with a sofabed. LCD screen TV, laser disc and stereo for music. Kitchen was equipped with plently of cooking utensils. There was a toaster, coffee maker, range, microwave, and dishwasher. soap for the dishwasher was supplied at no extra charge. There was also a washer and a dryer in the unit. The view from the unit was jaw-dropping, beautiful and breathtaking. We were not charge for electricity (like or resorts do), or for using their amenities which included 24 hour swimming pools and gym. The beach was beautiful and within a few steps from the swimming pools. My time share trade-in was valued at 530 dollars for my maintance fees and another 140.00 for the exchange fees for the grand total of 670 dollars. At 670 dollars for one week is comes out to 95.00 a day which is in my opinion a steal. Remenber to go to the lobby every morning before 10:00 a.m. fresh coffee, capuchino, and chocolate free of charge. Will be back again and again.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Alhambra", "Title": "“Wonderful Hotel”", "Author": "Virgfig", "ReviewID": "UR118032910", "Content": "We just returned from a 7 day stay at the Hyatt Hacienda Del Mar. We traded our timeshare through Interval International. From reading some of the previous reviews, I was a little worried. But I have to say the hotel was great and the staff was wonderful. We arrived four hours prior to check in. The staff kept our luggage locked up while we had lunch on their property. Within an hour, they notified us our room was ready. The room was located on the eighth floor and we had a beautiful view of the ocean. The furniture was a bit outdated but that is the only negitive thing we experienced. The kitchen had all the amenities you needed if you wanted to do any cooking. We asked for a late checkout and they compromised and allowed us to stay an extra hour which was really helpful. The staff was wonderful and very accomodating to all our needs. If we ever travel back to Puerto Rico, we will return. The vacant property next door did not bother us at all! The pool and grounds were spotless.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Nice, relaxing stay”", "Author": "Geri168", "ReviewID": "UR117980571", "Content": "We were at the Hyatt from Aug 13 to 20, 2011. This is our third stay at this hotel. We rented a two bedroom for my husband, my 2 sons (20 & 15) , my nephew (16) and me. We all had a really good time. Beach and pool during the day and relaxing nights in the game room or in the hot tub. Since we were there with 2 other families we had alot of fun :) We would stay here again.", "Date": "September 12, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“nightmare”", "Author": "memory1976", "ReviewID": "UR117148763", "Content": "It was a horrible experience staying there. we slept with the lights on we were afraid of the cockroaches. Very dirty room. disgusting!!!!!!!!!!!!!!!!!!. Never again!!!!!!!!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“We were overcharged at the Bohio Grill and overstayed our welcome”", "Author": "XXTRISHXX", "ReviewID": "UR116927114", "Content": "We stayed at this hotel several times in the past year, so much so that the staff knew us by name. It is a FABULOUS hotel, the grounds are great, the 24 hour pool is great. But this last stay was horrible! The Bohio grill overcharged us for the wings, then after signing the bill and charging it to the room the man added on a 20% tip AFTER THE BILL WAS CLOSED!!! I had to spend two days fighting for my $3.08 back, I know it sounds like a small amount considering we spent almost $200.00 for the one bedroom rental, but it was the fact that it was taken from us and was done sneaky! This was one bill of hot wings that we were overcharged for, so I can only imagine if we ate there frequently how much they would have overcharged us! Then when I showed the manager that I was overcharged she told me, \"It's only three dollars, I will give it to you out of my pocket\", but she never did, I had to continue to fight for it. We rented the one bedroom because it states that it comes with a whirlpool tub and spacious closets...when we arrived there was NO tub, and the closet was one foot wide, we couldn't unpack because there was no place to hang our clothes, we requested a room change but the manager said they were totally booked, although there was only 12 people or less in the pool and about six on the beach, there is no way it was booked! The manager told me she would have a room ready for us in the morning, I called at noon and the room wasn't ready, I went down and waited at her desk at 3pm and she told me it would be ready in five minutes, I waited over an hour for it to be ready and she kept telling me five minutes, I then waited upstairs in the room and after 25 minutes she called to say it was available, so I wasted one and a half days at the front desk trying to get the three dollars refunded to me, and I wasted a day in a room that was not what we paid for, and another half a day was wasted waiting for the room we paid for to be ready for us! Total waste! The other reason I rated this low is because I am a stickler for safety, the security guard was sleeping on several occasions. I have always rated this hotel as a five in the past, but it seems like the more we stayed there the more they resented us and gave us bad service and bad rooms. In the first room we stayed the shower made a horrible noise and shook the walls, by chance I ran into the repairman and he was very polite, he asked me if everything was working in the room, I told him the shower sounds like a jackhammer and he told me, \"I will fix it, go to the manager and change rooms\", this was on the first day we were there, so even he knew there where rooms available!!! I really feel that we overstayed our welcome and the staff became resentful and that is why they gave us such a horrible room and not the room we paid for! I HATE being lied to!!! And I know I was lied to about it being totally booked! If you do stay there, the grounds are awesome, very relaxing! Just keep an eye on the charges you make to the BOHIO GRILL, and pay cash so they don't write in an extra amount at the end!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fresno, California", "Title": "“We will be back!!”", "Author": "Tallmans", "ReviewID": "UR116655592", "Content": "We REALLY ENJOYED OUR TIME!! The one thing we missed was Flamenco Beach! Our favorite restaurant was Pika Bar and restaurant very near the Hyatt. Great food and Friday night music! Get to know Maria and Nestor the owners! Great people!!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "3"}, "AuthorLocation": "USA", "Title": "“Hyatt Puerto Rico \"a trailor park of a hotel:”", "Author": "DRuben1330", "ReviewID": "UR116326164", "Content": "Hyatt continues to dimishish its othertwise \"great\" reputation with any association with this old, outdated,property. YOU MUST AVOID THIS ONE!! The only thing that is missing is the shag carpet from 1970. Its truly a dump, on every level. Purto Rico is not a destination vacation area, and we are only passing through town to catch a cruise ship. If you must stay in Puerto Rico, by all means stay at the Ritz and PLEASE avoid this property.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Always a pleasure to return!”", "Author": "needbettermattress", "ReviewID": "UR115983260", "Content": "We hadn't bothered to review the property since our stay, however we find the recent reviews quite unfair. It's true that the abandoned property by the Hyatt is unsightly, if your focused on that while your on vacation- in this very relaxing property. It doesn't take away from the view. As always the staff was great, very accommodating. We've stayed at the Hyatt a few times times in the last couple of years, we've had different 2 bedroom apartments- NOT ONCE have we had a smelly room or noticed a stench anywhere on the property. The room was clean as always, well stocked too. The beach, can be rough certain times of the year, but for the most part its a great beach. There are always activities coordinated for the guests and many things to do with the family while on retreat. We look forward to our next stay :-)", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Houston, Texas", "Title": "“Extremely dissapointed - HYATT why are you not keeping the property up to your standards??”", "Author": "CRHALLEN", "ReviewID": "UR115557396", "Content": "Rooms: curtains looked like Swiss cheese, dishes had caked on food residue and lipstick on cups, coffee pot grimey, tub drain broken, floors filthy, room smelled so bad had to buy a plug in room deoderizer, bed extremely uncomfortable, rooms outdated and not as pictured told hotel was out of blankets when asked for additional blanket for fold out bed. Staff: RUDE!!! DEFINATELY NOT HYATT STANDARD OF SERVICE. Shockinlgy unprofessional. The only personable/helpful staff members were Liz the concierge and Hector. Actually go out of their way to not help you. Won't make eye contact for fear of being asked to assist you in some way. Restaurant on property: NO NO NO!!! Don't bother. COOK IN YOUR ROOM! Rudest waitress - think she was the owner's daughter. Food was WAY OVER PRICED and drinks were weak. Grounds: The front looks like a country club well past its prime. The abondoned building is haunting it is so dilapidated. Abandoned guard shacks are an eye sore. Trash on the grounds. The pool is nice and beach is nice for PR. The water in the cove is beautiful. Surf is strong in the middle of the cove. Swimming is only acceptible on the right edge. The sand fleas are terrible at dusk and the locals crash the beach. The abandoned building and moldy lazy river mar the view from the balcony from the top floors. The view on the bottom floors is non-existant as the trees are in the way. Dorado: Unsafe feeling at night. Some places have to buzz you in to enter - Baskin Robbins for one. The locals for the most part are unfriendly and too proud to prioritize customer service. Plan to have meals in your room. There is a large grocery in town. Avoid the Amigo - no selection and unsafe. PR: Getting around is almost impossible to do on your own. For the most part no street signs and if you ask directions no one speaks English. Do not eat fast food. DO NOT go to the public beaches. PACK YOUR LUNCHES or patronize the high end restaurants. Do not believe the Frommer's guide. Not related to the hotel but a note I thought I should make: CULEBRA: Do NOT try to take the ferry as suggested by the HYATT concierge. Not going to happen - I do not care if you sleep in line. Book a boat tour (we used East Island Excursions). Flaminco Beach - A MUST SEE. Had an amazing snorkling experience. HYATT: What is going on at this property? If this is some sort of co-effort on your part it is not working out in your favor. NOT what I expect from a HYATT property. Not up to your standards and well below par for a Hyatt Vacation Club option. You should be ashamed of yourselves.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“The stench is overwhelming”", "Author": "Laurcus", "ReviewID": "UR115434929", "Content": "I could not be more grossed out by a hotel than this one. The smell is unbearable... I can't even fall asleep because the stench is so bad and it makes me physically nauseated to inhale. Id prefer motel 6. I cannot express in words the terrible stench here.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Old and outdated but great beach”", "Author": "hannahneal88", "ReviewID": "UR115269099", "Content": "My new husband and I went on our honeymoon to Puerto Rico. His grandparents traded a week through their timeshare. We did not have an option of where to go so we were just glad to have a free honeymoon. I had read reviews on here and seen pictures so I was not completely surprised by how outdated the place was. The room was very musty and stayed that way throughout our stay. VERY outdated and very uncomfortable sleeping. We wore our shoes the whole time we were in the room because the floor felt gross. Everything in the room (we stayed in a studio) was outdated and not appealing. We were on the top floor so we had an amazing view of the ocean, not everyone was as lucky because there are a lot of trees blocking the view for the lower rooms. We were not bothered by the abandoned building next door - there are so many trees you can barely tell it is there. The beach was great and very relaxing. Completely private and in a nice cove. We could see our feet in the water and the temperature was great! We always had lounge chairs available to us and did not have to get out to the beach super early to get them. There were ALOT of families there which I was surprised by. It seemed like a lot of them were from the Puerto Rico surrounding areas. The pool was very busy during the day full of young families. We stuck to the beach except at night we would occasionally swim. The \"tiki\" bar on site has pretty decent food but gave me very bad heartburn every time I ate there (lots of fried food). We ventured out a little but not much because we did not feel comfortable renting a car just the two of us. We had John (Monty) take us to the places we wanted to go. He runs a tour and cab service in the lobby and was AMAZING. We arranged to have him pick us up at the airport when we got there and he took us to the grocery to get some basic items before taking us to the hotel. We HIGHLY recommend using him to get you places. We ate at The Greenhouse Cafe and Pika (same people who own the \"tiki\" bar at the Hyatt). We had great food at both. We went to the casino nearby that is part of another hotel and it was nice and new, but very small. Overall it was very relaxing on the beach but the room just kind of ruined it along with the heartburn from the tiki bar. I would not recommend this for a honeymoon if you are looking for luxury.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Grand Haven, Michigan", "Title": "“Great spot. Would go back”", "Author": "MEG52673", "ReviewID": "UR115010300", "Content": "We were looking for a quiet, uncrowded place to enjoy the weather and relax during spring break. We found it at the Hyatt Hacienda. Our 2 bedroom condo was very comfortable and suited our needs very well. We found excellent restaurants in the area and convenient grocery stores to supply us for breakfast and lunch. The staff was friendly and helpful.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Cincinnati", "Title": "“Beautiful views but lots of issues....”", "Author": "RF2009", "ReviewID": "UR114687136", "Content": "My wife and I recently visited Puerto Rico for the first time and stayed at the Hyatt Hacienda Del Mar. On first view, we were favorably impressed with this ocean front property and general facities. However, it was soon evident that this property has not been maintained up to Hyatt's normal standards and that the adjoining hotel, casino and shared amenities (water slide) have been closed for several years. On closer inspection, the lobby and guest rooms are in need of serious updating; ranging from a fresh coat of paint to new mattress and bedding, to a serious overhaul of the air conditioning. More specifically, our room and bathroom could have benefited from a serious, in-depth cleaning. We learned that the adjoining properties have been acquired by a new developer and will be demolished and then rebuilt over the next few years. We were also informed that the Hyatt intends to update the Hacienda Del Mar in conjunction with the redevelopment of the adjoining properties. From our perspective, the demolition and construction of a new hotel and casino will be extremely noisy and not a very restful environment for a vacation. I doubt my wife and I will return to the Hacienda Del Mar in the foreseeable future.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "west palm beach, florida", "Title": "“NEVER AGAIN!!!”", "Author": "KJMB", "ReviewID": "UR112178204", "Content": "HORRIBLE!!! DO NOT WASTE YOUR TRADE WITH THIS PLACE! Check in is at 4:00! The front desk would not let me check in until 5:00 PM, repeatedly saying the room is being cleaned....then move me to another room??? NOPE, they refused saying that only certain rooms are available for people who exchange into hyatt. OMG...then at check out they are banging on your door BEFORE 10AM when check out is at 10am....DO NOT I REPEAT DO NOT WASTE YOUR WEEK ON THIS PLACE! the inside of the unit is so outdated, from the 70's...worn out old! the kitchen has fake cabinet fronts that do not open, and again are all worn out....the shower is tiny and has a dirty old curtain on it. and worn out old uncleanable grout/tile....the metal shelf in the shower is all tarnished and old....IT IS JUST AN OLD OLD OUTDATED PLACE....I FEEL SO SORRY FOR THE OWNERS OF HERE! THE ENTIRE PLACE NEEDS TO BE GUTTED AND REDONE! IT DEFINATELY HAS POTENTIAL BUT DOES NOT MEET UP TO HYATT STANDARDS!!!!! beds are old and lumpy, pillows are flat.....you can not see the ocean from your balcony as there are too many palm trees blocking the view!!! Bottom line, It is just tooo tooo OLD and outdated !", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Relaxing trip & good place if you have very young children”", "Author": "Jya-Jya", "ReviewID": "UR110760571", "Content": "I traveled with my Mom & 3 kids. My first child turned 4 when we were there and my twins were less than 9 months. Totting 3 small kids, I wanted a place with a kitchen & location on the beach so we would never have to leave the resort. This place had both and I was surprised by the size of the kiddie pool. They also have daily activities for young kids, like coloring contest, painting, family bingo, arts & crafts, etc. Before we arrived at the hotel we had the driver stop at the grocery store. I picked up bread & cold cuts, chicken wings, bagels & cream cheese, cereal, milk, salad, etc and a birthday cake & balloons for the birthday party. My mom ate at the resort restaurant once, but I never had to eat out! I did have some drinks though. They gave us 2 cribs and 2 high chairs for our stay which was also great! Our trip was easy & very relaxing. The only negative things were that the place did feel icky. I never mentioned the reviews to my mom about the place not feeling clean and she brought it up on her own. She said it's not cleaned well and had a mildew feeling/smell. One day the floor felt so yucky I couldn't even bare to take my shoes off. If any staff or owners read this I would like to suggest airing the place out and cleaning w/ bleach, ammonia, lysol etc after each stay. Also replacing the dark comforters with airy fluffy white ones will give it a more clean feel. Maybe doing the same for the curtains too! Of course it would be awesome if the bathrooms were updated too, but I understand this is not a luxury hotel so I can deal with it. Overall very relaxing trip and good for families. I don't think I'd come here if it was just me & my spouse or if our children were older (like preteen/teenage), but it met all my current needs and I would consider coming back.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Vineland, New Jersey", "Title": "“It was beautiful!!!”", "Author": "galop1979", "ReviewID": "UR107841677", "Content": "My spouse and I took our mother's for the week from 4/30 until 5/7/11. The beach was beautiful as well as the pool area. I enjoyed the gym and hot tub as well. The staff was excellent and very polite. Housekeeping needs some fine tuning as the floor felt dirty to me as well. Nonetheless we would stay there again because it was so peaceful and relaxing. The abandon building next door did not bother us at all. It gave us more beach area and more privacy to walk with my spouse. Down fall was that there was no night life in the area but again I say it was nice for relaxing with a drink. I definitely recommend this for those seeking a peaceful relaxing vacation by the pool or drinks. There was no time frame to use the pool since I did it almost every night until late. We enjoyed ourselves very much in this hotel.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "brooklyn NY", "Title": "“STILL A LOVELY GETAWAY FROM WINTER'S WRATH”", "Author": "bklynbiker", "ReviewID": "UR106588269", "Content": "Happy to see more recent reviews are better for the Hacienda, which means people must be reading the reviews and can tell whether the property is for them or not. We love our annual or biannual visits. Four nights/five days of lazing on the beach, swimming, reading, cooking and imbibing, watching DVDs at night, and listening to surf from our balcony or bedroom overnight. What more could one want? Oh, you mean blaring discos, drunken poolside parties and roving bands of youths traipsing through the lobby? If that's your holiday, go for it, but please stay elsewhere, you won't like it here. Just a pristine, uncrowded beach, lovely well kept grounds, gracious staff, very comfortable units (do yourself a favor if you're planning to spend most of your time at the resort, GO FOR the one bedroom, NOT the studio units, it's worth the upgrade in terms of $ or points) - and never NEVER had an issue with 'cleanliness' as some , not -quite so recent reviews have stated. And we've been here 1/2 a dozen times over the years.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "1.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“definitely Paradise ohh yeahhh”", "Author": "bubu42", "ReviewID": "UR102849930", "Content": "OMG it is one of the most quiet and beautiful places I have stayed at. We didnt even realize there was a building next door. Girls at the front desk 10+ very helpful, Divina and Nancy are amazing thanks for your charisma. Pool open 24 hours,beach uffff adorable. Plenty of restaurants nearby, Morena,The Greenhouse and Grappa the best ever. The kids had so much fun, the hotel offers daily activities for them,and they also enjoyed the miniature golf. We will definitely go back to the hotel oh yes.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St. Louis", "Title": "“Great vacation”", "Author": "kdgSt_Louis", "ReviewID": "UR102102023", "Content": "We recently stayed at the Hyatt through an exchange with Interval International. I was a little nervous reading some of the reviews, especially since we had traded our very nice 5-star resort in Cancun. We ended up being very pleased with the resort. The resort is nice, especially the pool and beach. The abandon hotel next door is very strange, but didn't really bother us. The beach was fantastic and since the hotel next door was closed, we had plenty of space and never felt crowded. The staff was very friendly and accommodating. The tennis courts and basketball court were also nice. We thought the food was good at the hotel restaurant and tried the newer Pike restaurant across the street, which was also good. Probably our biggest complaint was the housekeeping. The rooms were nice, but not well cleaned. The floors felt dirty, even after the one day of the week it was cleaned. I don't think the floors were mopped and we felt like we had to walk around with shoes on. Otherwise, we felt like the hotel was nice and clean outside of the rooms. We would definitely go back to this resort. It is not a luxury resort, but it is nice. The area, however, does not have really anything to do. There was really no shopping outside of discount and grocery stores. We had a our 12 year old and our 10 year old niece, which was fine for them. Older children and those wanting a night life would be disappointed.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lost River, West Virginia", "Title": "“A wonderful lazy kick-back and read a book comfy stay”", "Author": "Patrickbeau", "ReviewID": "UR99456208", "Content": "Staff was wonderful. The rooms were very clean and our view was fantastic. We met a lot of wonderful people and will go back again next February. There was never a time when we could not get a place by the pool or on the beach. Not crowded and the pool was wonderful. It was a great place to go and chill. If you want to have the freedom to travel about, just rent a car for the duration of your stay and enjoy. We got a Target rental for $219 total for two weeks. Plenty of places to eat in the area. Wish we were back there now.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pigeon, Michigan", "Title": "“relaxing.”", "Author": "mjmccormick41", "ReviewID": "UR99248813", "Content": "Like other reviews said, if you want a place to sit by the pool or beach, this is your place. The staff were very helpful and friendly. Never had to worry about saving a chair by pool or water. The day we left only 6 other people at beach. I would rent a car. best way to get around, we went to Old San Juan 3 times, wifes shopped, we exployred ,loved the culture , yes food is expensive, but wonderful, the 2 forts are a must see. Just wonder down the old cobble stone streets is a step back in time. Lots of great restranunts, shopping. See the Bacardi Rum Factory, had many free samples. Parked once in Cantoe, and took ferry, fifty cents oneway, ferry runs on island time. dont be in a hurry, . Yes the Del Mar is a little outdated, and the old hotel next door is an eyesord, but after a few days , you dont even notice it. Hate to admit it but did eat at Chilis in Dorado, new nice place. Went to outlet mall one rainy morning. very new , about 30 miles west on 22, some good places to eat, try Metropol. Would go back again to Dorado, looks like a great place to golf.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Delightful Vacation”", "Author": "kayway11", "ReviewID": "UR99179815", "Content": "We had a wonderful time. We are Marriott timeshare owners. Do not pay attention to those awful reviews. We were on the 5th floor in a one br condo. Clean as a pin..great view..quiet...no negatives from us... the closed hotel next door is absolutely not an issue. The beach is indescribable, the personnel are very nice competent and friendly. There are plenty of stores within less than a 10 min drive. Amigos is Walmart and very reasonable for groceries. On site restaurant great, the pool is immaculate. The facility was full and you would never know it. The beach was as great as Hawaii....do not pay attention to any bad reviews..it is a great place to spend a winter vacation.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“A great place to spend a week”", "Author": "pcr01", "ReviewID": "UR96656416", "Content": "Spent 9 days there in January. I continues to be a wonderful place to vacation. I go with my wife, three daughters, son in law and granddaughter. We had a wonderful time. I own there and go every year. Ivan the GM is a great guy and is always around looking to make things better. The young ladies at the desk are first class, they are friendly, they care and give great sevice. We found a great resteraunt in Dorado, Grappa is the name, it is great. There is a meat store, Hacienda behind Walgreens that sells great meats. They ;have gas grills that are great to use. The Beach is great and the pool is nice. Tje [;ace is not luxerious it is just nice. Can't wait to go back.. If you go and play golf, look for my golf balls, I lost a lot of them..", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Myrtle Beach, SC", "Title": "“Had a wondeful time”", "Author": "carolinagirl50", "ReviewID": "UR96074529", "Content": "This Hyatt timeshare is definately coming back and we had a great time. Everyone treated us wonderful. The area is being rebuilt and things are no longer in limbo land. The beach was great. There is a nice little open air restaurant on the beach where you can get 3 meals a day. I own there and I'm going back next year.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Nice Hotel, not a great area”", "Author": "elroy74", "ReviewID": "UR95895308", "Content": "First, the vacant hotel next door is a little weird. It does not take away from the stay, but it is just strange to see the property sitting vacant. I spoke with someone involved with the property that said Fairmont Hotel has signed a contract to manage a new hotel there, but the are tearing down the old one once financing is in place. This is still a long way off. ROOMS: Now, the rooms at the hotel were very nice. We stayed on the 7th floor and had a full two bedroom. Nice rooms, very clean, and great kitchen/dining space. The balconies were great, and faced the pool area/ocean. The kitchen could use a little more in the way of plates and utensils, but overall, it was pretty good. The housekeeping came once during the week on Tuesday. You are able to request clean towels, but this is a time share/rental property and not a hotel. We requested a crib, high chair and extra pillows, and all requests were met. The staff at the front desk did a nice job trynig to help us with any requests. POOL/BEACH: The pool was nice, but it is not heated. This was a little issue for the kiddie pool, as it was very cold the first two days. The staff did an average job is cleaning out the pools. One morning the kiddie pool was closed for cleaning. I only question the timing of this, as if it had been done earlier, it would have not cut into the morning as much as it did. There is only one towel station, and it is next to the beach. You need to give a room number and they write a ticket for the towels you take. THere is a $25 charge if you do not return the towel. Make sure to get your ticket back! You can also get a towel at the front desk, but only when the towel shack is not open. Not the best set-up. FOOD: There is one resturant on property. It is a small beach/poolside bar/resturant. The food was fine, basic and easy. My one MAJOR issue was the birds. There was bird poop all over the chairs. It was kind of gross. One night the woman working there told us we were not allowed to take food to go. We mentioned to the staff at the desk and they said they would address. The propert also has two gas grills you can reserve. We cooked steak one night. You have to reserve yout time at the front desk, and they give you the grilling tools. There are two grocery stores near the resort. One is in Dorado Central, called Supermax or something. The other is much closer, near a resturant called the Chop House. We only found the second one on the last day. It is closer to the resort, and everyone there spoke english. The Supermax was more of a drive through a busy area. The staff sent us to a couple of resturants. Villa De Alberto was good, but a little pricey. Sweet Ann's Cakes was a very good lunch spot. We also ate the the Chop House, which is a Hibachi style Asian resturant. There is a lot more variety in San Juan, but that is a bit of a trip. All in all we had a very good time at the resort. We even received a discount on golf at the Dorado Beach Resort as Hyatt guests. The biggest issue was the area around the Hyatt. It has a lot of fast food, and not a lot to do. If you are going to stay in, cook, and relax by the pool/beach, it is perfect. If you are looking for nice dinners, and night life, this is not really the spot. I do not hold this against the hotel, because it is not what we wanted. We were very happy with our trip. Would I go back? Not sure. May try something a little closer to San Juan if we head back down.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“A quiet, lovely place”", "Author": "dwaxy", "ReviewID": "UR95091703", "Content": "I just got back from the Hyatt with my wife, four children (ranging between 7 and 14 years old) and mother. I almost feel compelled to write to respond to the last negative review. We all had a terrific time. The rooms were spacious and clean (no mold). The units come with a full ktichen including a full sized fridge. We took full advanatge and ate most of our meals in the dining area. The pool area was lovely and never overrun by people. There were always plenty of towels available. My kids loved the hottubs and used them frequently. The hotel has its own private beach which was similarly lovely. The sand was soft and clean. There were never too many people on the beach and we never felt crowded. The water was clear and not too cold. The tennis courts were in perfect shape. We play tennis regularly back home and had no issue whatosever with the courts. We played night tennis as the courts have lights and stay open late. The closed hotel next door was not an eyesore and posed no problems. Dorado is an attractive area about 35-45 minutes from San Juan. It has plenty of shops and a fully stocked supermarket. Overall, if you are looking for a quiet, fully furnished place to stay away from the hustle and bustle of San Juan, I highly recommend the Hyatt.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“FORGOTTEN by the Hyatt”", "Author": "acrossthepond7", "ReviewID": "UR93672563", "Content": "Where to start!! I have never written a review, but my experience was so bad, I felt compelled to alert other travelers of this hotel. I read all the reviews that I could before we headed to Dorado's Hyatt Hacienda Del Mar. This is also a TimeShare location for Marriott and other hotel chains. We go on big family trip through my parent's Time Share, so we don't get to choose the location or hotel. This was the MOST disappointing experience we have ever had. All those reviews that have a negative tone are RIGHT!! I have never been to a Time Share location that is in such poor condition. It looks FORGOTTEN and almost ABANDONED. No wonder all the hotel pictures on the website are taken at NIGHT!! Driving into the location, it looks completely under maintained. It was definitely the place to be, back in the day, but now it looks completely neglected and rundown. We all joked that is was like something out of the show LOST. There was this creepy presence of the deserted hotel next door that used to share the grounds and pools together. Now there is a big green fence separating the two. The amazing pools and giant water slide looked great, but now over grown and deserted it supplies a very eerie presence. FOOD: There was only one outdoor bar eatery, that was it. Had to rent a car to get groceries or eat out 99% of the time. Cabbing it was way TOO EXPENSIVE. ROOMS: are outdated, dirty, musty and moldy. We have small children (2 yrs, 4yrs.). We were horrified at the dust, mold, etc. It really made my skin crawl. Everyone (all 4 of us) developed a respiratory cough from the moldy A/C in our room. Had to sleep without any air to get some relief. There were holes in sheets and blankets. Not enough staff to clearly maintain hotel properly. AMENITIES: lounging and tableware is totally beat up and old looking. Pools were dirty and not cleaned, until some staff member threw in a ridiculous amount of chlorine in the morning, making the pool very cloudy and personally unusable. Jacuzzis were luke warm and the other one was broken the entire trip. The kids playground had been demolished from a storm and sat in a heap off to the side of the volleyball court with caution tape around it. They started to put it together the day before we left. There are no activities or kids club at the hotel. Tennis courts and mini- golf haven't been touched in years. The paint is chipping off of everything, it's really depressing looking. Staff is generally nice and lucky to have a job once the other hotel closed, so you feel bad. They mean well, but it should not be classified as a 4 star luxury resort. All the guests were very upset and mad about what was promised and what was delivered. A guest got her iphone stolen next to the hotel coffee machine at 7:30am after working out in the small hotel gym. This hotel has been acquired by a private company and it should not be considered a HYATT. It is at best 2 stars. IT seems to be the place to go if you are from Puerto Rico. At the end of our vacation. There were tons of locals checking in. Bringing all their laundry, bringing coolers to the pool, bringing there own radios to blast poolside. I did NOT feel like I was at a luxury resort, like it is advertised. It really ruined our trip and caused a great deal of stress. Positives: We had great weather (thank god), the beach is really nice. that's it! We would NEVER return to this Hotel. It was FALSE Advertising! Time Share Interval Award Winner 2010 displayed at the front desk made us all laugh, what a joke. Dorado the city is definitely on the upswing though. Beautiful beaches! They are tearing down old hotels and putting up beautiful condos, championship golf courses, a Ritz Time Share, more eateries, etc. Maybe a place to visit in a few years, once they have it together, but not at that hotel.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fargo, North Dakota", "Title": "“Fantastic Beach! Great place to relax. Everything you need is a cab ride away.”", "Author": "Dre35", "ReviewID": "UR91868411", "Content": "I have stayed here twice in the past year. This is a great place if you want a relaxing vacation (which is exactly what I was looking for). Many reviews talk about this place being secluded. I wouldn't describe it that way. However, you should know what this place is and what it is not. It is not near any thriving commercial areas. If you want to walk to a fantastic restaurant , you cannot. If you want to party all night and walk back to your hotel, this is not the place. All of those things can be had, but they are a cab ride away. First, the little bar/restaurant on the property can serve you food and drinks. The management of this little tiki bar has changed in the past year. I thought it was fantastic food with fantastic service PRIOR to the change. Now, the product and the service are decidedly subpar. But for a beer or 12, they do a good job. There is a restaurant and pub across the street which serves good food and drinks (run by the same people as the little tiki bar, but much better food and service, ironically). If you take a $10 cab ride into Dorado (about 5 minutes), you can choose from the restaurants and bars there. You must visit the Chophouse! Great food and great people that run the place. There are a couple of bars that are great fun on the weekends, but dead during the week (We watched Monday night football there and were literally the only people there). For more than that, you have to travel into San Juan, which is a $60 and 45 minute cab ride (one way). If you can, stay in San Juan for a night or two upon arrival or prior to leaving. That will allow you to do everything you want there without taking time during your stay in Dorado. This cabbing around might be a problem if it weren't for the cab drivers they have on call here. You can plan your day with these guys and they will be where they say they'll just show up wherever you are whenever you planned it. They are fantastic! (that ones for you, Felix!) I should also mention that the hotel staff has provided me with fantastic, above-the-call-of-duty type of service. If you need anything at all, they can--and will--help. Lastly, some reviewers are critical of the rooms. Yes, I too have stayed at many Hyatts across the country, and this was probably the lowest quality room of them all. However, I have also stayed at alot of limited service places around the country, and this is on par with the best of those. The beds are comfortable, the water is hot. And, oh yeah, its in a tropical paradise, so i'll happily take this over the Hyatt Regency in Minneapolis any day of February. All things considered, I think this is a great place to have a relaxing vacation, with all the dining/dancing/partying you want an arms length away. And by the way, the beach here is one of the best you will stumble upon in Puerto Rico.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Very nice property and friendly staff”", "Author": "travelorWisconsin", "ReviewID": "UR87430736", "Content": "We stayed for for 5 nights with 7 total (3 kids and 4 adults) in a 2 BR 2 Bath suite that sleeps eight. Rooms were clean and the $189/ night rate was a bargain. Pool area was a lot of fun, well maintained and clean. Great beach with huge wave action. The resort is a bit removed from the town, so you'll need transportation to leave the resort. We have family in Dorado so that was not a problem for us. We needed the extra sleeping capacity for overflow. Our other 2 grandchildren joined us to partake in the fun during the daytime. The old Cerromar complex next door is closed and in the process of being transformed or torn down. We really didn't notice much because of the palm trees and fencing separating the two properties.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“AMAZING HOTEL!!! 2nd Floor Studio”", "Author": "XXTRISHXX", "ReviewID": "UR86451853", "Content": "I have been trying to submit my review for some time now...every time I upload the photo's it times out on me. It will not let me add any of my photos of the room, the beach or the grounds, I have tons of photos but it will only let me add one of the beach...sorry! My husband and I live in Puerto Rico and are constantly going on weekend getaways. This hotel is by far the BEST we have ever stayed in! We booked online and saved money as opposed to calling in and booking. We booked a studio and was given the 2nd floor. The view was obstructed with palm trees, but that only added to the peaceful and relaxing time we had, we could see the ocean through the trees, and it was pure bliss. The best part was the 24 hour pool and jacuzzi access, and the 24 hour beach access. It was as if we had the entire pool and beach to ourselves! The staff was amazing, friendly and very warm and welcoming, very eager to answer any questions we had. Shani (spelling) was amazing and went out of her way to make sure all my questions were answered, she was very friendly and always welcomed me with a smile and a \"Good Morning\". We were leery on staying here after reading some of the reviews about it smelling musty/moldy, but we are so happy that we decided to try it out for ourselves. We were very happy to see that the entire hotel was well maintained, clean and quiet. This weekend was pure rest and relaxation and we loved it so much we decided to go back the following week (another review to follow with photos). This hotel is not good if you are looking for the party nightlife, it is in Dorado and there is not much to do outside the hotel at night. There are some places to go that are close by, there is Applebees restaurant, Starbucks, Sweet Anne Cakes, Wendy's, CVS, Walgreens, Pizza Hut, and a supermarket, as well as some other small stores. The hotel had three tennis courts and a golf course, but we were too busy relaxing to check them out. The also had a spa, but once again, we were too relaxed to use it, (maybe next time). If you are looking for a nice and relaxing, quiet, romantic and peaceful vacation, then this hotel is for you! I would highly suggest this hotel, it has all that and then some! But if you are looking for the partying nightlife, loud and obnoxious style of nights, then do not stay here you will be disappointed! This hotel is for the family who wants to discover Puerto Rico and have a wonderful and peaceful vacation! This hotel is very \"kid friendly\" although we don't have children, we did notice some families having a wonderful time. The pool is open 24 hours and is large enough to have your own \"private section\" during the day. At night we enjoyed the entire pool all to ourselves! The only downside was the parking, but we always managed to find a spot not too far from the front doors. The parking is free and well lite, security is constantly making their rounds, but not overbearing.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston", "Title": "“Perfect stay !!!”", "Author": "traveler_with_babies", "ReviewID": "UR86403549", "Content": "Here goes, the latest on this hotel. Dorado is about 40 min. drive from San Juan. I would advice for most of you guys to rent a car. It's very easy to drive and there are so many diff. places to see. To go to El Yunque/ Luquillo, or to the coffee town (ponce) or to Guayate (rosted pig street), you'll have to drive from Dorado into San Juan and take express way (I wouldn't use regular road because of the traffic) that would then route to other cities. That add about 30 min to your time. Make sure you have have enough coins/ cash for tollways. The hotel was kind of hard to find even using GPS. We find the room was clean and the kitchen was well equiped. The hotel is old but not too old. The rooms are clean and the view was great. We stayed on the 5th floor which has a great view of the ocean and the pool area. The hotel next door is under renovation. We didn't find any loud noise that would disturb us in any way. The staff were nice and prompted with all of our requests. The bathrooms were clean. The kiddie pool was cloudy and dirty looking. The adult pool was fabulous. We spent most of the time in the adult pool and the beach. Nice beach, with lough chairs every where. It was not crowded at all. The location was great. It was down the street to a shopping strip (Applebees, popeyes, pizza hut) We didn't eat there since it was too american for us. We wanted more puerto rican so we would drive to San Juan or other cities for lunch and buy food for dinner. We also went to Amigo (Walmart owned) grocery store not too far from the hotel and bought some snack, beers, and grocery. Don't forget to buy some puerto rican coffee back... They are good and they sell them at Amigo. Found some nice souvernirs at Walgreens. We didn't have time to go to a proper souvenirs shop. Would definitely come back when the kids are bigger to do some real exploring of puerto rico. So, basically, if you're down with comfort, laid back, and no worries, this is the place. Little kids (mine are 5,2, 1) had fun here. I would just come here just for the beach. If you're looking for party, night life, and loud young people in bikinis... this is not it... you'll see grandparents with their grand kids, families, little babies.....That's why we went there in the first place.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Relaxing hideaway”", "Author": "Elana31", "ReviewID": "UR85040660", "Content": "I really enjoyed my stay at the Hyatt Hacienda. This is certainly not the fanciest hotel but it had everything we needed and was a good location- outside the hustle and bustle of San Juan or the typical resort areas but convenient enough to all the activities we were interested in (i.e. rain forest, kayaking, etc.). The beach at the hotel was incredible-probably the best one we saw anywhere on the island! You really do need a car to stay here though.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "levittown,p.a.", "Title": "“this is the place”", "Author": "flowman69", "ReviewID": "UR81022734", "Content": "the place is great ,i dont know about anyone else . But i did relaxe and rested i work hard and im always looking for a place to unwind . i found it i would return again we only had one problem . the elevators broke down ! and the ataff went all out to help me . they even sent me help to bring my stuff down . the front desk staff not only went out of thier way to help you . they would talk to you I have been to plenty of resorts . you ask a question they answer it and blow you off. this place they talk to you like a person .im already going on line to book anothr week . well got to go to work see ya", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "lexington, ky", "Title": "“Great relaxing trip”", "Author": "starkey1981", "ReviewID": "UR80889595", "Content": "We had a great time. We wanted a place to 'relax and get away' from it all. This is the place. It's a shame that the hotel next door is no longer open and 'walled off' since the pool areas were 'one in the same' at some point in time. But, that didn't make the stay bad. In fact, it seemed to make it better. Pool, hot tubs, and beach were AWESOME!!!! Plus, we were here during Hurricane season and so the weather was iffy on some days, but mostly it was just relaxing!! Choose this hotel is you want seclusion, a great staff (SOOO accommodating and friendly) and a really relaxing stay!! The rooms were in good shape and we couldn't have asked for a more relaxing trip. Hope the hotel (which seems to be going through some sort of reno next door) reopens and again 'shares' pool areas so that they both are successful!", "Date": "September 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Had a good time but marred by incident”", "Author": "Geri168", "ReviewID": "UR77598678", "Content": "This is our second stay at this Hyatt. We found the hotel to be nice and quiet. We enjoyed the beach and the pool without the crowds. We were there with 3 other families so we made it alot of fun. An incident during our vacation upset the remainder of our trip. Our son left his camera by the ping pong table and when he came back it was gone. Granted it was wrong of him to leave something valuable behind, but we would think that someone would be decent enough to return it. We reported it to the front desk and was told that they would call if anyone dropped it off. We did not receive a call, but we did check each day. We are very sad to lose those pictures and the camera and it ruined our time on vacation. It was difficult to look at the other guests and employees and keep thinking if any of those people kept the camera. We hoped that person would do the decent thing and return the camera, but we returned home without it. Again we were having fun until this incident.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Los Angeles, California, USA", "Title": "“Hyatt's Forgot this resort ! Wake up and spend the money owners give for maintainance ...”", "Author": "Farmacist1", "ReviewID": "UR72201171", "Content": "I am an owner of Hyatt Resorts. I just gotten back from Hyatt Hacienda Del Mar as my second vist with my wife and two kids and 2 family friends. My first visit was 4 years ago. The difference is astronomical. The place is extremely dirty and run down. Rooms are dusty, mold in the bathrooms, hair behind the doors and just dirty. Mattress was so old, we could feel the springs. All old equipments and nothing is being kept up. They closed down the lazy river because Hyatt sold the next door building including the lazy river and the pools except ome olympic pool !!! Still advertised on the picture of their website (falce advertistment). Service was just ok. Only one reseurants on the beach... food is cheap and horrible. The one and only good thing about this about this resort was the beach !!!! NOTING ELSE ... This is no longer a HYATT with no standards of any rate.......It might pass for a 2 star hotel !!!!", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barranquitas, Puerto Rico", "Title": "“Great place, I would go back again”", "Author": "alextm21", "ReviewID": "UR71491124", "Content": "During my stay this past weekend at the Hyatt Hacienda del Mar at Dorado I got a really good stay. Here I go with the positives and the negatives about my stay at the Hotel. Positive: â€¢ The personnel and the service was good from the moment that we arrive until the moment with check out. â€¢ The pool was a good place to relaxed and it was open 24 hours. They have 2 Jacuzzis, on pool for kids and the big Olympic pool. If you donâ€™t mind to have a kids running around the pool, you will enjoy the pool. â€¢ The room was clean and with everything they say it would have. I got the big room, with one king bed, full kitchen, 2 tv, one sofa bed, Jacuzzi, pool and beach view (floor 5). The would go and made room service every day, leaving new towels. â€¢ Free towels at the pool â€¢ The food at the Beach Bohio was good and decent prices, they offer breakfast, lunch and dinner, donâ€™t need to buy food outside. â€¢ For people that like playing Golf, Tennis, Basketball, Ping Pong and Beach Volleyball, they got good courts to do that. â€¢ If you want a smoke free environment, this is the place for you. If you are a smoker donâ€™t bother go there. Negative: â€¢ The hotel looks old, but itâ€™s a old hotel so, donâ€™t expect a 5 star hotel view. â€¢ Only one security guard was harassing people by the pool. I know that the pool say no diving, but everyone was doing it so I took one dive and she went right directly to me in a bad mood saying that thereâ€™s no diving, I just ignored here and continue talking to my wife and she the guard keep stand by pool side expecting me to react to her, but from my side no reaction so she leave, then a few minutes after that I saw here stopping people walking to ask what the were doing, thatâ€™s from me is a red card for here, but beside that â€œsecurity guardâ€� the rest of the personnel was good. â€¢ The Beach Bohio (the rest.) closed around 8:00 pm (the kitchen) and the bar closed around 8:30 pm, they should be open until 10:30pm kitchen and the bar until 11:00pm at least. â€¢ The hotel by the side the former Cerro Mar Beach Hotel is closed and makes the Hyatt Hacienda del Mar looks a little bit uglier than really is. I ask about what are the plans for the hotel and they really donâ€™t know. â€¢ Free parking, but the parking near the golf course is deteriorated Beside those things, I would recommend this hotel for people that just want to relax in a place near the beach with pool 24 hours, near of shopping malls, restaurants, movies theater and other amenities that the town of Dorado has to offer, about 25 minutes from a San Juan, I thinks this would be the place for you, but if you are looking for a Party mode hotel or expecting the 5 star hotel, you should search another place.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very disappointed! Not the Hyatt quality and service we expected!!”", "Author": "family1st_89", "ReviewID": "UR69545926", "Content": "We had fun on this vacation because of company, my family and my sister's family, and the places we visited in PR, but we were so disappointed in this Hyatt resort. This not the Hyatt quality and service that we have always had in previous vacations. The place is outdated and it is next door to an abandoned resort covered by a green tarp, such an eye sore!! The restaurant by the pool has poor quality of food and service is very slow. The rooms are poorly maintained, outdated and not that clean. Over-all resort service is poor. I had so much confidence in Hyatt until I went to this resort.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“It was relaxing despite the weather”", "Author": "PWRBECKS", "ReviewID": "UR68723438", "Content": "I decided to stay at this location mainly because as a child I spent a lot of time there when it used to be the Cerromar Hotel and also at it's sister property the Dorado Beach. I was sadden to see what had become of the Cerromar's main building and pool which is now abandoned. However, I was pleasantly surprised that the beach remained as beautiful as I remembered. I stayed at a studio apt, the room was clean, the A/C worked, had a safe in the room, washer and dryer available, and other amenities. The pool area is large, with two Jacuzzis, ping pong tables, and a pool/beachside cabana restaurant/bar with limited breakfast, lunch and dinner menu. The weather did not cooperate much since there were a few tropical waves looming in the area. However, I was able to relax and have some quiet time which is what I wanted. I feel bad for those guest that experienced bad service, as that's not typical for the island. Dorado is a small town with nice beaches, really accessible to the SJ nightlife and fine restaurants, also accessible to shopping outlets and other recreational activities. If you are looking for an active scene hotel stay this is not the place for you. If you want to chillax for a few days by all means stay here.", "Date": "June 26, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Rooms": "1", "Service": "1", "Location": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“This place !a dump!”", "Author": "TSBN22", "ReviewID": "UR65770971", "Content": "This hotel does not meet the expectations of other Hyatt properties I have visitied. The rooms smell old and musty. The room had cobwebs. It is a dated property. The beach was unremarkable. It is best suited for locals with families. It is quite a way from San Juan. . I would not recommend this hotel to any of my friends looking for an island vacation getaway.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Completely Disappointing.”", "Author": "AdventureMillie", "ReviewID": "UR64991459", "Content": "We initially booked another private home in Dorado for our honeymoon. Upon arriving in Puerto Rico we checked our voicemail to hear that our booked accommodation was \"no longer available\"...and they recommended we check out the Hyatt. We called the Hyatt from the airport to see if there was any availability, and they said that they did and miraculously it was in our budget. We immediately made our reservation and made our way to the car rental so we could get checked in as soon as possible. Here we are, one week later, completely dissapointed with our stay. Every day there has been someone knocking down our door at 9am, asking when we're leaving. One morning my husband answered the front door to find 3 men in the breezeway, demanding to know why he was not answering the phone, which had been ringing off the hook the entire time he was in the shower. Confused, he said he would be right down, only to learn that he had neglected to sign part of the paperwork. The front desk staff has treated us one of two ways: like we're criminals, with complete suspicion, or simply with indifference. On our second day in PR we found out our checking acct had been compromised and drained. We came up with an alternative payment method, and while we were explaining the situation and offering a new payment method, we were locked out of our room and ignored for close to 30 minutes. Meanwhile, they have my credit card and are not speaking to me? When they give it back, they don't say anything and continue to ignore us standing there. After another few minutes somebody looks at us accusingly and says \"Can I help you?\". \"Yes, we need our keys reprogrammed so we can get into our room.\" The woman then checks with 4 managers to make sure it's ok to let us in. We completely understand collateral needed, but what made our day worse (after finding out our checking account was empty) was being treated poorly while trying to remain communicative with the staff and openly offering another form of payment. The property itself now has no restaurant on site, features a dirty beach, an abandoned property, and our one bedroom suite smells musty. Our expectations for Hyatt have been completely quashed and we're currently considering moving our flight up so we won't have to deal with the daily disappointments. We've found Dorado to be equally disappointing, with local restaurants being unvelievably overpriced and the service poor. We've been eating in for the last 5 days because we almost feel like we're a burden to the residents of the area...although we've made every effort to be friendly and are speaking Spanish. I have visited and lived in other Latin American countries and never thought I would leave Puerto Rico feeling this way. The people, the accommodations, the service...I don't think we'll be back anytime soon.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“We Love This Condo”", "Author": "JoeBoston73", "ReviewID": "UR63342400", "Content": "Dorado is about 40 minutes from the San Juan airport. The advantage is that you are an easy ride from the central Puerto Rico attractions (caves, Arecibo, north coast beaches). You can also get into Old San Juan by taking the exit to the ferry off of toll road A22 ($1 toll). If you want to drive into Old San Juan, there are parking garages straight ahead as you enter the city (about $7). If you turn to the right (up the hill to the fort) you should circle around to municipal parking ($1.50 for 4 hours). Avoid parking up the hill as it is very challenging. Some of the reviews for the Hyatt were not too positive, however, we decided to go with the positive reviews and are glad we did. The staff was very friendly and helpful. We requested early check in and late checkout and they allowed both requests. There is an elevator in each of the two buildings and free wifi in the room (slow in the AM, better in the PM). There are two terminals off the lobby for guest use and these are much faster. The only problem I had was SKYPE was great as long as you turned your camera off. Otherwise, the throughput wasn't high enough to support webcam and voice for more than a few minutes. We had a 1 bedroom on the second floor. The view was of the pool and partial ocean which was very good, but next time we would request a higher floor to see more of the ocean. The rooms were very large and extremely comfortable. The bedroom has a TV and a balcony with table, chairs, and drying rack. It is adjacent to the whirlpool tub and bathroom sink with a long vanity and the closet that also holds the safe. There is a separate bathroom with another vanity sink, hair dryer, toilet, and shower that can be accessed from the bedroom or the full kitchen. The living room is very large and has a flat screen TV, DVD player, stereo, and a sofa that is also a bed. There is also a dining room table and chairs, and a large picture window. The kitchen is full sized with all the standard appliances and a counter with two stools. The outside alcove entrance has a stackable washer/dryer and under the sink is laundry and dishwasher detergent provided at no charge. The appliances consist of an electric stove, refrigerator/freezer, over the range microwave, toaster (faster than the one we have at home), and blender. There is a full compliment of pots, pans, dishes and silverware that we dishwashed every two days. The washer/dryer is shared with the adjoining studio and makes packing a breeze when you know you can wash your clothes on a regular basis. If you rent a two bedroom, you get the studio as your second bedroom and it has it's own bathroom and kitchenette. The pool is very large and very clean with many lounge chairs and some tables and umbrellas. It is nicely landscaped and the staff keeps the area very clean. The beach is very nice with many lounge chairs and large permanent umbrella shelters. The beach closest to the hotel can be rough when the tide comes in, but if you walk to your right toward the adjacent closed hotel, the ocean is very calm just before the spectacular rocks at the end. The closed hotel is fenced off by a green fence and is not an eyesore as was made out to be in previous reports. We were told that it was going to be torn down and a new Fairmont resort was going to be built on the site. The area is very quiet at night (our preference) and there are some wonderful local restaurants as well as excellent Puerto Rican take out stands. The Hyatt is a definite go-back destination.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Perfect place to relax... and relax!”", "Author": "HTravelerTexas", "ReviewID": "UR61839642", "Content": "Me and my wife stayed at this resort and it was exactly what we were looking for. A place with no clubs, no shopping centers or tourist traps... They keep it simple. a great room with an excellent ocean view (Ask for rooms with higher numbers, if not you will end up overlooking a close, condemned old hotel), a private beach with a natural reef where the big waves crash and then smooth into the little bay. The grounds are very well kept and the employees very nice and helpful. If you are looking for big city entertainment, please don't even look at this property. This is 20 minutes from San Juan, Isla Verde or Condado, which for me it was perfect. The bummer is that the bar inside the resort closes at 6:00PM, but if you go out of the hotel, turn right and drive about 8 minutes, you will find a great bar called \"El Corozo sports bar & grill\"... nice bar with tropical and live music on the weekends!. There is a lot of local beaches around if you get tired of the resort beach. Just ask the employees or any local, most of them know enough English to help you with directions.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wyncote, Pennsylvania", "Title": "“Beautiful location”", "Author": "tbearpa", "ReviewID": "UR59167004", "Content": "I was looking for a place on the beach with lovely grounds and got exactly that. The resort is about 40 minutes from San Juan, but there are plenty of signs to make it easy to find. The resort is on a secluded beach, quiet, peaceful, and the grounds are nicely maintained. Easy to get to a supermarket to stock up on food. While it is true that there is not a lot to do there, if what you are looking for is relaxation, that is what you will find. They do not charge a parking fee, the rooms were well appointed and they have a washer-dryer that you share with one other unit in the foyer. We were very pleasantly surprised and would go back again.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Houston", "Title": "“Second time here - it's worth the point value, but no more”", "Author": "amf5300", "ReviewID": "UR58804764", "Content": "This is our second time here. My husband said it is one of the lower point values for the Hyatt timeshares, so I would say it's worth the points. However, our \"home\" timeshare is Hyatt Wild Oak Ranch in San Antonio and, even though Texas is our home state, I must say the Wild Oak Ranch is much more enjoyable. We are here now - got here Sunday night. The first room we had smelled like mold and mildew so much that I couldn't sleep that night - nobody in the family could, either. The AC was not operating properly, so we changed units on Monday. This unit is better. We are enjoying our stay, and if you are content with being \"self-contained' and do not require a restaurant or much entertainment (except the pool and activities), you will be fine. I was a kid raised w/ no vacations, so my expectations may be lower than some people's expectations, but good Lord, it's obvious that Hyatt treats this property as the stepchild. Here are some of the negative comments I will share: *Floors are filthy (they were the first time, too)...so much so that it's constantly gritty. *After the overwhelming mold and mildew smell, I got a disinfectant and washed all the dishes in the new room and cleaned all the counters. *The sheets are pretty rough - feels like we're sleeping on burlap. *Overall unit is just not clean at all, so go buy a cleaner, do it yourself, and you'll be fine. GORGEOUS view from our room (and with all the rooms) - that is worth the visit :)", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Lovely. Ask for an apartment on a higher floor”", "Author": "SUVG", "ReviewID": "UR58411898", "Content": "We're just back from a vacation in Puerto Rico. We spent 3 days at the Hyatt, and then moved on to Rincon (Villa Cofresi). We have two young children (aged 3 and 1) so an apartment is our preferred option when traveling. We knew when making the booking that Dorado was not a lively hub, and that the area is pretty quiet, so no concerns about feeling isolated. We did see some folks taking taxis every evening to Old San Juan for dinner. It's about 20 mins away. I can't comment on any local restaurants, and we didn't dine at the poolside restaurant. Instead we stocked up on groceries at the Grande in Dorado, which worked out perfectly for us since our 1 year old cannot hold it together for an enjoyable restaurant experience. Pros: - Lovely, well equipped spacious two bedroom apartment with water views. We asked to be moved from the apartment originally assigned to us - it overlooked the abandoned building and overgrown garden next door. - Spotlessly clean - Great pool(s) for guests of all ages - Hot tubs - Good gym. The resort was not busy when we were there, so no issues getting on a treadmill during peak hours - Nice beach - Small shop on site for general goods - milk, candy etc - Despite stating in the Welcome Package that there is no daily housekeeping / trash removal, we had service every day - Free internet - Games room for the kids - Friendly staff - Free parking Cons - Gym does not open until 7AM - Coffee is available in the lobby between the hours of 7AM and 10AM. There's a sign requesting guests to limit themselves to one cup per day. Why not have that service all day? Overall a very nice experience and we would consider staying there again.", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "brooklyn NY", "Title": "“It all depends on what you like - it's perfect for us!”", "Author": "bklynbiker", "ReviewID": "UR58347512", "Content": "Always the same complaints about the Hacienda == there's nothing to 'do,' nothing 'around,' blah blah blah. Well, if you're looking for casinos, tacky Vegas style shows and karaoke, this isn't your place, it's true. On the other hand if you want a lovely, uncrowded beach, a lovely, uncrowded pool, and pleasant staff, well manicured grounds, warm breezes and are ready to just relax, it's perfect. A well equipped, spacious unit with DVD for nightime movies after a leisurely dinner on the terrace it just what stressed out city dwellers like us look for on a winter holiday. Bring some books, swim, stroll the beach, have a drink, CHILL! And if you really need activity, there's ping pong and a well maintained gym. The spa is quite nice, if modest, also. We come every year or two, and while we miss the river pool from the shuttered hotel and a few of the other amenities, we don't miss the crowds or thumping music from the nightclub! So know what you want and like, and you shouldnt have any complaints if you choose to stay here.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Warroad, MN", "Title": "“Great beach”", "Author": "AnnebWarroad_MN", "ReviewID": "UR57653684", "Content": "At one time this resort must have been very busy. As of now, there are 4 of the 6 buildings closed -possibly for renovation? This property is on a protected bay, the beach is gorgous, the snorkeling is fantastic and best of all- it's not busy!!! You can go to the beach at any time and grab a few chairs or tables. The beach was fairly clean but could have used a good raking. There is a small tiki bar that you can get sandwiches and a few drinks unfortunately it's not open all the time, closes down around 6:00pm. The food was very good though. The workout room was clean and had fairly new equipment, and also not busy. The pool was very nice, water was refreshing-not too hot and not too cold. The rooms were a bit outdated but was easily overlooked as the location is fantastic. Perfect if you want a nice quiet vacation without a lot of people.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Rhode Island", "Title": "“Heart Breaking”", "Author": "MGD0003", "ReviewID": "UR57380252", "Content": "This once a spectacular place but Hyatt Cerromar and Hyatt Vacation Club became greedy. This charge extremely high prices without maintaining the grounds, pools or service! I don't recommend this place to anyone unless you want to throw money out the window. I recommend Hyatt Corporation look into fixing this mess before suffering any additional embarrassing comments.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hillsborough, North Carolina", "Title": "“Not up to expectations for the Hyatt VC”", "Author": "MPMike0117", "ReviewID": "UR56248577", "Content": "I think we're in line with one of the other reviewers..... this facility is OK and would be the equivalent of a mid-priced hotel, but it's not anywhere near what we've experienced in other Vacation Club properties. The weather was absolutely perfect and that saved the day for us. Here are lists of positives and negatives we discovered: On the plus side..... - nice, private beach - good pool - fitness center is pretty large - decent equipment in fitness center- mostly LifeFitness brand. Good ellipticals. - weather was perfect (70s at night, sunny with 83-84 every day) - nice couple of hot tubs - Tennis courts and golf - Free wi-fi Now the problems..... - We were in a studio, which for every other HVC property is more than large enough for us. This was the size of a hotel room, with a microwave and mini-fridge wedged in to make up the 'kitchen'. No storage for non-refrigerated food, silverware and utensils wre stored in a jar of some sort. - Bad impression driving up.... the facility next door that was supposed to be torn down months ago is still there and that's right in front of you as you enter the grounds. - Our room (6th floor) actually was oriented toward the decrepit propery next door, so we got a great view of an empty hotel and its un-maintained grounds. - It's pretty far from the airport, so you almost have to rent a car. That's actually necessary, since there are no restaurants on the grounds other than the grill that's open a few hours a day next to the pool. - Not much to see nearby. although if you drive back to San Juan there are a few good attractions there. - We weren't aware of this and don't think it's the same at other HVC sites, but there was no housekeeping whatsoever. We had to take out our own trash, fetch our own towels when we needed them. Not a big deal, but very unexpected. - No desk in the room, so my PC needed to share a small table that was also used for eating. - No 'lazy river', which would have been excellent at this property. There was no variety in the swimming choices- one pool was it. All-in-all, we'll probably return next February based on the great weather we experienced. The point requirement was very reasonable, we'll know what to expect, and there are some activities we'd like to try that we didn't get to this time (rain forest, snorkeling, etc.).", "Date": "February 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Coronado, California", "Title": "“perfect view”", "Author": "JennileeRenee", "ReviewID": "UR56176191", "Content": "I loved my room, ground floor with a balcony and hammock. The little hermit crabs walking around the sand, the shade tree, very secluded and quieter than the sister property in Cerromar.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Puerto Rico", "Title": "“Pleasantly Surprised”", "Author": "needbettermattress", "ReviewID": "UR51336951", "Content": "We had a fantastic stay, the kids loved every minute. The miniature golf, tennis, ping pong, pool, air hockey, volleyball. The beach was lovely, it's a little rough, but manageable. The pool was great... The staff was extremely friendly and accommodating. We brought our groceries, didn't leave the property, till it was time to go. Very relaxing. We look forward to our next stay...", "Date": "December 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Cleveland, OH", "Title": "“Good Value - But Needs Some Updating”", "Author": "honeymooncanada", "ReviewID": "UR47002132", "Content": "We spend a week in the Hyatt Hacienda Del Mar. This is a time share property, but most people I think were just staying for the week without a time share. We stayed in a one bedroom unit. The place was clear but things like bedding, curtains and art work should be refreshed because they are showing their age. The room with the shower and toilet was really dark and the kitchen smelled like it had recently been sprayed for bugs. The staff was great - both at the front desk, the pool, and the cleaners. The property is on the small side, but very manageable if you have small kids. The week we were there the place was really dead in the evenings. I think it caters to families with youngs children or golfers who hit the course early in the day. When we were there, there was a small mini-mart for essentials and a beach hut for lunch and drinks - but that is the only on-site dining. We didn't mind because we used our kitchen for most breakfasts and lunch and ventured out for dinner. It will be great once the adjacent hotel is renovated and re-opened. Not sure of the timing of that.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Kansas", "Title": "“Strange place....Not what I expected from a Hyatt Vac. Club”", "Author": "quinttank", "ReviewID": "UR46865296", "Content": "I will give you the low-down on this from two sides. The first side is if you are accustomed to staying in other Hyatt vacation club (HVC) properties. If this is the case then this is not like any of the others. 1) Not as well kept. 2) NO activities or any useful guidance on things to do. 3) Not really close to anything (except for some very nice golf courses). 4) Most of the visitors on the weekend were locals....like 80% of the people in the place. We were there Thursday to Monday. On Friday hardly anyone was there and most of them looked to be owners or guests of the HVC.....Saturday was like the scene in the movie caddyshack (where they open the pool up for the caddies). The parking lot filled up, and locals will park three wide if there is room. Other than those things mentioned it does have a nice pool and a great (but rough) secluded private beach. If you are not accustomed to the Hyatt Vacation Club resorts you will find this adequate for stays near Dorado. I do not know what the prices are but I would pay around $75 to $100 a night for a place like this. Now for the three hundred pound gorilla in the room....What made this place so strange is the abandon Hotel and casino right next to it...(literally 6 feet from it). Folks...I would be shocked if this hotel is ever used again. I took some photos of it and looked at them when I got home...the hotel is in really bad shape. It is wide open and rusted to the point that the structural decay is past the price point of refurbishment. They have constructed a 8 foot fence with green material over it to hide the decay of the old hotel...for me it just made curious about what exactly happened or is planned. That is where I started noticing very different stories on what the plan is (from staff and locals). I believe they (Hyatt) lost a boat load of money in the casino and got out to stop the bleeding. The abandon hotel is very big and obscures your view from certain parts of the Del Mar property. Our room had a real nice view of the old hotel, and if we went to the balcony we could look left and see the ocean. I would take either a ground level room or something above 5th or 6th floor if you want a shot at good view. There is nothing to do or eat on the property. They have a little bar out by the beach that serves $6.50 beers and $7 drinks along with some mall food. You MUST have a car at this property. Driving in Puerto Rico is god awful. I was scared for my life several times...and I can drive. I have been to Jamaica, Cayman Islands....Texas, and have never seen stupid driving like this. The roads don't have lines on them and locals will just drive like idiots.....seriously when you get there look at how many of the cars have dents and dings. I was amazed at the poor roads and bad driving...I felt like I was in a third world country. We never found a good place to eat. The Pika place up the road was average and the drink prices were insane. Right before we left a local told me that the El Captain was great...never made it there. Sweet ann cakes is good and the Wendy's right next to it is just like home. I played the plantation courses (Surgercane & Pineapple) while I was there, and they were OK. For the price I would have expected GPS in the cart. The funny thing about those two course was that they were marginallly maintained and there were no hole layouts on the tee signs or the scorecard. I hit through some doglegs I just didn't know where there. So in short...Del Mar is the worst HVC property we have been to by far... Nothing to do in this area...Driving in PR is not for the faint of heart. All in all I would not go back for any reason.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Family friendly, beautiful views, pools, and lovely beach”", "Author": "slmgonz", "ReviewID": "UR46250234", "Content": "The waterfront location was ideal for swimming, sand play and lounging by the pool. We particularly enjoyed the room layout (bedroom separate from living area and kitchen) because it was easy to put our toddler to bed and still enjoy watching TV or enjoying a drink on the balcony. The staff were very accommodating and friendly and happily provided a crib for our room. The only downside is that during the time we visited there were no restaurants on site -- only a poolside grill. There were restaurants within driving distance, but it would have been nice to have at least one restaurant on site. We visited a nearby grocery and stocked up on breakfast foods and snacks -- having a fully stocked kitchen in the room was great! We plan to stay at this hotel again and have recommended it to family and friends.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“what was is NO more.”", "Author": "aplusthree", "ReviewID": "UR43915994", "Content": "5yrs ago this was the BEST resort in PR. You could eat in great restaurants, have a pina colada at pool bar,, ride the current down the slides, pass waterfalls, caves and jacuzzi of the most spectacular River Pool in the country,which all ended in an amazing pool overlooking an incredible beach. And then there was the Coco loco slide.HEAVEN!Now all you have is a pool, a deli/grocery, and the green monster- a tarp obtructing the ocean view from every possible angle. It's a ghost town and only had a 40% occupancy. Forget about restuarants, pool activities, bicycles, night life. There's absolutely nothing to do at this resort. It's sad, so sad.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Great Place”", "Author": "BuckeyePete77", "ReviewID": "UR31598054", "Content": "This place is GREAT! i had a one bedroom unit, with a full kitchen and one bedroom. The resort next door is closed, and being tore down in the next few weeks. Its very easy to get a spot on the beach all to yourself, the pool is great, and the staff was wonderfull. If you get the chance take the bike path to the incredible Dorado Beach and enjoy it all to yourself. There is a condo resort which was bought by the Ritz Carlton and is being torn down, but you'll have the whole beach to yourself...completely worth the two mile walk! My friends and I stayed in this resort for 5 of our 7 nights in PR, and would like to return to stay for a whole week. If you're looking for a place to stay to get away from it all, yet be close enough to Old San Juan, and still be able to make it to the West Coast this place is for you. My only negative thing I can think to say would be the pressure of the bathroom faucets, it would spray and splash onto the counter...but thats no problem all.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "4"}, "AuthorLocation": "arizona", "Title": "“Disappointing”", "Author": "osuna11", "ReviewID": "UR31256282", "Content": "This is definitly not the place for singles to stay. The hotel itself is very nice, the pool and beach are beautiful. Other than hanging out at the pool and jacuzzi, there is absolutely nothing to do. We stayed at this hotel because it was all we could get through my friends time share. They have a snack bar that serves american food and alcohol but it closes at 7pm. DO NOT WASTE YOUR MONEY THERE!!! I ordered chicken strips and a chicken wrap. The server heated up my strips in the oven, meaning they had already been deep fried previously. I barely ate half of one. Tasted horrible! I found a hair in the chicken wrap when i was taking the onions out. Could it get any worse??? I had to yell acrossthe place to get the waitresses attention because she was eating her lunch by the grill.(huge no! no!) She took the dish, sd it wasn't her hair, told the cook that is was probably mine(in Spanish) and then proceeded to hand me the bill, charging me for the wrap. I of coarsed questioned it and she said there was nothing left of the wrap so she still charged me. She ended up removing the charge but was rude and unprofessional stating now I know not to order the wrap next time. Horrible Service!!! Night security guard was also rude to us. The gentleman at the tour desk was very helpful and helped us with directions to attraction. I will never stay there again, no matter how good a deal I get. Stay in San Juan or cities to the east of San Juan. All the attractions are in Fajardo or close to it.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Spend more and stay somewhere nice and quiet”", "Author": "lakecity211", "ReviewID": "UR31025937", "Content": "Honestly this hotel was fine but, not great. I knew this location was away from the attractions in Puerto Rico so that was not a problem for me. The grounds are really nice and there are quite a few activities on the property. However, This hotel is not a typically Hyatt. A typical Hyatt is contemporary and has a luxurious feel. I thought the reason it was only $99.00 a night was because it was so far from the attractions. The real reason is because it is not that great. This hotel was more like a budget motel. I had a studio suite that had a small refrigerator, sink and microwave. The beds were just average with worn comforters. The rooms are dated and the furnishings are a bit worn. All of the rooms are outdoor corridor rooms which surprised me. When I walked to my room I noticed that there were two room numbers on the door. When I open the door I walked into a foyer which housed the two rooms which were displayed on the door. It is fine for families that want several rooms but, not great if you want peace and quiet. My neighbors played very loud music and constantly banged on the wall shaking my mirror. When I called to report them they just got louder. I never used the amenities like the pool because there were always a lot of very loud people using it. My room was far from the pool but, I could constantly hear people yelling. The staff was polite and helpful. It was a decent value for $99.00 a night and the grounds were really nice. However, that was it. This hotel would be nice for families on a budget or for someone that is not use to having much. It is not nice if you want peace and quiet along with relaxation. I would recommend finding a really nice bed and breakfast instead if you are like me and want something not overrun by families. I wouldnâ€™t say this is a bad hotel just not great. If this was a budget motel it would be excellent. However, for a Hyatt it is poor. In the future I would spend more money and stay at a nicer place where I donâ€™t have to worry about the noise.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Antonio", "Title": "“Stay at the Embassy Suites down the road instead”", "Author": "teamirish", "ReviewID": "UR29660895", "Content": "Rooms are outdated. Bed sheets were like sandpaper. If you stay there get towels from the pool and use those as bath towels, they are much softer. Service was average, nothing above and beyond the minimum. Maids came daily. The closed hotel next door looks is an eyesore and eerie. Our friends joked that it looks haunted. We asked the staff about the closed hotel and they said it has been closed many years. It is not maintained and there is debris all over that property (mostly from the palm trees). If you stay in Dorado, there is a great little restaurant called Pica (s/p? maybe Pika) about a block away from the Hyatt. It is FANTASTIC puerto rican food with reasonable prices. It doesn't look like much from the outside but is very nice inside and great food.", "Date": "May 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“Peace and Quietness”", "Author": "Helsinki1972", "ReviewID": "UR28545437", "Content": "We stayed 2 times during one trip in Hyatt Dorado. You need a car to get there (there is some buss transportation from/to airport, shops, San Juan, however, for the rest you're stuck). You can get very good deals through e.g. hotwire.com, so it shouldn't be a huge expense to have a car. The reason is that Hyatt Dorado not within walking distance from any shop, attraction, facility. Hyatt Dorado is approx. 45 min (no traffic jams) from San Juan International Airport. The hotel is very nice and peaceful. The rooms are fine and large enough. All rooms have view towards the sea. The rooms are clean and spacious. We had a standard room. It included a fridge, which came in very handy. Room is cleaned every day. We paid 99 US dollars. Parking is free. The people at the reception are very helpful and friendly. For the rest, the staff is \"invisible\" in the positive meaning of the word. You do not notice them, which makes it all very peaceful. There is no breakfast (! --- therefore the fridge is very handy) served. There is a pool bar, serving lunch. If you like burgers, hot dogs, etc, this is ok. Prices are reasonable. We did it 2-3 times, by lack of anything better. There is a small shop on the premises where you can buy basic necessities, as everywhere, overpriced. The pool area is large and nice. The beach is a beauty. And the biggest plus of the whole hotel and why we enjoyed it so much: even when it is busy, there are so many lounge chairs available! And lots of space to find a quiet place in the sun or shadow at the wonderful beach. This is so peaceful! Whether you sleep till 9am or 11am, you can be assured that there are plenty of lounge chairs waiting for you. What a difference with several other hotels. Towels provided, 2 for one person is not a problem. The hotel is about 10 minutes from Dorado, with some fast food options, Wallgreens and a large supermarket. About 30-40 min. from Prime Outlets Barceloneta (recommended!), about 35 min from Plaza Las Americas shopping centre and about 55 min from Old Town San Juan. All in all, really recommend this place, mainly because it is so peaceful and if you like to enjoy the sun and relax, this is just the place to be (for a very good 99USD deal!) ---> Currently they are either renovating or doing something else with half of the appartment complex (Hyatt Dorado is a time share place) and half of the appartment complex is not open and blocked by a green fence. Some people do not like this \"sight\", however, I assume you are faced towards the pool or the sea, so...what's the problem :)", "Date": "April 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "2", "Rooms": "2"}, "AuthorLocation": "new york", "Title": "“Good value, but you'll want more.”", "Author": "NewYorkArtteacher", "ReviewID": "UR28515989", "Content": "We stayed last week at the Hyatt in Dorado. The rooms (we had a two bedroom suite) were large. Kitchen well equiped. Bedding not new, caulk around tubs old. View out window was of creepy Hyatt that has been closed for a few years. We were on the 2nd floor so couldn't see ocean at all. Pool okay, hot tubs too hot. One restaurant/bar overrun by birds. Landscaping in need of mulch and some flowers. Some of the guests are time share owners, some were just visitors like us. For the price, you really can't beat it. On the ocean, with 2 bedrooms & pool. Location to San Juan & attractions a small drive but not bad. I would not stay there for more than a few nights- but would return knowing now what to expect. Staff was accomondating & helpful.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "san clemente, ca", "Title": "“Nice hotel, friendly people”", "Author": "durexj", "ReviewID": "UR27826329", "Content": "Stayed a week and found plenty to do. The staff is extremely friendly and the location and rooms are top notch. There are nice hikes in the area, like the 3 mile walk to a great restaurant, Hacienda del Sol at the Dorado Beach Country Club. The exercise room is well equipped, and there are tours that you can take of the rest of the island. There is a fine new restaurant less than a bolck from the gate called Pica. Very reasonable and good fresh food. I ate there three times and enjoyed spending time with the owners.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Mullica Hill, NJ", "Title": "“Be ready for solitude.”", "Author": "alaznj", "ReviewID": "UR27290828", "Content": "Yes, the beach and water are beautiful but everything else is barely mentionable. No restaurants in the vicinity or at the hotel. Only one bar, at the pool, and it closed by 7pm, sometimes earlier. However, it did serve munchies and burgers. Since there is no night life or dining at the resort be sure to rent a car. Waiting around for taxis is bothersome. But watch out for crazy drivers. The local supermarket is 10 minutes by car. Stock up and plan to cook. Applebee's and plenty of fast food also 10 minutes away. This is not the place for you if you are looking for action. If you are content with sunning, golf, tennis, and cooking, this would be the place for you.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Mesa, AZ", "Title": "“Depends what you want?”", "Author": "13Jomama", "ReviewID": "UR26607554", "Content": "If you want a location that's \"close to everything\", pick another location. If you want a resort that has all the comforts of home, a private beach, and plenty of peace and quiet - this is the best choice. The beach is surrounded with jungle on both ends - no other resorts or residences are viewable from the beach. The beach is clean with plenty of chairs for guests. The sea was a bit rough for swimming or snorkeling, but was crystal clear and just cool enough to enjoy. The pool and grounds are well maintained. The deserted hotel next door is no big deal. The rooms were spacious and aside from the spraying faucets in the sink, very well equipped and comfortable. The best views are on the upper floors - 5 through 8. If your room is lower than that and you're looking out at palm trees with no way to see the ocean. The staff was pleasant enough. One night I called to find a restaurant that would deliver pizza. I was given the number for Pizza Hut. I asked if there was perhaps another restaurant that served pizza, but didn't deliver. I was given another phone #. I asked where it was located and after waiting on hold for 5 minutes was told, \"it's probably in Dorado since it's a local phone number\". I asked where exactly and was told, \"I really don't know and no one else is here\". So much for world-class Hyatt service? Other than that I had no interaction with the staff other than passing by in the hallways or on the grounds. Golf is plentiful near the resort, but very expensive - upwards of $150 a round. As an experienced timeshare user, I know that exchanging outside of the US can sometimes be a crap shoot. I've learned the hard way to go with brand-names for international exchanges or to stay within your own timeshare \"family\". Therefore, the Hyatt was the best choice. Overall, it was better than other international exchanges I've done, but less than I expected from Hyatt.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great resort, trouble with one restaurant”", "Author": "PatfromNJ", "ReviewID": "UR26595294", "Content": "We loved our stay at the Hyatt. The value, we thought, was incredible and everybody was very nice. The only snag we ran into was one night when we ordered take-out food to be delivered from one of the restaurants that the people at the desk recommended. The person at the restaurant taking the order was rude and arrogant, and to make it worse the food was just so-so and overpriced in our opinion compared to other local restaurants. The name of the establishment: Trattoria da Nando - it's an Italian place.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“Decent, but should be a lot better.”", "Author": "skpr77", "ReviewID": "UR25957262", "Content": "Stayed a week through a timeshare exchange. Resort has some shortfalls that were a little surprising from a Hyatt. 1 Bedroom unit was nice and fairly well equipped. There were a couple design flaws that were a nuisance throughout my stay. First of all, there were food odors from other units coming through the A/C vents. It smelled like someone was cooking right in my kitchen. The toilet system is a vacuum system used quite frequently these days, but I could hear toilets upstairs, downstairs, next door, two floors up and down and further away. It was constant. And finally (in relation to the room) the faucets were aggravating as heck. They were these high powered stream type faucets. When you turn on the water, the force of these little high powered streams of water would hit the basin and by the time you were finished, you had water all over the entire sink and floor area and yourself for that matter. This sounds like a ridiculous complaint, but you had to see it, to believe it. OK, now on to the rest of the resort. Can't complain about the location of the resort because I knew about it before hand. Resort is isolated but also on a nice stretch of beach. The closed down resort next door is definitely an eyesore. They say the resort along with the river pool is under construction, but that isn't the case. No one is doing any work there at all. The beach palapa's are falling apart. I think Hyatt's biggest failure is that there is no real restaurant on location. The one place that serves food (hot dogs and hamburgers) and drinks is only open from lunch time to 6pm. The drinks are very expensive and even got ripped off by a bartender who was making 1 drink for me, when a second person approached and wanted the same drink, so the bartender added only more ice and poured the drink into 2 glasses. So I paid 8$ for a drink that only had half the amount of ingredients it was supposed to have. There is no music, happy hour, entertainment or anything that gives you that Caribbean Resort feel. All of the staff was great, which includes the Resort Manager Ivan who was assisting me with an ongoing problem with my purchase of a 4 day internet plan through Freedom Wireless. Took me 3 months to get it resolved and Ivan continued to offer assistance. I was told they have a new internet provider, but I would recommend that you not buy the internet plan if Freedom Wireless is still running it. All of the food on the island is great, but one restaurant was so good, I went back there again, is Restaurant El Capitan. It is in downtown Dorado. If you were coming from the Hyatt, when you get to the town of Dorado it is one block away from the main road on the right hand side in a little side neighborhood. (This street runs parallel to the main street) I tried to find an address that I could post, but can't locate one. This restaurant is only open from Thursday to Sunday. They serve every Puerto Rican delicacy with a lot of seafood selections at reasonable prices. Family run and they all speak English.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, IL", "Title": "“Great resort”", "Author": "GAchanta", "ReviewID": "UR24648742", "Content": "Our flights to San Juan were delayed and so we didn't end up at the hotel till well past 1:00AM. I had called ahead and the front desk had left the paperwork and keys with the one security guard who looks after the main building after dark (if he is out loafing around the property, it could take a long time before you ever find him). The room (studio) was on the 8th floor (requested previously) and the view from the room/balcony was fabulous. The room was well equipped and excellent value for $99. The gift shop is a rip off and the bar/restaurant is a joke. The bar does not belong to the hotel and opens at 11:00AM and closes at 6:00PM so there's no point coming back to the hotel if you are planning on having a nigthcap and don't have your own booze. The pool and jacuzzis are nice. The beach is a stone's throw from your room and very nice. Hector and Melli who work the bar/ restaurant are really nice folks; the food stinks - wraps and chicken tenders - just what you flew all the way to Puerto Rico for. If you crave authentic & inexpensive Puerto Rican cuisine, turn right as you exit the hotel and go 200 yards. You will see a shack on your left called (don't remember) but ask the security guard at the front gate and he will tell you. Food is awesome and very inexpensive.", "Date": "February 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Aurora, Illinois", "Title": "“Great Place Even With Closed Resort Next Door”", "Author": "AuroraIL", "ReviewID": "UR24605420", "Content": "We just returned from a week stay at the Hacienda Del Mar and had a wonderful time. To me this is a great resort if you are looking for a relaxing getaway. If you are looking for a party resort with a jumping nightlife this is not the place for you. Below are our thoughts on the different aspects of the resort Room: We stayed in the one bedroom unit and found it to be very nice. It had a full kitchen, living room, and seprate bedroom. In the bathroom was a seperate shower and whirlpool tub. We recieved daily maid service were they made the beds and changed the towels and one deep cleaning of the room during our week stay there. As stated in previous reviews the beds were a liitle on the firm side, but nothing that was going to keep you from getting a good nights sleep. Beach: The resort sits on a lovely private beach that is in a cove of the ocean. Getting chairs on the beach was never a problem no matter what time of day we went down. This was probably the highlight of the resort. Pool: Just a standard lap pool, nothing too exciting, along with two whirlpools and a kiddie wading pool with plenty of more chairs around them. The pools were very clean and we could see staff cleaning them every day. Grounds and Acitivities: Beautiful grounds that were cleaned and manicured every day. There was an onsite resturant the served lunch and drinks from 11am-6pm, and the front desk has many menus for resturants in the area for dinner. The acitivites that we saw were: beach volleyball, basketball, tennis, mini-golf, table tennis, and four beautiful golf courses. The basketball court, tennis court, and mini-golf were all lighted for night time play. Hyatt Cerromar: As stated in previous reviews the Hyatt Cerromar next door is closed. The casino, river pool, water slide, and all resturants that were part of this resort are closed as well. If you have fond memories of this resort when it was open, you will probably be disappointed. As also stated in previous reviews there is now a green fence surrounding the entire Cerromar property, but this is only an issue if you make it one. You really don't notice a fence when you are staring out at the beautiful beach and ocean.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta", "Title": "“lovely vacation”", "Author": "ATLgirl", "ReviewID": "UR24120806", "Content": "Not a thing wrong with this Hyatt resort. The rooms were large and nicely decorated, and the kitchen better outfitted than I had expected. Plenty of towels, etc. The washer dryer was helpful, too. The beds are a bit firm- we were all complaining of stiff backs by the end of the week, but the hot tub took care of that. The resort is smallish, very quiet and peaceful, and beautiful. Notice that I didn't say \"exciting\"- exciting it's not. There is little to do on the resort except laze in the sun and drink Pina Coladas. Which I like to do, so I was pretty well set. The pool is big and very well maintained. The beach is small but very nice- plenty of beach chairs. NIce shady areas as well as sunny ones. The fact that the hotel next door is closed really doesn't impact at all (except that there was probably more to do when it was open). That will definitely change when they start demolition and reconstruction, but who know when that will be?- years, probably, at least. The only food on site is the pool/beach bar which has an extremely limited menu. The on site shop does sell a decent array of \"basics\", and there are grocery stores nearby (though we found the quality of fresh food to be significantly lower than what we are used to at home) Dorado is a sleepy-ish area, but there are plenty of good dining options within a few miles. You will definitely, by the way, need a car. We liked Morado (I think that's what it was called), to the east of the resort. It's high end- pricey, but excellent food and excellent service. There are several other restaurants in that little strip that we did not get to try. There are several low-key, very Puerto Rican restaurants clustered around Dorado Beach (the public beach- not the resort called Dorado Beach). And we went to Charlie-Hamburger (funny name) a couple of times - very casual, very cheap. The mofongo was pretty much the same at all the places that we had it in Dorado, and all of it was good. There are fast food restaurant EVERYWHERE! Never have I seen so many Burger Kings in one place. There's also an Applebee's just down the road from the resort- AVOID IT! It was god-awful. All of the staff at the resort were friendly, polite and accomodating. If you are look for peace and quiet, and relaxation, this is the place for you.", "Date": "February 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "evansville, in", "Title": "“Past its peak”", "Author": "jko50", "ReviewID": "UR23829179", "Content": "We just returned from 3 nights at the Hyatt Hacienda Del Mar in Dorado. The grounds around the pool are very nice; however the inside of the rooms are in major need of an update. The water flies randomly out of the facets. There was a musty smell in ours and our other family member's rooms. The dryers left clothes smelling like mildew and put rust spots on them. There is no restaurant at this hotel and must drive a mile to get to one. Ate at some authentic puerto rican restaurants about 5 miles from hotel. Weather was lovely.", "Date": "January 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Francisco, CA", "Title": "“Amazing views, friendly reception, unbeatable amenities”", "Author": "fuggler", "ReviewID": "UR23062238", "Content": "I picked Hyatt over hotels in San Juan because of the views and the amenities they offer. I was worried about the construction but when we got there, it's not noticeable at all. The fence that everyone freaked out about is covered with a green tarp and when you look out from your balcony, the abundant palm trees hover over everything! I booked our 6-day stay on their website but when I called to confirm on the day of our arrival, the receptionist told me they don't have my reservation. I left a semi-angry voicemail to their manager whom I had spoken to months ago about a previous reservation we canceled due to a hurricane. After a few hours, he called me and said we'd be able to stay there. When we checked in, I was very surprised and happy that they put us on the highest floor - the 8th floor. Our studio cost us $115 a night with the $50 internet fee. It's the best $115 I've ever spent. The studio is spacious and had everything we need. I love the balcony and the views! It was so relaxing eating breakfast with a front view of the ocean and palm trees. There was also a washer and dryer right outside of our room and it was free. All you have to do is ask for detergent. Everyone was very friendly and nice to us. The grounds are well-maintained. Everyday, I saw a couple of guys cleaning the pool and jacuzzi area and different housekeepers. Best of all, they cleaned our room AND washed our dishes every day, and we didn't have to ask. Really, Hyatt is awesome and I'll definitely stay there again. It's half an hour from San Juan, but you can't get a room with a gorgeous view and all the other amenities we got for $115 a night in the city!", "Date": "December 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Douglasville, GA", "Title": "“Great Time”", "Author": "cromga", "ReviewID": "UR22427038", "Content": "Just returned from our stay at the Hyatt Hacienda on Nov. 27. Hotel was very well kept up and the service from the front desk was great. Pool was kept very clean and grounds very well kept. Had no complaints and enjoyed our 4 day stay with family including a 16 month old. Would not hesitate to recommend this hotel. Didn't try small restaurant on property. The only draw back is have to go into town to eat. On the last day we discovered some restaurants down on the main Dorado Beach that we had not read about on the internet or books. Might be worth a try.", "Date": "December 3, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "new england", "Title": "“Great Family Vacation”", "Author": "glencora", "ReviewID": "UR22262201", "Content": "I am unable to comprehend the critical reviews of this hotel/condominium. We have just finished a delightful one-week stay at the Hyatt Hacienda in Dorado and can find no fault what so ever with the resort. We flew into San Juan (an easy flight from New York) and rented a car. The drive took about 30 minutes. I highly recommend that anyone vacationing in Dorado rent a car. We brought our GPS, which was a big help. The hotel is actually a time-share condominium complex, which probably explains the layout (identical two bedroom condos, which can be divided and all face the ocean), the amenities and the generally quiet and comfortable atmosphere. Our 4th floor condo was a roomy two bed room, two bath unit with a full kitchen, dining and living room, 2 balconies overlooking the pool and ocean and full laundry facilities. We had maid service daily. Everything was extremely clean. Our first day there we ran into a fellow physician from our home town who, as it turns out, bought a time share there when the complex was first built. He has been delighted with the purchase and relieved that the Hyatt next door has closed, keeping thousands of people off the beach and pool area (both very clean during our stay). Contrary to reviews, we were basically unaware of the fencing between our property and that of the hotel next doorâ€”it was covered with unobtrusive green canvas and hundreds of palm trees. Every unit looks out over the pool area and ocean. The pool was large and had swimming lanes so my husband and I could swim our laps every day. The beach is on a horseshoe-shaped cove, which totally prevented trespassers from entering. The entire property is gated and well secured with guards, so we felt very safe. Unlike the experience at most beaches in Puerto Rico, we were never hassled by vendors or beggars. We played tennis on one of their many courts, two of which were lit at night, but did not play golf. There was also a miniature golf course, ping-pong tables and a childrenâ€™s program. The majority of the people there were families (more than 1/2 speaking English). The staff was polite, bilingual, helpful and thoroughly appropriate. Overall, Iâ€™d say it was an ideal vacation week for our family of four (2 teenagers, 2 adults), but quiet. Donâ€™t go to the Hyatt expecting an active nightlife. There are several good restaurants in the area, but no casino as far as we were aware. We ate out every night, but the kitchen was well supplied with cooking utensils and one could easily cook dinner in the unit. There are two good supermarkets within easy driving distance of the hotel and lots of American style restaurants in addition to the local. The town is within easy driving distance of several good tourist attractions: the observatory, Old San Juan, the rain forest and lots of beautiful beaches. But if you want a week in which to do nothing other than sit on the beach, this is a great place for that, too.", "Date": "November 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orange County, CA", "Title": "“Nice enough”", "Author": "PearlCrystal", "ReviewID": "UR21558365", "Content": "So myself and three of my friends stayed here for 5 nights. We had two ajoining rooms...One was a studio and the other was a full suite. The room smelled stale and we aired it out and bought plug-in airfresheners which helped. Rooms were clean and overall were a good value. Front desk staff was very friendly and helpful. The hotel provided perfect directions to attractions around the island. I had my GPS with me and it could not lead me to all the attractions I wanted to see. The hotels beach is very nice, although beach was rocky on the bottom and my friend cut her foot. The area around the hotel is nice and the hotel is located fairly close to the main freeway. It is also near a grocery store and several good resturants.", "Date": "November 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "chicago, il", "Title": "“HYATT SMELLS BAD”", "Author": "TouringPrincess", "ReviewID": "UR21147439", "Content": "The room had a bad smell of a moldy basement and so did the sheets. If you plan on staying there spray a freshner and wash your sheet. Otherwise, surroundings where clean, great smelling lobby, nice pool and oceanview, and nice staff. Can't believe this belongs to a vacation club and people accually sign a contract to become an owner here for thousands of dollars. Beware.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Nice staff but hotel is falling apart”", "Author": "xsl1", "ReviewID": "UR20478819", "Content": "We stayed at this vacation club from 9/20 to 9/27. The staff was very friendly, particularly the front desk. However they don't actually do anything. The first night we were there we realized the jacuzzi tub in the room was broken so we asked front desk to send someone to take a look. We asked 3 times that day but no one ever showed up. The outdoor hot tubs were not working though over the week sometimes a couple of jets would work in one of the hot tubs. The beach and pool and were very nice and we enjoyed ourselves. Though everything in Dorado is gated including the Hyatt; security is not tight by any means. For instance, on Friday night, local fisherman took up half the beach. Then the last night we were there we tried to do laundry and the washer flooded our room. The hose for waste water at the back of the washer was not connected and water simply emptied from the washer into the room. Stay here only if you have no other choices.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "puerto rico", "Title": "“Great room,but river pool closed”", "Author": "monicacaguas", "ReviewID": "UR19619012", "Content": "The room was great, extra clean and comfortable. Great view. Bad thing is that when I booked does not specify that river pool was closed. It was dissapointing. Only one pool was operatimg and was not ideal for kids. Only one jacuzzi working. Be carefull with your kids not to loose the purse tag they give them. My little boy lost his purse and I have to pay $15.00 .The mini golf area really needs help. The gym is nice. The sorrounding area is ideal .", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“paradise”", "Author": "coqui415", "ReviewID": "UR17748858", "Content": "My family has been going to Puerto Rico for 15 years. We have stayed in Hyatt at Dorado Beach and Hyatt at Cerromar Beach. We now own a timeshare at Hacienda Del Mar and love it. I have travelled a lot and I can't think of anywhere better than Puerto Rico. Hacienda Del Mar has an unbeatable staff. They not only make you feel welcome, but they answer any and all of your questions and really become wonderful friends. I have stayed in contact with a great deal of them. The rooms are spacious and luxurious. It's nice to be able to have the option of cooking in your room, or going out. I would highly recommend this place to all ages (especially teens). I think Hacienda has something to offer everyone. It's sad to have experienced the other two resorts and now see them closed, but no matter what it is a beautiful place (fence or no fence) because let's face it.. you can't beat paradise.", "Date": "July 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“would love to go back again!”", "Author": "bella_1012", "ReviewID": "UR16201162", "Content": "I exchanged my timeshare through Interval and we got a 2 bedroom unit. First of all, let me tell you that the units are great! It was just my friend and I that stayed there and we both have our own private entrance to our unit. My unit has the full kitchen, dining room, living room, jacuzzi,bathroom, king size bed and balcony. My friend has the efficiency with mini kitchen, balcony, queen and full bathroom. The units comes in equippped with everything you need. Our balcony looked out in to the pool and you can also see the ocean. It was beautiful. I believe all the units has a balcony. We cooked in our condo for the most part. We went shopping at Grande grocery store which is better than Amigo. We had breakfast everyday at our balcony.The resort provides free coffee in the morning! Yummy coffee I might say! Second of all, the resort has a private beach. That is probably the greatest part of our vacation. We went to San Juan beach, Rincon beach and some other local beaches. But we never found anything quite like our beach at the resort. The Hyatt beach was private, clean and just picturesque! It is enclosed by two huge boulders of rocks so you know that it's not open to the public. They have nice chairs that you can use and you dont have to be charged to use them. You can get a nice cold drink at the restaurant and just enjoy the sun. They provide you with towels but you just have to make sure you return them.. that's pretty typical for the most part. Thirdly, the staff are great! We checked in fast and they were very helpful to give us directions and recommendations on places to go. There's not much stuff in Dorado but if you're going out to eat, I recommend the \"La Terrazza\" for dinner. As for tours, they have them available in the resort but I suggest that you rent a car. Although, make sure to be alert because driving in PR is very different. If you decide to go to the Bacardi Distillery, just plan on going to Old San Juan from there because there's a ferry close to the Bacardi place that goes to Old San Juan for 50 cents one way ($1 back and forth). Lastly, if you're a golfer, you would absolutely love the golf course here! And if you're a runner like us, there is running/biking path that you can take that shoots you off right by the ocean. It's beautiful! It was our first time in Puerto Rico and I must say that I would definitely go back. And I'll definitely go back to Hyatt Hacienda Del Mar!", "Date": "May 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Valley Cottage, New York", "Title": "“Too bad about that fence”", "Author": "bikes&boats", "ReviewID": "UR16078783", "Content": "My Fiancee's family booked this time share and I was able to join them for a wonderful time. They are big sun and beach people so it was right up their alley. We spent about half our week there just lounging by the pools and beach. It is really sad to hear about that fence because we had a great time in January on the lazy river and generally floating about the larger pool closer to the beach often times with drinks either from the friendly ladies at the pool bar or from our convenient first floor suite. I must say it was a bonus to be able to go in and out of the room through the back slider door. I also did this a couple times after dark to use the well subsurface lit lap pool and Jacuzzi. We requested the first floor for handicapped accessibility reasons but even if you don't need it for that reason I would still recommend it. It was eerie walking around the old abandoned half of the hotel with the little bird zoo and landscaped courtyard. I wonder what it will look like after the construction is over. The rooms we nice and quiet. While our AC in the smaller of the two roomed suite worked fine, my fiancee's parent's AC, in the larger room, never quite got their temp right. The large kitchen and living area was great for numerous meals. We also had a few good local meals as well. It was a decent trip into San Juan. Try to avoid rush hour cause many roads get backed up and that is not what vacations are for. We went to the city for the Casinos since there are none in Dorado anymore. Also took a side trip to the big Radio Telescope (with the help of a GPS unit we brought down with us). I agree with comments made by others that those recycled bracelets are kinda scuzzy. With security at the gate, why bother with these?", "Date": "May 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york, ny", "Title": "“Very nice hotel”", "Author": "jenialexis", "ReviewID": "UR16040900", "Content": "Hyatt Dorado always brings good memories to me....I have been there a few times and loved staying there. The check is fast and efficient....we didnt like our room the first time and it was promptly changed. The second room was nice and spacious with a great balcony and beautiful ocean view. One of my favorite things about this place was the pool and of course the pool bar....drinks were delicious and the endless platano chip bowl seemed endless. The location was nice...very quiet area, yet easily accessible by car and short drive away from both Rincon and San Juan. Overall, I would recommend this hotel for a couple who wants a romantic getaway but I am sure that anyone who stays there will enjoy it", "Date": "May 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vero,FL", "Title": "“Luxurious tranquility and relaxation”", "Author": "Mimfiz", "ReviewID": "UR15997543", "Content": "Even though the resort is not as sprawling as other luxury beach resorts - this is a gem. Service was excellent. Tea on the patio every day - yoga on the beach every morning - a wonderful, protected inlet for excellent snorkeling for my kids (youngest was 9). Even though the pool was small - there was another Hyatt timeshare/condo next door where we had privileges to their immense lazy river pool and wilder beach full of large waves for body surfing and more snorkeling. The first word that comes to mind when I think of this resort is relaxation - not easy to satisfy active children (and husband) and adults craving luxurious accomodations, but this Hyatt was perfect for the entire family.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "atlanta", "Title": "“Quiet, relaxing”", "Author": "lookin4boatdrinks", "ReviewID": "UR15274285", "Content": "Spent a week at the Hacienda Del Mar- just my husband and I. We chose this hotel having read many reviews and realizing that part of the resort is closed. We liked this because we did not want the crowds that seemed to be at the other resorts on the island. In general, we were not disappointed. It was nice having the kitchen to make meals and fix drinks to bring to the beach/pool. Not sure if you could do that at some of the other resorts on the island. Did not have to fight for chairs or beach space. It was not crowded at all. My husband snorkeled off the beach and had a good time. Make sure you put on some strong sunscreen though and apply often as the waves were a little rough and he ended up getting pretty burned. The front desk girls were a great help with directions and restaurants. I would definately go back. That having been said, a few things to know. First, make sure you do not lose your bracelets that they give you as you will be charged $15 if they are not returned. They are the same type of rubber bracelets that you can pay $3 to \"Livestrong\". I'm guessing they are reusing these, which is kind of gross. Also, when you get beach towels you must have them back by 6:00 and get your room slip or they will charge you $25. This was our first trip to Puerto Rico. I was really surprised by the traffic. It is awful- and I live in Atlanta so that is saying a lot. People drive anyway and anywhere they want. We saw several ambulances with flashing lights and no one pulled over. Just a warning to be aware of the drivers and expect people to drive in between lanes and along the shoulder. If you want to go to the east side of the island -Fajardo, El Yunque - it will take you a good hour and 45 to get there. We were not anticipating this. Traffic around San Juan is bad at all times. We were planning on taking the ferry to Culebra one day and the girls at the front desk told us that we should plan on leaving at 4:00 am in order to make sure that we get there in time to get ferry tickets. Needless to say, we didn't go. It is very easy to get to Old San Juan, however, by taking the ferry over. That was a lot of fun. All and all, we had a great time and would recommend it.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Neenah, WI", "Title": "“Hyatt Vac Club Travelers Beware”", "Author": "Funfamtrav", "ReviewID": "UR14550713", "Content": "We recently stayed at the Hacienda Del Mar in Puerto Rico. Beware that the lazy river and water slide are closed and have been closed since approximately January 2008! We were looking forward to using this ammenity as our two children are the perfect age. We had heard from family that travelled there last year how fun it was. We were aware that the hotel next door was closed. In spite of making our reservation in November, Hyatt did not have the courtesy to contact us and let us know about this closing. Beware that there is now an imposing chain link fence surrounding the empty lazy river pool and slide. This fence comes right up next to the pool/cabana area and is a big part of your view to the ocean. The beach is beautiful, the condos are nice, but Hyatt not being truthful put a damper on our vacation.", "Date": "March 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Philadelphia", "Title": "“Not child friendly!”", "Author": "SRTguy", "ReviewID": "UR14519936", "Content": "The staff at the Hacienda Del Mar were terrific. Be careful of the rooms. They are very clean but our original room on the second floor had no view. The window was blocked by overgrowth. The website continues to promote the lazy river and pool with slides. These features were apparently closed in February to make way for reconstruction of the hotel next door. In its place, you get to enjoy the view of a 6' high chain link fence, empty pool and deserted hotel. The Hyatt failed to inform any of its members of the pool closure. The remaining lap pool is very nice but too deep for children under 10. The only restaurant is the pool bar with very limited menu. There are nice restaurants within a 5-10 minute drive but you should have a automobile for freedom. The hotel store has very limited selection of foods and snacks. This place was a ghost town. The property was in decent shape but not up to Hyatt standards. The restaurants, snack bar, and most other amenities have been shut down. If you are looking for a quiet getaway with adults, this is worthy of consideration. If you are traveling with young children, I would recommend avoiding until construction of the adjacent hotel is completed in 2010/2011.", "Date": "March 25, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Just outside of Boston, Mass.", "Title": "“Had a great week at Hyatt Hacienda del Mar!”", "Author": "Lecarrow", "ReviewID": "UR14506001", "Content": "We just spent a week at the Hyatt Hacienda del Mar in Dorado, Puerto Rico. We have been to the location five times before over the past 23 years and have always enjoyed it. Our first visit was in 1985 at the end of our honeymoon, then in 1989 with our then 2 year old, again in 1992 with our then 5 year old (leaving an infant at home) and then in 2001 with our 14, 9 & 6 year olds. My husband bought this week in a 2 bedroom timeshare at a school auction, overbidding significantly with memories of all those wonderful vacations past. Then we started to read the reviews...the adjacent Hyatt hotels on the property were closed, the river pool closed and we started to really worry. Were we off to some abandoned hotel site??? When we arrived we were very disappointed to see the 9 foot chain link fencing and the empty, abandoned river pool. Not only was it spooky but it was very sad, with all our memories! Since this was potentially our last big family vacation now that our kids are 20, 15, & 12 we swallowed hard and decided to make the best of it. So we went ahead and despite all the negatives we had a great week. First of all our two bedroom unit on the fifth floor was all recently renovated, new appliances, new sofa bed, very clean and with a beautiful view of the ocean (although also a view of the abandoned hotel). The one remaining pool that was open was nice and the beach was very pleasant. I did prefer the pool and the lagoon at the adjacent Dorado Beach Club (the former Hyatt Dorado Beach which is also closed) which guests at the Hacienda del mar are also allowed to use. While we were there the surf was very rough for 2-3 days due to a storm out at sea so the beach was closed for swimming. The waves however were amazing!!! The food at both locations was significantly limited, really only the beach bohios at each location. The burgers at the Dorado Beach club were fantastic although expensive $11. We bought groceries and beer as well as cases of water at the \"Amigo\" so we did have breakfast and snacks in our unit. During the week we ate dinner at the Hacienda del Sol (which was way overpriced and not very good), the Trattoria de Nanda (twice which was pretty good), Applebees and La Terraza, all in Dorado. The best thing about the resort is the golf courses. My husband and two sons played both the Plantation course and the famous Dorado East 6 of 7 days and again although expensive they had an awesome time! In the end it was a great vacation and we are considering buying into this timeshare resort since it has so many memories for us. One very important factor, you must rent a car since the cabs are way overpriced and you do have to drive to restaurants, to the grocery store, to the golf course (which is adjacent but the clubhouse is at least a mile away) not to mention to the airport. Overall we had a great vacatiion despite some pretty significant obstacles.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "MA", "Title": "“Nice, what remains of it!”", "Author": "waytoocold", "ReviewID": "UR13857993", "Content": "Be aware that if you are visiting the hotel, it is not what it used to be. There are no restaurants on site, only one pool remains. The kids pool with the water slide and the river pool are closed! I did not know this when I booked through Travelocity. However, the existing pool and grounds were still nice and the beach is beautiful. A bit rough for small children but fun for the older kids. All the staff were accommodating. So much is changing with the hotel and the attached property that it is tough to know what will happen with it in the near future. I highly recommend that if you do go, take a catamaran cruise out of Fajardo - it was awesome for adults and kids of all ages!", "Date": "February 26, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "new york", "Title": "“will never be the same”", "Author": "ahna123", "ReviewID": "UR13508404", "Content": "our 5th visit to the Hyatt. We got there just before the river pool closed at the end of January. the barricades were being erected as the Cerromar was just sold. Nobody is sure who wiil operate the new hotel. There is only one pool now. the gift shop/store is closed as well. The property to the left of the Hyatt has also been sold. Not much property left. No more bicycles as they don't own the property adjacent any longer and insurance is an issue. The casino and shuttle are also gone. Only the small outdoor grill is left. The rooms are not kept up very well. mold in the bathrooms and around sliding doors. We thought of purchasing a timeshare but now it is out of the question. Hyatt staff don't know the future of the resort. It was beautiful when it was whole. Major construction will begin soon through 2011 per the staff. we will miss it.", "Date": "February 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Great Location for honeymoon”", "Author": "marriottdc", "ReviewID": "UR8851422", "Content": "My wife and I got married and the previous Hyatt sister property Dorado Beach and stayed for our honeymoon at the Hacienda del Mar. My mom owns a timeshare at the Hacienda and since it was being renovated they upgraded us to the corner unit with the larger balcony and it was unbelievable. I work for Marriott in room operations so I am very picky when it comes to hotel rooms and the Hacienda del Mar is great. The unit that we stayed in had not been renovated yet but it was still in excellent shape. I agree with the other traveler that they are in need up an update. The views were breath taking and the beach was beautiful. The only thing that we can complian about is that we have been coming here for about twenty years since I was a kid and having the empty hotel next door is very sad. If you have stayed here when the hotel was in complete operation you would understand what I mean. It was great for a honeymoon becuase we wanted the peacefulness, however you could see that the grounds of the old hotel were in need of some help. I still cannot understand how they can operate such a large resort without any hotel guests in the main hotel but the staff says that it will be reopened in a year or so. We will be the first ones to book our trip as soon as that happens! Great stay. Beautiful beaches!", "Date": "September 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Falls Church, VA", "Title": "“Loved It!”", "Author": "man910", "ReviewID": "UR8827301", "Content": "The hotel was great and you could go snorkeling on their beach. The river pool was fun as well.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“This place is a ghost town”", "Author": "munkelilschool", "ReviewID": "UR8368405", "Content": "I just got back from a short stay at the Dorado Beach Club (this is what they are calling it now). There are only 36 operating rooms...so as you can imagine this place is very isolated. There are locals who have club memberships, who use the pool and beach and golf courses, but down by the 3 \"villas\" there is no one around. My boyfriend and I were the only people in the pool. We saw one person walk by at some point and a small family in the ocean, but that's it. There's no where to eat, unless you walk 15 minutes down by the closed hotel and eat at the poolside cafe, which was nice. We switched hotels, because I was going to be alone most of the time while my boyfriend worked, and it felt a little too secluded for my taste. If he was going to be with me the whole time - it would have been amazing. Totally private. The room was great...very clean and modern. Great views! So depending on what your tastes are this is a fine hotel. It seems like this place could be wonderful if they opened up the other hotel and the closed down restaurants.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Loved the Property”", "Author": "TexasTravelstar", "ReviewID": "UR7696568", "Content": "Ok, so most of the reviews were right on. I think that some people didn't go into it with an open mind. Granted that it is not usual Hyatt quality, but the employee's are doing the best they can with what they have. The Zen Garden has outstanding food and the service was fantastic, Sam the owner is great. The bar at the Cerromar is also still nice. I mean how many bars can you go to and basically have your own private bartender. Make sure and see Roxanne, she is great. She took my wife and I into town on her night off and showed us the local flavor. We had the beautiful beach to ourselves for 2 days. We also found some great locat cuisine in town. Go to the Rancho Mar at the public beach, ask for Janet, great food and very cold adult beverages. Also, eat at La Terrazza, it has been there for 25 years and has excellent food. In closing, go there knowing that the Cerromar is closed and just expect the most relaxing vacation you have ever had.", "Date": "May 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Exceeded expectations”", "Author": "Reto", "ReviewID": "UR7407889", "Content": "Just returned from 1 week in a 2 BR suite. Let's start with the few negative points: noisy AC (but you have ceiling fans), landscapers in overdrive (constantly working on the beautiful property, often with noisy machines), soft beds, non-existant directions / signs. And in the last night, we had very noisy people above us; constant slamming of doors, you could almost hear every word they said. But other than that: beautiful. Interior had nice kitchen, even a washer/dryer, all appliances pretty new, small balcony. Btw, all units have ocean view. Did not try any of the on-site restaurants other than the Zen (pool restaurant), since with 2 small kids you do a lot of stuff in your kitchen. The various pools (I count at least 5 + one river you can float down + under waterfalls) are fantastic, there is something for everyone from toddler to adult. The beach is a large bay with a reef breaking the (sometimes) large waves. For small children you go to the east end where there are almost no waves. Very clean water, nice sand, perfect. Staff was exceptionally friendly; helped us find a pediatrician very quickly. And - the resort feels half empty. You always wonder where all the people went. It's perfect. No fighting for chairs etc. There a few times when we were more than 25 people at the beach. You do need a car, at least for shopping (go to Amigos, make a right at the corner where Wendy's is if driving towards Dorado Center). There is a little shop inside the resort (charging pretty high prices), but it has the most neccessary stuff. My wife claims the massage in the Spa was great. And make sure you bring back your beach towels by 6pm (they really charge you $25 / towel if you don't). So if you just want to relax with your kids at pool & beach, then this is for you. If you want fine dining + nightlife, then probably less.", "Date": "April 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Denville, NJ", "Title": "“Nice Family Vacation”", "Author": "MiaC", "ReviewID": "UR7363460", "Content": "We are a family of 4, with our son being 7 and our daughter being 4. What a great time we had. We rented a car at the airport so we could get around with ease. There is definitely a lot of traffic and I know it helped that I know some Spanish to read the signs. We had two separate bedrooms giving all of us enough space. The rooms were quiet and all have beautiful views with patios. The kitchen/dining area was great for breakfast and lunch. We ate dinner out every night and ate some spectacular meals: Hacienda del Sol - Dorado Beach, Zafra (Plantation Golf Course), Zen Garden (Cerromar) and Morena (in town). The golf courses in Dorado are gorgeous. My husband took our son to play 18 holes at the Plantation Golf Course and had a blast. OK- let's get to the Cerromar being closed. It's a little wierd that this huge hotel which the Hacienda del Mar shares pools and beach with is closed. BUT - it is to your advantage. We had our own spot on the end of the beach to ourselves. For several days we had one of the top pools to ourselves as well. And the lazy river was very enjoyable. I actually cant' imagine how crowded it must have been when the Cerromar was open. If you don't like crowds or crazy scenes - then this is your place. If you like to go away to reconnect with your family- again this is your place. If you like to swim (without huge waves), float in the pool, play minature golf, tennis, exercise, get a spa treatment, read and relax, ride bikes, golf, save money by making some of your own meals....again this is your place. And true it could use updating. They are in the process. Our countertop did have a small crack but we survived. The staff there was very nice. Denise at the front desk was a doll. Also, having a car we were able to drive to Old San Juan and visit El Morro- we did have one crazy night at Senor Frogs. We also drove to El Yunque Rainforsest and saw some gorgeous sites- with a great tour guide. So - I hope this helps you out in deciding your plans. Would we return to Puerto Rico- YES!! Beautiful place. Lots to do!! We will return to the south next time to see Ponce. Adios!!", "Date": "April 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Wisconsin", "Title": "“Very Relaxing”", "Author": "jaxsgrandma", "ReviewID": "UR7245822", "Content": "3-24-07 Our concerns were unfounded. If you don't want to relax on the beach, if you want entertainment, don't go here. Person who wrote about the crack in the counter needs a reality check. We had that room and its very nice. Staff very friendly, rooms and grounds pretty clean but not meticulaous. Nice layout, snorkeling at the adjacent Hyatt Dorado Beach resort was spectacular. Maid service only on Wednesday . No restaurant for breakfast, one for lunch and one for dinner, food at both were great. You need to rent a car but driving is awful, lots of traffic and signage is in Spanish. We own at the Mayan Palace in Mexico and traded with someone here. Service at the Mayan far exceeds anything here but that is about to change since there are now new owners who will be remodeling and opening the hotel and casino. Not sure I'd want to go with the hotel and casino open, probably will be too many people. Beautiful waters, beach and great staff. R&R, read a book place for sure.", "Date": "March 29, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Estero, Florida", "Title": "“Hyatt Hacienda Del Mar”", "Author": "Love_de_islands", "ReviewID": "UR7156242", "Content": "Having prepared for the worst by reading reviews - my daughter (17) and I were pleasantly surprised to find the room clean, the staff courteous and the pool and beach well kept. The rest is true - this Hyatt Vacation Club is in serious dis-repair. The grounds are lovely but Puerto Rico in general is the worst destination I have been to in a long, long time. We felt very unsafe in most of the neighborhoods we wandered and the lack of infrastructure and signage to navigate was very disappointing. We own a unit in Key West and there is absolutely no comparison - DONT TRADE HERE.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "NY, NY", "Title": "“ALL THESE REVEIWS ARE RIGHT! Both good and bad.”", "Author": "FromNYto?", "ReviewID": "UR6921228", "Content": "So really, all of the reviews on this site are correct. I liken this property to renting a unit in your grandparents fancy condo on the beach. There's not really room service...but very nice kitchens so you can fill 'em up. You would need a car to get around on your own. The transporatation is spotty. So for families who want to vacation together and want some place the kids can enjoy while the parents enjoy some sun. The property is on a gorgeous beach and there are towels and chairs available. The beach bar serves good basic food and nice fruity drinks. It would not be the place for people looking for a luxury or high end time. There's no bar scene, only one restaurant which opens at night, and it's not walking distance to anything resembling night life. We came to golf--so we didn't spend a ton of time at the Hacienda and when we did --we spent it on the beach.--but did have to walk through all the waterpools and slides. The hotel next door is abandoned...but not really creepy...just a bit of an eyesore. It's weird when you walk through its corridors to get to the one Asian themed restaurant. Pros: Good beach location, spacious suites, great massage in spa, decent work out room. Cons: Not luxury standards, a little grungy, no good food, isolated, spotty car service, a little cruise ship..innot the good way.", "Date": "March 6, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Minnesota", "Title": "“Can use updating, but.....”", "Author": "shareR", "ReviewID": "UR6898820", "Content": "Just returned from Hyatt Hacienda del Mar. Went with a couple friends. Had hoped to stay at the Westin (which I will do next time!) but they were booked during the time we were there. So, we booked the two bedroom at the Hyatt which certainly gave us a good amount of space. We had held rooms at the Hyatt and at the El Conquistador . I had sent the El Con an email and called looking for clarifications and answers to the concerns listed in Trip Advisor reviews and received no response. In addition, the value of a two bedroom with kitchen and living room at the Hyatt (with questionable reviews) versus the single room at the El Con (also with questionable reviews) for the same price helped us make our decision. The Hyatt was responsive to my questions. I believed they were thorough and truthful in the information they gave us prior to our arrival. In addition, they called us prior to our arrival asking if we needed transportation from the airport to the Hyatt, which we did not. I strongly recommend renting a car if staying at the Hyatt as there is not much to do on sight except sit on the beach or near the pool or play golf. Each time upon entering our room (5309 and 5310) we could smell that the room was musty/moldy. After being in the room a while the smell became less noticeable. (Not sure that is a good thing!) Clearly the tropical location makes it difficult to keep moisture out of rooms but it is something that needs to be addressed. In addition, the room dÃ©cor and bedding definitely need to be updated. The Zen restaurant located in the now closed Cerromar hotel was good. We also ordered salads from the beach bar, which were fine. Beyond that, we ate breakfast in our room and most other meals off of the resort property. A Grande grocery store in nearby Dorado was a good spot to purchase items to stock up the fridge. The Hyatt Hacienda beach was nice. The beach is well located with a nice wind (sometimes very strong!) to keep sunbathers cool. Waves can get large and strong, so use caution with young children on the beach. A nice large sand area allows for beach activities. The pool areas, while in need of updating and some additional normal upkeep, were decent as well. Due to the vacated property next door and the limited amount of people staying at the Hyatt, there was no shortage of beach chairs. While I see some guests were unhappy with the staff/service, we did not have any complaints about the staff. We felt housekeeping did a good job cleaning the rooms with what they had to work with. In addition, the front desk was helpful in a number of ways including a stack of printed directions to tourist attractions and a large book of menus for area restaurants that they recommend. I had a service at the spa and found it to be nice. While there are certainly much more luxurious spas, this was pretty good considering the situation of the property. The adjacent property of the former Hyatt Cerromar Hotel is in disrepair. A close look (well not even that close!) at the building and grounds shows deterioration and mold. This situation does not help the Hacienda del Mar status at all. Hyatt had distributed a letter to Vacation Club owners updating them on the situation of the property. Apparently the Hyatt Vacation club had tried to purchase the adjacent former Hyatt Cerromar hotel but the owner of the property is now in negotiations with someone else. The Hacienda del Mar does a good job of keeping the grounds up. I have attached photos of the beach and pool areas. I realize I forgot to take pics inside the room, but the web site photos of the room are fairly comparable to the current state of the rooms. I am a rather picky hotel guest and prefer much more luxurious and more updated accommodations. I would be likely not to stay here again unless the property underwent upgrades. I am surprised that Hyatt has not done so as of yet. However, depending on your expectations, it was certainly an acceptable place to stay if you are not quite so picky, are looking for a good value and a quiet beach location to relax and soak in the sun.", "Date": "March 1, 2007"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Fenton MI", "Title": "“Not normal Hyatt Vacation Club quality”", "Author": "michiganderFentonMI", "ReviewID": "UR6832685", "Content": "Absolutely the worst place to find. Not only is the sign different than the name booked under, but upon entering property you go to check in at a resort that has been closed (no signs indicating it has closed or where to actually check in). The front desk people were polite & helpful however housekeeping was awful (dirt, odor, etc.), not to mention overflowing garbage in the bin under the kitchen sink. We were told that the floors had been remopped after complaining of the dirt upon check in. We arrived back to find the same filth. After complaining again, we were told that a supervisor had remopped yet we still found toys, etc. on the floor & window sills!??! Not a great experience. We actually changed our plans & left from this resort a day early mainly due to condition of the resort. Would not return. Hyatt Vacation needs to check this one out!!", "Date": "February 23, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Maryland", "Title": "“A very relaxing week!”", "Author": "GoTerps99", "ReviewID": "UR6821385", "Content": "We just returned from a week at the Hacienda Del Mar. After reading the reviews we didn't know what to expect but were pleasantly suprised. The pool and beach area are beautiful, and the rooms spacious and equipped with everything you need to spend a week somewhere. My husband and I remarked that it would be a perfect place to bring a couple of little kids as you could pretty much entertain yourself by the huge pool all day. Might get boring after awhile for teenagers though. As many have said before the vacant buildings adacent are a bit creepy. The bar that's located off the lobby of the old hotel (on the way to the Zen Garden) is sort of out of \"The Shining\"...the only thing lit with TVs and music playing and 1 lonely bartender. Make sure to give her some company while you're there, she's very nice! We played golf at the Plantation course (Sugarcane and Pineapple). You cannot beat the deal they have there (Super twilight starts at 4pm for $30 a person). If it's quiet, they'll let you on before 4. We went off around 3:45pm each time and got in 16 and 18 holes with the amount of daylight left. The courses are very pretty and not too difficult. Service is great. The clubhouse and restaurant area there is beautiful and food very good. We didn't do much all week but sit by the pool and beach and played golf and this resort was perfect for that. We did have a rental car so one night we went out to the Bio Bay in Fajardo and took a kayak tour with Enchanted Island Eco Tours. Highly recommended activity...was amazing.", "Date": "February 21, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Paterson, NJ", "Title": "“disingenuous”", "Author": "Catiosca55", "ReviewID": "UR6808607", "Content": "We arrived on 2/10/2007 and once there we went to our rooms. My daughters room was 5308 it had no air conditioning and the room smelled of mold and mildew. My daughter and her husband stayed with us in room 5307 until problem was rectified. Also, everything at the Hyatt Hacienda Del Mar, Dorado Beach, Puerto Rico is closed but they don't tell you that when ou call them, they lie, the casinos are closed, there is no entertainment at all. All you can do is swim at the beach or the swimming pools. There are only 37 rooms being occupied because this resort has been closed since last year. The rooms aren't kept clean and free of mold and mildew. We also booked the family package which we thought was a great idea. We went to view the Camuy Caverns, in Camuy, Puerto Rico, but what everyone neglected to tell us was that there were further fees involved like $12.00 a person. We were shocked when hit with you have to pay to get into the Camuy Caverns. My daughter was bitten by termites during our play on the miniature golf course in the 13th hole and one of their employees was so flip about it. WE also received a 15% discount card to eat at la Vista restaurant while gambling at the Marriott hotel in San Juan. Unbeknownst to us when we presented the discount card to the waiter we were told that they would not honor it. Then later we heard that it wasn't honored because it was Valentines day. But the ticket clearly states 15% discount dinner only valid after 7:00p.m. excludes alcoholic beverages expires 12/31/2007. Excuse me but these tickets were given to us by Hyatt Hacienda del Mar PER LA VISTA RESTAURANT. So then why did they refuse to honor it? So many things went wrong with this stay. The only great thing was Rebecca the receptionist at the Hacienda she was a love, Eduardo one of our drivers, Mr. Montemayor and Felix. These people made our trip worthwhile. Also we went on a tour at the Bacardi Distillery. Our tour was suppose to leave at 2:15p.m. we waited and were bumped off for other tourists who were there visiting. Why was that?", "Date": "February 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“An Amazing Vacation”", "Author": "scribeco", "ReviewID": "UR6789469", "Content": "After reading a few of the negative reviews, we were a bit worried about our one-week stay with two kids, 2 and 4 yrs old. I can now say, without reservation, that it was one of the most enjoyable places I've had the pleasure of staying. We had a two-bedroom condo, which was plenty of room for having the kids sleep in a totally seperate space from my wife and I. THis allowed us to actually have a life after they went to sleep at 8 pm. The full kitchen meant we could cook whatever meals we wanted. The best part was that the resort was nearly deserted. We had a first-class resort practically to ourselves. I can also say that the beach at the Hyatt Dorado (less than five miles up the road and completely open to anyone staying at the Hacienda del mar) is hands-down the best beaches I've ever seen. It's particularly great for kids since it's like a giant salt-water swimming pool. Sure the casino and several restaurants were close, but we could have cared less. We had a car and an enormous US-style supermarket and walgreens 10 minutes away, as well as many other restaurant and fast-food joints in the immediate vacinity. For those who want nightlife and a casino, I would go somewhere else. For anyone else who want to have a world-class resort all to themselves, run down to the Dorado complex and stay at the Hacienda. I didn;t even mention the amazing river pool and what fun that was. Plus, the Asian restaurant and poolside restaurants were quite good.", "Date": "February 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“A small taste of paradise”", "Author": "Mynah24", "ReviewID": "UR6139113", "Content": "During a family trip to Puerto Rico, we needed a place that would accommodate three people comfortable, as I was traveling with my dad, and my adult nephew who had never been to the island before. We were coming in on the Western tip of the island, but needed a place near San Juan to spend a couple of days. Everything in the city seemed to be either too expensive or not quite the 'resort'-like atmosphere we were after. I found the Hyatt Hacienda Del Mar via various internet searches and was intrigued by the photos and was sold on the great price we got for one full room that would include a full kitchen, sofabed, separate bedroom, and a beach and pool atmosphere. The reviews for the place seemed to be pretty positive, so I booked two nights, and then started looking up everything there was to read about it on the web and in guide books...and started to panic. Apparently the Hyatt properties in Dorado were once spectacular locations, but one of the properties closed down merely months ago, and this one became time share condos! I was worried that the resort would not live up to our expectations, especially since I was not looking into getting into timeshares. I feared long parts of our day being lost to presentations. I almost rebooked the entire thing, but I would keep reading and looking at photos and everyone seemed to really love this place. I called the hotel to be sure it was still in operation, and hoped that it would be what we wanted. My fears were at first relieved when I received a courtesy reminder call about my pending stay --- totally unexpectedly. I could tell by this that our choice was still a first class resort. We drove from Aguadilla P.R. to Dorado in a little less than 2 hours (we took the scenic route), following the directions given to us on the hotel site and otherwise. In the one negative comment I have about the place, the directions were not all that clear. We wound up circling the area in Dorado, winding up near quiet fields that were no where near a beach, thanks to signposts that were not exactly clear. They read something like, go straight on 693, turn on 696, then turn on 693...? Not fun to do when you're driving around for the first time in a strange town. Plus, the Hyatt has not changed the name yet - it still reads \"Hotel Cerromar\" - which is very confusing when you turn in looking for one thing and see another. When we eventually found the place, we were thrilled. The staff greeted us courteously, smiling, and made us feel welcome immediately. I'm not sure if our arrival (mid week in November) was during off-season or not -- but the place seemed extremely empty! We checked into a huge room that was even larger than I expected, and marvelled at all the little extra touches. TV's in the bedroom as well as the livingroom. A small terrace area overlooking the beach and pool, and a very very large bed. We had wanted two beds, but the cost of a two bedroom would have been much higher. We made the most of what we had, and it was big enough to suffice our small family, only suffering mild discomfort. When we went to explore the beach and pool area, our jaws dropped. The beach was gorgeous. And empty. And better yet - totally private. A lovely view of the ocean surrounded by beachfront is all you see. Nothing more or less. It was beautiful. And the pools were actually a mini-water park! A dozen or so bodies of water all attached via mini-slides. You could use a tube and just ride through a bit and then slide into the next pool, or just do it yourself. Though designed for families, big kids (like my nephew and I) had a complete blast, especially when we discovered small hidden areas (an underwater cave). Again, since we were here on off-season, we had the run of the place almost entirely to ourselves! We were given a voucher to try one of the hotel restaurants (Zen Garden), which we enjoyed immensely -- even my dad who hates Chinese food enjoyed his meal. There were a couple of other eateries here, but due to the renovation and closure of the other Hyatt, shuttles were available to take guests without cars between resorts. The resort is located about 1/2 hour drive away from San Juan. Figure in a bit more for traffic during peak hours. We found a great selection of nearby stores to shop at, had we stayed here for the entire week. A huge supermarket, some additional restaurants, and banks and bakeries are all minutes away from the resort. My dad commented frequently that he felt he was in Florida, not in Puerto Rico. Our stay was short, but we do hope to return here for longer stays some day. There seems to be a management change in progress, so hopefully this place will still be around when we choose to go back. It was truly a small taste of paradise, for a really great price. As for the Timeshare- they do leave messages with you to see their presentations, but they were not agressive about it, and were really looking for couples and families, of which we were not. However, if I were looking for such a deal, i certainly would look into it at this wonderful resort.", "Date": "November 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Peaceful, relaxing and beautiful”", "Author": "phenderson", "ReviewID": "UR6019175", "Content": "I just returned from a five-night stay at the Hacienda Del Mar. I was quite concerned as the sister hotels, Dorado Beach and Cerromar Beach, are now closed, as is the casino and many of the restaurants on these properties. Many reviews were quite negative; however, we found the Hacienda Del Mar to be quite comfortable and still beautiful and the people went out of their way to please us. The pools, especially the river pool, were well maintained as was the beach. The only thing missing was the crowds. Local restaurants fulfilled our needs, but the best restaurant of all was the onsite Zen Garden. The owner, Sam, befriended us and we ate there 3 nights out of 5. The food was EXCELLENT. Sam even prepared a special dinner on our last night just for our group of 6. The theme is Asian, but you still have many choices. First night we ate habachi, second night we ate the 4 course lobster special, and the last night we had our surprise dinner prepared especially for us. The main cocktail lounge is open as is the pool bar/restaurant and the service was outstanding. Everything was great -- so if you are traveling there, do not be concerned -- the place still is wonderful. You won't even miss the casino and you can spend the money you saved by not gambling for shopping in Old San Juan (the Coach outlet is great!)", "Date": "October 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "midwest", "Title": "“what the heck happened to our dream vacation site?”", "Author": "cheeseheadland", "ReviewID": "UR5948338", "Content": "We first discovered the hyatt dorado about 14 years ago and we fell in love with the site and stayed at cerromar and dorado at least twice a year for about 10 years. It was our dream location because of the golf, the beaches, and all the things the resort had to offer. We are truely sad on what has happened. It felt like a ghost town. the hacienda del mar was fine and the pools were operating but the atmosphere has been lost. We had to travel to eat breakfast as well as small items we needed. The rest of the resort is in severe disarray. Roofs caving inn , bathrooms uncleaned , recrational activites closed down, etc.etc... We thought about buying a timeshare when they opened up hacienda del amr and are we glad we did not. Either demolish cerromar and dorado and start anew or just close down. The whole resort is very sad and depressing. I would like to know what the plan is for the grounds.", "Date": "October 13, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Annandale, VA", "Title": "“A Grand Dame No More!!!”", "Author": "Sheep2Sleep", "ReviewID": "UR5629798", "Content": "We just returned from our trip to the Hyatt Hacienda where we rented a two-bedroom condominium. Hyatt has the lion's share of the beach property at Dorado with its three facilities which are available to all resort guests. The grounds are impeccable and the golf courses are fantastic. We want to especially complement the professionalism and skill of the front desk , spa and beach staff . They were extremely polite and helpful, and they will go out of their way to please guests. In every way, they exhibited the high standard for which Hyatt is well known. It is readily obvious that this resort was once the Grand Dame of the island. That being said, we must acknowledge that the resort has fallen on hard times from what appears to be poor property management and intentional neglect from the Hyatt corporate structure. Presently the abandoned, mammoth Dorado Beach Hotel is an eyesore to say the least, and it, along with its rusting roof, is in plain view of the oceanfront condominiums. I was advised by the resort staff that Hyatt intends to begin renovation work on the hotel later this year and intends to complete the project by the end of next year. Get real, Hyatt, this massive undertaking will take at least three years, since the hotel is only one of the many structural problems on the resort. Other buildings, which are not few in number, are also rusting and in need of serious renovation. Even the condos need upgrading with regard to rusting and peeling paint from the walls, fading draperies, peeling paint from porch furniture, an infestation of miniature ants on the balcony upon our arrival, and dirty showerheads to say the least. The miniature ants were also around the pool property. While many of the restaurants are now closed at the resort, the Zen Restaurant is still open for business. We found the food there to lack presentation as well as good taste for such a pricey establishment. We were grateful that we had rented a vehicle, so we could travel to other upscale restaurants. One other point which we noted and hope was not intentional was that the maid service was inconsistent in how they cleaned our rooms, in that they decreased the service the last two nights of our stay--tacky, tacky, Hyatt! Hopefully in time Hyatt will be able to restore the rare beauty that the resort was known for in years past. If so, we may very well return to Dorado Beach.", "Date": "August 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Place for Families”", "Author": "CNYC", "ReviewID": "UR5469855", "Content": "Even though it's quite far from the airport, it's worth it. My children were so amazed from the grounds. Imagine, a long winding river pool that slowly brings you winding down to the next sister hotel. The relaxing beaches and a total of 3+ pools. The beach was good, the water was clean and blue. On Wednesday nights, you should bring your childrens to the day camp area to watch movies for free. Also, mini golf, tennis, bicycles are available for use in the hotel. We had fun with mini golf, we used to 2 times. Use the shuttle buses to the sister resorts, which operate every 30 minutes. Overall, we had an amazing experience. We went to the Rainforest, be sure to wear comfortable clothing. The Barcardi Rum factory was quite amusing. Free samples (rum) and soda for the children. I miss Puerto Rico, and I would totally reccommend this hotel 100%.", "Date": "July 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Martinsburg, WV", "Title": "“When can I return”", "Author": "A TripAdvisor Member", "ReviewID": "UR5373802", "Content": "Can I just say I just did not want to leave. We had private drivers all week from Dorado Tours. Ronnie, Peter, Jesus, Eduerado. Excellent. Yes renovatoiin would have made it better. But everyone went out of their way to make out stay awesome. Can't wait to return.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "3"}, "AuthorLocation": "san juan", "Title": "“Never go there again unti they complete total renovation.”", "Author": "mayin", "ReviewID": "UR5295368", "Content": "We just returned from our two day get away at this hotel and all I can say is that they should close it down ultil they start and finish a complete rennovation. . We as locals knew very well this Cerromar Hotel before its closing and it is painful to see how deteriorated everything is. They should not continue the timesharing program because is very dissapointing to the members not to get what there were oferred. NO restaurant, no casino, no pool bar (except hours a day) no nothing. As for the beach and pools, we have so much better offers and hotels here in P.R. that is offensive to promote this kind of place as a Hyatt, please!!!!!. We reserved this place to be with family from the states that had a timeshare and never imagined the place to be so rundown. To top it all the sister hotel Dorado Beach, who has the nicest beach ,closed down this same week. As I read the reviews of other people today I realized everybody thinks the same way. I advise to look for better offers. Definitely not a place to consider for your vacation!!!", "Date": "June 3, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Staten Island, NY", "Title": "“Beautiful grounds a Tropical Delight”", "Author": "JOJOSI", "ReviewID": "UR5288338", "Content": "My finance and I have just returned from a Curise which left out of Puerto Rico. We decided to stay three extra days at the Hacienda Del Mar. I was very leary after reading some of the reviews. But let me tell you we thought it was delifghtful. The beach and pool and grounds are magificent. You need to rent a car since there is little to do at the hotel. It's a shame that the Hayatt Organization let the Ciromar and Dorado Beach Hotel just close up. These hotels must have been out of this world 25 years ago. I have been to plenty of hotels and resorts and again this hotel was not bad. I found it clean and the staff was very helpful and polite. I want to say thanks to Celia at the front desk for all her help she does a great job. Again we would stay and recommend this hotel", "Date": "May 31, 2006"}], "HotelInfo": {"Name": "Hyatt Hacienda Del Mar", "HotelURL": "/ShowUserReviews-g147322-d254380-Reviews-Hyatt_Hacienda_Del_Mar-Dorado_Puerto_Rico.html", "Price": "$141 - $217*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">301 Hwy 693</span>, <span class=\"locality\"><span property=\"v:locality\">Dorado</span> <span property=\"v:postal-code\">00646</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span></span></address>", "HotelID": "254380", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9a/c4/9ac4ce5c17f2e6191b64ce2108d667544large.jpg"}}