{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“A nightmare from hell”", "Author": "Sonicjess", "ReviewID": "UR125565113", "Content": "I've been working at Alexander Hotel, September-November 2010, and I will recommend all of you travelers to stay away from this hotel. It's fairly expensive compared to the other hotels in the Victoria area. I only worked there for three months but I had to manage the hotel by my own since the owner never showed up. He never answered his phone and didn't really care what happened to the hotel. My ''titel'' was a chambermaid but I worked as a receptionist, a janitor, a manager and a breakfast cook. I did it all. So if you want a pleasant stay in London search for another hotel!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“bed bugs rooms!!”", "Author": "mariana t", "ReviewID": "UR119600359", "Content": "yeah if we have to find a name for this hotel we should call it bed bugs rooms they eat you for free!! i cant believe people dont clean i stayed 2 nights with my family , we paid 130 pounds per night, i really think dont worth it , there are 3 russian girls there and they dont speak good english, i saw them working as recepcionist, in the kitchen, cleaning they do everything, but you can never talk to them if is any problem , they disapear...... me and my brother we have been bitten completedly by beg bugs , looking beautiful in our vacations pictures about the free breadfast the first day they did not have any food, really was horrible servise , so please never go there, i hope the owner of the hotel put more atention", "Date": "October 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Bedbugs, lousy service, no sleep, no refund”", "Author": "rogeiro", "ReviewID": "UR119126488", "Content": "Went to London in September, thought we had a bargain for 70 pounds per night in the Victoria whereabouts. The first night we were assigned room no. 2, the room was far below average but worst of all we were bitten by bedbugs. In the morning a girl from Spain which acts as cook and cleaning staff took also the receptionist role and switched us to room no. 3. Room 3 greeted us with a worn down carpet and hole in the floor where you could step into broken wood and a couple of rusty nails, the bathroom was so tiny I could not shower without hitting the shower valve and inevitably changing from freezing to scalding water, also the faucet was outside of the tiny bathroom. We thought we had left the bedbugs behind but on the third night we found many lying around on one of the beds. Again staff was unavailable apart from the cook/cleaner/part-time receptionist who, of course, in spite of her best efforts could not offer us a valid solution. We had paid for a fourth night but decided to leave and paid about half the rate for a far cleaner and better room on the Easy Hotel just accross the street. In summary: paid for 4 nights, stayed 3, slept just one night. The manager a guy that goes by the name of Raphael took two weeks to answer his mobile, offered me a refund for the fourth night but I still haven't got it. Believe me, the only good thing about this hotel is the location and I am certain this is the only thing that keeps it alive, but within a 2-block range from the Alexander Hotel there are about 10 more hotels and at least 3 of them with comparable rates. Don't waste your money here, It would have been more comfortable to stay in Victoria Station!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“Absolute hell!!”", "Author": "Lakesgirl88", "ReviewID": "UR118851014", "Content": "We stayed here for two nights on the 22-24th September. It was a trip I had organized for my boyfriends birthday as we had not been away for over 2 years due to financial problems, we chose London as we had never been before. What was supposed to be a romantic break turned into the trip from hell and this hotel is totally responsible for this. On the outside the place looks great however your heart will sink the moment you set foot inside. Peeling wall paper, dirty carpets and very dingy and dated.....it gets worse. We were checked in by a rude and sultry receptionist who didn't show us to our room, didn't tell us breakfast times or check out time. It took several attempts to get into the room as the lock was faulty, not safe or reliable as it was hanging off. Once inside I wanted to cry (and actually did). We were greeted by the most disgusting smell that can only be compared to a sewer. There was black mold everywhere, more peeling wall paper, a window that would not shut properly, dirty bathroom (pubic hair on a glass) a horrible view of the tiny back yard which was also filthy and the carpet was wet constantly. I immediately complained and asked to be moved rooms however I was told we could not as they were full. We would have checked out there and then if it wasn't for the fact that we had already paid £70.00 deposit and they therefore had our credit card details and would charge us the other £70.00 for loss of room revenue if we walked out. We got no sleep what so ever during our trip, the walls are paper thin and we could hear next doors activities and snoring. Being on the ground floor with a dodgy door lock and a window that wouldn't close left us feeling incredibly unsafe and anxious. Breakfast was awful, cold toast, coffee like tar, no milk, microwave scrambled eggs and green bacon that was part raw. Service terrible This gave us food poisoning. Needless to say we skipped breakfast the next morning and just checked out. That was after an embarrassing incident where the housekeeper let herself in when we were getting dressed despite us shouting very clearly that we were still in the room! We complained again on check out and were told the manager would contact us, he did not. After sending daily emails and placing daily phone calls I have still not heard anything from the manager. They have given me his mobile number which he ignores and doesn't answer the messages me and my mother have left him. This hotel is by far the most disgusting place ever and should be condemned. I am contacting environmental health about it as it really is that bad. Budget or not no one should pay £140.00 for what we experienced. DO NOT STAY HERE!!!!!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Bedbugs pics. Please dont stay here never!”", "Author": "Moonlight T", "ReviewID": "UR118512283", "Content": "I want to share with you some pics of my neck and bedbugs that I found in this terrible and disgusting place, next time really I will sleep in the street. This dump needs to be closed !!!!", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nasty, Nasty, Nasty”", "Author": "Isobel77", "ReviewID": "UR117448618", "Content": "Stayed for just one night and believe me I was relieved I had not planned to stay longer. Only stayed here last minute as every other hotel we looked at was fully booked. Cost was Â£70 for a double room which is pretty reasonable for Victoria. After staying there cant imagine they would be able to charge anymore. It really is disgusting, cant really understand why it has not been closed down, i am sure it must have hygene and health and safety issues!!! I believe breakfast was included in the price but after seeing the room there is no way I would eat there, can not imagine what the state of the kitchen it like. Room was foul, dirty, dusty, probably bed bugs, the thing that made my stomach turn was the foul rusty toilet brush holder next to toilet, not that they probably used it much!!! If you plan to stay here good luck, but personally would probably rather sleep on the pavement outside!!", "Date": "August 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Hotel from hell”", "Author": "Speaker2011", "ReviewID": "UR95477624", "Content": "I stayed in this hotel for 2 days and I really stayed in hell! The front of the hotel looks convincing as soon as you get to the tiny reception your heart start pumping fast! The place smells damp everywhere, the ceilings are falling apart, broken door locks, broken toilet door locks, very old carpet that looks 40 years old. Abandoned furnitures, dust, bedbugs, 1970 tv with no remote, no kettle or phone in the room. My friend was told he should have brought in an iron as they do not provide one. No lift, you will have to climb the Himalayas in this hotel, once you get to the top, there in oxygen, a good place for horror movies! How on earth can the British government allow this place to trade? The owner is negligent! Please avoid this hotel from hell!", "Date": "February 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ellesmere Port, United Kingdom", "Title": "“Probably THE worst hotel I have ever stayed in”", "Author": "Dippydai", "ReviewID": "UR88333220", "Content": "The pictures on the website look lovely. Must have been taken from another hotel. From the minute we walked in there was a big crack in the front door. The receptionist was nice but could just about understand us. We had to ask for toilet paper although we got there at 6pm, obvious not very well set up. Our room, number 2, next to reception. As soon as we opened the door the carpets were thread bare. The \"en suite\" was the smallest room, if you tried to turnaround you'd get stuck. There was a massive crack in the sink, which was in the room!!! not the bathroom. The carpets were filthy, curtains hanging off, lamp shade from teh 80's dirt still attached. There was a massive spiderweb with dust attached, easily 5 years ols. There were marks on the wall which I can only descibe as \"poo\". I'm pretty sure something bit me in bed as I have a lovely bug red mark. And the view, well a prison would have looked nicer, with broken glass and barbed wire to look at. Nice. The food was OK but the dining room small and damp running all down the walls. The toilet decided not to flush, although we could hear water running outside, leaking down the wall instead. We went to take a shower to find the lack of cold water meant only one thing, boiling hot water. I wouldn't recommend this hotel to a flea or shabby dog. It needs knocking down or condemning. Disguisting", "Date": "November 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Don't let the bedbugs bite!”", "Author": "Gogogirl45", "ReviewID": "UR71451895", "Content": "Not a great experience. As soon as possible, I had to move. Run by young girls from out of the country--with no recourse when there were problems. I did finally manage to get a refund, but that didn't compensate for moving from room to room and the bug problem!! Also, the fan and t.v. in one room didn't work, and contrary to what their really wonderful site implied, there was no internet available.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Wenatchee, WA", "Title": "“poorly maintained and extremely dirty”", "Author": "LoriRae", "ReviewID": "UR50841912", "Content": "I stayed at this hotel in 1996 and 1997. I do not believe they have vacuumed since. The sink was cracked. The toilet seat did not fit properly. The carpet was heavily stained, damaged,and filthy. Do not take the single room. It was a claustrophic closet with a leaky sink. I did not eat the breakfast fearing the potential hygiene in the kitchen might be the same as the room care. Staff is friendly. Management is indifferent. I was planning to stay there two nights on my return to London. I told them I would not return due to the condition of the place and wanted my deposit back. That was almost 3 weeks notice. They refused but I was able to get VISA to refund part of it.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Lincoln, England", "Title": "“Not so bad - not so good”", "Author": "Lincsdumpling", "ReviewID": "UR28958813", "Content": "We stayed at the Alexander Hotel last weekend when we went to see the London Marathon. I normally check things out with Tripadvisor first but we were pushed for time so I took a chance and made a booking then felt very worried when I read the reviews. So what was our experience? Well, on the positive side, it is very close to Victoria Station thus making London very accessible. We did not have any problem with the booking - we were late arriving but the nice woman on reception buzzed us in and was very polite and competent. The staff are mostly young European women and they were all helpful and charming. We were a bit early for breakfast but the young lady let us into the dining room and promptly took our order. The brekafast is not going to win awards but we had cereal followed by toast and scrambled egg along with a cup of tea. All perfectly adequate. On the downside, the rooms are small and although we had quite a nice tv in our room, the tiny one in our daughter's single room did not work. That said, we were out all day so that was not really an issue for us. The showers are ok but hot water is still hit and miss. The rooms are cleanish but they certainly are not particularly modern. My daughter thought her room was a joke when we opened the door to be faced with a doorless hanging wardrobe to the side and 2 white fire doors in front of us. In fact, the tiny single room was hidden behind these very springy doors. Hmm. Not sure that would impress anyone! Overall, they seem to have improved on the meet and greet front and the rooms are ok if you just want somewhere to dump your stuff and go off round London. The staff are also very good about allowing you to leave bags at reception once you check out. Would I use it again? Probably not.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "antwerp", "Title": "“perfect for the BUDGET (!) traveller”", "Author": "beckielein", "ReviewID": "UR27693019", "Content": "A very nice hotel for the budget traveller. Don't expect too much, it still is a cheap hotel (very cheap for london). The rooms were small but ok, we allways had warm water. The personnel was very VERY friendly and the breakfast was good( bacon with eggs, toast, warm and cold drinks, cereals and sometimes fruit). It was no problem to leave our luggage in the hotel after we checked out yesterday morning. The location was super! I can understand that persons who are used to stay in \"posh\" hotels don't like this hotel, but for the budget traveller who is used to staying in cheap hotels, this hotel is perfect. I've stayed in very bad hotels over the years and this certainly is not one of them. Just one thing: we slept in room 22 and the floors of the rooms above us made noise(all the houses in the area are very old, this is normal), so if you are not a steady sleeper,bring some earplugs.", "Date": "April 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Bad Experience with Alexander Hotel London”", "Author": "CAP54", "ReviewID": "UR17989822", "Content": "Filthy bathroom. Mold on the tiles. The drain from the shower upstairs leaked through the ceiling of the shower in our room (see photos). We checked out early because of the dirty conditions of the room.", "Date": "July 17, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ashburton", "Title": "“Very disappointed”", "Author": "beckagray", "ReviewID": "UR15392430", "Content": "My mother and I arrived in London at 6am. Got a shuttle to the Alexander. When we arrived (after a 14 hour flight) there was no room for us until 12pm. Reception guy was unhelpful. Were able to get changed in a 1m sq toilet room and then headed out for breakfast. A shower would have been great - but no. When we finally we able to get to our room, we found a dingey little box of a room. The two single beds were about 2 feet apart, the beds, duvets etc were probably pre 1900s. It was a real let down for our first trip overseas. We would have happily paid way more for a decent sized room and a bit of polite, helpful service. Would only recommend this place for backpackers - but it would be beyond their budget!", "Date": "April 27, 2008"}, {"Ratings": {"Service": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "France", "Title": "“the door was closed...”", "Author": "ventilo", "ReviewID": "UR14828746", "Content": "We came from France for a two nights stay, and we had booked the Alexander Hotel using their website, with a full night advance payment. When arriving at the front door it was closed and there was a \"hotel full\" sign, no one answered the bell, we tried to phone the hotel and heard the ringing inside but no one answered... After 20 minutes waiting we decided to look for another hotel and luckily we got one room at the one next door, alas only for the first night. One hour later we got out for dinner, and we saw that the Alexander Hotel receptionist was back ! I then had an explanation, the guy said he was out for only five minutes... I asked if we could come the day after and enjoy our second night but he just reimbursed my advance payment and told me he had no room available !! What a reliable place, and what a warm welcome to London, this is a shame.", "Date": "April 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Brasov", "Title": "“Terrible”", "Author": "Hera1978", "ReviewID": "UR13604198", "Content": "Verry bad experience!!! The room dirty, the bathroom dirty. The house lady not friendly. The breakfast low quality!!! Don't go to Alexander Hotel, worst experience ever!", "Date": "February 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Functional, at best. Might try something else.”", "Author": "EbethDallas", "ReviewID": "UR11190560", "Content": "My husband and I were trying to take in a lot of Europe in two weeks, and we didn't want to spend a lot of money on the places where we slept. Based on my research, hotels in London can be pretty expensive, so when I found a decent deal on the Alexander Hotel, I took it. We stayed there for two days, and the location was decent, but the accomodations were nothing to write home about. The room we stayed in was tiny with pretty much just enough room for the bed and a small table. The bed itself was comfortable. The bathroom was very small and the shower was a problem. The shower had warm water but sprayed in a strange pattern, and no matter what you do, the floor becomes thoroughly soaked. I believe I read this in another trip advisor review and thought that wouldn't be a big deal, but an inch of water covering the floor in cold London is really uncomfortable. If you take a shower in the evening, the water is waiting for you in the morning. God help you if you are wearing socks. We had a first floor room, but there is no elevator which may make it difficult for guests who have difficulty lifting their luggage. The breakfast was unremarkable but also unoffensive. I do have to say that the location was pretty nice. It was only a 5 minute walk from Victoria Station, and we actually rolled our luggage from the station to the hotel. We were also not far from the meeting point of our tour to Stonehenge. In its favor, the staff were very accomodating and met us back on a Saturday to give us our luggage that they had held while we explored the city. We were greeted warmly at midnight when we first arrived as well. For the sake of what feels like a family-run business with kind workers, I would like to recommend this hotel, but I greatly hesitate to do so.", "Date": "December 1, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "uk", "Title": "“Renovation Needed”", "Author": "Macky300", "ReviewID": "UR10425974", "Content": "Typical of RIP-OFF Britain. Â£75 P/NIGHT in London is cheap but you should still get some quality for that. Sad to say - This is not a qualtity hotel & needs a complete renovation. Old dirty paisley carpets, tatty worn out curtains, 1960'S bathroom tiles, an old mattress on top of another old mattress made a good nights sleep impossible. It was like sleeping on a water bed. Electrical sockets hanging from the wall, TV with bad reception tatty furtniture, radiator blocked by wardrobe, noisy rooms & street BREAKFAST - well not an English breakfast as described, only 2 items on the plate, egg & bacon, so what happened to the rest?. If this was abroad you would complain, but this is typical of some of the crap accomodation in Britain. I was glad to get out of the place. Forgot to say, upon arrival the toilet had not been cleaned from the previous occupants and there was feces in the toilet basin. I won't be returning! No wonder people go abroad!", "Date": "October 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great breakfast”", "Author": "gjpac", "ReviewID": "UR10070189", "Content": "Hotel Alexander B&B is a great place to stay in London for cheap. It's near Victoria Station, walking distance to Buckingham Palace and Big Ben. Room and washroom are always clean. But if you don't already, I suggest to bring your own soap and shampoo as they don't provide you good stuff. ( i always do) Breakfast is great. Eggs and bacon with toast and fresh coffee or tea, orange juice. Or choice of cereals and fruits. They say they have a tv lounge,,,but we never found it. No concierge/reception 24-7. Near the supermarket. my husband and I love Indian food. there is a place called Indian Diner on Rochester way (sorry i forgot the address) but you can google it.", "Date": "October 12, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle", "Title": "“Good deal- but get an upstairs room”", "Author": "French_McGuire", "ReviewID": "UR6750607", "Content": "Good things: cheap for an en suite room, easy to book on-line at their website, fairly close to Victoria Station, friendly staff Not so good things: the ground floor rooms have terrible views- (so just request to be upstairs!). We stayed at the Alexander Hotel for 4 nights- in 2 different rooms in October. We opened the door to our first room (right next to the office) and we would have been a bit upset had it not been for our exhaustion/excitement for our first night in London after 24 hours of air and land travel. Our ground floor window looked out at a dirty alley and dumpsters with zero sunlight. The bathroom had a semi-non-flushing toilet and a shower that was about 4 feet tall. Oh well- we only paid 50 L/night, and we came to see the city- not the inside of our hotel room. We walked out the front door of this B&B to see many other similar B&B's (no shops or cafes)- about a 5 minute walk from the huge Victoria Station. We looked up to see a few rooms that had balconies- what do we have to do to get one of those? we thought as pictures of our dark alley view flashed through our minds. Guess what- our second two nights we were given one of the rooms with a balcony- lucky us. Same price- MUCH better room. We'll request a second floor room next time. Breakfast was very average- but it did the job. I believe that this is a low-cost B&B- so the other occupants tended to be young travellers like us. The best thing about the small dining area was that you basically had to share space with the other travellers- which turned out to be a good thing- why travel if you don't intend on meeting people from other walks of life? I wouldn't recommend this B&B for a couple that plans on spending lots of money on nearby fine dining and wants a fancy room with a great bathroom. The Victoria Station area isn't filled with trendy cafes and shops- but it is walking distance to lots of the churches and royal stuff. I would recommend this B&B to someone who just wants to be in London- plans on Tubing and walking- doesn't plan on spending much time in the room.", "Date": "February 6, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Lancashire", "Title": "“Could do better”", "Author": "A TripAdvisor Member", "ReviewID": "UR3522049", "Content": "Wanted some where to stay close to victoria coach station and this is spot on , close to all of London's sites, but is in need of refurbishment . The decor in the bathroom was straight from the 60's & hasn't been changed since. bathroom was musty and the fan didn't work ,room was small , a double bed in a single room. Cooked breakfast could have more variety , excellent website for easy booking shame the hotel is not more up to date. probably would not stay here again unless they had undertaken refurbishments ....but you pays your money & takes a chance, as they say!!", "Date": "June 2, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Comfortable and cheap”", "Author": "A TripAdvisor Member", "ReviewID": "UR2852969", "Content": "Not at all as bad as the last reviewer suggested, I found this place on the contrary to be quite good. Our room was indeed small but that is par for the course in Europe, and the bathroom was no closet, in fact it was a decent size with a big headed shower too. I was pleasantly surprised at the breakfast and the location is about five minutes from the main station. There are more hotels on this road but this is one of the closest to the station (maybe the closest?) and after spending the day touristing around the city it really takes it out of you so we were thankful for every step saved! Finally the place was packed every morning at breakfast, I always take this as a good sign for a restaurant or hotel when travelling. We paid 65 sterling per night. The five star around the corner wanted 120 - why bother if all you need is a cofortable sleep with breakfast?", "Date": "November 29, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Los Angeles, CA", "Title": "“A little better then a hostel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2826866", "Content": "I stayed in this hotel for two nights last May (2004). I was glad to leave. The place had an old smell to it. The bathroom was a converted closet and the toilet did not flush. There was a big hole in blanket. The room was very small but it seems that most hotel rooms in Europe are small unless you are willing to pay a lot of money. The only good think about this place was they had a fairly good english breakfast. It's also hard to find, even with the directions on their website. I wouldn't go back to this hotel.", "Date": "November 15, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Chicago", "Title": "“good for the budget traveler”", "Author": "heyul", "ReviewID": "UR2623167", "Content": "We stayed in the Alexander Hotel for 4 nights a couple of weeks ago and over all found it to be a good stay--especially at London's high prices. The location is great, the staff was courteous, the rooms were somewhat dated but pretty clean, and super euro-tiny (but we expected that) but we had a little balcoy that looked onto the street which was great. My only complaint was the bed was awful--way too soft and the mattress springs poked you all night--I would have slept on the floor had then been floorspace to sleep on! The breakfast is ok. We skipped it 2 days. If you go--make sure you stay on the 1st or 2nd (which in america would be called the 2nd and 3rd) floors.", "Date": "October 6, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "santa barbara, ca", "Title": "“Good place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR2185906", "Content": "Despite reading some mixed reviews we decided to stay last minute when a friend came back from a trip to London to say she had left another hotel on the same road (Holiday Inn) and moved to the Alexander hotel for a better price. Staff were helpful (the girl on reception found an indian restaurant on the internet for us) and the room was clean and bright, a bit tight around the edges but the shower in the bathroom had a fabulous extra large head which was just great! Price is right (65 pounds) and the place is close enough to the station to walk (which saved a cab fare). Bad points: breakfast is only to 9â€¦ we arrived just before 10 on our first day (but they gave us toast and coffee still). The weather was in a heatwave so without air conditioning we had to leave the window wide open all night but it wasnâ€™t too bad. There was no hairdryer but again the receptionist gave us one to keep in the room when we asked. Summary: excellent website (our room WAS as shown on the site) with directions and information, genuine staff, location in a good spot, a few bits here and there but nothing major and nothing you wouldnâ€™t expect in this price range anyway. At the end of our trip we left London feeling good, the Alexander is a friendly place to stay folks, if you ever go to London give it a look in!", "Date": "June 13, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Houston, TX", "Title": "“A very enjoyable stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR2184911", "Content": "My husband and I stayed in the Alexander Hotel for four nights in May, and we found it to be a very pleasant experience, contrary to the previous reviewer. It is certainly what one would call a budget hotel, and travelers should expect to get what they pay for, as it is a relatively cheap option for London. The carpet may not have been exceptionally clean, but everything else was wonderful. We stayed on the first floor (second floor in the U.S.) and although our room was very small, it was comfortable and even had a balcony! It was very nice to sit out there in the evenings. Our room got street noise during the night, especially with the windows open for ventilation, but it was not a problem. I'm not sure if they have air conditioning in the hotter summer months; should check. We very much enjoyed the English breakfasts, finding the eggs not at all hard. There was a good selection of food. One of the best parts was the en suite bathroom, which is a rarity in London B&Bs in this price range. Ours was great except without a shower curtain. All in all, a very good option for someone on a budget and very acceptable. Also in an excellent location for sights and Victoria Station. Highly recommended!", "Date": "June 12, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Small, Clean & Friendly!”", "Author": "TravelingASAP", "ReviewID": "UR2183783", "Content": "The rooms are very small but the hotel is clean and the service excellent! We had room 12 which overlooked the busy street, but had a small balcony with two lounge chairs. We were only in the room to sleep at night anyway. It is located very close to Victoria Station Tube/Coach so getting around is easy. If you want a large, luxury hotel room go somewhere else! We would revisit the Alexander based on the great customer service and the price!!!", "Date": "June 11, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Amsterdam", "Title": "“Misleading website, don't take room #2”", "Author": "gdekui", "ReviewID": "UR2172695", "Content": "After reading the former possitive reviews, I couldn't be more disappointed when I arrived at this hotel. Not only our room doesn't look far from what is represented on their website -- it was almost a time warp experience! My girlfriend couldn't stop laughing when I had a photo made with me pointing at their '70's looking but not hip curtains and carpets. There is nothing chic nor tasteful about our tiny room #2. Either you requested not to stay at the ground floor or just go for their twin bedrooms. Ours was very disappointing, it was dark and the furniture is very old. The room looks like under renovation, and we had the most hard fried eggs for breakfast ever. Too bad for the service was indeed friendly.", "Date": "June 8, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Dallas, TX", "Title": "“Friendly Staff vs. Odd Smells”", "Author": "A TripAdvisor Member", "ReviewID": "UR1440523", "Content": "Positives: The hotel has a great internet site that is easy to navigate, informative and reservations can made through the website. The staff, especially the wait staff, are very friendly and helpful. The free breakfast was good: eggs, bacon, toast, cereal, fruit, etc. The location is good, 5 minute walk from Victoria Station and other tourist sites, such as Westminster Abbey, were about a 15 minute walk. Best bar around was The Elusive Camel. The location was quiet and the bed was comfortable. Negatives: My room did not have a heater or radiator when I arrived, fortunately when I asked the front office the manager immediately grabbed a temporary radiator from his office and took it up to my room and plugged it in. The last night I stayed a radiator had been installed in my room, but it covered the cable outlet, and therefore I had no TV, and I could not get the new radiator to come on. There was a weird smell in the hallway and in my room. Opening the window during the day helped, but not quite enough. The bathroom had some mildew and the air vent was clogged with dust bunnies. Other than that, the room was clean. I would probably not stay here again, but the price is right for a few nights.", "Date": "November 6, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Won't hesitate to stay here again...”", "Author": "A TripAdvisor Member", "ReviewID": "UR1154537", "Content": "Planning a trip to London, this is a great hotel to stay at! The employees went above & beyond to help us, they were really the best staff at a hotel myself or my girlfriend ( very frequent travelers ) have ever encountered. Not to mention the best breakfast we've had at a hotel ( who says English food is bad? )... These praises aren't idle folks, we really had a great trip, due in large part to this hotel. The downside of the hotel is, as with most hotels in the UK, the rooms are REALLY small. If you are traveling with more than 2 people, it will be a real tight fit. We had some friends stop back by the hotel at night & could barely fit the 4 of us in the room. But, if you are tripping thru London either by yourself or with a close friend, they won't come much better than this hotel...", "Date": "July 31, 2003"}], "HotelInfo": {"Name": "Alexander Hotel London", "HotelURL": "/ShowUserReviews-g186338-d254525-Reviews-Alexander_Hotel_London-London_England.html", "Price": "$95 - $103*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">13 Belgrave Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW1V 1RV</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "254525", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/db/alexander-hotel-london.jpg"}}