{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Huatulco, Mexico", "Title": "“Expensive for what it is”", "Author": "Dakini68", "ReviewID": "UR125746095", "Content": "Trendy, lacking in personality and not worth the extravagant room rate.  The bed was comfortable though and the large bathtub was a plus, but it didn't merit five hundred dollars a night.  The staff was professional but not very personable.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Stylish Hotel in the Polanco District”", "Author": "PBKucka", "ReviewID": "UR120755589", "Content": "Very modern and stylish hotel in the center of the Polanco District. It has access to all your top international designers just down the street. There are some fabulous restuarants as well that the concierge can recommend. The rooms have all the modern and tech-savvy amenities you would expect from a hotel of this calibur, and the beds are very luxurious and comfortable. The entire establishment is filled with light-colored furnishing and glass fixtures. We had no issues with any of the services provided and it the staff was very professional and courteous. We would recommend this hotel to anyone looking for a stylish property in Distrito Federal of Mexico City.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Troy, Michigan", "Title": "“Reliable hotel in Polanco neighborhood”", "Author": "Scott Z", "ReviewID": "UR118456464", "Content": "The hotel is very clean, modern and hip. Polanco is also a great alternative to the more costly Condessa or the busier and more touristy Reforma areas. The rooftop bar and pool area is a little tiny and crowded. Service at the bar moves at a snail's pace. Each night I was there, it seemed to host some private event, so be prepared that hotel guests get shut out of pool / bar access frequently. Still, if you can get in for a drink in the evening, do it. They play electronica lounge style music and project artsy videos on the wall of the neighboring building from the rooftop. The vibe is very young and trendy. Breakfast at the ground floor restaurant is also reliable, with an excellent fresh juice assortment.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Noise in my room”", "Author": "pfiec", "ReviewID": "UR118365736", "Content": "Basically, I was up all night because there was this loud water noise. Like running water swirling around the pipes next to my bed. No sleep. I went to the lobby and they said they had no rooms because they allowed another hotel 20 minutes away to use up all their spare rooms. Hmmmmm, so couldn't they put one of those people in my room? Nope. Great location for sure! Very happy about that, but the hotel is trying to hard and just not making it.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Birmingham, Michigan", "Title": "“Minimal coolness!”", "Author": "LindaWolff", "ReviewID": "UR115811453", "Content": "I Always stay at the Habita hotel when I go to Mexico City. It's cool very minimal and white... very white! The breakfast is pretty good with that great granola! We love to chill at the pool and have some cocktails as well as the roof top while we listen to good music and have drinks with friends. Love it!", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect location. Nice hotel. Excellent service.”", "Author": "TequilaSauza", "ReviewID": "UR113559094", "Content": "This hotel is located in the heart of Polanco and although traffic in Mexico is always challenging you can find easy access to all parts of the city. The hotel is small yet has all services you can think off. The rooftop is very enjoyable and the service is outstanding. Having breakfast in the hotel is ideal and they make each coffee individually. It may be a little slow at times but the food tastes great.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "UAE", "Title": "“Avoid at all costs !”", "Author": "Elsieelsiemousset", "ReviewID": "UR110229635", "Content": "This is nothing more than a cafe, bar and pool ... with rooms. Roof top pool and bar (the size of the shoe box) is turned into a rave party venue every week end from 3pm till 3am the next day, therefore you will not be able to use it and most importantly you will never sleep nor be able to listen to your TV! Think of blasting music travelling through all the bedrooms, drunken people wondering throughout the hotel and bedroom corridors all night, and empty bottles floating on the pool the next day (cigarettes buds, broken glasses in the sauna and jacuzzi). Overall facilities advertised are very misleading (the library is a bookshelf with one chair) and service is rather non existent. Ground floor cafe that is also the lobby shuts down at 11pm (main entrance locked, lights off, chairs up) so on your return from dinner you will be greeted by a security guard, cleaner and all the drunken people having a break from the party. On a more positive note housekeeping service is good and thank you to the young reception lady (never saw a Manager in six days) who upgraded us to a spacious suite on the first night, this from a standard room where the wash basin is not in the bathroom but next to the bed, be aware ... Great location in Polanko next to shops and restaurants. A veteran hotelier", "Date": "May 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Berlin", "Title": "“Amazingly overrated”", "Author": "rotebeete", "ReviewID": "UR106537558", "Content": "The best part of my stay here was that it was so short. I needed to extend my stay in Mexico City by a night and I thought I would try this place since everyone seems to rave about the hotels in the group. Upon arrival I was assigned a room with hair in the bathtub, which even otherwise wasn't in a great condition - the original white had become a sort of yellowish brown and the there were bits that had simply chipped off. When I complained, they first sent a maid who wiped down the tub and then cheerily showed it to me even though there were still strands of hair clearly visible. When I called again, they finally moved me to another room, which luckily didn't have a dirty bathroom. It was simply as badly maintained as the previous one. I pointed this out to the staff member who had accompanied me to the new room and he said he would go talk to the manager to figure out a solution and get back to me. I never heard from him again. The room did have a great all-glass wall. However at night I found out that the curtains don't go all the way down to the floor, so that it was the same as if I was sleeping with a light on all night. At 7am, this became more like a bright fluorescent light. The designers also didn't seem to think any sound-proofing was necessary, perhaps because they haven't ever tried to sleep in a room facing a street in Mexico City. At breakfast the next morning, I barely saw any staff and definitely wasn't acknowledged by any of them until one of them came running over as I got up to leave, to make sure I wasn't trying to escape paying for my food. All in all, a pretty miserable experience. Despite the discounted rate that I got on the internet, I felt I overpaid by a lot. I'm sure the place has decent rooms, but the two I saw would be unacceptable even in a three-star hotel. And the service would still be the same, as would be the \"free internet access\" that only seemed to work on occasion.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Great boutique hotel!”", "Author": "BrazilAca", "ReviewID": "UR102836798", "Content": "Habita is an extremely trendy boutique hotel! Great location, in Mexico DF fanciest street. Excellent bars and restaurants in walking distance. Great staff. The rooms are incredible, lounge music playing 24hs / day and very tasteful decoration. However this is a hotel for non-business travelers. It can be noisy at night and a terrible wi-fi connection. Nevertheless, a great hotel for nice day in the Mexican capital.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A great base from which to explore the city”", "Author": "ditzyali", "ReviewID": "UR102057954", "Content": "Went to Mexico City to visit some friends, see the sights and get some sun. As a solo female traveler I wanted to be somewhere where I felt safe and where the staff would remember me - thus I chose this hotel with a small number of rooms in a great neighborhood and a great rooftop terrace with views over the city. I was so right! The staff were wonderfully attentive, particularly the staff in the restaurant and everyone was friendly. I would definitely recommend the breakfast here which offers a range of foods from the lighter fruit and yogurt option to amazing hot cakes with syrup to delicious local food. There's a cold buffet at 180 pesos, a hot buffet for 225 pesos but I preferred to order a la carte which in many cases was cheaper and still set me up for walking around the rest of the day. The clientele tends to vary between smart businessmen to more creative industry people and stylish jet set types however I never felt out of place or awkward despite occasionally appearing in a pretty casual skirt and flip flops. The environment is relaxed. The room was clean and the bed extremely comfy with a duvet. The hotel has free wi-fi throughout which is a great plus for keeping in touch with friends and family and the rooms are all fitted with Sony t.v and dvd players with dvds available for rental at the desk. The room has an enclosed balcony for those smokers out there. Be aware- After reading reviews here I decided to bring earplugs and I was totally right to do so as between the noise from traffic in the street or from occasional events at the bar on the roof, you may find it hard to settle to sleep. That said... with earplugs in, I slept like a baby - events ended at midnight and the cleaning staff never bothered me in the morning but patiently waited till I left my room for the day. Another point to note is that the temperature drops quite alot at night in Mexico city so warm PJs are recommended. Taxis were easily arranged for me to head to other parts of town and there is also a hotel car although I didn't use it. The real attraction for me was the rooftop terrace and bar- the terrace was the perfect place to sunbathe throughout the day with a small pool big enough to do laps and cool down. While it was sometimes closed during the day for photoshoots these tended to be over by 2pm which left pleeeenty of time to catch some rays. At night, the rooftop bar projects old movies onto the white wall of a nearby building and serves great light bites and cocktails, it was a great place to take my friends from the city who were also very impressed with the place. Overall- I had a great time, felt really safe and welcome and am very glad that I picked this hotel for my first visit to Mexico city. While I would not recommend this place to families with young children, older couples, light sleepers or people who just want somewhere out of the way and quiet - if you want a cool place to chill by day before sightseeing and then relax in at night, this is a real gem.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tiebele, Burkina Faso", "Title": "“Disappointing”", "Author": "y2kmx", "ReviewID": "UR92218384", "Content": "I stayed there for 3 nights in early December, staff where nowhere to find when needed, first day when coming back around noon for a quick nap, I found the whole floor and obviously my room, smelling like varnish and paint, it caused my like vomiting, and as it is all closed, there was no ventilation at all and air conditioning was not working fully... When complaining to front desk, they just seemed to ignore my complains and made me feel I was magnifing it all!!!..., but they did not want to come up to my floor to check how bad it was... Internet service expensive and soo slow... Restaurant too fancy for a nice and quick breakfast!!!... I would not recommend it or go back there gain ever!!!...", "Date": "January 8, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“The place for business”", "Author": "MAM1273", "ReviewID": "UR90403909", "Content": "The hotel is comfortable, the service is really nice and personalized and the location is perfect for business, shopping or leisure.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“AMAZING AMBIENCE EXPERIENCE”", "Author": "LuckyLucy001", "ReviewID": "UR88657227", "Content": "It is the best option to stay in Mexico City, the location is perfect as it is the staff. I will definitely return to the hotel in my next visit.", "Date": "November 30, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“unpractical and not a hotel for family!”", "Author": "spersan", "ReviewID": "UR84454037", "Content": "I have been in this hotel with my husband and our little son. it was a horrible experience! first of all rooms don't have a good isolation system and noise and pollution filled our room easily. toilet was quite smelly even when we didn't use it ( no good ventilation system)! this design hotel is not much practical and the staff are not much helpful neither. once because of a wrong address which we got from one of the staff we got totally lost! to get an extra Duvet I had to call several times and after a while not getting one I had to go down to the reception desk myself. the only good thing I could recall in this hotel is the restaurant! please rethink if you want to stay in this hotel!", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful Boutique Hotel in DF”", "Author": "Samloujohn", "ReviewID": "UR79379585", "Content": "This was our first stop in Mexico and we definately made the right choice with the hotel here. La Habita was located in the very plush Polanco which made you feel safe and had some lovely restaurants to offer close-by. The concierge were extremely helpful here in helping us plan our days and even organizing our tickets to the Lucha Libre. The rooms are sparse and modern with enormous bathrooms. The roof top bar and pool are luxuries, it's just a shame that the weather wasn't warmer during our stay. If you book in advance online you can get some quite cheap deals otherwise it may be quite pricy if you turn up without reservations.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam, Netherlands", "Title": "“Details”", "Author": "Pincut", "ReviewID": "UR71869010", "Content": "I was really looking forward to Hotel Habita, believing it to be in the vanguard of Mexican design. It was ok. It actually looks a little dated already. The furniture in the main restaurant and lobby is very beautiful, but the bedroom decor is too cold: I am all for minimalism, but found the rooms pretty uninspiring - and kind of a copy of The Standard hotels in the US from about 6 years ago. Overall, however, the experience at Hotel Habita was let down by service and details issues: The reception staff were never at reception, and always in the room off reception, where they took their meals, hung out, worked on computers etc. So you always had to call them, and then they'd break off whatever they were doing and come assist you, whether covered in crumbs from whatever they were eating, or being in the middle of something else which they wanted to get back to. Service in the restaurant was terrible. We had breakfast there 2 of the 3 days we spent at the hotel (we gave up and went elsewhere on Day 3). There was one guy working both mornings. We always had to get up from our table and go ask hum for stuff - he never came near us. The buffet had no clean bowls the first morning. They ran out of food both mornings. On the second morning, we ordered omelettes. After 45 minutes waiting, we gave up and returned to our room. 5 minutes later, we got a call - staff were mystified as to our whereabouts, and explained our food was ready now and we had to go downstairs to eat it. Maid service was very good in terms of cleaning. However, there was quite a random approach to replenishing toiletries. On our first day, we had a full set of Kiehl's products. On Day 2, we were left 2 bottles of conditioner, but no shampoo or body wash. On the third day, we were left one bottle of shampoo from a different brand which I didn't recognise. Random. Do not take the hotel's car service: it is crazy expensive (even by the usual standards). We were charged $10 for a 3 minute ride to Izote restaurant: the walk back to the hotel took 10 minutes. Similarly, we were quoted $150 dollars for a trip to Teotihuacan to see the pyramids: we simply made friends with a cab driver from the rank at Polance metro station who took us for $70. The fitness centre at the hotel is crappy: a couple of old machines, outdoors, by the pool. Overall, the experience at the Habita was ok, not great.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very cool, excellent value, but not great for business”", "Author": "rafkam", "ReviewID": "UR60729576", "Content": "On a recent business trip, I was hesitating between staying at the Intercontinental, and here. The rates were similar, but I chose Habita as I tend to prefer independent boutique hotels, even whilst on business. This hotel is perfectly located in the upmarket neighbourhood of Polanco, close to many boutiques and within walking distance of many nice restaurants (Gaston y Astrid, Peruvian restaurant is a must). Also a 15 minute stroll from Bosque Chapultepec and a few blocks from the metro station. The building is quite unique, and the reception area is dominated by a very cool looking restaurant. Staff are nice, but would help to have a more knowledgeable concierge. They merely contend with booking the restaurants you ask forâ€¦ The rooms are very big, with a nice minimalist decoration. Bathroom is very cool and big as well, loved the shower. I also loved the balcony with the frosted windows which meant plenty of light, but you kept the privacy in the room. Only complaint is that the phones in the room worked very poorly, with loads of static and werenâ€™t loud enough (not ideal when sitting through a 2-hour long conference call). Well stocked minibar, but sadly, abusive pricesâ€¦ The rooftop pool is beautiful, with a great â€œwadingâ€� area for just lying on the pool. The rooftop bar is very happening, with good cocktails and very cool b&w movies being projected on the side of the building across the street! Great place to rub shoulders with the beautiful people of Mexico city. There's also a rather small fitness room, which nevertheless serves its purpose well. My biggest complaint would be the noise from the upstairs bar. You do get loud music until 2-3:00AM, and as my room was directly below the pool, I could hear the banging noise of high heels above my head (there was an event in the hotel, with models using one of the conference room as a make-up/changing room). Iâ€™ve had in-room brakfast and the food was really amazing and plentiful. The downstairs restaurant is a great place for a business breakfast, by the way. There are also two, barely used computers next to the pool, with a printer, which is very handy. All rooms have free wi-fi anyway, which is a big plus. Great place to go on holiday and I would stay here again, but next time Iâ€™m in Mexico City on business and need a quiet nightâ€™s sleep Iâ€™ll probably go to one of the big hotels on Campos Eliseos.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Small, friendly , excellent service”", "Author": "Biztraveller222_10", "ReviewID": "UR54444657", "Content": "I stayed the three nights in early December on business, and I was very pleased, it's not an anonymous, vacuously plush chain hotel, it's very minimalist and calm in its mood. The staff get to know you very quickly and are really helpful, and the food was great - for breakfast the best granola I have tasted, fantastic coffee and room service was good too. Location cannot be faulted. I am not particularly trendy - 50-something mum of 4 - but really liked the modern stripped-bare decor certainly for a hotel and its unpretentiousness is very welcome compared to the usual stuffy 5 star business hotel. It was a bit noisy on Thursday night, and I can imagine that weekends may get noisy as there is a great rooftop bar that is v popular . I am staying agin in Feb - hoping it will be as good", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Contemporary minimalist hotel in the heart of Polanco/Mexico City”", "Author": "StrappySandals", "ReviewID": "UR53365994", "Content": "I stayed at Habita for 4 nights and it was very enjoyable. The hotel was quiet, but had a lively bar scene on the gorgeous rooftop terrace in the evenings. I spent many mornings relaxing by their gorgeous rooftop pool. The staff were very friendly and helpful. We had breakfast here every morning, which was a bit overpriced for the buffet. Although, we ended up just having granola and yogurt most mornings, so they only charged us for that and it was reasonable. The rooms are very comfortable w/ a strange terrace. It had frosted glass from floor to ceiling w/ just little clear slits where you can peek out onto the street life. It's probably just as well because the city scenery next door wasn't terribly alluring. The area is very convenient. We walked to many restaurants and felt quite safe . The luxury boutiques, such as Chanel, Prada, etc., were a short stroll away. It was centralized enough to get to be able to explore different areas quite easily.", "Date": "January 13, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "new jersey", "Title": "“Centrally Located & Great Food”", "Author": "robinyoung", "ReviewID": "UR51064565", "Content": "La Habita was centrally located and safe surrondings. Front desk was very helpful and pleasant. Departure staff may not have listened to direction of mailing business products back and all Corporate goods have now been STOLEN or THROWN out. Staff has not responded to assist me with resolution but after each member was given FREE eyeglasses the entire salemen sample bags appear to have gone missing.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Good for business travel, young hipsters and affairs”", "Author": "DCDireWolf", "ReviewID": "UR45582083", "Content": "I didn't love Habita. I think that's because it's too modern and hip for my taste. I think people in their 20's, people looking for nightlife on site, people having affairs, or business travelers might enjoy it more. It's clear that the image they want is hip, modern, club-style, young, new, hot spot, etc. It's a trendy kind of place. Fills up on weekend nights with local club goers. It's also pretty expensive, but everything is in Polanco (the Beverly Hills of Mexico City). It's very modern in style, minimalist rooms, low rise beds (but soft), small bathrooms with modern fixtures, mood music and dance music piped in to the room (you can turn it off if you like). Bar on the first floor seemed nice. We didn't try it. Room was clean and comfortable and a bit on the small size. Internet worked well. The bar on the roof is nice, with a view of Polanco and the tall buildings near Reforma and a small pool with overpriced drinks. Heavy crowd of hip young people, club going types, and business men. It's definitely a \"fresa\" kinda of place. The location is perfect, right in the heart of Polanco on a busy avenue near shopping, eating, bars and the Metro or numerous cabs, short walk to Chapultepec Park and other sights. One problem we had was that when we arrived they first refused to honor our reservation claiming \"maintenance problems\". Truth was they overbooked. They offered to send us to a sister hotel in the suburbs, we held our ground and they eventually gave us someone else's room, who must have had issues when they arrived later. Otherwise the service was fine. My wife and I just kept thinking that a lot of affairs must go on in this place.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Worth A Try”", "Author": "amennyc", "ReviewID": "UR41737750", "Content": "I like this hotel. Itâ€™s the second time I have stayed here. The hotel is low key and modern enough. The first time at this hotel was better than this last trip. Felt like management had changed. Some things good have been better. If you get a good rate off the website, itâ€™s a good value. Otherwise, you might consider other options. Regardless, I would still come back and give it another try. It could have just been that particular stay. The location is great. Wonderful neighborhood with many restaurants and cool architecture. The reception is very helpful and attentive. Always willing to listen.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "tel aviv", "Title": "“Beautiful boutique hotel... What a rooftop pool!”", "Author": "dan20", "ReviewID": "UR36915917", "Content": "Loved everything about this hotel, the decor, the ambiance, the service... The rooftop warmed pool is smashing - such a pleasure dipping in the warm water when it rains.... This is what a botique hotel should be like! The only thing that upset me was the price of the laundry - over 50 bucks for some shirts and undies! And be careful of the smoking floor (3). Aside or these - highly highly recommended!!!!", "Date": "August 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Acapulco, Mexico", "Title": "“Unbeatable location”", "Author": "archibalda", "ReviewID": "UR36022888", "Content": "Right in the middle of Polanco with great shopping and great restaurants within easy walking distance this discreet, comfortable trendy hotel is a little treasure. The restaurant is also extremely good with the best \"Lamburger\" I have ever had !!", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A little hotel with a lot of heart!”", "Author": "acutetraveller", "ReviewID": "UR22422986", "Content": "We started our honeymoon in Mexico with a 3 night stay at the Habita. We managed to get a good internet rate (I don't know if we would have been so happy if we had paid the rack rate). The restaurant was great and we really liked the staff. Breakfast was particularly good and we had a delicious dinner there too. The chef was amazing! One night we had room service and that was really nice too. It is a very well designed hotel and we had a standard room. Although it wasn't massive, it was good for our purposes and is certainly very modern. We liked the toiletries provided. There was no view to speak of, but that wasn't a problem for us. It is central and easy to get around. We walked around a lot or got taxis and the subway and we always felt safe. The bar and swimming pool at the top were very cool, but we never went there or used the pool. It was useful to have access to internet on two PCs. We moved onto the W hotel for the last three nights. Although the W is more impressive, we liked the personality of the Habita. It is much smaller and less glamorous but has more heart. We loved Mexico City and would recommend it to anyone, there is a great mix of restaurants, museums and culture.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Asbury Park, New Jersey", "Title": "“Very Nice...”", "Author": "DSchaf", "ReviewID": "UR21798482", "Content": "Very nice hotel in a GREAT area. The rooms are clean and very chic. Some of the best restaurants are on the same street as the hotel as is some of Mexico Citys best shopping. BEWARE of room 45, it is directly under one of the LOUDEST tredmills the fitness center has. The thumping starts at 6am and ends at 10pm.", "Date": "November 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Lovely staff!”", "Author": "trnka", "ReviewID": "UR21652658", "Content": "After a seven day stay at the Habita, we're loving it!! The staff are warm and accommodating. Roman, the concierge, is especially helpful. As architects, we were captivated by the innovative design details of the hotel and found the neighborhood interesting architecturally. When a tour of the Barragan studio was shown as full on line, the hotel made last minute arrangements to successfully get us in and I'm grateful- it's not to be missed. The hotel also provided us with a very knowledgeable guide and driver for a tour of the pyramids of Teotihuacan- do not visit Mexico City without this side trip! Breakfast at the hotel is delicious- loved the fresh fruit! Booking this hotel at the Tablet Hotel site proved to provide the best rates.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Groovy, Great Service, Love the Location!”", "Author": "Roam-and-Home", "ReviewID": "UR19755888", "Content": "We stayed at Habita for two nights on the 4th floor early in the week. Our only negative comment is the noise that you hear not from the roof deck bar but from the gym in the morning ... other than that we loved our rooms (there were 3 of us traveling together), the kiehls products and the bed was comfortable. We ate breakfast in the lobby one morning it was very nice, service was a little slow, but that is Mexico for you (we are spoilt in the US). We also had drinks on the roof terrace, reasonable prices and very fun. Roman the 'Head Concierge' was a huge help in getting us connected with a driver & tour guide who had excellent english and knowledge of the history and architecture of the city. The price was very reasonable and there were no hidden charges for the assistance with our tour arrangements as other reviewers mentioned. All the staff at the hotel were friendly and helpful with any requests we had, and even made phone calls on our behalf to confirm reservations etc. The area is safe and we walked to restaurants in the late evening without concern.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Fantastic Hotel”", "Author": "Rosie085", "ReviewID": "UR17611089", "Content": "Habita is an amazing hotel located in a cool and central neighbourhood in Mexico city. From the moment we arrived to the moment we left we were treated like royalty. When our taxi arrived at the door the doorman were waiting to take our luggage and welcome us to the hotel. When we checked in at reception we were upgraded from a standard room to a superior and when we asked for a late check out at 5pm on our final day we were not charged. The hotel is beautiful with tasteful minimal style rooms, a great rooftop bar, nice (but small) pool area and a great ground floor bar & restaurant serving top class food and a good selection of wine. This all made for a really enjoyable stay and by far the best experience we had in Mexico. What most impressed us overall about Habita was the friendly and excellent staff. Everyone seemed genuinely friendly and happy and all were incredibly nice. Nothing that was asked for was too much trouble and the service in the bar, restaurant and at reception was fantastic. For this I imagine that management deserves a lot of credit and this hotel refreshingly seems to be really well managed. Finally for the location, style, service, food and rooms the hotel is very good value for money particularly if you book online.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Great hotel, but sneaky tactics”", "Author": "suzya76", "ReviewID": "UR15433039", "Content": "If I had written this review before check-out Habita would have, without doubt, received five stars. The room (we stayed in a middle-range one) was large by normal standards, well decorated, with an incredibly comfortable huge bed and a well-stocked bathroom. All the service we received was exemplary and the food and drink were good quality without being too crazily priced for a high-end hotel (buffet breakfast is not included in the room price but is US$12 and actually worked out slightly cheaper than eating the same at a local cafe). So we were pretty impressed - until we got our bill which revealed a number of underhand tactics. Firstly, the exchange rate offered is extremely poor even by hotel standards (we were given 11 pesos/dollar when the official rate was 10.2) So if you want to pay your bill by credit card or in pesos cash you end up paying nearly 10% more. The only way of avoiding this is if you pay in US$ cash - but as the rooms are about US$200 you're looking at a carrying a pretty hefty amount of cash around. Not a particularly pleasant prospect in Mexico City (in the end we never felt threatened but had been given loads of warnings about robbery etc before we arrived and hence avoided big wads of cash). Secondly - there are a load of things left out in the bathroom like an Evian atomiser spray and bottled water alongside the sewing kits/shower caps etc. A nice touch we thought, until at check-out we realised the sprays were US$10 each and the water was also chargeable (incidentally, we did check the minibar menu and checked for price tags on all of the items and there was no indication they were not complimentary). And finally, we asked reception to book a tour to Teotihuacan for us as we realised it was going to be tricky getting up there independently. We were given a price, but when we got the bill we found they had charged us a percentage commission on top of the price agreed. This was not mentioned when we booked it, and seemed like a rather odd practice - surely it should be the tour company paying the hotel commission for getting them custom, not the customer? Anyway, to cut a long story short we raised all of this with the manager when we got the bill and he basically said many guests had complained about the underhand charges, admitted it was 'unclear' the items were not free, but despite this would not budge on removing any of them from the bill. So a pretty unsatisfactory outcome. Overall I would recommend anyone staying at Habita to try and enjoy their stay but be aware they are likely to get stiffed financially.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Very nice”", "Author": "Devafish", "ReviewID": "UR13150233", "Content": "The service & care I received was amazing. The Hotel is very trendy and has a boutique hotel feel to it. I loved coming into my room and having music play in the room speakers. The hotel is located in Polanco which is a very nice & upscale neighborhood in Mexico City. Breakfast in the morning was very good, fruits were fresh & the ambiance was nice. This was included in our room rate! I recommend this hotel to anybody that wants to stay in a non resort like hotel & in walking distance to the many luxury shops in the area.", "Date": "January 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“was nice but will probably stay at condonesa next time”", "Author": "deemps", "ReviewID": "UR11288736", "Content": "hotel arranged for us to be collected from airport. we got picked up in a hummer which was fun. the staff were quite friendly and sweet but seem young and inexperienced. the room is nice but nothing special. its annoying that you cant see out the frosted windows of the balcony unless you stand on you tip toes. the breakfast was really lovely the granola was amazing. again the waiters sweet but not fantastic. the mini bar is a bit annoying as you have to use the room key to open it and its really hard to turn. they replaced the towels everyday and i would have preferred they didn't seems like a waste. the kiehl's products are great as i love kiehl's! also sorry have to say the shower was not great (no pressure) and the plug in the bath a bit annoying as you had to pull it out with your hand to drain the bath (i think it was broken) the book shop was close the whole time we were there which was sad as there looked like there were loads of great books i would have liked to have had a look. also you feel a bit weird walking into the hotel sometimes as all the staff seem to hang out by the front door. i must admit we got the room very cheap i think it was only $120 a day but if i had paid full price i would have been disppointed. one thing i cant fault is the location - its brilliant - near a metro and the park and lots of restaurants in a very safe area. also it was a bit of a lottery but the staff on the whole were very helpful and had lots of info, maps etc that helped us with our stay. probably wouldnt stay there again unless i got a good rate but would recommend.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Fantastic stay!! We rated the best during our Mexico trip”", "Author": "blcy", "ReviewID": "UR10071851", "Content": "My husband and I stayed at the Habita for 3 nights and could find no faults in the hotel's location, facilities or service. First, the location: it's located in the posh Polanco area, just a block away from the Polanco subway station. For over-crowded, over-polluted Mexico City, this neighborhood is like an oasis calm in the middle of a huge bazaar. The streets around the hotel are perfectly safe with plenty of shopping and dining options. (We recommend nearby D.O. for a superb Spanish dinner) Facilities: We booked a deluxe corner room. The room itself was clean and well-equipped. My husband particularly liked the in-ceiling stereo system, while I was a fan of the huge shower that doubled up as a steam room. The hotel is wired with free wifi throughout (which we had to pay at the Puerto Vallarta Westin). Terry slippers and bathrobes were provided. The bed was super comfortable as was a wooden chair. Take note though that the decor is absolutely minimalist -- an aesthetic that pleases some but not all. We took a swim the first morning at around 730am. Thinking we would have to plunge into an outdoor pool where the water was cooled overnight, we were pleasantly surprised to find that the hotel heats the pool in the morning. Although the pool and the gym are small, that's well-justified given the number of rooms in the hotel. We hardly saw anyone else at the gym or pool. The sauna was ok. Not hot enough. One needs to call the reception ahead of time to heat it up. Service: Service was friendly and intimate. The receptionist, doorman, and concierge quickly recognized us. We were particularly impressed with the efficiency of the concierge. When we expressed an interest at 9pm for a private tour the next day, the concierge quickly had it arranged. Of course, it is a smaller boutique hotel, so the style of service is not the same as at ritz-carlton. For example, the concierge doubled-up as the bellboy to carry our luggage. We thought that was cool and more personal, but some may find it odd or awkward Overall, we were extremely happy with our stay at the Habita and would definitely recommend to our friends", "Date": "October 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Funky but great service”", "Author": "Traveleasy", "ReviewID": "UR8236753", "Content": "The Habita is in many ways a typical designer hotel - the facade has a largely opaque glass exterior with steel trims. The small yet adequate lobby has exposed (but painted) concrete ceilings with the Aura restaurant (serves all 3 meals and is open almost all the time) abutting the passageway leading to the front desk. The room itself (I stayed in room 19) is compact with an open area to relieve any build up of claustrophobia. The bed is comfortable but just about adequate for a couple. WiFi service is great in the room but the lack of dressers leaves no room to unpack clothes besides some hanging space. Despite all the high-end designing, functionality is far from perfect as the closet door could not be opened until the bathroom door was open. The hotel also provides only one bathrobe per room despite double occupancy - so ask for one if you are traveling as a couple. The roof top bar has spectacular views and a (too?) lively crowd particularly on Saturday evenings. The swimming pool looks great but is less welcoming to actual swimmers as there is just about one lane for swimming. The gym has one each of a treadmill, a cycle and a elliptical trainer - barely adequate even for a small hotel. There is also a business center with two computers next to the gym which is open 24/7. Food and service in the Aura restaurant is simply outstanding and a table by the window overlooking ave Presidente Masaryk - the street on which the hotel is located - is well worth the very reasonable prices on the menu. The hotel's location in the very fashionable Polanco district of Mexico City is second to none. Overall a great hotel, particularly for travelers looking to avoid the large crowds in major hotels.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Loved it!”", "Author": "OARNY", "ReviewID": "UR6817124", "Content": "It's a unique place, everything in the hotel makes sense and it's special. Everything is designed by the best designers and architects. The personnel is rellay friendly. The rooms are very comfortable, specially the beds, they are amazing!!! Consider to have a full morning to relax on the pool and the jaccuzzi. I had a really nice stay!", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Peru", "Title": "“Great location, fair hotel”", "Author": "Arie-Mordejai", "ReviewID": "UR6797823", "Content": "If you like trendy hotels, or hotels designed by famous architects, the Habita hotel may be for you. The location, on the most important street in the fancy Polanco district, is excelent. The rooms are too minimalistic for my taste. I would add closet space for guest's cloths for example. Staff was pleasent and helpful. Food was good. The roof lounge was very nice and hip. The gym has 3 cardio machines, about average for a hotel this size. The a/c was broken during my stay and never got fixed.. I stayed durign 3 days during an unseasonable warm winter ( 80F during the day) and the room got to warm. Fortunetly you can open you balcony door without loosing to much privacy.", "Date": "February 15, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "4"}, "AuthorLocation": "washington, dc", "Title": "“Minimalist decor---minimal service”", "Author": "A TripAdvisor Member", "ReviewID": "UR5467315", "Content": "This hotel has been touted as something special. I did encounter something special during my stay---street noise and sewer gases! I was given a small room on second floor which at first appeared to be within a normal comfort zone though it was a bit worn. However, the next morning I was awoken before six am to the sounds of street noise below. Staff agreed to move to third floor. Might have been happy there until the second day when my bathroom filed with sewer odors eminating from the floor drain. I quickly learned the word for smelly in spanish (hold your nose and the maid gave me a huge can of air freshener. That worked until she retrieved the can next day.) Management ignored my complaints on Tuesday of the week. So every night I covered the drain with a towel and waste basket. Every day the maid removed the cover and neatened the room. The neighborhood was safe but the staff of Habita are in dire need of some customer service training. I received blank stares or some mild mummers of concern when I reported the problem with my room. And then there was my colleague who had the water cut off in the morning while she was out on a run through Polanco. At least she didn't have to deal with sewer gas!", "Date": "July 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Seville, Spain", "Title": "“Know what you are getting”", "Author": "Rjohngold", "ReviewID": "UR4329427", "Content": "We spent 4 nights in the Habita. I love the hotel design, the books in each room, the rooftop pool with gym, jacuzzi and sauna. The minimalist aesthetic is what I like and the beds are really comfortable. But remember this hotel has a lot of drawbacks: The plumbing has all sorts of problems from drain smell, to a pump that jumps and whirs all night if you are unlucky to have it next to your suite. Plugs donÂ´t work, dryers are missing and they promise to bring one and forget...whilst we were there they were changing the carpets, one day it meant banging and drilling all day and next day they moved us to another room without even telling us while we were away. The rooftop bar means noise, and as New YearÂ´s Eve was the next day we really felt we were in the way as they were moving furniture and totally concentrating on that bash. The breakfast was heavenly and some of the staff friendly.Street noise is very noticeable. Many fixtures are failing. This hotel is not worthy of \"one of the Leading Small Hotels of the World\" status. It needs to decide which customers it wants to cater to and concentrate on looking after them.", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Good but not for everyone”", "Author": "DCUnited", "ReviewID": "UR4326765", "Content": "The reviews of this hotel seem to be extreme on the positive and negative side. I can see why. This hotel is not for everyone. I recommend it for young(ish) clientele who appreciates minimalist chic. The rooms are so minimalist that they border on barebones. I did enjoy my stay. Positives: great area of town with proximity to shopping and restaurants, great bathrooms with Hermes bath stuff, comfortable beds with premium sheets, access to AREA (the club upstairs). I didn't find it noisy. Downsides: gym and pool are nothing to write home about even though they have rooftop views. Young staff seems to be always a little distracted. The hotel cars are expensive yet old and uncomfortable. The verdict: a great hotel for a shopping/party city break or for passing thru town. Best for yuppies and the design crowd.", "Date": "January 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“A Hotel or Club?”", "Author": "A TripAdvisor Member", "ReviewID": "UR3414689", "Content": "Just returned from celebrating my 45th with friends at the Habita. For me, the main purpose of a hotel in a city is sleep. At the Habita, I was woken up every morning at 4am by patrons of the Hotel Club yelling and laughing in the halls, as were friends staying on several different floors. Having said that, the room design and comfort were excellent, the food quite good, and the staff did an adequate job, but needs additional training.", "Date": "April 25, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Very modern and clean - March 2005 (3 nights)”", "Author": "lmlmlm", "ReviewID": "UR3297643", "Content": "Stayed in Hotel Habita in Mexico City for 3 nights in March 2005. What a modern gem! Very clean and trendy. Great service and staff. $165 USD/night (corporate rate). Internet access from the room (wired) and from the lounge (wireless). Great place to stay on business travel as restaurants are all within walking distance -- and very safe. One drawback is that it is quite noisy from the street and the nightclub on the roof. Recommended.", "Date": "March 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What a great find”", "Author": "A TripAdvisor Member", "ReviewID": "UR3263010", "Content": "Just came back from my first visit to Mexico City where I stayed at Habita. The staff at Habita made the biggest difference to my stay!! They were super friendly, made me feel looked after, gave recommendations of where to go and what to do. When I got ill during my stay they really went out of their way to make sure that I was comfortable. The room was an oasis from this chaotic but great city and I will have to go back just to make sure that I enjoy their beautiful roof top bar and pool a bit more. Couldn't have wished for anything better!", "Date": "March 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Dortmund", "Title": "“Very good hotel in a safe area”", "Author": "ralphm", "ReviewID": "UR3253301", "Content": "We spent four nights in the Habita in July 2004, our first trip to Mexico City. Reading some of the recent postings now, i cannnot believe they really had their accommodation in the Habita. We had a large, spotless cleaned room, the staff was very helpful and friendly. They organized some tours for us with guides who gave us excellent information not only on the sights but also on the living conditions of the locals in DF and mexico in general. Our advantage of course is, that my wife speaks spanish quite fluently and this sometimes opens doors which normally remain shut for other tourists. Teotihuacan, Diego Rivera's murales, Museo Anthropologica, Zccalo, Museo Frida Kahlo are worth to be visited. The Polanco district is safe to walk around even at night, there are many stylish restaurants of high standards and good value for money in walking distance from the hotel. The buffet breakfast in the morning was excellent, we only had once dinner in the hotel, the food was good, but there are better alternatives in the neighborhood. Late at night the hotel terrace is a nice place to chill and to meet locals from DF's \"High Society\". There are not many of these styled hotels in Mexico DF. If you don't like the often uniformed decorated hotel rooms of Hilton, Marriott and other big hotel chains, the Habita is the place to be. The only strange thing that happend during our stay, was a french couple with two kids (about 2-3 y old) who polluted the restaurant during breakfast twice with two giant joints. Nice to start the day with it??? On our next trip to DF we will defintely choose the Habita again. Also check the Deseo Hotel in Playa del Carmen/Cancun under the same management.", "Date": "March 5, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Worst service, thievery & rundown hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3101378", "Content": "I recently stayed at Habita Hotel in Mexico. Despite the high prices and faded accomadations, the staff treated us horribly. When problems arose, the general manager refused to return our calls and the staff continued to cover up for each other's many lies. There are many, many better options now in Mexico City (perhaps Habita was once good but its time has long passed.) I suggest the Four Seasons, La Casona or even the W hotel. You can't possibly do worse than Habita no matter where you try. Avoid at all costs.", "Date": "January 31, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, CANADA", "Title": "“Habita is the best hotel in Mexico City!!!!!”", "Author": "YYZSolly", "ReviewID": "UR2799323", "Content": "Wow! I usually stay at Hotel Nikko when I travel to Mexico City. Habita was recommended to me recently, so I spent four nights there. What a great hotel. First off, let me tell you about the food. My gosh - don't eat out...hang out in the room and order the best room service ever! It's lightning fast, and the quality is beyond five star. Their tortilla soup is the best soup I have ever eaten. Also try the shrimp tacos (much more complex and out of the world-kind of fusion-like than they sound. Their guacamole and homemade chips are superb. I ate so much each night (after full days of meetings) that I couldn't move. The business center has free high-speed internet and a great printer. The health club has machines in very good repair, and you can work out while looking at the very unique pool. The location is very busy - expect some noise from the street. The rooms are a very good size. The honor bar is very well-stocked and the rooms have a lovely bowl of fresh limes (very handy when the aforementioned soup arrives). I'm hooked on Habita. Oh, forgot to mention, by Mexico City standards, it's sooooper cheap for a hotel this nice. Enjoy your soup.", "Date": "November 1, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Laredo, Tx.", "Title": "“Very Cool Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2305100", "Content": "I stay there just one night, hope had more time to enjoy it. The hotel has a very minimalistic and cool atmosfere, its a small hotel so some taxi drivers dont know it, but their outside is easy to find. I arrived around 10 pm and everyone was very friendlly, explain me how the hotel works. Even on monday the bar was open til late with very good music. I ordered from room service that night, altought a little expensive my bowl of tortilla soup was really really big and taste excellent. I really had a great experience on this hotel I wil go back soon.", "Date": "July 18, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Cleveland, OH", "Title": "“It's where the beautiful people congregate!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2221179", "Content": "Sitting in the Lobby/Bar/Restaurant of this small design hotel is a great place to see and be seen. The soft white lights bounce off the reflective steel accents everywhere and everyone seems to glow, including the manager behind the who went out of his way to assure luxury treatment. A great place for Americans to feel comfortable...most of the staff spoke english and the room service food is familiar, with a Mexican flair. The shopping district is within a short walking distance and appears to be very secure. As promised to the hotel manager, Kurt, I will be beack very soon.", "Date": "June 25, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "adelegardiner", "Title": "“overpriced, but lovely”", "Author": "adelegardiner", "ReviewID": "UR2132212", "Content": "It's a nice hotel, but it felt a little bit like a gay nightclub. It's very masculine, there were very few women staying there, and the design and electronica music make it feel like you're in a disco rather than a hotel.", "Date": "May 31, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Marbella , Spain", "Title": "“Horrible”", "Author": "A TripAdvisor Member", "ReviewID": "UR1643880", "Content": "Lured by favorable reviews I recently reserved a room at Habita. After our arrival my wife and I only remain in the hotel 10 minutes, the time to pay the bill for one night and the transfert , much to expensive for what it is , and run away from this horrible place. The small diminutive intrance was smelling food like a cheap noodles shop, the reception was unfriendly and unprofessional, the room was small , noisy and unconfortable for somebody travelling with three pieces of luggage. I believe they wish to sell the place as \"design hotel\" but I would better defined it an hotel of poor design.", "Date": "February 10, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, New York", "Title": "“Heaven on Earth Right Here...”", "Author": "A TripAdvisor Member", "ReviewID": "UR1615747", "Content": "I thought I died and went to heaven. The Service is beyond compare. As soon as your wet, they make you dry, when your ready to eat, they serve you only the best. The Pool bows down to you and eases you into a sublime swim. The unique touches, such as the movies run accross from the Cantina and the terrycloth lounge chairs create a illusion of paradise, in Mexico City. I could have a spa experience next to the pool or in my own private oasis. This trip melted away all my tension and left me mellow and relaxed to dream of my next visit. I reccomend this Resort, I have traveled extensively and this by far was the icing on the cake!", "Date": "January 27, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Antonio, TX", "Title": "“Loved the Habita”", "Author": "Sagolfer", "ReviewID": "UR1271364", "Content": "What a wonderful Hotel! I stayed at the Habita for a couple of weeks while in Mexico City for business, and I had the most wonderful experience. I was staying at the Nikko, but truth be told, the beds are way too hard for me there. Speaking of beds, I don't think I've ever slept in such comfortable beds as those at the Habita. The comforter, the sheets, the pillows, everything was wonderful. There is overhead progressive music playing, which really adds to the minimalist art-nouveau ambiance. The cafe downstairs is very good, especially for breakfast. If it's nightlife your looking for, go no further than the upstairs loft area. All the pretty people in Ciudad de Mexico, D.F. gather here during the night for socializing. No doubt about it, when I go back, I'm staying here!", "Date": "September 2, 2003"}], "HotelInfo": {"Name": "Habita", "HotelURL": "/ShowUserReviews-g150800-d254876-Reviews-Habita-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$181 - $344*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avda Presidente Masaryk 201</span> | <span class=\"extended-address\">Polanco</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">11560</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "254876", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/61/22/61228e8eb49284c7c8eed23c451c8e0a1large.jpg"}}