{"Reviews": [{"Content": "Clean and Safe       Table and TV 2", "Date": "Aug 23, 2008", "ReviewID": "UR296679595", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Doedo"}, {"Content": "Travelled with 3 kids under 5. for the weekend My husband and I travelled to Syd with 3 kids under 5 for the weekend (stayed a Friday and Saturday night).We were on the 4th floor.The room was neat, clean and decor was pleasant.The water pressure in the shower was excellent and amenities were on the whole good.The Room size was good. We all shared the one room to sleep and had two kids in the sofa bed and the youngest (17 months) in with us.I would stay there again BUT the noise level was really bad from the traffic. I spoke to someone else on the same floor in the elevator and they said their room was quiet. So, if you stay there, just ask for a quiet room off the street. Aside from the noise, it was value for money. We booked through a discount rooms website (cannot remember the name of it now) and the hotel was close to transport so made it easy to get around.The staff were friendly enough but we didn't need to consult with them much as we pretty much had everything planned before we left home.We used the train to get to and from the airport which was ok. Pretty short trip and less hassle with children's car seats.", "Date": "Jun 24, 2008", "ReviewID": "UR423560656", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "ChrisFromOz"}, {"Content": "Great location This is a small hotel in the centre of Sydney. We weren't sure what to expect but were extremely pleased overall. Reasonable price, fantastic location. There were 3 of us, and the unit was split over 2 floors, with 2 bedrooms and bath upstairs and a living area and kitchenette downstairs. Unique. Minimal services within the hotel itself, but lots in the area. Excellent support from the staff. Were there for 5 days and could have easily stayed longer. Only complaint was the charge for internet ($30 for 5 days for wired access to my laptop). Being from North America, I am accustomed to getting this for free, although I can now see from 9 hotels in AU that charging high prices for internet is standard behaviour. Sad, really.", "Date": "Mar 29, 2008", "ReviewID": "UR114737543", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "RexT"}, {"Content": "Cenral location - good price You can see from the map that the location of the hotel is very central, you are just 200m from the park and a couple of streets from the shopping malls. It's a short walk to maze backpackers and all the facilities in that neighborhood (internet, tours, cheap food). You have to walk 10 minutes to get on an underground train, that was the biggest surprise.The service from the 24 hour reception was excellent, the fruit always fresh and the room was big with coffee making facilities. We chose a room facing the main street because the courtyard out the back is tiny and felt claustrophobic.", "Date": "Mar 9, 2008", "ReviewID": "UR644314064", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mayhew1955"}, {"Content": "Superb location and great value for your money Me and my girlfriend needed an affordable hotel during our stay in Sydney, and Central Park Hotel turned out to be an excellent choice.Firstly, like most have mentioned, the location is unbeatable. For first timers in Sydney, this hotel is an option you should concider. Easy access to all key transport; subway, monorail etc. Shopping malls within 1 minutes of walking. Key attractions like Hyde Park, Sydney Tower, the aquarium, and IMAX just 5 minutes away. Brilliant.Secondly, you really get a lot for your money, and the staff are very friendly and helpful. The rooms are in good shape, and roomservice was really good.A", "Date": "Feb 18, 2008", "ReviewID": "UR875019981", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "noway_norway"}, {"Content": "Great Location Great hotel, great location! Around the corner from the QVB, one block from Hyde Park, and just a few blocks walk from Darling Harbour and Chinatown. Central location makes it easy to get around Sydney by foot, rail or bus -- three train stations within 5 minute walk. You're right in the thick of things at this well-maintained hotel but yet it's quiet and comfortable. No food except a small coffee stop in the lobby but rooms are equipped with small fridge and sink. Modern styling, clean, well-kept. Staff is very helpful - - they know the meaning of service. Would stay here anytime -- frequent stayer program; look for special rates.", "Date": "Jan 2, 2008", "ReviewID": "UR301251478", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Lilysteel"}, {"Content": "Great location A friend and I stayed at the Central Park for one night when we were in Sydney for a Darren Hayes concert at the State Theatre. The location of the hotel could not have been better. We had requested an early check-in and this was not a problem at all. Our room was on the 5th floor and was very quiet and clean. The beds were very comfortable, and the cooling/heating worked well. The bathroom was spacious. I went down to ask for another pillow and the receptionist quickly got me one. They advertise free fruit at reception. The free fruit consisted of apples only. lol. There were also Minties on offer. A downside was that our windows were painted over, so we couldn't see any view.I would recommend the Central Park for anyone wanting to be in the middle of the action.", "Date": "Nov 7, 2007", "ReviewID": "UR699422023", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "mysslauren"}, {"Content": "Central Park rescued us It's getting a bit tatty round the edges but this hotel was a real lifesaver to us. We were travelling for work and our travel agents had booked us into a vile place in King's Cross. We moved here, and got just what we wanted - good location, nice enough and spacious rooms, relaxed decor plus Internet access. The contrast was immense. It may not be the Four Seasons, but it's cheap, well-located and comfortable. The other hotel cost us the same but there is no comparison. Choose here as long as you realise the rooms may be a bit noisy and it needs a bit of a refurb. It's cheap because it's run on a shoestring.", "Date": "Aug 20, 2007", "ReviewID": "UR524287475", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "SweetpeaLeicester_UK"}, {"Content": "So So Hi, Do not take me as fussy client but I have a few points to note. I can not complain about location - its perfect for the price they offer. But It started with order online. I have booked through [----] and booked for 4 people. Please note that when you book it ask you how many people would like to stay. When I clicked 4 - it gave me price for 4 people. When we were departing they said the price is only for 2 people the rest we had to pay extra. So we end up paying almost 300.00 AUD extra. When we walked into the room there was an old dusty couch with stains that 2 people had to spent 4 night on. Furthemore, it was only prepaired for 2 people so that we had to order extra towels, blankets.... 2ndly the windows were that dusty that you would not want to wave your hands around otherwise you would end up with dusty smell and it would all go to the air. They rate themselves as 3.5 star, but when we went to Melbourn and stayed at 4 star 2 bedroom Medison hotel, you would not want to compare how different is it. I would certanly gave 5 star to Medison and 2 star to Central Park Hotel. Please, do not judge this hotel under my review as I went there a year ago I was so happy that I returned again, but unfortunatelly not going to anymore. Cheers", "Date": "Jan 10, 2007", "ReviewID": "UR346406969", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "2"}, "Author": "max7solomon"}, {"Content": "The Perfect Hotel I have stayed at this hotel on 4 separate occasions. I always manage to get a great rate through wotif and have never paid more than $130 per night for their standard room. You can't beat this hotel for location and the service has always been excellent. On two occasions we arrived in Sydney at 6am on the midnight flight from Perth and were allowed early access to our rooms. The rooms are always very neat and tidy too. My only complaint is that it can get a bit noisy but if you ask for a room not facing onto the main street the staff are generally pretty good at organising this. I highly recommend this hotel!", "Date": "Aug 21, 2006", "ReviewID": "UR739217432", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Dee28"}, {"Content": "They messed up our bookings! This was our first stop on a family round the world trip from the UK, and we wanted something a bit different/special, so we booked two of their loft rooms (high ceilings, big windows, top floor) by phone a month before we set off, and secured the booking with our credit card details. A BIG disappointment then, when we arrived late at night after a 24 hour flight to find they had given the loft rooms to other guests, and only had standard rooms available for us. They are OK, a bit basic, and small window only (no view), but clean and well designed. Location is nice and central, but we could have stayed anywhere if all we wanted was a bed in a standard hotel type room. We'd spent a long time planning our trip to be a bit better than that. They did offer us a discount on the standard rooms, which we accepted.", "Date": "May 5, 2006", "ReviewID": "UR367339142", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "mashzzzz"}, {"Content": "Basic but great location The rooms weren't that fantastic as appeared in the website, but they were clean and had the basic ammenities such as phone, tv, ironing board and so on. The best thing about this hotel is the location. It's easy walking distance to almost all the attractions- darling harbour, Pitt Street Mall, Darlinghuarst, Chinatown and even the Rocks. Worth the price considering we saved on all the cab fares back from late night clubbing.", "Date": "Aug 1, 2005", "ReviewID": "UR764542472", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "for a very pleasant and different accomodation! I stayed in Sydney few years ago but I write the review for this hotel just now because I am starting using tripadvisor. Central Park Hotel has got many good things that should be considered and that hould lead to choose this hotel for accomodation in Sidney. First, the staff was really polite adn available. Second, the rooms were really pretty, stylish and clean. Third, it had very good quality/price rate. Moreover, the breakfast is served in nice baskets in front of your room, really romantic! I had wonderful memory of this hotel also because I get a friend of mine coming two days later and the staff gave us the suite (two floors and jacuzzi) for the same price of my single room!", "Date": "May 25, 2005", "ReviewID": "UR520106165", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "giadas"}, {"Content": "Bad staff attitude Stayed in this hotel recently for a few nights. Nice rooms and a good location but probably the most unhelpful, un-informed staff ever. If you need info on the local area - forget asking them!", "Date": "Jan 9, 2005", "ReviewID": "UR319295055", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "TEDBUN"}, {"Content": "Great location We have just returned from 3 days in Sydney staying at this hotel. We booked on Wotif.com and were very pleased with the hotel. Room and bathroom were clean and big enough for 2. But the carpet could do with a shampoo! Staff friendly and helpful. The room had its own little kitchenette with sink which we found very useful. There is no room service. Location was just the best....... within easy walking distance to the major shopping area and a nice easy walk to the Harbour. In all great value for money, would stay there again for sure. If you like great vegetarian Chinese Food walk down to 367 Pitt Street to Mother Chu's - the best Asian food we had!", "Date": "Apr 19, 2004", "ReviewID": "UR617794031", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location I stayed at the Central Park at the beginning of March for 4 days. At first I wasn't so sure about it. The hallway carpets were a little worn and dirty looking, the decor in the rooms was dark and it smelled a little smoky to me. But once I got to my room it was big and clean with a king size bed and the bathroom was huge also. It was very quiet which I really liked. The staff were very friendly and helpful and the location was perfect. Walking distance to almost everything and if you didn't feel like walking, two train stations close by and a taxi stand two steps from the front door. I also like that they provided two bottles of water complimentary and free local calls. Great value for the money.", "Date": "Mar 20, 2004", "ReviewID": "UR505255972", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Location, Location, Location I have been staying here for the last 6 years. The place is holding up well. The Cental Park is a great boutique hotel in a great location. High speed internet going in end of September, 2003. It is a block from the QVB, three blocks from Darling Harbor and a 15 minute walk to the Rocks. It has big rooms and good service. Starbucks across the street. Monorail station 1 block away. Location, location, location, with kitchens. Need I say more.", "Date": "Sep 10, 2003", "ReviewID": "UR143641277", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Look elsewhere for lodging Yes, the location is good; it was clean, and the plumbing did work. However, I was not prepared for the film of bird droppings covering the window, the horrid smells coming up from the kitchen into our room, and the dozens and dozens of kids screaming while they ran up and down the hall all evening, night, and morning. Of course no doors closed without a loud slam. I left as soon as I could for a quiet BB. For the same money, I got peace and quite, a much larger room. And....it was clean and the plumbing worked!", "Date": "Jun 19, 2003", "ReviewID": "UR237938742", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "L'endroit parfait pour quelques jours 脿 Sydney   showReview(19481602, 'full');", "Date": "Aug 28, 2008", "ReviewID": "UR718149739", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "nalee"}, {"Content": "TS   showReview(19650830, 'full');", "Date": "Aug 28, 2008", "ReviewID": "UR785284596", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d256533-r19256285-Central_Park_Hotel-Sydney_New_South_Wales.html", "HotelID": "256533", "Price": "$172"}}