{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Auckland", "Title": "“Very adequate budget hotel”", "Author": "jwjg", "ReviewID": "UR127097782", "Content": "The Napoleon on Kent is located under a freeway. This gave me some concerns but it's actually not that bad. First, the location is OK. It's a bit of a walk to places of interest, but not too bad. For example, on foot it's about 15 minutes to the Rocks, 15 minutes to the Pitt St Mall and about 5-10 minutes to the Darling Harbour area. It's also just down the hill from the Wynyard train station, which is very convenient as that station has links to the airport, central station, the inner west and north Sydney. The immediate vicinity of the hotel is uninspiring though - just the backs of office buildings. If you want anything more interesting (or to find food), you have a 5 minute walk to York St or Erskine St. We stayed in a studio room. This was very spacious and had a small kitchenette and air-conditioning. It was quite well appointed and very comfortable. The furnishings were slightly tired, but better than some places we have stayed for the price. The bathroom was fine, but the complimentary toiletries were not very nice and seemed like they had been left by the previous guest or re-filled. This is one of those places that does a weekly service of your room if you stay that long, so you need to make your own bed, hang up your towel etc. I don't mind doing that, but it's good to know in advance. The freeway (literally) above the hotel didn't bother us. We had very little road noise and what we did have came from Kent St itself, not the freeway. We slept well here. All in all, a perfectly adequate stay, and we would stay there again.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Great place, wonderfull staff”", "Author": "KoenVR", "ReviewID": "UR125922999", "Content": "Well after reading some reviews here we were a bit afraid of what to get but we were so surprised of our one bedroom apartment. The minite we walked in there was a very friendly asian guy at the reception to welcome us. The apartment itself was a bit old, true but was clean and we had all the things we needed for our 6 night stay ! Very central situated , not noisy at all, we had a quit eoom looking at the docks so great views aswell. Even when we had a little problem that my friend had a sort of allergie, they cleaned the room totally and helped us to look for a solution, wonderfull people..... Be sure that whenever I will be visiting Sydney again, this is the place I'm gone stay !!!! Thank you for everything !!!!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“napoleon hotel on kent”", "Author": "lorryAustralia", "ReviewID": "UR125718269", "Content": "We stayed at this hotel and it was nice. it was close to the station. it had a lovely big walk in shower. we walked home after mardi gra and never felt unsafe in the area. very clean.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wouldn't stay here again”", "Author": "Tasmania1977", "ReviewID": "UR125261296", "Content": "We stayed on 4th floor, late check in was made easy, male on reception next morning was lovely and greeted you when you came in each time female on reception however would not even look at you unless you had to speak to her even then she wouldn't go out of her way for you, room was clean balcony was so dirty I don't think it has ever been cleaned if you touched the railing you would get black hands, location was great but got no sleep at all with traffic noise right under freeway windows were double glazed but still didn't block out noise sirens every morning very loud, great for a one night stay but wouldn't stay any longer, we stayed 6 nights with no sleep not good at all, had no room service which was fine but clean towels every couple of days would be a good idea without having to pay for them.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ljubljana, Slovenia", "Title": "“Great location in CBD and good value for money”", "Author": "VladoN", "ReviewID": "UR125014393", "Content": "We stayed in two different units in Napoleon on Kent. -First two weeks our studio apartment accommodation was upgraded into one bedroom apartment free of charge. And we were positively surprised. We got a very spacey living room with kitchen which included dining table and sofa and separated bedroom, bathroom and small balcony. Every room has at least one window so we had enough light. The only problem was smell in the dining room because of not efficient and not enough clean kitchen hob. It would be also great if apartment would be served every 3 days and not only once a week (additional room service is available at additional costs). -Second two weeks we got a common studio apartment which had only one room with kitchen, double bed, dining table ad sofa. But it was clean and useful. We faced the same problems as in one bedroom apartments plus studio had only balcony door and no window. So we could only get fresh air through opened balcony door. The main advantage of Napoleon on Kent is a great location in CBD with walking distance to Darling Harbour or to Opera. With a little patience you can also connect to Freenet wifi service instead of buying expensieve Jimojo internet provider package.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Absolutely disgusting rooms. Rude staff.”", "Author": "hotgossgal", "ReviewID": "UR124385006", "Content": "Arrived at the hotel at 11:30 this morning, and were told our room would be ready in 10 minutes. This continued for another 40 minutes until we decided to go get lunch instead. Carried own bags to room, despite being told they would be taken for us. Room consists of a master bedroom and sofa bed in lounge area. Sofa bed not fit for sleeping due to severe sinking in the middle of the mattress. Spoke with the front desk who said they would provide an alternative mattress, but arrived back to find only a single. When entering the bathroom, a cockroach was found on the countertop over toothbrushes. Master bedroom sheets had strange wet patches and bedside tables and bed head were covered in dust to the point where two non-asthmatics are uncomfortable sleeping and were forced to dust themselves. Front desk is closed for the evening, and after poor customer service yesterday from non-English speaking staff it is unlikely our situation will improve tomorrow night. Extremely unimpressive for $200 per night.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Great location in centre of Sydney”", "Author": "Paul255057", "ReviewID": "UR123047152", "Content": "Stayed here for two nights when visiting the Sydney Festival. A great location, being close to the Rocks area, Darling Harbour and the Darling Harbour ferry, so easy walk or ferry ride to most tourist destinations. Parking very convenient under the hotel and only $25 a night. We booked a studio room which is spacious, with fridge and cooking facilities, desk, table, sofa, chairs, TV plus DVD player and radio/CD player. Big sliding door provides lots of fresh air and leads to a tiny balcony. Although located beneath the freeway, the traffic noise is low compared with other city centre hotel locations, and passing traffic is quite low. Room recently refurbished and very clean and fresh. We will certainly stay here again.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Launceston", "Title": "“convenient location...nothing else going for this hotel.”", "Author": "IndyLaunceston", "ReviewID": "UR122736799", "Content": "The room we had was very tired, dusty (thick on curtains and blinds) and not very clean although the bed had clean sheets and was comfortable. We stayed for a set 5 nights AND had to wash our own towells which wasn't too big a drama but at $4.00 per wash, $4.00 per dry & $2.00 for the laundry liquid per load it was very expensive. We stayed over the New year period and payed on average $400.00 per night, way over priced, a good tip for those wanting to go to Sydney for the New year period is to wait until the last minute and book with expedia or similar as the people in the room below us payed $179 per night = last minute.The staff are not very friendly.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Fantastic location near the centre of Sydney”", "Author": "Chris1985UK", "ReviewID": "UR121735251", "Content": "Great self-contained apartment a few minutes walk from all the sights in Sydney. Would definitely stay here again!", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Good Location a bit tired though”", "Author": "Seasonedtravellers68", "ReviewID": "UR121189174", "Content": "Althought the location is good the room I had was tired, and in need of redocorating. When I arrived the lift wasn't working so I had to carry one of my cases up the stairs. Not good after a 23 hour flight. The cleaning was substandard. Previous guests hair all over the carpet, walls dirty, bath stained and smelt of old food. I specifically requested an apartment so i could cook for myself. However there was no cooker and slightly defeated the object of booking an apartment. The reception were as helpful as could be expected. I was due to stay there for 8 weeks and I informed my company I would not be staying there any longer then the first week. In all if you need a few nights stay with a good location then go for it. Any longer I would suggest moving out of the CBD and getting a train. I moved to North Sydney and got the train in to Wynard, it only takes 7 minutes.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Much better than I expected - great value”", "Author": "wackijac", "ReviewID": "UR121039355", "Content": "On my last trip to Sydney I stayed at the Travelodge Wynard and was very disappointed and vowed to never stay there again. Problem was I was travelling on business and the travel allowance provided by my employer did cover many hotels in the area. Finally I found the Napoleon on Kent and decided that it had to be better than the Travelodge and I am so glad I stayed. Location was very convenient - close to the training venue I had to go to. Staff were very friendly and helpful. When I checked in I found there was a flickering room in my studio room. The lady on reception immediately arranged another room, I was even upgraded to a 1 bedroom apartment. When I reported the tv reception wasn't clear, the aerial was replaced in no time. Sure it may not be 5 star, but it is clean (well clean compared to most hotels) and very affordable. Better still the beds were comfortable, shower was hot and had great water pressure.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mooloolaba, Australia", "Title": "“A great little hotel”", "Author": "Dianne4557", "ReviewID": "UR120771388", "Content": "After reading the reviews i was worried to stay here . BUT this hotel was just great , everything is clean and tidy . The rooms are a good size and quiet . The front staff where plesant not rude at all. My young daughters and I had a lovely stay here in this hotel and the location was very central and right next to the train station ... We would defs stay again ...", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice neat and not overpriced”", "Author": "mark532", "ReviewID": "UR119566038", "Content": "In sydney you get what you pay for. This is it at this nice little appartment tucked under a roadway. cheeper than the central big chains but still right in the middle of town. will stay again", "Date": "October 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Won't be going back”", "Author": "Amyrlin", "ReviewID": "UR118352964", "Content": "I guess it might be tolerable for people needing to stay in Sydney for a week or two for business. It is convenient, and the studios are large, and one does not actually need to be inside. However the double glazing doesn't actually stop the vibrations from the flyover, and although my apartment was clean and tidy, it was very tired with a sagging bed and too thin a duvet for a cold night. Although the sign in the studio indicated that the bedding was \"sanitised\" regularly (which I took to be a euphemism for bed bug prevention) the next treatment was due 06/11. That might be November 6, but it could just as easily been due in June this year and missed. The staff were not very helpful on arrival, and despite check out (on Sunday) being 10:00 there was nobody on the reception desk confirming checkout; nobody responding to calls or answering the phone; nobody attending to repeated ringings of the door bell; nobody willing and able to take bookings for airport transfer, or even (if the gods smite me) a future booking. After ten minutes I tossed my keys in the slot and walked out.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Warkworth New Zealand", "Title": "“Please clean me”", "Author": "Adrienne M", "ReviewID": "UR118179637", "Content": "We stayed for 3 nights and had friends in two other rooms who were happy with their rooms However our room No.308 was quite dirty and because it was on the corner also noisy. The whole unit needs a very good clean. Also many of the lights were not working. However on a plus side it was convenient for shopping and The Rocks for dining out. We would not stay here again", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Needs an update.”", "Author": "DoubleAK", "ReviewID": "UR116883852", "Content": "We stayed here on a business trip because of the convenience of a serviced apartment and the location. Location is indeed great, in the CBD and walking distance to everything. We were also able to use the business center for some meetings and consultations. It was convenient and decorated in a modern way, though there is no natural light and a bit gloomy down there. That describes the rest of the place as well; because of the location under the bridge it can be quite dark in the rooms. Our couch was old and stained and had a cigarette burn, and because of that it didn't feel clean in the room. Bed was comfortable, but all in all pretty ordinary and badly in need of renovations or an upgrade.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Excellent Location and Good Value”", "Author": "Sandgroper22", "ReviewID": "UR116592084", "Content": "I stayed at the Napoleon on Kent Apartments and highly recommend the place. It was easy to find and in walking distance to The Rocks, Darling Harbour and City Centre. I would happily stay there again. Although the apartments are not fancy, they are very comfortable. I was lucky to stay in a room at the back of the apartments with a balcony and a view of the water. Based on feedback from work collegues who stayed at the front it was slightly noisy from the main road. Although I found the rooms quite sound proof but I wasn't at the front. All in all, a very good place to stay!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“A very clean well run services apartment with friendly staff”", "Author": "Hallett505", "ReviewID": "UR115952564", "Content": "We were most impressed with our 2 room apartment where a second bed was set up for our 2 children in the lounge area. When we asked for a couple of blankets they were there on the beds when we returned, we were allowed to move into the room to our amazement at 10am on our check in day and the cost was very reasonable at only $240 per night for the 4 or us, nearby establishments were closer to $350 per night.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "tasmania", "Title": "“Expected less and certainly go more”", "Author": "TasmaniaLovesydney", "ReviewID": "UR115512097", "Content": "After reading other reviews was starting to get a little concerned that we had made the right choice for our 10 night stay in the middle of winter in sydney but should not have worried. The apartments were well lit from the street, easy to find not up a great hill,close to the rocks area, circular quay, railway and bus services, overlooking darling harbour and king street wharf area. The room we had an apartment had good water pressure in the shower, new carpet, new light fittings plenty off all working, 10 coathangers, chest of drawers, safe, luggage rack, iron and board, double mirrored wardrobe, table and 2 chairs, coffee table, LCD tv on a swivel with foxtel, dvd player and a cd player/radio, sliding windows onto balcony with a decent view, blockout curtains, 2 seater couch new, clothes airer, mini fridge, all kitchen facilities with microwave and stove top all cooking app including electric frypan, airconditioner/heatpump, extra pillows/blankets queen bed very comfortable,shower with vanity unit/ toilet and hairdryer and toiletries, a working smoke detector and a laundry basket. The studio apartment was spacious, natural light coming through even though right underneath the roadway, no noise at all from the roadway the room was nice and cosy, very clean on arrival and cleaned on the 6th day of our stay. No problems checking in or coming in through the main door after hours with access key, staff(4) were all very friendly, lift always working never saw anyone hanging around reception loitering. There was no noise from any other rooms and the place was full due to a conference being in town. As for the train station wynyard was 100m away weekday entrance about 200m weekends,24 hour store less than one minute walk, restaurants in the rocks a couple of minutes walk,heaps of food courts and places for breakfast less than 100m, a bakery in erksine st only a street over, Observatory hill wonderful views a 5 min walk uphill, 4 pubs within a short walking distance one was incredibly cheap for drinks and food. Darling Harbour a 10 minute walk away all flat surfaces, Circular Quay as well 10 mins in the other direction where you can get all your buses, ferries and trains. I did purchase 2 extra towels at the start of our stay $4 which was a small price to pay, the cafe up the road had free wi fi and very cheap food and specials. We did cook in the apartment the exhaust fan worked fine and if the smell lingered we just opened the windows if cold turn the heating up. We payed through a travel agent $125 per night for a 10 night stay in a studio apartment that was serviced once during our stay. Realising this we did pack a selection of teas and coffee sachets and salt and pepper sachets that was it. Everything was available soap, toilet paper, shampoos, dishwashing liquid, etc. The 2 facilities we did not use were the laundry, we handwashed our clothes and they were dry overnight and the car parking as we did not have a car. I hope this review changes somebody's mind about staying there as it certainly made my mind up that I had made the best choice of an apartment stay in my price range.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“A Memorable & Unforgetable Journey”", "Author": "Invisible81", "ReviewID": "UR114917922", "Content": "I have been staying here for 1 1/2 months and I feel comfortable with this apartment. The helpful reception allows me for earlier check-in on my 1st day of arriving. They furnished me with a map and gave me some guidance around the city so that I don't feel miserable. Cleaning services will be provided every week (provided you are staying longer for 7 days if i not mistaken) and in case the cleaner does not clean your room, you can make a request at the reception and they will arrange it immediately for you. Also, I remember the ceiling lights in my apartment was not function, the reception has arranged for replacement on the day I made the request. I requested it in the morning and it was fixed when I came back in the evening. It's excellent. Walking distance to Circulay Quay, the Rocks, Sydney Bridge, Opera House, Darling Harbour, QVB, etc - what else we can expect? Isn't it awesome location? You may hop on the free shuttle bus service if you feel lazy to walk around the city. Shopping Malls are surrounded in Pitt Street & George Street, it seems to be the heart of CBD. Train & bus stations are all within walking distance. There are restaurants around the apartment. Just spent sometimes to explore it, you will find good deals and nice foods around. There are Japanese, Korean, Malaysia, Thailand, etc foods around so that you won't feel homesick during your journey. Apart from the old model television and the repairs and drilling work around Kent Street during weekend (once in a while during early in the morning which could wake you up), this is a good location to stay. I don't feel it noisy during weekday and weekend (provided no drilling works) as long as the window is closed. Perhaps I have get used to the environment and the bed after staying there for few weeks! If you polite to the other, the other will be polite to you. I enjoy the morning greeting and chit chatting with Carla everyday when she is on duty. I will miss her when I back to my country as she is really nice and helpful. I'm not saying this is an excellent apartment to be stayed as different people could have different standard and requirement, if you like to stay in the city, perhaps this could be an option for you. I don't mind staying here again as I feel comfortable here. Carla, hope I can still see you there during my next visit. Again, many thanks for your help and assistance.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Dont Believe Everything You Read”", "Author": "diwhy1", "ReviewID": "UR107645084", "Content": "If you want quality of the Hyatt, pay the price! This hotel offers value for money. I booked on a last minute website and believe that I got my moneys worth. Clean rooms, excellent location and a good price. A studio apt came with cooking facilities and although on the main street, the windows were double glazed. If you dont like the noise, dont stay in the city. I would stay again and again, no problem.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good place to stay but very bad experiences with a front desk staff”", "Author": "jarvindh", "ReviewID": "UR101814849", "Content": "The place is very good for medium term (>2 weeks) Business Stays. The rooms are clean and single bedroom is very spacious. It gets filled up pretty fast so plan your stay in advance and ensure you book well in advance. A staff by the name Carla Coinbra at the reception very hostile, whenever we approached her with questions, her response would be she has lots work to do and canâ€™t spend time. My understanding of people @ front desk are supposed to treat customer request as the first priority but here it was the other way round and she talks with an irritated tone, does not listen to what you have to say and shows lot of sarcasm. The unavoidable interactions with her were the worst part of our stay.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Much better than the reviews suggest”", "Author": "KatherineB2011", "ReviewID": "UR101077917", "Content": "Considering what the grumpy reviewers have said here, I have to say that I was delighted with my stay at Napoleon on Kent. My studio room was clean, spacious and well supplied (plenty of kitchen equipment, lots of extra blankets and pillows). The television does not have every single channel on cable, but it has sports, some movies and a couple of other channels. Considering you are beneath the road leading on to the Bridge, the noise is surprisingly muffled. The room, hallways and elevator looked freshly painted and although the place was bug-sprayed while I was there, I couldn't tell apart from the numerous advertising notices giving warning. Yes, if you are walking to George Street, the most direct route is up a hill, but other routes are flatter, so explore and find the best way for you. The hotel is located very close to the station and a short walk from the Rocks. The staff could not have been more pleasant or attentive (particularly the lady who was there on Sunday). Yes, the hours of the desk are somewhat limited, but information is available and guests are informed of this when they check in. Furthermore, info in the rooms gives details about nearby places to shop and to go, with food readily available. The only one negative I would mention relates to business travellers. The business centre is not available to guests, but rather is there to be hired out to companies as required. Many of the staff, though, can recommend nearby internet cafes, but perhaps consider bringing a laptop if you can't live without your connection. Otherwise I would not hesitate to recommend Napoleon on Kent for people who want serviced apartments (rooms are cleaned every four days).", "Date": "March 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Darwin", "Title": "“A pleasant surprise”", "Author": "Debnrah", "ReviewID": "UR95159082", "Content": "We arrived after hours and had no problems gaining entry. Staff were pleasant, courteous and effficient, although we had to take up our own luggage, as it was after hours, but this is to be expected. We stayed in a studio apartment and it was excellent. Whilst the location of the hotel itself is a bit hard to find, it is a good location, within easy walking distance to the train station and has lots of great eateries within walking distance, and there is a great selection of take away food services that will deliver to your door. Unfortunately we didnt see the take away menu until the next day which is when we were leaving. The bedroom doesnt have an airconditioner, there is only one large one in the lounge, and there is no laundry in the room, but otherwise it is a lovely hotel and very good value if you arent looking for harbour views. We would stay there again.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Not recommended, older style and better places in the CBD”", "Author": "Miapeders83", "ReviewID": "UR92374653", "Content": "I have stayed here a few times, as the location is good to get around town. The rooms are pretty dated..... the beds are very soft and not very comfortable and there is a bit of road noise from Kent Street that makes sleeping a bit difficult. I was actually really annoyed with this place, as I paid for parking and there was no spot in the car park down stairs and then I parked on the street, and missed the meter around midnight (as you do) and got a $165 ticket. Then, the manager charged me for the weeks parking still, when there was no parking there full stop. Ok for the location, yet as I said, there are 100's of hotels in Sydney.... pick another one!", "Date": "January 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Terrible Experience - spend the extra money and stay elsewhere”", "Author": "andykanu", "ReviewID": "UR90664243", "Content": "While the location of this place is really good, and it looked like value for money, I can honestly say I have never stayed anywhere worse. There is no cleaning service at weekends, and the staff are incredibly rude. When someone tried to access my room, I had to ask them several times to come back later, then I was rung from reception, where the receptionist lied to me about the amenities of the room, which led to us getting into a ridiculous argument, in which she was rude beyond belief. If you arrive out of hours, the reception is closed. I can see how this could work as somewhere for business travellers to stay, but from a leisure perspective, forget it.", "Date": "December 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“it's ok for a hotel but had rude staff and you'll need to climb over a hill to get there”", "Author": "Finch_keeper", "ReviewID": "UR90005252", "Content": "The hotel rooms itself were pretty average. Unfortunately, this hotel had 3 major shortcomings: 1/ Rude staff: For instance, both the staff at the front desk won't look at you while talking to you, they are too busy looking at paperwork. 2/ Very low ceiling in the shower: Anyone taller than 190cm will hit the ceiling because the tub is raised too high off the ground. 3/ Located over a hill: if you plan to walk around, the roads you take to the centre of CBD is very inclined. When you are tired after a day of adventure you'll find it difficult to walk back, especially in heels. Hope this helps but a 2 months booking in advance got me a room w/ a good view on the other side of the hotel. Also an entrance to Wynyard Station is a 1 min walk on flat surface but that entrance is closed on weekends, so you'll need to walk further... over a hill", "Date": "December 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dunedin, New Zealand", "Title": "“great place to stay”", "Author": "Zac123076", "ReviewID": "UR68692383", "Content": "well after reading the bad reviews about this place, I was hesitant. However I found the bad reviews to be unfounded. The location excellent, 100meters from the Wynyard station Rail. The rooms were very clean. the service was great, and the staff couldn;t have been more friendly and helpful.As regards to the noise, we were on the top floor right under the overbridge, and we couldn;t hear much.So top marks for this place. The location cant be beat, and would highly reccommend this apartment", "Date": "June 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Not four star”", "Author": "chewbacca71", "ReviewID": "UR57588901", "Content": "Not a bad price and a good location , glad we didn't pay any more than discount rate though. Definitely not four star - scuff marks on walls, dated decor , remote control that half worked , tv reception with more snow than Vancouver. Furniture was ok , bathroom was ok for space but marks on walls and poor paintwork meant that the value here was the location but not the hotel. Room service left a bit to be desired too with a dodgy looking laminated card left on the bed saying that they could not make the bed as personal items were left on the bed !! - These personal items were my tshirt and my fiances left pyjamas. Felt a bit like the rest of the place - it was token effort withl a lazy approach", "Date": "March 3, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Central Coast", "Title": "“Ruined our trip”", "Author": "Lindylou55", "ReviewID": "UR56624001", "Content": "Didn't even get to stay there. Booked ahead then 3 days before arrival we were told they had no parking. As it was Mardi Gras alternatives were all booked out. Had to cancel birthday dinner reservations. Surely they knew there was no parking when we made our booking", "Date": "February 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane, QLD, Australia", "Title": "“Ok hotel but very noisy and RUDE staff”", "Author": "Motherof3", "ReviewID": "UR56613150", "Content": "I have stayed here several times and it is relatively clean and cheap - but the furnishings are a bit jaded. One of the staff members was good but the rest were downright rude or just plain ignorant - not sure which. One staff member in particular was one of the rudest hospitality employees I have ever come across. Not sure if other reviewers were slightly deaf but we were on the third floor and could not only hear constant traffic noise the noise from other rooms was constant - opening and shutting doors, toilets and showers, etc.. That along with the dodgy pillows meant that sleep was not that easy to get. For an apartment the kitchen facilities are extremely limited. Overall I would only ever stay here again if it was the only hotel available in Sydney - I come here regularly and there are much better options.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Byron Bay", "Title": "“Pretty Good Value”", "Author": "anumanum", "ReviewID": "UR56550874", "Content": "Make sure you organise/pay for your carpark before you get there. I think they only have limited spaces. Our room was quiet reasonable and I liked the fact we were left alone to do our own thing, There was road work right outside the window, but it wasn't painfully noisy and its not the kind of place you are meant to \"hang around in\". (no pool, spa etc). Its just a good place to sleep, eat at home, wash clothes (bare necessities though at $8 to wash and dry one load!) If you are holidaying - make sure you bring all your \"to do\" lists and maps with you as there is not much available in reception and nothing in the room. If you're a smoker, bring your old takeaway coffee cup up from the car - there's no ashtray. If you're reasonable fit, leave the car the whole time. The ferry, the train, the supermarket, coffee shops, Kings Cross, Darling Harbour, shopping, Observatory Hill, are all around you. It's a well priced place to get yourself into the Rocks area.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Crystal Palace", "Title": "“OK but not great”", "Author": "Paleandinteretsting", "ReviewID": "UR49160990", "Content": "We stayed for 3 nights and when we walked in with our 5 month old baby we thought great, this is nice sized room with good facilities. Once you start looking a bit closer, however, you start seeing that it's not particularily clean. There was a fine layer of dust on the tables and even on the remote controls! When I asked reception to get the cleaners to do a quick clean next morning and they said of course no problem, when we got back there were clean towels on our unmade bed but nothing else had been done. These are serviced apartments mainly for business people staying not tourists and reasonable prices reflect this but all it would have taken was a proper clean and it would have been a good stay. Location is in heart of CBD and very quiet on weekends but still great base for sightseeing but you don't get the feel and buzz of Sydney staying here. You still have the convenience stores and a great pizza place a street down with all the bars of Darling Harbour only a 5 minute walk so it does the job! I would recommend but with reservations about cleanliness.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Swindon, Wiltshire", "Title": "“disappointed but ok”", "Author": "alanandjan", "ReviewID": "UR48815069", "Content": "We booked this following TA reviews as a value for money accommodation in Sydney. It probably was, as the location was pretty good - between Darling Harbour and Circular Quay and both in walking distance - but there were things we were not happy with. Apart from the location, the plus points were quietness, decent kitchen facilties and iron etc, and a good shower. We found the apartment not spotless by any means - I stepped on an old piece of chewing gum beside the bed, for example -and there was no cleaning at all at weekends, nor towel replacement. In fact, I'm not certain they made beds - they seemed to be the same as when drew back the duvet in the mornings - although they did empty the waste bin each day (except weekends). The room furniture was ok, although pretty plain and unattractive, as was the corridors, but there was a bit of a smell in the hotel that ranged from musty to disinfectant. Don't use the apartment phone! Despite they documentation saying that standard rates would be charged for local calls, 2 very short calls within Sydney cost me A$16. The receptionist's indifference to calling us a taxi (\"it's best to wave one down\" she said) nearly relegated my marking to a 2 star, but the location was good so I've given it the benefit of doubt. Overall, we were a bit disappointed, though - you can't call this 4 star. .", "Date": "November 9, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Very good service - value for money, especially the car park”", "Author": "BabsieSydney", "ReviewID": "UR38709243", "Content": "We wanted an overnight in Sydney that was reasonable and it also had to have car parking facilities without costing the earth. Napoleon on Kent excellent value for money, receptionists could not have been more helpful. The apartment was clean and comfortable and very sizeable for the money. We came in around 9.30 am and reception allowed us access to the car park even though our room was not ready and gave us our room key which meant we could go out for the whole day. The next day we checked out at 8.00 am as we were going out to breakfast and no problem leaving the car in the car park until lunchtime without further cost. Amazing in the city.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Canmore, Canada", "Title": "“Great location & wonderful customer service”", "Author": "Skipwillow", "ReviewID": "UR30647447", "Content": "The positive reviews on this place are true in every way - the Napoleon on Kent is a superbly located apartment that, in stark contrast of it's location, is quite quiet. We were only a 5 minute walk to Wynyard train station and the Coles Express supermarket that's located there. The front desk staff are incredibly helpful and let us not only store our luggage in their office, but allowed us to check in early. We were traveling with a 10month old and were a little concerned about noise from the outside traffic however this was not an issue at all as she slept from 7pm to 7am every day we were there! The kitchen was well equipped with a stove top, microwave, sink, fridge, kettle and all the usual cooking utensils. We had a studio apartment which was big enough for me, my husband and our little one. We didn't use the laundry ($4 for a wash and $4 for the dryer) but was located conveniently downstairs.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Quiet, Convenient Napoleon on Kent”", "Author": "dubadelic_69", "ReviewID": "UR25311099", "Content": "We booked this on wotif.com and stayed for three nights for a wedding. This place was in btw Darling Harbour & Circular Quay, not where we normally stay. But it was a nice surprise. A decent walk to Chinatown / Paddy's Market, but very close to King St Wharf. Also close to Wynyard Station. We didn't walk to Circular Quay, but noticed it was a nice walk to the Rocks. The room we stayed in (Studio Apartment) was on the Kent St side, on the ground level. It was very quiet considering the nearby overpass (except when a firetruck went by). And the room was quite dark which was good for sleeping in after a big night. The room was a good size with an okay bathroom (no bath). It had cooking facilities and a little couch to watch tv on. No room service whilst we were there, but that was part of the deal. We'd stay here again given the opportunity. ** Remember to use the airport bus if you can, it is cheaper than a taxi here.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent Accomodation”", "Author": "Alimrose", "ReviewID": "UR23339373", "Content": "Just back from staying in these apartment for 5 days over the new years eve period and they are great, excellent location easy walking distance to Darling Harbour and Circular Quay plus all the shops. We were very lucky in that we had an apartment on the opposite side to the road so pratically looking out onto King Whaf and saw the cruise ships come in and out each day plus as we werent roadside we had a lovely balcony which had the sun on it from mid afternoon and that was an unexpected bonus. Although the apartments werent serviced (i.e bed made or cleaned) we did receive new towels practically every day and if there were any problems the reception were very helpful straight away. I thought the apartment itself was very clean on arrival and and the bathroom was lovely to. I would definitely stay at these apartments again and recommend anyone who is going to Sydney to stay here", "Date": "January 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Owensboro", "Title": "“In a remarkable position”", "Author": "kentucky01", "ReviewID": "UR19816057", "Content": "Was amazed to find this property sitting right underneath the freeway. Turned out that it wasn't a problem at all. Our small studio apartment was incredibly quiet. This place isin a brilliant spot, a quick walk from Wynyard Railway Station which has all sorts of shops - including a supermarket. It is close to The Rocks and Darling Harbour and the Sydney Harbour Bridge Walk. We would recommend this place to anyone.", "Date": "September 6, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“So central !”", "Author": "Kiwibabe", "ReviewID": "UR18734406", "Content": "My partner and I only had 2 nights/1 full day in Sydney so we wanted somewhere central and well-priced so that we could just walk to the attractions. So much to see in such a short time ! But it turned out the Napoleon on Kent was a brilliant choice, booked through lastminute.com so we got a good deal. Our arrival after check-in hours didn't prove a problem as we just rang the intercom outside the front door and were given a code number for the lobby safe to get our room key, and buzzed in. Our studio apartment had a queen-sized bed off the living area with full kitchen facilities and a bathroom, my only gripe being that the sofa only had one cushion so we had to burgle a pillow from the bed. But I mentioned that on the questionnaire when we left so it's no doubt been rectified by now. A very small gripe ! There was a Coles Express supermarket just 5 mins walk away, underground at Wynyard train station, so it was easy to self-cater. The close proximity to The Rocks, Circular Quay, Harbour Bridge and Opera House meant we walked to all these attractions which saved on transport costs. I personally had a restless night with the traffic noise, but having said that, it was much quieter than expected - it's just that we live in a rural area and are used to virtual silence !", "Date": "August 8, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Canberra", "Title": "“Ok for short stay on budget”", "Author": "superQ", "ReviewID": "UR15509980", "Content": "My family of two adults and two children stayed in a one bedroom apartment at this property in March. I can see why reviews have been so positive - I don't think you can find any apartment type accommodation in the CBD for the prices they charge. We paid an average of AUD $184 per night for 4 nights, and this was for essentially 4 people. However, having said this, you do get what you pay for. While the apartment was very spacious, the standard of the room was about 3 star at best - furnishing was very basic and showing wear. Kitchenette was missing some items so that we ended up with only 3 sets of certain pieces of crockery instead of the usual 4 (eg. cups). While the apartment was cleaned well when we arrived, the carpet was actually quite dirty. Sure the carpets were vaccumed, but what it really needed was a good heavy duty steam or chemical clean - or even replacement. The balcony was also quite dirty and too small to be relaxing in. Having said this, the air-conditioning/ventilation was good though. The iron, ironing board and drying rack were all in good condition and proved very handy. Water pressure in the shower was good, as was the hot water system - always hot water when you needed it, and quickly too. Bathroom was great if you are not too fussed about a bit of staining in the grouting. Water pipes made noises after use of toilet and shower, but noise stopped after a minute or so. Note that this is NOT a serviced apartment. The apartment is serviced only with stays of 7 days or longer. OK for short stay, but maybe not so good for longer stays. On day 3 we were getting tired of having to organise for clean towels and having to walk over our own crumbs on the carpet. No restaurant or cafe on site or within short walking distance, but there a small Coles grocery is just round the corner next to Wynyard train station. Service was very always very smart, professional and efficient. Nothing to fault here at all.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tasmania", "Title": "“Good value and location”", "Author": "Tastravellers", "ReviewID": "UR14311235", "Content": "We booked this hotel based on previous reviews and requested the studio apartment - plenty of space and a balcony. The overpass is literally over the top but we did not hear any noise from the traffic. Great location and value - easy walking distance to Darling Harbour, The Rocks, Opera House and City centre with Wynyard Station a block away. Only drawback was the shower wall in the bathroom needs extending to stop the water running onto the floor. Our room was not cleaned when we arrived but this was fixed within half an hour and staff were apologetic and very helpful. The rooms aren't serviced unless you stay 7 days but towels are available from reception for $2 each. We would certainly stay here again and think the studio apartment is the way to go.", "Date": "March 16, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Qld", "Title": "“great location, but quite dirty”", "Author": "Mbig", "ReviewID": "UR13818880", "Content": "I booked this hotel based on previous reviews. Although the location was great, a quick walk or train ride to all major attractions, the room was disappointing. We had a 1 bedroom apartment on the 4th floor and the carpet was disgusting. The spare blankets had stains on them and the room had an overall grotty feel. Don't think I would stay there again based on cleanlieness.", "Date": "February 24, 2008"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Value": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Napoleon on Kent - a place to consider”", "Author": "djamesburgess", "ReviewID": "UR12558013", "Content": "Good location and a pleasant room down the back underneath the flyover. Only shame was that it was unserviced altough I was there for 4 nights. Would definitely recommend it and stay there again if in Sydney.", "Date": "January 12, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide, South Australia", "Title": "“The location saved it for us”", "Author": "patriciaofoz", "ReviewID": "UR11209592", "Content": "We booked our stayed at the Napoleon via the Qantas website. It sounded like a deal for $150 a night in a studio apartment room. The thing that made us go with NOK was the location. The whole purpose of our overnight stay in Sydney was to climb the Harbour Bridge so we wanted to stay close to Circular Quay without paying an arm and both legs for it. So we went ahead and booked with NOK. It was definitely convenient to be close to Wynyard Station because we always take the Airport Link to and from the City. We knew our way around the area and knew it was close enough to the main attractions. The exterior of NOK is grey and the view from the outside wasn't that appealing considering NOK was surrounded by million-dollar skyscrapers. And the NOK is right below the highway (end tail of the Harbour Bridge, I think). Reception was tiny but the people were helpful. They had a good security measure in place. Not the most inviting lobby though. We had a room one level up. It was equipped with a full kitchen. We didn't try out anything so can't comment on how updated it was. The bed was comfortable enough. We had a longue chair that was also comfortable (we took a nap on it for a couple of hours after our walk!) and the bathroom was clean. The decor wasn't spectacular - a little outdated but since we were only there for one night, this wasn't a big deal for us. The only thing I didn't like was the stuffiness of the floors (when you get out of your room). It was obviously not air-conditioned. The same goes with the elevator. But these are minor things. For the price and the location, I would recommend the NOK. It was walking distance to Circular Quay, the Rocks, Darling Harbour and Pitt St. Not to mention just 2 streets away from Wynyard Station.", "Date": "December 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "tafuna", "Title": "“Nice, small hotel”", "Author": "samoamurphy", "ReviewID": "UR10966840", "Content": "We booked a studio through wotif for about $125 per night. Positives: Very convenient. We left the airport, hopped on the train, got off an the Wynyard station and walked a block and a half to the hotel. Every day, we used the train station. The tunnel to the station is right on Kent St., just south of the hotel on the other side of the street. Restaurants on Darling Harbor were only three blocks away. Walking to Circle Quay was about four or five blocks. There's a free internet computer at a local convenience store about a block away. There's not a lot of restaurants within a block. Clean. Although there was no maid service during our stay, we found everything to be very clean upon our arrival. Noise: The rooms were pretty soundproof. Service: The staff was very helpful and attentive. Negatives: The View was not good. If we opened our curtains we could see people walking on the sidewalk above us. Maybe one of the 1 BR or 2BR would have better views of Darling Harbor. I don't know, but out view was not anything to brag about. We could also hear everyone outside the glass window walking to/from work. Not fancy. Not impressive. It's a small, four story building. There certainly isn't any wow factor associated with this place.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Wonderful location”", "Author": "Swimmer_7", "ReviewID": "UR10040738", "Content": "This is the second time we have stayed here and we find them perfectly located apartments. We traveled from the airport to the apartments by train this time after seeing on our last visit how close they were to Wynyard station. The staff were very friendly and helpful in giving us some ideas on what to see and do. The rooms are well equipped and comfortable, but we didn't spend much time in them as we were out and about all day. We made breakfast in the apartments each morning and some lunches. We had no problems with outside noise even though we had a room on the street level with lots of cars going past at all hours. The location provides the best of both worlds as you are just moments walk from Circular Quay, the Rocks, Darling Harbor and the City Center. For dinner we went down to Darling Harbor direction and there was a variety of restaurants to eat from. One night we attempted to find China Town but gave up after 20min of walking, only to find it in the next street! (it was a wonderful meal in the end!!) Both trips we have booked our stay through the hotel website and have been in both a studio and one bedroom apartment. Have recommended Napoleon on Kent to many people who have traveled to Sydney.", "Date": "October 4, 2007"}, {"Ratings": {"Overall": "4.0", "Value": "4"}, "AuthorLocation": "Paris, France", "Title": "“Great location”", "Author": "BEEPfromPARIS", "ReviewID": "UR8251871", "Content": "Booked directly with the hotel for a studio room at 150 AUD per night all inclusive (don't panic with the \"taxes apply\" once you have booked from ther website, WYSIWYP whatyouseeiswhatyoupay). For such central place in Sydney, it was not that expensive. It is unclear if the bypass is buit on top of the hotel or the hotel is built as a support pylon to the bypass ... Anyway, at first sight, it was a bit depressing ... But frankly, once inside, the place is so great that it could have been built upside down we would not care less. OK, our room faces the street so natural light is not plenty, but it is surprisingly large and so well equipped. The reception was friendly and efficient. The location is so great, half way between darling harbour and Circular quay, 10 minutes walk away. 3 minutes to Wyndyard station. What can you ask for more ?", "Date": "July 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Excellent location and well equipped”", "Author": "markmat", "ReviewID": "UR7161287", "Content": "We got a really good rate here around Australia Day in 2006. I agree with the reviewer who said that you shouldn't be put off by the overpass. It looks really bad in some photos and on the map, but we didn't find a problem with it (although you won't be spending much time out on your balcony!!). An excellent location, and the rooms are very well equipped. One problem we had was with parking outside to drop off our luggage. There is parking outside, but it's very limited and quite expensive metered parking.", "Date": "March 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Albany, Western Australia", "Title": "“Great location, good price”", "Author": "Penny71", "ReviewID": "UR7010671", "Content": "My partner and I spent a week in a studio apartment at Napoleon on Kent and while in terms of decor etc it was nothing special, in terms of convenience and value we were very impressed. We booked directly through the hotel website and when we booked, which was quite a long time in advance, this was cheaper than prices quoted through any other websites. The location is great, very close (150m from memory) to Wynyard station. If you are used to travelling fairly independently, don't consider a taxi from the airport or, worse, the overpriced and unreliable shuttle \"service\", but catch a train. You can see on the website where the apartments are situated - directly under a freeway - which is bizarre, but was never a problem for us. You can easily walk into central Sydney and the Circular Quay/Rocks area, and Darling Harbour is even closer. Most ferries depart from Circular Quay but there are infrequent services to and from Darling Harbour as well. The night we arrived we headed the wrong way looking for somewhere to eat and couldn't find anything open - head for Darling Harbour instead (ie look at a map, don't just head off like we did!) which is really well set up for tourists and where you can eat until late. There are many cafes and pubs and a food hall near the apartments as well. We didn't actually cook in the apartment, just ate breakfast, but it was definitely very well set up for it. There is also a huge list of restaurants that deliver to the apartments. Staff members at reception seemed very helpful and there was lots of information on what to do and where to go in Sydney. (By the way, we recommend the outrageously expensive Bridge Climb, the Zoo and the tour of the Opera House especially). The laundry in the basement is very handy with heaps of machines. Overall, a very good value option in Sydney - we would go back.", "Date": "March 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great Location...but a couple things”", "Author": "Fabs07", "ReviewID": "UR5834309", "Content": "The hotel is in a great location - right in the Sydney CBD and short walks to absolutely everything! However, we were unfortunate enough to hav e road works between 8pm and 5am (yes - overnight)! Because the rooms are right on the road, there was no escape from the concrete drilling and noise of trucks constantly backing up and moving forward. It was terrible, and needless to say, I did not sleep a single minute and was incredible angry and tired the next day. I'm sure this is a one-off occurrence, however, because the hotel is situated in a high density commercial area, bear in mind that construction is allowed to occur overnight. So make sure when you book that there won't be any road works scheduled during your stay! We were only provided with ear plugs, which did absolutely nothing! And we were also not informed that construction was going to occur, which was disappointing. When you first see the hotel, you'll wish you had chosen another one because this is situated right in the midst of two busy roads and underneath an overpass! However, even though Our room was right on the footpath, it was well insulated. However, you did get the occassional motorcycle or truck that would wake you in the middle of the night. The bed was very uncomfortable, and caused us lower back pains during our stay. The room had the stove and all equipment you would need to cook and was very well self-contained. We also had cable with heaps of movies - so that was good too. Staff was friendly, even after a night of mind-breaking concrete drilling. They gave us a bottle of champagne to compensate. Overall, am quite indifferent to this hotel. The roadworks on our first night probably tainted my perception of the place...", "Date": "September 25, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotherham, United Kingdom", "Title": "“Really well sound proofed”", "Author": "Chapas77", "ReviewID": "UR5614173", "Content": "Went in April and to say it is under the underpass to the bridge, it is remarkably quiet inside, in fact of all he places I stayed in in Australia It was the quietest. The staff were frendly and even told me where to go for a cheap steak and beer, but werent pushy. Very centrally located short walk to the Harbour/bars and Darling harbour. The Washers and driers werent cheap but hey, All in all Great Apartment", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Napoleon on Kent”", "Author": "A TripAdvisor Member", "ReviewID": "UR4125337", "Content": "Very helpful front desk staff . Excellent location . Convient parking . Very clean , comfortable , quiet and spacious rooms, including a well equipped kitchen . Don't let the overpass put you off . Good value . I wish I were there now .", "Date": "November 18, 2005"}], "HotelInfo": {"Name": "Napoleon on Kent", "HotelURL": "/ShowUserReviews-g255060-d256603-Reviews-Napoleon_on_Kent-Sydney_New_South_Wales.html", "Price": "$136 - $217*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">219 Kent St</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2000</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "256603", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/89/56/89561c657c6cd317fc7d4f62864e6f242large.jpg"}}