{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“The best view”", "Author": "CijN", "ReviewID": "UR127944608", "Content": "Had one night here. Arrived from uk at 6.30am but could not get room until two hours later. But what a view. Great room beautifully renovated and pool on top of hotel. Shame about noise coming fom bridge from building work in progress. So not very relaxing by pool.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Brilliant Views!”", "Author": "Bohemian2011", "ReviewID": "UR127704460", "Content": "My husband booked this hotel for us to enjoy the view of the Opera House. It was his 2nd and my first trip to Sydney. Enjoyed our 2 night stay at Park Hyatt. Good: Particularly loved the brilliant views of the harbor and the Opera House. Our room was elegant and tastefully decorated. Loved the nice comfortable bed and ever fluffy towels which were changed twice a day. The hotel is located in the Rocks and many tourist attractions are in short walking distance, including the Harbor Bridge, Opera House, and the recently reopened the Museum of Contemporary Art. Bad: No free Wi-Fi. Two unpleasant incidents-- Guest staying in the room above us failed to use ashtray while smoking on the balcony. When we approached the balcony to enjoy the glorious morning sun in the balcony, we were terribly disappointed with the mess on our chairs. While this unsightly views of ashes were cleaned up later by the cleaning staff, it happened again on the 2nd day. I do acknowledge that this is not entirely the fault of the hotel, however, this should not have happened as our rooms are designed to be 'non-smoking'. Second, having walked around the town all day, we came back to the hotel in the late afternoon to rest till dinner. We were surprised to find a waste basket on top of the table and all the used teacups and glasses were still there. This was handled swiftly once we notified the reception. Have to admit that this was totally disappointing. If you are in Sydney for the first time and are looking for a hotel with dazzling views of the Opera House, I could highly recommend Park Hyatt. The view was stunning in the morning sun, at sunset, and under the moon. However, the overall experience of the hotel did not wow me except for the views -- at least not as much as I had expected from reading all the reviews. Good but not that great --It was pleasant just as much as at other five star hotels in general. If I were to go back to Sydney again for holiday, I would look for other hotels.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Good! But not the best Australia has to offer!”", "Author": "madmelbourne", "ReviewID": "UR127594023", "Content": "I was eagerly anticipating my stay at the newly refurbished Park Hyatt Sydney as I had heard good reviews and that it has Australia's best guest rooms. Well I was disappointed!!! The lobby is tiny, unimpressive and is an impersonal desk stuck in the middle of the main walkway of the hotel!! However I could not fault the service at check-in as the staff where impeccable at the front desk. The rooms are nice but lack that real sense of class that the hotel says and thinks it has. The furniture in the room was nice but nothing great, there's an arm chair in the room that just looked like a nicer version of an ikea arm chair. The breackfast was very good, probably the best thing about the hotel, however I ordered room service one night and they forgot a couple of things and I had to call them to bring them up. At$900 a night for your basic standard room the hotel is very very very overpriced!!! Yes the location is nice. Yes the service is good. But this hotel does not have Australia's best guest rooms and the hotel shouldn't boast that it does!!! I don't mind paying $900 a night for a hotel room and I have done so many times the world over, but Im sorry Park Hyatt Sydney you are not worth much a night!!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Park Hyatt Sydney--Not Where It Should Be, But Has Potential”", "Author": "jmleon72", "ReviewID": "UR127561473", "Content": "We stayed at the Park Hyatt Sydney for 7 days in March. With respect to the property, it has an unrivaled location on the harbor with magnificent views of the Opera House, CBD skyline and cruise ships. Our room was tastefully decorated and modern. The property has undergone a complete renovation and parts of the hotel were still under construction. For example, some guest rooms were still gutted and you could hear the construction noise from our room at times and work around the gym and pool was still ongoing (the roof top spa was out of order, gym toilets wouldn't flush and construction equipment was left in the gym corridor leading to the pool). It was particularly disturbing that management failed to notify us in advance of the ongoing construction (we were really looking forward to using the rooftop spa). Additionally, in some ways it felt like some of the details were slapped together without much care. For example, the safe in our room broke and it took several people several hours to fix the problem; the emergency exit sign on our room door fell off; an emergency exit sign in the hallway fell off the wall too and wasn't replaced during our stay; part of the smoke detector fell off the ceiling in our room and wasn't fixed during our stay; and disturbingly and frighteningly, the hotel-wide emergency alarm went off early one morning. As for the service, it was mixed with some notable good and bad exceptions which for a property as nice and expensive as the Park Hyatt is overall disappointing. At check-in the staff made a fuss that the manager wanted to greet us personally, so we waited and the manager came to front desk, but never bothered to follow through and speak to us. Our room was not ready when we arrived and they told us to have a drink or go out. Instead we said we'd like to workout. They took us to the gym and told us they'd collect us when the room was ready. They never came and we had to go back and inquire about our room's status. Also, they didn't bother to show us any of the new amenities or explain our Diamond amenities. Management should train staff to ALWAYS ring the bell before entering the room. One day I hurt my ankle while out walking and returned to the room a little early. I had removed all my clothing and was walking to the shower when our butler walked in and I was completely naked. There was no bell ring or knock. I heard the key swipe and then the door opened! This was extremely embarrassing and a complete violation of privacy. Staff should always ring the bell (even with the privacy light is not on). I suspect some of the staff are new but this should be one of the first things they are taught to do. One other point worth mentioning is that the turn down and housekeeping service is really odd. The staff would tidy the room, but wouldn't clear used dishes. It seems that the butlers were responsible for clearing dishes, but we noticed that sometimes our dirty dishes and barware were moved from the table to the minibar area and then back to the table. The result being that sometimes used dishes remained in the room for up to 2 days. One suggestion would be that management instruct all staff members--butlers or housekeeping--to remove any dirty dishes whenever they see them. Otherwise, relying on the joint efforts of the butlers and housekeeping to maintain a room produces disjointed results and it's a little unpleasant to come back to a clean room with a table full of dirty dishes. Also we noticed that housekeeping doesn't use the big trolleys that you typically see in a hotel and as a result, it seems that they have no capacity for clearing dishes or restocking small items like shampoo, conditioner, note pads or bath salts. We'd often arrive back to the room after a long day and we'd have to call for shampoo/conditioner & bath salts. So perhaps management could provide housekeeping with a fully stocked trolley. Overall, we were disappointed with our stay, but believe that once they sort out their start-up issues the Park Hyatt Sydney could once again be top notch.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Patong", "Title": "“Park Hyatt Delicious and Comfortable”", "Author": "wendywanda", "ReviewID": "UR127457776", "Content": "For a beautiful breakfast with a view visit the Park Hyatt. Fully renovated and open again it is delicious elegant and ... I want one of those fridges!!! Beautiful service which is good to enjoy in this city and a treat to find And food was delicious with the best view! Oh and try MCA Cafe for a view too!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Sydney Harbour at its best”", "Author": "Howdizzy", "ReviewID": "UR127456999", "Content": "We booked interconnecting city Harbour rooms for a family with four young children for a four night stay in April. It is by far the best option for a Sydney stay in terms of location and five star experience. We had tried to book the deluxe rooms because they were bigger but they were booked out and two standard rooms at 40m2 were absolutely fine even for a family of six, newly renovated and lovely view of the city, ferries and a square rigged sailing ship recalling the Rocks' history. It is an intimate setting as opposed to looking down from a distance at the city's goings on from the Four Seasons or Shangri-la glass windows. The view was only marred by a huge cruise ship that docked on our last morning. Perhaps the Opera rooms don't have this problem. Check in was smooth and we were able to shower in the gym when we were not able to check in early. Concierge were lovely but a mixed bag in terms of experience like the rest of the staff at the hotel. We heard one of them say some odd things to tourists (we are former Sydney residents) such as telling another young family that a trip to Taronga zoo would only take 2-3 hrs (not with kids in tow!) and then they could lunch at Doyles (it is easy to spend a day at the zoo and Balmoral Bathers Pavillion which is on the same side of the harbour as the zoo would have been a more memorable option). Doyles is okay - fish and chips, a bit of a Sydney institution and needs a facelift - but there are other more up to the minute options nearby (MCA rooftop cafe, Sake). Eatability.com lists restaurants with chefs' hats which is a pretty reliable indicator of good food. The fine food company (for breakfast or coffee) is great as is Baroque for dinner - both around the corner from the hotel and recommended by a staff member. Ferry ride is a must - Darling Harbour (maritime museum, aquarium and fab playground), Luna Park (tacky amusement park), Balmain East or Mosman Bay (playground by the Harbour), Zoo etc are all a ferry ride away from the hotel. The rooftop pool was like a welcome warm bath. Breakfast was good but again, service was mixed (Antoine and Isis stood out for us as consummate professionals). For example, coffee took a long time to arrive on most mornings we were there and when we queried one morning where it was after waiting 10 minutes, we were told 'it is made from scratch' - laughable! However, there were only ever minor blips and none of the sassy attitude that you get from others in the city's service industries. Instead, there were so many small gestures from staff to make our stay a pleasure that we really felt very privileged to be there. Room Service menu was excellent. Afternoon tea scones were delicious. Most importantly for us, our children were always welcomed (thank you for the gifts and I loved the organic bath amenities- thank you!). Overall, a very intimate re-introduction to Sydney in all it's glory (Opera House, Harbour Bridge, the historical Rocks area, Ferry rides, the Botanic Gardens and city shops all on your doorstep and shiny, happy people to welcome you).", "Date": "April 8, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Still one of the best”", "Author": "Simon T", "ReviewID": "UR127396289", "Content": "Being a Hyatt fan, have stayed in about 30 of them mostly Park Hyatts for business and pleasure. This is up there with the best medium sized city hotels in the world. Views to die for and the service uniformly good and everything else is of the standard you would expect of a 5 star hotel in the price range. The main restaurant is not top class but is rarely find that in hotels that can also cater for business. But the hotel is in walking distance of Some of Sydney's best. The evening and morning view of the harbour across to the opera house is worth travelling the world to see.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Hollywood", "Title": "“Great Hotel, Spectacular Location, Service w/A Smile!”", "Author": "RussFilice", "ReviewID": "UR127278495", "Content": "Could not be a better place. The hotel is spectacular in it's simplicity. Clean, new, fresh rooms with iconic Sydney Views that you can almost reach out and touch. The interior design is superb an inspirational. Rooms are gracious with baths you wont want to leave. Check-in for a night and you will want to stay forever.... Christian, Mike, Tim, Leon, Bianca, the entire staff - you guys make the place feel like home. Nothing compares. Pride in ownership and performance before profit. A perfect 10!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Breathtaking, both inside and out!”", "Author": "JTandP", "ReviewID": "UR127164287", "Content": "They've recently renovated the Park Hyatt Sydney, and the results are truly spectacular! Rooms have gorgeous harbor views, most of which include the Opera House! The rooms are sleek and sophisticated and luxurious and extremely user-friendly, and the food is delicious.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Kudos for the staff”", "Author": "CAKathryn", "ReviewID": "UR127157511", "Content": "This hotel is beautiful, the service is the best that we have ever experienced anywhere, and everything about the hotel is first class. There are a few things that still need to be worked out. Since they have recently reopened, in all fairness, it doesn't feel fair to be too judgmental. A special note of appreciation to the assistant manager, Leon Mendels, who made staying at the Park Hyatt Sydney a most positive experience.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Beautiful hotel in a stunning location”", "Author": "MSW2", "ReviewID": "UR127133209", "Content": "The Park Hyatt completely lived up to it's 5 star status. The hotels recent renovation has created a cosy yet elegant environment. The hotel staff are superb, we had a few small issues during our stay but they dealt with it brilliantly. The rooms are simply gorgeous and offer sublime views of the Sydney opera house. The rooftop pool is also excellent and offers a great vista. We used the hotel restaurant one morning, the food was lovely and not too over priced for a 5 star. The only problem with this hotel is that it will heighten your expectations of all other 5 star hotels. We will without doubt stay at this excellent hotel again", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fantastic!”", "Author": "Jess G", "ReviewID": "UR127051470", "Content": "My partner and I came here for breakfast and could not have been happier. The service is prompt, friendly and professional. The waitresses and waiters did everything they could to make sure we were happy and comfortable. The food was delicious, my order was a bit specific with dietary needs, however the staff made sure they were all met. The view is beautiful, food lovely and good coffee. I am big on good customer service and fresh food and the park Hyatt delivered a 10/10 experience, I will returning for sure.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent service”", "Author": "AngelaSch", "ReviewID": "UR126709344", "Content": "This is a first class hotel - from the moment I arrived I was surrounded by welcoming staff. The room type I had booked was not available so I was offered complimentary breakfast. My views were not great - but the large room, with comfortable bed and huge bathroom more than made up for it. It is an expensive hotel, but well worth it.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Attleboro, MA", "Title": "“Wonderful place to stay!”", "Author": "debbie1759", "ReviewID": "UR126587097", "Content": "This is truly a 5 star hotel. Our room wasn't ready when we checked in, however we were offered complimentary coffee/juice while we waited.The staff were wonderful and the rooms themselves were top notch. The balcony outside our room overlooking the Sydney Opera House was an unexpected bonus and we loved starting our day drinking our coffee admiring the view. We used our Hyatt points for this stay which was well worth it. I would recommend staying here if you want to be close to everything in Sydney Harbor. There's enough shops and restaurants within walking distance.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“An Iconic Legend returns with triumphant Style & Class”", "Author": "frequentstaydude", "ReviewID": "UR126527293", "Content": "Arrival/Greeting I am a long time guest of this hotel and a top tier member of Hyatt Gold Passport so my experience may differ than others though I doubt all that much at the end of the day Within a minute or two my arrival I was surrounded by warm welcomes from the front of the house by both of the front office managers (These folks are sensational ) Then to my complete and utter surprise a brief greeting and welcome from the GM himself as we approached the elevators. Guests are escorted to their rooms by hosts/front desk Ambassadors not bellman which may be more typically a front office manager. If I've observed anything about the new Park Hyatt Sydney it is an overwhelming desire/commitment to please guests like never before With one glaring exception of its past business decision of no suite upgrades for Hyatt top tier members a policy which sadly still remains firmly in place On the other hand each guest is treated with the highest regard for room upgrades and all other amenities here including the unexpected and random acts of kindness and generosity from mostly amazing professional well groomed attractive team members Moving on................ The Butler is Back!!! Itâ€™s not just advertising itâ€™s the first time in 15 years I actually had one show up at the door. For those that have not had such luxuries they are truly a great asset providing you with any special services during your stay. Packing or unpacking and a wide variety of assistance are offered.Regretfully my short stay didnâ€™t make use of this exceptional service. The Room Upon entry of the long and winding corridors which have some nice new touches including enhanced hallway lighting I arrived at my upgraded room 244. I am a huge fan of the simple rectangular door handles of polished chrome and the simple state of the art room key entry system. Simple, effective and effortless. Have been looking at a similar design for my new residence. The large well-appointed room two exceptional all glass balconies(no obstruction remain anymore) with good views of the Opera House It took a while to understand the rooms architectural design The rooms do not have the wow dramatic factor of say Andaz Wall Street New York City that I have come to favour. In fact in some areas it is a slightly lesser overall room product with some exceptions. Iâ€™m speculating the designers wanted to achieve an understated yet tasteful contemporary design that wouldnâ€™t compete with the view which is the main event at this property clearly. In that regard Iâ€™d say that the designers got it right. The rooms are certainly more functional and contemporary then in the past and as other long time guests have noted slightly fuller of furniture making rooms seem a bit smaller. Impressive are the mirrored and wood light up closets(beautifully lit with great task lighting) that open up to impeccable storage and your every whim from a glass door mini bar to all the most important amenities.Sharp television replaces the former Bang AND Olfusen television that were confusing because the B&O remotes were never meant to work with hotel systems.I am not a fan of Sharp it is a lower quality television compared to LGs,Sonys and other brands. The upside is they are on beautiful round silver bases opposite the bed and the sliding glass doors They are adequate but the picture is not as sharp and bright had they used a more appropriate higher end brand.A beautiful fruit bowl and bottled water (with my brand of choice awaited) House chocolates appeared in my room the next day as well (this may or may not be typical) THE Good & the Bad The Beds as noted previously are platform they are very firm and have no box spring.The bed has zero movement. For firm mattress lovers you will be in heaven for those accustomed to the Westin Heavenly Beds you may be in much misery. The other thing that does happen through the night is the occasional blast of cruise ship horns which I also experienced at 3 AM Light sleepers may be startled in the otherwise quiet of night. Lighting A mix of state of the art LED energy efficient lighting with on off touch controls that are difficult and confusing to control in a darkened room at night. The lighting is stunning and well thought out when fully lit. I regret they didnâ€™t simply use dimmers for greater control of lighting and ease of function Power Converters are something the Park Hyatt Sydney truly got right located on both sides of the bed and desk/table area. Easy to access. Shades Like Andaz they use motorized shades one for black out and one for blocking some of the day time glare .They are not the high end of motorized shades and slightly noisy but highly effective,functional & attractive at doing their job. The heating and ac controls are adequate and a huge improvement over many I have observed elsewhere Bath Area The rainforest shower and second hand held is very nice with controls located on the marble at waist length that extends from the vanity into the shower area. I was slightly disappointed with the shower water pressure after coming from the Westin.The vanity area is very attractive with the toilet area located away from the bathroom in the front of the guest room in what almost seems like a second guest toilet at first glance. In the middle of the night confused how to get adequate lighting in the pitch black I ended up walking into the shower accidently seeking the toilet :) The Toto toilet is quiet elaborate one part heated seat one part bidet. Itâ€™s the fattest toilet seat Iâ€™ve ever parked myself on. Though I assume that many find it appealing to have their rears warmed while on the throne I am not a fan. I chose to pull the plug out of the wall rather than read the ownerâ€™s manual or call the butler to learn how to make it all work J I loved the new sleek glass minimalist European scales I will be purchasing one for myself Toiletries I am not a fan of their new shampoo amenity which is the new Bergamonte 222.Of course like beds subjective. Oddly there are tubs in the room and no Jacuzzis in the rooms and that follows the same path up to the expensive lavish suites that go for 3000 plus dollars a night. IMHO I believe that and the platform beds and the lack of Jacuzzis are the two biggest mistakes this otherwise amazing hotel flubbed. That of course will ultimately rely in the eyes of the beholder! The Dining Experience was below quality expectations though the team was welcoming and hospitable and always coming up with unexpected surprises during my stay They even know what brand beverage I prefer and had it available during my stay The Bellmen First Class & Professional The Concierge I didnâ€™t use but their services they never failed to smile and engage in nice conversation when accessing elevators where they are now located in the former space of the checkout desk area The Gym Has a new Techno Gym line up.I wish Hyatt had kept its recent smart partnership choice of Life Fitness.To be fair Techno Gym equip has made some improvements in recent years. However it is still not as good as Life Fitness,Nautilus and other fitness brands IMO The Spa Nicely redone with couple massage tables side by side so partners and or friends can be massaged together by two therapists at a time Final Assessment Park Hyatt Sydney after many years is well on its way to finding its ultimate promise to truly exceed most guest expectations. It was well on course even at the time of its closing last year despite its aging interior and small shortcomings. Today itâ€™s simply a vastly improved and much better hotel experience physically and aesthetically. It knows who its luxury customers are overall and what it takes to satisfy their most individual personal whims and desires for those that wish to engage in such pampering In my eyes it is what the Park Hyatt brand aspired to be at inception of the original brand launching and reasonably acheived. Park Hyatt Sydney is clearly well on its way taking it to the next level if early experiences are any indicator. Is the Park Hyatt Sydney worth its starting price of 800 dollars a night and up even in an overpriced high demand market like Sydney? Itâ€™s of my opinion that the Park Hyatt Sydney has few peers when it comes to overall guest service for those wishing to fulfil a truly aspirational experience in Sydney Surrounded by polished seasoned Hyatt hospitality professionals with amongst some of the best moments of my thirty years on the road in any brand. One can find a far more comfortable bed in Sydney and better overall dining experiences with far better value. However nothing compares to the remarkable team that remain currently on board or the magical setting that is a must for anyone traveling to Sydney for the first or the 100th time This is a place where celebrities, VIPs and the mere frequent traveller elite or not can feel pampered and made to feel like a true visiting VIP dignitary on revenue or award. I would suggest run donâ€™t walk and make a booking to get your preferred dates while availability exists Come experience one of the worlds most civilized unique aspirational experiences in hospitality surrounded by panoramic views of the Opera House In closing I wanted to award 5 stars for the team/service however I deducted one star for food quality and the platform bed.Shy of those two exceptions this remains one of my personal favorite properties in the word where one feels honored to be a guest Welcome back \"Park Hyatt Sydney\" nice to have you back!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Flat Packed Gone Posh”", "Author": "HarryP72", "ReviewID": "UR126447261", "Content": "Location wise, this hotel has it all. Having just re-opened in Feb 2012, following a very expensive refit, I have to say we were sadly rather disappointed. Perhaps we expected more. After all, at a cost close to $1000 per night, one kind of expects something really good. We requested a room with an Opera House view, which we got; as long as you sat on top of the dining table and leant into the wall. It was as though the room itself wasn't actually designed with the view in mind. We asked to change room, and we were offered a similar room further around the corridor. The room had a reverse layout, so in theory we would get the 'killer viewâ€™ from the bed and couch, unfortunately not. Because of the rooms position within this wonderfully curvaceous building, the view could only be enjoyed if one were to also sit on (not at) the table. Had each of the rooms been fitted out in reverse format, one would have enjoyed the view from the bed and the settee...... clearly a rather large oversight by the interior designer. This is what happens when you design on paper and don't consider the aspect. Doh! In general the interior design is very heavy. Dark wooden veneerâ€™s on every surface, slightly oppressive and not really very â€˜Sydneyâ€™. The same finish in a London hotel may work, but not in a warm climate with bright skies and killer views. A prime example of this in the public spaces is the hotel bar. Dark and dingy, with views a stone throw away, yet you are concealed into a space behind screens and you canâ€™t even see the harbour let alone the Opera House. The breakfast room is nice and airy I have to say; very lovely to have breakfast in. Shame breakfast isnâ€™t included in the room rate; at $1000 is it unreasonable to expect this? The roof terrace is the best bit. Nice sun loungers and a cracking view. Perhaps a tad noisy, but given its location (under the bridge) one doesnâ€™t visit for peace and quiet. The staff were very polite and did a good job from a service point of view, however they donâ€™t have that edge that you would expect from a hotel of this standard. You donâ€™t get that feeling of sincerity, but perhaps that was also because they were new given the hotel had only been re-opened less than a month before our arrival. So, I am only giving 3 out of 5 because in my view the interior design is not great nor is it unique. It most certainly does not embrace that wonderful feeling in Sydney where the outdoors comes in and the inside goes out. It truly is a missed opportunity. I hate to say it, but it actually looks a little bit â€˜flat packedâ€™ gone posh. Oh, and the staff lack sincerity too.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nothing Has Really Changed & Mixed Renovations”", "Author": "LoyaltyLobby", "ReviewID": "UR126301340", "Content": "Just stayed there for the Friday night (16th of March). I was also supposed to stay for a Sunday, but decided to cancel my stay and to stay somewhere else in Sydney. The hotel is having the official grand reopening this Tuesday (20th of March, 2012). This hotel just feels very touristy due to its location in the rocks. It is perfect if it is your first time in Sydney and you care about the view of the Sydney Opera House. The view is not that important for me. I care more about functional hotel and the benefits they offer me as a Hyatt Gold Passport Diamond member. Per terms and conditions of the program I was eligible for the best available room. At the Park Hyatt Sydney this would have been Opera or City King Deluxe that they were selling at the time of check in. I checked this from Hyatt.com. Hotel did acknowledge that they do have at least City King Deluxe available, but would not upgrade me into it. I was too tired at this point to contact the Hyatt Consumer Affairs in the States to have them to fix the issue. This particular location has been playing this same game even before the renovations. The room that I had felt about the same as before. These are not huge by any means. I would have preferred somewhat smaller bathroom and more space in the room itself that now feels somewhat cramped. There is a large kitchen table that you should use as a work desk. If you work on the desk, it is impossible to use any of the two phones that you have in the room, however. The minibar setup is one of the best that I have seen at any hotel. The bed was very comfortable. I did, however, have a huge problem with the lights. They should have an instructional booklet by the bed how to operate the system. I couldn't figure out how to dim the room completely. I loved the Diamond amenity of a bottle of red wine and a small fruit display. The fitness center had been completely refurbished and they had a new line of LifeFitness equipment that I like. The space is rather small, but I doubt that there are going to be more than one or two exercising at any given moment due to the clientele at this hotel. The pool is on the rooftop that has zero privacy due to the bridge and the walking bridge tours. Breakfast was really good, but didn't like the restaurant area. I would have preferred to have my breakfast in a quiet setting but the room was full. I don't like hotel calling me at 11:56AM to ask if I need help with my bags. If you want to know what time I would be checking out (4PM) just ask. I also received a Thank You For Your Stay-email from the hotel before I had left. Attention to detail missing? There was already huge stains on the hallway outside of my room. Not sure if they had some trouble with water leaks?", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Allentown", "Title": "“Fantastic!”", "Author": "504", "ReviewID": "UR126284587", "Content": "We stayed at the Park Hyatt for 4 nights two weeks ago. This hotel spoiled all subsequent Australian hotels for us. None of them came close to the Hyatt. Everything was perfect. The room was beautiful, the view was fantastic, best location, wonderful sheets and towels, superb service.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne", "Title": "“The best hotel in the world”", "Author": "Jaybee1972", "ReviewID": "UR126255522", "Content": "Although the views are good - that's only half the story. The newly renovated rooms are clean, modern and very comfortable. Everything is thought of, including a PowerPoint next to your bed to charge you mobile phone. The shower and towles are amazing and the services is impeccable - I love this hotel and stay there when ever in sydeny - the rooms do feel a little smaller since the Reno but that's cause there is more inside the room. This is my favorite hotel in the world and I've been to hundreds", "Date": "March 18, 2012"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“complete disregard for clients”", "Author": "travellady2531310", "ReviewID": "UR126188979", "Content": "We had booked our trip completely around staying at the Park Hyatt in Sydney. One week before we were leaving, we were informed that the hotel was not ready. They stated they were surprised that the hotel would not be ready. When we were in Sydney, we walked over to the hotel, and there was scaffolding and major construction around. There was absolutely no way the management did not know way before we were notified that the hotel was not going to be ready. The manager complained about having to notify so many people about the delay. What a pity he had work to do while all the people with reservations had to scramble looking for another hotel! Absolutely disregard for the traveling public.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Park Hyatt Sydney - Beautiful”", "Author": "mel_emerald", "ReviewID": "UR126110259", "Content": "We stayed for one night at the Park Hyatt Sydney on the night we were married. I wish it had have been for longer. The recent renovations have left nothing to spare with sleek modern furnishings and all the 'mod-cons' you could ask for. The black out blinds were a nice touch and the view just wonderful to wake up to in the morning. The service is exactly what what you would expect - of a very high standard. Of course, you can't get a much better location in Sydney. If you are in the financial position to be able to afford to stay there for a longer period of time, I couldn't fault it.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey, UK", "Title": "“The best hotel in Sydney”", "Author": "AFrequentTraveller", "ReviewID": "UR125994164", "Content": "Following an extensive refurbishment the hotel reopened in February 2012. We stayed a week after the hotel had reopened having stayed here many times in the past. The whole experience is different from the way you are greeted and checked in personally in your room to the way that every member of staff goes out of their way to make your stay memorable. The rooms have been finished to a very high standard and every home comfort is provided and if you need anything you just contact the Butler Team who will make it happen. The Park Hyatt has raised the stakes in Sydney but I have to say it is not a cheap place to stay but if you want to spoil yourself then stay here. I have seen some negative comments about the beds but I slept perfectly and I thought that it was very comfortable.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Beautiful post-renovation.”", "Author": "scruffybags", "ReviewID": "UR125986176", "Content": "The hotel had not long re-opened when we stayed and is looking beautiful post-renovation with top notch updated facilities. Service levels are very high, and include a butler who looks after you during your stay. There were a few teething problems during our stay as can be expected at a newly opened hotel, but the managers took any issues we had very seriously and were outstanding in there approach to rectifying these. With staff like this the hotel will go on to become one of the best in the world. Easily the best service we had in Australia. There is a lovely heated roof-top pool, although this was not open during our stay.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“All New Look - Same \"Crack Outfit\" Running Front Of House”", "Author": "RelaxWithMax", "ReviewID": "UR125970162", "Content": "We have been travelling to this icon of Australian 5 star hotels for many years. If you want the best 5 star hotel experience in Sydney bar none then this is the place for you. Prior to the recently completed renovation, the Park Hyatt Sydney already boasted the best rooms and everything else in town, so the wife and i were interested to see just how the 2011 renovations would raise the bar on an already exceptionally high benchmark. We checked in for 3 nights with a small group on March 9th 2012, just 3 weeks after the hotel was reopened on February 17th. On arrival,we were greeted by a youthful,enthusiastic, multilingual international front of house team, that could mix it with the best anywhere, anytime, anyplace in the world. - They are just \"Shiny\" ! - After 3 days we could see that they were still the highly skilled, well drilled machine that they were prior to the renovation. - Leon, the General Manager prior to the renovations, has returned with a vengance to re establish a new benchmark for Sydney 5 star properties. So, on to the rooms. - We stayed in an Opera King this time, which is smaller then the Opera Deluxe that we normally like to stay in. Japanese visitors will be delighted to know that the latest model Toto toilets have been installed in all rooms, complete with features that NASA engineers would be proud of. IT savvy android compatable devices have been added as well as a complete suite of IT outlets for all things IT. The bathroom features a nice bath and rainforest shower, which is a lovely addition. The beds are delightful and sooooooo comfy. - Better than most 5 stars we have stayed in. Our room came standard with a balcony overlooking the harbour and the Opera house and it was quite spacious with plenty of room for 2 on the comfy chairs provided. Room service was on time and most importantly hot !! Plates are pre heated and remain warm when themeals are served. Breakfast arrived complete with toaster which was set up on our table so that we could have hot toast with our meal cooked to our liking. The room decor is beige/brown predominately and the feel is very warm. - We also suggested that the 40' TV could be mounted a little higher so that it was easier to see from the bed when lying down. A completely new spa has been created replacing the old 3 room one with a new 5 room one and this time with a couples suite which we enjoyed. Treatements here are very good and if you like deep tissue massages done deep then this is one of the few hotels i have found that actually do this consistenetly. The Spa is now conveniently located next to the elevators on the second floor instead of having to access from the 4th floor down a staircase. - Much better ! The swimming pool is an outdoor facility and it is located on the 4th floor. It overlooks Sydney Harbour and the Opera house and it is a great place to soak up some rays and take in views of Sydney harbour at the same time. Service in the restaurant is schmick !! - We were served by staff from France, Norway, Germany and Italy. - a very youthful, professional team all smartly attired and groomed to the max. During the renovations last year the wife and i tried the Shangri La, The Intercontinental, The Sheraton and The four Seasons. - Whilst these are good, they are not even in the same solar system as the Park Hyatt. All now look very tired compared to the newly rolled out Park Hyatt, none can offer the on the Harbour experience and the Park Hyatt front of house team have an edge on all of them. - If you are planning a special trip to Sydney for whatever reason, don't even think about staying anywhere else. Having said that, you have to be prepared to go all the way and book a Harbour view room or a suite, as this is an important part of the wow factor of the hotel. From your balcony you are spitting distance from the Harbour in one of these and this is something you will enjoy and remember long after you leave. - Wife and i have spent many days and nights on the balcony sipping Champagne,listening to nice music and watching the world go by on the harbour. - Game over other Sydney 5 stars !! Park Hyatt Sydney, is not for those of you who prefer to do things on a budget. My view is that money is only worth the pleasure it brings you and you will get plenty of that staying here. On check out, Leon the GM met us and enquired about our stay to ensure we were happy. This was a nice touch and further demonstrated the levels of service you experience here. Left with the wifey, once again very happy that our favourite 5 star retreat in Sydney was back open for business. - Arguably the best hotel experience anywhere in Australia. - Now its back open, \"piggy banks\" all over the world will be sweating !", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hunter Valley", "Title": "“See Sydney at its best”", "Author": "grussellt", "ReviewID": "UR125300311", "Content": "Our stay was in 2010 (so I'm a little late writing this review) but the hotel was superb even before the recently completed refurbishment. We enjoyed two nights (gained in a promotion) and enjoyed beautiful views across Circular Quay to the Opera House. As a Sydney resident I hadn't previously stayed in this Hyatt but it must be up there with the best in the World. Service was excellent - and lunch in the restaurant, with the best views of Sydney Harbour, should be considered by all visitors to Sydney. Lunch in the bar enjoys similar views with good food at affordable prices. It's expensive - but worth every cent.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“True Luxury”", "Author": "RKS", "ReviewID": "UR125259469", "Content": "The recently refurbished Park Hyatt Sydney is simply amazing! From the moment we arrived to checkout, the level & quality of service was just incredible. The room furnishing are high grade and the bathroom is over the top! This upgrade will raise the bar for the competing luxury hotels in Sydney. I especially liked the use of a dining table in the room in lieu of a traditional desk. We enjoyed a very good dinner in our room looking out over the harbor. The breakfast buffet does not offer as many choices as I would have expected at this price range, but the quality is high. I absolutely recommend this hotel.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“The best views in Sydney”", "Author": "cucuruchito", "ReviewID": "UR122484101", "Content": "If you can stay wherever you want in Sydney this is the best location ever. I ve heard there have been refurbishments so check as many aereas must have improved!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne (Aus)", "Title": "“Luxury at its best!”", "Author": "JacquesA", "ReviewID": "UR121758939", "Content": "We had this 2 night stay offered to us. I don't know what it cost, but whatever it did, boy was it worth it! Amazing. Excellent location, right in the middle of everything. Service as one would expect it. Although we stayed in a City Harbour room, and we would have loved one looking at the Opera House, we had nothing wrong to say about the room. Reception staff courteous (could smile a bit more!) and efficient. Concierge was great with advice on restaurants around the area. Now, in the words of the song: \"if I was a rich man\", I would be staying here more often!", "Date": "December 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "beijing", "Title": "“WORST HYATT I've ever stayed at...try the Westin instead.”", "Author": "dbrownBeijing", "ReviewID": "UR120818067", "Content": "My wife and I stayed at The Park Hyatt Sydney last year and we had a terrible experience. The service was horrible and the room and amenities were dirty and poorly maintained. For 700 USD/night I expected much better service and a much cleaner room. The room was covered in dust, the hair dryer was old, dirty and clogged with grime, and the shower was clogged with muck and flooded. Hotel staff did not refill shampoo or shower gel and gave us a hard time when we ask for them to follow up. The Park Hyatt Sydney was so bad that my wife and I moved out and into the Westin where we had none of the problems we encountered at the Hyatt and paid significantly less. I sent a letter to Park Hyatt telling them about my experience. They sent me a letter asking me to go back, spend another 700 USD and \"give them another chance\". Sorry Park Hyatt, for 700 USD you should have got it right the first time.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“First Impressions - Poor”", "Author": "marvs000", "ReviewID": "UR120445180", "Content": "[Whilst my personal experience may not reflect the hotel greatly, please bear in mind that should the day have been seamless as it could potentially be, this hotel could be the best place Iâ€™ve stayed within Sydney] This hotel was booked on behalf of my uncle due to the fact that he wanted to surprise me for my birthday and give me a hotel room that I couldâ€™ve shared with my partner. The manner in which he called the reservations desk, he was able to secure a room and have everything pre-paid in advance and since he was affiliated with a loyalty programme of the Hyatt hotel chain, his details were stored in the system. The most important thing to note was that he noted my name down on the reservation. On the day of arrival, I had arrived with my partner and was expecting to have a seamless check in upon verification of my identity and that my uncle had given permission; unfortunately this was not the case. Because reservations hadnâ€™t put my name down as repeatedly requested, I had to wait outside the lobby (apparently the lobby is for â€˜genuineâ€™ guests and I was asked to leave) for an hour or so whilst my uncle travelled from one side of Sydney to the other in order to finally check us in. After a lengthy wait, we were finally in the room and the amnesties were astonishing. The marble floor bathrooms were impressive and the room itself, though small, was adequate enough for our needs. However, we did ask for a Double/King bed and instead, we were allocated to a two twin beds. We went back to the front desk and because of the peak season, they were unable to adhere to the request. We wanted to enjoy the swimming facilities but because we checked in late and apparently there wasnâ€™t sufficient staffs, the pool was subsequently closed so that is another facility that were unable to enjoy. Whilst the location was superb, we were allocated in a room that the balcony overlooked underneath the Harbour Bridge. I guess we did ask for a Harbour Bridge view. Service upon check in, whilst was out of our control, was unsatisfactory especially when they did request for me to leave the lobby whilst I waited for my uncle â€¦ in the rain! First impressions unfortunately do last and I left this hotel with great disappointment as to my experience.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Amazing”", "Author": "Bianca S", "ReviewID": "UR120287374", "Content": "Very friendly staff and fantastic position, a little expensive but overall ... no complaints, please try it ... you wont be disappointed....", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Anxious to see renovations”", "Author": "Prepwade", "ReviewID": "UR119945904", "Content": "You can't beat the location of the Park Hyatt Sydney. It is in the heart of everything Sydney. We flew into Sydney from the US and stayed at another hotel for a couple days then explored the rest of Australia. Once we saw the Park Hyatt sitting under the bridge we agreed we needed to stay there on our last night in Australia, so the last night we stayed here and were not disappointed at all. The service was great, the location and views were wonderful. It definitely needed a renovation but was still very clean (They were closing later in the month to do a full reno). I am excited to go back and even though the price is way higher than anywhere else in town I would stay here again. It's worth the experience.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Clarksville, Maryland", "Title": "“A gorgeous view”", "Author": "Ella F", "ReviewID": "UR118452012", "Content": "I walked into my room to see a backdrop of the Sydney Opera House--it was stunning. I have ot admit it was hard to leave my room as I just wanted to sit on my balcony and watch the boats pass by in front of the opera house. The rooms are large and very comfortable. The staff was excellent. I don't care for first floor rooms--the first room I was assigned opened out onto a very nice courtyard, but ultimately I asked to be moved to something on a higher floor. They accomodated my request immediately. Food was alright and location is a little removed from the heart of downtown, but still easily walkable (Circular Quay is right there).", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "cheltenham", "Title": "“What a Country”", "Author": "valhalla13", "ReviewID": "UR117881250", "Content": "Stayed here in 2003 to watch India and then again in 2004 to watch Pakistan at the SCG. Great hotel with views over the harbour and bridge. Make sure you pay an extra for the sea views, as we had a load of Aussies that came to visit for a very long party! Advance Australia fair.", "Date": "September 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Amazingly quiet inside”", "Author": "Travel_0084", "ReviewID": "UR117811850", "Content": "We spent part of our honeymoon here back in nov 2010 and I was amazed at how well insulated the rooms were from the hustle and bustle of activity outside. A bottle of sparkling wine chilling on ice was a nice touch and appreciated. The bathroom was beautiful with marble everywhere, with a separate bath and shower which could easily accommodate two people. Finally, we had the breakfast which was superb, and I would highly recommend you order off the menu as well as partake in the breakfast buffet laid out for you.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Nicosia", "Title": "“A superlative experience”", "Author": "al29252", "ReviewID": "UR117585232", "Content": "Excellent service beyond the call of duty, I've rarely experienced anywhere else.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dobbs Ferry, New York", "Title": "“Great location and great service”", "Author": "osborncats", "ReviewID": "UR117015887", "Content": "Staff facilities room location absolutely the greatest for my wife and I. Would go back in a heartbeat.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Best hotel ever”", "Author": "Chizinha", "ReviewID": "UR116937587", "Content": "I stayed at a room on the first floor. Massive varanda, overlooking the Opera House. The bedroom is massive, you can hear the TV from the bathroom, and the hotel reception is simply the best: the gild that did my check-in actually took me straight into my bedroom! Perfect!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London", "Title": "“What a view”", "Author": "Smiller11", "ReviewID": "UR116151719", "Content": "This was probably the most expensive night of our honeymoon but my goodness it was worth it. Our package included champagne, breakfast and a dessert plate. We arrived in Sydney after a pretty bad and sleepless flight and took a cab straight to the hotel at about 6am. I could have kissed the receptionist when he said that our room was ready for us as I was exhausted. The room was spectacular with large marble bathroom and walk in wardrobe but the star was the view; our room looked directly across the harbour to the Opera House. It was absolutely stunning. As we were on our honeymoon the hotel had kindly given us a bottle of champagne and some strawberries to celebrate so with the package we already had we actually had two bottles of champagne. After a quick sleep we went to the hotel restaurant for a delicious breakfast with the view over the harbour. Weâ€™d definitely have breakfast there again even if not staying at the hotel. We decided to have dinner on our balcony that night as we thought we wouldnâ€™t find a restaurant with a better view. Room service was very nice and we also had our dessert plate and some champagne. The next morning we went for a swim in the pool on the roof which was lovely; itâ€™s just below the bridge so there was another great view. The hotel also benefits from a business centre with free internet for the first 30 (I think) minutes so that was enough to send a few emails. The hotel is right on the quayside and an easy walk to the train station even with baggage so Iâ€™d get that to and from the airport. If I had the money Iâ€™d definitely stay here again. It was sublime.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“We LOVED IT!”", "Author": "KylieandAaron", "ReviewID": "UR115649453", "Content": "We stayed here on the night of our wedding. Apon arrival we had been upgraded to a bigger room with views of the Opera House and Sydney Harbour Bridge with champagne awaiting in our room. The staff were lovely, the views were great and our room was huge. It really was special and we appreciate the hotel staff for upgrading our room without us even asking :)", "Date": "July 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“UGLIEST HOTEL INTERIORS”", "Author": "Mandols", "ReviewID": "UR115574607", "Content": "We stayed at the Hyatt for two nights as a guest with friends and we had the worst experience. This is supposed to be a luxury hotel. Thus has nothing to do with luxury and should be a 3 star hotel in the western suburbs. It dies not deserve the location it is in. The rooms are dark and out dated. The breakfast room offers nice views but the actual food is nothing special. The only good thing about thus hotel is the location but I can think of many other hotels with great location and a better view off all of Sydney such as the Intercontinental. I'm really disappointed by this hotel and it really was my worst ever hotel experience the rooms are depressing and I would never wish upon anyone to stay there because it would be a nightmare to go through something like that again.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Just WONDERFUL, Best ever”", "Author": "BestQuality", "ReviewID": "UR109188293", "Content": "Park Hyatt never disappoints, and this one in Sydney? Just amazing. The location is the best you can get in Sydeny, right next to the bridge and the Opera. The rooms, the restaurant, the brakfast (!), the staff, just WOW. Expensive, but worth it. Go there, and plan anything at the Parl Hyatt: a wedding, a cocktail party a banquet, AMAZING!", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Wedding Night Bliss”", "Author": "NTDSydney_Australia", "ReviewID": "UR105536894", "Content": "We had our wedding night here and it was gobsmacking! The rooms are so funky yet classy and very modern with leather chairs and bed. The marble bathroom was larger then my bathroom at home, heaps of room and very glamorous. Spectacular views of the harbour and Opera House. Double glass sliding doors that block out any noise. The kitchen in the morning cooks up a storm with ANYTHING you order-I asked for an organic omelette with no oil and they and it and it tasted delicious. The only down side was we had such a short stay there we arrived at 10pm and left at 8am.. Still dying to get back and experience it in full and not be in a hurry this time. Highly recommend, yes its very pricey but your worth it and will rave about it for years afterwards.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Outstanding location but needs better service quality and renovation”", "Author": "LuneLune", "ReviewID": "UR105238505", "Content": "During my stay (winter) the swimming pool was not accessible and the bars were closed around 10pm which is very early for a Park Hyatt located in a country's capital. The location is just superb at night but a bit far from everything so you definitely need a taxi wherever you want to go.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“loved it”", "Author": "LZSR", "ReviewID": "UR103113987", "Content": "My husband and I had a romantic weekend at the Park Hyatt after snapping up a advertised deal. We had a beautiful opera view room. It was big and spacious, with a bigger than average king size bed and a beautiful marble bathroom. The view of the harbour and the opera house was gorgeous! Breakfast was included in our deal and was probably the only disappointment - the choices were limited and food was prepared in a hurry to keep up with the demand. Otherwise we couldn't fault anything. We received a bottle of bubbles & strawberries on arrival and the concierge got us into a booked out restaurant. We also had a $100 voucher to use within the hotel which was spent in the bar on a fantastic burger and a few glasses of wine. I loved it and am hoping to get taken back there soon! The atmosphere down there is just magical.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Perfect location and excellent concierge”", "Author": "oscarfelix", "ReviewID": "UR102966126", "Content": "I was skeptical as to whether it would be worth the money but I have to say between the fantastic views (opera view suite), great location, and superb concierge I am now sure it was. The staff was so friendly, when we came in from our international flight early in the morning they let us use the spa facilities to clean up so we could enjoy the day instead of waiting around for our room. The greatest thing, though, was the concierge. We booked several dinner reservations through the concierge including one reservation that I was told was \"unavailable\" by the restaurant. I think what sets apart a luxury hotel is the service and they didn't let us down. The rooms are slightly dated, but the hotel is now closed for a six-month renovation, so any defects (I thought the room was nice but it did have a 90s style bathroom) should be cured. We enjoyed the restaurant, but we did only eat there for breakfast and one lunch - as I recall now we had a really nice waffle one breakfast (so many places can't do them right or manage to serve them hot) and a fantastic burrata appetizer at lunch. I also used the spa for a massage and the masseuse was good (I had a deep tissue and you need to get someone who knows what they're doing for that) and the massage room was beautiful. Over our four day stay we really had no complaints - ok one, they need to stop charging for internet access it is just ridiculous at their price level- and would definitely come back.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great location but needs renovation.”", "Author": "thrPRICESareRIGHT", "ReviewID": "UR100501320", "Content": "To begin...we were extremely excited to be staying at another Park Hyatt. We had stayed in the Park Hyatt in Melbourne a few weeks before and LOVED it! Unfortunately the chain is not consistent. This hotel is one of the most expensive hotels in Sydney. It's location cannot be beat. It has a great reputation, but lacked in most areas. The room was old and worn. We had a room with the view of the opera house and that was AMAZING. It's fitness/spa center is tiny and the pool area lacked any amenities. We had spa services. There was only 2 massage rooms, a sauna and a steam room which is used by everyone in the hotel. There was no \"relaxation room\" so we decided to use the jacuzzi prior to getting our treatment. The treatments were, standard, and the ladies were sweet, but it was nothing to write home about. The hotel staff, in general, was snooty and did not seem to want to be bothered. We are used to this attitude in the USA, but after we had been in Australia for a month we were more than disappointed in their hospitality. Because this is an extremely expensive hotel and one of the highest rated I would have expected much more. Maybe they can learn a thing or two from their sister property in Melbourne. Very disappointed.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Excellent hotel - restaurant not good”", "Author": "gaby_pa", "ReviewID": "UR99306770", "Content": "We cashed Hyatt Passport Points to stay at Sydney Park Hyatt. What a big different from Y Hotel Hyde Park! (Read my previous review of Y Hotel Hyde Park). The hotel is about 10 minute walk to Circular Quay. We did not get the Opera room, but our room faced Circular Quay and International Cruise Terminal. I was told that to use the Wi-Fi, I had to log on with my last name and room number as password. When I opened a browser, the log on screen was automatically populated with first name and last name of the guest who stayed in different room. For privacy reason, it wasnâ€™t good. I explained the system issue to the front desk. Internet is free for Hyatt Platinum members. One day the front desk helped me to mail several postcards free of charge but the next day other staff asked me â€œwould you like to pay $2.10 for the postcard stamps or bill to the room?â€� The heat wave caused the temperature to jump to 42 C. It was the perfect time to try the roof-top pool. I notice a popular restaurant â€œPancake on the Rocksâ€�, just 5 minute walk. We did not eat there because the line was too long. We decided to dine at Hyatt Harbor Kitchen. We ordered McLeay Valley rabbit braised in balsamic with fregola, marjoram, pecorino and Tasmanian wilderness beef short rib with tamarind, molasses glaze, watercress, horseradish. The sauce was so overwhelming that I could not taste the meat at all. The food was unappealing (see photos) and looked like what Fiona serves Shrek every morning. Overall, the hotel and restaurant service were excellent but food is not good.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stunning views,professional staff,we wouldn't stay anywhere else”", "Author": "lbkgooner", "ReviewID": "UR97346098", "Content": "We stayed at the park hyatt for five days in jan 2011 and have to say,everything about this hotel is first class.Situated in the rocks area our view from the room was of the sydney opera house and harbour.The bar was a very relaxed affair with excellent staff as was the breakfast restaurant which had the added bonus of floor to ceiling glass windows allowing views of the bridge,harbour and opera house.Concierge were probably the best concierge i have ever dealt with,providing us with ashes tickets,restaurant reservations and driving out to a poorly managed hotel in the hunter valley to pick up some items i had left there and posted them onto our next port of call,even though we had left the park hyatt four days prior(a big thankyou to bruce and grant btw).We would never stay anywhere else in Sydney.One other thing, the hotel is closing for a refurb in march , so should be even better when it re-opens", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beautiful view, professional friendly staff, pampers the business traveler”", "Author": "Light_33", "ReviewID": "UR97051916", "Content": "I spent a week in Sydney on business - the business day would start at 10a and we would go thru to 5p eating lunch at the conference table. Coming home to this hotel was such a breath of fresh air - literally there are floor to ceiling retractable windows looking out onto the spectacular view of Sydney harbor and the opera house. the air was caressing, wonderful help in the bar so courteous and friendly. the restaurant was where I ate most of my meals and was really good. (everything tastes better in australia) the room had a balcony looking straight into the opera house, fabulous bath tub, great service.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pleasanton, California", "Title": "“Why would you even consider another place to stay?”", "Author": "JunkyardWisdom", "ReviewID": "UR96576893", "Content": "Best hotel in Sydney by any measure. Fantastic location, great staff, excellent rooms. I stayed one night in the Four Seasons just a few blocks away, and it's good too, but I'd go back to Park Hyatt without hesitation.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sydney australia", "Title": "“fabulous staff make a great hotel in an iconic setting pure perfection”", "Author": "montySydneyAustralia", "ReviewID": "UR96211290", "Content": "The Park Hyatt Sydney on the edge of Sydney Harbour has point blank views of the Sydney Harbour Bridge, the Opera House and Circular Quay. All rooms have a view of the water because the hotel follows the curve of the harbour and overlooks Circular Quay. The service is flawless, the staff charming and the rooms without fault. The restaurants are excellent and the city and historic Rocks area is on the doorstep. This is a great hotel that makes you feel welcome and special.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Well done, as always”", "Author": "ALKDVS", "ReviewID": "UR93261104", "Content": "This hotel has to be the best in Sydney for location and service. (We have stayed here before, both times on points.) The restaurant is excellent, the service is excellent, the hotel staff is friendly and efficient; nothing was too much trouble. About the only faults one can find with the hotel is that the rooms are rather small for the price--and the rooftop pool is a joke. The rooms have been refurbished and are quite comfortable, making up for their size. But the pool is tiny and when it is colonized by children, as it was when we were there, there weren't even enough deck chairs for everyone who wanted to be on the pool deck to sit. People were pretty unhappy with the situation. But you simply cannot beat the city/harbor/opera view that the rooms have. One of our favorite hotels.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent Sydney Hotel”", "Author": "ajmia111", "ReviewID": "UR92862835", "Content": "All aspects of the Park Hyatt Sydney were first rate. The location (Rocks district, directly across from the Opera House, nearly underneath the Sydney Harbour Bridge, adjacent to circular quay) is unrivaled; the room (deluxe opera king) beautiful, spacious, smartly designed, with an amazing view; the personnel - professional, attentive, responsive; concierge solved problems (broken blackberry repair as an example) with incredible efficiency and care. This is a top notch hotel in a perfect location with a terrific staff. I highly recommend it.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Great location, fabulous service”", "Author": "lovelongboatkey", "ReviewID": "UR92701086", "Content": "We arrived by night in Sydney, check-in was a casual, relaxed affair and we were shown to our room and were wowed by the amazing view across the harbour to The Sydney Opera House. The hotel is perfectly situated at The Rocks in Circular Quay. The room was spacious and comfortable, but a little dated. The hotel is closing for a six-month refit at the end of March, so I would say it will be spectacular when it reopens, as all of the common areas were very nice. We had a drink and some bar food, in the old fashioned bar which was a lovely spot to unwind from the days travelling. Breakfast was wonderful, overlooking the Opera House, Bridge and Harbour. The rooftop pool and patio were a little small, but a pleasant place to chill. The hotel staff were really first-class, they could not do enough for us. The concierge arranged some brilliant, inexpensive tickets to the Ashes for us, a great day. Julien was very attentive waiting on us for breakfast. And Grant was amazing, above and beyond, to reinstate us with left items. Would definately return, I am sure it will be amazing after the renovation.", "Date": "January 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "California", "Title": "“What a Place!!”", "Author": "gmcCalifornia", "ReviewID": "UR91984470", "Content": "Located at \"The Rocks\" tehe Park Hyatt Sydney offer a really clean and sophisticated atmosphere. Also, the most unbeleivable view of the Harbor and teh Sydney Opera House.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Simple incredible - but bring your cheque book”", "Author": "Melbourne_Female", "ReviewID": "UR89783896", "Content": "I stayed for three nights in an Opera Deluxe room. What a view! This hotel is simply incredible,;the service, the location, the view, the rooms. The only fault I can think of, is my room was not far from a very noisy outside bar, which didn't quieten until midnight on the Friday night. Not particularly pleasant. However, at over $1,000 per night, it's not exactly a budget option!", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oro Valley, Arizona", "Title": "“Great location and superb service”", "Author": "berniss", "ReviewID": "UR89671597", "Content": "Another reviewer wrote that they experienced unpretentious, 5 star service and that is a perfect description of what you can expect. We used a Stay Coupon for a couple of nights and were given a standard room looking at the Circular quay but not the opera house. When we arrived, our room was not ready and I was unfortunately suffering from a migraine. The front desk arranged a day room and sent in some tea and a hot pack to me. We came back from dinner later that night and found our AC was not working. The night manager quickly moved us to another room for the night, apologizing profusely and offering us breakfast or anything else we desired. The next morning, without any mention from us, the staff offered us either a larger room with the same view we had or a standard size room with a view of the Opera House. They couldn't have been more solicitous and we were appreciative. The breakfast is excellent, but pricey (45 per person). The location is the best in Sydney. It is walking distance from the ferries (to zoo or beaches), the Opera House, Botanical Gardens and next to the Sydney Bridge. You can walk anywhere and there is a free bus at the Circular Quay downtown. Standard rooms are quite large and nicely appointed. If you want an Opera House view, make sure you book it. What made it special was sitting out on the balcony at daybreak or evening and looking out at the scenery. There are two types of balconies...one is more like a french balcony and one can support a couple of chairs and a table. If you plan to use your balcony, make sure you request the larger balcony style. No room has a poor view, so if you are traveling with a family, you may want to get a larger room. There is a roof top pool and you can walk to all sorts of restaurants. For cruisers, it is next to the cruise terminal. The Hyatt will drive you and your luggage there. We were very pleased with our stay. Sydney is a lovely city and the Park Hyatt doesn't disappoint.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cyclinglover", "Title": "“Fantastic location, great room, but pricey”", "Author": "cyclinglover", "ReviewID": "UR88634028", "Content": "Stayed for 1 night; Couldn't fault anything. The location and views are the best in Sydney. The room and service was great, breakfast was good but not outstanding. What I really liked was that the hotel was really quiet, which is an important issue for me. Conclusion: this is a really great hotel, but it is too expensive, especially considering the expensive Australian dollar (at today's exchange rates). FYI, there will be a big renovation in 2011, and the rooms should be even better after it.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Excellent location. First class service.”", "Author": "Maisondememe", "ReviewID": "UR88429287", "Content": "We enjoyed a superb four night stay at the Park Hyatt, Sydney. The location is perfect and service top quality without being intrusive. We stayed in room 344 which had the benefit of direct views of the Opera House. Dinner in the hotel restaurant is highly recommended. One very minor grumble was the need to queue up to put your bread in the toaster at breakfast â€“ although you could order it from the menu at extra cost!", "Date": "November 28, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Best views in Sydney”", "Author": "sparkleytraveler", "ReviewID": "UR87143136", "Content": "I haven't stayed overnight at the hotel but I have been to the hotel for High Tea with my cousin. Wow. The most impressive, most stunning views of Sydney Harbour one could imagine. Just incredible! The service was fantastic, the food was delicious. Afterwards we got a tour of the hotel and it was immaculate. If I didn't have family I could stay with, I would definitely stay here... The location makes it so wonderful - close to everything you want to be close to during a visit to Sydney, but it is also quite peaceful and sort of set apart from all the hustle and bustle.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Sydney's best location, with subtle style.”", "Author": "Familytour4", "ReviewID": "UR87006816", "Content": "This was our second stay at this hotel. It has a wonderful low key ambience and well trained, friendly staff make this 5 star hotel more memorable than most. This just adds to the extraordinary view over to the iconic Sydney Opera House and harbour. The rooms have been newly decorated, so are comfortably chic. The restaurant staff are attentive and the food challenges the palatte in a positive way. A special event deserves a special hotel, business or pleasure they will make your stay.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Fourth hotel of trip and finally a winner!”", "Author": "ValVil", "ReviewID": "UR85930662", "Content": "We've had a tough 2 weeks with three disappointing hotel stays. Arriving from our biggest disappointment at the Park Hyatt in Melbourne, our expectations were somewhat reduced. But, as soon as we pulled up to the entrance of the Sydney Park Hyatt, it was clear this was a whole different story. There was not one aspect of the service at this hotel that disappointed. Door men, valets, front desk clerks, restaurant service staff, concierge...all performed beyond expectations. We complained about the prices at the Melbourne Park Hyatt. In Sydney the prices were the same, but we did not feel taken advantage of. At the Sydney Park Hyatt, you pay for the quality, but the quality is worth paying for. The food quality is excellent, the location is outstanding for downtown visiting (though a bit tough to get to since it is the furthest point you can go through generally very slow traffic), many of Sydney's attractions are within walking distance as are the ferrys and many great restaurants. Take the ferry to Manly Beach and have lunch at the recently opened Manly Pavilion restaurant! It is a great experience...and, of course, don't miss the Opera House tour.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, CA, USA", "Title": "“it doesn't get much better than this!”", "Author": "gbramson", "ReviewID": "UR85798904", "Content": "If going to Sydney, I can't imagine any better location in all of Australia! Beautiful rooms, hotel, restaurants, roof pool....and the view! The staff is almost too perfect! If there is room for a single complaint it's that the great view room we had is a long distance from the elevator, but it's WORTH the walk!!! Simply stated, all around outstanding! Would go again and book the same room.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Brilliant”", "Author": "Neilmclean", "ReviewID": "UR84585921", "Content": "Great staff, great location and lovely rooms. As good as it gets.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“A dream vacation”", "Author": "julesandheath", "ReviewID": "UR84515403", "Content": "We were in Sydney for our 8th Wedding Anniversary & My husband's 34th Birthday. Because two such special occasions were tied over the weekend, we decided this year to do something really special and I'm so happy we booked at the Park Hyatt, Sydney. Due to extreme excitement, the morning before we flew to Sydney (from Adelaide) I rang the hotel to enquire as to the view from our assigned room, and what room number we were. (also, a previous experience shows that late arrivals to some hotels you get \"what's left\"). This was not the case here. I spoke to Simone who was very helpful and entertained my enthusiasm and barage of questions. A good start... We arrived late, about 10pm and we had the pleasure of Ronny checking us in. Very professional and friendly and it was a really nice start to our stay. As it was a special stay Ronny arranged a bottle of wine to our room - this was a really nice thing to do for us, thank you. Next we decided to have a hot chocolate before retiring to our room. Thanks to my earlier liaison with Simone, Stuart brought out a dessert with a candle on it (me being the terrible wife, i hadn't arranged a cake:). Thank you Stuart, this was very special. Kirsten was looking after us also and she was such a delight as well. The hospitality and warmth we experience from Stuart & Kirsten made us immediately feel at home. It was the end of the night and yet they were very relaxed and had lovely smiles for us and we really enjoyed our interactions with them. Although I had an itinerary for our trip to Sydney, the next morning I rang concierge about a minor query. I was speaking to Chris who drew from me our plans for the day. By the time we went to Concierge 10 minutes later, Chris had a number of Manly breakfast dining options and ferry timetables for our day. Wow! We hadn't expected this and he had even highlighted certain details for us. During our stay calling Chris each morning became a regular for us. I feel he encapsulates the service you expect at this establishment and Chris does it with ease. I wish him all the best, he was really lovely to us. I highly recommend WOLFIES GRILL for dinner - I have dined here previously and it's still as excellent as I remember it and fyi it is on the waterfront. Best of all it is only a stones throw (literally) from the front door of the hotel - an easy stroll in heels ladies! We also dined at Aria while in town, which was a complete sham trading under a tv persons name. Hugely disappointing on so many levels (except the food which is a real shame for the chefs.) We were made to wait 60 minutes for our table which I had booked months in advance, they tried to then give us a middle of the room table when i had requested a window table in my booking, they tried to charge us $100 of the previous tables drinks, they filled still tap water into our sparkling water glass - of which we'd had half a glass each and were charged $24 for! the list goes on sadly. It was over $150pp and we were hugely dissatisfied with our experience and I feel really sorry for Matt Moran and the chefs because front of house really let them down (I have reviewed it so and wish i'd read previous reviews saying similar things *sigh*) Back to the Hyatt! (Wish we'd dined here instead of Aria). I would like to make a special mention to housekeeping. Our rooms were kept pristine clean and the turn down was lovely. I've been to hotels where you sense housekeeping do a rush job through your room but I got the feeling that housekeeping took great care and pride in their work because our rooms were always of a very high standard. We enjoyed a lovely warm spa one morning. The water level was a bit low but we still enjoyed ourselves. We noticed a very well equiped gym on site also. We ordered in room service one morning and it was delicious and i have to say, not too badly priced compared to some hotels we've been to (not that i'd want to pay anymore!) Room service was efficient and I was very impressed with this. We had room 005 which has a view to the left of the Opera House and across the water to the city. it was fabulous! thank you very much to the Hyatt for this room. Room 004 would also be ok but i think the rooms get even better up to around 009 / 010 or so with probably even more frontal views of the operal house. My sincere thank you goes out to the Hyatt and it's beautiful people. This was a very special 4 days for us in Sydney and we had been looking forward to it for quite a few months. Because it was a romantic holiday, where we stayed really mattered to us and you all did a wonderful job of helping us have a great stay. We are spoiled now, and we will only ever stay at the Hyatt now for future sojourns to Sydney.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "United States", "Title": "“Overpriced and underserved”", "Author": "luxurytravelguru", "ReviewID": "UR84282996", "Content": "Second time at this property and I was unsure about staying after a very ordinary experience last time. Location aside (which nobody can argue is phenomenal), the service is not up to five star standards and more in line with a three or perhaps four star property. The room furnishings etc are showing wear and tear (our drapes filthy). Housekeeping was limited to making the beds and changing towels, but do not expect anything more, no tidying, removal of dirty glasses, no chocolates with turndown, nothing special. Expect to have to ask for everything in the restaurants, water etc, and your room service orders to be incorrect and the food cold. I understand the hotel is undergoing some refurbishing next year and I would recommend that they focus on beefing up their service standards which are bordering on appalling. Overall a very average, overrated and ridiculously overpriced experience.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Comfortable, albeit pricy, hotel in a supurb location”", "Author": "Sunny777", "ReviewID": "UR83664675", "Content": "First of all, the location of the Park Hyatt is superb. Stay here, and you'll be looking at the Opera House from your balcony. Not only that, but you'll be steps away from great restaurants and bars, shopping, and many of the city's major attractions. You'll have a wonderfully appointed room with everything just where it should be, a well-stocked minibar, and a comfortable bed. Venture to the roof and you'll find a pool area where you can order drinks and food from room service and relax. The concierge was helpful in showing us where to go and what to do. We made reservations at Aria for our last night in Sydney. When we sat down, the waiter brought over complimentary champagne since we had booked through the Park Hyatt, which was a really nice touch. Made me wish I had made all of my reservations through the hotel! The pool area is very pleasant. Unfortunately, the hot tub wasn't very warm - but everything else was nice. We didn't eat at the hotel, but the restaurant and bar areas looked nice, too. Overall, a very nice hotel with everything you need to be comfortable. As others have mentioned, it does feel a it more businessy than leisurely. I can't really put a finger on it - everyone was very cordial and pleasant, but it just didn't have that warm feeling that other hotels of this caliber I've stayed at have. But then again, it is a city hotel. As for the city itself - definitely a nice place. Very liveable, actually. We were there in mid-Sept., so the days were mostly warm and the nights cool. We did the Bridge Climb (steps from the hotel and a fun, if time-consuming, activity), the Opera House tour, a speedboat tour on the Harbour, Sydney Tower (avoid this one - it's a huge tourist trap), Darling Harbour (good nightlife and restaurants - we had dinner at the very nice Indian restaurant Zaafran), and the Zoo (quick ferry ride away). We skipped Bondi beach since the weather was a bit cool. Also recommended - Pancakes on the Rocks - a 24-hour pancake restaurant with numerous delicious choices. But here's the bottom line. Without a doubt, the Park Hyatt is definitely nice. Best hotel in Sydney? Probably. Would I stay here again? Sure. Would I pay full price? Probably not. While I haven't stayed elsewhere in the city, there are many nice hotels in the area with far more reasonable rates. Although the hotel and staff was pleasant in every way, the very fact that it's in the city and that there are many options to chose from would probably prevent me from paying what I feel are very high rates. That being said - if you're able to snag a discount of about 50%, go for it!", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Fabulous view and exceptional service”", "Author": "global_nomad_pacific", "ReviewID": "UR78504132", "Content": "This hotel has to be Sydney best. I was really impressed by the level of service and the quality of the staff who went out of their way to be helpful. The location is fabulous and we found (with help of concierge) some great restaurants in walking distance of hotels. Breakfast is pretty good - but I think the buffet could be better (eg Park Hyatt Milan bfast better), but you can not beat the view from the breakfast room - it is priceless directly out to the harbour and opera house. Only downside is that I felt that the interior of the hotel is starting to look dated and tired and the rooms need to be refurbished, they are ok but just not top notch. We stayed for free due to Hyatt loyalty program. So great value for money!", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Sydney's Best, Bar None”", "Author": "LunaLondon", "ReviewID": "UR78164469", "Content": "PH Sydney is a wonderful retreat, with an unbeatable location, jaw-dropping views, understated opulence and warm, easygoing but attentive service. Service is discreet and personal. The rooms are extremely comfortable and enjoy senstaional views, ours was of the full Opera House and Harbour. I could have sat in my Emes recliner all day, just looking at it. There was also a sizeable balcony, table and chairs from which to enjoy it too. For another great view - of the Harbour Bridge and the city skyline, there is a lovely rooftop small, which makes up in sheer style and views whatever it might lack in size. Breakfast, and yet again, the views, were sensational at the Harbour Kitchen. The fare itself was great, but the views and ambience made it unique and exquisite. I've stayed in a lot of good Sydney hotels (IC, FS, Westin, Sheraton, Hilton), but the Park Hyatt is in a class of its own.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Pinas, Philippines", "Title": "“Great location! Helpful staff!”", "Author": "Keisie", "ReviewID": "UR78061969", "Content": "I loved this hotel. Everything was very luxurious. The staff went out of its way to help us. The staff helped me book my Sydney Bridgeclimb adventure and helped us get disabled accessible taxis for my mother. The room was wonderful. Outside your window is the Sydney Opera house and to your left is the Sydney harbor bridge. We would often eat breakfast or hang out in the balcony and just take in the sights. The rooms are very roomy and comfortable. The bathroom is large and luxurious. I love Hyatt's little toiletries and how they match these to the place. For instance, in Bankok all the soaps and shampoos were mint (because of the heat), in Sydney they were figs and olives (i think) and in London they were oat and barley based. Upon learning that we would be visiting London later this year, the staff actually printed out a brochure of the Hyatt Hotels in London. They were accommodating and very friendly. I love the Park Hyatt! It's a wonderful hotel, a little pricey, but it's a great experience.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“They simply went out of their way - extraordinary”", "Author": "csaa1480", "ReviewID": "UR77938462", "Content": "Spent 5 days there in early September 2009 on the occasion of our wedding. The hotel - and in particular the staff - was amazing. Nothing was too much to ask for, they did everything they could to help us with the preparations and sort everything out (delivery of the cake, limousine, champagne, restaurant reservations, etc). In particular the concierge team truly deserves to be described as \"simply the best\". They seemed to share our excitement and during preparations checked regularly whether everything was fine. On the day, in addition to all the other logistics, they sorted out a separate room for my wife and her stylist to do the make-up, etc. I have never felt better cared for and looked after in a hotel. A true gem.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Exceeded Our High Expectations”", "Author": "WildeOrton", "ReviewID": "UR77124015", "Content": "We just returned from a two week holiday in Australia, during which we stayed at both the Park Hyatt in Sydney and Melbourne. We could not have been more satisfied with our stay at either location, but our Sydney stay was especially magical. I will say up front that I am a Hyatt Gold Passport Diamond member, so I received amenities that others may not (free breakfast, room upgrades, etc.) and was able to stay for free due to a Hyatt promotion. Obviously, any value oriented questions about our stay will be greatly distorted because we stayed, basically, for free, but that should not detract from the level of service and accommodation we received, nor the stunning views. We were a party of four and we had reserved two rooms, which they were able to get adjoining for us. Both modern rooms were exceptionally spacious, with huge, walk-in closets and enormous, marble bathrooms with separate tub and shower. Butler service is provided for every room and he was extremely gracious, bringing cookies, fruit and M&M's each day without our asking. The lighting was perfect and able to be dimmed throughout, and the drapes were linked to a remote control for opening and closing. Obviously, any guest staying at this hotel is going to request (insist?) on a room with an Opera House view, which cannot be accommodated in all cases. Ours were in between; they had a view of the structure from our balcony, if we stood to the right and looked out to our left. We could not see the Opera House from our beds, or anywhere inside the room, but the city views we had, in addition to the ability to see the Opera House, made it quite nice. We ate breakfast in the main restaurant every day and the food was wonderful, if expensive for paying guests. Almost all the tables look out to the Opera House and it a quite a lovely sight first thing in the morning. Ate at the Little Kitchen one evening and really enjoyed the food there, as well. Less expensive than the main restaurant and same high quality ingredients. All in all, we felt very pampered during out visit and we would not have changed a thing. One special \"thank you\" to the concierge with whom we had the most interaction, Junaidi Susantio. He could not have been more gracious and he made our stay that much more memorable.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Exceptional hotel.”", "Author": "Travel-fanaticUK", "ReviewID": "UR76174678", "Content": "In sum, an exceptional, understated but elegant hotel with excellent, professional staff, a superb concierge who can provide genuine recommendations for hot spots and places to go off the tourist trail. Rooms understated but beautiful, and incredible views across the harbourfront. Restaurant also excellent - breakfast couldnt be better and the dinner menu also superb. If you're looking for a highly-professional, sleek hotel outfit this is for you.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Prime location, luxurious room. Shame about the room service.”", "Author": "warchild69", "ReviewID": "UR75849377", "Content": "This hotel is simply stunning - easily the best location in Australia, with stunning views of one of the world's most beautiful harbours. Our checkin was handled with discrete, personalised service, and our room was ready upon arrival. The room itself was magnificent, and among the finest of all the Hyatt properties I have stayed in around the world. Unfortunately, the quality of room service was poor. It took 90 mins to deliver a small (250ml) jug of fresh milk (and then only after two reminder calls). Fortunately, the $4.50 charge was reversed at departure. It took 1 hour 15 minutes to deliver a cheese platter - thus causing us to be late for our dinner engagement. No apologies were offered. (We ended up consuming the cheese platter after we returned!) It was such a shame that the very slow in-room catering let down the rest of the team. I sincerley hope this is a \"one-off\" incident, as I would hate it to degrade what is an otherwise outstanding 5 star property. Valet parking was prompt and courteous, and my wife was thoroughly impressed with the facial she received at the spa. Overall, we did enjoy our stay and recommend it to other travellers - notwithstanding that for us, the in-room catering was not value for money.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Worth the money for the room, service and view”", "Author": "Wordage", "ReviewID": "UR75280775", "Content": "My partner and I stayed at the Park Hyatt Sydney on 27 July 2010. The experience was so positive that, after benefiting from countless TA reviews but always never getting around to reciprocating, I am finally doing my first review. I have coveted staying at this hotel for many years but it's not exactly within our usual price range. If I couldn't hide out in the Maldives or Morocco for a big birthday, then staying overnight somewhere special in our own home town would have to do. I really didn't expect, though, for the reality to fully live up to the \"dream\" or the hype or even the cost, but thankfully I was wrong. Maybe it helped that it was a quiet time of year, or that I wasn't jetlagged, or the complimentary bottle of sparkling wine that was delivered to our room after the concierge learned of our special occasion, or the late check out. One can also become fairly blase about an icon such as the Sydney Opera House when it's in your own backyard, so to speak. But at the opening of the remote controlled curtains of our Opera View Room, the Opera House looked sensational and new. The staff at the Park Hyatt were also among the friendliest I have experienced, impressing as quite genuine in their attentiveness and care. Alex in the Club Bar, and Ronnie, one of our concierges, were particularly helpful and friendly. The only negative to the night also ended up with a positive. We decided to dine in our room to get every cent's worth of our stay and the view. The cost of the meal was waivered, unsolicited by us, when one of the steaks was not cooked quite to our original request. Overall, the hotel is at the high end of the Sydney price range and, of course, we deserved to get what we paid for - it was just very nice indeed to actually have that outcome. Definitely recommend this hotel if you can afford it.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic Rooms, Fantastic Concierge”", "Author": "NoSleepTillMnhtn", "ReviewID": "UR74627071", "Content": "The Park Hyatt in Syd certainly stands out as one of the top hotels I've stayed. The rooms were very comfortable and large, the ameneties plentiful, and all staff very helpful. I cannot compare to other top-tier Sydney hotels, but across the world, this earns 5 stars. Only disapointment is that after my SOs 5 prior stays with great views and mid-level Hyatt elite status, this 6th stay with me as a tourist earned us room 017 with a view of the taxi stand on the street. Better rooms were confirmed available at check-in by the desk clerk, but he would only offer us to pay the difference above her corporate rate. Understandable, but still frustrating as this time was more important to get a view than any other stay! Oh well. Pros: +Really comfortable room, great bathroom full of ameneties. Free water is something all top-tier hotels need to do! +Great concierge staff, helpful as could be. Two concierges for a relatively smaller hotel was impressive. Cons: -Price is considerably higher than other 5-star hotels in Sydney. Not sure if the price meets the value if paying non-corporate prices. -Internet was a pricey $25/day", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Mexico", "Title": "“Amazing luxury and best location in Sydney”", "Author": "mathpoet87", "ReviewID": "UR73953962", "Content": "My wife and I stayed at the Park Hyatt on the last night of our honeymoon. We were not willing to spend $800 for one night (we'd rather have had two more nights on Green Island instead), but we got the night free with a Hyatt promotion. The place was simply amazing. Best view of the Opera House in the city, opposite a private pier where no ships can dock to block the view. From our balcony, we looked left, and there it was. Right below the Harbour Bridge too (we recommend climbing the steps to the South Pylon observation deck), in the heart of The Rocks--fantastic! Great entertainment in the bar, and excellent staff. The room itself was superb, with a marble bathroom and very comfortable bed, even with remote-controlled curtains! Is it worth $800? Again, I'd take two nights on Green Island instead in a heartbeat, but if you have the means (or get lucky like we did), the Park Hyatt can't be beat.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los angeles", "Title": "“BEST FIVE STAR PLUS HOTEL IN MY TRAVELS, AND I HAVE BEEN TO SOME OF THE BEST”", "Author": "susannaa2000", "ReviewID": "UR73329390", "Content": "The Park Hyatt Hotel and Staff are some of the best in the world.....One of the most beautiful and breathtaking locations, Amazing rooms and service, Delicious and Gourmet Food , Beautiful Facilities, Great Location, Super Private, Super Quiet Rooms, amazing amazing hotel in every way, I am very well travelled and this is by far on the top of my list ....The stay began with a warm welcome and check in from the Front Office Manager Leigh Shepheard, he was so kind and professional...and nothing was missed.The Opera House View rooms are so priceless...The rooftop pool and jacuzzi are really nice as well..There is a view from sitting in the jacuzzi of the Opera House....I would go on and on about the comforts and luxuries of this hotel but I think I have made my point...I was travelling with my dad who also enjoyed his room and service and we both loved it and would recommend to anyone who is into sophistication, luxury and friendliness...Also for people who want to make their trip to Sydney the most memorable...Nothing and no location or hotel in Sydney could top this one!!!! thanks to everyone in the front desk area, concierge and food service....it was terrific", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg", "Title": "“Worth every penny”", "Author": "HamburgBowmore", "ReviewID": "UR72952701", "Content": "You can not go wrong staying at the Park Hyatt, Sydney. It has the best situation at the foot of the Sydney Harbour Bridge opposite to the Opera. what a treat to push the button and look at the Opera while the curtains open. Nice restaurant, good food, drinks and services. The only negative point is that they will close next year for renovation, which will make it even better. Where shall we stay while they will close?", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Great place to see and enjoy Sydney”", "Author": "Jimpulcrano", "ReviewID": "UR72797576", "Content": "Beautiful location, perfect rooms, a good gym, nice pool and hot tub and friendly staff. My only complaint was that the bar closed at midnight on a Friday,but the view of the opera house from the hot tub made up for it. Skip the hotel breakfast buffet and head for The Rock Cafe.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Best location in Sydney”", "Author": "FredH71", "ReviewID": "UR72230353", "Content": "Having only recently discovered, and taken advantage of trip advisor I thought it time to write a review. My wife and I regularly visit Sydney and for the past four years have always stayed at the Park Hyatt. Location is extraordinary - worth the extra $ for a room with a view of the Opera House. Service throughout the hotel is always spot on. The concierge service in particular is worth taking advantage of; have helped organise a variety of side trips for us over the years. One that will never be forgotten was a two night getaway via seaplane to Jonah's at the northern beaches of Sydney. Being on Sydney Harbour you can organize a water taxi directly to Manly, Rose Bay (where the seaplanes take off and only ten minutes from the hotel) and just about anywhere with a wharf. The inhouse restaurant is worthy of its location but don't forget there are half a dozen one, two and three hat restaurants with-in walking distance. Concierge can be very helpful with last minute reservations. Suggest - Guillaume at Bennelong, Aria, Galilao and Quay. Cant talk highly enough of the place.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“great hotel - but not cheap”", "Author": "denise40smile", "ReviewID": "UR72037822", "Content": "We arrived tired and jet lagged in the early hours of the morning and our room (understandably) wasnt ready - but were welcomed by the manager (a 'celeb' was on the same flight/in same hotel as us - I cant imagine he would normally do that - but it was nice) but they treated us to a complimentary breakfast and we watched the sun rise over sydney opera house from the comfort of our breakfast table. The location and the view is amazing. We went out for a walk and they phoned us a couple of hours later to say our room was ready - having fast tracked house keeping when the previous guest had checked out. The room was well appointed and comfortable - worth paying the extra for a harbour view. The concierge staff were helpful and attentive and sorted things out when our pre-booked trip to the Blue Mountains failed to show up - they made them come back and fetch us :-) They booked us fab trips and made great eating out recommendations. Customer service at reception and breakfast were first rate. Laundry service excellent but a little pricey. Overall a wonderful start to our grand tour of Australia. We went a few years before the date indicated - but it wont let you \"back review\" and ive only just got properly into trip advisor - which is a great website.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great top tier hotel”", "Author": "CamW_Sydney", "ReviewID": "UR71447752", "Content": "I arrived about 2:15pm for my two night stay and went through check-in where I was told that the room wasn't quite ready yet. As I was in my home city and not coming off a long flight or similar, this wasn't a problem and I went and had a drink in the bar followed by a nice walk around the park and pier surrounding the hotel. The room became available just after 3:30pm and I was escorted to the room by the same friendly person who checked me in earlier. The room was on the second floor, at the curve of the main building that comes around to face the Opera House. The views of the harbour from the balcony were wonderful and definitely a prime attraction of the room. The double doors were effective in keeping the noise of the harbour out during the night almost entirely. Some of the furniture items might be in need a bit of refurbishment but it was still very comfortable. We had breakfast in the hotel on both mornings, we ordered off the menu rather than the buffet, delivery of the meals was quite slow on both occasions - but to be fair the restaurant must have been close to, if not full both times. I really enjoyed the truffled scrambled eggs, rocket and parmesan with a side of Barossa Valley \"Schultz\" bacon and my girlfriend had two different egg dishes that I was told were nice, so it was worth the wait. Not much else of interest to report - a repair person turned up around 5:30pm on the first afternoon asking if there was a problem with one of the doors closing, but we hadn't had any problems. A late check out was granted which was appreciated. All in all, I found the staff to be brilliant and the room and location were spectacular. I'm very much looking forward to my next stay here later this month.", "Date": "July 19, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Best Hotel in Sydney”", "Author": "Bostravelguy", "ReviewID": "UR70440349", "Content": "Location great, room spacious and staff extremely helpful. The only place to stay in Sydney", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hong Kong", "Title": "“Very nice but a little old and a little dull”", "Author": "JayODHK", "ReviewID": "UR70103876", "Content": "Overall a nice hotel but would probably try another next time in Sydney, particularly as the price is top of the range. The hotel is celebrating its 20th anniversary & it shows a bit - everything is sparkly clean and nothing is tatty but it all just seems, well, very 1990. Pale ash furniture & lots of mirrors in the room, none of it very stylish, leaves you with a cold feeling. Hotel only has 3 floors so the scale is intimate & every contact we had with staff was perfect & genuinely warm & welcoming. Views of the harbour & depending on the room & how you crane your neck, the Opera House, are nice. Big problem may be the location - Circular Quay area is very touristy & the hotel is well out of the way of things tucked under the Harbour Bridge. We live in HK but are from New York & it felt like we were staying at the South Street Seaport - which, if you aren't familiar, is just a major no-no (think mimes, break dancing exhibitions, deranged seagull attacks & screaming teen tour groups). Because it is so out of the way, you need to trudge through that street performing & other nonsense for at least 10 minutes to get into the CBD & find anything resembling real city life going on. By taxi, the winding route to The Rocks will cost you an extra AU$ 5 to 7 & 5 -10 minutes for every ride to & from. To sum up, it's very clean & everyone treats you like a welcomed guest, but at these price points you probably want a little more, beginning with some style & a better, hipper location.", "Date": "July 8, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Pity the food didn't match the music and views”", "Author": "Tavare", "ReviewID": "UR69974177", "Content": "Like another reviewer I went to the Park Hyatt on a Saturday night to enjoy the music in the bar and the wonderful views. The Sydney Opera House was being used as a light show, so we had a feast of attractions to make it (potentially) a memorable evening. The jazz music was very good - they were quite well-known Sydney musos - but unfortunately the very ordinary bar food, high prices and ordinary service didn't match the music or the light show. My wife's bloody mary was undrinkable, and while they tried to \"repair\" it, no one seemed perturbed that it was left untouched. The wine list was - not surprisingly - on the expensive side, which fails to take into account that wine (Aussie and overseas) is at historically low prices. In the end it was a good night that could have been much better. No other hotel in Sydney has such a prime location, but you can't just wrest on your laurels and assume that's all you need do. By the way, does anyone know other places in the city which have similar lounge bars with live jazz where you can actually talk without shouting?", "Date": "July 6, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "3", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“extremely disappointing”", "Author": "sherlockholmes93", "ReviewID": "UR69511006", "Content": "We ate in the bar on a Saturday evening. The menu was pretty unexciting. The kids ordered macaroni cheese & a pizza. The macaroni cheeese was awful - congealed tasteless and unappealing. The pizza was pretty uninspiring and burnt at the edges. The vegetables didn't arrive until we were half way through the main course. We refused to pay for the kids meals. The complaint was handled well but all we wanted was a decent meal without the hassle of having to complain. We defintely would not go back & wouldn't recoomend it. There are far better places.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "farnham", "Title": "“POTENTIALLY BRILLIANT”", "Author": "D50", "ReviewID": "UR68003224", "Content": "I have stayed twice at this Hotel in the past five years. First time around it was just superb - in many ways jaw-dropping; fabulous location, magnificent rooms, wonderfully efficient, discreet and thoughtful service, good food...all was wonderful, fully justifying the top-notch price. Second time around the price seemed to have accelerated fantastically, while the Hotel itself had regressed in several significant ways. We sensed resting on hard-won laurels, an assumption of being \"The best in Town\" without any longer exercising the painstaking attention to detail which would first win, and then retain, such an assessment. Superbly furnished, very well equipped and comfortable rooms still prevailed - customer service had fallen off considerably - and it showed. When key swipe cards failed to work we were told \"You must've done something wrong\" . In an allegedly world-class 5-star Hotel a default mode that the customer has it wrong might justifiably be judged...inadvisable. We thought standard of food and cafeteria - not restaurant - service had also declined. Feeling after previous wonderful experience of this Hotel was of disappointed regret. Giving them the benefit of the doubt, these things can be cyclical, and every staff member can have an off day...or weekend. Our impression, however, was of a general malaise, general decline. Advise is to expect the very best, but be braced for another \"off day\". Rooms and location should not disappoint, however. In essence, a great Hotel...offering standards that, in our experience, have great pitential, not consistently fulfilled.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“top view”", "Author": "luzy_2002", "ReviewID": "UR67971514", "Content": "Top end Room with view onto the opera house and harbour bridge. Great atmosphere and lovely service. Best location in town with exclusive views. Hard to find on street parking. Great restaurant in hotel. Short walk to the most important sightseeing spots in town. Very good hotel to spend a romantic weekend or even a short business trip.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Stay here - you won't want to go home!”", "Author": "EmmaL1604", "ReviewID": "UR66581859", "Content": "Just returned home from my first stay at the Park Hyatt Sydney and I hope it won't be the last. We stayed 2 nights and I didn't want to leave. A beautiful room...a beautiful view....stay here and you will not be dissappointed.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“No words to describe it ....... the best for me ...”", "Author": "shahrin_haron", "ReviewID": "UR66418975", "Content": "I don't know where and how to start my review ... i've been staying with hyatt since my first hyatt in dubai 3 years ago ... This is so far the best hotel in term of everythng .. from services, location and all of it .. It started even before my first day .. Hyatt sydney was very kind to pick up us from nearby hotel and we were greated nicely .. I will always remember Mr Nicholas from from desk which I believe did his very best to ensure me and my family get the best .. yes .. the view from room 308 is speechless ...also not to forget the guys from the concierge which always there to assist day and night ... is like coming back home ... warm, cozy and always feel welome ..nothing in my previous stay in different hotels throughtout the world .. come close to his Hyatt Sydney .. my wife love this place very very much ... i believe no other hotel in sydney can come close to park hyatt ..(oh ya ..we spent 3 weeks in sydney .. and stayed at four seasons and hilton sydney as well .. but Park Hyatt is far far away from them .. especially hilton sydney ** read my review there** ) i will come again and again for sure ...", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great position, excellent service.”", "Author": "MinnieD45", "ReviewID": "UR65457693", "Content": "This was undoubtedly the most professionally run hotel I stayed at in Australia. Although the other hotels claimed to be 4* and 5* this was the one of two that lived up to its 5* rating. The staff were properly trained and there were plenty of them, hardly any seemed to be Australian to judge by their accents ( Eastern European, Far Eastern?) perhaps they knew the difference between laid back and poor service. The position is superb, right on the water front and close to all facilities and transport links. Because it is close to the bridge the traffic can be heard from the balcony but the double double-glazing cuts out all noise.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Finland", "Title": "“Best location in Sydney”", "Author": "Suomessa", "ReviewID": "UR65035035", "Content": "Certainly, for anyone unfamiliar with Sydney, the location of the hotel is as good as it gets in Australia. It is lovely to spill out of the hotel and be surrounded by icons like the Opera House, Circular Quay and the Harbour Bridge. The hotel itself ticks all the boxes and then some. The rooms are stylish without being pretentious and the service was always very timely and discrete. It was quite expensive but there is nowhere I would rather stay in Sydney. I wish I could have slowed down time. The only negative was the pool, which is small and accessible via a steep, shallow staircase, which seemed (and was) quite dangerous. It is unlikely that the designers had a pool scene in mind when drawing up the plans and it has a last-minute, tick-the-box feel to it. Still, the clientele aren't backpackers so perhaps it doesn't matter too much.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Dream Come True”", "Author": "spud2010", "ReviewID": "UR63371596", "Content": "My husband and i stayed here on our wedding night back in march. apart from the wedding i was very excited for our stay here as it is well known as the best hotel in sydney. we arrived at the hotel after our location photos with our wedding party and before our reception to freshen up with our bridal party. My husband went to check us in and i noticed it was taking quite some time to do so, so i went over to make sure it was all ok. i should not have worried as when i got over there i was told we had been upgrade to the highest suite in the hotel... i nearly fell off my chair. the staff were amazing, they were all very friendly and efficent... our bags and my wedding dress bags were all hanging in the closet when we arrived back at our room at 1am along with champagne and strawberries and choccies, and room service we ordered at 2am arrived very quickly.. thank goodness as i had not eaten al day. the next morning we were served breakfast at our dining room table which was amazing. the rooms were very very clean and the bathroom spa was gorgeous. It was the icing on the cake for our wedding and i will most definatley be going back in years to come... thankyou to all the staff for making our night so special", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Extreme luxury and great location”", "Author": "Thierrydsmt", "ReviewID": "UR63268489", "Content": "Very large, luxurious room and bathroom; very impressive service; best location by far in all of Sydney; great bar. Better than the Four Seasons or the Observatory Hotel. Like many modern hotels, lacks some soul.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great hotel,just don't use the phone!”", "Author": "Eatenwell", "ReviewID": "UR61789676", "Content": "We had a fabulous Premier suite and it was so quiet. We left for a couple of days and they only had a Opera Deluxe room on our return, that was not so quiet, but had a stunning view. Everything was great until I got the final bill, they had charged me $150 for 7 phone calls, never lasting more than a few minutes, to my friends' Sydney cell phone number! I was shocked, especially since I checked the hotel book, local calls it said were $1.25. Be warned of this old hotel trick of charging you unreasonable prices for phone calls.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“The ONLY place to stay in Sydney”", "Author": "AirMilesLuvr", "ReviewID": "UR61215559", "Content": "This was an important trip for us & we spent weeks researching our Sydney property so afraid we'd pick the wrong hotel. Not only we were shocked at what a great choice we'd made, we could not imagine anyone being able to say anything negative about this hotel. Note that we began our Australian holiday in Sydney, went to other cities (whose hotels I will also review) & returned for 1 night to Sydney for our early morning departure back to the U.S. the following day. In an effort to \"try something new\" we made the mistake of staying at The Establishment (see my review) instead of the Park Hyatt. I urge you to learn from my mistake! LOCATION: Nestled almost under the Harbor Bridge, on the Harbor & directly across from the Opera House, its location cannot be beat. We awoke to the most amazing sunrises over the Opera House & drifted to sleep to the same view each night. SERVICE: Everyone was attentive, accommodating, incredibly nice & most professional. David (Dave?) at the Concierge was most notable. Arranging for the hotel's free bicycles for us, dinner reservations, a Harbor Bridge climb, Symphony tickets, etc. During our bike ride, we decided to check out the Four Seasons (one of the other properties we'd considered). Wow. The most dated & depressing looking hotel - cannot believe it's a Four Seasons!", "Date": "April 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great hotel in great location. Room not ready.”", "Author": "bigdave764", "ReviewID": "UR60895575", "Content": "I have stayed in a wide range of hotels through work and the Park Hyatt Sydney has a fantastic location and is a very pleasant overall experience. The rooms are large, the bed comfortable and the view from the rooms are the best in Sydney. The Rocks is also a great part of Sydney to stroll around, with some great bars and restaurants. My wife and I stayed at the hotel for one night in March 2010 and the only thing which was well below expectations was the availability of our room on check-in. Normal check-in is quoted as 2pm and I requested early check-in on our reservation. Despite this (and the Hyatt claim of 'expedited check-in' for Platinum members), our room wasn't available until 4.45pm and we both felt that the receptionist had a slight tone of false sincerity when dealing with us. I felt this was pretty poor for a top-end hotel - we ended up having to rush to get ready to go out for a function (we had a taxi booked for 5.30pm), when we were expecting a relaxed afternoon in our room. After a polite written complaint to the Manager, I got a letter back saying sorry and promising to give us special treatment on future reservations, but it doesn't really fix the past in my view. Nevertheless, I hope this was an isolated incident because I generally find Hyatt hotels are pretty good.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Fantastic location, service, rooms, view, I could go on and on”", "Author": "travel_ann_NY", "ReviewID": "UR60474035", "Content": "This place is pretty perfect. The staff is fantastic, rooms are clean and the views are amazing of the opera house. Most comfortable bed I've ever slept in, huge bathroom with great tub. The nearby Renaissance Patisserie is fantastic. Ate at Tetsuya's also but I would not go back; not worth the hype for that price.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The more I stayed at this hotel, the more I liked it.”", "Author": "Appreci8life", "ReviewID": "UR58847025", "Content": "This is a tough one to review. On one hand the hotel is fantastic and on the other hand I think it is really overpriced. I want to be fair to the hotel and at the same time I am thinking of the traveller coming to stay here and spending a fortune and then discovering for the price, it is not actually that great value. So if money is no object, then this is the place for you. Otherwise, spending the asking price and expecting something out of this world, then you may be a little dissapointed. Everything about this hotel was very professional. The valet parking was a breeze and the check in was as others already mentioned very, very professional and courteous. We were invited to sit down at a desk during the check in and that was a very pleasant first impression. Once check in was completed, the same receptionist who checked us in took us all the way to the room and she showed us how to operate the curtains (there is a remote control for closing and opening the curtains), and she also gave usa mini tour of the room (showed us where the aircon was located, the minibar, about the spa, etc,etc). Our only dissapointment was when she told us the outdoor pool was closing at sunset and of course we arrived after the sunset. Nevertheless we went to the pool the following morning and we were once again pleasantly impressed to see the place was clean and the pool was heated and you could just walk straight into it. There were also plenty of towels by the pool. The room was nice with a nice bath and lots of shampoos, and bath salts and bath robes and slippers. There were some minor stains on one of the leather couches and you could tell the housekeeping tried to rub them off unsuccessfully. Me mentioning this may seem a little pitiful but I am only mentioning this for those who may choose to spend the extra money expecting everything to be absolutely impecable. It's not impecable but it's probably as close to impecable as you can get. A few other nice touches were the complimentary fruit bowl, the two complimentary bottles of water on the bed side tables, and the free drinks voucher. Also the welcoming hand written note from the manager was a nice touch as well. The food in the restaurant was nice and not too over priced. Oh yeah, our room (125) did not have a full view of the Sydney Opera House. You can only see it from the balcony but not from inside the room, which leads me to believe not all rooms have a view of the Sydney Opera House but all balconies do. The staff was very polite and very accomodating and they extended our checkout time past their normal check out time without any problems at all. Checkout was also a breeze and there was another separate desk dedicated to the checkout. Arghhh... I forgot the girls name at the checkout (I remember she was from Brazil) but she was very, very professional, very helpful and very courteous. And one other thing I forgot to mention which was really nice was you could use the internet totally free for 30minutes in their business centre.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Perfection.”", "Author": "midway42", "ReviewID": "UR58269156", "Content": "Check-in: As expected at a hotel of this caliber, I was met at the door by an attendant within seconds of leaving my taxi. Registration is a personalized affair similar to Park Hyatt Tokyo, completed while sitting in front of a receptionist behind a desk. Everyone I initially encountered was very obliging and friendly. Accommodations: I stayed five nights in a king â€œOpera House viewâ€� room. Like all Park Hyatt properties, the rooms are sparsely decorated but immaculate. The bathroom was very spacious with both a stand-up shower and separate large bath tub. A light bulb was out above the mirror (no big deal, it happens) and a simple phone call corrected this in minutes. The walk-in closet was more than adequate for the needs of a single traveler and the bed was perfect. I would have preferred some outdoor lighting on the balcony but Iâ€™m being picky here to be sure, overall the room was excellent. The pool and spa are a bit small, but itâ€™s a smaller hotel so this makes sense. Dining: I ate 3-4 times in the Harbor Kitchen and Bar/Little Kitchen. Although they are advertised separately on the website they are essentially served by the same kitchen just on different sides of the same room, one being more formal (Kitchen & Bar) and the other less so (Little Kitchen). Food was excellent and had service to match. I decided to try the afternoon tea (which usually requires 24-hour reservations), was seated the same day, and enjoyed the experience at a window seat. Room service was also five-star quality. Location: Canâ€™t be beat, to be honest. Youâ€™re staying under one of the worldâ€™s most iconic structures (Harbor Bridge) while overlooking another (Opera House). The ferries and tram system are a 5-10 minute walk away, as is the Rocks neighborhood with all of its shops and restaurants. Campbellâ€™s storehouses are within sight of the harbor entrance and house a number of varying restaurants. Service: So itâ€™s 4:30 in the morning the day my flight leaves and I decide to check my flight time on the business centerâ€™s complimentary computers before leaving for a run around Hyde Park. My key card did not allow access in the center (one of the few missteps of my five day stay) but one of the staff noticed me struggling with this and because he recognized me from earlier in the week (itself an impressive feat) ushered me into the center and apologized for the inconvenience. â€œIs there anything else I can do for you sir?â€� This level of attention to detail was seen consistently through my time at the hotel. Cost: Itâ€™s still difficult for me to rationalize how much these â€œexperiencesâ€� cost, but keep in mind the following: you are staying in one of the most expensive, international cities in the world that functions as a gateway to a very desirable country/continent for even casual travelers and the hotel overlooks an iconic World Heritage Site (see picture taken from my balcony). Itâ€™s not cheap. Summary: Along with the Hotel Adlon in Berlin, Park Hyatt Tokyo, and Raffles Singapore I think this hotel ranks right up there with one of the worlds best for an overall experience. I look forward to making another visit in the years to come.", "Date": "March 10, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pacific Beach, California", "Title": "“Great location”", "Author": "prospect316", "ReviewID": "UR57402511", "Content": "situated directly across from the beautiful Sydney Opera house and outside the hotel is the ship where \"Bounty\" starring Mel Gibson. Many nice scenic restuarants available.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Great hotel with iconic view”", "Author": "Tim S", "ReviewID": "UR56768284", "Content": "We spent three nights at the Park Hyatt as part of a five week round the world tour. The torrential rain which greeted us and llasted for two days did not detract from the enjoyment of our stay and we made good use of the nearby harbour ferries to visit friends at Greenwich and Manly. We dined in the restaurant for the first night and for the next two days for breakfast which was very good. There is a great charade about getting a window table which have the best views but by negotiation we managed to progress over two days from the inferior rear row of tables through the middle row then to the front row. When we asked on the second day if we could take one of the front row tables which were empty we were told these were reserved. We asked if we could reserve one of the front row tables for the following day, only to be told that they don't take reservations! After a few minutes we were then told that one of the empty front row tables had beome vacant so we eventually got what we wanted. This hotel is expensive and we booked one of the more expensive full Opera House view rooms which was on the third (top) floor. Watching one of the large cruise liners depart majestically to the sound of music from our balcony was majical and there is so much activity in the harbour. All in all, a great hotel with excellent service, but you do have to work to get front row seats in the dining room.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“The finest service I have ever experienced”", "Author": "timbonit", "ReviewID": "UR55969582", "Content": "Do yourself a favour and treat yourself to this hotel. The service was like I have never ever experienced before. The head Conciegre, Cameron, Is an amazing person, nothing was too difficult. Fantastic Hotel - Fantasic Location", "Date": "February 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "california", "Title": "“A Great Hotel Makes You Comfortable”", "Author": "PetermanCalifornia", "ReviewID": "UR55525629", "Content": "As repeat holiday visitors to Sydney, all we really wanted to do was relax in the room and possibly stir for dinner. It rained the entire 3 days we stayed here and even so, we couldn't have been happier! A view of the Opera House and the boats in the harbour; dark, silent broad hallways; understated and perfectly intuitive service. Just outstanding. See you next year.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“The Sydney Park Hyatt has the most refined, unpretentious 5-star service possible.”", "Author": "5starTravelnut", "ReviewID": "UR55415989", "Content": "My husband & I started our 3 week Australia itinerary with a 3 night stay in an opera room at the Sydney Park Hyatt. We arrived 7 hrs. late because a huge dust storm caused havoc with our flight from Los Angeles, but check-in was very fast & attentive. Little coupons we had for complimentary refreshments were redeemed, plus welcome champagne & chocolate-covered strawberries from our travel agent were already in our room when we entered. It's as if the staff quickly assessed our travel weariness & got us settled without fuss. Despite our 40 hour travel ordeal, we revived is less than a half hour. The room was wonderful--very, very clean, airy, comfortable, nice bed, perfect linens--everything you would expect of a 5-star property. Of course, the incomparable view of the Opera House from the balcony made us forget our fatigue & we began to enjoy our holiday from the very first moment. Despite our speedy check-in, we had very little time to get to our reserved Bridge Climb & the concierge assisted us most ably. We loved the concierge here as they helped us also with our day trip to the Blue Mountains as well as with little & big recommendations throughout our stay. They seemed to pick up on our interests & preferences very quickly. They also never failed to ask us how our plans went--it made our stay very warm & personable. We only ate breakfast at the hotel, but it was wonderful. I had stayed here once before in 2004 & breakfast was abysmal at that time. Now it was good & with a better entrance to the dining room. Service & check-in has improved since 2004 as well. We can't imagine how anything could have been better.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Oustanding World Class Hotel”", "Author": "travel_ocean", "ReviewID": "UR54969754", "Content": "The Park Hyatt Sydney rates among the best hotels I've experienced (Peninsula Hong Kong, Claridge's London, George V Paris etc.). The most gorgeous location in Sydney, outstanding service, immaculate and comfortable rooms, excellent restaurant and bar. Sparking and near perfect bathrooms, beautiful linens, unobtrusive room make-up and turn down, speedy room service and requests for transportation arrangements etc. were handled timely and accurately. We stayed at the hotel over Australia Day and the information from the staff about the festivities around the harbor and elsewhere around the city was wonderful and made us feel Australian for the day! Kudos to a world class hotel.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "sydney", "Title": "“Spectacular”", "Author": "sydneywebshopper", "ReviewID": "UR54647333", "Content": "We stayed in the Opera room with a direct view of the Opera House; room was spacious and the bathroom to die for. We also held our wedding ceremony & reception on the rooftop terrace - staff are extremely professional, courteous and efficient. The service is excellent on all fronts, highly recommended and one of our favourite high end hotels.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris / France", "Title": "“The Best Hotel in Sydney *****”", "Author": "amadeaus", "ReviewID": "UR54078825", "Content": "You could not get a better location than your bedroom, meters above the blue Pacific harbour and right opposite the spectacular Opera House. You can walk 'round the quays, take a boat anywhere and you are downtown. The rooms are stunning. Each like a small suite large TV, DVD, in room bar. Breakfast in your room with the sliding doors open with a view like that is just wonderful.Ther is a huge marble bathroom, very large shower and bath, huge towels. Large floor to ceiling windows give you a magnificent view of the harbour and as the hotel is built on historic land, it is only allowed to be three floors high. There is a pool on the top floor. You lie there in the sun sipping a cocktail looking at a view that is stunning. The staff are young and very attentive with a typical Aussi informality. Their restaurant is one of the finest in Sydney. We have stayed there six times now & we live in Paris.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "sydney", "Title": "“Great view, spacious room with excellent service”", "Author": "ren200sydney", "ReviewID": "UR54066766", "Content": "My daughter and I stayed in a Opera deluxe room. We used the room to get ready for my daughter's wedding the next day. It was a lovely large room with a limpressive bathroom,separate toilet and 2 balconies ( although the balconies are quite narrow.). The staff were very helpful with all of our requests including allowing our makeup artist to park her car while she was there. The room was expensive but I feel it was money well spent - I would definitely stay there again for another special occasion. We were on the second floor - not sure if I would like the first floor as much as there is a park and boardwalk out the front which can get quite busy with wedding ceremonies, joggers, tourists etc.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Palo Alto, CA", "Title": "“Best view in Australia, but overrated service”", "Author": "JonnyHei", "ReviewID": "UR53734614", "Content": "My wife and I arrived at the Park Hyatt to stay for 5 nights. Our room wasn't ready upon arrival (20-30 min) and we were invited to the bar for a complimentary drink. After an hour the room still wasn't ready. 2 hours later, we were comfortably situated in our room. However, the next day the TV wouldn't work! We were promised a fruit plate -- nice -- but it never arrived. Other than this sub-par service, the hotel is above average. We selected a king Opera View room and basically fell asleep and awoke with a 180 degree view of the Opera House, quay and wharf. The Hyatt thoughtfully installed double doors on their balconies which cancel out any outside noise. Food and room service at the hotel were stellar, but expensive. The concierges arranged several dining reservations for us which were A+ experiences. Overall, the hotel was enjoyable but not worth the $700+ per night charge for the rooms.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san francisco", "Title": "“Great View and Service”", "Author": "4familySanFrancisco", "ReviewID": "UR52984313", "Content": "We spent a week at the Park Hyatt Sydney from just before Christmas to almost New Years. This hotel should really be in a category by itself because of the unique location in the rocks and exceptional service. Yes it's expensive as other reviews have noted. But this hotel delivers for the money. It's worth staying a shorter time to stay at this property. We returned after an almost 8 year absence wondering if the hotel would be able to match our memories from before and it did. As other reviews have noted, it's well worth paying the extra money for an opera deluxe room open floor plan suite (750 sq ft) as the view and space are magical. The beds are ultra comfortable, the bathroom will match the best bathroom anywhere and the living and work space are well thought out. You feel like you can reach out and touch the boats on the harbor from the rooms. This is one of the few modern five star hotels left that operates in the traditional customer service of years past. We were greeted by the very capable Leigh Shepheard at check in and we found all of the departments to be excellent including the bell desk (Shawno) reception (Renato) room service (too many great people to list) etc.. When you phone for anything, housekeeping, bell desk, room service, etc the staff reacts quickly and tries to over anticipate needs. Our average wait for room service was less than 20 minutes, even on Christmas Day. It reminded my husband and me of visits to Claridges in London where they must somehow keep a list of requests from visitors. The hotel staff will even do completely unexpected touches as when my son somehow misplaced a stuffed animal given to him for Christmas - Hans arranged to surprise him with a special \"park hyatt bear\" etc.. The hotel gave us lovely home made delicious cookies for Christmas Day and boxing day etc... The Park Hyatt Sydney does not nickel and dime guests like so many hotels. Guests may use the fast four computers in the business center without a charge. They don't charge an extra service charge for room service delivery and don't force gratuity or tips ever. It's a standard two full housekeeping services a day as well as bottled water by the bedside, ice bucket filled - even champagne, water, and wine glasses changed daily. It's a very luxurious feeling to be a guest in the hotel. The hotel is small and well sound proofed. We never heard other guests or outside noise even though the hotel is located on a very busy and noisy part of the city. My family disagrees with some of the recent trip advisor reviews of the food and/or ambience in the hotel. We ate two of three meals daily using room service, the harbourkitchen and the harbourbar (serves a lighter menu) and found the food and service to be consistently superb. In fact we had friends from Sydney dine with us on several occasions and all felt that the harbourkitchen was a secret find. It's a fabulous place to be at night but still welcoming to families. They offer a discounted lunch on weekdays that includes a glass of wine and valet parking for $39. Given how expensive Sydney's main restaurants are right now for Americans we found this to be a terrific bargain and an easy way for our friends to visit us. The harbourkitchen has modern doors that lift to the ceiling so most days you are literally on the harbor. Even if you aren't staying at the hotel it's worth a visit to eat or have a drink. We also disagree with some of the comments about the health club, pool, and spa. This is a small hotel so we wouldn't expect a large gym. The gym had a variety of exercise equipment including a complete set free weights, bars, and balls with a lovely view of the harbor. It's identical to the gym at the Ritz Carlton on Central Park and appropriate for this size hotel. Very few hotels in Sydney have a pool yet alone one that is outdoors. We did try a service at the spa and found it to be lovely. Another secret of this hotel is that it houses one of the best concierge teams worldwide. We found the concierge to be very useful organizing a decorated Christmas tree in our room, water taxis, car service, appropriate restaurants to take our kindergarten age son, a pirate ship dinner on the harbor, to helping us figure out the right shows and seats at the Opera House, etc... On several occasions we phoned them last minute from a day trip for help with directions, ferry times, New Year's eve venues or reservations. One night (boxing day) they were able to help us secure a coveted reservation dining literally on the sand at Le Kiosk on Shelley Beach in Manly when we spontaneously jumped on a Ferry. Chris, who manages the concierge team, had emailed us restaurant and dining lists prior to our trip and we found all of the recommendations to be on point for our family. We loved our visit to Sydney so much that we ended up staying over New Year's Eve to watch the fireworks from the Opera House party. Because the Park Hyatt was fully booked (New Year's is booked often a year or two in advance) we had to move to another hotel. The entire time we kept wishing that we were still at the Park Hyatt. Really - nothing else in Sydney compares to this property. There are lovely business hotels that have harbor views that are less money, but they aren't the same. A stay in an Opera View Deluxe Room at this hotel should be on everyone's bucket list.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "brussels", "Title": "“great location”", "Author": "idlBrussels", "ReviewID": "UR52829174", "Content": "we stayed for 6 nights with the whole family (4 kids age 10,14,16,17) in 1 opera Deluxe and 2 standard rooms. it is worth going for the Opera Deluxe rooms , what a view! Standard rooms where very dark. the best thing for us was to have a balcony and be able to have windows open en no need for airco. excellent service from reception to concierge and restaurant. we spent Newyears eve at the hotel restaurant second seating. quite expensive for nothing really special. good and flexible service. we appreciated the strawberries and champagne in the room. swimmingpool area is way to small for such a hotel (spa did not appeal at all going there). breakfast was included : buffet was very poor and boring for such a high standard hotel. every day the same, very long to replace empty trays this really needs improvement . this was the poorest buffet from our 3 weeks in different hotels in Australia.", "Date": "January 7, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Fifteen to Sydney and Auckland”", "Author": "ruspotee", "ReviewID": "UR52772381", "Content": "The Park Hyatt is an excellent hotel. Included in the amenities are double sliding doors to block out sounds, double remote-controlled drapes to block out light, and an LED pathway from the bed to the bathroom. And an incomparable view of the harbor and Opera House.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Unbeatable location, great service”", "Author": "BelgiumFogg", "ReviewID": "UR52591146", "Content": "In a recent first trip to Sydney, we had stayed at the Shangri-La which is very good but the Park Hyatt has some nice extras that make it the best in town. Location is definitely one of the best in town and the service is wonderful, very accomodating to every single need and detail. Our room was not ready at the time they had indicated so they invited us to drinks at their opera-looking bar. if you can treat yourself to an opera-looking room in the third floor, go for it!!!! It is wonderful to wake up and see the opera so close. We had dinner at the hotel restaurant, great view and great food. One minor detail: people going from reception to the bar or viceversa tend to walk through the whole restaurant which is a bit disurbing to those having a meal; there is an alternative way but not well indicated.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Staff”", "Author": "TandNLosAngeles", "ReviewID": "UR52187481", "Content": "Just got back from Sydney. Only stayed one night in the Hyatt, but glad we did. We arrived early and Shawn, the front desk manager was great. Easy check in and took us strait to our room. I used the spa to get cleaned up after a long flight from the states. The spa area itself is nice, but way to small. Need to knock out a few more walls, just to make it comfortable. Like everyone else says, views were the best, close to a lot of places to eat. The best thing about the Hyatt was the Staff. All very friendly and helpful. Although, I am a diamond member at Hyatt, it was obvious to tell they treated everyone very well. Other than the coin you will be dropping at this place, you will be very pleased with this hotel, and I would highly recommend it.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Fantastic”", "Author": "Grigs", "ReviewID": "UR51953644", "Content": "What a beautiful hotel. Location is fantastic - looking out over the harbour and the opera house and watching the ferry boats go by. All the rooms have great views. The harbour bridge arches above you. Easy to walk to the quay and lots of restaurants around. We ate in the hotel and wouldnt recommend it - food was ok but ambience wasnt good - we should have gone out. Service was excellent - rooms very comfortable and large. Lovely place to stay - would stay again without hesitation", "Date": "December 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oundle, UK", "Title": "“Just the best location possible in Sydney”", "Author": "janetatt", "ReviewID": "UR51516207", "Content": "We finished our tour of Australia with four nights at the Park Hyatt, and what a way to finish. Painless check in, as our driver had phoned ahead to say we were on our way, and stunning room with fantastic views of Opera House and harbour (and the bridge if you lent out !) from our double balcony. The room was spacious and comfortable. The staff were very helpful, and the breakfast fantastic, with lovely views over the harbour and opera house. The location was perfect for exploring Sydney, and wonderful for a an early morning run around the harbour to Mrs. McQuarrie's Seat. Expensive - but we thought it was worth it.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, great service”", "Author": "Adventura1405", "ReviewID": "UR51382505", "Content": "REVIEW: We arrived at Sydney airport at 7am after a 24 hour flight from the UK. We were met by the hotel's friendly driver (pick-up by luxury limo is an optional extra) and with minimal fuss were on our way to the Park Hyatt Hotel . The driver called ahead, so that when we arrived at the hotel we were greeted by name, taken through the speedy check-in process and shown to our room (where our luggage was already waiting) by a friendly receptionist. And yes, our room really was available at 8am! We booked a Opera Delux King but it was worth every cent. For AUD 1115 per night (including breakfast) you get plan studio suites with stylish uncluttered surrounding including a living room, bar and work area. Floor-to-ceiling sliding glass doors open out onto two private balconies overlooking Sydney Harbour and the Opera House. There is a separate bathroom and walk-in wardrobe. The two sets of curtains (voils and blackout) at the windows are operated by remote control, so you can lie in bed and watch the sun rise. Magnificent. There are so many other restaurants around the historic Rock district where the hotel is located that we tended to eat out save for breakfast and a midnight feast in our room after the opera (the room service was great). The hotel staff were very friendly and anticipated every need. I happened to come back to the room while one of the team was refilling the mini bar. He asked me if I would like him to clear some space in the mini bar for our own bottles of champagne, and when I said yes that would be nice, we planned on having a bottle when we returned from the Bridge Climb later in the afternoon, he promptly arranged for an ice bucket and glasses to be waiting for us when we returned. Lovely. SUGGESTIONS FOR IMPROVEMENT: The rooms would benefit from the addition of a docking station for an ipod / iphone / MP3 player. OTHER: Just one thing to be aware of. The small hotel pool is located on the roof and suffers from the noise of the long term repainting work being done of Sydney Harbour Bridge. Not a major factor, just a minor irritation. THINGS TO DO: The Rocks and Central Quays (a short walk) Manley Beach (catch the public ferry from Central Quays) Bondi Beach (take a taxi) The parks and gardens (a short walk) Bridge Climb (highly recommended) A night at the Opera House (highly recommended) Woolamooloo (take a taxi) The bar at the Establishment (take a taxi) OUR COMPLETE ITINERARY: Sydney: Park Hyatt (H) Blue Mountains: Lilianfels (H) Blue Mountains: Trek with Life's an Adventure (O) Nelsons Bay : Amarana Beach Resort (A) Port Macquarie: Quality Inn HW Boutique (H) Coffs Harbour: Promised Land Cottages (A) Byron: Byron at Byron (H) Gold Coast: Palazzo Versace (H) Airlie Beach: The Peninsula (A) Whitsunday Islands: Coral Trekker (O) Hamilton Island: Qualia (H) Darwin: Sky City (H) Litchfield National Park: Adventure Tours (O) Kakadu National Park: Adventure Tours (O) Ayers Rock (Uluru) & The Olgars (Kata Tjuta) National Park: Longitude 131Â° (H) Perth: The Richardson (H) (H) = Hotel (A) = Apartment (O) = Other", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Perfect city escape!”", "Author": "Travelbugtoo", "ReviewID": "UR51131732", "Content": "We are from Sydney but decided to have two nights at this hotel to spoil ourselves! It was perfect! - from the moment we stepped out of our car to the time we had to , sadly, leave! All the staff were very professional and welcoming. The restaurants were great. Really fresh food and not fussy and 'overworked' Rooms are lovely. Views are spectacular. Perfect place to stay for tourists.... right on the harbour ! We will definitely be back", "Date": "December 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“great location, great hotel”", "Author": "voyageur Ã  paris", "ReviewID": "UR50586831", "Content": "After travelling 24 hours from Western Europe to Sydney, with a full day of meetings looming at you through the gloom of what will most certainly be a night of jetlagged half-slumber, you want an hotel that is laid back, comfortable, and spacious. The Hyatt is this place. Check-in is painless and the staff are courteous, discreet, and accommodating. The hotel is located in the Rocks quarter of Sydney, just below the Harbour Bridge, with a beautiful view to the CBD, the Opera House, and harbour suburbs. The rooms are exceptionally spacious, the beds comfortable, and the bathrooms large and equipped with a great tub and separate shower. I have stayed in this hotel on numerous occasions over the past 10 years. The property has aged well and the standards of service are, I think, amongst the best in Sydney. Breakfast is a real treat, with beautiful views of the harbour from every table. The buffet is a bit pricey (aren't they always), but you can order an excellent \"flat white\" and some Greek yogurt with berries and get away only A$ 20 lighter. There's a decent gym facility, and if you're a runner, all you need to do is put on the trainers and step out the door to be on a great footpath that will take you as far up the harbour as you want. There are also a number of good restaurants steps away on the waterfront, and the ferry terminal to other areas of interest on the harbour is a 5 minute walk.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dubai", "Title": "“Best Hotel in the world”", "Author": "Moodytraveller", "ReviewID": "UR49692600", "Content": "Have been to this hotel last year on business, and had to try it again with my family this time. Everything about the hotel is perfect especially the staff. The opera views are amazing. No other hotel in Sydney has such a view.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Amazing!”", "Author": "ESB2009", "ReviewID": "UR49517271", "Content": "We stayed here on our wedding night, and it was amazing! Our room was huge - as was the bathroom! The service was fantastic, and the late check in was very easy. Fantastic view and very clean room. Was very special to wake up, lay in bed, the blinds open electronically and look out over the water and the big cruise ship that was in tnhe harbour! Very special - very Sydney! Breakfast was great - forgot our order, but very apologetic, which made up for it. Fantastic splurge - highly recommended if you can do it!", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "vancouver", "Title": "“5 Star Indulgence”", "Author": "yfb", "ReviewID": "UR49209395", "Content": "A true five star experience with a five star view. As my taxi pulled up to the front door I was greeted warmly by three staff. One opened my door and guided me to my seat at the reception desk while the other two immediately retrieved my luggage from the trunk. I was also being promptly address my name as the porters checked my luggage name tags and began addressing me as such. The agent that checked me in immediately offered a late checkout, personally escorted me to my room, showed me the amenities and ensured that I was happy with the view. The agent also mentioned that if I might wish to take a night cap the bar downstairs was open late. I might have given this a skip but the hotel guide mentioned their well stocked scotch selection. I spent several minutes making my selections from a very thorough list. The bar man was friendly, very knowledgeable, and exceptionally professional. I enjoyed an exceptionally comfortable night as I drifted off to sleep in my huge bed gazing out across to the opera house. The next morning I had one of the better eggs benedicts I had in years as I sat out on my patio reading my newspapers. One negative of this property is the extra charge for in room internet. this seams to be a standard charge in Australia but it feels tacky at this hotel.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Has to be one of my worldwide favourites.”", "Author": "Getabreak", "ReviewID": "UR49185725", "Content": "This was actually my fourth time at Hyatt on the Rocks which makes business trips from UK to Sysney wothwhile despite the distance! Location is simply fantastic with perfect views, easy strolls and great food. Never feel lonely with all the sights and sounds and breakfast with this view is hugely memorable. On expenses, I wouldn't stay any where else in Sydney!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leeds England", "Title": "“Amazing views, amazing hospitality!!”", "Author": "FanAticAl1", "ReviewID": "UR49141394", "Content": "Staying at the Park Hyatt was totally pure indulgence! The views from our room are what I dreamt of as a kid, the Opera house view was amazing. The best 5 star hotel I have stayed at, great staff, great service, and amazing food. Ideally located for Circular Quay for the ferry to Manly and the train into the City. Will defintlatey stay there again.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Pay the Extra”", "Author": "Shaun52", "ReviewID": "UR48478408", "Content": "A hotel that is well worth paying the extra for. The location is stunning with views across the harbour to the Opera House, and the Harbour Bridge. Rooms are a good size, with TV, mini bar, shower and balcony. With a short walk to South Quay and the ferries to attractions on the city. The breakfast is great and I advise you to try to the Ocean Trout ! Staff are great too and always happy to help and answer any questions. Well worth paying the extra over the Shangri La anyday.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "bromley kent IK", "Title": "“Exceptional location”", "Author": "anne9837", "ReviewID": "UR47842486", "Content": "Yes it is expensive but the location more than made up for it - the view was stunning i.e. looking on to the Opera House; good for visitinig the Rocks markets and fir dining out as well as taking the ferries.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Utah", "Title": "“Superb Location, Elegant Rooms and Excellent Service”", "Author": "vavoomvsc", "ReviewID": "UR42208585", "Content": "We were greeted by Ryan who gave us our room keys and walked us to our room. He showed us the features of the room and answered all the questions we had. (Thank you Ryan!) Park Hyatt has the best location in the Circular Quay area by far! We stayed in room 333 which gave us a great view of the Sydney Opera House and the City at the same time. Rooms are very quiet and the bed is a comfortable one. We only stayed one night but it was worthwhile and I recommend everyone spend at least one night here if you can make it happen. The Park Hyatt is definitely a 5 star hotel.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "indian wells", "Title": "“Couldn't be happier!”", "Author": "scana22964", "ReviewID": "UR41053106", "Content": "We have been on a round the world trip. Been on the road for almost 8 weeks and we are my husband and I are really discriminating, as we are in the resort/hospitality business in California. We have stayed in what are reputed to be the best hotels in the world on this trip and will, at some point, write reviews on all the hotels (i.e.Al Qasr, Dubai, Intercontinental Hong Kong, Mandarin Oriental, Bangkok ) . We are just about to pack our bags, having spent 5 great nights in what has to be one of the greatest locations of any city hotel imaginable. Sydney is not a 'cheap' city, but if you want to do it right then stay at Park Hyatt. Best location, the most wonderful staff. They are attentive, without being in your face. Our room had view of both bridge and opera house. Incredible! The concierge service was fantastic and George in informal restaurant and bar was one of the best maitre d's we encountered on our trip. Food was wonderful and everyone was so helpful. Shane, the bar tender gave us the best tips for sight seeing. Just an all round wonderful experience. Honestly can't find a fault. Our room was immaculately kept and cannot wait to come back. Loved Sydney and The Rocks is the most wonderful spot.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“It cost a bomb but the view was priceless”", "Author": "glumball", "ReviewID": "UR39797811", "Content": "Where does one go to celebrate a special occasion in Sydney? Which hotel has the best view in Sydney? The Park Hyatt in Sydney has an unrivalled view of the Opera House, Circular Quay and The Harbour Bridge so that was where we headed to celebrate a special birthday. The checkin was smooth, the room was modern and had all the amenities one could wish for and the view from the huge super king sized bed was super spectacular. This hotel afforded us an opprotunity to play at being tourists in our own city and what a beautiful town it is. After we checked in and examined our room we walked out of the hotel for a stroll around the Harbour's edge. To warm up after our walk we stopped by the hotel coffee shop for a coffee that was served hot and with some nice bikkies before retiring to that Opera View room that had cost us so much. Sitting on the balcony drinking a bottle of French champagne (brought from home) and watching the sun set over the Opera House as Sydney ferries popped in and out of their moorings at Circular Quay was a magical experience. As the room was so well equipped we stayed in for a room service dinner and watched a couple of DVDs we brought from home on the inroom DVD player and flatscreen TV. The dinner was warm well presented and delicious. During our stay we took advantage on a couple occasions of the deep tub in the marble bathroom; the towels were large and fluffy and the bathroom lotions and potions agreeable. When we announced on checkout thast we were attending a family lunch at the nearby Doyles restaurant at The Quay the staff had no hesitation in offering us complimentary parking for the rest of the day. The service, amenities and location of this hotel were excellent ... and so they should be for the price. We may never stay here again but would recommend it unreservedly to others for a special occasion.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“If you're tacky you might not like this place.”", "Author": "penalba", "ReviewID": "UR38078610", "Content": "We stayed here for only a night, using points rather than paying. I'm not sure any hotel is worth what this place charges, but it is certainly a lovely, top-of-the-line hotel in an ideal location. According to our very impressed taxi driver, it's the best hotel in town. Our room was beautiful, big and elegant but not over the top. Great views. It's not a marble-and-mirror palace; they've got Eames lounge chairs in the lobby. Classy, ya know? I read some of the other reviews of this place and I want to point out one thing: the staff here is great. Very friendly, not haughty or obsequious, but kind and attentive. The concierge found us a nice restaurant (Aqua, highly recommended) that was even sort of kid-friendly. We're not the target demographic for the Park Hyatt; we had two little kids in tow and didn't hang out at the bar. But the staff were great with our kids and made us feel at home, albeit a luxurious home.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Wow, what a view...”", "Author": "Charlie1745", "ReviewID": "UR37933196", "Content": "We stayed in this hotel and had booked a Opera House view room, don't get me wrong this is an expensive option for staying in Sydney but if you've got the money or are aiming for a real treat this hotel is worth paying for and the upgrade to an Opera house view room is a must.. The rooms are modern and well equipped, the staff are very friendly and personnel and the location is second to none.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Warwick", "Title": "“Very comfortable, enjoyable and amazing views”", "Author": "Sn00pycat", "ReviewID": "UR37643255", "Content": "Quite a posh hotel, but not overly posh. The rooms are huge and the beds are so SO comfortable. Our window looked across circular quay with the opera house the other side, and the harbour bridge right next to us, this hotel practically sits underneath the bridge! But you don't hear any noise from outside. Great location to wander round to circular quay to hop on a ferry. The outside is nice, but it doesn't fully represent how nice it is inside, you'll fiigure that out as soon as you step into the reception.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "gold coast", "Title": "“good for business trip”", "Author": "loveholiday78", "ReviewID": "UR37532286", "Content": "my husband and i stay at this magnificent place location are just awesome .very easy distance to walk by and what a beautiful view we had. we even order food which i think reasonable price and i am so impress with the hotel . One day we will return in this magnificent places .", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Best Hotel in the World !!”", "Author": "ConradCopperCCC", "ReviewID": "UR36222402", "Content": "This is definitely the best hotel I have stayed in. From the location, to the room, to the service, to the view ! TWO THUMBS UP !! The door man was very friendly and helpful. Throughout my 6 nights stay, I had everyone assisting me in my every need from getting a taxi to arranging for a tour to getting dinner reservations! Unforgetable experience. Will be returning very soon !", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Christchurch", "Title": "“Easy luxury in the best spot in Sydney”", "Author": "Likesaholiday", "ReviewID": "UR34512022", "Content": "My husband and I stayed here for 4 nights as a treat on our way from the UK to New Zealand for a year. We were delighted to be allowed to check in a few hours early having arrived first thing in the morning and found the staff courteous but approachable. Our room was categorised as 'Opera View Deluxe' (or something similar) and we were very happy that this description was accurate! The Opera House view was uninterrupted, it's viewing made easier by the remote controlled curtains, and the facilities were certainly of a high standard. Bed was big and comfortable, walk-in wardrobe meant it was easy to keep room tidy and the flat screen TV would be fine for anyone who should want to sit in and watch it! In the bathroom the shower pressure was good and the bath was deep yet filled quickly. I'm generally not a fan of hotel toiletries but quite liked those supplied here! We had breakfast included and certainly made the most of it: a superb spread of continental-style options, with particularly delicious fresh fruit, and a menu with the usual suspects such as eggs benedict, pancakes and smoked salmon bagel, all served to perfection. Our main disappointment was breakfast on the Saturday morning with a packed dining room, including walk-in diners. The service, having been excellent all week, was now appallingly slow and even though the staff were very apologetic we left unimpressed (still having had a good feed!) We didn't eat any other meals in the hotel due to the large selection of other restaurants in Sydney to enjoy. The location was perfect not only for the views but also accessibility to the main tourist spots. Being only a few minutes walk from Circular Quay where the ferries go to several areas of interest, and a train station, it's easy to get anywhere you might want to go! There was free internet in the 24hour business centre that was never busy but a charge for Wi-Fi. We didn't use the gym or rooftop pool (the weather being a little undesirable for outdoor swimming) but had a look. Both are quite small and would be busy with more than 3 people. There was however a recommended jogging route from the hotel. In summary, stay here if you want a bit of luxury in a relaxing hotel in a great location and like a good feed at breakfast!", "Date": "July 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“too stuffy for sydney”", "Author": "WheatStacker", "ReviewID": "UR33785658", "Content": "I found this hotel far formal, the staff way to stuffy to the point often with the younger staff being so stiff as not to feel willing to be helpfut - perhaps they took their training too seriously. I would not stay here again, but I prefer the Observatory, but for business to impress clients, may be just right.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Loved the Room”", "Author": "Suniel14", "ReviewID": "UR32593261", "Content": "On one side is the Sydney Opera and the other side is the Sydney Bridge. In between is all water and quay area and there lies the Park Hyatt. Rocks area is just 5 minutes walk. Central downtown area is 10 minutes walk. The hotel is an absoulte luxury in terms of room quality, food, service and the accessories supplied. The bathroom is huge and the room extremely spacious with all possible gadgets and gismos. Each room has a balcony and the view is grand! The hotel perhaps has no comparison in Sydney.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Fantastic Setting”", "Author": "Chets_9", "ReviewID": "UR31544078", "Content": "If you want a view of the opera house and sydney harbor bridge, there is no better place to stay than the park hyatt. Within walking distance from both attractions. nice modern rooms, expensive but worth the view and setting.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "1", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Great Hotel - Shame about the price”", "Author": "goldcoastguy71", "ReviewID": "UR30418864", "Content": "This is a hotel with large rooms and a great view, but I can't see the value of the $625 asking price. If I was to stay again, I'd only pay $300 max. There just aren't enough bells and whistles to justify the hotel's room rate. One major downside is the TV reception is the worst I've ever seen. Zoomed and cropped picture and full of snow.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Phenomenal service!”", "Author": "JacksTravels2009", "ReviewID": "UR29567032", "Content": "I recently stayed at the Park Hyatt Sydney, and what separates this hotel from any other in Sydney is the service. Iâ€™ve stayed at the Four Season and Shangri La in Sydney for business on many occasions, however for a long weekend, I travelled with my wife for her birthday and wanted the best. And the best is what I got. The price tag for a weekend at Park Hyatt is expensive but the service and the view is exceptional. From the moment we arrived at the hotel, the staff were always present. The Bellmen were friendly, welcomed us warmly and ushered us to the reception desk. I had booked a Opera room but due to arriving early, the room was not ready, but instead of being asked to come back later, we were taken to the harbour with beautiful view of the Opera house for a complimentary drink while we waited for our room. In no time at all were collected from the Harbour bar and escort to the room by the Duty Manager, Andrew, and in my opinion, is an asset to the industry. He catered for everything from restaurant advice to shopping for my wife during the walk to the room. His recommendation for dinner for my wifeâ€™s Birthday was superb. We went with his advice and chose â€˜Est.â€™ at the Establishment hotel which was beautiful, and the hotel even organised a table at the cocktail bar afterwards. My wife thoroughly enjoyed herself, the food was superb and although we didnâ€™t go to the cocktail bar it was a great example of providing additional services not just a dinner reservation. Upon returning to the hotel, we had a night cap at the beautiful Club bar, which is one of the best Hotel bars Iâ€™ve visited, small, personalised and very comfortable. But what made the night, when we returned to the room, there was a cake, a bottle of wine and a card wishing my wife a happy birthday. The attention to detail offered here at the Park Hyatt should be an industry standard for 5 star hotels. Just phenomenal! The rooms are aged but maintained well and the amenities supplied were plentiful. The rooms are expensive compared to another hotel Iâ€™ve stayed in, however the personalised service offered at the Park Hyatt, and that unhindered view of the Opera House is worth every dollar. Congratulations to the management at the hotel, as the staff are the hotels greatest asset. The bell staff, concierge, receptionists and waiters were the friendliest weâ€™ve experienced during our travels over the years. Definitely the best city Hotel we have ever stayed at and we will definitely return in future!", "Date": "May 7, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“The Best Part of Sydney”", "Author": "mmpayton", "ReviewID": "UR29039864", "Content": "This hotel is a must if you can afford it! Spectacular views of the Opera House! Best location in Sydney. Short walk to major points of interest....The Rocks, Darling Harbour, Harbour Bridge, Opera House, shopping, pubs and bars, etc. Staff is superb! Especially the concierge Cameron. He is the best! The entire staff was warm, accomodating, went above and beyond. The rooms, amenities, and restraurant were perfect. Overall a great experience. One of the the highlights of my trip to Australia.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great disappointment”", "Author": "beachislandlover", "ReviewID": "UR28588446", "Content": "I felt compelled to write this because I use Tripadvisor a lot to research where to stay next, and always trying to filter negative from the positives. I could not believe the amount of positive response for this hotel. This hotel is touted to be one of our best and maybe it is but comeon everyone what are you seriously comparing this to? I travel twice a year and check into all the top class hostels and resorts. Either the previous reviews have never been anywhere outside Australia, or it is not the customers who are providing the reviews. There is a clear lack of interest by the staff which is not unusual for Sydney hospitality generally. Also there was a touch of arrogance on top of this which was noticeable. The breakfast was fair but no wow factor at all. Our toilet seat lid kept falling off in our room. There was definately no value with this stay and will not be going back. We wrote a letter to the hotel to state our disappoint and issues with a very flat response. The room itself was reasonable and the view and location pretty good, so if this is what you want then if you pay enough, which is too much, then you get it. My suggestion is to try the fourseasons. The rooms are about the same, the service and food much better and the views are spectacular.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Easter Weekend - very good hotel, maybe not quite as good as the reviews say though”", "Author": "splatnz", "ReviewID": "UR28251364", "Content": "We stayed here over the easter weeked, a break from Sofitel where I usually stay. Likes - Very polite, genuine and friendly staff; definitely the highlight of the hotel - Excellent view and location; hard to fault looking at the Opera House every time you look out the window and right down at the Rocks so easy to get around. - Very good amenities from Vive - Good quality food at the restaurant - Good Amex FHR amenities (3 course lunch for 2 once during stay and contintental breakfast each morning (upgrade to full cooked buffet for AUD$5). - Good size bathroom and wardrobe Dislikes - Not as luxurious as some other Park Hyatt's, rooms well maintained but could do with a make over - Pool area is very 'Holiday Inn', it's on the roof which is fantastic but small pool and tiny spa. Couldn't see any changing rooms at the pool, no bar facilities etc. - Pricey internet - AUD55c per minute. Overall this is a very good hotel and I really enjoyed the staff and the location but it's not the most luxurious hotel in Sydney and maybe not worth the price unless you get a great deal (maybe AUD$350 per night). Having stayed at other Sydney hotels I think that there's maybe better value elsewhere.", "Date": "April 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Perfect, perfect, perfect”", "Author": "cheeseburger23", "ReviewID": "UR26303626", "Content": "Husband and I stayed here for a week on a two week holiday in Sydney in March 2009. Could not find a single fault with the hotel. First, the location of this hotel is incomparable. Just on the edge of the Rocks and Circular Quay, we were always a few yards away from things to do and food to eat. Second, the rooms are spectacular. We booked an Opera King and got upgraded to the larger room facing the Opera House. Every morning, we took photos of the sun rising over the opera house - the view was absolutely amazing. The room was perfection. Huge marble bathroom, giant walk-in closet, enormous sitting area, heavenly king bed, etc. Amenities were fantastic. We were given complimentary wine on arrival, and daily fruits and chocolates. Mini-bar was well-stocked, but we didn't use it since they gave us free water every day. We ordered room service almost daily, and it never took longer than 20 minutes, despite the fact that our room was the furthest from the elevator. The room service operators were the perkiest people we'd ever spoken to. The attached restaurants are also very good. We enjoyed several meals there and never had anything bad to eat. Business center was available 24 hours a day and free. Hotel wifi in our room was a bit expensive, but we're used to that in hotels all over the world. Taxis were called promptly. We did not try the pool on the roof. It looked small but clean. The staff were incredible. They knew our names, and also understood (without us telling them) that we would be returning to the hotel in a week for one additional night prior to our flight out of Sydney and asked (without any prompting) if there was anything we wished to leave behind in secure storage until our return. We can't wait to return to the hotel. It is lovely without being snooty. It will feel like home. A very posh home.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Perfection!”", "Author": "Helen J", "ReviewID": "UR26030402", "Content": "The concierge Cameron Griffin works wonders. The entire staff is most gracious and professional. Request a room with a view of the opera house. And try to see something there or at the nearby Sydney Theatre Co.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Fantastic hotel with great views”", "Author": "10StarDeluxe", "ReviewID": "UR25918891", "Content": "I travel often for business and pleasure and always stay in 5 star deluxe hotels, and this is by far is one of the best hotels I have experienced. I stayed here with a friend for 10 nights over the New Year celebrations as part of an 8 week round the world trip. All the hotels we stayed at were 5 star+ (we stayed at 18 in total). Everything about this hotel was great â€“ the location, the views, the rooms plus the staff and management were wonderful. They always greeted us by name and nothing was too much trouble. Needless to say the service was impeccable; it was warm and friendly but not intrusive and always very professional. The concierge, the manager of the bar restaurant and the assistant manager I would like to mention, but all were fantastic. We ate in the hotel restaurants often and found the food and service excellent. The hotel has a great location on the water in front of the Opera House and next to the Harbour Bridge. It is in a trendy and upscale part of town and is within easy walking distance to many shops, restaurants and bars. Plus it has a great arts and crafts market on Saturdays right on its doorstep. We stayed in a very nice room with an Opera House view, and boy what a view â€“ the best in Sydney. It had a good sized bathroom and a great balcony overlooking the bay with that great view with a front row seat to the New Years celebration. We sat and watched all the preparation for News Years Eve on our balcony and that evening we celebrated it at the hotels rooftop party â€“ it was unbelievable. You are so close to the fireworks you really soak-in the atmosphere, plus those firework displays that are simply breathtaking. We both thoroughly enjoyed our stay here and we have booked for next year.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“Best hotel in Sydney”", "Author": "bobd72", "ReviewID": "UR25663017", "Content": "My wife and I stayed in the Park Hyatt Sydney during out trip to New Zealand and Australia...The hotel was full over New Year's weekend so we initially stayed at the Shangri-La which was very nice and had a great view...That being said, it was large and impersonal...The Park Hyatt had a different feel...It was located on the edge of Sydney Harbor and has a direct view of the Sydney Opera House...It is a small hotel in comparison to the Shangri-La and the Four Seasons and is much more personal...We had a room with a balcony that overlooked the harbor and the Opera House...The hotel and rooms were finished in a modern/minimalist style...The breakfast was very tasty and was served in a restaurant with a great view of the harbor....My only minor criticism of the hotel is that some of the staff were a bit over-serious and too cool for school...Additionally, the hotel is great but was twice as expensive as the Shangri-La...It was great but I don't know if it was worth twice the money...During our stay we ate at Rockpool, Quay and Tetsuya's...Tetsuya's was as good as advertsied, Rockpool was surprisingly good and Quay was a bit overrated...Sydney is perhaps my favorite city in the world and the Park Hyatt is unquestionably the best hotel in the city and worth the extra money if you are looking for a special experience.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Absolutely Oustanding, Loved it!!”", "Author": "freqtravellersfour", "ReviewID": "UR25511581", "Content": "We stayed here over Christmas and we wish we had booked a longer stay. We had a completely flawless stay. The service at the Park Hyatt Sydney is probably the best we've ever experienced. One manager in the restaurant \"Lucas\" took the time to tell us all about Australia and Sydney. He gave us some great advise and as a result, our whole trip was perfect. It didn't matter which staff member we talked to, they all took the time to help and say \"yes\". Even the valets outside the front door were polite, and helpful 100% of the time. We didn't have a single \"no, I'm sorry...\" the whole time we were there. All the rooms are beautifully appointed with breathtaking views. And the food is first rate. It's an expensive hotel but, as one other reviewer said, Why should it be? With such service, quality, and location, one would expect to pay for it. We have stayed in many many hotels all over the world, with and without our kids, and this was hands down the best experience yet. I would recommend it to anyone. Thank you Park Hyatt Sydney!! (**Just as an aside, we went to the Hyatt in MELBOURNE for a few days after Christmas, and it was total crap in every way. There is No comparison to be made whatsoever.)", "Date": "March 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“A Great Hotel”", "Author": "LynnBAustralia", "ReviewID": "UR25310133", "Content": "My Husband and I stayed here in November 2008. It was our 26th Wedding Anniversary so we were looking for something special. We chose an Opera King Room which was lovely. Because it was our Anniversary we were given a complimentary bottle of Sparkling Wine which was very much appreciated. Breakfast was included in the our package. and it was very good. We don't normally order room service when we stay in hotels, but on the night of our Wedding Anniversary we decided to treat ourselves to dinner in our room. We are very glad we did as the food was great and the meal was very well presented. We found the staff to very effiecient and approachable. This Hotel although pricey is value for Money. And for a special occassion with a wonderful view I would recommend this hotel.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester", "Title": "“The Best View in the World!”", "Author": "bobbinuk", "ReviewID": "UR23615117", "Content": "What a wonderful place. We stayed here on the second leg of our Honeymoon and the hotel staff made everything run so smoothly with a personal service, you didnâ€™t feel like another number. Our room was amazing and we looked out directly over the harbour onto the Sydney Opera House, It was that close I felt that I could touch it! As a great lover of Sydney I could not have asked for anything else. The bathroom was in keeping with the luxury of the hotel with some lovely toiletries and the power shower was wonderful for staving off the jet lag! Everything about the hotel was run beautifully and the breakfast was cooked to order perfectly. The location is fantastic for getting around and about and it took no time to walk across and round the area of The Rocks to the Botanical Gardens. On the downside it is very expensive, even though itâ€™s a fabulous place I think you are paying for the location primarily and some of the cheaper views donâ€™t have the view we had, I only wish we could afford to stay there again on our next trip!", "Date": "January 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowral, New South Wales, Australia", "Title": "“Love the Park Hyatt!”", "Author": "BFD", "ReviewID": "UR23333993", "Content": "We have stayed at the Park Hyatt on a number of occasions and have always loved it. Big comfortable rooms, very warm reception, great breakfasts, big marble bathrooms, great views, and great location. One of the best places in Sydney to simply wind down and relax. I can vouch for the absolute pleasure of a single malt scotch in the bar of an evening in the olde world atmosphere. NIce to be able to park the car at the hotel when you arrive, and not use it again until you leave, as the hotel is central to the city, and walking around the foreshore is a pleasure. Can't recommend it highly enought to fellow travellers.", "Date": "January 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkshire, UK", "Title": "“Best service and location in town!”", "Author": "NuBrain", "ReviewID": "UR23071307", "Content": "Stayed in November for 4 nights, after checking out from Quay West Suites (see review). The whole Park Hyatt experience starts from the moment you arrive until you leave. Check in quick and efficient, any changes/amendments to the booking were made on the spot and with instant confirmation. Concierge (Cameron) was one of the best I've dealt with, accommodating any single request or answering any questions always with a nice smile. He even recommended me to his counterpart in Melbourne, as that was the next leg of my trip. Rooms were very well decorated and spacious, great bathrooms and walk-in closets. Didn't make use of the restaurants but the bar, views were unbeatable and it has a decent cocktail list. Small pool but the views from the deck and jacuzzi will stay in your head for a long time...where else can you be a in a hot tub facing the Opera House?", "Date": "December 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gold Coast Australia", "Title": "“Living in Luxury”", "Author": "Rainbow03", "ReviewID": "UR22974794", "Content": "Having return from overseas stay for 7 nights at the Park Hyatt was amazing memory . Our room has magnificent view of Sydney Harbour and the Rock area . Front Desk very helpful, the breakfast over looking Sydney Harbour was just magnificent my wife ordering waffles and strawberry everyday. The hotel its self very close to the Rocks which in our opinion is outstanding area of Sydney.The Restaurants within walking distance are top class, we order some food from room service the food very good. We even impress with remote control curtains and blinds. One night there was a on the Harbour a fire works displays that was magic and add memorable to our trips.If you are seeking luxury this is the outstanding Hotel .", "Date": "December 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Worth Breaking the Bank”", "Author": "Mayfair Ranger", "ReviewID": "UR21080716", "Content": "My wife and I spent three nights in an â€œOpera Kingâ€� room at the Park Hyatt in early October. The Opera King (or Twin) is the basic category of room enjoying a direct, unobstructed view of the Opera House, but I reckon that some of the cheaper (or should I say less expensive?) rooms enjoy a serviceable, albeit not front-on, view also. Quite apart from the views, however, the location of this property is absolutely superb - probably the most perfectly sited hotel in which we have ever stayed, anywhere. Want to do the bridge walk? Itâ€™s five minutes away. Likewise Circular Quay. The proximity of the Opera House itself is self-evident, etc. etc. If you also select a basic room, bear in mind that some rooms have proper balconies with chairs, while others have much smaller balconies without chairs (even though the rooms appear to be of an almost identical size) - itâ€™s therefore worth requesting a room with a proper balcony with chairs. The rooms are well-sized, with desk space, plus with extremely comfortable large beds and pillows. The bed linen is also top notch. The marble bathrooms are spacious, with a separate shower and good amenities. The soundproofing of the rooms is excellent, but one curious feature is that the bathroom extractor fans do not turn off (they are not at all loud, but you know how it is when you notice a noise that will not go away). Management confirmed that this was a design feature. My other minor gripe with the room was that the internet service had to be paid for. For a property at this price-point, I consider this to be an unnecessary irritant - and Park Hyatts are not consistent in this regard. Breakfast (included in only some room rates) features a great selection, including many cooked-to-order items. Both hotel restaurants, situated with Opera House views, offer excellent quality of food and elegant presentation. On one occasion the lunchtime service was slow but it was a minor complaint and the place was busy. The hotel also has a cosy and comfortable whisky bar with an open fireplace (or at least my wife tells me it does - I was sufficiently sloshed not to remember). The Park Hyattâ€™s spa is a little disappointing, being both tiny and disjointed. Showers are on one floor and the sauna and steam room on another, making it a bit of an effort to cool off afterwards. Bell boys are super friendly and very quick to help with taxis, luggage etc. With the exception of a dim receptionist who allocated us a room with an inferior balcony, when the next door room with a large one was vacant, the overall quality and friendliness of staff was excellent. If you are willing to swallow the expenditure, I donâ€™t think youâ€™ll find a better option in Sydney than the Park Hyatt.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "East Sussex", "Title": "“Don't bother ! How disappointing.”", "Author": "Whitefern", "ReviewID": "UR21052411", "Content": "We have visited Sydney on a number of occassions and always promised we would treat ourselves to the Park Hyatt, overlooking the Opera House. What a disappointment! Hugely overpriced ($700+ per night RO) for what you get. I have stayed in other Hyatt hotels and assure you this is the WORST. Rooms are small and grubby and the service is dreadful. Even trying to get fresh milk and tea bags from Housekeeping was like getting blood from a stone. We all know hotel phone charges are high, but a $5 charge wether or not you actually make a connection?! $30 for internet connection! Its free in the cafe across the road in the Rocks. After an awful breakfast with dreadful service we tried a number of cafes in the Rocks, it was 1/4 the price, better and included freewire internet service. Best recommendation for breakfast id the Patisserie My advise.. try an independant hotel in the Rocks or even the Mantra hotel is better on Bond St.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A perfect 10!”", "Author": "FGD23", "ReviewID": "UR20508993", "Content": "If you enjoy luxury, impecable service, spacious rooms, location, and amazing views this hotel is for you. It does come with a price tag attached to it I must say. My wife and I had an amazing stay at this prime property in the best part of Sydney. Enjoy a glass of wine at the Harbour Bar while looking at the Opera House light up at sunset... priceless.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Midlands, England", "Title": "“Amazing, gorgeous, fantastic!!!”", "Author": "kirkychat", "ReviewID": "UR20164922", "Content": "This is absolutely the best hotel I have every stayed in. We booked a suite with a view of the Opera House and I was completely blown away by the views... just magnificent. And the room was so luxurious with everything you could possibly ask for. The service and friendliness of the staff was second to none, the food was excellent and the concierge we spoke to when we asked for help to get about and see the sights was so kind and attentive. I can't think of a single thing I could criticise - it was absolutely as perfect as it could possibly have been!!", "Date": "September 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“great view”", "Author": "MissyManila", "ReviewID": "UR17552973", "Content": "actually this is my dream hotel... i like the location of this hotel, in the Rocks/ Circular Quay... facing the famous Sydney Opera House that i admire so much... the downfall, as expected is, its really expensive... sydney shangri-la hotel's price is more reasonable that this...can't imagine my husband will pay that much for my dream hotel... it's an experience that's worth keeping especially when i think about the price... definitely the luxury of life... staff members are not that friendly though... but the room and view are perfect...", "Date": "July 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“The best views of the harbour”", "Author": "codobai", "ReviewID": "UR17390457", "Content": "The hotel's location cannot be beaten. It's an easy walk to the train station at Circular Quay. The biggest selling point is the waterfront views. The cityscape, the Opera House, the Bridge, and the water are just picture-perfect from our balcony. It's worth every dollar. The unique thing is that although the hotel is in the midst of the tourist sites, it's quietly tucked away on a small lane. The only noise you'll hear is the boat traffic and the chimes from the clock tower but it's a pleasant one. Don't forget to visit he pool on the rooftop. The views from there under the night sky is absolutely spectacular! We would love to come back but it's a long flight from America!", "Date": "July 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“A wonderful experience”", "Author": "JoeyAJ", "ReviewID": "UR17333162", "Content": "My wife and I booked into this hotel for a special occasion, and being Sydney locals we expected it to live up to our expectation of being the best hotel in the city. We stayed over the easter holiday and we were treated to an upgrade. The staff were charming and friendly - not overly engaging which suits us - but they were readily available when we needed them and the concierge arranged a booking in a hard-to-get restaurant. The hotel restaurant was terrific for lunch and quite good value- the Harbour Kitchen for breakfast is a simply stunning way to start your day. The room - an Opera suite- was contemporary and stylish and we had ample room for our several guests that visited.The location is without peer if you are after an iconic Sydney visit, with the Opera House and Harbour Bridge bursting into view at every opportunity. Great walks from here-with train and ferry a pleasant stroll away if you were so inclined. The hotel was frequented by visiting celebrities but the staff spent no more time with them than they did with us. We had a wonderful time and see the Hyatt as easily the best 5 star hotel in Sydney", "Date": "June 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Fanastic Location....”", "Author": "Garota05", "ReviewID": "UR17135157", "Content": "The Park Hyatt is the place to stay if you're after a luxurious, beautiful hotel that is right on the harbour. In saying that, when you are paying $700 a night for a hotel room, I think that the internet should be free people!! My hubby used the internet for around 15 mins and we were charge $25 for it. The only other gripe I had was the breakfast. For $45, my poached eggs were completely hard and tasted only of vinegar - a little disappointing considering the price. In saying that, the perfect view of sydney harbour and the opera house while eating my hard vinegary eggs made it all ok. The rooms are big and the furniture is just lovely. The bathrooms are great and the electric curtains/shutters are awesome! I would definately recommend people who are after something special to stay here - there is nothing that compares to the location and the view...", "Date": "June 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Central Pa", "Title": "“Wonderful location, great views!”", "Author": "Missshopper", "ReviewID": "UR16757061", "Content": "This hotel has a perfect location! We booked an Opera View room and we were not disappointed by the view! It is within walking distance to much dining and stores in the Rocks area. We felt very safe there at night walking around also. The room itself was nice but nothing out of the ordinary for the price ($700+ a night). You are paying for the view which we felt was worth it. I had written the hotel two letters ahead of time saying we were celebrating special occasions (our son's wedding in Australia, my birthday, and our anniversary) but they did nothing for us which most hotels will have something to honor this. I did write about this in my comments card and found an apology letter when I got home from the manager saying it wasn't on my reservation. This could not be true, unless someone did not record it, as I sent it twice and all the other hotels on our trip responded to this. As we had an early sightseeing tour one day and an early flight the next, we ordered room service which was on time but pricey. We also had a drink in their lounge which was very pricey ($18 a drink). I would chose this hotel again as I felt you cannot get a better view or location!", "Date": "June 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Marvelous service, perfect location”", "Author": "oscar505", "ReviewID": "UR15483400", "Content": "Even better than the location of the Park Hyatt Sydney is the service. The concierge staff was extraordinary in their efforts to meet any request and provide any service, including giving minor first aid to our scared toddler. They secured a private driver for us, recommended restaurants, gave helpful transportation advice and helped in many ways. The rooms were very good, looking out at the Circular Quay and (from the balcony) the Opera House. I enjoyed just watching the light change on the view by the hour. And the location, tucked under the base of the Harbor Bridge, at the edge of The Rocks, gives quick access to restaurants, shopping, water taxis, ferries and walks on or across the bridge. Only small nits: the connecting doors between our rooms could not be unlocked, so gave us the potential of having kids locked in one room and adults in another if they inadvertently closed the door - which they did once! The hotel restaurant's breakfast was good, but other meals and room service offered sort of ho-hum choices. But the proximity to other good food made this less of an issue.", "Date": "April 29, 2008"}, {"Ratings": {"Overall": "5.0", "Value": "4"}, "AuthorLocation": "London England", "Title": "“Expensive, but great position”", "Author": "salbags", "ReviewID": "UR15122861", "Content": "We stayed in an Opera House, harbour view room for 2 nights when we first arrived in Sydney and it was definitely worth it for the position and the views. The pool is very dissapointing as it loses the sun early and it would have been nice to have relaxed by the pool in the late afternoon. Also it was not clean and there was no drink service. We did not eat in the hotel as it is surrounded by fantastic restaurant bars and cafe's at half the price.", "Date": "April 18, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "gold coast", "Title": "“loved the room & service/butler/ housemaid”", "Author": "delphis1", "ReviewID": "UR14547372", "Content": "We just spent 3 days/ 2 nights in sydney, had the premier suite and an adjoining room, the rooms are beautiful. The butler service and room service were fantastic. However on our first night we ordered in-room service to which we had to send the childrens meals back as they werent cooked properly, our meals were average but cold, we then ordered our breakfast being 3x full harbourkitchen breakfasts which were missing fruit salad. on the 3day we ordered another 2x breakfasts of the same as prior, we got our fruit salads but the hot breakfast wasnt hot at all. So the stay was fantastic just the food was a disappointment to us all.", "Date": "March 26, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chorley, United Kingdom", "Title": "“Fantastic!”", "Author": "DeeMooner", "ReviewID": "UR14279501", "Content": "My husband and I stayed here for the last night of our honeymoon. On arrival we experienced the same great personalised check in as other reviewers, and were shown to our deluxe opera king room, which had a great balcony which looked directly onto the opera house. No amount of money could buy such a great view! A few moments later, we were given a bottle of champagne, which we enjoyed on our balcony and then on the roof, where we sat in the sun and swimmed. Breakfast in the morning was enjoyed on our balcony - great Vanilla/Blueberry pancakes! Would thoroughly reccommend this hotel to anyone - it is by location and service seemingly one of the best in Sydney, if not the best.", "Date": "March 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Great View”", "Author": "bigbird01", "ReviewID": "UR13997202", "Content": "The hotel has the best location in Sydney. You wake up in the morning and open the window and you have the opera house looking back at you. I was lucky enough to have a clear view but some rooms don't. This is a good hotel and i want to give it 5 stars but i can't. The service was good, the food was good but the place lacked any real atmosphere. Also the premium you are paying for it's location is quite high. The room was very modern and quite trendy, nice Lcd Tv, great bathroom, everything you would expect. The SPA is not really a SPA is has some treatmnents and a nice plunge pool on the roof. While this was nice it did not feel 5 star, and it had a slightly forgoten feel to it. Overall: best location in Sydney, good rooms, good service but not worth the premium you are paying.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fabulous except for the cooling”", "Author": "talkative", "ReviewID": "UR12536558", "Content": "We stayed for two nights in January. we had an opera house view room & the view was superb. the bed was good - furniture very comfortable & the bathroom huge if a little dated. house keeping was good. the food in the restaurant & the views from the restaurant were both fabulous. our only gripe was that the air con wasn't working when we arrived - we later heard it had been out for 24hrs. we were not warned it wasn't working when we arrived. infact we were shown how to use it & told it took a while to work ! 5hrs in to our stay when we rang to complain about how hot our room was we were told the air con was temporarily down but engineers were repairing it. 8hrs in to our stay it was still not working - we asked & got a fan. 24hrs in to our stay we called the duty manager to ask for a progress report. he or she did not speak to us but let his/her secretary deal with us. we learnt that the air con would not be up and running till after we'd left the hotel. when we asked for compensation we were referred to reception who were very helpful. this was all handled badly. i don't expect to be mislead by a hotel of this quality when i'm paying such a lot of money and i also expect the duty manager to have the courtesy of dealing with me when there is a real problem with how the hotel is running.", "Date": "January 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Perfect Stay Except for One Annoyance”", "Author": "boston6_8guy", "ReviewID": "UR12366624", "Content": "My husband and I stayed here for our last night in Sydney, as part of our honeymoon. I must say I have never seen a more beautiful and luxurious hotel, in all of my travels. The location is to die for, and the staff are incredibly nice and attentive. I almost fell over when the reception agent walked us to our room, and made sure everything was to our liking. An incredible hotel, a gorgeous room, and a stunning bathroom without a doubt. And, the automatic shades were cool, but didn't close 100% (and you can't move them by hand.) BUT, there was one REALLY annoying thing, that totally knocked one \"owl face\" off of my rating. They charged us $11 to make a 1.2 minute call to a local number. HELLO!? If people are paying over $500 a night for a hotel room, do you charge them to pick up the phone for 1.2 minutes, to call a friend in the same city? I was amazed at something so thoughtless/greedy/silly. So, I hope your stay is as great as ours, but stay away from the phones! Don't even look at 'em, or you may get some obnoxious charge! And, uh, the breakfast is $45 each. I don't know what they was serving, but it couldn't have been that delicious. The view, though, is unbelievable, with the sound of waves under the restaurant when the windows are open...", "Date": "January 5, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "london", "Title": "“Arrival in Sydney”", "Author": "margykf", "ReviewID": "UR11701698", "Content": "Sydney from London at Christmas time is not the easiest of trips! You are over tired and harassed by all those last minute jobs. But after a long and disturbed journey (a family with hacking coughs and small children in adjacent seats) it was an enormous joy to arrive at this excellent hotel. The welcome was efficient and peaceful and apart from a change of room, due to a previous occupant having been a big smoker, something I find unbelievable in this age, that someone would do to a glorious hotel room with a view to the Opera House across the water. We were given a delightful harbour view, large room with every calm comfort that you could want. The magic of the ferry boats crossing the harbour on an unusually wet and cloudy day have lulled our jet lagged bodies. The Park Hyatt offers a fantastic way to be introduced to Australia.", "Date": "December 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“excellent hotel in a great loaction”", "Author": "Longdrive", "ReviewID": "UR10933662", "Content": "I had always yearned to stay at the Park Hyatt Sydney and at last I had accrued enough Hyatt Gold Passport points to book a room as a birthday treat. Booking in was a very easy experience and sitting at a desk in the lobby made you feel important. On checking in, the charming young lady inquired if we were celebrating any special occasion and on hearing that it was my birthday she had no hesitation in arranging for a nice bottle of champagne to be sent to our room. As I had secured the booking on points I was half expecting a room with a lesser view but we were blown away with both the room and the view of the Harbour and the Opera House. They also provided us with vouchers for a welcome drink in the hotel bar which was also appreciated. We did not eat at the hotel as there are any number of quality restaurants within minutes walk all providing great food and matching views of the Harbour Bridge and Opera House. My only negative of the room was that I considered the bed to be a touch hard for my liking but I still managed to have a good nights rest. The electric curtains were a nice touch as we didn't have to get out of bed to open up the magnificent view of the Opera House in the morning. All staff in the hotel were friendly and obliging. As the regular room tariff for the hotel is $700+ , the biggest test is, would I pay that much to stay there or is there better value quality hotels in Sydney. To put this question to the test we checked out after one night and checked into the Shangri La which is about 600 metres away.", "Date": "November 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Under whelmed”", "Author": "Bo94114", "ReviewID": "UR10698091", "Content": "Stayed for 3 nights in a city harbour view room. Donâ€™t be expecting the view shown on the website with this category of room. I had to lean over the railing and look to the left to see the Opera House. Loved the balcony and would of loved to sit out there but the seat cushions were soiled and the table was less than clean. The room itself was OK. Loved all the shelves. The lights in them do make the top surface warm so watch what you place on them. The automatic curtains would not close all the way. The light wood is pleasant but it shows every mar and scuff. The bed was one of the most uncomfortable I have experienced. I think the pillow topper was missing as it was very firm. Even our friends that came to our room made mention of it so I knew it was not just us. The bedside clock did not have a light so you could not tell the time after dark. Huge bathroom with great amenities. Slight mildew issue at the base of one of the glass walls in the shower. Toilet seat opening is quite large so beware. Some of the TV channels came in less than focused. Wonderful closet. Common areas were good with the exception of the area near the bar that smelled of stale smoke. The Staff are beyond wonderful! They are some of the best I have ever encountered. They along with the location are what make this hotel. If you put the building anywhere else it would not command such a price.", "Date": "November 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Wow”", "Author": "teambloopy", "ReviewID": "UR8662750", "Content": "We spent the first two nights of our honeymoon here and loved every secd. Great location, great views, beautiful room and staff willing to do anything possible to help. We were given a bottle of champagne, strawberries and chocolates to start our wedding night off in a most romantic way which was a nice touch. Not something we could afford to do regularly but certainly worth it for a special occasion.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wolverhampton", "Title": "“Excellent hotel - unbeatable location & great staff”", "Author": "gully1", "ReviewID": "UR8216700", "Content": "My wife Chrissy & I stayed twice at the Sydney Park Hyatt on our recent holiday to Australia arriving on 5th July to the 10th of July and 1 last night of the 17th of July. The holiday was to get off to a bad start at London Heathrow with the cancellation of our flight on the 3rd July due to a security scare, BA managed to get us on a Qantas flight the next day but despite flying â€œFirstâ€� we spent the first night in Terminal 4 Baggage Reclaim vainly trying to recover our baggage. On arrival at Sydney we were advised the luggage was not on board. Imagine our horror in that we were arriving the evening of the 5th July to the Sydney Park Hyatt in clothes that we had worn for 2 days already. My wife Chrissy and I have nothing but admiration for everyone at the Park Hyatt in that we were greeted warmly and the Concierge Team of Cameron, Chris, Andrew & Patrick swung into action immediately day & night seemingly chasing our baggage through Qantas Baggage Services. All the way through our stay we were addressed with our names without prompting & after 4 days in Sydney my wife Chrissy was reunited with her luggage. Needless to say that the Concierge Team never gave up chasing my luggage & despite moving on to Lilianfels in the Blue Mountains for 2 nights & The Beach Club in Hamilton Island for 5 nights. On our return to the Park Hyatt we were greeted with an immediate update on my baggage status from Cameron in Concierge. Never before in our stays in hotels of all standing has my wife or I experienced customer satisfaction & attention to detail as shown by these guys. As to the hotel itself, the bell hops are very dutiful & attentive, greeting us by name on both initial greetings & subsequent greetings during the stay. They were very prepared to organise a taxi which was a past reviewers concern. Daniel on reception initially checked us in with a relaxed but efficient style that was very much appreciated after what we had endured the previous few days. We were shown to our Opera King Deluxe Room 212 which definitely had the wow factor, Daniel showed us round the room facilities finally retracting the main curtains and sheer drapes electronically revealling the signature view of the Opera House, fantastic. The bed must have been 7 foot wide & it was extremely comfortable, supportive & good for your back, it was without doubt best bed we had in Ozzie. It was nice to wake up, turn over & take in the view from the bed viewing through both patio doors as the Opera King Deluxe Rooms have 2 patio doors & balconies. Breakfast is taken in the main restaurant with views overlooking the Circular Quay & the Opera House, on weekends a buffet is provided, on weekdays hot meals are waiter service. A good choice is also available in cereals, fresh fruits, danish pastries, croissants & toasted bread of various kind plus cheeses & hams & fruit juices. Restaurant manager Lucinda oversees the restaurant extremely well catering both business people & holidaymakers. Lunch & Dinner in the hotel provide an excellent array of choices including vegetarian options which if for some reason other choices are required Lucinda or the Concierge Team are only too happy to discuss on your behalf with the chef. The rooftop pool in spring, summer & autumn time provides a pleasant location to cool down & unwind with bridge views, although in winter the temperatures may prove too challenging, it was for us anyway? The spa provides all year round facilities & is located in the roof top area. It should be appreciated that July 2007 has provided the coldest winter month for NSW & Queensland for many years, our time at Hamilton Island was affected by colder than usual weather also. General Manager Marlene Poynder can be congratulated for running an exceptional hotel; her management style certainly seems to get the best out of her management team & staff alike. She can be found most mornings in the breakfast room talking to clients & reviewing facilities, she is a lovely lady. Our time at the Sydney Park Hyatt was above expectation & on both stays in the holiday (we returned for 1 last night immediately before returning home); without doubt we would return to this hotel again when we are next in Sydney. We would also look to have the Opera King Deluxe rooms again as these do seem to have the best views & square footage per AUD.", "Date": "July 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Absolutely top notch in every wat”", "Author": "littllebabyneko", "ReviewID": "UR8126444", "Content": "We were lucky enough to stay here for our wedding night and I'm glad to say that it was perfection. We got a Opera View room and were allowed to check in an hour early so that everyone could get their hair and makeup done (although they would not commit to this until that morning which added a bit of nerves). The room itself was an Opera View room with a lovely view of the Opera House. I am very particular with my hotel rooms but I can honestly say that this was perfectly appointed with everything I could ever want! The bathroom was huge and had a separate bath and there was a sizeable walk in closet where I could hang up my wedding gown. The leather chair with foot stool was gorgeous (I really wanted one for myself, I saw one for $4,000 at David Jones) and the TV had a great selection of channels. Rooms are very well soundproofed which helps on a Saturday night when people walk past the hotel. When we came back from our reception at midnight we were greeted with Lindor balls, strawberries and sparkling wine. The next morning we awoke for the breakfast and if I can be critical, this was a smaller selection of breakfast goodies than I have previously seen at other breakfast buffets. The food was a little disappointing and the fruit was quite unripe and hard. I've actually had a wide standard of meals at the Park Hyatt from hideous (think Deb instant mash and microwaved thawed meat) to sublime (the Good Good Month dessert menu). Other than that, the Park Hyatt has wonderfully accomodating service and the rooms are absolutely top notch with stunning views and the best Sydney has to offer.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Bravo!”", "Author": "W0zza", "ReviewID": "UR7970053", "Content": "Had the pleasure of staying at the Hyatt Sydney in May 2007 and would recommend this Hotel. This is a thoroughly modern, luxurious, business hotel with spacious rooms & tastefully furnished decor - in a fantastic location. Views from some of the rooms of the Opera house, the Harbour, Bridge and downtown are unbeatable especially if you are lucky weatherwise. Very conveniently located within walking distance of a huge array of pubs, clubs, restaurants and downtown. Staff service is outstanding and did meet quite a few of the management team during my short stay. Arrived early at the hotel desperately needing a shower before heading straight to a meeting â€“ and was pleasantly surprised! Not only was the room ready but the hotel team had taken the trouble to prepare breakfast â€“ served in the room! Compliments to Mr. Fredrik Harfors & his teamâ€¦.How I wish this could be replicated elsewhere in Australia.", "Date": "June 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crown Point, IN", "Title": "“Perfect hotel to end a great vacation”", "Author": "Venus2", "ReviewID": "UR7835710", "Content": "We stayed one night at this hotel after spending three weeks traveling in Australia . We really enjoyed the Park Hyatt with the spectacular views of the Opera House. We took many photos. The bed was extremely comfortable and the bathroom was roomy. The staff was friendly and their assistance was very helpful when we had trouble playing the DVD player. We would definitely stay here again. It was a great end to a beautiful vacation in a wonderful country.", "Date": "June 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellingham", "Title": "“Wonderful”", "Author": "grm", "ReviewID": "UR7406137", "Content": "We stayed in April at the beginning of a month long visit to Australia. The hotel has stunning views of the Opera House and is connected to nearby harbor attractions by a promenade at the hotel's front door. The rooms are very very nice. An excellent choice.", "Date": "April 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irish in Seoul", "Title": "“Great hotel”", "Author": "JennyinSeoul", "ReviewID": "UR7366110", "Content": "We stayed here for two nights - the first two of our honeymoon in australia and it was everything we hoped it would be. We arrived early (7am) and although a room wasn't ready for us we were able to shower and change in the spa and left our luggage. They said they would call when our room was ready, which they did at about 11am. We found the service to be very good and we were given a comlimentary bottle of champagne for our honeymoon. Our room was spacious with a great view of the Opera House. The bathroom was one of the best that we have had in a hotel room. We had no problem in getting a taxi from outside the hotel, even at 8.30am to get back to airport. The door staff were very helpful and the concierege good in recommending a restaurant. The only negative comment was the price - although it is a wonderful hotel in the best location I do not think it justifies the prices charged, if it was not for it being our honeymoon we could not have justified the cost.", "Date": "April 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good and Bad In Quick Succession”", "Author": "Big_Blue_Traveller", "ReviewID": "UR7276729", "Content": "The Park Hyatt was our landing point in Australia and also where we returned for one night after a trip to the Blue Mountains and it was almost very good indeed. We first arrived late and tired after 24 hours travelling from the UK and were efficiently and courteously welcomed and shown to our room. Opening the curtains after dark showed why the Hyatt charges a premium, even for Sydney. We had a Opera King and right there in front of us was the floodlit Opera House, a fantastic view. The Hotel is well situated for most things you would want in Sydney and has all the right facilities - free internet (for first 30 mins although no one seemed to be checking) business like staff, a decent restaurant with great views etc, and the rooms are good sized and pretty well equipped. We ate there one night and the meal was pretty good, although there was a bit of a wait between courses. To the staff's credit they picked this up and offered us complementary wine. The buffet breakfast is a little thin for the price - we headed for the Gum Nut Cafe on the second day - much better! We left thinking it was close to a 5. However, when we returned, things were not so great. As we were only staying one night and had an early start we only booked a City/Harbour view room, but were horrified to find ourselves in a room at the far end of the hotel with a view of a tree and a cafe kitchen. We expressed our views to the reception person who said she would look into it. We felt that for a hotel that trades on views the lack of any view from this one should have attracted some reduction. After 20 minutes of no response we headed back to reception to try and track her down - and ended up being handled by the overall Room Director as the original receptionist seemed to have disappeared. He arranged for us to move to a more central room with a view of Circular Quay and admitted that the room we had originally been allocated was often heavily discounted and complained about. However, the service did not really improve as the original girl re-appeared and asked if we would be moving our own bags along - no offer of a bell boy. With hindsight (and denied by the Room Director) we believe we got the duff room as we were checking out very early (6.30 for a flight to Uluru) after just one night and it was also the Bridge Birthday weekend, but the room we were given certainly could not really be called a room with a view. Overall, the Hyatt has got a great location, good facilities, some good staff and a high level of style. However, it was all rather impersonal and business orientated which for a hotel right on Sydney Harbour was slightly at odds with the location etc. If you want the best views in Sydney, and go for a minimum of an Opera view room - you will be fine, if poor! But don't expect a very intimate hotel.", "Date": "April 3, 2007"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Poor service BEFORE even staying there!”", "Author": "lhapsie", "ReviewID": "UR7007468", "Content": "On March 7 (12noon Sydney time) I faxed the hotel directly trying to get a special group reservation. My friend had special rates for guests attending his wedding. On March 8 (12noon Sydney time again), no response from the hotel, so I faxed them again. On March 9, no response from the hotel, so I called the hotel's reservations directly. Deanna (in reservations) said she did not see any faxes or reservation & told me that there was no information for wedding party rooms. However, we know for a fact that the person getting married HAS bought out most of the hotel from 4/18-4/22! I will be sending the General Mgr of the hotel a letter informing her of her hotel's shoddy (or lack of ) service. This could be an indication of bigger problems with frontline operations & service. (Ms.)Theo Fujiyoshi - Associated Travel-Honolulu, Hawaii", "Date": "March 9, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "S.E. Asia", "Title": "“Ripoff with a Smile”", "Author": "Wine_Merchant", "ReviewID": "UR6814711", "Content": "This is a classic example of the best of times or the worst of times. The rack rate of AU$600 per night we paid for a \"Park King\" is in my long experience of hotel staying the biggest ripoff ever. A glorious location for a hotel where having paid AUS$600 for an early check in we were shown to a room that can only be described as a dungeon. A small window with an upward view of the Harbour Bridge. After complaining that this was totally depressing we were offered a room at the end of the long building that had a window looking at a tree and the street below. One could only envy those lucky guests who would enjoy the prettiest view in all of Sydney. A word of warning to all.. do not pay this kind of money for an ordinary hotel room just because your neighbors are enjoying themselves. Check out time is a ridiculous 11AM. An offer to stay until 13:00 was made for a charge of AU$130! Only after our frustration was made palpable did the same receptionist finally offer a later check out, \"complimentary.\" The nicest gesture made in 4 nights. Staff were polite if imperious. A sense of importance filled the air apart from the poor scum like us who had to hike to the far end of the hotel to our sad rooms. Probably the longest corridor in the western world being served by only one elevator!The price here compared to The Four Seasons is ludicrous. The restaurant/bar food was disgraceful as was the service. I had wanted to stay at this hotel for years. I regret having done so and strongly urge any potential guests to clarify completely the location and view of the room before putting down the hefty price for a room in this much overrated hotel. I am sure it can be glorious here if one is lucky enough to have the chips fall in the right place. They did not for us and we shall never return.", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "NYC", "Title": "“Style & Substance”", "Author": "NickBB", "ReviewID": "UR6799335", "Content": "I have read some bad reviews on TA but it was excellent. Very professional and stylish. Good facilities, excellent service and a wonderful restaurant which I enjoyed over three days. Most of all, such amazing views in the best location of Sydney in a small, stylish hotel.(on the Rocks). Bravo!", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos, CA", "Title": "“Great Location For New Year's Eve!”", "Author": "TravelerLosGatos", "ReviewID": "UR6560494", "Content": "We stayed at this hotel in December for 7 nights. My husband is a Diamond Gold Passport member, so we used his points to get 2 rooms for the week. When we arrived, we were greeted by the door man, who was very nice! The woman who checked us in was great and even came to our rooms to show us around. She also included 2 Continental Breakfasts per room at no charge (a $160.00 AUD per day value) which we greatly appreciated. The rooms we had were on the first floor. For the Hyatt points the only choice was the City/Harbour views,which are beautiful, but one of our rooms also had a great view of the Opera House as well. The rooms are good sized with a large bathroom, and nicely decorated. As I was unpacking, I noticed the glass on the table next to the bed was VERY DIRTY with glass stains as well as some kind of sticky substance. This was also the case on the table next to the chair by the mirror, although this one was much dirtier! I cleaned the night stand table, but for curiosity, decided to not clean the table next to the chair. I wanted to see if the housekeeper in the morning cleaned it.. To our surprise she did not. This went on for several days. I told my family that the first housekeeper to clean this table we would give a $20 tip as well as inform the management of what a good employee this person was. Unfortunately, after 5 nights, no one did and my daughter could not take it any longer, so she cleaned it herself because she did not want it dirty when we celebrated New Year's Eve that night. The room service was great and the continental breakfast had a decent variety. The staff in the restaurant was hit and miss, however, there was one that especially terrific! We were lucky to get him as our waiter on New Years Eve Dinner! Also, one of the managers in the morning was great! We tried twice to have dinner at the hotel (not including New Years Eve), but one night no one would even acknowlege us (even after standing there for over 10 miuntes).On the night of the first of January, a nice woman greeted us . She told us that she did not have room in the restaurant, but if we did not mind waiting, we could have dinner in the bar. She told us to talk with the gentleman with dark black glassest there (she told us his name, but I can't remember it except that it started with a F). We approached him and when I repeated what she said, he RUDELY told us he had no room for us and tried to get us away from his area. On both of those nights we went to a nearby places to eat, which were EXCELLENT! Most dinners for five ran around $200AUD, but since the food was good, we did not mind spending the money. My daughter got sick one night and we called the hotel doctor. He recommended us to take her to a hospital called St Vincent. The only problem was that the hospital he told us to take her was for adults only (my husband told him she was ten years old). The hotel staff at the front desk, the door greeters, and the concierge were GREAT! Nicole the New Years Eve planner was wonderful! If you are in Sydney for New Years Eve, this is DEFINITELY the place to stay. The location is great!! We had dinner in the restaurant, which by the way was fantastic! After dinner we wanted to watch the 9pm fireworks, but were worried about the crowds, because the Rocks where the hotel is located is one of the best areas to see the fireworks. To our great surprise, the hotel blocks off the area in front of it to only hotel guests or people having dinner there. We had a fantastic view of the fireworks. It is so hard to describe how beautiful the fireworks were, especially the ones at midnightl. From the hotel, we were able to see the fireworks over Sydney Harbour Bridge, the Opera House, as well as fireworks coming from what appeared out of the buildings in downtown Sydney. If we came back here, I would stay for New Years whether we used Hyatt points or had to pay, because the experience is well worth it. If it were not for the POOR HOUSEKEEPING and INCONSISTENT RESTAURANT STAFF I would give this hotel a 5 star!", "Date": "January 7, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Sadly not quite good enough”", "Author": "Prufreck", "ReviewID": "UR6341351", "Content": "For a hotel of this calibre, not to mention price, we were disappointed with several aspects of our stay. The location and view may be inspiring from the guest rooms, but try getting a cab at any time of the day or night and the doorman will advise you to 'walk up the road and try at the Four Seasons; taxis don't like coming here!' Not a great recommendation for a five-star hotel, especially if you are wearing high heels. Our pre-booked morning newspaper failed to materialise and took 45 minutes to resolve; a pre-booked and much-needed massage appointment at the Spa was messed up and we were simply advised to 'come back later'. And the parting gift was an additional $75 bill, sent by mail, because the housekeeping staff had incorrectly tallied our minibar account. All in all it was a thoroughly ordinary experience, despite the view of the Opera House. If you are contemplating a stay at this hotel, consider the Four Seasons instead (where I have also stayed and had much better service)!", "Date": "December 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cupertino, CA", "Title": "“Haughty reception, small rooms”", "Author": "kateapple", "ReviewID": "UR6184828", "Content": "We're currently staying at the Park Hyatt Sydney. Our room (King with a view of the Opera House) wasn't available at 3pm check-in, so the receptionist invited us to have a snack in their restaurant for 20 minutes. She offered to pay for the snack and get us when the room was available. An hour later, the room was still unavailable - and the new person at reception said that we would need to pay for our tea and scones. The room is nothing special. The bath is cramped and outdated. The bellstaff are terrific -- but the rest of the staff need to be retrained.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marlow, United Kingdom", "Title": "“Great Place”", "Author": "Emma676", "ReviewID": "UR6121551", "Content": "My husband and I stayed in this hotel for 4 nights - the hotel is in a beautiful location on Sydney harbour within walking distance of shops and restaurants in the Rocks. The rooms are well appointed with lovely bathroom and a balcony overlooking the harbour. The staff were very helpfull, the food excellent. The bar serves the best Caipirinha outside Brazil! Would recommend this place to anyone!", "Date": "November 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aspen, CO", "Title": "“Outstanding”", "Author": "snow1234", "ReviewID": "UR6120740", "Content": "My husband and I recently stayed at this Park Hyatt for 5 nights and loved it! The location simply could not be better. The service and concierge was outstanding and the food at the Harbour Lounge Bar and Grill (hotel restaurant) is incredibly fresh, creative and delicious. Our room (Opera King Deluxe) was very spacious with 2 balconies, sliding glass doors and a postcard worthy view of the harbor and Opera House. It was hard to leave the room. This is a fantastic urban hotel. I have traveled the globe and my husband and I both agree this is one of our favorite city hotels.", "Date": "November 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Location, Location, Location!”", "Author": "newspro", "ReviewID": "UR6006642", "Content": "We booked accommodations here based on recommendations from fellow travelers. There's no doubt that the Park Hyatt enjoys the best location in Sydney. It's why you book your admittedly expensive room here. After leaving through the hotel's rear door you're just steps away from some of Sydney's finest restaurants. And within sight and a short walk away, you'll find the handy Sydney ferries and a rail station at Circular Quay. Our king room, while not exuding the pure luxury of some other Park Hyatt properties inclduing their hotel in Tokyo, was good sized and comfortable although a bit dated. We really enjoyed the balcony with views of the world famous Sydney Opera House. With so many nearby local dining options we did not try the Hyatt's restaurant for dinner. We did have breakfast there one morning but it is pretty steep. $40 Australian for a continental and if you'd like made-to-order eggs with your meal, add another $5. We highly recommend a stay here and certainly enjoyed our five day stay.", "Date": "October 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Fantastic, totally up to date”", "Author": "kingsroadgal", "ReviewID": "UR5894024", "Content": "I stayed here with a little trepidation, because I was concerned that the hotel perhaps was just resting on its laurels. It has the most fantastic location in Sydney, but would the rooms live up to their high price??? I was really impressed. We stayed in the Opera King Deluxe room, a huge room with a stunning view over the Opera House. The room was really well equipped with an enormous king bed and fabulous bedding. What luxury to go to bed with that Opera House view every night. I felt truly lucky. The room was always well-stocked, and the bathroom was large and luxurious (and I am picky about bathrooms!!) The food at the hotel is great. Definitely try to go for a rate where breakfast is included. Normally, the breakfast costs $40 AUD per person, and even at that price it is worth it. It is only a continental breakfast, but it is delicious. Lots of cheese, wonderful breads, and even a berry custard which tasted lovely for breakfast. All of this in a serene room with a great view over the harbor, and the lovely Opera House. I loved starting my day there. Room service was also wonderful, and the food quality was high. Using the computer at the business centre in the hotel was not cheap, but was worth it. It was quiet and private for any personal matters I needed to take care of. I loved this hotel, and will definitely return. Only complaints - we had a bodyguard sitting in the hall near our room for some VIP's on the floor (don't know who). It was tiring always having to greet this guy, night and day. Also, our bill was quite a mess, with all sorts of incorrect charges, due to our having booked this through AMEX Fine Hotels and Resorts where there were some freebies that were not handled properly.. It took a while to sort through, but in the end was resolved satisfactorily. This is the only place to stay in Sydney.", "Date": "September 30, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“Welcome to the 80'S”", "Author": "westender", "ReviewID": "UR5876388", "Content": "This is a bad five star hotel and I sincerely rccommend that you don't stay there. If it wasn't for the views then this hotel would not rank so highly. The hallways and rooms are like industrial units. I always rate service above decor and this place has just about the worst i've experienced (for the money). The Hyatt is a souless building run by flashy young things with too much responsibility. If we had our our time again we would stay at the Observatory or Shangri-la.", "Date": "September 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midwest", "Title": "“When In Sydney, You Must”", "Author": "mikie12", "ReviewID": "UR5826391", "Content": "There may be more glamorous hotels in the world, but for all around comfort and location, the Park Hyatt Sydney cannot be improved upon. We have stayed in many stunning hotels, but there is something so captivating about this property, that although it is expensive, it is well worth the outlay. . Some years ago we were visiting Hawaii, and met some people that did a great deal of traveling for business. I remember being told that the Park Hyatt Sydney had a remote control to open the drapes while you were still in your bed. Crazy as it seems, that always stuck in my mind, and when we were going to be spending ten days in Sydney, I knew that was the place we had to stay. The Park Hyatt is in a great location in The Rocks area of Sydney. It is located right on the water of the harbor, positioned with perfect views of the Sydney Opera House, and walking distance to Circular Quay and most all points of interest. There are many fine restaurants just out the door facing the Quay. You will find restaurants serving everything from Italian, seafood, and Chinese food. No matter what you are looking for, this hotel is so convenient, it makes it the ultimate spot. The hotel is not a large one with just 160 rooms and suites ranging up to over 1200 square feet. The design of the building is curved, located at the edge of the Harbor Bridge. There is no doubt that it was shaped to fit into the scenery without being flashy. There is nothing about this hotel that is tasteless. It is simple elegance at its best. The lobby is total class! It is basically uncomplicated, all windows, marble floors and lovely artwork. It took just a short time to get checked in, as we were already reserved for 10 days. We had a standard room and were extraordinarily delighted with our accommodations. The room was about 450 square feet with a balcony overlooking the Quay and a pleasant panorama of the Opera House. The rooms are very luxurious with a king bed complete with all white linens, goose down duvet, and silk pillows and matching dust ruffle. It almost had an Egyptian feeling. The wall looking out on the deck is all glass. These are amazing because although it is quite busy in that area, you cannot hear a thing when the doors are closed. They are all double doors with double panes. Trust me, it is as quiet as you could imagine. We had a contemporary desk, large television, overstuffed chair, and Internet service in the room. Everything was simple and perfect. The closet was not just any closet, but probably the best one I have seen in a hotel. Not only was it a walk-in, but there were drawers, multiple shelves, and all kinds of places to put your things. The bathroom was very generous in size and amenities. It was all marble, had a glass shower, and a very big separate bathtub. The vanity was designed with two marble sinks and numerous drawers to stash all your cosmetics. Of course there was a hair dryer, plush robes, and tons of fluffy white towels. The amenities were the best lotions, shampoo, soaps, and of course even an emery board was included. Nothing was missing in this bathroom. The dining room is called The Harbor Kitchen And Bar. It has won many awards and the food is excellent. Everything is a la Carte, so it can get expensive. We ate breakfast there a few times, and dinner a couple of nights, but there are so many places to eat in Sydney we didnâ€™t want to just eat at the hotel. One very interesting thing about this dining room is it is right on the waterfront. Again, the glass theme continues, and the windows actually pull up so you have a feeling of being outdoors. There is also an intimate bar on the main floor. There is an excellent exercise facility, and the pool is on the roof. We enjoyed going to the pool, as it was usually not crowded and very cozy. You had the feeling you were in a place that few had visited. I love this hotel, and actually hated to leave. I find that this is the benchmark of all hotels we stay in. Although I have stayed in some that are fancier, this one takes the cake for class, but not snobby. The staff is friendly and we felt we were not so much in a hotel, but a home. The Park Hyatt in Sydney is an example of what a luxury hotel should be! And yes, there was a remote control for the drapes!", "Date": "September 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Magnificient”", "Author": "CuzICan", "ReviewID": "UR5773477", "Content": "Truly an exceptional property with the views being the strongest draw. Our room was on the 3rd level in the middle of the hotel and upon opening my eyes in bed , opening the curtains, there was the fabulous Opera House in full majestic view, so close it almost looked like I could reach out and touch it. We were in Sydney for the recent short hail storm and the sky before the storm was a multi-color hue of blues and oranges reflecting around the Opera House, just fabulous. The rooms are nice, elegant with marble baths and modern furnishings. We had 3 in the Opera View king and it was a little small but for 2 would be perfect size. Refurbishing the exterior hallway carpet, or a good cleaning, is the only shortfall I saw. The staff were all helpful, friendly and welcoming. A short walk from wharf, CBD and many restaurants. Worth every dollar of the cost.", "Date": "September 6, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sydney", "Title": "“Beautiful location, great hotel but make sure you get confirmation.”", "Author": "Sydney2", "ReviewID": "UR5530463", "Content": "We stayed at the Park Hyatt Sydney this weekend for my first anniversary. The hotel was in the most wonderful location. It was modern & very beautiful. Staff were exceptionally friendly & welcoming. We had a lovely weekend & didn't have to go far at all to enjoy the beauty of Sydney. An important note however please ensure you receive confirmation of your booking, including confirmation number, the room set-up and the view you are going to have. I originally booked the room through the internet. I printed off the confirmation page & was expecting an email confirmation as is common these days. After a few days of not receiving confirmation I called the hotel & was told I did not have a reservation. When I looked at the printout I realised that the panel on the right hand side of the page that had my confirmation details did not print. Only the main page did. I made another booking direct with the hotel (AU $50 a night more than the internet price) and was told that I was booked into a king room with a nice view. When I arrived on the weekend I was told by the concierge that we were in fact booked into a twin room. The only room with a King Bed was a Delux room. The hotel offered to upgrade us witha discount off the upgrade price but we still ended up paying AU150 an extra more a night. Being out first anniversary we took the upgrade. The room was very nice & we had a lovely view of the bridge & luna park. I would recommend this hotel to anyone. I would however also recommend that you have some confirmation of your reservation, room setup & view(note: rooms at the back of the hotel don't appear to have any view).", "Date": "July 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“memorable weekend”", "Author": "A TripAdvisor Member", "ReviewID": "UR5373313", "Content": "We had a delightful time being tourists in our own town with a weekend stay at this lovely, low key hotel with stunning views and charming staff. Well worth the expense for a weekend we will always remember.", "Date": "June 22, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Australia", "Title": "“The Ultimate special occasion”", "Author": "MissTravelAlot", "ReviewID": "UR5183435", "Content": "Stayed in this hotel septemer 2006. I had just sold my business, so wanted a special few days to celebrate. We statyed in an Opera King Deluxe Suite. It lived up to our expectations and beyond. If you want a view, this is the hotel. The rooms are great. The bathrooms are getting a little tatty there was some peeling wallpaper. But overall theyre marble and massive in size. The staff were beyond helpful without being intimidating. The only thing that didnt live up to the standard of the hotel was the day spa. They seem to have squashed it into some poky little rooms. Overall I would highly reccomend this hotel. The only one weve stayed in thats better is Versace on the gold coast.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cheltenham, UK", "Title": "“Understated, Classy, Unbeatable Location.”", "Author": "!!", "ReviewID": "UR5020024", "Content": "We stayed here for 5 nights with our 6 year old son. The Rolling Stones had checked out a day or two before we arrived. Car transfer from airport worth every penny. The exterior of the hotel is low key almost to the point of dowdy; interiors understated, classy but a little faded. This Grande Dame could probably do with a bit of a makeover but the location is unbeatable and dripping in 'wow' factor. Our room had a direct view of the Opera House. Spacious and well-appointed with plenty of room for an extra single bed. Breakfast in the waterfront restaurant simple but delicious although at times the staff seemed to struggle a bit with the guest traffic (we were there over Easter and the hotel had full occupancy). A leisurely 20 minute stroll round to the Opera House and then on to The Botanic Gardens. 5 mins from Sydney Harbour Bridge. Ferries to the Zoo, Manly Beach and others en route to Opera House. Museum of Contemporay Arts (currently showing the Sam Taylor-Wood exhibition) a short stroll away. The Rocks market on a Saturday is behind the hotel. Fantastic bars and restaurants within moments of the front door. Rooftop pool small but perfectly formed and a great place for bat-spotting at dusk. Cannot recommend highly enough. May not apeal to high-fashion style seekers as low on glam factor but unbeatable choice for seeing the sights and very child friendly. Undeniably pricey. By the way, we did notice that there is a very good-looking Holiday Inn tucked in just behind the Park Hyatt - prob won't have the views but also a fantastic location for seeing all of the above and no doubt a lot less expensive.", "Date": "April 30, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ocean Ridge, Florida", "Title": "“Five Star View”", "Author": "Rocket88", "ReviewID": "UR4717800", "Content": "We stayed at the Park Hyatt for 5 nights in March 2006 and here is what we observed: -There may be a nick or two in the furniture and it could use some exterior touch-up paint but make no mistake about it-this is truly a 5 star property. -The main reason you would stay here is the excellent location and the stunning knock-your-socks-off view of the harbour and Opera House. For this they get big bucks. But if you're not going to have a room with a view you would be better off staying somewhere else. -We stayed in balcony room 334 (top floor-level #4)and had a full straight-on view of the Opera House and a slightly-angled view of the downtown area. Most of the rooms to the left of room 333 (i.e. #332 down to about #300) have great city views but only a lateral view of the Opera House (everything over the hotel lobby is in this category) so if you want to sit on the balcony and take in the Opera House and the harbour views while having cocktails or pre-dinner snacks as we did every night you would have to lean over the railing and look sideways to see the Opera House. Rooms to the right of #335 down to around #354 have full Opera House views and partial bridge views but no city views. Rooms to the right of about #354 have only partial or no Opera House view. Rooms at the other end of the S-shaped hallway toward the bridge have Opera House views as well as bridge views. Then there are some rooms with just water views but without the Opera House or bridge or city. The rooms on floors 2 and 3 presumably would have the same setup but I didn't see them. The best thing to do is call the hotel directly on one of the \"dial around\" numbers like 1010987 and you can confirm for yourself the exact view of the rooms-it only costs about $2USD to talk for about 10 minutes. Don't waste your time calling the Hyatt toll-free central reservation number--they haven't the foggiest idea of the layout of the rooms or which way they face. The hotel's direct number from the US is 011-61-2-9256-1101. -Speaking of balconies, every third room facing the water has only a small semicircular balcony with no chairs or tables so if you plan on using the balcony on a regular basis you should consider the rooms with the larger balconies with furniture. Also, the top floor (level #4)balconies have a pergola-type overhang which lets rain and other things falling from the sky onto the balcony. If it's raining you couldn't use it and if it rains at night the chair cushions will be wet the next day. However, the balconies on the first and second floors (levels 2 and 3) have a fully-covered overhang from the balcony above. -The balcony rooms also have double sliding and locking glass doors which removes 100% of the noise of the harbour. -We arrived by cruise ship which docked at the overseas passenger terminal only a 3 minute walk away. I walked over to the hotel and got the bellman to come over in the hotel car to pick up our luggage and take it back to the hotel. -The hotel has a convenient location for many Sydney sights-10 minutes to the BridgeClimb office -5 minutes to the weekend market at The Rocks -20 minutes to the Opera House -10 minutes to Circular Quay -10 minutes to the Hero of Waterloo pub The congierge staff is first class-they can arrange the BridgeClimb or set up private tours to Hunter Valley or the Blue Mountains using their recommended guides and drivers. They will also make a heavy-duty electrical converter/adapter available for your appliances. -The only negative we found was the exorbitant price of breakfast. Easily to overcome-there are several sidewalk cafes in the Rocks and along Circular Quay that are a 5-10 minute walk away. Additionally, there are several lunch and dinner restaurants right outside the harbourside hotel entrance. -When going to the airport the hotel can set you up with their limo for $90 or you can just have them get a street taxi for about $40. -When checking in I asked for and received a further 10% senior citizens discount off the room rate. At these prices that paid for our wine tour to Hunter Valley. -In summary, this is all about location and 5 star views. I thought it was worth it. You'll remember the view the rest of your life.", "Date": "March 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cotswolds", "Title": "“best location in Sydney”", "Author": "cotswoldstraveller", "ReviewID": "UR4452218", "Content": "Park Hyatt Sydney â€“ stayed in October 2005 for 2 nights â€“ have stayed before and will stay again â€“ probably the best Hyatt Iâ€™ve ever stayed in and given itâ€™s stunning location probably the best high end hotel for tourists in Sydney â€“ the rooms are large and well equipped with many having the best views in Sydney. Itâ€™s a modern hotel but well done and the competent band attentive staff make it a really excellent experience", "Date": "February 11, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Lanarkshire, Scotland", "Title": "“Location, location, location”", "Author": "BryceCurdy", "ReviewID": "UR4410484", "Content": "Well actually 4 and a half out of 5. The location is simply unbeatable. I found the staff very helpful despite the comments of at least one other reviewer. Early check in was no problem and I had specifically asked for a good view of the Harbour Bridge which we definitely got. The rooms are excellent. We ate once in the restaurant and had a very nice if slightly pricey lunch. Only two criticisms. The rooftop pool is very small. There is only a total of ten loungers. Secondly some of the rooms (about a third) have only very small balconies with no seating.", "Date": "February 3, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "tauranga", "Title": "“Cool weekend”", "Author": "ithaki", "ReviewID": "UR4345291", "Content": "Have not stayed here for years but were impressed with our reception. An early check-in was no problem even though an early business meeting meant we did not require this. Divine room with balcony view onto the inner harbour. We stayed a long weekend and it was a delight to observe all of the weddings below when we were at our room. Despite the opening balcony doors the room was so quite and dark at night - easy to catch up lost sleep. Bed was divine and room extremely good value. As we love to walk a lot the bath was really appreciated to soak in at night. Next trip will use the excellent spa facilities. Staff were very helpful and pleasant but unobtrussive. Check in/out was very low key - much appreciated. We dined out with local business colleagues but you would be wise to check out the restaurant menu - excellent choices if you are gastronomically challenged. Looking forward to a repeat stay next month.", "Date": "January 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Altrincham, United Kingdom", "Title": "“Nowhere better on the Opera House side, but make sure you get the right room !”", "Author": "LawyerAbroad", "ReviewID": "UR4256272", "Content": "We stayed at the Park Hyatt for 3 nights in an Opera Deluxe King Room, and had a fantastic, if costly (c Â£375 per night), stay. It is the best positioned hotel in Sydney on the Opera House side. A real treat, though probably a one-off for a non-business traveller due to cost. The Views - be careful what room you get! This hotel's big selling point is its location off Circular Quay and the Opera House views. This was a special occasion and we wanted to be sure of a direct opera house view, so we booked (direct with the hotel) the \"guaranteed\" direct view of an \"opera deluxe king\". Unfortunately we arrived later than most and ended up with the poorest of that grade - and discovered that there are two \"bunches\" of this room grade in the hotel. The ones at the North end are the closest to the opera house and have the best and widest views often including the Harbour Bridge (PIC 1), but there are some at the other end, further away and whose views can (as we found) be partially obscured by visting yachts etc and other bits of the hotel (PIC 2). Sounds picky, but you pay through the nose for the view at this hotel, so make sure you hassle them for one at the north end! Thankfully, we were swapped to one at the North end after the first night. The rooms The rooms are absolutely fantastic with huge marble bathrooms, (good toiletries, bath and separate shower), and great entertainment system (Widescreen TV/DVD). The deluxe rooms also have a massive king bed which is extremely comfortable. Ours had the advantage of not having to get out of bed to see the Opera House at dawn (a must-do) Meals Food is excellent. The restaurant has the same great view, and the food was very good. Breakfast is superb - everything about it is superbly done, and the service was great. If you're a light eater at breakfast, you'll feel cheated - single items (eg if you wanted a glass of juice) were expensive, but the full buffet was around AUD$45 (Â£20-ish) which is cheap by London hotel standards. Room service was prompt and the food very good too. Swimming Pool There is a roof top pool, but frankly its too small to swim in ! Its pretty disappointing when you get up there and the view isn't as good as you think - the draw seems to be the jacuzzi on the roof which gives some kind of view, but that wasn't our cup of tea ! Service generally - Our one gripe.... Generally service was very good indeed - easily the best we experienced on our holiday. The concierge's desk in particular was excellent, whether it was stamps for postcards, couriering documents back to the UK, or just getting directions or a taxi. However, some of the front desk staff, in our view, need an attitude adjustment. Our inital request for a room change (above) was treated dismissively and unhelpfully by one front desk member, almost as if we were lucky to be staying at the hotel, rather than paying a hell of a lot of money for it. We were told that nothing could be done - very disappointing. Thankfully, in our case, the front of house manager sorted us out quite easily, suggesting that the problem was really one of attiutude and being bothered. Had we stayed in our \"old\" room, we would have had a very different feeling about our stay. Overall though, a very nice stay. Alternatives If you're after something at better value at Circular Quay and don't want to end up in a tower block like the Shangri-La or Intercontinental, the Quay Grand Suites {---} are often good value for a one-bed harbour view suite at about Â£240 per night. We stayed there on a previous trip and thoroughly enjoyed being at the heart of activity at Circular Quay. If you're not worried about being on the Opera Harbour front, there are several good hotels at Darling Harbour (not as far away as you might think) which also have good views. We stayed 3 nights at the Four Points Sheraton in a Maritime Studio room for under Â£420 for the whole stay inc breakfast - I've done a separate review of that. If we go back, we're staying there again, it really is superb - as good as the Park Hyatt for everything except a direct view of the opera house. Have a great time Michael PS We also stayed at the Sebel Pier One (another review)- my advice, don't bother.", "Date": "December 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Best hotel in Sydney”", "Author": "MasterGee", "ReviewID": "UR4158204", "Content": "An unbelievable location (across Circular Quay from the famed Opera House), excellent service, and all the comforts you expect from a top notch hotel make this property one of the very best in Sydney. I absolutely love this place and would go back in a heartbeat.", "Date": "December 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Best Location - Opera View Suite”", "Author": "Ricanth", "ReviewID": "UR4138681", "Content": "Great Location. I have also stayed at the Intercontinental Sydney and while the Club floor has a great view, the Intercontinental does not compare to the Park Hyatt. My wife and I got an Opera View Suite which was around 600 SF. Two balconies with great views. One of the coolest things was we cam home back from dinner at Otto's (I recommend) and there was a Michael Buble concert at the Opera House. We were able to listen from our balcony while having some wine. The food was OK and very expensive. I recommend walking around the corner to Pancakes on the Rocks and getting some Chocolate Pancakes with Ice cream and strawberries for dinner. In addition there are cafe's all over the Rocks District. The workout facility was clean and while it had limited equipment, there was noone using it, ever. Go to the Rocks Market on Saturday/Sunday from 10AM-5PM for great souvenirs.", "Date": "November 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“what a view!”", "Author": "kazpalms", "ReviewID": "UR3991823", "Content": "we arrived at the Park Hyatt after a dreadful journey via Los Angeles. What a delight to arrive in our harbour view room! We were blown away by the sheer scale of the room, the view and the comfort. Our two children had an adjoining room, smaller but with much the same view. Our room was just fantastic though - two balconies, enormous, deeply comfortable bed and beautiful bathroom. We found the staff unfailing helpful, esp the concierges, and always went out of their way to help (even provided us with the name and location of a local launderette so we didnt have to pay hotel prices for laundry!). Restaurant staff v helpful at breakfast (we ate out at night). Ideal position in the Rocks area of town - can walk to Opera House and harbour for ferries and otherwise excellent bus connections. We loved Sydney and would love to return and would def stay here again.", "Date": "October 4, 2005"}], "HotelInfo": {"Name": "Park Hyatt Sydney", "HotelURL": "/ShowUserReviews-g255060-d256618-Reviews-Park_Hyatt_Sydney-Sydney_New_South_Wales.html", "Price": "$718 - $887*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7 Hickson Road</span> | <span class=\"extended-address\">The Rocks</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2000</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "256618", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6f/47/6f470d3233570dc798bcb5103bc9cc477large.jpg"}}