{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Poole, England, United Kingdom", "Title": "“Good location, ok as basic family hotel”", "Author": "Lisa B", "ReviewID": "UR128293409", "Content": "Good position, near China Town in Sydney. Close to Darling HArbour which was great. Family room was good size, seperate bedroom, single bed in lounge area, plus seating area. Staff helpful. A little tired. But good as a basic hotel from which to see the area.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“comfy bed, small bathroom - didn't listen to room requests!”", "Author": "redlexus07", "ReviewID": "UR127266269", "Content": "I booked a room in the Metro Central Sydney through TravelZoo - we got a great offer of $105 per night. I checked the reviews on here & it seemed just like what we were after - good location, basic room. After reading the reviews on here, on my booking I requested a room high up & facing the street so we would get a quiet room with plenty of light - we actually got a room on the 3rd floor facing another wall - there was a small courtyard in between. Anyway, it was fine for us but the room was very dark as there are only two small lights above the beds & a light in the little hallway. There was a double bed & a single bed. The bathroom was small to average size, but the shower was quite low down - it was just about ok for me & I am 5 foot 6 - also there was not much room in front of the toilet so you had to sit to one side...! The fire alarm actually went off at about 11pm on the Saturday night & went on for a while - there was no comment about this when we checked out. We did not spend much time in the room apart from actually sleeping & we did not eat at the hotel so could not comment on the breakfast offered - although it looked like a good deal - $15 for all you can eat buffet breakfast. There is plenty of restaurants & pubs nearby as well as being close to central station & plenty of bus stops.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "canberra, australia", "Title": "“Bad Choice”", "Author": "squishy_9", "ReviewID": "UR127266107", "Content": "This hotel is close to central station. Thats about all it has going for it, the rooms need a serious update and proper clean, my bathroom had hair dye stains all over and mould. The paint was peeling from the walls. The room temperature was unable to be adjusted so they had provided a small heater- totally unacceptable! I also got bitten all over my back by something whilst sleeping.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Convenient location in the City”", "Author": "dooragan", "ReviewID": "UR127189445", "Content": "There are two Metro's on Pitt St - this one is closer to Central Station, which makes it very well located. Close to theatres, Chinatown, nightclubs, light rail (easy to get to the Convention Centre, Casino and Entertainment Centre) and Central Station, location is everything. Capital Theatre is just around the corner as are buses to just about anywhere.Â  Reception was professional, fast and smooth. Obviously popular with large tour groups, staff had check-in and out down pat.Â  Interestingly, some reviews complain about rooms but my 4th floor room was excellent. Recently refurbished, it was a gem. The ultra-modern make-over was impressive. While not large, the space was more than adequate - EXCEPT for the toilet! Almost had to have the extraordinary dexterity and skill of Harry Houdini to sit and fit your feet between bowl and the wall - tiny and cramped does not adequately describe the severe lack of space. It is quite comical until one has to use the amenities.Â  Sleep quality was very good even though my room fronted Pitt St. A little noise from the hall was all I heard during my one night stay. I didn't dine nor use any other amenities so can't comment.Â  Would I stay again? Yes, but not for more than $140 - there are better options in that $$ range closer to Town Hall and the main CBD.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bracknell, United Kingdom", "Title": "“Worst hotel I've stayed in - Prison Cell”", "Author": "Yvonne68", "ReviewID": "UR126935304", "Content": "When I looked at the room on the internet it looked lovely but when we got there it was the worst room I have ever stayed in. It was a PRISON CELL room 322 next to the lift it overlooked a brick wall there was no daylight and no sunlight coming in at all. 3 tiny lights 1 each side of the bed and a table lamp that's all. No soap in the bath or sink. Wardrobe door was falling off. No room to put your luggage. Bathroom was tiny. When I complained to staff - was told hotel full of either Japanese or Chinese due to Church convention. Wasn't interested in changing our room. Not value for money Â£285 for 3 nights. Also room key wouldnt work had to have it re-programmed 3 times. No car parking facilities. Staff not helpful at all. Stayed in backpackers hotel in Surfers and had a 1 bedroom apt. brilliant.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bromsgrove, England", "Title": "“Good choice for a short break in this vibrant city”", "Author": "Kule Dude", "ReviewID": "UR126899346", "Content": "Had pre-booked, and paid in full (by debit card), a Junior Suite - i.e. a large bedroom with double bed and a large, separate, sitting room with single bed for our adult daughter. Check in was fine, with a swipe taken from my debit card, \"for any further expenditure\". One of the three lifts was out of action (being refurbished) and other two, at times, seemed to have their own idea of where you wanted to go! Our room on the eighth floor was very good - clean, airy with reasonable views. Shower over the bath and plenty of towels. Large lcd TV, tea and coffee facilities and a fridge. On the first morning we had the hotel breakfast ($15 p.p.) - a good selection of hot and cold food, tea & coffee etc. On our other two morning we had breakfast elsewhere and on reflection, the hotel was probably the best value. Check out was fine - fast and efficiet paid cash for the three single breakfasts we had taken and Receptionist said my debit card swipe would be deleted/destroyed. They stored our luggage in a locked room until we collected later in the afternoon. And now the not so good.... On arrival home in the UK I found the hotel had made a further two charges against my card, totalling $270.00, this on the day after they said they had destroyed my details! I emailed the hotel and they did refund the amount they had taken from me - although they had had my money for almost three weeks! I also had to go through the tedious process of changing my debit card and pin number (i.e. a week without my card). So - hotel good - \"paperwork\" dubiuous. Take care when booking.....", "Date": "March 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Very disappointed.”", "Author": "KCLAR", "ReviewID": "UR126722258", "Content": "No lighting in rooms ...except for two dim bedside lamps. Very depressing ... Dark, stuffy and small. Had to move rooms after first night as could not shower with only extremely hot water in shower and no cold at all. Exhaust fans not working in either room. We had two superior triple rooms and all had trouble sleeping because of mattress springs ! No where to sit together and chat ....dining room area only open for breakfast. We found an outdoor courtyard area but it was only open over breakfast hours? Lifts were terrifying and were told there was no stair option! Positive... location is good!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Sydney March 1, 2012”", "Author": "C N", "ReviewID": "UR126566175", "Content": "The location is fantastic, however the staff was not at all helpful. It was like pulling teeth to get answers. The rooms were fair. Don't think we would stay here again due to the price.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Excellently located hotel”", "Author": "Navy35", "ReviewID": "UR126066189", "Content": "As others have said, this hotel is very well located. Others have spoken about the location, so I will not repeat it, other than to say that Central railway station is less than a 5 minute walk. So getting to and from the airport and indeed around Sydney is a breeze. I could not criticise the room at all. This is not a 5 star hotel and the price does not reflect a 5 star hotel. So do not expect a 5 star room. Having said that though, my room had a queen size bed, reasonably sized tv, good size bathroom and bath, iron and ironing board. The bed was very comfortable. I could not fault the room I was in.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, excellent for the price”", "Author": "Schumi5", "ReviewID": "UR126017019", "Content": "Location wise you couldn't get any better. close to Haymarket, lightrail and George St. Most things within walking distance. Rooms were good, clean, and staff very friendly. For the price you pay there is certainly no complaints from me", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good location.”", "Author": "NortiusMaximus", "ReviewID": "UR125985121", "Content": "Location is very good. Walking distance to light rail, paddys market, monorail and central station. Bed is comfy and room well equipped with fridge, good size tv, iron, kettle, etc. Bathroom has bath and is an acceptable size. Biggest complaint is that room is very poorly lit. Has only 2 bedside lights and 1 in the entry. Room is very dark if you have an room that looks onto the back wall. Pool wasnt very clean during our visit. Also its not heated. Lifts are being upgraded at this time, so expect a long wait at anytime you need them. Also, no free wifi. Breakfast was good, with a large selection of cereals, fruit and hot food.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "canberra", "Title": "“Borderline Average”", "Author": "john w", "ReviewID": "UR125640157", "Content": "This was the first time i'd stayed at metro sydney central.Having stayed at thier other hotel(metro on pitt - 300 pitt street)in the past and was happy with it,I thought this would be a safe bet as I couldn't get the 3 nights at metro on pitt.However.......the location is more or less as good,the staff were friendly and check-in and check-out was very easy,unfortunately this is where the positives end. The room while clean was average at best.I'd booked a standard double,but was given a room with 2 single beds (with the most uncomfortable lumpy matresses i'v ever jad to try and sleep on)instead of a double bed which is clearly shown on the website.The shower facilities were horrendous,the shower itself is inside the bath and if you're over 5ft tall you'd bang your head on the ceiling everytime you got into the shower.Don't even try to lift your arms to wash underneath unless you want to end up deformed,this act is virtually impossible.The towels were really hard and scratchy and only 2 per day supplied.Lets face it when you're in sydney you're likely to go out at night,so are going to want to shower at least twice a day,plus wash your hair,which meant you had to use the same towels more than once.More towels please. Tea/Coffee facilities was useless to me as there was no sachets of de-caf,so if I wanted a coffee I had to walk to a nearby cafe and get one made in a paper cup - yuk! For $200 a night it wasn't that great. The hotel does live up to it's 24hr reception fully though as the hotel is open 24hrs with the front door open until very late,many sydney hotels claim 24hr receptio but then close thier doors at 10pm or so.On a couple of occassions I had to get my key card re-accessed so I could open my room door,if i'd've had to do the same to enter the hotel's main door late at night I wouldn't have been impressed,soI will give them kudos for a REAL 24hr recption. Would I stay here again,probably not.For the price and what I experienced I'm not sure it's value for money", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cheap, central”", "Author": "bendalong", "ReviewID": "UR123944198", "Content": "Basic hotel accommodation in Sydney. Opposite the Capitol Theatre and a short walk to China Town, Paddy's Markets. The light rail that goes past Darling Harbor, the casino and the fish markets is just about on the doorstep. Staff are courteous and professional. Room was a triple single. Clean and basic. Bathroom was a little cramped with a broken door that looked like someone had tried to break the door lock, there was also some mould in the top corner above the door. Beds are wearing out slightly as I could feel just about every spring and it was an uncomfortable sleep. Despite central and busy location, room was very quiet and peaceful. Would I stay again? Yes, I would recommend if you wanted a basic and central hotel. Cheapest to book online on their website.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Good location”", "Author": "CB_Aberdeen", "ReviewID": "UR123822421", "Content": "Recently stayed 3 nights here. Very central location, walkable to Opera House (40mins) Bridge/Circular Quay (30mins), Darling Harbour (20mins). Loads of nearby restaurants so pretty handy. The rooms were comfortable but were slightly tired looking. Initially staff didn't appear too helpful but later on they seemed to improve- able to store luggage etc ok. Our room didn't have any bath plugs but one was provided on request. All in all a reasonable room for the price and in a great location.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide", "Title": "“Great value and location”", "Author": "mrdriverAdelaide", "ReviewID": "UR123522609", "Content": "My daughter and I travelled to Sydney for a short holiday to see the Harry Potter Exhibition. Looking to stay within a reasonable walking distance of the main attractions of Sydney, as well as staying within a reasonable budget, the Metro Hotel Sydney Central came up trumps. Some of the reviews I read casted some doubt, however I was not disappointed. The room was on the 8th floor, twin share, with an ok view, but most importantly was neat, clean, and set out with modern decor. Good TV with free Foxtel/paid movies, small fridge, tea/coffee facilities. I thought the charges for wireless Internet were a bit steep, but I did not need this anyway. The bathroom was ok, but is in need of an upgrade. Staff were courteous friendly. We did not eat in the hotel at all, so can't comment on this service. The room was made up as expected; even providing clean towels when we left them hanging. All-in-all I have no problems recommending this hotel. I booked online with a 3rd party website, and would recommend doing the same, or try using a promotional code on the Metro's own website to get the best price.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pulau Penang, Malaysia", "Title": "“Good Central Hotel in Chinatown”", "Author": "tastyjuice007", "ReviewID": "UR123213007", "Content": "This hotel is located in a very good location, right in Chinatown - extremely near to food shops, supermarkets, Chinatown shops - no issues finding nearby amenities. Good location for tourists as it is walking distance to some tourists attractions (e.g. Paddy's markets, Darling Harbour, City Centre), and is near to bus stops to further areas (e.g. Opera House, The Rocks, Harbour Bridge). Hotel rooms I stayed in was a standard room (either 1 double bed or 2 single beds). Has TV (with limited cable), kettle, cups and glasses, coffee and tea, table with mirror, bathroom, and basic facilities. Comfortable room. Though, I felt that the room lighting is a bit too dim at times (with no overhead lights, only table lamps). Bathroom feels small and I had to bend down to reach the taps (not ideal for people with bad backs). Otherwise, room was clean and tidy. Good value. I also paid for the morning breakfast, which was decent but wasn't great (it was buffet style with limited variety of food - got sick of eating the same food after a few days). For business trips, etc. - Internet is not free, you have to pay a certain fee for it. Pros - good value; extremely good central location; clean, basic rooms; basic room facilities present; helpful staff Cons - small bathroom; need to pay for Internet access; very limited choice for breakfast", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Steps from Chinatown, CBD, transport and markets!”", "Author": "sarebear007", "ReviewID": "UR122850107", "Content": "This hotel has a great location, one block up is a shopping centre with a supermarket, food clothes etc.. Paddy's market and chinatown is in walking distance, as is the Capitol Theatre and entertainment centre. Transport is all around as well as cheap restaurants and pubs. We stayed here for NYE celebrations had no views of fireworks but we were in walking distance to Circular Quay where we had tickets for an event, the walk was about 15 minutes but this was fine, was pratically a straight line down George Street The room was clean, bed comfy and tv worked, staff were good they refreshed coffee etc straight away when we asked I would stay here again", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value, comfortable hotel.”", "Author": "Pedro1982", "ReviewID": "UR122699758", "Content": "Great value for money. Great location. The bathroom looked very old and used, the whites of the bath were all stained brown from years of use, I think they need a revamp. The main room was good, the beds very comfortable. Wifi was available, but you have to pay for it which was annoying. The pool on the roof was really small, but good for messing around in. Nice hotel, I would probably stay again.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great location; If only the staff were friendly...”", "Author": "skis-gitz", "ReviewID": "UR121724454", "Content": "We are regular visitors to Sydney and chose this hotel for its location which is a stones throw from Chinatown, Capitol Theatre, Central Station, cinemas and shopping. The rate for our double room was very competitive, however, judging by the supposedly 'recently renovated Superior room' and overall hotel facilities and services, the 3.5 Star rating is bit of a stretch of the imagination. The room standard was more like a 2.5 star quality. That being said, we would have been happy if (a) the FOH staff were friendlier, (b) internet was complimentary and (c) room food service was available. On both check-in and check-out, the reception staff were cold and unwelcoming. No smiles, no warmth. The only smile we experienced during our stay was the asian chap who welcomed us to the eat-all-you-can breakfast. Indonesian and thai food up Pitt Street in the same block as the hotel is fantastic! If expectations are lower, then perhaps this hotel will satisfy. However we had booked a newly renovated superior guestroom in a supposedly 3.5 star hotel and it failed to meet this standard in our opinion. We frequent 3 to 4 star hotels, so we know what to expect generally. But all in all, had the staff been warm and friendly and free internet available, we would have been quite happy.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "England", "Title": "“DO NOT RECOMMEND!! HIGHLY DISAPPOINTED”", "Author": "Charlotte453", "ReviewID": "UR121435892", "Content": "Where do I start!! ..Probably better standard in backpackers and that would be half the price, I was there for 6 nights and wanted to move straight away!.. When I first got the hotel I was put into a double room, when i went up to the room, I was highly disappointed! The staff are VERY helpful, and I actually changed rooms three times after complaining i was given a newly refurbished room which was better standard than the other rooms! The first room I got put into was tiny and facing a wall! The carpet was dirty, no overhead lighting, you cannot turn the air con off, the carpets were stained ... the bathroom, was gorse with cracked tiles and filters hanging off the wall. There were big chips out of sink and bathtub, there was mould on the ceiling, above the shower, the toilet you would have to manoeuvre around the door to use, and the shower head was hanging off. When I went down to the so called breakfast I was once again highly disappointed the food was barely cooked, when I got down to breakfast at 9 am most of the food was cold and barely anything there. and tasted horrible, not the stranded I was expecting! Found a lovely little cafe down the road you get twice as much for the money you pay for breakfast there! The pool was tiny, unclean, and mouldy and you got to it though through a fire escape, it had a massive crack on the side of it, you couldn't have paid me to get in that pool. It had 4 old plastic deckchairs for the whole Hotel. The rooftop looked over the street where there was building work opposite. Very noisy. I will NEVER return to and DO NOT recommend, room was disgraceful, worst hotel I have ever stayed in. The only thing good about this hotel is its central location in Sydney and the staffs were very helpful.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good for what we needed.”", "Author": "novice_traveller07", "ReviewID": "UR121375504", "Content": "I stayed in those hotel in 2010 with another friend for an impromptu girls weekend. We greatly enjoyed our stay, the room was clean, the beds comfortable and the bathroom adequate it is within easy walking distance of both a train station and the monorail which can you basically everywhere else in the city. Or you can get to Darling Harbour in about 20 minutes walk. The staff were very helpful and quite knowledgeable about the local area and help me to organise our transport back to the airport (which at $14 per person was a lot nicer than the $50 cab fare we paid to get there! If you are looking to go to something at the Capitol Theatre, you literally could get any closer, it's around the corner! The only downsides are that the area itself was quite quiet and a little seedy but nothing we couldn't handle or that made us feel unsafe at any time. The room was a little bit tired and the decor a bit old, but it was nothing I didn't expect for the price. I booked on wotif.com after all.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“The Price is Right”", "Author": "AsiaLad", "ReviewID": "UR121116055", "Content": "I stayed here alone for three nights on a business trip to Sydney. The hotel was picked for me by an economically minded associate in Australia. Well, you get what you pay for, and this was a good hotel for our needs. Very centrally located, an easy walk from Central Station, and about a 30 minute stroll from Circular Quay. The area has a few backpacker accommodations nearby which means that there are some cheap-eat places and a laundromat in striking distance too. The room was very basic, but fairly clean and well maintained. I was on the 10th floor (I believe 1013) and the room had two double beds and a TV. The bathroom was fine, good water pressure and quite clean. However, my colleague had a room (506) on the 5th floor (which I think was a smoking floor) and his room was in MUCH worse shape than mine. There was an enormous burn stain on the floor near the bathroom, and the overall feel of the room was much more 'worn'. There is no minibar in the room, though there is a small fridge. There is a vending machine in the lobby with all the minibar staples. There are plenty of convenience stores in the area. I bought a WiFi package while I was there and that worked fine, and it averaged out to about AUD 10/day. Breakfast was not included and we didn't feel inclined to try the $15 all you can eat breakfast buffet. I found the staff to be very helpful. 2 points to consider. (1) There is another Metro Hotel on the same street (300 Pitt) so when you are giving directions to someone, you have to specify the cross street (Campbell). (2) There do seem to be some renovations going on there at the moment. In the morning I would hear the sounds of vigorous duct-taping in the hallway, and by the time I left for the day, parts of the hallway were marked off and some sort of work was being done. If you're on a budget and want to be centrally located, this hotel could be ok, so long as you get a room that has been recently renovated. Just don't look to go impressing anyone with your digs here.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Good hotel and location”", "Author": "lucytiogh", "ReviewID": "UR120724447", "Content": "Right in the heart of China town for lots of good restaurants and handy to the city.Rooms a good size and friendly staff.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Byron Bay, Australia", "Title": "“Will never stay again”", "Author": "traveller_82_11", "ReviewID": "UR120720948", "Content": "I had stayed at Metro on Pitt before and loved it and since that hotel was sold out, I chose to stay at Metro Sydney Central instead. The good- the staff are polite and friendly. The location is close to Central train station and walking distance to lots of attractions in Sydney. The room I had was clean and tidy and the bed was comfortable. The bad- The room's window faced other rooms, and the curtains didn't close fully. In the morning, half an hour before check out, a cleaner knocked on the door asking if we were going to check out. I could hear a lot of noise in the hallways at various times during my stay. The TV reception was bad on the cable channels. The worse- I paid for my room through Metro's own website 2 weeks before my stay. I was charged a second time for my room upon arrival, without being told I was being charged for the room again or signing for a payment at all. After notifying the staff of the payment error, it took 6 days before I received my money back. The staff I spoke to were polite about the situation, however, I felt like I had to chase up my refund because I was not told how long it would take. This situation put a dampener on my whole trip to Sydney. I emailed the hotel to offer feedback about this but have not heard back from them in 3 days. I will never stay here or another Metro hotel again. I feel that they don't value their customers and I am extremely disappointed in my stay there.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Macquarie, Australia", "Title": "“I now stay here all the time.”", "Author": "montanadancer", "ReviewID": "UR120525260", "Content": "I have stayed in many more expensive and lavish hotels in Sydney but the Metro ticks all the right boxes for me. The front desk service is always efficient and friendly and at times I have been able to check into my room by 1100 hours if it is available. The rooms themselves are clean and definitely adequate for business or tourist needs. Beds are very comfortable, there is an iron and ironing board in the cupboard and hairdryer in the basic bathroom that consists of a bath with shower above. What else does one need when the sights of Sydney are within walking distance. The rooms themselves are very quiet and I have never been disturbed by other guests or undue street noise. Value for money in an increasingly expensive city is great. Walk a few blocks north and you are in the heart of shopping or one block west and immerse oneself in Chinatown. Central station is a mere 5 minute walk away, Surry Hills restaurants an extra 5 minutes. Whenever I stay I see people from all over the world and they do not look disappointed.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location”", "Author": "lake0ne", "ReviewID": "UR120488972", "Content": "Located in the Chinatown district of Sydney, the hotel was in a very good location - walking distance to Sydney harbour, Darling harbour and other must see places in Sydney. Helpful and attentive staff, however the hotel could do with a little modernising. The room we stayed in had a draft and was a little on the cold side even with the air conditioning firmly off. However if you are planning on going to Sydney for a few nights and in the hight of summer, a good hotel to stay in.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Gold Coast", "Title": "“Didn't want my feet to touch the floor”", "Author": "nuttie16", "ReviewID": "UR120439493", "Content": "The hotel is in great walking distance from Central Station which was great as we arrived on a 9pm flight and caught the airport train. Was positive as we entered reception as it looked neat, tidy and well presented. Our room was on the 4th floor and I started to worry when walking down the hallway. The ceiling had damp patches, paint was cracking off the walls and the carpet was lined on both sides with water damage so old it had started to grow mould. The room didn't get much better. It was like stepping back into the 70's. Horrid bathroom with lots of rust stains around the tap handles, old dirty tiles and no exhaust fan. There was a large water damage area on the carpet at the enterance to the bathroom. No self controlled air conditioning in the room - this is a must for every city hotel these days. By the time we settled in it was 10:30pm and we were leaving by 7am. Surprisingly the beds looked very clean with no stains, clean sheets and tidy appearance. We quickly showered, jumped on the bed so our feet didn't touch the carpets and went to sleep. Ooh and no toiletries in bathroom. Woke the next morning and opened the curtains to looked straight at a brick wall. Couldn't tell if it was sunny or raining. Quickly got dressed and left. For the $125 for the night, I could have booked a private room in a hostel/backpackers that would have been better. Stay away from this hotel - with the variety available in the city there are so many better places that are modern, clean and well presented. Good location - but on this occassion there are many hotels around.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Easy transport and shopping”", "Author": "desire348", "ReviewID": "UR120415531", "Content": "Stayed 4 nights for a biz trip, I stayed on the 10th floor facing the main road. The room is quite new with bathtub and the room is very clean. Just tat the traffic on the road can still be heard during wee hours. The breakfast can be quite boring with the same food for 4 days. The location is good given the monorail, lightrail is just behind, paddys market is very nearby. Central station just few minutes walk away.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“Convenient Location to Central Railway and Interstate Bus Station”", "Author": "CanberraWanderer74", "ReviewID": "UR119846972", "Content": "This hotel is conveniently located for the above travel. It is also close to the Tram service, which is now included in the Senior/Pensioner Concession travel fare, and normal bus transport in George St. Rooms were a reasonable size for overnight stays and a quite location for a good nights sleep. Breakfast was not tried on this occasion but is available on 2nd floor.Would stay at same location again if the price is right.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“What you pay for is what you get”", "Author": "queenp108", "ReviewID": "UR119496175", "Content": "This hotel is well located and cheap for the Sydney CBD. The rooms are tiny, and fittings are cheap and tired (other than the tv), but the beds are comfortable, the room is reasonably clean and there is plenty of tea and coffee, plus the fridge is handy. I liked the complimentary newspapers too. Had no problems with the lifts at all. The staff are very friendly too. If you are looking for a comfortable sleep on a budget, then you will be happy here.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Tight fit”", "Author": "angelbarclay", "ReviewID": "UR119273532", "Content": "My sister and a friend wanted to see Sydney before they flew back to NY. We booked a room at the Metro Hotel Syndey Central because they would accommodate the three of us along with my one month old son in one room. Unfortunately, three single beds in one room didn't leave much room for the pram, much less the luggage. The beds were on casters that didn't lock, which made it a bit hazzardous to sit on, and were very uncomforable. The bathroom was a bit sketchy, but it served it purpose for the two nights we were there. My biggest gripe about our stay was that as soon as we stepped off the elevator on our floor, there was a strong smell of cigarette smoke, eventhough there was a sign clearly stating that it was a non-smoking floor. With all that said, as it's name implies, it is centrally located and a few minutes walk to Darling Harbour and Paddy's Market, as well as some nice places to eat.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Handy location to everything CBD, pity about swipecards, carparking costs”", "Author": "peterawiri", "ReviewID": "UR118630589", "Content": "We stayed three days , location is fantastic for Central station, Paddy's market, World Tower, Oxford St and Hyde Park. Room was clean, cleaners were lovely and very helpful. PITY ABOUT - THE SWIPECARDS NOT WORKING IN LIFTS with reception staff doing little about it until prompted or complained to - they must know about these problems but seemed indifferent. We encountered this on at least 20 occassions with many other guests, all of us riding up and down floors unable to either stop at our own or reach the restaurant on level 2 or move beyond reception floor. Similar occurences with room door swipe card entries. Surprising as I've never encoutntered such randomness with swipe cards anywehere else. - Car parking at $30/day without hourly rate option was also disappointing...we didn't want to buy shares in the carpark, just wanted 2 hours parking for a visitor. - Didn't try the $15 brekkie restaurant as many other local retail food options available within 1-2 city blocks. Handy to local bars/pubs for inexpensive dinners. - Window view from Room 1002 was only into office blocks next door where we could clearly see people at their desks and contents of their PC monitors. We'd stay again but wouldn't pay more than AUD100/night which we got via wotif. Nice though to have received a bottle of wine per booking (we had 2).", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great location and decent room”", "Author": "inlilystime", "ReviewID": "UR117110826", "Content": "The location of this hotel was amazing, within walking distance to everything we wanted to see and close to the monorail to get to Darling Harbour. The hotel itself was nice. The staff were helpful - organising our airport shuttle etc - and the cleaners were so nice and accommodating. Our room was clean and comfortable, though we had a view of a giant brick wall :( The only thing I didn't like about the room was the bathroom, with some yucky tiling \"fix ups\" and marks on the bath tub. Also, there are 3 elevators in the hotel and on the day we left only one was working. This made it very hard to get down to the lobby as everyone was checking out at the same time and the elevator was always full. I'm claustrophobic, so I had to wait a while in order to not have to squeeze in with heaps of other people.", "Date": "August 23, 2011"}, {"Ratings": {"Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“value for money?”", "Author": "DoubleAK", "ReviewID": "UR116657522", "Content": "We've stayed here several times over the past year for business (until we moved to Sydney). Location to Central Station and on Pitt St. is great. If you are staying in the upper floors in the superior upgraded rooms, this hotel is good. However, lower floors feel like a completely different hotel, comparable to a youth hostel! Old, uncomfortable, dark rooms and if you're on a smoking floor you really notice it. Stay up on the higher floors and it is just fine, almost nice.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Kew, Australia", "Title": "“Overpriced”", "Author": "novatotiv", "ReviewID": "UR116290427", "Content": "Very small rooms - even the superior ones. Very few showers that are not over baths. I was advised that only the corner rooms had walk in showers - and they were not superior. Though I had been given a price for a superior double/double room (when I booked six months ahead) and ended up in a pokey double/single room, I was still charged the same price. The major draw for this hotel was its proximity to the Capitol Theatre. That is where it excelled!!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Solid little hotel with a of hiccup.”", "Author": "Taezar", "ReviewID": "UR116055089", "Content": "I managed to get a very cheap room here (for the location and quality of room) as part of a package holiday. Given the mixed reviews I was a bit hesitant, but for the price I decided to go for it. The location is excellent. I had no issues getting to or from the hotel and has everything you need close by (including a Coles). My room was very good for the star rating. Bed firm, room a decent size, incredibly clean, TV worked, fantastic water pressure (including hot), and as I was on the 12th floor and away from the lifts, it was a solid night's sleep. I tried their $15 breakfast, given that last time I was in Sydney I went to a cafe and paid over $20 for scrambled eggs and a pot of tea. There was decent food and a lot of it. Lots of choices too. Further more, if I hadn't have asked for someone to pay the money too, I could have had it for free, as their system of seating people and checking room numbers is not at all thorough. However, when I first checked in, I was given my key card only to discover upon opening the door that it was a smoking room. I was nearly bowled over by the smell. I immediately returned to reception only to be informed that all standard rooms are smoking rooms. I had to cite health problems before the reception staff member agreed to move me. I have since checked the Qantas Holiday site - no mention of it being a smoking room. I even checked their own site which does not state this fact. Other than this hiccup, I had a good stay and would happily stay again - as long as I could specify a non-smoking room.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Average”", "Author": "melb7", "ReviewID": "UR115953035", "Content": "This hotel was booked for a group of us by a travel agent. Despite requesting non-smoking rooms we were all placed on the smoking floor and the reception staff were reluctant to move us. I had to really complain in order to be moved and was made to feel like I was creating a real inconvenience as there were no rooms free elsewhere. Well that obviously wasn't true as they were able to move me to a higher floor (which thankfully was also much quieter since it wasn't facing the street), and them others in my group even managed to get a room upgrade. It isn't very close to the train station either so you wouldn't want to be walking up from there with much luggage after a flight and the train from the airport. Overall it is ok. Basic but clean enough. Would suit people who just need somewhere to sleep and want to be close to all the nightlife nearby.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good Stayed last month”", "Author": "Fermamss", "ReviewID": "UR114949458", "Content": "Location is excellent ,no heating though, gave a small electric fan heater - it worked well enough,it's near the train station,but the price is high for a 2-3 stars hotel.The room is clean but a little small. Staffs are nice and helpful.But overall,i love this location and restaurants and shops around. I don't need to worry if i am safe walking alone on the street. there are lots of bars and people around even in the late night.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Bangalore, India", "Title": "“Great Location but above AVG. hotel and service not so great”", "Author": "Medapati", "ReviewID": "UR114854121", "Content": "Stayed in this hotel for about 10 days and the location was absolutely great and convenient for commutation, restaurants & sightseeing. No free internet in rooms, no room service, breakfast was expensive. Staff were OK to deal with but not particularly helpful or bad, just the kind of duty-bound. Rooms (31x series) are small but convenient and comfortable.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Singapore", "Title": "“Great Location, Affordable, Friendly Staff”", "Author": "Rathiy", "ReviewID": "UR114678312", "Content": "We stayed in the hotel for 7 days and 6 nights. The hotel was in a great location. Points of interest such as Paddy's Market, Chinatown, Darling Harbour and the QVB were all within walking distance. The Central station was less than 5 mins away. Capitol Theatre was across the road and there was a light rail and monorail stop just minutes away. The ease of accessibility was just remarkable. The room was cosy and clean. The staff made up the rooms promptly every morning. The toilets could have been better maintained. However, the pros of the hotel far outweighs the cons. The staff were ready to help when we needed help. I am glad we chose this hotel and I would definitely stay here again if I visited Sydney again.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Port Macquarie, Australia", "Title": "“Room was disgusting! Do not recommend at all!”", "Author": "madashell47", "ReviewID": "UR113367874", "Content": "I stayed in a Twin Room, bought thru Wotif as a 'Standard Special'. What a disappointment! There was no overhead lighting in the main living area, just two bedside lamps that were extremely dim. The air-conditioning vent vibrated which was really irritating. It stopped when I phone reception to ask how to turn off the air-cond. The bathroom was a disgrace. One of the walls was puttied up and the other had a huge crack between the plaster and tiling, and looked like it was filled with legionnaires disease. The basin was chipped and marked and just looked horrible. The toilet ran on constantly as well. The beds were cheap and horrible and you could feel the springs when you laid on them. I do not recommend this hotel at all, and I have stayed in nicer YHA's for a fraction of the price. Very disappointed!", "Date": "June 14, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Mumbai", "Title": "“Absolutely value for money if on a budgeted trip !”", "Author": "atishay78", "ReviewID": "UR113226232", "Content": "My second stop in australia was sydney. This is where my holiday begun as i visited melbourne on a business trip. Having a tight budget, this was and ideal choice made by us. The location is excellent. It is just a walk away from Sydney entertainment centre, cockle bay wharf, darling harbour. The rooms are neat, clean and comfortable. The bathrooms were a slight disappointment. They were no well kept as there were marks on the wall, the tap was slightly loose, there was a slight problem with a switch. Town hall station and central station is just a walk away and buses can be caught from george street which is again close by. So transportation is not a problem. The rooftop pool was clean and relaxing. Wireless internet is available in the rooms. We got complimentary breakfast with out stay. There are many cafes and restaurants nearby, therefore food was also not a worry.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Darwin, Australia", "Title": "“Clean, Good Location and Value for money.”", "Author": "LowMaintenanceTravla", "ReviewID": "UR108557488", "Content": "I have stayed here a couple of times now and I have never had a bad experience. Some of the facilities may not be new and the bathroom decor does look a little old. But it is a clean, comfortable, well sized and well priced hotel. It is in the centre of the action, I find the beds comfortable and the showers are a good size with excellent water pressure. The service can be questionable, depending which staff is working, however I found the majority to be entirely pleasant and welcoming. I would stay here again in a heartbeat.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Location, value for money, clean with comfy bed and great water pressure in the shower!”", "Author": "spin462002", "ReviewID": "UR107600645", "Content": "Stayed two nights with family in two other rooms. We were in a twin room on the 10th floor. One QS bed and one single. We went to Sydney to see Mary Poppins and this hotel is over the road from the theatre. Perfect! Nice reception area, room was basic but very clean with beautiful linen and a bed better than I have at home! I am bed bug paranoid and I promise you there were NONE! The bathroom had had a refit although the shower over the bath would not suit some people. The water pressure and choice of settings on the shower head were fantastic for my sore back! Consistently hot water. So much better than other hotels I have stayed! There is no parking in the building but the hotel has an arrangement with the World Square Carpark and it's only about $26 a day which is cheap for the CBD. Don't panic like I did when you see the rates at the carpark. Just take your ticket to the front reception at the hotel and hey verify it for you and take your payment. It was easy. Carpark one block from hotel. Easy walk. Also easy walk to Chinatown, Paddy's Markets, Monorail and lots of restaurants and shops. Loved the fact I could turn the air con off in the room and there was even a small fan heater in the wardrobe which made the room nice and cosy. A great stay. Will stay again soon!", "Date": "May 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Never again!”", "Author": "lovetotravel1989", "ReviewID": "UR104286901", "Content": "Stayed at this hotel for my hens weekend! the only reason we booked this hotel is because it was last minute and was the cheapest hotel available - the rooms are SO outdated, they desperately need a makeover! The shower was filthy on arrival, the beds uncomfortable and I just hated it in general. We asked reception to book us a Maxi Taxi for 7pm. Never showed, and nearly missed my own hens night cruise. All in all I would never stay here again, I'm a travel agent and I defintley won't be recommending it to my clients either.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location and decent hotel.”", "Author": "GirlOnHolilday", "ReviewID": "UR104083340", "Content": "The Metro Central is in an excellent location, a stones throw from George Street, Chinatown and the main shopping areas. The hotel itself is average looking, don't expect doormen or anything fancy. The rooms were big, clean, modern and well maintained; blackout curtains and noise reducing windows meant I got a great nights sleep. Reception service was good and staff were happy to help. I originally stayed 1 week but then booked a second week online as my plans changed. I had to change rooms last minute and though I was less than happy about it, staff were courteous and got me checked into the new room right away. There is wi-fi available, but the price is pretty steep (as in most Sydney hotels) and the connection not all that brilliant. If you're desperate for internet you're better off finding an internet cafe. Overall metro is an average hotel for Sydney and value-wise I think there are cheaper hotels that are just as good in location and facilities. Having said that, the hotel is clean, well serviced and modern, a lucky find when having to book a hotel on short notice.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Queens, NY", "Title": "“If only the hotel were as good as the staff.”", "Author": "Seedofapoet", "ReviewID": "UR102326648", "Content": "I traveled to Sydney on a leisure trip with a friend and we picked this hotel last minute. The hotel lobby is pretty nice and comfortable to just sit in with a nice little setup of couches to lounge. Check-in was easy, Michael was very friendly. I did feel a little troubled about not being asked for ID seeing as it was a prepaid reservation, being a hotel employee myself, I'm a stickler for security. The room itself, well, the cleanliness is questionable. I found that some of the towels had stains, along with the bed sheets. The bathroom floor and walls had mildew, I found hair in the tub (which is a big hotel no-no), the sink had cigarette burns, and the carpet was dingy and dusty. In other words, not up to standards at all. I didn't have control over the temperature in the room, but it was comfortable. I didn't expect a glamorous room, but I have to say that what I got was a little shocking. I didn't bother to complain seeing as I just needed somewhere to sleep and shower. The bed was comfortable and I slept like a baby since the blackout curtains made that room dark like a cave. One thing I did like is that the room requires you to insert your key in order to turn on the lights, makes for a greener planet and I'm all about being green. The service at the hotel was excellent. I found the staff to be attentive and friendly. I must shout out by name the ones who helped me the most, so thanks to Michael, Khin, Chevy, and Joshua who were all very good. Their service was outstanding enough that I'd give the hotel another chance. They provided the type of service I try and provide for my guests which meant a lot to me. If the property itself were as good as the staff, this hotel would be top notch. The location of the property is good, not much traveling time to get to most places. It's right in Chinatown and your options for eateries are vast. The thai place right up the block is delicious, unfortunately I don't remember the name. I noticed in the reviews that people complain about the internet fees at the hotel, but there are plenty of places in the neighborhood that you can walk to where you can use it for as little as $2.00 for an hour. If you're a fussy or demanding type of guest, then this hotel is probably not for you.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Great Location- Nothing Flash”", "Author": "Befle", "ReviewID": "UR99891802", "Content": "Stayed here for one night whilst attending a show at the Capitol Thaeatre. Found front counter staff very pleasant and accomodating. More than happy to hold suitcases before and after checkout for a few hours. Room was very basic- 2 twin beds- very small. Tv volume control didnt seem to work and bathroom vanity was badly scratched . Beds very old .Room badly in need of makeover. Also had two maintenance men bang on the door at 8.30 am to replace a light bulb over the bathroom mirror. Thought that was totally innapropriate timing as we were still dozing after a late night out and we had not requested the light bulb be changed as it was one of 5 bulbs above mirror and certainly not urgent. cant understand why they wouldnt wait till after checkout time. Apart from that, I would probably stay there again if i was looking for a budget night in a great location.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Unimpressed, not value for money”", "Author": "spodge86", "ReviewID": "UR98979374", "Content": "I was extremely disappointed with my stay at this hotel. I was led to belive it was a good quality hotel, the price would certainly indicate this. However I was misled. The first room we were shown to had no less than 6 nails sticking out the wall, multiple holes in the wall where there had been previous fixtures, chips in the sink and cracks in the sockets. I asked to see a different room, I must say at this point that the gentleman was very nice to us. It was one of the few times we had a competent member of staff to deal with. The new room was marginally better but the carpet still looked stained and unhoovered and there were still multiple holes and cracks in the wall. The room didnt have enough lighting and felt dingy. The lifts didnt work and caused a lot of frustration The pool was tiny, the surroundings were unclean and the access was through a fire escape held open by a brick. I was glad to leave and would not choose to stay here again", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane", "Title": "“Very pleased with hotel choice”", "Author": "Trissy_Ash", "ReviewID": "UR98320437", "Content": "My husband and I traveled to Sydney to see the UFC that was on yesterday. We managed to score $10 flights on tiger (which I must say I was also pleased with) but the hotels were all so expensive! After reading many reviews I decided on this one. It was $298 for 2 nights I was hoping for cheaper but this location ws great. We caught train from airport And 5min walk from central. It was also very close to many places to eat, paddies market and we had a great time exploring. Our room was very nice - not huge but comfortable for us. Decor was simple but nice,plenty of mirrors, Standard bathroom with hairdryer and amenities. First time staying in Sydney and it made me want to go back!", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“Perfect for what we needed. Great Value.”", "Author": "Shybee20", "ReviewID": "UR98297410", "Content": "We were touring around Sydney for 4 days and Metro Central was perfect for us. The staff was accommodating and helpful with restaurant locations, shuttle assistance and baggage storage. The only downside was that the spa was not working while we were there but other than that we had a fantastic stay. We were not in the room much but they were suitable for what we needed. We were able to walk everywhere and felt the location for the cost was fantastic.", "Date": "February 27, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "NE England", "Title": "“Good location, good service”", "Author": "travellerNEEngland", "ReviewID": "UR96940239", "Content": "The hotel is well located for exploring Sydney, either by foot or public transport. It is only minutes away from Chinatown, the Monorail station at Worlds Square, and train and bus routes. The rooms were comfortable and clean and the service welcoming and efficient. The hotel is value for money considering its location and amentities. My only reservation about this hotel was the cost of internet access. At 5 AUD for one hour we found it more cost effective to use an internet cafe a few steps away.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“ok for the price and location”", "Author": "daletina", "ReviewID": "UR96375630", "Content": "generally ok room was clean enough but they do need renovating badly .bed was uncomfortable on a positive note quite central and staff were friendly a 3 star is about right when they get rooms redecorated.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“The worst, terrible receptionistssss I have ever met! But overall is good.”", "Author": "KSBee25", "ReviewID": "UR88904055", "Content": "I called and asked if the rooms are refurbished and they said yes.. when I arrived, it is actually not but overall is good enough. Good location, however, I've met the worst, terrible and horrible receptionist in the front office ever.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Loved this hotel”", "Author": "iheartaus", "ReviewID": "UR85339633", "Content": "Great location, friendly service and comfy room. We stayed 2 nights at the Metro Sydney Central and found it to be amongst our favourite Sydney hotels so far. We found a great price of $94 a night which we thought was excellent value for our room. We arrived early and the guys at reception had no problem storing our bags until our room was ready. Everything was nice and clean and the bed was really comfortable. We had a kettle with a burnt base and after a call to reception we had a brand new one within 10 minutes. I also needed some printing done which reception did free of charge. Loved the location - close to Central station, buses on George St, World Square, and excellent Pitt St shopping. The 11am check out was also great!", "Date": "October 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good location average service”", "Author": "engam", "ReviewID": "UR85087946", "Content": "Like most Metro hotels in Sydney, this is a middle of the range hotel. It is right at the corner of 2 busy streets, so ask for a room facing away from the streets on a higher floor if you want a quiet room. The air con is coolling only and non reversible, The hotel provides a cheap and noisy fan heater instead. Like many sydney hotels, the last minute room rates are very expensive in the weekend so it pays to book early.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "christchurch", "Title": "“Not what we expected”", "Author": "greeniesChristchurch", "ReviewID": "UR83513502", "Content": "We arrived in Sydney from shaky Christchurch and were looking forward to a relaxing pleasant room. The person at the desk was cold and hardly spoke to us. Our room was obviously at the back of the hotel, was very small and in need of an update.There was absolutely no lookout at all. The airconditioner was so noisy we couldn't sleep with it on. We had pre-paid $21 a day for breakfast thinking that there may not be a suitable place nearby. When we arrived we found they had reduced the breakfast price to $16, but since we had pre-paid there was no refund. We still paid $200 a night for this hotel and were very disappointed. The only good thing was the location.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "ACT", "Title": "“Never again”", "Author": "Teglian", "ReviewID": "UR82776766", "Content": "I stayed here with a group of my friends, we booked two rooms and asked for single beds in all rooms. When me and my friend got to ours we found a tiny double bed and we immediatly rang reception to complain. They upgraded us to a room with a double and a single which was good. Issues with the rooms - the first room we were in had a badly leaking toilet from the base and there was toilet water all over the floor. The second room the toilet ran constantly which isn't fun when you're trying to sleep. The beds look updated but there not, the mattresses need to be replaced as they sagged badly in the middle and there was a few springs digging into me all night. You can hear everything happening in the rooms around, from one person tapping their toothbrush on the wash basin, to flushing toilets that sound like there next to your head. The staff were hit and miss, we asked them if they would call a taxi for us. I've done this before in other hotels no worries and without charge, but I was informed that they would charge 50% extra on our room for the pleasure. We ended up walking a block and hailed down one. I know there are worse places around, and this is budget accommodation. But I won't be coming back here. I'm sure this isn't the worst hotel in Sydney as others have said", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Good Location!”", "Author": "rubymaeph", "ReviewID": "UR81823316", "Content": "All I can say is that it got the best location in the city...just a short walk to Paddys Markets and Market City....and if you are adventurous enough u can walk all the way to the famous Opera House and Harbour Bridge...just like what my hubby and I did :-)", "Date": "October 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Solid and average hotel - but would do for price.”", "Author": "KardelSharpeye", "ReviewID": "UR81685610", "Content": "Stayed in September 6-8, in level 8 in a superior twin. I guess when I first walked in, the corridors were quite narrow and gosh, the lifts were unbelievably scary. Anyway, I placed the red key card into my door and it didn't work. So I had to lug my stuff all the way down to reception and ask them to check the problem. Ended up only having one card for the rest of my stay. The room was quite small-ish but liveable. The lights were probably not adequate but still do-able. What I didn't like the most was the bad TV reception, but location is great (just a little bit noisy because you can hear what other people are doing next door!), and traffic.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Japan", "Title": "“Horrible Bathrooms”", "Author": "JpnMan", "ReviewID": "UR79986655", "Content": "Our room's bathroom was so bad I complained after the first night and was upgraded to a jr. suite, however that bathroom was only slightly better. The staff readily admitted there was a real need for an upgrade. Pool has been \"renovated\" and is no longer heated-so it is freezing in winter. The jacuzzi has been empty for years apparently and filled with dust and scum. Elevators have a mind of their own, stopping or not stopping when they wanted. Rooms have been renovated and the decor is decent, but all are pretty small, except the jr. suite. TV in regular room only got 1 or 2 channels, jr, suite had about 6-7. The only thing going for this hotel is its central location. Being in the middle of Asiatown there are a lot of good, reasonable restaurants nearby. If you can get it for $100 then OK, but rates were around $200 when we were there and I am sure we could have done better.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Upper Hunter, NSW", "Title": "“Great location & Value for money”", "Author": "Daniw", "ReviewID": "UR79175368", "Content": "I stayed here with two friends and we had a triple room. The room was neat & tidy and was just what we needed. We were visiting Sydney to go to the theatre which was located conveniently across the road. We used the light rail to go to Cockle Bay at night which was great. The staff were friendly & helpful and the breakfast reasonable. Parking was at World Square which I was initially a bit worried about (others had said it was a long distance to walk) but it was fairly close and secure. We have decided to make our theatre weekend away an annual trip and would be happy to stay at this hotel again in the future.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Melbs", "Title": "“We came here with a special offer...”", "Author": "respecttheplanet", "ReviewID": "UR74106597", "Content": "We came here with a special offer, definitely not worth the full price. Very outdated, in desperate need of a good renovation. Average service, they did not have our booking when we arrived (through wotif.com) but ended up giving us what we booked (a twin room albeit smoking and it stunk!). Good location but would not come back, there are much better options in Sydney!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Surprisingly good.”", "Author": "LadyMephis", "ReviewID": "UR69342513", "Content": "Honestly, I was really taken aback by most of the bad reviews in here. So when I booked the hotel, i was totally prepared for whatever shortcomings that may come. Surprisingly, upon checking in, everything was fine. Check in was breezy. Stayed in the hotel for 7 nights. The room is quite old, one of the beds was in a bad shape and the tap was leaking but they kinda fixed it a few days later. Housekeeping did quite a good job, ensured all beds are made up and towels replaced. The staffs at their cafe are nice too. The food served for breakfast are Halal, totally a great deal for our Muslim friends*! The location of the hotel is fantastic. Very convenient. Short walking distance to Paddy's Market (Chinatown), Powerhouse Museum, Central station and shopping areas along George Street. The hotel is opposite their prominent theater, The Capitol Theater. Lots of restaurants around. *For our Muslim friends, there are other halal choices you can visit around the hotel. There's China King Noodle and Cafe Kasturi at the end of George St/Valentine St. :)", "Date": "July 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "canberra", "Title": "“Good location budget hotel - buget rooms a tad tiny.”", "Author": "altakoi", "ReviewID": "UR66365100", "Content": "The Metro is a good hotel and I am only commenting on their budget room offering. This was an excellent deal for the central location. However the room was very small - about household bedroom size - and the TV is mounted on a wall beside the bed. This makes sitting in bed watching TV difficult. Bathroom was suprisingly good with large shower. My room had connecting door to an adjacent room through which conversation of other guests was clearly audible and therefore not a good experience if the people next door decide to have a few drinks. Would not recommend for people who are sensitive to incidental noise.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Average hotel, great location and would stay again”", "Author": "MJKooLio", "ReviewID": "UR66111018", "Content": "Few people have written some negative feedback regarding the hotel, it's service and rooms. I did get the hotel booked for me and then I found out where i was staying - researched and read reviews here. I wasn't that fussed where I was staying. This hotel is fantastic for location. It is right in China Town, a walk across a park to the Train Station. You can walk all the way down George St as it's just around the corner. Many stores and restaurants in a one block radius and you couldn't go wrong! Rooms were adequate - Bathroom would be the least favorite. Out dated so they would only need to fix those up (ties, shower, sink, vanity etc). I was on the 5th floor so guessing it was one of the updated rooms. The Corridors did smell like cigarettes but you would get that from a Smoking hotel from the past! Bed were some comfortable, they looked new but I think they were a bit old. I was able to surf the net with Wireless using a internet provider of my choice when in the room and in the lobby downstairs too! It wasn't noisy as some have said and the rooms were fine, nothing moldy but the taps do need to be replace as they were constantly running when fully off. What I did not like was the shampoo, condition and body wash DISPENSERS! Please give us little bottles of Shampoo and Soap. I would rather pay a little more just to have those in the bill of the hotel..! I couldn't imagine how many people would have touched them and knowing the cleaners wouldn't really clean the buttons. Also hand soap was done with a dispenser too. Ugh! Staff working were a bit of help but not very bubbly. Very serious and not many smiles around! Sorry to say...", "Date": "June 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Burnie", "Title": "“Flea Pitt”", "Author": "Wolfguardian", "ReviewID": "UR66010488", "Content": "-This is a review on Metro on Pitt 431 Pitt st Sydney, there are 2 Metro's on Pitt- First up this Hotel was in a great location after that there is little going for it, We had Breakfast included which was advertised as Full Buffet Breakfast, this was fine till we went for our first Breakfast there was nobles, rice, Eggs, toast, spaghetti (Asian spicy) but NO BACON or Tomatoes or Sausages seems they left out the past that this hotel was muslin and therefore no pork products permitted, not that this is a big deal but hell it would be nice to note, no refund offered either. Now the room was Superior thank god about that as I would hate to see how big a normal room was, ours was so small a cat would not survive the spin test. When in the rooms you can hear everything from out in the hall and next door, so what ever you do be very aware what you say and do behind closed doors :) This hotel does not cater for non muslin's or non Asian (Indian, Pakistan) so be very aware if you plan on staying here, The rooms are very worn and in need of extensive refurbishing. The cleanliness of the rooms was very poor, sheets are stained as are the pillow cases. We ended up buying sheets from the markets as we could not get a refund and move to a different motel. I definitely would not stay there ever again.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Satisfied!”", "Author": "FutureBackpacker", "ReviewID": "UR64981752", "Content": "I stayed here from May 12-15, 2010 for holiday with my family. I booked the hotel from wotif.com and got special deal for a superior twin bedroom. Some points about Metro Hotel: 1. Great location. Walking distance to Darling Harbor, Circular Quay, China Town, Paddy's Market, and shopping malls. Very easy to find places to eat, buy things from supermarket, and easy access to public transportation. 2. Room is small, but clean. For me, traveling with toddlers, cleanliness is my number one concern and I have pretty high standard for that, and Metro Hotel match my standard. I don't mind about the space because I traveled during the days, and came back for sleep only. 3. I requested for baby cot and the hotel provided for me free of charge. 4. The view from my window is wall from another building, but it didn't bother me, because I wasn't looking for view anyway. 5. Reception is open 24/7, which is good. Although some of the people there is not really friendly or helpful. 6. Price is ok if you can get a promo one. I am a very satisfied customer and would recommend this hotel for any travelers.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cavan, Ireland", "Title": "“Basic, but clean, comfortable enough, and good central location.”", "Author": "Leon02010", "ReviewID": "UR61935835", "Content": "Yeah, this wasn't bad...I booked it last minute, the room was okay, small and basic, but all essentials were there and the room was clean and freshly made every day. Bathroom a bit pokey, but again clean, Fresh and had all the essentials...it wouldn't exactly knock your socks off with space, but it was clean, comfortable and not too pricey...I could find nothing wrong with it during my stay there (= 3 nights)", "Date": "April 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Crap.”", "Author": "donatellox", "ReviewID": "UR60692258", "Content": "Stayed at this Hotel from end of Jan to the start of Feb. Booked the Hotel for its location and for the pictures displayed on the internet. Upon arrival i was given a keycard to access room 304. I felt like walking out immediately. The room was a box. The carpet was rotted. The beds were pretty much unsleepable. TV didnt work. That was nothing compared to the bathroom, however. I find it unfathomable that they can actually let people use those bathrooms. It's a health hazard. There were a couple broken tiles on the floor. The vanity was all chipped and the amount of soap scum and who know's what else was truly horrific. However because i was worn out I stayed there for one night. In the morning went down and complained to reception and got a free upgrade into a \"superior twin room\" the room had been recently renovated and was quite nice looking inside. They didn't renovate the bathroom though. It wasn't quite as disgusting as the previous bathroom but it was pretty bad. When I went up to have a look at the pool. There was a cockroach infestation all over the steps.. I didn't even make it up to the pool. The lifts were scary. Unexplained stops on random floors. In need of repairs or new lifts. Never again will i set foot inside that property. I would recommend everyone else to do the same.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Basic room & hotel; good value in central location”", "Author": "galtons", "ReviewID": "UR59099792", "Content": "This hotel is centrally located in the Sydney centre; near to public transport and walking distance to everything in the city centre. The hotel is basic and the rooms are essentially comfortable and clean; certainly not lovely or inviting, but good value for money.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Had a bad experience”", "Author": "Traveller29856", "ReviewID": "UR58538701", "Content": "I was late in booking a hotel for my girlfriend and I as we had a function to attend and we had to be at a confrence early the next morning. All the hotels I checked were fully booked out so admist the bad reviews I thought I would give metro hotel a go. It was a bad decsion we probably would have been better of on the street! The carpet was worn out and extremely dirty the walls were chipped at places and had stains. The bathroom had cigarette burns on the sink (we were in a non smoking room) The sink was also chipped, the tub was dirty and tiles were mouldy, chipped and breaking! The aircon was on full blast and half way through the night I woke up shivering! The only good thing about the hotel was the size of the rooms and relatively clean beds. Would not reccomend this place to anyone. I don't know if it was only the room we stayed but I definately won't be back!", "Date": "March 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "wollongong", "Title": "“Good value for a 3.5 start hotel, good location”", "Author": "lynWollongong", "ReviewID": "UR56631688", "Content": "Read a lot of negative reports about Metro Sydney Central, so I wasn't expecting too much. I booked 3 rooms as we were going to the ACDC concert on 20 Feb with friends and didn't want to spend a lot on accommodation as we only needed a place to sleep. At $129 per night, the rooms and hotel proved to be great value, bear in mind this is a 3.5 star hotel. We had refurbished rooms that were pleasantly decorated and clean, while they were not huge they were roomy enough and larger that than a typical Ibis hotel room. Checkin was quick, staff weren't overly friendly but we weren't there to be pampered. Location was great, 2 blocks to China Town and 1 block to Central Station, so this suited us just fine. The downside was a fire alarm/ evacuation at 4.30am, however that couldn't be helped. Communication during the evacuation was non existant, there were a couple hundred people standing on Pitt St in PJ's in the middle of the night & we didn't see or hear from a single staff member. Obviously it was a false alarm as nobody was stopped from re-entering the hotel to go back to our rooms. Overall, I would stay here again if I want something cheap, clean & comfortable that is handy to where I need to be.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Batemans Bay, Australia", "Title": "“Some major maintenance required, pretty ordinary hotel.”", "Author": "LesMary", "ReviewID": "UR55423782", "Content": "We stayed at Metro Hotel Sydney Central night of 6 February on a coach package to the Edinburgh Military Tattoo at the Sydney Football Stadium. Upon arrival on a wet afternoon, reception was very good, key cards handed out to the 50 of us on the coach very quickly. Then the elevator dramas, only 2 of the 3 working and they were very slow, failing to stop at all floors, it took some 30 minutes to get everybody to their rooms.! Not good enough. Now the rooms, We were put in a room on floor 12, refurbished area. The room was straight from the 70's, bathroom a bit mouldy, shower and basin very chipped. As has been said, very tight fit in the toilet. The TV was a joke, the picture was almost unwatchable, very poor reception. Fridge was good, chilled my beer up real quick. The bed was very, very comfortable, probably a brand new mattress. The room A/C was difficult to turn down, pretty chilly. But because the room was at the back, we had no traffic noise thank heavens. We observed several serious water leaks in the hotel, one major one in the corridor near our room, which was filling up a real big container quickly. Leaks in some of the other coach parties rooms, leaks in the hotel foyer, leaks in the breakfast room. A major issue this and dangerous, wonder the roof did not fall in. Breakfast was a mini disaster, there were two other coach parties in the hotel, so at 7.30am, 150 people hit the breakfast room, 150 into 80 odd seats does not go. So there were seating delays, staff although apologetic could not keep up the food reserves in bain maries at breakfast buffet due to the numbers of people. Breakfast quality was reasonable, usual fruit, cereal, eggs, bacon, snags etc. The hotel is in a good position for entertainment area, directly opposite Capitol Theatre. Plenty of restaurants, cafes, pubs, food stores nearby. No doubt the hotel thrives on coach tours visiting Sydney for major events, but the owner/management really needs to spend some money on the major maintenance issues, quickly. I doubt I would stay there again and I will pass on my comments to Marshalls Coach company who operated this trip. I think they can find a better hotel in the City.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nothing exceptional, but good location and price”", "Author": "Mordonian", "ReviewID": "UR55408159", "Content": "Somewhat surprised to see some of the (very) negative reviews of this hotel on here; stayed here for a week at the end of January 2008 and found it perfectly acceptable. Sure, it's not the best hotel I've ever stayed in, but reason for choosing this place was not luxury or out of this world service. This place was chosen for its location and the price. For the city centre location this place is right on the money, and the location pretty good too; within walking distance of lots of Sydney's attractions. On a room only deal breakfast in the hotel is maybe on the pricy side but there is an excellent choice of cafÃ©s in the area around the hotel where you can get a decent breakfast. Similarly, there is a decent pub next door where you can enjoy cold beer after a day out sightseeing. Never experienced any of problems with bugs or any other nasty creatures in the room, and generally found the room perfect for what I wanted, i.e. a place to sleep.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "South West", "Title": "“Never again”", "Author": "gattidiroma", "ReviewID": "UR54527199", "Content": "We stayed three different times at this hotel over a year. The first time, we had quite a positive experience. We stayed in a queen superior room, which was all right. It was actually rather good value for money, the location of the hotel is (and remains) excellent, and we did not have to deal with staff members. The second time, we were given what is possibly the smallest room we ever saw. A cupboard would have been more spacious. We did not care that much but it was certainly not pleasant. The third time was by far the worst - and definitely the last. We were given a very small room, which shared a door with a triple. We noticed this upon arrival but did not think it would be an issue. We were awaken at 3 am by a group of drunken guys staying next door, and shouting loudly at each others. After 10 minutes of this, we tried to ring reception three times - to no avail. One of us eventually got up and went down to reception. We explained what the problem was, and were initially told that nothing could be done. After making it clear that we would not accept this as an answer, the person on duty this evening reluctantly agreed to talk to the guys next door and to ask them to stop. They went on for another good 15 minutes. When we checked out and mentioned that, the only thing they could suggest was to offer us a free breakfast, which we refused. Having read other reviews, it was obviously the right choice. The only advantage of this hotel is its location. But 5 minutes away down Pitt Street you have the Metro Hotel, which is both cheaper and infinitely better than this one, so we strongly advise booking the Metro Hotel instead.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“This hotel was a joke, Never Again!!!!”", "Author": "Loves_Da_Traveling", "ReviewID": "UR52733249", "Content": "When i walked in i thought it was going to be good as the reception area looked great. Walked to the counter to check in i was asked for $100 deposit, handed over credit card to get imprinted and got a lecture that my credit card was not suitable for a deposit as it was a debit card, never ever have i had that issue before. The clerk sat there waving it around telling me about all this sort of stuff that seemed he did not know what he was talking about. I had to physically pull my card out of his hand and go find $100 cash for him to shut him up, sort of quite rude he was i thought. Finally got my card to get into my room, got into the elevator, read the instructions for using the lift, took a few minutes of trying before another guest had to do it for me telling me how to do it as it is a bit tricky and not exactly as instructions say. Finally got to our room, opened the door and thought i had entered the broom closet it was that small. Went in, barely enough room to put my suitcase. looked around the room, the bathroom was all moudly on the tiles, the privacy nib on the door doesnt work, who knows that that is for, set to privacy anyone can still enter the room. I couldnt stand the small space so went for a walk. Came back after dinner, went to have a shower, the shower was absolutely disgraceful, i couldnt get the right temperature, it was either too hot or too cold no matter how little i moved the tap, after many minutes of trying i finally got the temp right, then it went cold on me, another ocuple minutes of getting it right then it went hot on me so then i just had a cold shower in the end. The water pressure was terrible as well. Also the exhaust vent for the room in the bathroom was falling out of the ceiling. The toilet was that close to the wall there is no way to comfortably dit on it, i dont know how any over weight people could possibly use it, glad i was not over weight. I got dressed and started watching TV. half hour later i started getting cold, look up the book it said there were instruction on operating the aircon near by, couldnt find any. after a while i found this thermostat on the ceiling set to 10 degrees, i adjusted it to 24 and it absolutely stunk the room out so i turned it back to 10, took my power card out to turn the aircon off and went to bed after the smell cleared from having the door open for 10 minutes. At this point i was going to call reception and ask for another room but i had everything unpacked and was too late and couldnt be bothered so off to sleep i went. Next day i decided to go for a swim in the pool, tried to get up there but no luck, went to reception and they said they dont give access unless asked for, wasted more time. finally got up there after waiting for lift number 3 for about 5 minutes as that is the only lift to get up there. Once at the roof the pool was an absolute disgrace, freezing cold, dirty looking, the concrete surrounds were all cracked and in my opinion dangerous as could easily cut yourself on them. The spa was out of order as well, so that exercise of getting to the roof was another waste of time. This is one hotel i will NEVER return to and NEVER recommend anyone to, room and service absolutley disgraceful, worst hotel i have ever stayed at. The only thing good about this hotel is its central location in sydney.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Auckland", "Title": "“The worst hotel experience of our lives!! NO JOKING!”", "Author": "POMSNZ", "ReviewID": "UR49869729", "Content": "WARNING = THIS HOTEL IS TERRIBLE. DO YOURSELF A FAVOUR AND BOOK SOMEWHERE ELSE. This hotel was simply the worst place we'd ever stayed at and we are seasoned travellers! Where do we start! We stayed for 2 nights in march 09 and quite simply the only good thing about the hotel was the central location. This is what attracted us to the hotel oh and the 3 * rating it had. We were assured the hotel would be above average but it wasn't. The hotel was shabby, the 'redecorated' room was disgusting, small, tiles were loose on the bathroom floor, causing grazes, the tap fell off, the curtains in the bedroom area didn't shut properly, the bed was uncomfortable - we could go on and on. The hotel staff were unhelpful, tried to tell us we didn't book a breakfast even though our voucher from the flight centre clearly showed we had. Right through the staff were terrible, no customer service, nothing.. The useless excuse for a breakfast was appaling. A dog wouldn't have eaten it! The bacon was some rubbish that even my husband didn't dare touch it. Some days it looked like it still had a pulse. The choice of food was limited, eggs looked like something thrown up, they conviently ran out of food before breakfast had finished. Also the hotel staff tried to kick late comers out of breakfast, even though there was 15 mins to go. One morning a riot almost broke out between the staff and the guests.. terrible Please, if you're after a nice relaxing break in Sydney then don't go to this hotel. You will regret it and you don't want to spend 2 miserable days like we did. Sydney is great but staying at this place will ruin your holiday.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Adelaide", "Title": "“Not my choice!”", "Author": "Varietal", "ReviewID": "UR47922657", "Content": "Had booked at Marque Hotel where we've had excellent previous stays, but they had overbooked and moved us to Metro Central. Location was equally as good as Marque for our purposes, but the quality of accommodation was considerably less. Was EXTREMELY concerned about an earlier review of the Metro in relation to bedbugs, but the 3 rooms we had showed no evidence of current or prior infestations. (We are thoroughly qualified in searching out these nasties!) We didn't know whether to laugh or cry at the toilet location. Its front is only about 10cm from a facing wall and there's virtually no room for your knees! Sitting side-saddle worked, but a mite uncomfortable.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Alice Springs", "Title": "“Good value hotel in great area”", "Author": "Zeddog", "ReviewID": "UR47611719", "Content": "Overnight stay on the way home from a business trip. Right in the heart of downtown and across from the Capitol Theatre - great location to see a show or go to a restaurant or two. Staff were friendly and helpful. The hotel itself is somewhat run down and old - but the price is right. recommended :)", "Date": "October 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "NSW South Coast", "Title": "“Don't Let the Bed Bugs Bite!”", "Author": "Rita3107", "ReviewID": "UR33920476", "Content": "Friend & I were coming to Sydney for a show at the Capitol Theatre so wanted a conveniently located hotel for the night. The Sydney Metro was just right...across the road. We were in a standard twin on the 3rd floor. Firstly, the bathroom could have done with a very good scrub up, for although it badly in need of a reno, a good clean with some Exit Mould may have made a difference. My friend who took the double bed woke in the morning scratching. She had bites on her arm and torso. A frantic inspection of the bed revealed a couple of bloody spots and the offending creatures lying dead (hopefully) on the sheet. On check out I quietly handed the creatures ( in an envelope) to the receptionist telling her they were found in the bed. She expressed no surprise and made no apology, but commented she would get the pest control people in. It seemed total dismissal of the problem. We won't be going back to the Metro Central.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Canberra", "Title": "“Good value and location”", "Author": "Tom D", "ReviewID": "UR33435334", "Content": "The hotel has refurbished rooms which they describe as \"superior\", and non-refurbished ones, which I guess are...inferior. I consciously chose one of the latter because, oddly enough, it was cheaper. Check-in was quick and efficient and the reception staff very friendly and helpful. My room was clean and functional but, being on the third floor and looking out on to walls and a courtyard, pretty dark and gloomy. Fine for just one night but if you were here for a few days I suspect it would start to get depressing. The bathroom was a bit knocked about but clean enough and everything worked. As other reviewers have noted the location is a fair hike from the harbour but very handy for shopping (the big World Square mall is nearby, including a big supermarket), pubs (all of which do decent food) and public transport. This is the backpacker part of Sydney and so there are plenty of cheap eateries around, usually Asian.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Gainesville, FL", "Title": "“Great Location....for some (and the rooms are OK)”", "Author": "HolaGatitos", "ReviewID": "UR32998184", "Content": "As others have mentioned the Metro Center hotel is really well positioned for much of the city. Hyde Park is a couple of blocks away, Darling Harbor maybe ten minutes by foot, but this is also on the edge of Chinatown and right in the middle of the backpacker scene. Translation, lots of good cheap food nearby, but sort of busy and, depending on your age, you may feel the area is a little like hostel heaven with plenty of nighttime diversions. The rooms are somewhat, but mine seemed to have been recently updated. Nothing to write home about, but clean, functional, and for the price, I thought the place comes off as a little\" boutique-y.\" THe have wireless internet in the rooms, but there is a charge. Save some money and go to one of the dozens of internet cafes that surround the area. If you are a foodie looking for good cheap Asian food, this is the place", "Date": "June 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta", "Title": "“Good stay - very nice staff”", "Author": "sarac9978", "ReviewID": "UR32479787", "Content": "The staff was very helpful here. They gave us good recommendations, gave us a fan, and were helpful with directions. We weren't here much because we were out on the town mostly. The room was comfortable and conveniently located.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“The location is the best part of it”", "Author": "HeartinNature", "ReviewID": "UR29174063", "Content": "We found the room with 2 double beds cramped and the lighting was not convenient. Breakfast provided was functional - same menu every day. Did not find the staff very pleasant (except for an Australian lady and another man).", "Date": "May 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Nice Experience”", "Author": "UMSK", "ReviewID": "UR28852793", "Content": "This hotel is centrally located.... near to Central and Town Hall station's - easy access to most of the places around Sydney City... staff is friendly and helpful - rooms are maintained", "Date": "April 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "auckland", "Title": "“Not worth the money spent”", "Author": "allblackgirl", "ReviewID": "UR27744609", "Content": "Was not at all impressed with this hotel - when paying $235 a night there are certain things you come to expect like polite staff, amenities that work, a clean bathroom, towels that cover an averaged sized butt and a superior queen room that is big enough to fit in more than a double bed. On arrival they had lost our reservation (luckily I had printed it off the computer as proof) so they upgraded us for free - quite frankly if this was a superior queen I would not like to see what the average room was like! The young lady that was on the desk during the day was incredibly rude and unwilling to help with any tourist information. They have a spa (one of the reasons why we stayed at this hotel) but it was out of order the whole trip. The worst was the breakfast (not included in the price). On our first morning we decided to treat ourselves to the breakfast in their restaurant but it was awful. They fried up luncheon sausage and tried to claim it as bacon, the juices were the same as the watered down stuff you serve at a childs birthday party, no fruit avaliable and the eggs looked like the plastic stuff served at McDonalds. They do have the internet but only one computer for the whole hotel to use and they charge about 5 times as much as the local internet cafe and they only let you use it at certain times during the day. For half the price this hotel would be fine but is definitely not worth the cost.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Good 3.5 star hotel”", "Author": "sea2skyaus", "ReviewID": "UR26783882", "Content": "The location is excellent. It is 3 minutes walk to Chinatown or Central station. The rooms are newly renovated, but for some reason they did not renovate the bathroom. The bathroom must be about 20 years old. Check out the shampoo and soap in public toilet like dispensers. There were multiple maintenance issue with the room, with missing light bulb and non-flushable toilet. Even assuming the light blub was working, the room was very dark. However, overall there was nothing seriously wrong with the hotel. If the rate is good, I would go back again.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Victoria", "Title": "“The worst hotel I ever stayed!”", "Author": "motherpig", "ReviewID": "UR25538728", "Content": "I stayed at Metro Hotel for 7 days/6 nights in mid Feb. The booking was for a twin room (the cheapest room) as I was travelling with my mum. We were given a triple room on 4th floor. The room was ok, no light on ceiling. Lights are located beside the bed and dressing table which is very annoying. The worst part was the bathroom. Mould everywhere. I slept next to the bathroom. On our first night, the ceiling in the bathroom was leaking and water dropped onto the bath tub. I couldn't sleep for the first night. The next morning, my mum found the vanity was full of water so all our stuffs were wet. It turned out the water was leaking along the ceiling panel all the way to the vanity. Floor was wet as well. Rang the reception and they quickly sent two guys to fix it. By taking the ceiling panel off and all the rusty pipes were exposed. I was going to take a shower but didn't do it as it was disgusting to even stand inside the bath tub. We came back in the afternoon and they have put in a new panel so we thought the problem was fixed. How wrong? I took a shower then and it was a nightmare. Water pressure was so low and temperature kept changing every few mins. I stood there naked and trying to fix the temperature. The shower took me more than 30 mins to finish. I was very angry by then as I know my mum will not able to do that. I rang the reception again and demanded to speak to the Manager. Got hung up twice for no reason. Finally spoke to the Manager and complaint about the shower. He decided to upgrade us to Superior Room on 6th floor. He didn't mention about the extra fees for the upgrade. Anyway, we moved room and it was such a big difference. It was one of the refurnbished room and I tested the shower and it was perfectly fine. No drama after that. When we checkout, I then found out we were charged the extra fees for th upgrade. It was lucky that it wasn't a huge amount but I would have thought that they would give us a free upgrade due to the condition and problem with the old room. Location is fantastic. Within walking distance to Central station and Chinatown. Plenty of places for eating. We even walked to Exhibition centre without any problem. The lift is ok to us. But during our stay, I have seen so many visitors were having problem using their key to operate the lift. I even helped a few. Overall, the staffs were nice and quick to response. But the condition of the Hotel is questionable. If you intent to stay in this Hotel, I strongly suggest you stay in one of the Superior Room or above. Definately not the cheapest one.", "Date": "March 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Brisbane", "Title": "“Worst experience ever!”", "Author": "Chooka84", "ReviewID": "UR25415058", "Content": "Stayed here with a friend for 4 nights after returning from a 2 weeks stint overseas - had to fly back to Sydney anyway before returning home to Brisbane, so extended the holiday to round off the week here. Location-wise, you couldn't be in a better spot! 5 min walk to train station. Close to Mall, Darling Harbour, Circular Quay... Twin room was requested but we got a triple - the room is not big enough for three beds!! part of the ceiling panels were lifted away from where it should actually be. air conditioning didn't work because the vents were so full of dust. Requested for someone to fix it - but no one came. Black marks up and down the walls. No light in the room other than a lamp next to the TV and the bathroom light. You could feel the springs in the mattresses - beds very uncomfortable! Bathroom was disgusting. It was small and no where to hang wet towels. Mould in the grout on the floor, mould all over the wall tiles, mould on the ceiling and rust under the paintwork. Bathroom exhaust vent was full of dust and absolutely filthy. Handles on the taps in the shower were broken and despite requests to have it fixed, no one came to fix it. Then the plug got stuck in the hand basin while it had water in it. Requested someone to fix it - again - no one came. We were forced to spit in the bathtub or toilet when brushing our teeth to avoid making the water that was in it any dirtier than it already was. OUr keys had to be re-cut or changed on seven occasions because we were being denied access to our rooms and to our floor. We got stuck in the lift twice. The lifts were an ongoing issue. Was left waiting for a lift for 20 minutes. After 10 minutes, I asked to use the stairs only to be told by reception that there were no stairs at all in the building. Later, I found the emergency stairs that said, \"for use in emergency only\"... I'm sorry but if the lifts are out of order - you should be permitting use of stairs. Wasn't the fact that they didn't think this was an emergency - was the fact that they told me that there were no stairs at all in the building, which at the time, questioned my own safety in the hotel itself. We chose this hotel for the use of the rooftop pool and to check out the view. We were repeatedly denied access to the rooftop. Only got up there once when escorted by a staff member after we continued to go to reception to complain. Part of the pool step was chipped away and sharp - not safe in my opinion. We took photos of the condition of the room and pool and bathroom... we have forwarded a formal complaint to management with the photos. We have requested a refund.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Brisbane", "Title": "“Not the Hilton but good enough”", "Author": "salt_pepper867", "ReviewID": "UR25365687", "Content": "Stayed in a superior room for four nights from 25 Feb - 1 Mar 09. Size of the room big enough for two of us, clean and large windows. Comfy bed and pillows. A/C works although there is no control in the room. Cleaning product scent a little overwhelming. Lifts a little slow and unreliable. A fair distance from Circular Quay/Darling Harbour but Central Station is just a few minutes walk away and there are plenty of places to eat and drink within a couple of hundred meters of the hotel. Good enough to return to after a day out and about.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Caerphilly S Wales", "Title": "“Great value hotel in the centre”", "Author": "Jane&Pete", "ReviewID": "UR25347554", "Content": "I have,a number of times written scathing remarks,justified of course,about some hotels my wife and I have stayed in in various countries and cities. The original Mr Grouch. We have just had a week with two friends in the Metro City Central,and its my pleasure to say the four of us were delighted with the vfm.At about 350 uk pounds we had very clean comfortable rooms in the centre of the city with everything close at hand.The staff were without fail,courteous,helpful and cheerful. I have no hesitation in saying you would be hard pressed to find a better hotel at the price,and I did spend many hours surfing (cool dude or what?) Tip. If you haven't walked the bridge,do it-fantastic.Photo of two oldies attached.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“Good value accomodation”", "Author": "holidaynz77", "ReviewID": "UR23968587", "Content": "We stayed in one of the refurbised rooms and thought they were good value for Sydney. The location near the train station was handy when getting to the airport . You could walk to China Town and Darling Harbour. The hotel will look after your bags if you arrive before check in time. Some airline staff use the hotel and so it can by busy at times in reception. Overall good value for the location", "Date": "January 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tochigi", "Title": "“Pleasant surpise given the price”", "Author": "SuzukiTochigi", "ReviewID": "UR23267486", "Content": "After reading reviews on this site we were somewhat skeptical but decided that for the money we had to spend that it was our best bet. Firstly we were delighted with the location and check-in staff were very effiecent and pleasant enough. We arrived beofre check-in time so arranged to have our bags stored until 2PM when our room was ready and went walkies to the local shops and china town (less than 5 mins walking). Our room has clean and quite spacious. Bathroom could of been bigger but did the job. All in all it was a decent hotel for the money paid and would recommend it to the traveller who wants comfortable accommodation without the 5 star price tag - ideal for the shopper like my mrs and no need for taxis etc as the location was so central to everywhere we went.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“ITS FINE”", "Author": "Ray170", "ReviewID": "UR23141064", "Content": "The room we stayed in was fine and reasonable value for money. This together with its closeness to Chinatown, public transport, markets, etc make it our first choice when we need to stay in Sydney CBD. The cost of parking (we paid $25 in a nearby parking station) certainly adds substantially to the cost but hey it is the centre of the city and that's clearly what the market will bear.", "Date": "December 31, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney", "Title": "“Pleasant Budget Accommodation”", "Author": "Happy076", "ReviewID": "UR22761370", "Content": "This hotel had wonderful friendly staff in the heart of the city at a reasonable price. What more could you want?", "Date": "December 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "melbourne", "Title": "“average”", "Author": "sunnyMelbourne", "ReviewID": "UR20608578", "Content": "The Hotel is very average. The had a twin room which was average, the bed base was broken, you could feel the metal spring of the bed. The toilet were so small, there is not enough place to move. The tap were leaking. Good thing was staff were friendly and the Hotel is close to train station. But if you are driving as I did it is better to stay further than CBD as it is difficult to drive as there is lots of traffic (Use GPS it will help).", "Date": "October 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Fantastic”", "Author": "jnaujoks", "ReviewID": "UR19784884", "Content": "This was the cheapest hotel I could find downtown for a night and was very pleasently surprised. The staff was extremely friendly and helpful. When the shuttle to the airport broke down, they gladly got us a taxi ride instead. Room was clean and contemporary.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New Zealand", "Title": "“Only satisfactory”", "Author": "Talandy", "ReviewID": "UR19059406", "Content": "Stayed for three nights which would be the maximum recommended. Good location. The room was very small. The 'king' bed was two single beds pushed together which meant that there was a very hard strip up the middle, in effect my wife and I slept in 'separate' beds. Very nice bathroom, but there was a continued unpleasant smell coming from the drains. Room did not get cleaned one of the days until after we returned after 5pm. Pleasant staff. A nuisance when the key card did not work which necessitated a trip back down to reception when we were in a hurry. Not great signage outside of hotel - the taxi driver did not know where the hotel was. Adequate, but would not stay there again. Have had better value from other hotels in the CBD.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wodonga, Australia", "Title": "“Perfect Choice!!”", "Author": "Sunny58", "ReviewID": "UR18999402", "Content": "My husband and I have just returned from 3 days/nights at Metro Sydney Central. Perfectly located- very short walk from World Square shopping centre,monorail ( husband loved position as hates walking anywhere!!) Staff very pleasant and helpful, lovely freshly renovated room(had booked standard but may have been upgraded as had 2 double beds and very spacious)-great value at $109 per night booked direct onMetro Hotels website-no room service but who needs it when so many food choices just outside in street). We have stayed at Menzies and Novotel Darling Harbour on previous visits to Sydney but much prefer Metro Sydney Central as better value and good location-not far to wharf areas and other attractions. Looked at my other mid range choices but I am so glad that I chose this Hotel and will definitely be staying here on future visits to Sydney.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tunbridge Wells", "Title": "“Great Hotel”", "Author": "randexpo", "ReviewID": "UR15828708", "Content": "I recently stayed at the Metro with my daughter for two days. It was my first visit to Sydney and I could not have chosen better. The hotel is centrally situated, the rooms were lovely and comfortable quiet and clean and the staff were very helpful and charming. We were waiting for our pick up to the airport, on our departure and the transport was very late, we were getting a bit concerned but the reception did all they could to assist us. I highly recommend this hotel and will stay there again. Carol B", "Date": "May 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Pleasantly surprised”", "Author": "time2roam", "ReviewID": "UR14021917", "Content": "Time to update this review page maybe. With few beds available this weekend, I took what I could find ... namely The Metro. I booked a standard double and having then read the reviews here, I regretted it. I shouldn't have worried. On arrival the staff were courteous and helpful and sorted out a booking problem I had. On booking they said they couldn't guarantee a non-smoking room, but they managed it. Even before I'd checked in, I'd been upgraded to a superior double/queen for some reason (I wasn't game to ask why). The room was small but clean and modern, as was the bathroom. Not a lot of storage space, probably due to the second double bed in the room .. yup TWO double beds. (But no plug for the bath) Facing Pitt St was a little bit noisy if the curtains were open but nothing that kept me awake or woke me up. (Try and get a rear facing room if you can... the view from the front isn't very scenic anyway) One of my friends was in a standard room and it too was clean and pleasant and the only difference was that the decor was a bit dated. They seem to have dropped the luggage storage fee which was good. All in all, with the location, the price and the amenities were all better than expected (and I've travelled a lot so I know a bad hotel when I see it).", "Date": "March 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "East Sussex, England", "Title": "“Bad attitude Staff”", "Author": "Alison6", "ReviewID": "UR8099464", "Content": "I stayed here for 4 nights at the end of my trip to Oz. Id got a feel for the attitude of Australian people by this time and was very disappointed with the service here. The reception staff were miserable and unhelpful. The room was fine, nothing special, but clean and a comfortable bed. The location was quite good, but still a 20 minute walk to the Quay. I think that there are probably better places to stay for the price.", "Date": "July 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“glorified hostel”", "Author": "jjireland", "ReviewID": "UR6807994", "Content": "absolute [--], stayed here for 4nights, was meant to be 6 but left 2 days early, rooms small and manky, first room they tried to put us in, the bathroom reeked of urine. the second was not much better. the only thing going for it is location", "Date": "February 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“A great experience”", "Author": "christymesa", "ReviewID": "UR6180670", "Content": "We stayed there in Nov. for 2 nights and when we got there we just gave our name and had to sign a form, there was a slight problem as the hotel had overbooked but they had upgraded us to the Master Suite so we were absolutely delighted with the LCD screen and the very comfortable bed. The sheets were great and the views absolutely fantastic. Not a bad walk to any other place. Paddy's market less than 5 minutes away, the central station a 10 minute walk, the monorail, light rain, trains and buses all just a few metres. Complimentary water each night, such a sweet thing. They put a lot of effort into our stay each night and every time we walked out of the hotel (we were in a non smoking room) they'd say cya later or when we walked in they would ask us how our day. meal or even our donughts were. Very lovely, very happy with our stay and we will be going back there when we fly over to Sydney in March.", "Date": "November 27, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Perfect stay, perfect price”", "Author": "takoyaki_puff", "ReviewID": "UR5431657", "Content": "The Metro hotel Sydney central was a lovely hotel to stay in. We stayed on the 12th level, although we didn't have any nice views, the room was better than i expected from reading the reviews. Comfortable linen, nice lighting and great paintings in the rooms. We stayed in the superior queen room and it was quite spacious, a bonus was the use of shampoo/condition/body lotion/shower gel in the bathroom. Some improvements that could have been made were the bad reception on the tv and no remote. But other than that a lovely place to stay, extra pillows (we had 5 in our room) , plenty of towels were provided and a great atmosphere. Perfect location to go wondering around the city.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Melbourne", "Title": "“just average”", "Author": "rtwcr", "ReviewID": "UR4694315", "Content": "stayed here for four nights on a business trip to sydney. like one of the other reviewers i booked this hotel in error thinking i was going somewhere else. for sydney standards the hotel was ok, just ok. i had a twin room when i requested a double. the standard single beds (not king singles were too small for me - i am 200cm tall). despite several requests on arrival i was not given a room with a double bed - as requested. the staff were efficient but seemed to be terribly overworked and harrassed. i was surprised to be charged to store one smaall bag and my overcoat on the last day after checkout - i had a late flight and wanted to do some exploring. all in all you pretty much get what you pay for.", "Date": "March 19, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Thousand Oaks, CA, USA", "Title": "“Lost our Reservation”", "Author": "Ricardo022", "ReviewID": "UR4588859", "Content": "We had made an online reservation and we had a printed confirmation, but our reservation was missing in their computer system. They had no way to communicate with their central office because it was Saturday. Despite being there at 10 AM they would not give as the room we reserved because they were fully booked, although a large hotel should expect some no show or late cancellation. For one night they would only give us a terrible room with no space and they refused to place us in another hotel or help us find another hotel. Luckily we were able to find another hotel on our own.", "Date": "March 6, 2006"}], "HotelInfo": {"Name": "Metro Hotel Sydney Central", "HotelURL": "/ShowUserReviews-g255060-d257308-Reviews-Metro_Hotel_Sydney_Central-Sydney_New_South_Wales.html", "Price": "$114 - $211*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">431-439 Pitt Street</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2000</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "257308", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5d/92/5d927bd57ce003e88bd1cbae5fa390f03large.jpg"}}