{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Good Value”", "Author": "Booper97", "ReviewID": "UR127969956", "Content": "Had an unscheduled overnight stop in Sydney at Easter and stayed here. Good value at short notice. Have stayed here before as I'm a Rydges member which means you get the best rate and don't have to pay for parking which makes it a reasonable price to stay in Sydney.Room was very clean although the bathroom is looking a bit tired.Comfortable beds , even the trundle , and reasonably quiet although the air conditioner was a bit noisy. We had a room with a balcony (although it was only just big enough to swing a cat) and glimpses of the Harbour. Great place for a short stop over but don't think I'd want to stay for a long period", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent quiet getaway. Impeccable service”", "Author": "AliceD88", "ReviewID": "UR127713046", "Content": "I booked this hotel one month in advance and my stay was for 2 nights, 10th and 11th of April 2012. I chose Rydges because I have stayed with them before at Rydges Parramatta and also for the package they offered which included buffet breakfast for 2 and free parking. I was not fussed about location, as the sole purpose of booking this hotel was to spend time with my partner who is a medical student visiting home from Victoria. However North Sydney makes a very suitable \"home away from home\" location, as I'm from Liverpool. As I drove to the location, I did find the driveway leading to the car park narrow but that is a minor issue to me. During check in, I was greeted by the very friendly front desk manager (?? From memory that was his title). After the quick and easy check in, we went to the elevator and was so happy to know I'll be staying on the tenth floor (there are 12 floors in this hotel). When entering the room, my partner and I was very surprised at what we were offered. I initially booked a park view queen room. simple. unknowingly, the gentleman who checked us in gave us a 2 bedroom apartment suite! Whilst the extra bedroom was not required, we were very happy to know of the upgrade and to have a balcony and roomy space. the next morning when we went down for our buffet breakfast, the we walked past an Indian male housekeeper who staffwas very courteous and quickly moved his trolley over to let us through, which wasn't necessary as there was still a lot of space, but he was nonetheless very customer centric. at Rise, the staff greeted us with Good Morning which I thought was very courteous. to Jon Ackery, I'm very happy with the friendly smiles of the morning staff at Rise on the morning of Wednesday 11th. The lady making the coffee asked for our room number then asked if we dined here before. we said no, so she told us where things were and if we needed anything, to let her or the other staff know. the lady on Thursday 12th was quite disappointing as she hardly had a smile on and just asked for our room number. the buffet breakfast is the best I have ever had. its the first time I have seen fresh fruit smoothies and Wheatgrass juice! There is so many hot and cold breakfast varieties and I was really spoiled for choice! Whilst there has been mention that the bathroom is old, we did not find that an issue and the bathtub was large enough to fit two people. I only have two faults from my stay.first, there was an unpleasant stain on the curtains in the main bedroom of 1013. Secondly, whilst in the foyer using the free WiFi to book movie tickets, the phone rang and prior to picking it up, Roman from front desk made a rude remark prior to answering, along the lines of \"for Christ sake\". other than that, I had a perfect stay and Rydges North Sydney is definitely the hotel of choice for me. Alice", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“Great motel in beautiful tree lined street”", "Author": "Mad C", "ReviewID": "UR127638518", "Content": "This motel is great! It's in a wonderful setting and great position (close to Luna Park only 15 minute walk with kids) and the one bedroom harbour view apartment we had was very very comfortable. We were lucky enough to have two sofa beds for my three children to sleep in and they were extremely comfortable sofa beds. The queen bed in the bedroom was probably the most comfortable bed I've slept in and I have travelled all over the world and have never found a better bed. I have viewed them now on the Rydges website with intention to buy one. The bathroom was user friendly, and usually when it comes to water saving shower heads they are generally hopeless, but this water saving shower head was probably the best I've used (good pressure and good water coverage) someone really did their homework on them. A small amount of minor maintenance/housekeeping in rooms wouldn't go astray. Minor things as tightening kitchen door handles, vacuuming under beds (lots of stuff under there from days gone by). a good clean of the fridge and supplying a utensil drying rack for the washing up to dry on. All in all, you wouldn't be disappointed staying at this motel in any respect. I would highly recommend it to anyone with a family too. I am disappointed that we didn't get time to eat at the restaurant or get the room service food it looked fantastic, NEXT TIME FOR SURE!!!!! We can't wait to come back again and I hope we get the chance sooner rather than later. Thanks Brad", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Decent business stay”", "Author": "mbroomhead", "ReviewID": "UR127450226", "Content": "I stayed here for a few nights, and I've stayed here before. I'm a Rydges member and got a voucher for a free drink when I checked in. I had a room on the 11th floor and it had a desk and ironing board, iron, was clean and tidy. the bathroom could have done with an upgrade but was OK. Internet in the room is wireless or wired but did not work when I was there. Room was quiet. Had trouble on the phone in the roomnwhich wouldn't accept touchtone for calling card etc. There is free internet in the lobby and bar. Staff are friendly and breakfast is pretty decent. Easy walk to Arthur Street in North Sydney, and could also walk to the train station if the luggage isn't too heavy. Satellite TV has lots of channels. About a $20 taxi ride to the city.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Tucked away from the everyday”", "Author": "Naviance", "ReviewID": "UR127059460", "Content": "Located off street this property delivers comfortable accommodation, a stylish bar and a breakfast with really healthy options. OK so it's not in the very heart of North Sydney but it certainly is very close to most of it. The accommodation was well furnished and adequate in size, not too small and not too large. It was a 'nice' stay, not pretentious but with enough style to feel good about the address.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palmerston North, New Zealand", "Title": "“Enjoyable stay”", "Author": "Mark T", "ReviewID": "UR126990804", "Content": "Good location for North Sydney, quiet and good service, very comfortable rooms, ensuite a little tired but overall pleasent stay", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Aged and average”", "Author": "Steven W", "ReviewID": "UR126651237", "Content": "I've stayed at the Rydges many times over the past years for work, but found it on this last trip to have aged below its previous standards. The rooms have become dated, and in comparison to other Sydney hotels, and hotels around the world, are relatively small and limited on space and facilities. The view and location is the saving items for the Rydges, although getting a westerly facing room without the harbour view wouldn't add any further appreciation to the hotel. The rooms do have a good bed, comfortable and resting after a long day at work. The desk and television are in good position within the room, but the wardrobe had little space to place a suitcase inside, or hang all your clothes on hangers. The bathroom is dated and small. The dining room on the ground floor is satisfactory, and the lounge bar was pleasant for after work drinks with colleagues. A big advantage is the car parking, under ground and very close to the city. An improvement would be some additional signage for drivers as the hotel is off the road, and for some motorists, and even taxi's, hard to sight whilst driving.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Twilight at Taronga Package”", "Author": "Befle", "ReviewID": "UR126635647", "Content": "Stayed here for the Twilght at Taronga Package which is great value -approx $350 for nights accom, tfr to taronga zoo, concert tickets for 2 and buffet breakfast next morning. Stayed on level three with average views over nth sydney, however friends were on the same package on level 6 with a balcony and views toward the harbour. Bed and linen fantasic. Room quite roomy- bathroom a little tired with a few cracked tiles, but had a fresh coat of paint.Have stayed here before and there always seems to be a really long wait on the lifts, but this is probably due to the fact that a lot of people are trying to access the shuttle buses to the zoo at the same time, and the hotel is very busy on the weekends of these concert weekend deals. Service at breakfast is also a little slack- They seem to be very slow to clear plates, and we had to go in search of our own cutlery etc but the buffet selection was very nice and we would definately come back again.", "Date": "March 25, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Average and expensive”", "Author": "Bigozpete", "ReviewID": "UR126382383", "Content": "I travel weekly for business and get to stay in many hotels around the world. I last stayed at the Rydges Nth Sydney about 10 years ago and was disappointed as it was very run down but thought I'd give it another try. The good news is that the rooms have been refitted recently and are looking much better. However they still look a little dated. On checking into the room neither the standing lamp nor desk lamp worked. They came and replace the bulb in the standing lamp, but could not fix the desk lamp, which made it difficult to get any work done at the desk. Bathrooms have had a fresh coat of paint and new taps but tiles were dated and cracked. Rate I paid at the Rydges for a mid week stay was AU$290 per night. I stayed at the 4 Points Sheraton right on Darling Harbour last week for $220, as a comparison of what's available right in one of Sydney's very popular central city areas. Rydges being in Nth Sydney is a $15 taxi ride to city dining or shows, and nothing happens in Nth Sydney after 6pm. Rydges also does not have a gym/health club which I believe is important for business travlers and is a disappointment, especially at the rate I paid. However a short walk up the road is Sydney Oval and a park which is great for walking or jogging. Dinner was room service and I ordered a steak sandwich. Service was prompt but for $22 the meal was small and average at best. Staff were friendly and helpful enough when engaged. In conclusion I think I'll go back to the central city hotels for my next stays. Unless you're doing business in Nth Sydney and don't want to do the 10-15min commute back and forth to the city, Rydges is an option, but you can get more for your money in an area with more restaurants, action and scenery in the city.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Staff were fantastic and the food was wonderful”", "Author": "Victoria B", "ReviewID": "UR126359032", "Content": "I recently held a Corporate event at Rydges North Sydney. To be quite honest, I was a bit worried as the last time I had a corporate function held there, I vowed never to return. I was pleasantly surprised. The food was wonderful and the staff were extremely helpful. The larger meeting space could do with a revamp and the airconditioning needs attention. I stayed in a 1 bedrdoom apartment and it was tired and the airconditioning was very noisy. Our conference was a huge success and I attribute that to the staff at Rydges North Sydney. I wouldn't hesitate to return.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Incredible buffet breakfast”", "Author": "KristinLTD", "ReviewID": "UR126074392", "Content": "We recently stayed at Rydges North Sydney on a business trip for my husband - and I came along with our two kids. We stayed in a one bedroom apartment which was spacious and convenient and transformed the trip from 'manageable' to 'fabulous'. Every staff member we encountered during our four day stay was friendly and helpful and the onsite parking was very convenient. But the stand out moment was the first day we experienced the new style Rydges breakfast. From wheat grass shots to Hollandaise sauce this is one of the best hotel buffet breakfasts I've ever experienced (only just topped by the Ritz Carlton in Kuala Lumpur). Freshly made berrie smoothies and individual size bircher muesli, followed up by gluten free bread and delicious juice. And everything presented beautifully too. Apparently this is the first Rydges to have the new-style breakfast and it will be rolled out to other Rydges soon. If you like being able to top your poached eggs with as much Hollandaise as you can get on your plate, this is the place for you.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Canberra, Australia", "Title": "“In need of a spruce up”", "Author": "aussie_travellers_90", "ReviewID": "UR125874002", "Content": "The Rydges is in desperate need of a renovation with cracked tiles in the bathroom and mould over the seals on the bar fridge. I stayed in a one bedroom apartment and its quite roomy with the exception of the bedroom. The service is quite good and the staff are friendly and helpful. Its a short walk to the business area of north sydney and probably close to 20 minutes by foot to Lunar Park. All in all its not bad but nothing to get excited about either.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Room fine, restaurant so-so”", "Author": "MikefromSydney", "ReviewID": "UR125312647", "Content": "The room was a good size and i was lucky enough to have a sliding door onto a small balcony which had a glimpse of the harbour. The bed was very comfortable. My main gripe is dinner in the restaurant, as it and the bar share the same space, and there was a lot of noise coming from a large group in the bar. Also, I had to fight my way through this crowd when leaving the restaurant. I didn't find the menu anything special, nor do I think ordering off an ipad is any advantage, as there are still times when you have a question to ask.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“First Class Hens Weekend”", "Author": "Karen C", "ReviewID": "UR124794748", "Content": "We booked a room for my Mum, sisters and I to stay after my sisters Hens Night in the City! We had a two bedroom suite with dining room table, lounge and full kitchen. We didn't want to leave the room was first class. To top it all off we had the best hotel breakfast ever the next morning. Great choices even gluten free choices available, really nice coffee and excellent service!!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Just what we wanted”", "Author": "Melbflyer", "ReviewID": "UR124514050", "Content": "We booked a room for 2 adults and 2 kids. So a one bedroom suite was perfect. Kids went to sleep n the bedroom, adults watched tv from the sofa bed. We chose Rydges Nth Sydney for the Twilight at Taronga concert package. Bus transfers, buffet breakfast, all great for out-of-towners. Probably the best part was the welcoming smile on arrival, and that nothing was difficult at all. We were originally booked into a 4th floor suite, but the furniture was still being cleaned. We ended up on the 8th floor, with a great view. All this was done in a matter of moments, by the front desk manager. Service isn't everything, but it's very important. These guys got it right!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Hotel, Lovely Rooms”", "Author": "mellos", "ReviewID": "UR124331834", "Content": "Stay here on business when I travel to Sydney. Good rates, great hotel, good room service, good rooms. Highly recommend.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great Hotel in great position for Sydney.”", "Author": "penwar", "ReviewID": "UR123944694", "Content": "we stayed in a family 2bedroom apartment with rollaways for 2 grandchildren. 4 adults and 2 kids. The apartment is one of the best as far as size goes. it is set up really well with plenty of room. adequate kitchen facilities for mini holiday. Bedding is very comfortable, even rollaways. is very central to eateries , hotels etc. 5 minute walk down hill to Nth Sydney station, but 10 minutes up hill to return. buses are a couple of minutes walk from hotel. is a great position for Taronga Zoo, Luna Park and all the sights of Sydney. Rooms higher up have great views of harbour towards Fort Dennison or across nth Sydney towards Darling Harbour. bar in foyer is very relaxing and laid back. breakfast is very good, but try and avoid rush times as business stayers tend to fill tables. tapas in foyer are great, especially on Fridays, when they have specials 5-7. as far as rooms go, they are excellent, except we had a rather musty smell in our room. The weather has been very wet, so this could account for smell. room deodorizes would have helped. I don't think 2room apartments are used much, as we never have trouble booking at last minute, so are probably closed for longer lengths of time. All in all, this is a great Hotel in a very central position for all sightseeing. Is ideal if you are using Mater Hospital for day surgery or longer.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“COMFY BEDS!!!!”", "Author": "Jules_Bfly", "ReviewID": "UR123799149", "Content": "We picked Rydges as we had a wedding to attend in Mossman at the Gunners Barracks. It was about a 12 minute drive there from Rydges so it was very handy. Just a quick stay flew in Sat morning and out on Sun morning. Room was everything we needed, bit pricey but we were upgraded upon arrival to a ocean view room which was a nice surprise. Staff were very polite and helped us booking a taxi to our venue. They say all rooms have 'dream' beds.....I have to say it is the most comfy bed I have ever slept in!!!!!!! Room was quiet and parking was available which was great. BLISS and just what we needed would definately stay here again if I was in the area.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Auckland", "Title": "“Stay her lots is work”", "Author": "J_and_R_AKL", "ReviewID": "UR123770754", "Content": "Thus place is very consistent. Staff very efficient, small thing like printer in lobby for printing boarding pass etc really help. Had a good wrap via room service for lunch and it was very good. Taxis ate always easy to get too. Will be back.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great for family holidays and excellent alternative to staying in Sydney city”", "Author": "Adventures1234", "ReviewID": "UR123724817", "Content": "We stayed at this hotel in early Jan with two teenagers in the two bedroom suite. Excellent room sizes and plenty of room for the four of us. We opted for the Luna Park package the first night and the Taronga Park package for the second. Excellent value for money as it includes a fabulous breakfast and parking as well. I cannot rave enough about the breakfast buffet, especially the range of fresh fruit, juices and smoothie bar! Staff are very friendly and helpful, even to give advice on best way to get to Luna Park on foot. We returned to the hotel at the end of the month for a couple weekend. We chose the hotel for comfort, convenience, parking and access to transport as well as excellent value for money. We walked to train station, about a 15 min walk, to go to city for evening and felt safe enough to catch train back after dinner and a show in the city. This hotel is an excellent option for families and couples who want convenience of easy safe and accessible parking and a lovely hotel without having to stay in the city itself. Clean, comfortable and very affordable! Will definitely stay here again!", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Batemans Bay, Australia", "Title": "“GOOD ALLROUND HOTEL, BUT OH DEAR THE SHOWER , UGH.”", "Author": "LesMary", "ReviewID": "UR123095553", "Content": "Stayed at North Sydney Rydges, nights of 13/14 Jan, 2012. Got a good rate, Summer special for Priority Guest members, room, b'fast and parking. Hotel is on a tight block with tight parking but ample. Reception very good, our room was available at 1pm, great because we were helping our son move his travel business into new office space across the road. Had room 1110 on 11th floor, nice harbour view. Well furnished and in good state. But oh dear the bathrooms need a make over and the shower was PATHETIC, very little water pressure and hard to regulate. I judge a hotel by beds and shower, the beds were great but the shower probably one of the worst I have experienced. Please do something Rydges. Breakfast buffet was fine, we ate both night at Mundos on site, Spanish theme, very good cuisine and staff in restaurant fine. Food and Bev Manager served us one night, she was very professional, a little starchy at first but then friendly and very knowledgable, well done. I was quite impressed with the hotel and would stay there again, if only I could get a decent shower ! We just can't blame Sydney water restrictions all the time, other hotels in Sydney have good water pressure.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Convenient location, close to the city ..... but no airs and graces!”", "Author": "Melb22", "ReviewID": "UR122804954", "Content": "So convenient, great location and without the price tag of a Sydney city hotel. We have previously stayed a number of times at this hotel, and have always been pleased with the value offered. In December we spent a night in a two bedroom suite, ideal if you have kids. Although we only used the living area for watching TV (not eating) - it was wonderful to have the space. The air conditioning did not work at all well, so we were lucky the weather was not any hotter or we would have been very uncomfortable, and the (very weak) shower was definitely not a highlight! We also took a long, long time to check in as there was only one person on reception at a very busy evening check-in time. That said, the service was courteous, the beds comfortable, check-out prompt and Rydges North Sydney is great value for its location. We will definitely be back.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Reliably good”", "Author": "Jmkel", "ReviewID": "UR122730866", "Content": "This is a good place to stay whether you travel for business or fun. I have stayed here a few times and have always found the service to be attentive and professional. There is a modern open bar area for after work or sight-seeing drinks in the evening and a restaurant that stives to provide contemporary meals. There are also a lot of great restaurants nearby (in particular the great Thai place around the corner). This hotel was recently renovated and the improvements are great. The rooms are spacious and the beds are amazingly comfortable with great pillows. If you can afford a one bedroom suite or a room with harbour views then it is worth it but the rooms on the garden side are also good.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“Good location but not a good view”", "Author": "Arfan A", "ReviewID": "UR122559547", "Content": "The hotel was very convenient. I was welcomed with 2 complimentary drinks, however when I went into my room I was surprised that I can't see a thing from my windows. I paid extra to have Sydney harbour view and was expecting to see Opera House, but all what I could see is a bit of water and that's it! Other than that, the hotel was clean, staff are attentive, and good location.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney Australia", "Title": "“Pleasant stay”", "Author": "Kierand80", "ReviewID": "UR121906936", "Content": "Stayed three nights in early December, and found it to be a comfortable stay at a reasonable rate. The hotel relatively close to the city which is why we chose it however, if you intend to catch the train be prepared for a 5 - 10 min walk to the station and the area is hilly. The room was renovated, and clean and tidy with an excellent bed, the only let down was the bathroom as others have commented is a bit dated, however it was clean and servicable.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“Good as expected”", "Author": "EasyNotCheap", "ReviewID": "UR121871462", "Content": "Good place, nice breakfast, bit on the expensive side, but that's Sydney! Everything as expected, except the internet connection. To charge 15$ per day is simply not acceptable in this day and age (especially in a 200$ per day place).", "Date": "December 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“As expected”", "Author": "Notjanedoe", "ReviewID": "UR121813745", "Content": "Only gripes are no easy foot access (have to walk up the driveway), pricing ($295/night standard queen) & bad written communication (I.e no info about how to exit car park, cost of buffet breakfast, express checkout). Restaurant is pricey, but $5 Fridays (5-7pm) is great value. Buffet breakfast is good. Mixed customer service with good food and beverage staff but aloof reception staff. Modern and clean rooms.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Western Australia", "Title": "“Quiet location, easy to reach city”", "Author": "AussieChook", "ReviewID": "UR121538351", "Content": "I stayed one night at the Rydges and was allocated a room facing onto the gardens. It was very quiet, very clean and the bed was soft and comfortable. The pillows were good too but there wasn't a pillow menu. The bathroom was clean and the toiletries were adequate; however, the bath/shower gel had no lathering properties at all and reminded me of face cream. There was no dressing gown in the wardrobe but there was an iron and board, mini-bar and fridge. Free wifi was available in the lobby but not in the rooms. I had room service for dinner and it was a big disappointment - chicken that was meant to be grilled bore a strong resemblance to a fast food outlet's chook, the Caesar Salad was 99% lettuce leaves and the steamed vegetables were probably frozen, microwaved warm because the broccoli had microwave burns. This otherwise very nice hotel should do something to improve not only the room service food but also the selection on the menu which had four choices or pizza. Not what I'd expect in a four star hotel. Check-in was speedy but I discovered in the morning (arrived after 8pm) that I didn't receive a free newspaper nor was I offered a paid delivery of newspaper at check-in. There were no papers in the breakfast restaurant. Breakfast was very adequate, with fresh fruits, hot meals, toast/pastries etc and proper fresh coffee (cappucino machine operated by staff member). I'd stay here again but I wouldn't get room service, because it's close to my meeting base, but there aren't lots of restaurants or shops in the vacinity. There are buses/taxis to take you into the downtown region so for that reason, I'd say it's well located. The rooms have been fairly recently renovated but not sure which year.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good place to stay in North Sydney”", "Author": "r_stanzel", "ReviewID": "UR120836636", "Content": "This is a nice Hotel in the Rydges category type of hotel, very convenient for me when I am on business trip with clients in North Sydney. This Hotel is in a very quiet part of North Sydney, though still walking distance to the main streets here and business centre in this part of Sydney. Even North Sydney train station is only 5-10 min walk from here. The staff is very friendly and most, if not all the rooms have been refurbished lately.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Typical Rydges including the bathroom”", "Author": "bluemountainkiwi", "ReviewID": "UR120806261", "Content": "Rydges North Sydney is located in a quiet part of North Sydney with very little traffic and noise. Staff are friendly and helpful and being a Priority Guest, check in is a breeze. We stayed on the fifth floor with views to the east and even a little of the harbour (bonus). The room itself was really nice with Rydges trademark Dream Bed which is probably the best hotel bed I have slept on and modern furnishings. The room had obviously undergone a facelift not too long ago and this made the whole experience really enjoyable. Unfortunately as with Rydges Lakeside (Canberra) and Rydges Oasis Resort (Sunshine Coast) they forgot about the bathroom. Will somebody please tell Rydges that when their rooms undergo a facelift include the bathroom. The rooms look as if they are from 2011 however the bathrooms look as if they are time warped in the 70's. Cracked tiles, old toilet, old light fittings etc etc. Really disappointing as spending that little extra would create an experience that could quite easily be rated as 4+ star. The restaurant is really nice and the food and service is excellent. I would highly recomend the set 3 course menu but if you are a Priority Guest you will not receive the 20% food discount which I thought was a little deceiving as from what I have read the discount applies to everything excluding breakfast only. Overall I would recommend Rydges North Sydney as a comfortable 3.5 start hotel in a lovely, quiet setting but within reach of everything. Upgrade the bathrooms and no doubt this hotel could be a great 4+ star establishment.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Overpriced- for what we received”", "Author": "DimityVanderpot", "ReviewID": "UR120717507", "Content": "We stayed here for 5 nights from New Years Eve. The room was very standard and about a 15min walk from the train station. There is not much to do nearby, however the hotel is not far from bus stops where you can travel to the Neutral bay or Sydney City. Reception staff assisted us in checking us in to our return flights from Sydney.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Gold Coast", "Title": "“VERY SUB-STANDARD ACCOMMODATION”", "Author": "Gail T", "ReviewID": "UR120603474", "Content": "I recently travelled to my home town of Sydney for a family wedding. I live on the Gold Coast now. I had already had terrible experiences at an appalling accommodation place in Cremorne (north shore) and the wotif.com.au organisation had changed my booking for the rest of my stay to the Rydges Hotel at North Sydney. This hotel is over 30 years old. It is in need of a good clean and some changes made. My room was on the first floor. When I got out of the lift, the carpet was really dirty and looked like it hadn't been vacuumed for a week! It was an old, stained, red striped carpet. In the bathroom there was black mould on the tiles behind the bathroom sink. I had asked a cleaning staff member to clean it, but he could hardly speak English and told me to report it to the reception desk. I did this and reception told me that they would send someone to clean it while I was out. But this did not happen. I again reported it. They did clean it this time, but only very 'half heartedly'. The mould was still there. The power point for 'appliances' in the bathroom was not working. The carpet around the bed etc had not been vacuumed properly. The air conditioner controls on the wall had no cover and would not change from 18 degrees. This was too cold, so I had to sleep the entire stay 'sweltering' instead. There were not enough coathangers in the wardrobe and nowhere to hang my formal dress (that I was wearing to the wedding reception) so that it did not crush on the bottom. When I came back to the hotel after the wedding service to get changed for the formal reception, my room had not been made up despite it being 2.00p.m. While in the shower with a 'do not disturb' sign on the door, a maid simply opened the door to my room and came in. When I told her that I was getting changed and could she come back in half an hour, she could not understand me and obviously did not understand the sign on the door! I ordered room service for breakfast and my eggs were still raw on the top!! The bacon had not been fried but simply 'microwaved' and tasted just awful. When I got back from the wedding reception, the lifts were out of order. The Russian woman on reception argued with me and another guest telling us that the lifts were working. When we could finally get her to get up off her chair and come out to look at the lifts, she said that they weren't working! No apology to us for arguing saying that they were. She then took myself and the other guest to our respective floors in the service elevator with all the rubbish!! I would NEVER stay at this hotel again. It is old, dirty, staff that don't speak good English and a 'don't care' attitude. They also tried to charge me for my room for the stay despite me telling them that I had already paid via the wotif.com.au website. I was also charged a different amount to that quoted to me by the wotif.com.au staff.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Best nights sleep :)”", "Author": "Jagdaly", "ReviewID": "UR120556445", "Content": "2nd visit to the Rydges, stayed in a one bedroom apartment with views of the river . Service is great, the rooms are very nice and clean and the beds are the best ! so comfy... location for sightseeing if you want to walk about is very hilly but there are some lovely parks and a good little shopping centre fairly close by with a train station that will get you out and about. The restaurant located in the ridges was great and the food was excellent, check out the early bird specials.Balcony was a bit small and there was no chairs or table which would have been nice.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Great value for modern family 2 bedroom suite in city”", "Author": "thefareast", "ReviewID": "UR120379199", "Content": "This is the 2nd time our family have stayed here while on holidays in Sydney. The 2 bedroom suite is large, well presented and excellent value. The property is modern, well maintained and provides very good levels of service. It is very convenient to the lower North Shore, and still in the city with direct access to the Harbour Bridge freeway.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great place to stay in North Sydney”", "Author": "Bubbles-in-Oz", "ReviewID": "UR120063294", "Content": "We stayed 2 nights in a harbourview room, on the 11th floor. Unfortunately, the view was restricted by a large multi-storey building. If you are going for the views, ask for a room to the north side of the lifts....unrestricted views there. The room was spacious, clean & well decorated. The bathroom was a good size, clean & well equipped. The hotel staff were helpful & courteous. Breakfast was $27.50 per person...way too expensive, so we had breakfast out each morning at one of the nearby cafes, & I was disappointed to learn that I couldn't use my Rydges Priority Guest card to get the meal discount at breakfast. Parking was $17 per night extra, a tad expensive as well. The hotel is about a 10 minute walk from North Sydney station, but is away from all the traffic noise. I would stay here again, but would probably not worry about the harbour views. Park view rooms just as nice.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canberra", "Title": "“ok but need refurb”", "Author": "GFurness", "ReviewID": "UR119781380", "Content": "i stayed at the hotel with my friend the hotel was ok but the room was small and the hotel looks a bit dark. the services were great but it would be even better if the management can consider to give the hotel a face lift and i am sure many regular traveller like myself would certainly recommend more friendss and family to stay.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bowral, New South Wales, Australia", "Title": "“A few miles on the clock, but comfortable and quiet.”", "Author": "BFD", "ReviewID": "UR119645262", "Content": "Stayed at the Rydges with my wife and daughter. Very professional front counter staff, and the hotel is in a good quiet location, considering it if very close to the expressway. Rooms look to have been refurbished some time ago, but a beginning to show their age a bit. All in all a comfortable stay, a quick cab ride to the city, and polite and helpful staff.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bowen, Australia", "Title": "“Nice, needs a refurb”", "Author": "jofarmer7", "ReviewID": "UR119509354", "Content": "We only stayed here for one night, and it was reasonable. They are in the middle of refurbishing the hotel rooms which is in dire need. Our studio room was refurbished, however our friends in a one bedroom apartment was not. The mirror was falling off the wall, the paint and moulding was coming off the walls and it needed new furniture as well. Not very good lighting in the room either. Obviously they only put new pictures of the refurbished rooms on their website. The staff was friendly and accommodating and apologetic about their recent upgrades. My advice would be to make sure when you book you ask for a new refurbished room. There is an excellent thai food restaurant Simple and Irresistible within walking distance of the hotel. Great recommendation by the hotel staff. There is also a great cafe Jago's on Miller within a short walk as well.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Good hotel”", "Author": "LancashireGlasshouse", "ReviewID": "UR118523039", "Content": "We stayed at this hotel in September 2011. The staff were very friendly and helpful. The rooms were spacious, spotlessly clean and comfortable. The bed - one of the comfiest I have slept in (or 'overslept' in!!). It was in a quiet area of the CBD and had easy access across the harbour and to Milson Point + McMahons Point etc. The restaurant and bar were a bit pricy, but there were plenty of other places to eat around Miller St and Walker St. Free WiFi in the hotel lobby - payment plan if used in the rooms. I would definately stay here again.", "Date": "September 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Australia", "Title": "“enjoyable stay”", "Author": "ellietia", "ReviewID": "UR117069869", "Content": "We spent two nights here in a two bedroom suite, first impressions of the room was yes its dated and in major need of a refurb but it was spotlessly clean. We were here to spend our time out and about in Sydney so really didn't spend much time in our room. The staff are the biggest asset, very friendly and helpful and polite (special mention to the cleaning lady who did a great job on a tidy up of the room). Plus the beds were so comfortable, the most comfortable I've slept on in a hotel and so were the pillows, didn't have to fluff and plump these ones up nor feel like your sleeping on a rock. Buffet breakfast was included in our room rate and happened to be very good with a huge selection of food ( bacon, scrambled eggs, sausages, mushrooms, tomatoes,hash browns,baked beans, cereals, breads, croissants, juices, coffee, selection of tea's etc). We also ordered room service one night, this was delivered fast and tasted very good. We found the location quite and a good spot to base ourselves for shopping (Chatswood) and footy (Sydney football stadium). Would stay again if we got a good room rate..and free parking (where else are you supposed to park if you didn't pay the $17.50 a night)", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Canberra, Australia", "Title": "“Definitely NOT a 4 star hotel...”", "Author": "idatoms", "ReviewID": "UR115633590", "Content": "Just got back from a 2 night stay (19-21 July) at North Sydney Rydges and I have to honestly say I was very disappointed. When I booked this hotel I was expecting a 4 star hotel but it definitely didnt live up to it. Stayed in a 1 bedroom apartment with 3 adults and 1 baby. Some of the things I found: - not enough lights in the apartment. whatever lights available were yellowish and dim. - toilet paper rolls were almost empty when we first got there with no new rolls available until we called housekeeping - the bathtub had hair everywhere from previous visitors - the kitchen cubpoards were filthy - the kitchen scourer should have gone to the rubbish months ago it was that filthy - there was no tea towel available - there was no dishwashing liquid available. when we requested, we were provided with sachets of laundry liquid. We requested 3 times and they kept giving us laundry liquid. Fourth time, after I complained that it wasnt what I needed they came back with dishwashing liquid. Finally. But according to housekeeping, it was their regular practice to provide laundry liquid for visitors for dishwashing purposes. - the fridge was about 30 years old. - asked for a baby highchair the first night and while I was told one would be brought up I never got one until I called again in the morning. - the heating in the apartment was inadequate, they had to bring up extra heaters when I told them the room was very cold. - no concierge to help with the mountain of luggage we had. On a positive note, the staff were friendly and helpful. Let's just stay I wont be staying at this hotel anytime soon.", "Date": "July 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value, great location, lovely room but tired bathroom.”", "Author": "Julesmia", "ReviewID": "UR115029162", "Content": "I stayed at this Rydges last weekend and thought they had done a great job with the rooms, but the bathrooms could be updated. The hotel itself was nicely furnished, with a lovely breakfast area, inviting bar/lounge area, and staff were friendly. Good parking access, great location just minutes walk from the train station, pubs and beautiful North Sydney surrounds. A very quiet spot in the heart of a busy business district so the weekend rates are great value for money. I'll be staying there again next time I'm visiting!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sunnyvale, California", "Title": "“great location if you're meeting with all the tech companies in North Sydney”", "Author": "jsysmans", "ReviewID": "UR114770684", "Content": "I always stay at the Rydges in North Sydney during my business trips to Sydney. You won't find the greatest luxury nor the best hotel restaurant but the rooms are good, beds are excellent and if you're meeting with the tech companies in Sydney, most are located in North Sydney, so you're only a 10-15 min walking distance away. You have several parks close by so its a great place to start a run. Hotels in Sydney are expensive, so the overall price/quality puts the Rydges as a good business hotel destination. There is no gym but the Rydges sells day passes to an excellent gym 5 minutes away. However if you're looking for a romantic getaway, this is not the place. Tip, become a Rydges member to get a discount on food and Internet access.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London", "Title": "“Nice hotel - good breakfast - friendly staff”", "Author": "LondonPam82", "ReviewID": "UR114125199", "Content": "My partner and I have stayed here a couple of times and have always found the hotel clean and tidy. We stayed for the queens birthday long weekend and had a lovely time despite the constant rain. Previously when we have stayed here the weather has been good and walking down to the harbour, Kirribilli, Luna park etc no problem. There isn't a lot of things open around the hotel on the weekend, North Sydney is pretty dead. But the rain stopped long enough to walk to Crows nest where there are plenty of places to eat. Getting into Sydney from the hotel is easy with the bus stop at the end of the road, only took us about 7 minutes. All the staff from reception desk, bar and in the breakfast room were all very pleasant and helpful. We had breakfast included in our tariff and we loved it. For a vegetarian there was also plenty to eat. We had a very nice room that had been renovated. After reading some of the comments previously, i'm surprised there has been so many complaints about the bathrooms, as we haven't had a problem either time we stayed. We are generally pretty fussy with having a clean bathroom maybe we were just lucky. North Sydney Ridges is a good place to stay if you don't mind walking to get to restaurants or tourist attractions, but it's easy to access by public transport. We also like it here because you don't have to pay for parking on the weekend on the streets, which saves about $25 a night. We stay in hotels in Sydney regularly and will definitely go back to this hotel, I think the price is very reasonable.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Unhygenic, and somewhat worn”", "Author": "JamesK4242", "ReviewID": "UR113749377", "Content": "Stayed 2 nights as a business traveller and so did not have the best rooms. Pleasant room, bathroom worn, corridor outside rather worn. Appreciated the work desk in the room with connections for my notepad to use the TV as a monitor - more places should do this. However this being said, I had an unpleasant surprise when on the first night I discovered someones else's snot on the inside of the shower curtain (3 places), such things happen sometimes. This was reported in the morning to the desk. I returned that night to discover that even though the room had been cleaned the shower curtains had neither been cleaned nor replaced - it appears the Hotel considers this condition to be acceptable. I will not return, or ever eat there as how can I trust their hygene in other areas?", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Australia", "Title": "“Nice and homely but bit out of the way, bathrooms a disaster”", "Author": "MndM", "ReviewID": "UR110322665", "Content": "Overall the hotel is nice and modern after their renovations. Staff were very accommodating with a late request for a change to the bedding configuration after some in our group switched rooms. Very impressed. We weren't tourists, but if you were it's probably a bit out of the way. Part of our stay was over the weekend, and North Sydney is absolutely dead, barely anything open. There is a train station a short walk away though, and it's a good place to stay if you need to be in North Sydney The actual room was nice, but I'm on the bandwagon of unflattering comments about the bathrooms. They are terrible. Probably the worst hotel bathrooms I've seen. Cleanliness wasn't an issue, but it really dragged down the hotel experience. Such a shame because overall the experience was positive.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bangalore, India", "Title": "“Stay only if you have business in North Sydney”", "Author": "Good_Tiding", "ReviewID": "UR108612821", "Content": "I stayed in this Rydges property for a week in April. Since our office is just a street away this was a convenient place of choice. The closest train station is the North Sydney station which is a 15-20 min walk. The check-in formalities were handled efficiently and the front-desk was helpful with providing information about the neighborhood (directions to restaurants, train station etc.). The room seemed small and bit to crammed. The beds were comfortable. The bathroom needs some plumbing upgrade. There were certain rust stains in the tub and the hot-cold water shower did not function properly. The hair dryer in the room was not functioning. Room service was quick and efficient. The room tariff included breakfast. The breakfast spread is alright and does not change from day-to-day. So if you have a long stay here be sure to hop out elsewhere to get some variety and change. The hotel does not have a swimming pool or a fitness center. There are few parks in the vicinity which can be used for a jog instead. They charge a bomb for internet accessed from rooms. The internet is free in the lobby. Overall the hotel is overpriced since it does not provide for some of the most basic amenities. The only reason I would go back to this property is because of the service and of course the proximity to work.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“Good value”", "Author": "CanberraMum86", "ReviewID": "UR107621411", "Content": "I stayed in a studio room with my 2 young kids over the Easter break. I got a good price for 2 nights stay through their Rydges Priority Guest program (which is free to join). Overall I am pretty happy with my experience there : ) I chose this hotel because of its proximity to the Zoo (only 15mins drive), although the hotel itself is in a rather random suburban location. It is a little bit secluded, surrounded with greenery which was unexpected, but lovely. The appearance of the hotel was a little disappointing, could definitely use an upgrade. As soon as we arrived, the hotel staff were exceptionally friendly and helpful, probably the best customer service I have ever encountered at a hotel. The gentleman helped us with our baggage and took it up to our room for us, and we were checked in without delay. The room itself was average, but clean. No complaints but could be nicer. The welcome message on the LCD TV was a nice touch. I used their internet service and got a discount for being a RPG member. The only huge disappointment about my stay was the BATHROOM! It is in DESPERATE need of an upgrade!! It is moldy and dated, a huge let down. My deal included buffet breakfast, which was nothing special but enough for us. The view at breakfast was lovely with the surrounding greenery. The staff at breakfast were exceptionally friendly. I would probably stay here again if they upgraded the bathrooms : )", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Avoid at all costs. Plenty of better alternatives than Rydges.”", "Author": "Vabeniss", "ReviewID": "UR106021443", "Content": "Mould in the bathroom. Noisy rooms with road noise and adjoining room noise. Lousy understaffed restaurant, no espresso included with breakfast etc. The bed is comfortable, but the overall impression is that this hotel is shabby, absurdly expensive for what it is and basically a tired, under serviced cashcow for it's owners.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“So peacefull and great kids deals :)”", "Author": "sandjodi", "ReviewID": "UR105697982", "Content": "A lovely place to stay, had paid in full through agent in Adelaide but once on arrival they didn't have my details even though I had paid in full months prior to our stay. Where going to charge us again and said they will refund our money once they get confirm from our agent in Adelaide. I showed them my Paid In Full receipts adn where still against this as well. They finally spoke to agent and confirmed my booking and they then located my booking in their system. Nice place to stay, great buffet breakfast, Luna park tickets included in price. Will be back again later in the year.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Very well priced, professional staff with great attitude and a pleasing room.”", "Author": "Shimarlie", "ReviewID": "UR104703788", "Content": "Believe it or not, I live not more than 50m away from this hotel, so I know the area like the back of my hand. There is a lot to like about Rydges at North Sydney. Firstly the room have just had a revamp, so new furniture, new beds, carpet and a paint job, and overall it's very pleasing. The rooms are comfortable, several lamps, modern flat screen TV's, new desks etc. They have some nice little touches in there like having a little input panel where you can plug in a USB cable, HDMI cable as well as your standard audio cable so if you want to bring a game console, or output your computer or charge your devices you can. The hotel is located quite near the highway, but noise is absolutely not an issue. The rooms seem extremely well insulated and blackout curtains reduce an further ambient noise to nothing. The new beds are extremely comfortable, I stayed for 4 nights and had a wonderful nights sleep each night. Other facilities in room are what you expect to see with internet/room service...all the standard fare you'd expect. Rooms were well cleaned and organised. Mini bar has a decent array of snacks and drinks. Big positives, every single staff member I dealt with was EXTREMELY professional, meticulously well groomed and helpful and genuinely friendly and this is a very big point. We ate at one of the restaurants downstairs which was very nice, and had a great atmosphere and was well priced. We stayed 4 days, they changed us around on the second day to a room on the eleventh floor with great views over Neutral Bay. Location is excellent. You're 10 minutes walk or less to the heart of North Sydney, buses are about 3 minutes away that can take you to the city, or to the zoo, train station is 10 minutes walk and you could walk to the ferry in about 20 minutes, the same with Luna park and the Bridge etc. If you're driving you're about 1 minute away from the Freeway heading north/south. North Sydney itself is a very pleasant place to stay, its very quiet, very leafy and a nice respite after spending the day in central CBD. Negatives: The only thing I would point out for negatives would be the bathrooms. The renovation seems to have been limited new carpets, beds, furniture, fixings, new paint etc...but the bathrooms are old. There are chips in tiles, the baths are very small and shallow and the pressure not so great. They are without doubt a bit tired. They were not dirty or mouldy - just showing their age. For me, a relaxing bathroom is pretty important to me when I go away because I like to have a soak in the tub etc and to be honest, this is a purely functional bathroom, you won't be sipping a glass of champagne in their with your partner. However, given the price of the rooms and everything else it has going for it, it did not massively detract from the whole experience. Summary: Overall, this is a really lovely hotel to stay in, the grounds are beautifully manicured, the rooms cosy and friendly, the restaurant good quality and inviting and their staff a real asset to the them. My overall impression is overwhelmingly positive and I would recommend a stay to anyone...", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Relaxing & convenient”", "Author": "Denise255060", "ReviewID": "UR103566759", "Content": "I must admit we weren't expecting much after reading some of the reviews but were pleasantly surprised. This Hotel is perfect for a quick weekend escape. We wandered around North Sydney, gazed at the Harbour from our room and had drinks in the lovely intimate bar. Our room was spotless and the staff were very friendly.The first night we ate at a restaurant in North Sydney - such a nice walk to get there. Second night we stayed in and had room service which is such a treat and the food was great. We will come back for our next break from the kids.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Over priced”", "Author": "saws7", "ReviewID": "UR103102239", "Content": "Stay 2 nights while on business. Room was OK but nothing special. Bathroom outdated. Paying top dollar for probably a 3.5 star hotel", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Really comfortable beds but amazingly slow elevators”", "Author": "jwallybrown", "ReviewID": "UR99069705", "Content": "My husband and I, along with friends, booked a Saturday night package with Rydges that included entrance to Taronga Zoo's concert in the zoo night. The room was clean (the furniture was a bit dated) and the bed was amazingly comfortable. The bathroom was large and the bath products provided were very nice. The major issue was the elevators. The hotel was at capacity that weekend and we were waiting up to 15 minutes for the lift to get to the lobby. We tried to take the fire stairs but they did not let off at the lobby and instead lead into the parkade. I am sure that if the hotel was not at capacity the elevators would have been much quicker. The next day we went for breakfast, which was included in our package. It was first come, first serve and was complete chaos! As we were a large group we were told we would not be able to all sit together. When I asked if we could sit at the empty bar the host said yes so at least we all managed to sit together. The kitchen was understaffed for such a large event. The food they were preparing was very tasty but there were food items missing from the buffet. When I went up to get my breakfast there were no eggs or bacon and no coffee. Others in our group found there were no tomatoes or mushrooms when they went up. If the hotel had planned better for being at capacity and schedule seatings for the guests for breakfast it would have been a much more relaxing experience. I think that Rydges would do well to have the appropriate number of staff on when they market an event and know that the hotel is going to be at capacity.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Blue Mountains", "Title": "“Great location, dirty room, overcharged breakfasts.”", "Author": "TimberBlueMountains", "ReviewID": "UR95974870", "Content": "My wife and I stayed at this hotel for two nights after seeing a \"sizzling hot summer deal\" in our local paper. We have used such deals before and had had only one bad experience,( and that hotel closed it's doors three months later). We were not anticipating the best room in the house, but we did expect it to be clean. It was obvious that it had not been vacuumed, there were also dirty marks on the bathroom wall. A cleaner knocked on our door on the second day about 2 in the afternoon, and asked if we wanted the room cleaned, we had just come back from the city, it was a hot and humid day and we had no wish to go anywhere for awhile, so we declined. Why it wasn't clean to start with we don't know. When booking over the net, we had the option to pre-pay for a number of things one being buffet breakfast. The listed price was $12.50 per head. We did not know whether we were going to have breakfast on both days so decided not to pre-pay. There was no notice that failure to pre-pay would cost you! We had a buffet breakfast on one morning only and when checking out were slugged $50. This was queried, the reception person had no idea what the prices were on the website and we were left to pay the $50. On returning home we sent an email to the head office, and received a phone call from an employee 2 days later. He said he could see how we had become confused and he would have his IT people look into it. No apology no offer of a refund. Let me assure you, the website still listed buffet breakfasts at $12.50 per head that day, and it probably still hasn't changed. No confusion folks just a rort.", "Date": "February 9, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Queensland", "Title": "“old, tired. and a poor nights sleep”", "Author": "Misskatie_kate", "ReviewID": "UR95721142", "Content": "We stayed in Rydges north sydney for 1 night last week. and was not impressed. The rooms are old. very old and tired and desperately need a refurb. A couple of flat screen tv's don't disguise the fact the bathrooms are straight out of 1985. however that is acceptable I suppose. The main problem was that the AC worked for a while then turned into an awful racket. this occurred late at night so we didn't bother contacting the staff. Also the bed/pillows were about as old as the room. (see my photos). They say they are refurbishing the place and it looks like the've done the dining room and bar, which were nice. we even had an excellent tapas meal. but overall this needs some serious attention. Plus it really annoys me when they charge 1.5% to use a visa or mastercard. I can understand for amex, but for visa is just plain gouging. They did offer us to pay cash!!! for no fee.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Weston-super-Mare, Somerset", "Title": "“Liked it here”", "Author": "mtfromuk", "ReviewID": "UR91536670", "Content": "Had to relocate away from the City centre due to the enormous hike in prices all the hotels apply for the New Year and although this is more of a business venue rather than tourist, it was streets ahead of the previous hotel we were in at Darling Harbour. The room felt as homely as a hotel room can be and the extra touches such as the friendly accomodating manner of all the staff, free lobby wi-fi and printing, free car parking and a balcony with a harbour view made the stay here a very good one. It was easy to get into town from here and we wlaked the harbour bridge which we otherwise wouldn't have done. We have stayed 3 times with Rydges in Aus and New Zealand and our experiences have always been good ones.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Queensland", "Title": "“Good accomodation let down by a poor dining experience”", "Author": "old44", "ReviewID": "UR89715159", "Content": "Booked a 2 bedroom suite which was spacious and very comfortable. Still an expensive proposition but is in a lovely area of Sydney and the beds are wonderful. Bathroom is showing its age and some mould was obvious, paintwork and carpets seemed a little tired and the colour choice made the rooms seem older then they are. Had a good view but not much of harbour. 800 metres or so from train station and the area is a little hilly. Staff on front desk were very nice and helpful. There are few dining areas close and the in house restaraunt Mondo was an apalling experience. Having a hi tech ipad menu does not make up for poor service and a very ordinary menu. The menu was limited and the food was poor. If you are going to have the kitchen open and obvious surely you would try to look at least a little interested in what you are preparing. The wait staff were disinterested to the point that in the end we served ourselves our own wine the entire meal .The food was bland( how you do that to a curry I don't know) and overpriced. We have dined widely both here and in Europe and I cannot think of a more ordinary meal and dining experience from the supercillious staff member who patronizely told we poor older folk how to use his useless menu to the waitress who obviously misunderstood the term waiting.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Liverpool. UK", "Title": "“Tired Hotel and Out of the way”", "Author": "WirralLiverpool_UK", "ReviewID": "UR89691098", "Content": "We stayed here 4 nights as we were recommended to as we attended a wedding nearby, what a mistake this Hotel needs revamping badly the rooms were OK in a 1980's type of way the corridors were shabby. The Restaurant , well breakfast was not bad and the Tapas at the the evening time very quite good, the location is poor its a 15 min walk to the train station and Taxis circa $25 into the Opera House area, it would have been better and more convenient to stay around the Rocks area and just got a taxi to the wedding at least we would have had plenty to do on the doorstep rather than being stuck out over the other side of the bridge! This place has no swimming pool or even an Area to sunbathe or relax outdoors and finally its a rip off for Internet connection in the room although you can get free connection in the Lobby surely in this day and age Internet connection should be free as it is most decent hotels anyway.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bathurst, Australia", "Title": "“Very helpful and polite !”", "Author": "davidkc", "ReviewID": "UR88298820", "Content": "My wife and I arrived early for a wedding and were very happy that our room was ready after a request of early checkin on 12pm, situated on the 12 floor which gave us an unreal view. The staff always polite and very professional and polite . The only negative comments would be the air conditioning , which doesn't seem to get cool enough. The bathroom does need updating. I would recommend this hotel and certainly would stay again. Thanks dave", "Date": "November 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Victoria", "Title": "“Superb view; Fantastic comfortable 'Dream bed'! Ensuite a bit dated”", "Author": "abc123Victoria", "ReviewID": "UR84397027", "Content": "Stayed in a 'Harbourview' doublebed room(12th floor) -which had a queen size bed. View was great. Despite my back problems and gastro- upset, for the 2 nights we stayed here, we slept well. The Rydges 'Dream bed' was simply fantastic. General room comfort was very good. Ensuite was a bit dated & has shower over the bath. Apparently they are starting to renovate the rooms. Bit dusty around the skirting boards and sill's(base) of the furniture -so housekeeping needs a rev up. Good big screen TV but DVD's cost an outrageous $15. VERY nice breakfast which covered all the bases -even had soy milk. Family had 2 more rooms on same floor and no complaints from them. Their park views were very nice too. Would definitely stay in the Rydges chain again. Good value for money compared to other hotels of similar type on North Shore. About 800m walk down Millar St to North Sydney Train station (swap at Central for the train to the Airport).", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“I could not fault this hotel”", "Author": "Kells11111", "ReviewID": "UR83537849", "Content": "I have looked at the below reviews and i dont understand how it is possible to say such 'negative' things about this hotel as i could not fault them. I stayed there recently with my husband and two kids in a parkview suite. We were welcomed by a vibrant extremly helpful and friendly receptionist who checked us in and offered great advise on what to do in Sydney. The room was clean, well maintained and quiet. I do have to add i had the best sleep i have had in awhile on the 'Dream Beds'. Not to mention it was so quiet and peaceful with no traffic or train noice. This hotel is a four star hotel for a reason and i will definetly be staying at Rydges North Sydney again.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A friendly choice for a Sydney hotel”", "Author": "Metal_Detect0r", "ReviewID": "UR82678436", "Content": "For a hotel that is firmly oriented at the business traveler we surprisingly enjoyed our family stay. I can attribute that to several factors: 1. The staff were exceptionally friendly and helpful. 2. The room was modern and well equipped. It is, however, equipped with the business traveler in mind. 3. The bed was one of the best hotel beds I ever experienced. Usually I suffer on hotel beds, but this time I slept like a brick. On the other hand, there were lots of negatives with the hotel, too: 1. The hotel charges an exaggerated 1.5% surcharge on any credit card payment. Even the hotel restaurant charges this stupid surcharge! They didn't mention that surcharge when I made the booking... 2. While the main room is modern, the toilet/bath are anything but. 3. The rooms are rather smallish. Again, this won't trouble the solo business traveler, but for us things were rather too crowded. 4. On our second night the toilet stank of cigarette smoke coming in through the ventilation. It was horrible! They should do something about it, like installing smoke alarms in rooms' toilets. As for facilities: 1. Parking: The hotel has its own parking lot underneath, charging $15 per day. 2. Internet: There is free wi-fi at the lobby, which tends to make for rather social evenings. None in the rooms, though.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Newcastle, Australia", "Title": "“this hotel puts the 'oor' in POOR.”", "Author": "RAIDER81_10", "ReviewID": "UR82250109", "Content": "This was the dirtiest hotel that I have ever stayed in! There were piles of dust EVERYWHERE. Carpet, needless to say was filthy! No vaccuum was done for the entirety of our 3 day stay. Mould in the shower, mould in the fridge. Dirty cupboards and cutlery. Food in the room service tray that was well past it's USE-BY DATE..... Beds were not made. Blood stains on the covers, urine stains on the mattress protectors, and skid marks from our previous guests in the toilet........ I will take further action with this hotel, because it is THE MOST UNDESERVING 4 STAR ACCREDITATED HOTEL AROUND! There is absolutely no way I would ever recommend this hotel, and I will never again stay in a RYDGES chain hotel. DISGRACE.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tweed Heads, Australia", "Title": "“MMMMM.not sure”", "Author": "lennysv6", "ReviewID": "UR81526271", "Content": "Very musty in the room bathroom a bit dirty felt like we were in the70s breakfast buffet was good handy location cant understand why 1 night is $250 then $180 then $149??? very small room,not sure if i would stay there again.good location.", "Date": "September 29, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "perth", "Title": "“Need help from Management”", "Author": "cutie_apple", "ReviewID": "UR80098737", "Content": "Hi I am not sure where it is appropriate to write in here. This is not a review so I will apologize in advance. However, as I am reading the other reviews I noticed that the hotel managment are monitoring this. So I am seeking help t o clarify some issues before deciding to book with this hotel. I am have looked into the website and cannot ascertain much info. I am planning to book the christmas period. My questions are: 1. The one bedroom parkview: what is the bed configuration? - As I will be travelling with my husband and also my cousin - Is there privacy between sleeping arrangement? - I take it that the bedroom has a door and the 3rd person will be on the sofa bed, is the sofabed comfortable? - As it is my cousin's first time in Australia, I do not want him to be on an uncomfortable bed, if it mean I will need to book 2 rooms I will consider this. But the price is quite reasonable. So please advise. 2. How far away is public transport? As we won't be renting a car, need t be near public train station so we can access the tourist attractions. 3. To and from the airport? What is the best way to get to the hotel. Thanks for your help. I apologise again as this is not a review. But I thought those who have stayed here can help me decide whether to book this hotel. cheers", "Date": "September 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "melbourne victoria", "Title": "“Great Value!”", "Author": "broadford_10", "ReviewID": "UR79592025", "Content": "Rydges North Sydney is in a wonderful location & suited my needs perfectly. I stayed for nine days. The staff were very friendly and helpful, always asking if there was anything I required. The Manager (Chris?) upgraded me to a wonderful suite with a view over the Harbour on one side and a balcony on another. The extra $15 per day for their car park made my stay run extra smoothly. I and friends sampled the bar, the restaurant, as well as room service. It really was a home away from home while I attended a wedding, had a son in hospital and so on. I would highly recommend it.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“What do some peolple look for when they write a review because my wife and I could not have faulted our stay.”", "Author": "werridaddio", "ReviewID": "UR74256314", "Content": "We recently had two nights, three days at Rydges and we could not fault our stay. We had a harbour view room and although the rooms were a little dated it did in no way mar our stay and I really do think some people who write a review must go into a room where they stay for the sole purpose of finding faults. We ate out each night not because of the hotel's restaurant but because within close proximity there were a range of restaurants and pubs. We did however have the full buffet breakfast each morning and it was exceptional. The CBD is just a short 5 min train trip across the bridge or you can do what we did and enjoy the sunshine on a walk across. The beds were extremely comfortable and the hotel itself and the surrounding streets were very, very quiet (unlike most hotels in the CBD which charge 3 times the price) I know we will be looking for a reason to return, maybe a Taronga Zoo visit next time.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Trying hard but tired”", "Author": "ItchyFeet58Australia", "ReviewID": "UR72638861", "Content": "I stay here often for one reason..location. It is convenient for business. Bar and restaurant has improved lots, staff try hard, but lifts, air conditioning and hot water are what they always were-relics from the 70's. Long delays for lifts at peak times, hot in summer, cold in winter and low water pressure.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Worst hotel in North Sydney by far - don't stay here”", "Author": "Ispkh", "ReviewID": "UR69434899", "Content": "This place is terrible! The rooms desperately need updating and a good clean! Room service menu had mostly no items available unless you wanted pizza. The iPad option in the restaurant is bizarre, if you can afford to spend money on those devices surely some service training would be money better spent. The night auditor blocks each lift floor to deliver breakfast trapping you in the hotel as the other lift then doesn't arrive. School Music group staying who spent all night practicing and banging doors staff unable to stop them despite being asked every hour. Don't stay here, stay in the city - it's worth the cab fare", "Date": "July 2, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Forestville", "Title": "“North Sydney Rydges - Good Experience”", "Author": "richardk24", "ReviewID": "UR67932199", "Content": "I thought that the Rydges North Sydney was very nice to stay at last night. Positives Nice room Comfortable bed No noise Not positive Service was slow at the Mundo resturant - Thought it was not value for money at all.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great set up and fantastic value”", "Author": "crsimma", "ReviewID": "UR67456280", "Content": "Spent one night here and really loved it. The family room (with 3 teenagers, husband and mother) was roomy and had wonderful views. Beds were really comfortable and extra TV in main bedroom was a bonus except husband watched AFL footy into the wee hours. Breakfast was really good value and delicious and newspapers were plenty.....thoughtful touches made all the difference. Would recommend to anyone. Position is also very handy to trains and buses and surrounding streets and shops were lovely. Thanks. Chris from Melbourne", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Best sleep I've ever had”", "Author": "bears345", "ReviewID": "UR66124822", "Content": "When I first stepped inside the hotel, I already started to doubt the stay would be good. Checking in was a breeze with the Priority Guest web check-in service. Reception was friendly and things started looking better. I was given my Taronga Zoo tickets in an envelope which I felt excited about. We parked the car in the underground parking - there was only one spot left luckily for us! When I stepped into the room I saw that the chocolate dipped strawberries were on the table - phew I thought, luckily that was done otherwise I'd have to ruin the surprise for my partner and call reception ): The hotel I admit is a little bit dated. Our room was a little dusty. When I grabbed the kettle to boil water for tea I realised there was still water in it, had to wash the kettle because I didn't feel like calling reception for another one. We decided to call reception to ask for a list of nearby restaurants, they had someone bring it up to us. At the end of it we thought we'd just order room service. Unfortunately being a vegan, I was unable to have a hearty meal so I ordered the steamed edamame beans to snack on. They were pretty gross ): I'd never had edamame beans before so I don't know how theyre supposed to taste but they were furry and hard. My partner on the other hand had a burger and he absolutely loved it. I had the best sleep in a hotel I've ever had in my life. The bed was so amazing I am planning to buy one. I knocked out so hard and fast when I jumped into bed I didn't want to wake up when the alarm went off for breakfast. Breakfast was another drag - had to have cereal & soymilk with bread & peanut butter (being a vegan). My partner seemed to like the breakfast buffet though he thinks there should be more options! I was extremely pleased with the free Wi-Fi on ground floor, it was pretty fast internet. I was extremely impressed with reception staff after they offered us Umbrellas (they gave us a massive one each) because it was raining that day and we went to the zoo anyway. They supplied us with maps on how to drive there and gave us verbal directions for reassurance. I didn't want to go home at the end of my stay ): I had a great experience although some of the above might sound negative, it is far from it, I just wanted to be as detailed as possible. I loved the friendliness of the staff (all types of staff, reception, restaurant, room service, house keeping, mini bar) and how they try to go out of their way to help, I loved the \"homely\" feel and I loved being able to sleep in a strange place due to the best best best bed I've ever slept in.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "New Zealand", "Title": "“Extra Mile service, comfort, good sleep”", "Author": "Particularwhynot", "ReviewID": "UR65576392", "Content": "This hotel is just great and the service exceptional! I was new to sydney at the time and was disappointed there was no pool or gym but that did not matter in the end. I had a late night and got back early in the morning- I was starving...the orders for breakfast had to be placed outside your door before 2am but I tried anyway to order over the phone around 6:30am.. a friendly young lady managed to stay friendly on the phone and help me decide on a meal that I wanted and around my budget as well.. I usually fuss with overpriced breakfast meals hehe... I actually fall back asleep soon after then by the time they could get a hold of me she came up to give me my breakfast at a comfortable price of $10 for 2 hot poached eggs on toast with 2 hash browns delivered to my room! I checked out early around 5pm on my second night to stay closer to central sydney, the hotel advise me that next time if I tell them before 3pm I could get my money back for this night I paid for. Most hotels wouldnt dream of advising such a thing right. Overall the rooms are very cosy with a good enough parkside view as well, very quiet and spacious bathroom sink area, bath. all for a great Priority Guest Members rate of $119ASD. I would definitely recommend this hotel for just the right invited feeling!", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Port Macquarie, Australia", "Title": "“Pleasant surprise!”", "Author": "Topperthedog", "ReviewID": "UR65097801", "Content": "We almost cancelled after finding such negative reviews. Stayed in 2 bed apartment 213. This doesn't try to be a luxury hotel, it simply supplies all the necessaries in a spacious, quiet way. The beds are very comfortable. Okay, it is approaching the day when it will have to refurbished, but for now we will give it a big tick. It is the best 3 star hotel we have stayed in.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Nothing special really”", "Author": "Schmidtlock", "ReviewID": "UR63609173", "Content": "I stayed here two or three times in the last year. This is an ok, quite dated hotel. Way too expensive (AUD 190-280) for what they offer, but what can you? There's only three or four hotels in this very busy area. The food in the restaurant is quite good. Generally, I would recommend staying on the city-side of the bridge for better value for money. There's more competition there.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Average but room require cleanliness”", "Author": "smartaus", "ReviewID": "UR61957148", "Content": "I stayed for 7 nights in a DX Park View Queen. Location is the reason for choosing this hotel as my client office was very close. Its 10 minutes brisk walk to the train station though its uphill on return and takes longer. The Room was spacious but it looked old and dirty. The carpet is old & dirty, one of the reading lamp wasn't working. Bed was good and comfy. Bathroom was average and the shower enclosure needs replacement. Staff at the reception were responsive and check in & out was quick. Timely booking of cab for airport on check out. Had problems connecting to free wifi in the ground floor. For a four star hotel, there is lot of scope for upgrade.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Great Value For Money”", "Author": "TrevorHall", "ReviewID": "UR61253629", "Content": "Nice hotel if you need a stay in North Sydney, very good value for money when compared to most business hotels. The majority of the staff - restaurant excluded - were prompt, attentive and eager to please. There is a chauffeur service in the morning, free of charge, to take you to your Sydney destination, so it's cheaper to leave the car at the hotel than pay CBD parking rates. The restaurant was not impressive, bland food that was overpriced.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Good value”", "Author": "Befle", "ReviewID": "UR59767374", "Content": "We stayed here on a one night package which included tickets to \"twilight at Taronga\" concert which included shuttle bus to the zoo and return, and buffet breakfast next morning. Room was fine- we had a harbour view and room was clean , with good sized bathroom and beds were realy comfy. Hotel was extremely busy and it was difficult to get a park in the very crowded and narrow parking spots. Lifts were also very slow . We were on the 10th floor otherwise would have been very tempted to take the stairs. Check in and out was very efficient and all staff we encountered at reception and the bar was extremely friendly and efficient.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Newcastle", "Title": "“Not a bad option, but rooms need an update”", "Author": "ni-maree", "ReviewID": "UR58359031", "Content": "I booked a two-bedroom suite for a mid-week stay. The location is a fair walk up the hill from North Sydney train station/shops, but its in a residential area so its quiet. The reception area is modern and the staff are very helpful, however, I was disappointed by the room considering the price I paid. The room was clean but it was shabby and out-of-date. The paint was chipped and the woodwork was worn and split. There were no working lamps and the bathroom was tired and worn out. The beds were comfortable but the kitchenette was not well appointed.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane", "Title": "“What a let down”", "Author": "travellerkk_bne", "ReviewID": "UR56704555", "Content": "Upon entry the people at front desk were quite friendly. Got to the room and realised why nobody in my company ever stays here. Room was very ordinary - the shower had about as much pressure as a leaking tap - along with the mouldy walls and tiles that looked like they hadnt been cleaned in about a month. Towels had rips all through them and felt like i was drying myself with a tea towel. The refurbs they have attempted are shoddy to say the least - but at least they are trying. No parking available and the staff basically said too bad!!! Trying to sleep in a non-sound proof room was a nightmare - all i heard was the people above me trampling around all night on the floor. Obviously there is thin line of carpet covering concrete in the rooms. Oh and the other rooms doors slamming all night is a great way to get some relaxation. The only saving grace for this place was the bed - actually quite comfortable - if you can get to sleep that is. Stay away is you can!", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Europe", "Title": "“Best beds in Sydney - comfortable, quiet, lovely”", "Author": "Cacao", "ReviewID": "UR54779807", "Content": "We booked before checking Trip Advisor and after reading the reviews, I was expecting a bit of a hole. We stayed on the 8th floor in a spacious 2brm suite with our children for 2nights. The 'heavenly beds' were indeed heavenly. You felt like you were sleeping in a cloud. We had beautiful views over the park and treetops of North Sydney. We were offered a special half-price deal for breakfast at $12.50 per adult which was great value. We ate freshly made pancakes, drank smoothies, ate pastries, cereal and the usual array of hot breakfast delights. We took our laptop down to the bar and enjoyed the ambience whilst using the complimentary wi-fi connection. I'd definitely recommend this hotel, we found it to be a wonderful place to stay and not at all 'tired'.", "Date": "January 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Brisbane", "Title": "“Aside from Beds, everything is 2 star...”", "Author": "lookingforsomething", "ReviewID": "UR51589822", "Content": "The Good: Fast check in/ check out, no hassles with keys/entry or exit Beds were comfortable Parking available outside (free from saturday 6pm to monday 8:30am - sunday free all day) Internet wifi available downstairs free The Bad (long list sorry): - Carpets are 3rd world quality (i.e really bad.. like crime scene bad) - Bed sheets/towels smell like bleach (bring your own) - Dirty overall... - carpets... ( I know I have to say this again...) - Beds weren't made very well... I'm not too fussy but sleeping in it caused the underneath mattress to be exposed (kind of yuck) skill up the workers!!! - Elevator gives me the creeps (not good for people with height phobias) - Looking outside on the roof you can see millions of cigarette butts (come on just get a broom) - Noisy aircon - Noisy Fridge - Useless Fridge (doesnt cool very well) - Bible had torn pages, not that I care so much but some people may find this offensive. Workers should check after guests leave. - A final note although this could be me, My eyes were very irritated after sleeping on the pillows. What kind of cleaning chemicals do you guys use? I never had this before??!! I didnt try the food simply because the place was so dirty I could imagine the kitchen could be 10x worse. To management: at least fix the above so that people can have a good \"clean\" impression and perhaps then it would do well for your business. Overall I give it 2 stars. One for the parking and one for the no fuss booking. I spent the other 2 nights of my trip elsewhere... To be honest I read the reviews before choosing Rydges but I had no choice but to sleep there for two nights because of location/availability of rooms in other hotels.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Much Better Than the reviews”", "Author": "JetVortex", "ReviewID": "UR51582351", "Content": "I was a little concerned when I read the reviews. But was very happy with what we had. We booked the Zoo package in a 2 bedroom \"suite\". There were 5 of us including 3 children. My wife and I do stay in 4* and 5* hotels a couple of times a year. The hotel was clean, staff were very friendly and helpful on check-in and check-out. Breakfast, well it wasn't 5* but everyone ate everything and there were no complaints, it was fresh and there was plenty of it. The room and the hotel are looking a little tired, they have tried to refresh the areas but really it was fine, we went to Carols in the Domain, where can you stay in Sydney with 2 adults, 2 teens and 1 child, get a bed each, full buffet breakfast, parking, (entry to the zoo which alone would have cost $142.00) and a pretty decent view for a total package price of $300.00. If you and the family want a weekend away, try this zoo package, it is good value, but have your expectations set at hotel of 3.5*.", "Date": "December 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Cairns, Australia", "Title": "“Rydges North Sydney - Average to Poor at everything they do.....”", "Author": "GlobalCitizen01", "ReviewID": "UR49623288", "Content": "I stay at Rydges Nth Sydney for several weeks a year as it is right next door to my company head office. If it was not for this convinience I would not bother. If you are happy with mediocrity at best at everything they do, then you'll be ok here. I mean the rooms are comfy enough, the price is ok, and if you need a Nth Sydney location then its located just fine. But thats all its got going for it. The restaurant and bar have just had a spruce up, its now called Mundos. The service and food is stil crap though. The food is really inconsistent. It rarely comes as described in the menu and if you can get a steak cooked how you ask for you are doing better than me. My biggest gripe is house keeping. Their ability to clean a room is appaling. Tea/coffee/milk are rarely topped up more than once or twice a week. The bathrooms are old and mouldy. Rubbish bins are rarely emptied. Rarely is every facet of the room attended to in a daily visit from housekeeping. Reception staff are inefficient, unprofessional and simply \"average\". Big TV's, comfy beds are pluses. Maybe I expect to much from a hotel of this class/price? If it wasn't next to my office I wouldn't bother. I don't bother eating here anymore, I order delivery from one of Nth Sydneys great range of places or wander down the road to one of the great cafes or restaurants nearby.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“What a relaxing hotel”", "Author": "midwicket", "ReviewID": "UR48294373", "Content": "I recently stayed at the North Sydney Rydges and was really impressed with all facets of my stay. The rooms were a nice size with LCD tv. The beds are one of the best beds I've ever stayed in (inc Sheraton and Crown Towers). Staff were extremely helpful and the area around the hotel was nice and quiet. Perfect for a good rest.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Australia", "Title": "“A hotel package that was paid by my work, that I'm glad I didn't have to pay for”", "Author": "fences4u", "ReviewID": "UR47130637", "Content": "We are pretty average easy going people, this trip was paid by my employer as a bonus but I got to pick where we were to stay. I chose the family taronga zoo/luna park package, as we googled and found this package and thought it seemed pretty reasonable value for money and a good family trip away for the weekend. The following is our feedback for the two night period of stay- *We went to the room with the key card obtained by reception and the door wouldn't unlock. I went back to reception and lady began to say \"how\" to put the card in (i guess thinking we did it incorrectly) I told her I did it correctly. I went back up to the room after she had reset the code and it still didn't work! I went back down and saw another lady and she said it had a block on it ? She removed this block. I went back up and it worked. *You may find the lift a problem at certain time frames. Most of the time we found it was quite slow. There was one instance that we were trying to get to breakfast and were waiting for the lift for a minimun of 15 minutes and it still didn't come! so we decided to take the stairs but this is a problem as when you get to the only door below level 1 it has a sign, saying the door is alarmed? So we went back up to level 1 and waited another 10 minutes and finally got the lift. I can appreciate times can get busy but surely there should be another option instead of the lift that can get you to the ground level without any hassle? *The sliding door to the balcony didn't slide very well. maybe needs needs new rollers? or maybe this was to stop any kids going onto the balcony as the door didn't have a lock - we have two children aged 9 & 6? *The bedroom lights didn't work. *The bathroom fan was constanly on. *The shower has a mind of it's own, the hot water plays up and on 2 occasions had no water at all with both taps full on - not fantastic when you are half way through your shower with a head full of shampoo trying to rinse it off!!!. *It was ironic that at one stage we were in the lift with another family and the husband said how good the breakfast was and the wife commented about the \"noisy sheets\" , this was after my wife saying the same thing prior. It didn't worry me but my wife said every movement was like a rolling in leaves sound. Also the actual dooner cover were just sheets covering it no actual cover. I suppose this might be quicker for cleaning? *My wife was dissapointed that she had brought her own hair dryer as there was already one in the room. She went to use the one in the room and it worked but the only disapointment was the thick film of dust entailed. *As part of the room package we ordered three beers on ice.This is correct it was only on ice with very minimal ice around the actual beer, so beer wasn't very cold. So no worries I went to the fridge and it was the same sort of temperature as fridge turned to lowest setting(I suppose to save power?)- Freezer was good to cool drinks! *The breakfast was part of the package and I was ok with it, the only grief was with the bacon. When the bacon was changed with new, they left the left over oil in the tray which was quite substantial. Maybee drain the oil before putting in the new? *The car park only has limited numbers, you are not assured of a spot. There are some limited ones outside and not part of the complex. You don't need to pay for these on weekends and after 6.pm and before 8.am Weekdays but there is a 2 hour limit parking limit during 8.pm to 6.pm. *I hope this helps for future improvements.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Brisbane", "Title": "“Not as bad as everyone said”", "Author": "7DC", "ReviewID": "UR38592236", "Content": "I stayed at the Rydges World Square for business a few days earlier and chose Rydges North Sydney for a week-end break with my wife. I must say I had some reservations after reading all the bad reviews on this site about the hotel and considering how good World Square was. We took the train from the airport to North Sydney station and walked from there to the hotel. It was a bit of a hike uphill but we were there within 15 minutes (it took 10 minutes after that as we knew exactly how to get there). You could also take one of many buses from the station/shopping centre and it's two stops from there on Miller Street. Our first interaction with the staff was to leave our luggage with the hotel so we could go out and explore Sydney. The lady who wrked there that morning wasn't particularly welcoming but I wouldn't say she was rude, just dry. When we came back in the afternoon, the male staff was much more welcoming and we were given a room on a high floor. OK, so the room is a bit tired (ie. carpet and furniture need a makeover) and the window seal wasn't working well when the wind was blowing hard at night. But apart from that, there was nothing else we would complain about. It was a clean hotel room and the bed was comfortable. As it was not in the centre of the CBD, we had to plan our days out carefully as we just couldn't come back when we felt like it but there are enough cafÃ©s, parks and shopping centres in town to have a breather when you felt like it. On our last night, we went to the Rag & Famin pub nearby (200metres) and had their famous 'crusty lid pies' for dinner. There are a lot of restaurants in Crows Nest and that's a $7 taxi ride or a few bus stops on the Pacific Highway. So, overall, it was a comfortable and pleasant stay. I guess the reviews prepared us for the worst and it wasn't that bad after all. It's also good to stay outside of the city every now and then.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Amateur hour, location is it's only strength - POOR”", "Author": "Montza", "ReviewID": "UR36473350", "Content": "Having stayed at this hotel 2-4 days a week for nearly 8 months, I cannot believe how many mistakes and total lack of interest in the customer a hotel can have. Each time I booked it was like I was a first time guest, there is a farcicle 2.5% credit card fee (who pays cash!), the rooms have been 'refreshed' but sort-of like putting a few new furniture items amongst the golden oldies in your Grandparents 70's lounge room. Rooms have Queen size beds (including the 1 bedroom suites), facilities in the rooms are at best mediocre - as other reviews have called out, there are new LCD TVs, but that's where anything modern ends. The clock-radios in the bedheads look like something out of a 70's erotica film! There is no pool or gym facilties, the bar is painfully boring and the restaurant serves credible breakfast buffet/coffee - but I wasn't game enough to dine there even once in my regular stays over 8 months. There is ample car parking (for a fee), so if you're on a driving holiday or working on the road, I guess that's a strength. Obvious question - Why did I stay there for 8mo if it was so bad? Answer. Location/proximity to my office, it was summer so I could exercise outdoors (gym wasn't an issue) and at the time the rate on offer for corporate guests went a way to justifying the place. On the price front, whilst the rooms are often available at competitive prices, the Rydges model is comparable to Formule 1 hotels - EVERYTHING extra comes at a cost. Internet is exorbitantly priced at ~$25 a day, mini-bar is more expensive that a coke at the movie theatre - generally, what you save in room rate, they'll try get back from you somewhere else. To be perfectly honest, the best summary I can give of this place is that it is the [maybe] the best choice of 3 large hotels in North Sydney, and don't they know it... Save yourself the pain, stay in the CBD and cop the cab fare across the bridge - the $15 taxi is definitely worth it! Barely a pulse...", "Date": "August 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Sydney", "Title": "“Definitely gone down hill”", "Author": "angel_star_charlie", "ReviewID": "UR34590891", "Content": "My husband and I got married here in October 2006 and decided to return recently for a romantic night away. This place has really gone down hill since we last visited and was a big disappointment for us. Renovations are currently taking place in the retaurant/bar area which makes for a very unattractive entrance. Staff on reception were rude and unhelpful, room was clean and most things seemed to work although the bathroom could do with a makeover and a proper clean. I made the mistake of leaving behind a sentimental piece of jewellery and phoned the hotel 4 times to ask them to check the room and follow up for me and was told they would check the next day (I even told them where it would be!). A week has gone past and I am still waiting! Definitely wouldn't return here again.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Co. Durham", "Title": "“Nice quiet hotel”", "Author": "deeandrob", "ReviewID": "UR33886521", "Content": "Stayed at this hotel 7th - 11th June 2009 with my partner and our 11 year old son. We found the hotel and staff really nice & pleasant. The only minor problem (which is purely our fault for not doing more research into the area) was the distance from Darling Harbour, Harbour Bridge etc. Normally this wouldn't have been a problem as we are quite keen walkers but i had slipped a disc in my back and long walks were totally out of the question which meant we had to reply on taxis!! Saying this they weren't that expensive and the hotel reception arranged them for us when we requested. We only ate in the hotel once and this was for breakfast which i must say was really enjoyable and guests had quite a lot of choice. We never had any problems with the hot water or tv not working properly and the room was clean and tidy when we arrived. All in all i would say that we really enjoyed our time staying at this hotel and would definitely stay there again.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Newcastle", "Title": "“Worst ever stay....”", "Author": "Broohar", "ReviewID": "UR31750746", "Content": "My wife and I and our 2 children have just returned from a nights accomodation at Rydges North Sydney. Where do I start, it would have to be the worst place we have stayed at ever. We opened the door to our room to be greeted by the horrible smell of cigarette smoke throughout the whole place. We were actually in a non smoking room but i guess the last guests didn't abide by those regulations. There was no point asking for a room change as at check in earlier it was noted that there were no rooms left available. We ventured to the hotel restaurant for dinner with another family of 4 who were also staying there. They too had issues with their room, TV not working (fixed by staff after an hour), Fridge broken couldn't be fixed so they were offered ice buckets ???? They told us that the carpet was dirty in their room as well, after losing a small childs toy they ran their hands over the carpet looking for the toy only to find fingernails and chewed up biscuit from previous guests !! Anyway after being seated for dinner we then had to wait 1 hr 20 minutes before any of our meals turned up, numerous other diners seated nearby looked just as angry as us and several complaints as well as ours were given to staff. When the chefs were asked if our kids meals were ready they then started cooking them which took all of 5 minutes, by this stage the children were all getting a bit feral as no dinner by 8.30 pm was a bit more than they could handle. Overall the whole stay at Rydges North Sydney was very disappointing, a pleasant relaxing time that we were expecting wasn't had by all. Never again.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Lukewarm hotel with new TV's that don't really work”", "Author": "explorer_360", "ReviewID": "UR30799288", "Content": "Had booked in for 5 nights during the easter long weekend, but only stayed for 4 (paid for 5). Booked through the Rydges website as a member. Price I paid (booked way in advanced) was a bargain at $99.00/night for a queen bed room. Parking costs $15.00/night in their secure car park. I parked on the street behind the hotel for 3 nights and then 1 night in the secure car park. The hotel itself is ok. Things are a bit dated, but overall acceptable. The lifts have been renovated. The room I stayed in was on a high floor and had a great view. The room itself looked exactly like it did in the pictures on the Rydges website. The mini bar fridge was very big and empty(just the way I like it). The carpets could have done with a steam clean/ been replaced. The bathroom had been repainted, but really needed a renovation. The paper cup place holders near the bathroom sink looked like they had not been changed for ages and had been reused over and over. The hotel had problems with the hot water for most of my stay. Like all other Rydges Hotels, the bed was very comforatble. The new flat screen TV was... fantastic... except if the sound on it actually worked. I had called the reception about this problem every day of my stay. The first time I enquired I was told it would be fixed. Went out to dinner, came back, TV sound worked.... for a few minutes. I had to call reception every day regarding the TV as the sound did not work. They would tell me to reset the TV, which I kept on telling them didn't do anything to solve my problem. There was one night in particular that I need to mention. I had come back very late that night after dinner in the city. I called reception at around 12midnight. There were only 2 people on night shift. The staff member that came up at 12midnight was very courteous and tried to do everything that he could for me at that time of night to try and fix the sound problem on the TV. Being a long-weekend, there was really nothing that could be done, and changing rooms was out of the question as the hotel was fully booked out. The staff member was the most pleasant and corteous person that I have encountered at a Rydges Hotel. Apart from this very nice staff member, the hotel was a very painful experience. Try showering in luke warm water for 3 nights in a row and coming back to a room with a TV that doesn't have any sound. Check-out at around 7pm was just as unpleasant, but unlike everything else, the problem was sorted out on the spot. I ended up checking out about 15hrs earlier than what I had planned as I had had enough. I have stayed in other Rydges Hotels before without any problems. This is by far the worst experience I have ever had with a Rydges chain hotel (which is very unusual for a Rydges Hotel). If this hotel fixes all its niggly problems, this would have been a pleasant stay.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "NSW", "Title": "“Good business hotel”", "Author": "Sarah2009", "ReviewID": "UR27783437", "Content": "I recently stayed at the Rydges North Sydney in a 'Parkview Queen Room'. The outside of the hotel is a little tired but once inside it was fine. My room was nice and spacious with a large window, flat screen tv and very comfortable bed. The bathroom was tired and could do with an upgrade but besides that I was very happy with my room. All staff I encountered were very friendly and most helpful (reception, breakfast and bar staff). I had breakfast downstairs in the restaurant on a few mornings and was very pleased with the selection. As well as offering room service for breakfast they also offer a take away service which can be ordered the night before. The hotel offers a free shuttle service which runs within a 5km area and the hotel is in a great location, 5-8 minute walk to the North Sydney CBD. If travelling on business I would definately stay at the Rydges again.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“Its OK, if you don't mind...”", "Author": "Unsatisfied12", "ReviewID": "UR25838527", "Content": "My children gave my partner and I a gift voucher for the Twilight Concert with an accommodation package at Rydges North Sydney. It was a lovely thought, from our children, but if they realised what they had sent us to I don't think they would be very impressed! As I have read in past reviews, the lukewarm water is still evident and nothing has been done to rectify this. I had the second shower after my husband and the water was not only lukewarm, but merely a trickle. No pressure!!! I have long hair and didn't bother to condition it as there was barely any water. The air conditioning was very noisy and wouldn't turn off! I called reception, about 9pm. A rude young madam attended my room promptly, but couldn't find the switch. So couldn't find the problem and didn't offer any alternative!! My husband later found the switch was behind the headboard, after he rolled the bed out. The concert was wonderful and I am attending another package in the up comming weekends. If I hadn't already prepaid for this package, I would definately like to cancel and book accommodation elsewhere. The bed was comfortable, but a pity everything else let it down. I don't look forward to my upcomming return! One last thing, the mould in the bathrooms are still very present! I will get photos from my next trip!", "Date": "March 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sydney", "Title": "“Old and Tired”", "Author": "BT2009", "ReviewID": "UR24571626", "Content": "We stayed at the Rydges North Sydney to compliment our trip to the Concert at the Taronga Zoo Series. Staff where pleasant upon check in but once in our room very disappointed by the very tired dÃ©cor. The wardrobe doors did not close properly due to broken hinges, the refrigerator leaking in to the cupboard and onto the carpet. The ensuite could use some mould remover and as per other reviews lukewarm water from the shower. Sunday morning looking forward to a bit of a sleep in when the housekeeping staff walk into the room at 9:30 check out was 11:00. After the apology they exited but went into the room next door talking to each other, vacuuming and banging around. Not very relaxing so we got up and left. On a positive note the bed was very comfortable.", "Date": "February 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Suburban Chicago", "Title": "“Fine, if they have hot water.”", "Author": "paulkiddoc", "ReviewID": "UR24323887", "Content": "We have been to Sydney twice before - love it! This time, we have a niece and family living north of the city. We decided to stay at the Rydges North Sydney because it would be walking distance to the harbor north of the Sydney Bridge, where we wanted to watch the fireworks on New Year's Eve. It was a great decision. It was about a 20 minute walk to a nice park along the harbor. It was a wonderful experience. As for the hotel, it was in a very quiet neighborhood. The room was nice, with a view of Sydney Harbor (but not the bridge). Breakfast was included, the people were nice, and the bed was comfortable. The only problem was that there was no hot water at all - for the 3 nights we were there. They were sorry, but did nothing to solve the problem, which they said was due to the fact that the hotel was full. Humm, you'd think they'd be prepared for such a strange event. They said they were going to meet to discuss this issue. They also did absolutely nothing in term of lowering our rate, offering us a free night, etc. Contrast that with the Hilton Corporation - see my review of the Fiji Spa and Resort Managed by Hilton (which I'll post soon). So, I recommend Rydges North Sydney with \"reservations\" - make sure they have hot water!", "Date": "February 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Port Macquarie", "Title": "“A Lukewarm Shower”", "Author": "Coastalgal99", "ReviewID": "UR23218268", "Content": "I had a lukewarm shower. I told reception, who responsed they had no complaints. The shower continued to be lukewarm. When I checked out and mentioned this issue, I was only given an apology and informed the front line manager will phone the next day. They are only all smiles when you pay. The bathroom would gain from a good bleach and scrub.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Pretty Impressed”", "Author": "Travelpretties", "ReviewID": "UR21208301", "Content": "In October for Labor Day weekend my family and I stayed at Rydges North Sydney. 3 Adults stayed in I think 'waterview suite', basically it was a one bedroom suite with a large sitting room. (Refer to pictures). The front desk staff were helpful and there was no complaints in the way they handled our check in. The room was spacious and fairly clean, now Rydges isn't a five star hotel and i think its unfair to compare it to one but I was pretty impressed with the overall quality of the rooms. There are two plasma tv, one in the bedroom and one in the livingroom. There was plenty of towels but not as fluffy and soft as I like them to be. I guess after reading all the negative reviews I was kinda expecting a really rundown and dirty hotel so it was a pleasant surprise. Room service was efficient, althought the prawn on skewers and bed of jasmine rice wasn't so tasty. The underground parking is a bit bland, yes its good value but I don't feel safe when I park my car there (the lighting isnt so good) It was also disappointing the bar downstairs closed at 10pm on a weekend! During our stay we had breakfast @ the hotel, the buffet was simple and it was nice to have freshly made smoothies and 'real' coffee made by baristas. Overall it wasn't a bad experience and I would stay at Rydges again.", "Date": "October 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Mutton dressed as Lamb!!”", "Author": "Musrag", "ReviewID": "UR20585305", "Content": "My title says it all..... I recently stayed again at this hotel for work. It has been about 4 years since I stayed here and back then after a few compulsory stays for work I changed as it was old and needed a good overhaul. Unfortunately staying there again has shown me other then adding a larger tv to the room nothing has changed. The rooms are old, the bathroom is just terrible. Water pressure or lack of it was a joke, the mould, cracks and dirty areas made it a shocking sight. Mini Bar was overpriced with a small chocolate bar being $4.50. The TV was very slow between channels - a 3 - 5 sec period before it changes - it did freeze on one channel and would not even turn off. Reception said to turn off and leave off for 7 mins as it happens all the time in all the rooms. Beware if ironing as well as dirty and may leak and stain your clothes... One good thing is the bed and pillows were comfy in my room. Staff were very friendly and professional and should be in a better class of hotel as they did well by me. Go to the Vibe in Nth Sydney - great location and very trendy.", "Date": "October 3, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "brisbane", "Title": "“Good beds, avoid the room service pizza.”", "Author": "blorty", "ReviewID": "UR17429453", "Content": "I stayed at the Rydges for a week in June. My party was spread over four floors. Problems (not purely the fault of the hotel) began at check-in. We had not decided who was staying with whom, so I checked into a room with two others and soon found out (from the staff) that a room under our party's name was empty, so I took advantage of this. What followed was a slapstick-style jump up and down from floor to floor only to find myself (after more than an hour of going back and forth between floor) back in the original room. Before I left for Sydney I read some reviews saying the beds are the best thing about the hotel. I remember thinking \"Oh there has to be more to it than just the beds.\" No, not really. Apart from the hotel's proximity to the theatre we were working in, there was nothing else much to Rydges. The service was ordinary, the hot water pressure was the WORST I've ever experienced and the room service pizza tasted like it had been boiled. I would have gladly eaten elsewhere but Nth Sydney shuts down at 5pm, with little exception. Good Guinness pie at the Rag & Famish, and a GREAT massaman curry at the Thai place next to the Independent Theatre on Miller St...but if you're after more than a very comfy bed, avoid Rydges N Syd.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Location": "2"}, "AuthorLocation": "Australia", "Title": "“Nice & average!”", "Author": "AMADKRA", "ReviewID": "UR15365871", "Content": "Rydges North Sydney was quite a nice hotel. It is a little off the beaten track however my partner and I travelled into the Sydney CBD on a daily basis with no issues. An advantage to this though is that the hotel is very quiet - no road noise etc whatsoever. We always felt safe walking back at night, however if you were by yourself I am sure it would be fine, but might not feel that way! The hotel itself has a nice lobby. The room was nice and average size (don't expect any views). The bathroom was reasonably clean. We stayed for three nights and on the first day the hairdryer literally blew up (well it smoked and died anyway). I rang reception to get it fixed straight away. It was still not fixed by the time we checked out (I rang a couple more times during the stay as well). That did tarnish the stay a bit (more so if I relied heavily on a hairdryer!), and to be honest reception really did not seem to care. They were not 'rude', but they were not interested in the least either which is a shame. I would recommend this hotel only if you don't mind walking AND you get it for a good rate (or need or prefer a North Sydney location). Otherwise Sydney has plenty of other options available that I believe would be more satisfying. I doubt I will stay here again.", "Date": "April 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Great Family Accommodation”", "Author": "rose2travel", "ReviewID": "UR15340974", "Content": "My husband and I together with our 2 children stayed in this hotel recently and were impressed at the fantastic value for money. We took up one of their family packages to Taronga Zoo which included accom, family entry to the zoo, buffet breakfast and parking - ALL for an amazing price. The staff were great, the rooms were fine, maybe needing some maintenance repairs if anything and the breakfast was really really good. The staff fussed over our children and were attentive to our needs as a family. For a family getaway to Sydney I can't really fault this hotel and we will return.", "Date": "April 25, 2008"}], "HotelInfo": {"Name": "Rydges North Sydney", "HotelURL": "/ShowUserReviews-g255060-d257798-Reviews-Rydges_North_Sydney-Sydney_New_South_Wales.html", "Price": "$121 - $382*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">54 McLaren St</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2060</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "257798", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/2d/47/3d/harbour-view-queen-room.jpg"}}