{"Reviews": [{"Content": "Modern Room with good facilities       Wife on Manly Beach", "Date": "Dec 16, 2008", "ReviewID": "UR774676711", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Smarshy12"}, {"Content": "Loved the holiday! We were very impressed with the Sebel Manly. The accommodation rooms were very fresh and spacious. Our checkin was fantastic, the team on the reception desk were very helpful and friendly and said hello to us by name everytime we walked through the reception area. This hotel is in a great location, right opposite the beach (a patrolled beach). There were a lots of restauants within a close walking distance to the hotel were we had dinner each night. I would recommend this hotel to people wanting to visit Manly.", "Date": "Dec 8, 2008", "ReviewID": "UR664156574", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Holidaysnaps"}, {"Content": "Profoundly depressing experience I stayed for six nights in June. Despite being their longest resident at that time of year, they put me in the back building, which requires walking through a muddy building site to reach. The electronic key system was faulty, so I had to return to Reception on numerous occasions. A very old and depressing lift takes you up. The room was a decent size but overlooked the refuse bins of the apartments behind. My televison did not work for two days, and was not properly repaired despite several complaints.Reception staff were quite nice and quite helpful, but this hotel feels like a backpackers hotel at four star prices. It really is a bit of a dump.", "Date": "Jul 31, 2008", "ReviewID": "UR405843865", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "5"}, "Author": "Bigal57"}, {"Content": "Not Spectacular, but OK Stayed at the Sebel Manly Beach for 2 nights in a Superior Room. We knew that we would not get an ocean view, so the expectations were not that high. However make sure you at least get a level 4 or above room so that at least you get some view.For $200 (AUS)/night for a Superior (which is in fact just a standard) room, parking should definitely be complimentary or at least cheaper than the $15/day price tag.Jamils restaurant and bar at the Sebel is ok for a night cap drink, however its way too expensive for anything else. There are so many other great and cost effective dining/drinking options in Manly.The table on the balcony was covered in dirt and mould. At the moment there is construction work occuring around the South Tower (which is where the Superior rooms are located).Would we go back and stay? Probably not. However its perfectly suitable for someone on a business visit.Also, what this hotel fails to tell you is that they decide to put a $600 temporary fee on your credit card. When you phone them to clarifiy this pending transaction, they deny everything. Suddenly a couple of days later the pending transaction is removed from your credit card. I don't mind this if they are truthful about their procedures, but to get the run-around from a typical call-centre curry fan is highly frustrating.", "Date": "Jun 3, 2008", "ReviewID": "UR262423284", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "rapture_74"}, {"Content": "Never Go back This hotel is dirty, run down and needs attention. It is not cheap and has a great beachfront location. Nobody came out to help with our luggage, when we got to check in the staff had dirty shirts. Our room was in need of refurbishment.We had no meals there so we cannot comment on that.We have stayed at other Sebel Hotels in Brisbane and Noosa Heads and they were in much better condition and well worth the money.", "Date": "Mar 31, 2008", "ReviewID": "UR441139396", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "moomoo0108"}, {"Content": "Great location but disappointing view       Is that a glimpse of daylight??", "Date": "Mar 3, 2008", "ReviewID": "UR106848241", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Lotzsan"}, {"Content": "Great location, great hotel The Sebel is in a great location right on Manly Beach and close to the Corso (but not so close you get disrupted by the noise!). I stayed in a 1 bed apartment which was great with spa bath, washing machine, kitchen, etc.Service is great and they can't do enough to help. Its pretty pricey and although its a great hotel it borders on being overpriced. That said there are only two big hotels in Manly, this one and the Novotel which is rubbish so I guess people will pay it as I did.I'd thoroughly reccomend this hotel - but make sure you book an ocean view. room or apartment. Also, try Cafe Steyne for breakfast next to the hotel. Its much better than some of the tourist joints further up the road.", "Date": "Jan 18, 2008", "ReviewID": "UR733882409", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "JUDITHbristol"}, {"Content": "Fantastic location I booked a family room in the South Tower for 4 of us for the first weekend of a three week trip to Australia. Our 11 year old was spectacularly sick all over the front steps and the charming front of house staff couldn't have been more chilled. Not only that but we had arrived early and our room wasn't read so they parked us in the very cool bar with our bags, sorted out the 11 year old and gave us a much needed cold drink. The room was absolutely fine - we had a v comforable king sized bed in the main part of the room and the kids were in a smaller room with twin beds. The bathroom was great. We weren't bothered about the view but we already knew we weren't going to get one. However, sitting on the balcony watching the locals go about their morning exercises on the way to the beach was great. The breakfast was delicious - except the coffee machine had broken down and they couldn't get it to work (our slightly muttered response was why don't they go and buy take out coffee from the numerous good coffee shops on Manly..). The only other slight niggle was that we asked reception to book us a cab on the Saturday for 5.15pm - which they did - but by 7.30pm it hadn't arrived despite numerous appeals. They obviously don't have any relationship with any taxi firms which was very odd for quite a high profile hotel. Still, it might have been because the staff, though utterly charming, all looked about 14! Nevertheless, it was a good place to stay - easy to get to the CBD and Opera House with added very clean beach!", "Date": "Jan 14, 2008", "ReviewID": "UR837831368", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "Norfolkexplorers"}, {"Content": "Quite a few problems We just got back from our stay at the Sebel and can't say we had a great experience. We used to live in Manly so were very familiar with the hotel and thought we would treat ourselves to a week there. We chose it mainly based on it's location but also because it is regarded as the best hotel in Manly. We didn't book an Ocean view room but were a bit disappointed to be in the tower behind the main building. We booked a family room for the first three nights as we were travelling with our 4 month old and had friends coming to stay with their baby of the same age. The first morning we looked at the duvet and saw a few blood smears. This was particularly horrible as our baby was in in bed with us and she is at an age where she puts everything in her mouth. We wouldn't have seen this if the duvet had a cover on it but this was little consolation. To their credit, the staff sorted this out quickly and provided an apology card and breakfast vouchers. When we checked into the room we noticed it vaguely smelt of vomit but this got progressively worse. Once we had compained about this twice it was rectified but it had become so overpowering we did not want to spend any time in the room. When we went for breakfast the next morning we were told it finished at 9.00 and were asked what time it was. When we pointed out it was 8.55 they begrudgingly brought out the breakfast buffet again (as they had decided to clear it early). In our experience guests always turn up for breakfast bang on the finishing time or just after and it is usually accommodated. We then moved to a 'Manly view studio' room and again found the duvet with stains on and no cover. We started to think the housekeeping staff just didn't know how to make up beds! Unfortunately in that room our baby kept getting woken up by bottles being crashed into the recycling bin downstairs late at night and the noise from the building site next door. I would have thought the Sebel should let their guests know if there is major work going on next door in advance of their stay but this was not the case. Having said all this, it was great to be back in Manly and we didn't have a terrible stay at the Sebel. It was just a shame things weren't as nice as we had expected.", "Date": "Dec 8, 2007", "ReviewID": "UR836190030", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "4"}, "Author": "alexgroszmann"}, {"Content": "Very friendly but overpriced We made a late decision to stay here when we had a party nearby. Manly's a fun place to be on a weekend and as the reviews say, the Sebel's right near the water.Probably because it was almost sold out, we could only get a room by contacting the hotel direct and didnt get any a booking site discount that I guess you should often be able to get.There was nothing really wrong with it -- the staff was very friendly which was a big plus. But for a one bed apartment the rooms were on the small side. Next ,the view from the room we did get --looking away from the beach --was partly of the sheets aound the construction site next door. The garage is very small so it's a bit of a bun fight there. And I'm not sure that we would have picked it as recently renovated if the website didn't say so.So I would have thought it probably a neutral/average but with friendly people on a good beach if it was priced right. Since though we paid rack rate (or close to it) for one of the worse rooms, and it is rated at 4 and a half stars. I'd say on value for money terms, there are better around, unless you get a good deal.", "Date": "Nov 25, 2007", "ReviewID": "UR445201928", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "vague travellers"}, {"Content": "Not value for money Having just stayed at the Sebel Manly on Monday 25th June 2007, I am writing a fresh review. We chose the Sebel Manly as a special place to help celebrate my 40th birthday. Unfortunately we were disappointed. The rooms are small and even though you can see Manly Beach thru the pine trees not really that great. Being the middle of winter the hotel certainly was not at its busiest. But for some reason they seemed to place majority of guests in close proximity to each other. Hence when the young girls next door decided to have a party thru the night we could hear everything. We did ring down to reception and the music was stopped, but you could still hear them jumping around and screaming etc etc. Hence not much sleep was had. We then went down to breakfast (which is $20 a head) to find that most of the food had gone and there were no plates, knives, juice and we had to continually ask for each individual item to be replenished. We got to breakfast at 8.20am to find little left and just received a reply of a large group has just finished. I'm sorry, but that is not our problem and we certainly didn't receive value or service. We also found that we couldn't work out how to use the air conditioning properly and were subsequently cold in our room, so had to stay in bed to heat up. We were offered late checkout, but decided to leave anyway. As we were looking forward to this night so much, have to say it was a let down.", "Date": "Jun 27, 2007", "ReviewID": "UR300035139", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "Fuffel"}, {"Content": "Didn't want to leave! Just returned home from a wonderful trip to Australia. One of the the places we stayed was the Sebel Manly Beach. I can't say enough about this hotel. It is located right on Manly Beach, very near Shelly Beach and walking distance from the Corso (an incredible street of shops and restaurants). The hotel is beautiful. We had a beautiful ocean view suite (# 401). It was very large and included a dining area, great kitchen, sunken living room, separate bedroom and wonderful bathroom that includes a washer/dryer. You could literally live here. The furnishings are great including flat screen tv's and great artwork....there are wonderful decorator touches of accent pillows and throws. And on top of all of this a balcony complete with furniture and a wonderful view of the ocean. It doesn't get better than this. Manly Beach is a great place to stay...it is an upscale resort area with excellent restaurants (loved Whitewater, Wood  Stone, and Blue Moon) and fine shops (biggest Quiksilver store I have ever seen). The beach is fantastic...beautiful sand, water and surfers.", "Date": "May 8, 2007", "ReviewID": "UR848132495", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "njtraveler4444"}, {"Content": "Sweet Location       Front entrance", "Date": "May 2, 2007", "ReviewID": "UR497127353", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Spinyli"}, {"Content": "Cute rooms, nice feel and V V close to beach Having stayed in the Sebel hotel for 3 days last week, and then come back for more, I can say that this place is lovely. The first room we stayed in was on the 3rd floor (343) in the south tower. It was nice and large with a big bed (which was twin pushed together but you wouldn't notice) and great view from the balcony through the buildings to the beach. The bed was great, the view was great and the room was lovely.The second room (516) (that I am writing this from) is smaller, and faces onto the road at the back, there is a small glimpse of the sea, but not as good as last room. The bed is twin beds pushed together again, unfortunately they are a slightly different size which makes canoodling difficult with the bloke ;-). Avoid this room if you can I just don't like it.The bathrooms in both were nice and spacious and they also provide conditioner which is a welcome addition and unfortunately not offered in lots of hotels. Staff are lovely but a little useless with organising stuff (I think reception have to do it all) so I would recommend popping to the pacific and using their conceirge service.In the middle we stayed at the Manly pacific which my boyfriend preferred, but I would say that the Sebel is nicer if only because of the lovely balconies. The manly pacific is cheaper but I don't like not being able to get outside so make sure you request a room with a balcony and view.The Sebel is overpriced, but I thought it was slightly nicer and more 'boutiquey' - my BF liked the pacific because the room we had was huge and the beds were larger and more comfortable which makes a difference when you are over 6 ft. The food in the Sebel is mainly fish and the in room dining is nothing special, but it has a nice bar/eating area where beautiful people hang out. The manly pacific salad (with lebanese cucumbers) was amazing... go to the pacific and try this if you stay at the Sebel.TIP: beach towels are provided by reception to sign out next to the internet station which is 10usd (which is a cheaper alternative to the one in your room which is 20usd per day!!) If you walk to the library which is just off the corso about 5 mins away the internet is only 1.10usd.TIP2: take advantage of your jet lag and time difference and get up to the see the sun raise over the hill at the top of shelley beach.", "Date": "Feb 27, 2007", "ReviewID": "UR993685576", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Kelliekat"}, {"Content": "Great location and refurbished rooms Having lived in Manly for years and now coming back as a visitor , have always stayed at the Manly Pacific which was the premier hotel for years. Now however, since Sebel picked up this property and renovated and refurbished all the rooms this is our choice for accom in Manly. Its in a quieter part of Manly down the south end opposite the surf club and importantly away from the pubs on the Corso. we recently stayed in the Harbour tower and had a lovely room with lots of space, even without the view, we could still crane our necks out the side of the balcony to check the surf. the oceanfront rooms are at a premium and quite frankly the harbour view rooms are just as good if you don't care about the view or don't plan to spend any time in your room. The restaurant is now very trendy and popular with the locals and we could not get a table both nights as reservations were necessary (but in the fickle world of Manly restaurants that could change at any time). Breakfasts are expensive in the hotel so we just wandered along the beachfront until we found a cafe and soaked up the atmosphere and the sunshine.", "Date": "Feb 7, 2007", "ReviewID": "UR207015279", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Indie43"}, {"Content": "Business that was pleasure I visited Manly in March when it was a building site. I was aware of this before I went and when I arrived the staff and manager could not do enough for me! The Bar first floor had great views from its balcony ( seats around ten people) and had some excellent cocktails and beers from around the world. Bar staff were excellent and were very attentive.The Lesiure facilities were ok but small and the pools were also very small. The Rooms were spacious very clean and again the staff who looked after my room were also very good.No complaints as I got what I paid for and the rates because of the building work were very reasonable.", "Date": "Jun 21, 2006", "ReviewID": "UR463319927", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "blueanvil"}, {"Content": "Great Hotel We hadn't reserved a room before we arrived at the hotel. Got great rates on the room. We had a room in the South Tower. No beach view, but we could walk straight into the pool. The room was nicely decorated - very modern and cleaned very well. The room also had iron, ironing board, hairdryer, flat-screen tv, internet connection, sofa. We didn't try the restaurant or bar whilst we were there. The staff were extremely friendly and we wouldn't hesitate to go back.", "Date": "Jan 7, 2006", "ReviewID": "UR200410715", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great views in best position       the sebel", "Date": "Sep 25, 2005", "ReviewID": "UR813036885", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "Ellemay"}, {"Content": "Loved the views Fantastic location opposite Manly Beach. Unobstructed views from North Tower rooms. No views of beach from South Tower Rooms. Have stayed in both. Only stay in North Tower. Hotel is getting tatty. Furniture, carpet and fittings need replacing. Very clean. Housekeeping are diligent. Hotel administration is 'relaxed'. You don't always get what you think you have booked. The rooms/suites vary widely in size and inclusions. Overpriced, so you must be paying for a good location in the heart of Manly.", "Date": "Jun 2, 2003", "ReviewID": "UR151791187", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "Philipau"}, {"Content": "Das Hotel der kurzen Wege       Blick auf den Strand vom SEBEL morgens um 5.00 Uhr", "Date": "Feb 26, 2007", "ReviewID": "UR508887131", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "fotografie"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d258084-r22774529-Sebel_Manly_Beach-Sydney_New_South_Wales.html", "HotelID": "258084", "Price": "$183"}}