{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Good for laid back travellers”", "Author": "chuddies07", "ReviewID": "UR121264343", "Content": "When i stayed here for 4 nights, all i wanted was to sit on the balcony and relax before i started sight seeing. The balcony was locked, and anytime you want it opened you have to call reception to come and open it, and then call again for them to come and lock it?! Not happy, especially as a smoker! So i mainly smoked in the bathroom with extractor fan on! Also i remember cleaner walking into my room and then leaving when they noticed me when i was sleeping early 2 mornings. The out door swimming pool was lovely, no complaints there. I had one dinner in the restraunt which i found ok, i think 8 euros for just pasta. The bottled water was awful, so i shopped down the road. Rooms were cleaned daily. The most exciting thing i found about this hotel was the roof. its on the topfloor, but if you want a nice view of Rome i reccomend a trip to the top. There are big noisy machines at the top, not really a place advertised to guests to see, but was a lovely moment to find it. There was also a mini bus owned by the hotel that takes you free of charge to a few metro stations, but its quite awkward times, and the hotel is well out of the way of everything, nowhere near colosseum or trevi fountain. I wouldnt stay here again but it could of been worse.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Cheap and Clean”", "Author": "Stultum", "ReviewID": "UR102737754", "Content": "Decent cheap hotel in a quite suburb. Paolo the owner is quite a Character ! Business hotel, good for families too. Quite difficult to find..........just beside a big old cinema. Breakfast not great but 50 euro/room is quite a good deal ! Remember to check the small library near the breakfast room: a lot of interesting info about restaurants and activities in Rome", "Date": "April 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Washington D.C.", "Title": "“Skeevy and Depressing”", "Author": "Aliciajane72", "ReviewID": "UR12151507", "Content": "We booked this hotel for the final night of our stay in Italy because it seemed to be near the airport. Whatever the distance \"as the crow flies,\" do not choose this place for that reason. Between the traffic and the inability of any cab driver to locate this incredibly creepy \"hotel,\" we were dejected and exhausted by the time we arrived...and felt even worse when we rang the security bell and stepped inside. There is no service to speak of. The hotel is not really even superficially clean - and five minutes spent looking around reveals everything from grime around the fixtures on the bidet to tea stains in the sketchy kitchen area. Furthermore, even though we had to pay for three people (and specified one was an infant) we were given a twin bed for our baby. Useless. We spent our last night in Italy thinking how anxious we were to escape. Dark...dreary...and in a bad neighborhood. Just pick someplace else. Save yourselves!", "Date": "December 31, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Reykjavik, Iceland", "Title": "“Wish I had checked here before booking”", "Author": "hildigunnur", "ReviewID": "UR8272875", "Content": "If we hadn't paid for this hotel in advance we would NEVER have stayed more than the first night (out of 5). Hotel claims to have four stars but there is no bar or restaurant, the breakfast included was the sorriest I have ever seen (lukewarm apricot juice, tiny boxes of Nutella and jam, no butter, muesli but no milk (except for one morning), dry toast and machine instant coffee). No safety box in the rooms, no swimming pool (well, that we knew when we booked). Happy that we always locked all the suitcases when we left the rooms, since we had a theft of some cosmetics from the bathroom. Took ages to find the hotel, driving from Ciampino with only printed instructions from Google Maps, no SatNav or anything, had to stop three times to ask for directions. Fortunately my husband knows some Italian. On the plus side, free shuttlebus to the train station (not in the evening), shuttlebus driver was nice. Air condition worked fine and the rooms were cleaned every day. That was about it.", "Date": "August 1, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Glasgow, Scotland UK", "Title": "“Go elsewhere”", "Author": "beseeinyou", "ReviewID": "UR7259045", "Content": "Stayed here last weekend for 2 nights, truly awful. My brother picked us up at Ciampino Airport after darkness had fallen and if it wasn't for him having GPS / Sat Nav I don't know how we would have found this place, it is really in a rundown residential area, the amount of graffitti has to be seen to be believed. They have a real problem with the hot water, we were 4 adults together and the water lasts about 1 hot shower and 1 lukewarm shower and then it's cold until much later when it's reheated the same amount, when we complained about this (and my sister in law speaks fluent Italian) we were met with the following: it's impossible, we must have ran all the water away, why not shower in the afternoon when the hotel is quieter!! They just won't accept there is a problem and are not interested in your stay. The room itself is bearable except for the kitchen area, the cupboard fixtures are old and falling apart (see attached photo), we had to ask three times to provide the missing cups, glasses etc. (it was always just on it's way !!) but the beds & TV & bathroom are ok with the exception of the above water problem and broken toilet roll holder, fairly clean too. Reception very unhelpful with directions to get into town, just a curt \"get the bus round the corner\" type of thing. We got terrific help from a local lady in the street though who showed us the bus stop to get. The bus is maybe around 5 or 6 minutes to the train station, the train is then around 15 to 20 minutes to this train's terminus, you then get another bus (like we did) or get the Metro to the centre of Rome taking around another 10 minutes so it is a bit of a haul to get there and back. On the way into Rome we spotted a Chinese restaurant not far from the bus stop at the hotel and we ate there at the end of our night and it was very good and excellent value for money compared to the City Centre. There must be much better places to stay in better locations than this place and this is quite simply the worst stay I can remember having, go elsewhere.", "Date": "March 31, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Do not stay here”", "Author": "STJ705", "ReviewID": "UR7172027", "Content": "We stayed at this hotel one year ago and I am finally able to write about my experience. It was horrible! The pictures on the website showed the hotel in much better condition than it actually was. We booked a reservation for one night to be close to the airport for our early morning flight but it is not very close to the airport. There are no decent restaurants in the area and the neighborhood was somewhat sketchy - there was a pack of dogs that barked outside for many hours in the middle of the night. I would never stay here again and would tell my friends and family to book a room at the Marriott near the airport even if it is more expensive.", "Date": "March 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“False Location advertised”", "Author": "Sokal", "ReviewID": "UR6138018", "Content": "This was the last hotel we were to stay at for our honeymoon, which was advertised as being within the vicinity of the airport. This hotel is NOWHERE near the airport! The taxi driver had no idea where it was located, which should have been our first sign of trouble. This hotel cost 50 euros to get to the hotel! And it is in the middle of nowhere, and we did not feel safe. Upon asking the front desk of where we could find dinner, we were advised to go to the local grocery store. Once seeing our room, which was again advertised as 4 stars but looked like a cheap college dorm room with tile floors, we immediately called hotels.com to complain. We left the hotel within the hour, and paid another 50 euros to get to the Marriott Courtyard that was actually located within the airport vicinity and was listed at 4 stars. Needless to say, the differences between the Marriott and Atahotel were HUGE. Do not stay at this hotel.", "Date": "November 16, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sheboygan, Wisconsin", "Title": "“False Advertising of Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5348241", "Content": "I went through hotels.com for my reservation to the Atahotel Domina Residence. I was confused by the review not being close to central Rome. However, the map on the location site put it about 10-15 minute walk from the train station and about a 15 minute walk to the Colosseum. So I booked it. Getting to Rome found me located more that 12 miles (18-20km) from central Rome. I needed to take a train and a bus to get there. Needless to say, I cancelled my reservation which they accepted for the three nights I was within the 24 hour cancellation period. However, even though they deceived me with their map, did not cancel me out for the first night. I think because of their deceit, I should not have been charged for the first night. They disagreed. I am not very happy with their management. Why should I pay for their deceitfulness? I even informed them about the wrong map and even two months later, it has not been changed.", "Date": "June 14, 2006"}], "HotelInfo": {"Name": "AtaHotel Domina Residence", "HotelURL": "/ShowUserReviews-g187791-d258988-Reviews-AtaHotel_Domina_Residence-Rome_Lazio.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Di Dragoncello 621</span>, <span class=\"locality\"><span property=\"v:postal-code\">00122</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "258988", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/17/db/17dbcc70499c5f7003265a8ec27d4b7d1large.jpg"}}