{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Great location, , ..awful hotel”", "Author": "walkeruk186258", "ReviewID": "UR126601272", "Content": "This was a deluxe double room in a 4 star hotel? No mini bar, no working Air con, tiny room and en suite bathroom, loose wall fittings, terrible lighting. No bar downstairs and no communication at reception on check in, ie breakfast times etc. The heat in the room and corridors were horrendeous. On a good note,..its close to Paddington and Hyde park and the room is clean. Ok i guess if you just need a bed for the night!!!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Teeside", "Title": "“Limited by Room size”", "Author": "Norherner", "ReviewID": "UR126436602", "Content": "Booked this hotel for a 2 day break. Reviews looked generally OK but did warn of smallness of rooms. They were right, our room was tiny. When we asked if there was anything bigger they said not really althougn they would move us for our second night to something slightly larger. Actually our room was quite well appointed and comfortable. The decor was a bit dark for a small room. However the lighting was some of the the best I have witnessed in a hotel. Reading was easy, and that is not always possible. The en-suite shower room was again not large but well appointed and modern. There were several examples of loose fittings, loose/ detached handles and failed light bulbs in both the room and the en-suite. I reckon five minutes with a set of screwdrivers and a box of bulbs would have sorted the lot . The LG television was modern but unfortunaltly didn't work remotely because the handset was for a Philips! We got a new handset but only had a very limited selection of channels. There was no BBC1, BBC2, Channel 4 or 5. I set up the television for re-tuning and got the missing channels back. The concierge said he would do this in all the rooms. The situation is good, just a few minutes walk from Paddington one way and Hyde Park the other. The Hotel looks clean and smart from the outside, the staff could not be faulted. If you can stand the small rooms then it is OK. I marked it down for the small rooms and the lack of attention to detailed repairs of fittings and lights. At full prices I would say the hotel is expensive, but then London equals rip-off!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Okehampton, United Kingdom", "Title": "“Not awful, not amazing.”", "Author": "ReddStar", "ReviewID": "UR125325316", "Content": "I stayed for 2 nights recently over the weekend on a solo break to London and would like to have been more impressed, but it did the job. I had booked a 'Double Deluxe' and was given a single room with hardly any room to even turn around in. It was basically a oversized closet. The bed was comfortable enough though, and it was only really a place to lay my head while enjoying London. The toiletries weren't replaced daily so after the first use, I had to supply my own which was disappointing. All in all, it wasn't a bad experience, it just isn't great value for money, and I'm sure there are better options in the price range for the area.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Great Location for a Weekend in London”", "Author": "C J", "ReviewID": "UR125082892", "Content": "Myself and my partner stayed here for 1 night as we had tickets to Phantom of the Opera. We decided to turn it into a mini-weekend and booked into this hotel via lastminute.com The hotel is a short walk away from Paddington station and underground so it is an extremely good base for exploring central London. On the Saturday night after the show a taxi cost £10.80 to get back to the hotel at 1:00am. The hotel is smart and tidy, and the reception staff were friendly and helpful. We arrived early on Saturday morning and were allowed to leave our luggage with them until we checked in later that day. Saying the room was small is an understatment (we had a deluxe room)! The bed went wall to wall and you had to vault over it to reach the other side of it (not that there was much point in doing this). The air conditioning was also not working which meant the room was extremely hot during the night and in the morning. Apart from this, the room was well appointed, the bathroom clean and modern and the bed very comfy. The room had lots of charm. I would definitely recommend this hotel if you are travelling light and not planning on spending a great deal of time in your hotel room. I would say it is more a 3* hotel than the advertised 4*, wouldn't recommend if you are expecting luxury.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good location, good hotel.”", "Author": "79sheps", "ReviewID": "UR124818575", "Content": "Value for money. Clean room and comfy bed. Stayed for 2 nights and it's in a great location. Can't fault it and we would definitely stay again.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice hotel comfortable stay!!!!”", "Author": "Rockers00", "ReviewID": "UR124779562", "Content": "We stayed in this hotel for couple of days and we really enjoyed a lot . The nice welcoming from staff which made us very comfortable and felt that as if we in our own home. Thanks to front desk staff Pranav and all the others who made our stay very comfortable.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Hyde Park Premier Paddington Hotel- Experience Report with Staff Personal”", "Author": "Damon L", "ReviewID": "UR124722402", "Content": "Please be advise that during our stay at your 14-16 Craven Hill Hyde Park location from 12-8-2011 to present day, my wife and I really have enjoyed the top notch service given to us particularly by Mr. Ravi Vinayak -GMD. He always displays courtesy professionalism and concern for our well being. He is always looking to see what he could do to ensure that our stay is most comfortable and enjoyable by going the extra mile in taking care of all of our creature comforts making our experience with staying at the Hyde Park Premier one that will be repeated on our next visit to London from the United States of America. I am a Gold Card Elite Member with the Marriot Hotel , and have enough points to stay in their Executive Suite for the next 180 days, but but my wife and I decided to lodge with your Hotel because of the personal warm attention that Mr. Ravi Vinayak -GMD and your staff personal has shown to us. We will be recommending that all of our friends who intend on visiting London experience his caring attention and making them feel at home while they are away from home the way he has done for us. Sincerely Damon & Daunette Lee Room #308", "Date": "February 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kirkcaldy, United Kingdom", "Title": "“Bed Bug Nightmare!!!!!”", "Author": "Fifer1980", "ReviewID": "UR123986457", "Content": "We booked into the Best Western, Paddington, however on arrival we were taken round the corner to this hotel? No explanation but didn't question it as the hotel seemed nice. Huge mistakes as there are bed bugs!! Do not stay here!! Cannot believe that this hotel has such low standards of hygiene. Extremely disappointed in our choice", "Date": "February 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "london", "Title": "“small rooms, poor sound insulation are the stand out thoughts...”", "Author": "al w", "ReviewID": "UR123770252", "Content": "Stayed here in a deluxe room for 1 night. Room was pleasant looking but pokey - hardly any room to move around the bed & the bathroom was nothing more than a toilet, shower cubicle & sink. The paper thin walls were most annoying though, you could literally here every little noise that past & it felt like the noise was inside the room. Not impressive! Staff were friendly & helpful & location good for Hyde park & close to lancaster gate. Not many restaurants & bars nearby though, best to tube it. Got the room for £75 reduced rate on lastminute, think the normal rate is around £140 - the full price would not be good value for money.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Good fit for our budget in London”", "Author": "mahoagany", "ReviewID": "UR123519635", "Content": "My sister and I usually stay in apartments when we go to London, but our most recent stay was a short one (4 days) so we opted for a hotel just for convenience. The Hyde Park Premier Paddington was a great choice. The price couldn't be beat and the access to the tube and Paddington train station (Heathrow Express service) was appealing. I would advise prospective visitors to book one of the deluxe rooms, as the regular rooms look from the pictures to be just a bed in a room, with a TV mounted to the wall. Deluxe singles have a twin bed, and the doubles have double beds (not queen-size). We got upgraded to a club room, so if you're looking for a little extra room, you may want to ask for one of those. The club rooms have a little more space to maneuver and are nicely remodeled. It was plenty of room for two people to coexist in for a few days. The hotel has a few appealing amenities. Our club room had both UK and US plugs, although the outlets merely make you able to plug in your appliance. It DOES NOT step down the voltage from 220v to 110v so you will still need a converter if your appliances are not dual-voltage (most laptop chargers are). There is internet, but it is hardwired, not wireless. Nonetheless, it was speedy and reliable. The staff was always courteous and friendly, although our room was not ready by check-in (a price we were willing to pay for the upgrade). I would pass on the overpriced breakfast they offer as there are several small restaurants on Craven Hill that offer cheaper breakfasts.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very nice hotel. Must visit”", "Author": "Michele12st", "ReviewID": "UR123316237", "Content": "I stayed at the hotel for 2 nights.. I liked the hotel, ambience and over all decor. To begin with, the checkin was smooth and quick. The bell boy was very helpful in helping me with my luggage and showing where my room was. I think the rooms are well decorated with good bed. However bigger size of the room would have been good. Breakfast is very well presented and tasty. I would like to come here. Reason being its in zone one and the attitude if the staff working is very welcoming. I had a chance to speak with the manager Mr.Ravi who is a gentleman and very helpful.  If you are in this part of the city, surely this hotel is must visit.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good hotel and gr8 staff but poky rooms.”", "Author": "Angmatthew", "ReviewID": "UR123097507", "Content": "We stayed for couple of nights in hyde park premier london paddington and its fantastic staff and service was excellent especially front desk staff and pranav was good in ahowing us the directions and stuff like that which was very helpful for us and special thanks to him. I would say that rooms are little bit small but we didnt stay much in the room, we were much outside spending the time. Break fast was good and definetly comming back. Thanks to everyone.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taiping Malaysia", "Title": "“Great Hotel. Wonderful Staff. God Location”", "Author": "VRajananda", "ReviewID": "UR122998530", "Content": "I thoroughly enjoyed my stay at the hotel. It was mu second visit and this time I stayed for 11 nights. The room was very comfortable and well equipped. the staff were all very riendly, polite and helpful. I have not stay in a hotel in London where the level of hospitality matched this. Mr Ravi the Manager and his team are to be commended on the high level of service of the hotel.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "florida", "Title": "“Excellent Manager... Excellent stay..”", "Author": "rachelashter", "ReviewID": "UR122805476", "Content": "We arrived intolondon after all 3 of our flights were cancelled or changed, flying from Florida, and we arrived too late .We booked this hotel from last minute at Heathrow and the hotel still hadn't been sent our reservation to their system when we arrived 18 hours after booking, but it was **not the fault of the hotel**. Ajay at the front desk was absolutely professional, understanding and efficient. He explained the situation, helped us try to call their reservation agent, and did the best he could for us, under the circumstances. later on he gave me 809 room . The room itself was very clean, spacious, quiet and comfortable. The bed was so nice, as we so desperately needed rest. We had a safe, a lit closet, a huge TV, and the bathrooms are well appointed and offer toiletries you may have forgotten. Again, the duty manager RAVI who works long hours (he was there late at night when we checked in, and again in the early morning when we left) was just so curteous, efficient, helpful and seemed like a sincerely nice person. He even let us know later on that the billing situation was rectified so I didn't have to worry for the rest of my vacation at another hotel.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "““Still a brilliant small hotel with exceptional service””", "Author": "business t", "ReviewID": "UR122536535", "Content": "Sanitation and Maintainance of sanitary ware is very good. Breastfast and service is good. The services rendered by the Manager on duty Mr. Ravi is highly appreciable. He is very cardial in approcah.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Excellent Stay NYE - Value for money!”", "Author": "Tessmaz", "ReviewID": "UR122449479", "Content": "I booked this hotel for NYE on lastminute.com for only £98 (yes £98 NYE in London!) It was my sons 8th birthday so I was pretty excited to be watching the fireworks in London for his birthday at a really affordable price, with a great location…then…I read all the reviews and I was horrified so I emailed the manager Ravi, who was reassuring, lovely, pleasant and could not be of more help. I was still nervous on arrival and checked in but I had no reason to be! Staff were friendly, helpful, hotel was clean, fresh flowers, yes like all older hotels it looked a little tired, some worn carpets little bit of a damp smell, it was a little compacted but it was perfect value for money and met every need possible! We stayed in a club room 017 and it was just perfect, nice clean room, bed was really comfortable, it had a clean shower, small yes but it didn’t need to be any bigger it did the job it needed to do! We could not have wished for a better stay. On arrival our cases were taken immediately while we checked in. The room was spotlessly clean and of good size, the safe worked perfectly, didn’t use the internet or have breakfast so can’t comment on them…The hotel was in a fantastic location closest tube station was Paddington (5 mins walk from hotel). I would have no problem recommending this hotel or staying here again. I think the comments on Tripadvisor can be a little unfair, obviously people have different experiences but for the price of the stay it was perfect for us, excellent value for money! My honest opinion is this hotel is not to a standard of 4* I would say it would be more accurate to be a 3* rating but for us it was just perfect, excellent value for money!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Stranger gained access to room in the middle of the night”", "Author": "Jessica T", "ReviewID": "UR122025933", "Content": "A friend and myself stayed in room 408 and I have never been so scared in my life. We went to bed early as we had an early departure to find that at 1am in the morning a black guy managed to enter into our room with his door key. We screamed at him to get out which he did and I could hear him apologise (he probably got the wrong room) but his key should not have opened our door. Neither of us could get back to sleep after that. When I complaint the next day in writing as when we left the receptionist was too busy on the phone (we had already paid through lastminute.com) I only received a note back from head office asking which hotel I stayed in. I have e-mailed them again 2 weeks on and have no even received an apology or any explanation how this could have happened let alone some compensation. It's totally irresponsible and the least they should have done is to make an afford to correct / explain how this might have happened but just to ignore it is totally unacceptable. I will never book a hotel out the Shaftesbury hotel group ever again. Apart from that some of the tiles in the bathroom were split and taped together. The room was small and very old fashioned but clean.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Country", "Title": "“Excellent Value for Money 15-17 December 2011”", "Author": "RicRicardo", "ReviewID": "UR121867071", "Content": "Like all of the older hotels it looked a little tired. We booked a deluxe double but were upgraded to a club room at no extra cost. Having read a number of reviews on other sites we expected the worst. We could not have wished for a better stay. On arrival our cases were immediately taken while we booked in, ready to be taken to our room. We were on the ground floor at the very rear of the building room 18. It was spotlessly clean and of good size, the safe was able to take a computer. The shower room while small was again spotless and there were two shower heads one directly above and one on a wall rail. The TV was flat screen and worked well, yes you had to sit by the desk to connect the hard wire for the internet which worked very well. If anyone can complain about the staff then I am sorry you must very difficult to please as without a doubt all the staff were excellent, could not be more helpful and pleasant the cleaning staff were also very polite. We saw the double rooms, yes they were small but again they appeared to be spotless. We rarely book breakfast so we cannot comment on that. We would have no problem recommending this hotel or staying there again soon ourselves. We walked to Marble Arch in about 10-15 minutes the only shame it was on the last morning and we were able to walk back to the hotel to collect our cases. To the staff thank you all and a MERRY CHRISTMAS from Richard & Jackie down in Bristol UK hope to visit again soon", "Date": "December 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Brixham, United Kingdom", "Title": "“Terrible Experience”", "Author": "Will F", "ReviewID": "UR121713489", "Content": "Booked the hotel, then saw the reviews. What a mistake. After 29 hours traveling back to London we booked to stay for three nights, after reading the reviews and although dog tired, when arriving at the reception and prior to taking our bags in I asked to see the room. Thank god I did. It was a club room on the forth floor, the narrow corridors which are obviously a means of fire escape where strude with bags of rubbish. The room was shocking, in the bathroom hazard tape was on the floor covering up several broken tiles, the room was tiny, dirty and dated. Survice it to say I refused to stay. The hotel refused to give a fu refund even with the above taken into account perhaps also to do with the fact that only one member of staff spoke broken English. We found somewhere else to stay, I shall be taking this further, but avoid at all cost!", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“good location...!”", "Author": "anthony s", "ReviewID": "UR121499318", "Content": "Very clean, comfortable bed, nice atmosphere. Bathroom was small but spotless. very helpfull staff and very friendly on checkin room wasnt ready but the duty manager MR RAVI asked housekeeping to arrange it as soon as possible, they provided a very good breakfast and service.will love to be back to this place again...", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Extremely well-above expectations”", "Author": "Alex R", "ReviewID": "UR121363519", "Content": "I expected this to be a regular small hotel in Paddigton. The rooms have four-star hotel fixtures. Very good furniture, bathroom was well designed with an art-deco sink/mirror. Upon arrival I received a fairly small room - couldn't really complain given the price, but the staff was kind enough to upgrade me to one of their larger small rooms. This was fairly large and had a stand-alone desk, a large closet and nighstand in addition to the bed and all the other appointments. I was pleased with the new room, but asked for a few additional things (an iron and board, more cloth hangers, an internet cable, a larger hair dryer - altough there was one in the room - and the internet to be unlocked - as several websites were restricted and this created a conflict for my VoIP application). They sent literally seven different people to handle my every need. I received an iron with board and 15 hangers in almost 5 minutes, the internet guys were super-quick to solve the probleme and I received a brand new hair dryer. I've stayed at the Four Seasons and Ritz fairly regularly (in the US) and don't recall the last time when people manage to mobilze themselves so fast, Very pleased with the experience - amazing value for the money, definitely recommend and will stay there in the future.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Highly not recommended”", "Author": "Ibaloivisitor", "ReviewID": "UR121348954", "Content": "Internet bandwidth is limited and was back at the hotel about 6 pm and found out there was no internet. Kept getting the message that the hotel has reached \"1 gig\" limit and needs to purchase more. Recetion couldn't do anything until the next day. Also stayed in the \"club room\". Only club room I saw that did not have a ref. And was tightly spaced too. You could also hear the creaking sound of wood flooring when someone walks. Waiting area would not be mistaken as that of a hotel. Elevator was not working. And even it was, you will still need to use the tight stairs to go down the \"club rooms\". Recetion is unable to get repeated instructions or would this be lack of common sense. Breakfast starts at 7am, but the night before requested for a ride at 5am to take me to the trains. Imagine charging me for breakfast for that day.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Somerset", "Title": "“Noisy Neighbours and Noisy Showers”", "Author": "Sunseeker30Somerset", "ReviewID": "UR121128827", "Content": "We arrived to the hotel and we had been allocated a club room which sleeps 3 people and was the room we requested. It was small especially the bathroom. The room had air conditioning and was clean and the bed was very comfortable. Our only complaint was on the first night the people in the room next to us woke us up slamming doors and shouting and the walls must be very thin as we could hear every word and to top things off all 3 of them had a shower at midnight (seperately not together!) and it was so noisy it sounded like a helicopter taking off!!!! The staff were friendly and polite and the breakfast was very good. All in all not a bad experience but could be slightly better.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“The smallest room in history!”", "Author": "EJ1111", "ReviewID": "UR120965517", "Content": "This hotel is dreadful. The first room I was allocated was only as wide as the bed, there was zero room at the end, I had to crawl over it to get to the window which didn't open and the aircon didn't work. It advertises safes- none. No minibar, no bar. The second room had a blocked sink. If I had had any confidence that they would have given my money back (you pay in full on arrival for good reason), I would have left.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Strange...”", "Author": "travellerk02", "ReviewID": "UR120419042", "Content": "Upon check in, our rooms werent ready but we were told we would be on the 5th floor and to come back later. This was fine, except when we did come back we were ushered to the basement - in a dark and very hot room with no windows and no airconditioning - and told our bags would be there soon. there was a pedestal fan in the corner. We waited for an hour, sweating it was so hot, and no bags so we went up to reception to see them sitting in the hallway. We asked if we could please have another room as we couldnt stand it any longer. turns out the lifts were broken so they put us in the basement. we explained we were more than happy to carry our bags if we could please have another floor. thankfully, we were moved and told our bags would be there in a moment. again, we waited 2 hours and no bags so went down and carried them ourselves. we also told the staff that we had no hairdryer, our phone was disconnected, and no in-room compendium. we were told 'my colleague' will help you in a moment. We had no one come fix anything in the next 24 hours. we asked again later the next day and received no response. on the 3rd day we received our hairdryer after enquiring again. this hotel is in a great location and room was good, communication with staff is very poor though.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leeds", "Title": "“Better than average (with a lift to upper floors!)”", "Author": "ShelovesEcudaor", "ReviewID": "UR120412905", "Content": "Paddington hotels are usually very expensive or rather shabby. This was better than average. Taking the lift to the 3rd floor, the room was nicely decorated, but rather small - it was billed as a single room. It was well appointed with tea and coffee facilities (with biscuits), a decent TV and English selection of channels and ok toiletries. It was quiet, the small double bed was fine and the bijoux en-suite of shower, basin and loo very nicely done indeed. The only real downside is that there is no food in the hotel (no breakfast or dinner for late arrivers, or snack machine in reception that I could see). There used to be a fridge of goodies in the room, but they must have decided to get rid, as the fridge had been removed. Leaving just an empty cupboard with a plug socket in the back. I would have happily paid for the expensive peanuts and chocolates instead of going out on a dark rainy night to hunt for food. The room, crazily, had two phones, which you could almost use at the same time they were so close together. And as there's no food, you wouldn't be calling room service. Anyway - only 3 or 4 minutes walk from Paddington - so I may use it again.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Nice, clean hotel”", "Author": "176Hks", "ReviewID": "UR120118937", "Content": "We booked the club room for 2 nights. The rooms are clean and have basic amenities including a microwave and toiletries. The hotel is value for money and great location. All the staff were very helpful and friendly. I have stayed at other hotels in London that have been further away from central with smaller rooms which have cost more. Overall a good hotel.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Extra £10 gives you rewards”", "Author": "russ m", "ReviewID": "UR119650536", "Content": "At last back to normality .this hotel is comfortable quiet and clean. the reservation staff need to learn some manners but everyone else within this hotel is great.Tip if you want courteous answers try to speak to the manager who is very helpful. the rooms are quality with lovely bathrooms. Easy reachable restaurants or a pub within 5mins walk. looking forward to my next stay.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good location”", "Author": "rbtsanne", "ReviewID": "UR119476605", "Content": "Nice hotel had a good sleep at night. The breakfast is excellent. A warm welcome from receptionist and porter in the morning. I am sure, I will prefer to stay in this hotel in my next visit.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Best option in central London”", "Author": "Iveraldo D", "ReviewID": "UR119055540", "Content": "I stayed at this hotel for 6 nights and I really enjoyed my stay there! The staff are friendly and my room was quite comfortable, with large TV, air-con and the best shower I've ever had in Europe! Don't worry if they put you in a \"basement\" room - although small (it was a single room, anyway), it's noiseless and the bed is so comfortable, with clean linen and the window opens to a small inner garden. Breakfast is also good (only \"but\": cold milk - they'd probably have warmed it if I had asked them to). The hotel is only a few steps from Lancaster Gate tube station and also a few blocks from Paddington Station - trains to/from Heathrow! - not to mention the many good restaurants in the neighbourhood! What else do you want?! I do recommend this hotel... You'll never regret!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Livingston, Scotland, United Kingdom", "Title": "“Ideal location with good reception”", "Author": "Sowmya M", "ReviewID": "UR118943774", "Content": "Staff is cordial, virteous and instant in service. Spontaneous in receiving and excellent services from the staff and the manager on duty Mr. Ravi.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“An excellent stay and great value”", "Author": "DarkSuitShinyShoes", "ReviewID": "UR118741466", "Content": "Very friendly and helpful staff, made me feel welcome from the start. Spotlessly clean and beautifully decorated room with aircon that worked, nice bed linen and towels - small, no desk, one or two scuffs but outstanding value. Free internet 5-10 mins walk to Paddington or Lancaster Gate. No time for breakfast but will certainly be going back to try it: I have been looking for a quality hotel at around £100+VAT in London for some time and am delighted to have found this.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nether Wasdale, United Kingdom", "Title": "“\"Excellent stay\"......”", "Author": "misha s", "ReviewID": "UR118605537", "Content": "Stayed september, traveled solI stayed at Hyde Park Premier London Paddington for 2 nights..it was one of the best hotels i had come across..Very nice staff with all the basic needs available 24/7, tasty breakfast during the stay. I would definitely come back as i really have a liking for such nice hotels with professional staff & where one can work without any disturbance..!!", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good location friendly staff good room!!!! Definitely we will be coming back Spl thnx to Annu!!!”", "Author": "Rockstarzx", "ReviewID": "UR118532324", "Content": "The rooms are small though first day but requested to change next day, the room what they moved us was fabulous it was 008 nice garden view and staff and the concierge helps us to show directions and stuff like that and breakfast was good though it was little bit expensive!!! Thanks to the hotel staff who made our stay more pleasant and we will b back soon!", "Date": "September 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Scam and Fraud-AVOID”", "Author": "SSK103", "ReviewID": "UR118488096", "Content": "We booked this hotel in July 2011 for Sep 7-11 and specifially demanded not to be moved to another hotel to their inferior hotel in Earl's Court after reading such practice by this hotel chain. We were shocked when we were told exactly that stating the same plumbling problem as used to other past guests in the past. They use this hotel as a cover to attract guests then move the guests to other inferior hotels elsewhere in town. We were were assured of the same quality at Shaftesbury Premier Kensington by website photo, but were driven instead to Kensington Townhouse across the street on Hogarth St in Earl's Court. Worse yet, we were given a tiny basement room with noisy tube below. We were insuffiently compensated with free breafast. We managed to move to an upper floor the next evening at 10pm and the door lock did not work and we had to wait an hour to get it fixed to get in, Then we discovered the sink was leaking and blocked. We had to wait till the next day to get it fixed. Lobby internet was constantly out of service. The receptionist Ali was very rude and impolite...should not be working in hospitality service. Tripadvier should collect enough of the similar complaints from the duped guests and stop doing business with this hotel chian. The receptionist <Ali> was very very RUDE. Evaluation below is for Kensington Townhouse on Hogarth St. Earl's Court. Canadian Visitors This mal practice should be reported to the authority for punishment.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada, Kentucky", "Title": "“good hotel and comfort to visit all locations in london”", "Author": "danial b", "ReviewID": "UR118403795", "Content": "we stayed in the hotel for 2 nights. as our checking time was 2:00 pm, but we were so early to the hotel i.e., around 9:00 am in the morning and we were very tired in our journey. when we reached to desk, the manager \"Mr. Ravi\" saw us and asked about our situation and immediately he ordered the house keepers to clean the room on priority basis. we got the room before 10.30AM and we were very happy for his helping nature. the staff also very polite and the housekeeping people were very helpfull. More over the break fast is excellent and service too. though we were new to london, we got better directions from the receptionists and porters. definitively we will be back to this hotel if we visit london next time.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“EXCELLENT HOTEL”", "Author": "Anthony A", "ReviewID": "UR118334148", "Content": "I'am ANTHONY ALMEIDA , I stayed for 4 nights in this hotel and I loved the room , I 'll just rate it excellent.I was given a small room 201 first and was very Upset but soon I was changed to a good ROOM 208 with excellent facilities . Thanks to the manager MR. 'RAVI'. The 2 Indian Gals 'VALLINE' AND 'ANU' At the reception were very good, always Smiley and Polite. They also helped me in finding the Transportation facilities in London As It was my first visit to London. Even the Luggage Porters were very helpful not only with the Luggages But also by showing the directions to the HYDE PARK, specially NARESHA I guess. I enjoyed my stay at THE HYDE PARK PREMIER HOTEL and I wish to Come back soon as LONDON IS also very beautiful.", "Date": "September 19, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“If you want to be messed around and love hassle this is the place for you!”", "Author": "doodicus", "ReviewID": "UR117946976", "Content": "On arrival we were told (without batting an eyelid) that we were not actually be staying there but elsewhere due to 'maintenance'. Disgusted with the way the appear to treat many of their customers- judging by several comments on this site this is not an isolated incident. We chose it because of the location only to be messed around. My advice is to not use this place, stay well away, and go somewhere you can trust, somewhere that will deliver what you paid for.", "Date": "September 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“\"Maintenance Problems\"”", "Author": "Bluey1979", "ReviewID": "UR117907140", "Content": "We booked this hotel through Last Minute, despite having seen the reviews here about arriving to be moved on to thee hotels be ause of \"maintenance\". Disappointingly the same thing happened when we arrived and they tried to pack us off somewhere in Kensignton. If this was true then we should have expected a phone call or email to warn us. After much discussion we were relocated to the Best Western just round the corner on Devonshire Terrace, with rooms upgraded. However it was massively inconvenient; I genuinely would not recommend anyone book this hotel.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Malta", "Title": "“Excellent hotel, lovely staff and great location - Will definitely return”", "Author": "charlef", "ReviewID": "UR117893934", "Content": "The hotel is located within walking distance (5 mins) from Paddington Station. The staff working at the hotel are lovely and very friendly. The room was very comfortable and most importantly it was clean. The breakfast which was very good was included in the price. Also there is a good variety of restaurants close to the hotel. I have read the reviews of other people who stayed in this hotel, I cannot understand why they complained. Honestly the service I received from this hotel was excellent and I have no problem with recommending this hotel to anyone.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jinan, China", "Title": "“good facility avalable willing stay again”", "Author": "cheng l", "ReviewID": "UR117452960", "Content": "try to provide bar ,swiming pool ,wi-fi facilities in the rooms than it makes the guest more happy", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Bad start became good”", "Author": "Russ M", "ReviewID": "UR117440759", "Content": "After a little bit of confusion over them not accepting a business credit card . Once inside i was given a club room which was large but felt like i was in the basement. 2nd visit i had to go through late rooms .com as the reservations tried to take me for an extra £30 a room per night . asked for a deluxe double ( the room was 10ft x 7ft ). third visit i went through the manager (much better service) nice room, nice bathroom and great service . Tip of the day if can speak to the manager you get much better service and response than the reservations team ( who can be rude and a little ignorant ).", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Diss, United Kingdom", "Title": "“What good value & I felt welcome”", "Author": "warfarinman", "ReviewID": "UR117242126", "Content": "The welcome at this recently refurbished hotel was warm. I arrived late as well. The breakfast (remember to pre-order the night before) was a real surprise too. Great bowl of fresh fruit, simple but adequate choice of 'full English' and apparently happy staff. Makes a great change from 'brand' hotels and I recommend this as a great place to stay. Rooms a bit small, and window frames need renovating, but what can I expect for £79 a night in the middle of London! I'll stay again when next in town. A friendly smile goes a long way.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "hyderabad", "Title": "“Nice hotel with good staff members”", "Author": "jayachandra c", "ReviewID": "UR117239101", "Content": "nice hotel with worm welcome by staff and very good services by house keepers and porters. love to visit again.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“I liked a lot and I'll come back as soon as possible”", "Author": "LUISA1983", "ReviewID": "UR116636900", "Content": "the manager, the receptionist all the staff is amazing, very professional, discrete and very kind!!!!!!!!!!amazing!!!! The hotel on the map is near paddington station (perfect for heathrow station ecc) and it's near lancaster gate 2 minutes walking. If you take a cab to arrive in piccadilly you'll spend only 17 pounds.", "Date": "August 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "london", "Title": "“good service,good hospitality and great location”", "Author": "jemma_gideon", "ReviewID": "UR116034697", "Content": "we came for a concert in hyde park and we found out the hotel is a great location 5 min walk to hyde park were the concert was held and overall service was good with good clean rooms, cleaned and serviced everyday with friendly staff.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "London", "Title": "“Awful experience”", "Author": "DriesGee", "ReviewID": "UR115381722", "Content": "Unfriendly woman at recepetion desk Pay in advance while the hotel cannot give me my (confirmed) room: 169 GBP was said to be a good price (though still double of what I pay for a normally equipped hotelroom in the Netherlands). After work and dinner (11 p.m.) arriving in hotel: first doubt about room, then one room free where bed was NOT made up (still as left by previous room occupant), bathing room leaking and flooded, used towels all over the place. Night shift people have after me complaining and insisting they should solve the situation. At 1 p.m., I was sent to a hotel 15 minutes further away (which cost me the next morning an extra taxi fare of 20 GBP). In that hotel I got a room of approx 2 x 3 meter surface but at least, I could sleep. So, based on my experience, this hotel is to be avoided.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Dublin", "Title": "“Avoid this hotel”", "Author": "dazzerd", "ReviewID": "UR115263354", "Content": "Booked this hotel despite the fairly critical reviews and got punished for it. Dont make the same mistake. Apparently they have a serious problem with their reservation system and more often than not will not be able to honour your reservation, so that they will have to transfer you to one of their sister hotels. Having read about this, I actually did contact the manager of this hotel beforehand (who comments on many posts here with doubtful promises to improve the situation) and asked him to make sure that a room will be kept for us. He didn't react and of course, my reservation did not get honored as well due to overbooking. So do yourself a favour and chose a different place with a more reliable service. The hotel I got transferred to was 4 stars as well, stuffy, tiny rooms with no daylight. Not recommended.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Avoid. Not good value, small rooms. Wanted to move us!”", "Author": "PeterGable", "ReviewID": "UR115249497", "Content": "After specifically booking a hotel near Paddington we were informed on arrival that we were being moved to a hotel near Earls Court. Having made a stand a couple of rooms were found but very small. Quite simply, NOT 4 star and NOT value for money at £150 a night plus breakfast with orange juice served in plastic cups. Just don't go here.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Avoid”", "Author": "Omnissolutions", "ReviewID": "UR115148918", "Content": "My colleague booked this hotel as it was ideally placed for work. We subsequently checked the reviews on Trip Advisor and that's when the concerns set in. And we were right to be concerned. On arrival we were told that we were being transferred to another hotel in Earls Court which we refused to accept. Rooms were miraculously found and we were shown to the first one which looked perfectly acceptable from the doorway. I was told that my room was identical, accepted the key card and made my way up. I opened the door to find that the room was so small that the bed reached from one wall to the other and I had to climb over it to get to the window, desk and wardrobe (which wobbled when I opened the door). The television screen was broken as it had two vertical breakage lines in the LCD display. Breakfast was an additional £15 or thereabouts and was perfectly adequate for me but on the second morning the fruit juice glasses were plastic. A minor niggle, I accept, but not acceptable for a room costing £130 per night without breakfast. On the plus side, the room was quiet and the air con was a blessing in the heat. The staff were friendly and helpful and the place was clean. I just object to paying such a high rate for a shoebox of a room with minimal facilities. I would caution anyone against staying here unless you are staying at someone else's expense and would recommend taking a can opener to get in and out of the room!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“shocking”", "Author": "msparry79", "ReviewID": "UR114875820", "Content": "I booked this hotel because it was close to paddington station and hyde park. I was travelling with my teenage daughter we were having a weekend together watching a concert and shopping. Upon arrival at the hotel there were people waiting in front of us already having problems at check in. After a good \"0mins to be seen to by reception staff I filled in a form and told to wait in the lounge for 5mins, after 20mins I went to reception to find out what was going on and they were in the process of transferring us to a hotel in earls court as they claimed they were having maintenance issues. I was furious at this but had no option but to move costing me alot of money in transport back and forth to where I wanted to go. Upon arrival at the second hotel we checked in went to our room only to find that somebody else had been checked in to that room only 10mins before we had arrived. once in our room it was clean but vey small and you couldnt call the air con anything other than bad. The following morning I went to get into the shower and much to my disgust the shower was nothing more than a dribble, but at this point I was so disgusted by the whole experience with this hotel chain that I decided just to write a letter of complaint to head office. Not one member of staff between the 2 hotels had any idea what they were doing. If you want a 4star experience this is not the hotel for you.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Perfect for visitors as a base for all attractions”", "Author": "Coolcook", "ReviewID": "UR114831867", "Content": "My husband and I stayed at this hotel on Saturday night. This was after attending the Hard Rock Calling in Hyde Park. We had an amazing night and after we were also able to walk back to the hotel we had the best nights sleep we have had anywhere in the world. The staff are very welcoming, the rooms are very tidy and clean. We will definitely stay there again. It's a shame that we had not discovered it before now, as we like to visit London a couple of times a year.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stoke on Trent", "Title": "“We had a lovely stay there.”", "Author": "janealexisf", "ReviewID": "UR114787436", "Content": "The staff were extremely polite, the room was great very clean, all accessories and attention to detail, very comfy bed too ! Breakfast great (if pricey) . Lovely small hotel in great location to Hyde park.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“We had a wonderful stay!”", "Author": "natashanewton", "ReviewID": "UR114606409", "Content": "My partner and I booked this hotel through Advertising Online in May. After I'd booked I checked some of the reviews on Trip Advisor and was horrified! They're not very flattering to say the least. I was hoping we hadn't made a huge mistake, and when we turned up on June 10th I honestly wasn't expecting much. But from the moment we stepped in to the hotel I was very pleasantly surprised. The staff were welcoming and friendly, and during our stay (two nights) we found them to be very helpful. We let them know of a small problem in the bathroom before we went out for the day on Saturday, and when we returned it was fixed! The room itself was beautiful - fairly spacious for a London hotel room and even though the bathroom was small (which is to be expected in London - I've stayed in many hotels and they're all like this!), it was super-clean and well-stocked with fluffy towels, tissues and little extras. The bed was comfortable, we had tea and coffee making facilities, a large flat-screen television, great lighting - we felt really at home there! The room was cleaned well every day. The hotel is in a great location and within a few minutes walk from Paddington Station and Underground in an area with many great cafes and restaurants. Overall, we thoroughly enjoyed our stay and we'd definitely go back. A huge thank you to all the staff for making our stay such a pleasant one!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "slough", "Title": "“Alot better than I thought!”", "Author": "74sld", "ReviewID": "UR112903167", "Content": "I booked this hotel for a group of 4 friends who were having a weekend in London. I booked though 'Last Minute'. After I had booked I read some of the reviews on Trip Advisor and was really worried I had made a BIG mistake. However, all 4 of us thought the hotel was really nice. The rooms were clean, modern and well equiped. The batherooms were lovely and the public areas of the hotel were really nice with lots of fresh flower displays. The staff were all helpfull and polite and the location was brilliant (2 mins walk from Paddington Station) I would definitely stay again.....", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“WORST HOTEL EVER - BELIEVE THE REVIEWS”", "Author": "leanneyk87", "ReviewID": "UR112209639", "Content": "We spent ages trying to find our hotel to be told there were \"maintence\" problems and we were being moved hotel. We were not impressed as we picked the hotel for it's location and moving hotels ate into our precious time we had in London. The other hotel was in Kensington, not a mere 10 mins away as first told. The hotel would not pass for 4 stars and it is right next to a tube line! The first room we were put in was in the basement and everytime a train went past the room literally shook! We asked to be moved and the manager was extremely rude and unapproachable. We eventually got moved but the room was small and cramped! DO NOT BOOK THIS HOTEL, the quality of the rooms is awful and customer service is severly lacking", "Date": "June 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Terrible guaranteed booking at Hyde Park Premier Paddington Hotel, London”", "Author": "ZulGhazali", "ReviewID": "UR109424668", "Content": "We had a guaranteed booking for Executive Double Room from 10-13May. we arrived at the hotel at 11pm and surprisingly there was no more room available. We were not the only one without room. We were put on another hotel which is about 45minute away by taxi and only got to the room at 2.00am and have to return back to hotel the next day. The staff manning the front desk is not well trained to handle the customer and has to make many phone calls on many issues asked. The executive double room was also too small.", "Date": "May 23, 2011"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "4"}, "AuthorLocation": "woking", "Title": "“Do not book this Hotel”", "Author": "jjbrs", "ReviewID": "UR104734226", "Content": "On arrival i asked about parking and was directed to the nearest car park which was 10 minutes walk away, after walking back with all my luggage the hotel said our room was unavailable due to no water which they could have maybe mentioned when i asked about parking and saved me the hassle. They then put us in a taxi to an alternative hotel they said was in kensington ,it was infact in earl's court miles from our prefered destination in a dingy side road and it was at best a 2 star guest house, The hyde park premier is supposedly a 4 star so i expected like for like but didn't get anywhere near. i booked through lastminute.com who were just as bad they didnt try to relocate me they just cancelled the booking and left me in the middle of london to try and re book somewhere at very short notice, i managed this through another company. it was meant to be a special day for my partners 21st and was totally ruined as they sat in a cafe for most of it while i tried to sort the mess out.", "Date": "April 20, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Essex", "Title": "“Do Not Book This Hotel!! Disgraceful Service!”", "Author": "BeachFamily76", "ReviewID": "UR104490191", "Content": "After reading negative reviews about this hotel I was slightly concerned about our booking. I had read on more than one website and that on many occasions the hotel could not allocate the room that had been booked. As I booked the hotel as part of a package for a birthday present with lastminunte.com I was stuck with the booking. On arrival we were informed that our room was no longer available due to a water problem in our room and that we had been booked into another hotel in Kensington. After speaking with reception, really unhappy but not shocked we asked to use the internet to review the other hotel. The receptionist questioned why we wanted to do this! She told us to just go to the hotel and that we would like it. After checking out the hotel we found that it was not in Kensington but outside Earls Court Station. After asking the receptionist why they said it was Kensington and not Earls Court she replied saying yes I know but it’s only 16 minutes away by cab. By this point we were so annoyed we asked for a refund. The same rude receptionist made a call to the manger and was told that as it was booked through lastminute.com we would have to ask them for a refund. The receptionist then asked us to sign to say we had booked in. I informed her that I would not sign for a room I had not seen. She told me I had to sign the form because that’s what you have to do! I refused out right so she ripped the form up in our faces, muttered something to her college and huffed. Absolutely disgusted by the service from the receptionist and the fact that we had to be somewhere by a certain time we had no choice by take a cab to the alternate hotel which actually was a 20 minute drive. I will be writing a formal complaint letter to lastminute.com as this hotel obviously sells itself on the fact that it is a hotel in Hyde Park but then transfers its customers out to other destinations. I would also like to add that we were also not the only customers that day to be transferred! It’s an absolute disgrace!", "Date": "April 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Warwick", "Title": "“The worst Hotel in the entire World!”", "Author": "HotelHopper007", "ReviewID": "UR104381867", "Content": "I travel into London intermittently for business, and having booked on Last Minute before and had a very pleasant experience at a \"Secret Room\", i thought I would let your advisors surprise me again. Boy, was it ever! I selected a \"4star luxury hotel...\"blah blah! and was eventually informed it was THIS place!. As i finished my last meeting a little after midnight i was expecting nothing more than to be shown to my \"double deluxe\" room where i planned to raid the minibar and worry about the consequences later! I approached the desk and was spoken to by the RUDEST young man, who literally looked me up and down and began to tell me about a) how he couldnt find my booking and was I sure I was \"at the right hotel\" b) how there were no \"deluxe doubles left (i was HOLDING ONTO MY BOOKING REFERENCE c) would i accompany his colleague (too busy doing????) to another buidling about 100m away!! This after i had dished out £14 for parking BECAUSE the \"only flaw\" i anticipated was the lack of parking!! They should have mentioned, lack of clued-in staff, lack of rooms, lack of a functional building even! I was finally shown into a BOX! A single squat with no heating, and by the next morning i was a mess (Asthma) ! I spent the entire next day at A and E- but I'd had an early start because in all this (£150p/n)- breakfast was not included you see! Wouldn't recommend it as a kennel.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“Clean, comfortable, and convenient.”", "Author": "heather24-11", "ReviewID": "UR100099385", "Content": "We stayed for Friday and Saturday night, and were extremely satisfied with what we got for our discounted room rate. The hotel is in a quiet street but within walking distance of Paddington Station. Our deluxe double room in a ground floor annexe was small but clean and very well appointed (TV, free broadband connection, kettle with complimentary coffee/tea, microwave, ensuite bathroom with hot, powerful shower.) The buffet English breakfast was excellent. The staff we encountered were polite, friendly and helpful.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "west country", "Title": "“Ok if in a Club Room but dont expect 4* quality”", "Author": "andrewsabroad", "ReviewID": "UR99985464", "Content": "Hotel positives Great location 5 mins from Paddington station Really comfy beds Club Room good size Great rain overhead shower Microwave in room Hotel Negatives Wallpaper peeling in several places Corridor smelt unpleasant ie drains Could hear the underground trains every few minutes so didnt get a great nights sleep Not enough TV channels We paid £80 for 1 night, is not a 4* hotel unless they maintain the decor, didnt see standard rooms but Club room was nice enough but was over priced for standard of accom. If we had been higher up Im sure it would have been better as we were allocated a room in what appeared to be basement level. Would recommend if decor was maintained better as great location and room was clean, great comfy bed just need to be on a higher floor so you dont hear the underground all night", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ljubljana, Slovenia", "Title": "“too hot during the night”", "Author": "anchizee", "ReviewID": "UR98363577", "Content": "We were transfered to this hotel, after a line of problems that we had in their sister hotel kensington town house. Room was small, medium clean and way too hot during the night. We had window opened, but it was broken and we had to have a bottle of water stuck in that it stayed open. We asked at the reception few times to do something about it, but there was no response. They also have some problems with their system I suppose, because breakfast was included in the price but they couldn't see that in the system and the girl that was responsible for breakfast brought us the bill for breakfast, during we were eating....you can hear everything for the halls to the room.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Room WAY too small”", "Author": "Rob187373", "ReviewID": "UR98094544", "Content": "If you have luggage, forget it! The bed butts up to the desk, so the chair.... I don't know why there was a chair. The TV has VERY bad reception so unwatchable, there was no fridge and the bathroom was marginally larger than the wardrobe. You could stand in the shower, but impossible to actually move once inside. Navigating the room was like playing one of those puzzle games where you have to move a piece into a space so you can move another. If it was twice the size it would have been a standard double room.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay away!!!”", "Author": "HDL21", "ReviewID": "UR96425201", "Content": "Great location as the tube is only a short walk away but as for the hotel...terrible staff, the rooms are tiny beyond belief and the service was totally shocking. We stayed for four nights and our room wasn't cleaned once we had two tiny coffees one morning down stairs and it cost us £6 it's a disgrace of a place and I urge any people who see cheap deals for this hotel to avoid it...it's just not worth the time or money.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nice, France", "Title": "“Right idea but needs to be better maintained....”", "Author": "Eddie06", "ReviewID": "UR96118007", "Content": "Part of the Premier chain and one of many in the same chain in the Paddington area but possibly not the best though on a quiet road. Second stay (first over a year ago, maybe more) and its already showing signs of wear and tear with several bathroom fixtures in need of fixing. Rooms are VERY small (too small for a vacationer with luggage!) but design and fixtures are above average for London and designed to give a feel of a business hotel on the cheap and represent good value for money, especially if only after b&b for business. The rack rates are a fiction.......", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newbury, United Kingdom", "Title": "“Perfect stay”", "Author": "joesin", "ReviewID": "UR95318752", "Content": "We arrived early on a Saturday afternoon and were welcomed by friendly staff who immediately upgraded us to a Club from our standard double booking. We returned to reception only briefly a couple of times to check details for breakfast etc and pick up some toothpaste which we were provided free of charge, but were treated very well and with no hesitation at all times. The room was VERY comfortable and clean and we spent an entire day there in perfect comfort. The room had an ethernet cable allowing us free access to the internet which is worth a mention even if it might almost be expected these days. A hotel stay can be very good or very bad depending on very few factors as far as I am concerned. I am not a terribly critical person, but even for me this was clearly free from any complaints, and thats as good as a stay can get - no hassles. Thank you Naveen and the team.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Very nice hotel in central London”", "Author": "severine_andre", "ReviewID": "UR94723156", "Content": "Very good value for a hotel in central London, great location, helpful staff.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“convenient location, functional with helpful staff”", "Author": "mikec_11", "ReviewID": "UR93749369", "Content": "staff very helpful good breakfast room small but adequate and no issues with heating or shower", "Date": "January 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Don't do it...”", "Author": "CattyBB", "ReviewID": "UR90470893", "Content": "My biggest complaint is the hotel turning the heating off while it was snowing and minus god knows what outside, we were absolutely freezing. We asked several times over the course of our stay to have someone look at the heating (since the reception staff feigned ignorance as to the coldness of our room) or to change room but kept getting put off so ended up sleeping in socks, thermals etc. with a ratty old blanket we found in a cupboard. We got a good deal through lastinute.com (paid in advance, we couldn’t really afford to pay elsewhere/twice) or else we would have left after the first night. Having said that, the ‘reduction’ on lastminute has to be wildly exaggerated, there is no way this place is four star. Additional small issues are: asking for a TV remote four times (the TV wouldn’t function without it) to no avail, no hot water after 10pm, and ice all over the indoor tiles, foyer and outside stairs from the snow (I’d not be surprised if someone’s crashing through the glass front doors as we speak) for the entire duration of our stay. Aside from a lovely Eastern European girl on the front desk on our first day and very polite cleaning staff, the rest of the staff were arrogant, smug and rude. You get the feeling from their attitude and the poor-man’s Hilton feel of this hotel that they have plebeian aspirations that don’t really match the place (and definitely not the service), i.e. expect to be condescended to if you’re dressed in jeans, no matter how stylish or neatly, and sycophantic treatment if you’re wearing a £50 Primark suit.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oxfordshire, UK", "Title": "“Very disappointing”", "Author": "jacka30", "ReviewID": "UR90368015", "Content": "The room was very shabby: the marble windowsill was cracked into two pieces which were balanced in place, the head board was coming away from the wall and the furniture was dented. The heating was totally ineffective and the extra blanket smelled musty. There was barely enough room to walk around the bed and the bathroom door opened outwards it was so tiny. I could hear everything through the walls including the rumble of trains and the snoring of the man next door. They had left the window open in the middle of December (!) so the room was freezing when I arrived. The location is convenient for Paddington station but I won't stay here again as for a 4* is very poor value for money.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“What a disaster”", "Author": "Marcopolo023", "ReviewID": "UR89793428", "Content": "We should have known that there would be problems when the hotel staff wanted to \"transfer\" us to their partner hotel since there was no hot water, \"just on the other side of Hyde Park.\" We had been to London enough to realize that after a 20 minute taxi ride, it was more like \"the other side of the English Channel.\" We insisted on going back and after the American Express rep talked to the staff, lo and behold, they found 2 rooms. Each one was small and as hot as a sauna. We had to climb over the bed to get to the desk to hook up the broadband. We were too tired to insist on changing hotels and they did switch our room the next day but still. Beware of this kind of scam. The cabdriver even warned us about Shaftesbury hotels in general.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Never Again”", "Author": "sharonjenkins78", "ReviewID": "UR83516101", "Content": "This is the second time I had stayed at this chain, albiet last trip back in July I was booked into this hotel but was moved to an annexe building of much better quality. Check in was painful to say the least and took over an hour due to the number of people in our party and the need to fill in endless registration details despite this being a company trip and was already prepaid. I had the club room on the fourth floor with a microwave in the room!!. There was nothing particularly superior about this room. The room was spacious unlike some reported by my colleagues but the window was completely broken and would not shut properly due to the wood being severally bowed and so there was a constant draft. There was also no lock on it so from a security perspective this was really poor. The inner net curtain was filthy and looked like it hadn't been cleaned for several years. The bathroom was of a superior design but unfortunately the attention to maintainance was poor. The floor tiles were cracked and were loose when walked on. There was a socket on the wall which was completely loose and not fixed to the wall and the biggest issue I had was the shower. There was no running water between 7-8am the following morning. I understand from my colleagues that they experienced a similar thing so I think it was down to water pressure but even so, I don't feel this is acceptable. What I found bizzare is that I had a lovely microwave but no running water!! The basics of comfort were completely lacking in this hotel. I asked reception to help but they advised it would take 30 minutes to come to the room which was no help as I had to have breakfast and head to my business meeting. Overall I was extremely disappointed by the hotel and is certainly not worthy of a 4* rating.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Denver", "Title": "“Good Hotel”", "Author": "LovelyPrissana", "ReviewID": "UR83506858", "Content": "Hotel was nice and cozy. Room was a little crowded of course and we don't expect something big for an hotel in Europe. Location was a little off from central sighseeing but metro station is just 5 minutes walk. The only downside was water was not warm enought if you want to take a bath...Overall, we were pleased with our stay at the hotel.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Marsascala, Malta", "Title": "“What the advert says the advert does!”", "Author": "TamaraMK", "ReviewID": "UR82548296", "Content": "Great stay-inn hotel, comfortable, food was good service was good. Had nothing to complain about", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fareham, United Kingdom", "Title": "“Don't expect luxury!”", "Author": "Ellygloo1", "ReviewID": "UR82262612", "Content": "This was booked with Last Minute.com for an anniversary romantic weekend. The hotel location was good as there are plenty of lovely Italian restaurants around the corner, nothing else I would recommend. The shower cubicle was the smallest and then you just got a trickle of warmish water, not enough to rinse off shampoo that's for sure, the bathroom was tiny and inadequate as no fittings, no shelves to put your toilet bag or toothbrushes on. No fridge, no safe, no free newspaper; a double bed fitted in a small single room meant we had to climb on the bed to get to the window. Reception staff not communicative, I wouldn't recommend this to anyone.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“awseme days of the year”", "Author": "HATTEE", "ReviewID": "UR82069274", "Content": "i went here for my wife's birthday.. it was very nice stay in the hotel. the room was small but very nicely furmished. my wife became a big fan of the hotel..we had a great time! I'll start with the good points and there are many. None more so than the staff. Very friendly, very helpful. specially the indian girl on the recption was very wonderful, the room was pleasnatly decorated and very clean. the king size bed was very comfy.. breakfast were pretty tasty too. Checkout was fast and well handled too. just the tv was not working proprerly. on a whole the customer service was excellentt and would love to go again.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "walsall", "Title": "“Dont Stay Here”", "Author": "queen_alx", "ReviewID": "UR76420256", "Content": "We have been to London many times and we have paid cheap and expensive. We booked with late rooms and had massive problems at the hotel that we originally booked at. We got moved to this one and I really regret it, we paid £140 for a tiny little box room, no breakfast and no hot water. This was really aggravating, we told them numerous times and they just kept saying they would get it sorted and never heard anything back, they came at 11:45 (we had to check out at 12:00) to check the water and promised us they would fix it. Obviously this was no good to us as we were packed and ready to go. Then the manager just passed us on to the hotel manager of the previous hotel who was really rude and said that we didn't need any compensation for the non existent hot water. After being perisistant he said to put it in an email, which we still haven't heard anything back. I will definitely will be steering clear from this chain of hotels. I could have stayed in at a much cheaper hotel in Euston, where the bathroom was shared but Im sure I would have had hot water. We wanted a nice relaxing weekend so we decided to go for the pricier one and I regret that decision a lot! Definitely stay at a different hotel if I were you, there are so many better ones. Good points are good location and quiet, also the beds were quite comfy, although you don't get a duvet just sheets", "Date": "August 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Belleville, NJ", "Title": "“Small rooms, poor front desk service and not cheap”", "Author": "jvargas92", "ReviewID": "UR72221568", "Content": "Being near Lancaster Gate and Paddington station are the best things that this hotel has going for it. The surrounding area is great for finding various restaurants and in walking distance of a great park. But the hotel staff doesn't seem to be on their toes when it comes to being helpful. I asked where I could get ice at the front desk and was told that they had to get it for me. I gave them my room number and they said that they would bring it down within 10-15 minutes. That never happened. I called with a question about the TV which didn't appear to be working and they said that they would send someone to look at it. That also never happened. My room in the basement was also very tight. The safe inside one of the cabinets is not secured and could be removed. There is no mini-fridge and the shower is impossibly tight with a slow drain and water that is either hot or lukewarm. It's just not a comfortable bathroom at all. If you're looking for TV entertainment all that is available is local channels and only about 7 of them at that.", "Date": "July 25, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Booked and Prepaid Room not awailable.”", "Author": "ninendre", "ReviewID": "UR71994900", "Content": "Me and my daughter travelled from Norway to London with a late arrival to our booked hotel. On arrival we was met by a crowded reception where i foun out that many travellers could not get their booked rooms. When I contacted the reception with my booking details in hand from the travel agent, I was told that this agent was unknown by the hotel. No booking or payment was registered on us. Nobody looked into a PC to check this out, only a telephone conversation in Indian/pakistanian language was carried out by the receptionist. Then we was told that there was no available rooms and they could not help us. The room was guaranteed for a late arrival an already paid for four nights. This obviously had happened with several people and I am sure all our rooms which was prepaid was sold one more time. Do not Recomend anybody to rely on any bookings made to this hotel.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Bristol", "Title": "“Not a four star”", "Author": "spiceofindia", "ReviewID": "UR67698303", "Content": "Ok, this is not a 4 star hotel and certainly not as plush as the photographs show! Maybe a 3 star or 3+ star at best. Don't get me wrong, for what we paid in London for a double room with breakfast (£73 through Shaftsbury Hotels) it was very good value and fine. But this is what we found: 1. The reception staff got us lost when we asked for directions to find the hotel! This was mainly due to the fact they wouldn't listen to where we were; 2. The room was nice and comfortable but very small and the bathroom (sorry shower room) was tiny! As too are the corridors; 3. The walls are quite thin and you can hear people coming and going; 4. Room facilities were poor - No fridge, A/C not working (though we didn't need it), safe not screwed down and secure, very limited TV channels and very limited Tea and Coffee; 5. Though close to Paddington Station (it's a 10 minute walk) this hotel is not convenient if you are sightseeing in London - It's not easy to get into central London and takes about 30 minutes by tube; 6. The breakfast was OKish but there wasn't much on offer; On the plus side they have a good size lift, handy baggage storage facility (when you are arriving and leaving) and someone on reception 24hrs", "Date": "June 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "london", "Title": "“Who gave this hotel 4 stars???? its worth 0 stars!”", "Author": "nacir", "ReviewID": "UR65805445", "Content": "It was a very bad experience from the first minute we got in, we were very tired and we had to wait more than 40 minutes to check in. After we got to the room we found out that it was far from a four stars hotel. The room was very small and very hot.. The window was held at the bottom with a glass bottle and we were unable to open it any further. The air conditioner was not working so we called the reception to send someone to have a look and when the porter came and had a look he said yes it is not working and we are going to send someone to fix it!! After half an hour of being in the room I had to go to the reception myself to report it again as we were unable to stay in a room that hot and uncomfortable. The porter was with the receptionist doing nothing as if they forgot about our request,,,after reporting it again he decided to change the room for us. We were given another room on the fourth floor exactly the same as the first one and the air conditionner was not working again!!! We decided to go out to have some fresh air and on our way out my husband mentioned the fault again to the receptionist who didnt show much respect or interest and all he said is there was nothing wrong with the air conditionner!!!!! without even going to the room and check the condition we were in and then rudely ignored us by saying he had a phone call to make!!!! we coudnt sleep all night ....the room was sooo small, we could not move around comfortably and the shower was pathetic and not suitble at all as it was very small. The drain was blocked and so the water gathered in the basin and it felt like the shower would flood in any minute!!!! I suggest that who ever gave this hotel 4 stars should think again bout it.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“This is not a four star hotel! Do not pay up front like that ask you! Go to the Novatel, it is worth the cost.”", "Author": "PEG200", "ReviewID": "UR63082753", "Content": "I travel a lot for business and have very simple requirements. When I stay in a 4 star hotel I expect the hotel to live up to that rating. This hotel is one of those London hotels that used to be a large house and has been converted. You can see where they have made an attempt to window dress at 4 star. It has an iron (attached to the ironing bored), internet access (that needs a cable that does not reach to your bed) and a 'desk' that was around 80 cm square, barely large enough to house the kettle and coffee. On arrival I was surprised by the small reception area. I was early so had to leave my bags, they were left in an open area beside reception, not great. When checked in, I handed over my credit card and to my surprise they charged me for both days I was staying up front. I realised after why this happened, you have no option to leave early. When given my key I asked where the lift was and was told 'over there'. I was in a room through a door just in front of reception. The room opened to a small hallway and was visible through a glass door/wall to the breakfast eating area. The room itself had at most 1m either side of the bed. The desk size as mentioned above is extremely small and impossible to even consider using to put a laptop on and work. Bathroom was equally small and I felt unsafe as the window (which was open) pretty much opened out to the ground outside. I had a very uncomfortable night and decided to pay the money for the Novatel Paddington. When I checked out I was told that my payment was non refundable. Of course it is, that is why you pay up front, they must get a lot of this. Go to the Novatel, it is a real 4 star hotel. Exactly what it says it is and perfect for business. Much closer to Paddington Station as well.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "lincolnshire", "Title": "“Don't expect too much, and DO NOT park outside the hotel!!!”", "Author": "greenjanine", "ReviewID": "UR62590662", "Content": "Booked as a 'secret hotel' through lastminute.com....would not have booked this hotel had I read the reviews before hand. Excellent location, 5 minutes from tube station, however the rooms upstairs are minute, and our room was below ground with no lift access, down a steep flight of stairs. Not ideal. The underground rooms are dark, obviously no view and minimal daylight, windows don't open. Kept awake by cooing pigeons and the sound of underground trains.... Otherwise, the plus points are that the underground room was quite spacious and clean, decor was good. Main complaint was despite planning to park our car in the local NCP, we were advised by the hotel manager to park in the loading bay at the front of the hotel from midday Saturday until we were due to depart, as it was a Bank Holiday weekend. We were repeatedly assured we would not need to use the NCP as it was Bank Holiday. Taking this advice, we left our car and when we came back a few hours later we had a parking ticket, with a £60 fine. To cut a long story short, we have paid the fine, complained to the management of the hotel and they refuse to reimburse the money. Overall, this was a very disappointing experience on a special family occasion that we had been looking forward to.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Small room but excellent value!”", "Author": "jendunphy", "ReviewID": "UR61144617", "Content": "We went for 5 days and I found this hotel on Booking.com. It was very reasonable! The room was quite small and was in a bad location in the hotel as we could hear everything in the reception area but it was cleaned every day and was very well equipt. It was about 5 minute walk to Paddington station and had lots of cafes and resturants close by. This station has 4 tube lines on it and it was perfect. We didnt get breakfast in the hotel as it was very expensive and got it in a cafe up the road for less than 5 pound.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Very smal room but clean at least”", "Author": "kgugalov", "ReviewID": "UR60864042", "Content": "The room was one of the smallest I have ever been in and also our friends were set with a basement room. But it was clean and the location and pricing was good. There was some problem with the piping I guess because the water in the sink was not really going anywhere and also the toilet button was \"fixed\" by a piece of paper...", "Date": "April 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mainz, Germany", "Title": "“How can it be a 4-star hotel?? This hotel should be closed!!”", "Author": "noipop3", "ReviewID": "UR60741260", "Content": "I and my wife stayed this hotel during the Easter 2010, and soon decided that we will never come back to this hotel. They just keep lying. It took about 30 minutes to check in, they said the hotel network does not work, room is not ready, and need time to check the booking but I do not know how it can be.. The room was, as other people say, very small but this was acceptable as we are not so big. But if you are relatively big, you will find uncomfortable with the room. In descriptions of the hotel on their website, booking.com or other webpages, you would think they equip with pretty good amenities and facilities, especially they are a 4-star hotel. However, this is the worst 4-star hotel I have ever stayed. The room had a TV but only 2 channels were available. The internet did not work. The shower did not give us enough water. The sink worked very slowly. They did not change bed sheets throughout our stay without any notice. They did not take garbage in a dust bin. There were a lot of garbages in a desk and wardrobe (not ours!! probably previous guests'!!). They said a bottle of water is free but only one small bottle in 4 nights. Shampoo and soap were filled only once. We asked receptionists to check and fix those problem and they said they would check by evening but nothing happened. They just show themselves that they are a 4-star hotel and delightful to serve for us but they are liars. 3-star is even too much for them. If they care customers enough, this hotel should be closed!!", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Great Stay!”", "Author": "khunter76", "ReviewID": "UR60540926", "Content": "This hotel was offering the best prices in the London area. The location was perfect for all our touristy stuff. The rooms were a little small, but we didn't spent much time in there and it was just fine to everything we needed for the night. I would totally recommend it to friends!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "madrid", "Title": "“Is this a double room ??”", "Author": "pilarz3", "ReviewID": "UR58072084", "Content": "The rooms were smaller than i have never seen before. Small bed as well as the bathroom. At least clean and quiet", "Date": "March 8, 2010"}], "HotelInfo": {"Name": "Hyde Park Premier London Paddington", "HotelURL": "/ShowUserReviews-g186338-d258944-Reviews-Hyde_Park_Premier_London_Paddington-London_England.html", "Price": "$168 - $298*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">14-16 Craven Hill, Lancaster Gate</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 3DU</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "258944", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/97/7d/977dce060d548496e50c81605fa20bf54large.jpg"}}