{"Reviews": [{"Content": "pleasant service the hotel is conveniently situated close to the station... has a 24 hour reception service which is very helpful and the staff are really polite. I was amazed to find the rooms quite good and clean for the price they charge. the staff are excellent considering the fact i bother them a million times.", "Date": "Dec 9, 2008", "ReviewID": "UR215060326", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "beelo"}, {"Content": "If you like camping, you might like this hotel This is a horrible hotel. We booked all of our Italy hotels in advance except for a room in Florence, which we visited at the last minute. The Varsavia was on a decent shopping street a few blocks from the train station, so it seemed fine. And the 70 euro price was even better. But it was literally the worst night of sleep I've ever had in a hotel (and I'm pretty easygoing... you can read my other reviews). Here are the highlights: NO ELEVATOR. A lot of European hotels don't have elevators, so this wasn't a big minus, but it's something to note. SMOKING ALLOWED? Our room, which smelled fresh upon checkin, soon smelled like an ashtray.AIRSHAFT WINDOW. The street would have been a major improvement over the tiny, dark airshaft we faced (not a small courtyard... an airshaft). AIRCONDITIONING... SOMETIMES. Even though it was October, it was a little stuffy in our room. We tried to open the airshaft window, but within a few minutes, we had five mosquitos swarming around us. So we tried to turn on the A/C... apparently, even though the front desk guy told us the room had A/C, they confiscate the remote controls at the end of the season. We did finally get it from the night clerk, but it only had two settings: freezing and stuffy. We froze all night. WORST BED EVER. It was actually two twin beds pushed together. Usually they zip them together, which is fine, but these weren't, and they were really hard, with at least one spring coming up. Halfway through the night, I found myself stuck in a sheet canyon between the two beds thinking, you know, this is actually more comfortable than that bed. UNCLEAN BATHROOM. We had no problem with mold in our Venice bathroom - it's just part of a Venice. But this was Florence and the tile was just gross. Even the towels looked dirty. DECOR FROM 1971. It's a budget hotel, so you give it some slack, but I'm pretty sure they haven't changed the linens since the seventies. ONLY ITALIAN TV. We don't pick hotels for the TVs, but it's worth noting that though it does have a TV, it has no English stations. That said, Starsky  Hutch is kind of entertaining in Italian (I'm not joking... that's what was playing). PRETTY BAD SERVICE. To be fair, the guy who checked us in was awesome. He told us about a nearby festival and was really helpful with directions. After that, it all went downhill. The late afternoon girl wasn't so interested in working; the night clerk looked like he wanted to kill us, and we couldn't even find the guys to check out in the morning (when we finally walked out after 15 minutes, they saw us from the street where they were smoking and chased us down to make sure we'd paid the bill... we had). I'm honestly not sure how this hotel got any positive reviews... it's up there with the grottiest Motel 6s I stayed at when I was young. Even for 70 euros a night, you can do better... just do some research.", "Date": "Nov 1, 2008", "ReviewID": "UR555628511", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "Slangevar"}, {"Content": "Stay away from Hotel Varsavia I took a trip in the fall of 2006 to Florence. Loved the city, loved most of the places I stayed at. The first night was kind of annoying though. I booked accomodations for the first bit through bookings.com. The first hotel I booked was Hotel Varsavia, a two star hotel. I didn't expect much but what I got was a lot less than even that. WHen I questioned the condition of the room, I got attitude from both the worker and the manager at the front desk. The building has no elevators, but three narrow flights of stairs leading to a tiny room with an uncomfortable ancient bed that felt damp and the whole room smelled of mould. There were visible patches of mould where the wallpaper peeled back.. I went back to ask for a different room but the manager said there were none available. When I wanted to leave without having to pay, he insisted to get payed. Being the nice Canadian, I did pay full price and went to a better hotel that night.I really don't recommend this place, especially to those with breathing trouble. The attitude from the staff was also pretty unimpressive and unhelpful. One of the staff gave me a little lecture on how Italians don't care about money and how we North AMericans think we can just buy everything we want (when I said I would pay extra for a better room) then comes the manager insisting on getting payed.I did read up on the feedback for this hotel beforehand, on Bookings.com, but there was nothing negatvie there.Secondly, when it came time for me to post my feedback on the hotel, interestingly, all of my previous emails disappeared from my email account including the email with my pin number to log into bookings.com. When I contacted bookings.com noone ever got back to me.. Hence my feedback on this website instead.I hope I saved a headache (or asthma attack) for someone.", "Date": "Jan 9, 2008", "ReviewID": "UR738826433", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "HungarianBarbarian"}, {"Content": "I would definitely stay here again and recommend it.       View from Room at Night", "Date": "Jun 7, 2007", "ReviewID": "UR702127340", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "ArtistonLocation"}, {"Content": "Horrible Not as billed-rooms tiny, and wallpaper pealing off-3rd floor, no elevator, no help! Would never return!", "Date": "Apr 19, 2007", "ReviewID": "UR975813934", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "RNET"}, {"Content": "Varsavia was simply okay Hotel Varsavia was very clean and the rooms were a good size. However, there is no elevator and it is exhausting trying to haul luggage up the stairs. Also, I visited the hotel in June when the temperature was in the 90's. Every time I left the hotel, the hotel staff would come in the room and turn off the airconditioning! We never had a cool room at all. This was very frustrating. When we tried to complain, it was impossible because the man at the front desk did not speak English! Would not stay there again.", "Date": "Jul 25, 2005", "ReviewID": "UR952347316", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "amarie"}, {"Content": "Good Location, Nice Room, Forget it if you're on the third floor! The hotel is in a great location, near the train station and near the Duomo. The staff is very nice, and the room and bathroom were very clean. My only real problem was that there is no elevator. This would be fine if you are on the first, or even the second floor. But if you have to go to the top floor, you will have lost all your energy by the time you get there, whether you are carrying luggage or not. The other thing that is kind of weird is that while I did have my own bathroom with shower, it is in a separate room, which makes it necessary to unlock your door, relock it, unlock the bathroom door, lock it from the inside and then reverse the whole process on the way back. Can't comfortably wear a towel out because you might run into someone in the hall on the way back to the room.", "Date": "Oct 22, 2004", "ReviewID": "UR856165101", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cxjmeister"}, {"Content": "Petit h么tel sympathique et central   showReview(23243198, 'full');", "Date": "Jan 4, 2009", "ReviewID": "UR788226087", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Magaozhuang"}, {"Content": "La camera era pulita, per貌 il...   showReview(22197222, 'full');", "Date": "Nov 25, 2008", "ReviewID": "UR355180960", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Beaucoup trop bruyant, mais les...   showReview(22232643, 'full');", "Date": "Nov 19, 2008", "ReviewID": "UR953688642", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Personale accogliente e...   showReview(16727549, 'full');", "Date": "Apr 3, 2008", "ReviewID": "UR586943599", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Due notti mi son trovato...   showReview(12649592, 'full');", "Date": "Dec 17, 2007", "ReviewID": "UR762652427", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "j'y retourne volontier!!   showReview(11079229, 'full');", "Date": "Nov 26, 2007", "ReviewID": "UR813518564", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "abeille82"}, {"Content": "Simpaticissima \"la portiera...   showReview(11380399, 'full');", "Date": "Nov 20, 2005", "ReviewID": "UR274348674", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Soggiorno molto piacevole e...   showReview(11380400, 'full');", "Date": "Jul 2, 2005", "ReviewID": "UR757438658", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d259384-r22590969-Hosting_Culture_Hotel_Varsavia-Florence_Tuscany.html", "HotelID": "259384", "Price": "$120"}}