{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“a good value for money option”", "Author": "leena r", "ReviewID": "UR127148316", "Content": "The hotel staff were extremely helpful and offered good service. The rooms clean enough for a short stay and a good location, a close walk to the key locations. The stairs of inside this hotel are really steep so be careful.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Great Place to Stay In Amsterdam”", "Author": "Mamasbaba", "ReviewID": "UR126836255", "Content": "Spotlessly clean, affordable, comfortable little find, tram right outside the door and also walking distance to Dam Square in about 10 to 15 minutes, highly recommend to anyone looking for nice decent affordable accommodation.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool, UK", "Title": "“A great weekend stay”", "Author": "helenmccarthy21 Posted by an Easytobook.com traveler", "ReviewID": "UR125861279", "Content": "Easy to access on the tram and on the canal cruise route, very clean hotel and extremely comfortably bed! Excellent breakfast included with plenty of food and drinks to set you up for the day. A lovely area with a fantastic Thai restaurant just round the corner called The WHite Elephant, well worth a visit.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“very nice”", "Author": "Blossom P Posted by an Easytobook.com traveler", "ReviewID": "UR124335228", "Content": "I was generally really impressed with the hotel. The staff were friendly and even offered us a free tour of Amsterdam :) My only issue was the fact that the windows weren't double glazed so I could hear all the noises coming from the street.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Perfect for a short stay”", "Author": "Selswaf", "ReviewID": "UR123452848", "Content": "I stayed at Hotel Linda with a friend from 9th-12th January 2012. Location is brilliant- about a 20 minute walk from Dam Square and Red Light district. Reception staff were helpful and polite. I found the room was basic but clean and modern- all you need for a short break away. Overall i would give a big recommendation to anyone after a frill-free hotel.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“If you're a drunk youth you'll love this place . . .”", "Author": "Linda R", "ReviewID": "UR123215870", "Content": "I have nothing against youth mind you or drunk people for that matter, but when I stayed here this year I couldn't believe my bad luck. I started out in the hostel which is located downstairs with absolutely no sound-proofing. I was awake all night due to the girls chatting and smoking in the smoking area which was located directly outside my the room with only glass between me and the nicotine addicts, and the drunk American outside my door crying hysterically into her cell phone and kicking the door to her room to try and wake up her other drunk and passed-out friends because she had lost her key. I went to the desk the next day to see if I could switch to the hotel portion and it was twice as much but I needed the sleep. I honestly can't say which was worse. There is no sweep or padding on the doors to eliminate hallway noise and the elevator was located right outside my door. I don't know about anyone else, but when I stay at a hotel I always try to be quiet when I walk down the hall to my room. It's my age I guess. The Scottish boys in the next room came home reeking of McDonald's and screaming their heads off and proceeded to play a game of soccer in their room kicking the ball against the walls. I asked them to please keep it down as it was about 1am and they basically just laughed me off. They kept it up and about an hour later a made a trip to the front desk but not until after I tripped over the bags of discarded McDonald's food bags that had been thrown in front of my door. The front desk threatened to call the police if they boys didn't quiet down but it took them another hour or so to finally pass out. Bottom line, the hotel does not care about it's guests and as long as people continue to come there because it is cheap and their partying won't be disturbed then it will continue to be business as usual. I'm really not surprised to hear that other guests had things stolen, I came back to my room in the hotel one afternoon to find the door wide open and carpenters coming in and out to repair something or other. Don't stay here.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Swindon", "Title": "“You get what you pay for!”", "Author": "fred3105", "ReviewID": "UR123125113", "Content": "We have just returned home from a long weekend in Amsterdam, I have stayed in The Grand, The Crowne Plaza, The Barbizon Palace and even stayed in the youth hostel. This time we booked on a budget and thats just what we got, like someone else has put \"no more no less\". Yes a couple of ceiling tiles were stained with water, yes there were marks on the wall and yes there was a telephone socket open, but it was only a base and we found it very comfortable and in a great location to explore a great city! For what we paid for it, it was good value for money!", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Budget Hotel”", "Author": "johnpp2", "ReviewID": "UR122876207", "Content": "Well it was ok I guess, no more or less than expected. Also owned by the same people was a boutique hotel across the road where I had dinner so had the best of both worlds. Fully functional but not luxurious. Vending machine in lobby didn't work and no other facilities for drinks or snacks. There is a reasonable Japanes restaurant down the road but had no Japanese working there. Neverthelss the food was good and surprisingly authentic. The real giveaway was that there was only 1 sake.... Breakfast was ok, staff friendly and quite good value considering it was a business 3 day trip.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“ok for budget accomodation”", "Author": "Dilys G", "ReviewID": "UR120032951", "Content": "The staff were brilliant and the breakfast was excellent, all you can eat! lovely dinning room. I was in a single room that was a bit claustrophobic. There was no where to hang up my clothes, the lamp at the bedside was useless as there was no socket. There were bare wires behind the bed where the phone was plugged in. The room needs a coat of paint. The bed was comfortable. The bathroom was really nice but, after I finished showering the water poured from under the shower tray. Outside my room was a walkway to the opposite side of the hotel, the top had chicken wire over it, on looking up someone had thrown a towel covered in 'poo' out of the window yuk! The hotel is very well situated for the sights and the tram stops just over the road. The staff allowed us to leave luggage till we could check in and again kept it for us after we checked out. Was ok for a few days but would not stay a week.", "Date": "November 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Arusha, Tanzania", "Title": "“Small but adequate for a budget accomodation”", "Author": "UStoAfrica", "ReviewID": "UR117686416", "Content": "The location was fantastic! And the view from our second level room was amazing. The hotel is very close to coffee shops and restaurants and great if you are a walker! The street noise was a little much but you quickly get used to it. The television did not work, but the staff offered free internet for 24 hours in exchange (I had to ask). The wi-fi worked well and I was able to download some large media files overnight with no problem. The room was small (Euro style) but the bathroom made up for it as it was modern and clean. I payed too much using hotels.com and could have paid 50% less if I had just walked in off the street. But that is not the hotel's fault. I would advise booking with the hotel directly if possible.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“very good hotel 31 aug 2011”", "Author": "arthur m", "ReviewID": "UR117664778", "Content": "staff were very friendly hotel was very clean lift in working order breakfast was very nice would go back there again", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Very basic; close to the tram and Heineken Experience”", "Author": "peewee0317", "ReviewID": "UR115990703", "Content": "If you're on a tight budget, not fussy and want to spend more on the sights and eats, you can stay here. It is just a place to sleep in and serves basic breakfast. It is close to the tram line and the Heineken Experience. It is a bit far from the center of everything but because it's near the trams, you can get anywhere easily.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Inverness, United Kingdom", "Title": "“Good hotel and would use it again.”", "Author": "bailygirl", "ReviewID": "UR115590525", "Content": "This is a very clean and well run hotel, not too many tram stops from central station,, had a room next to reception for 1st night which was very noisy but had no probs changing room the next day(they really should rent this room a lot cheaper because it is in a noisy position). the staff are very helpful , i thought the breakfast was good toast, rolls, cheese ham, salami, boild eggs, scrambled eggs ,cereals hot and cold drinks. Late at night there are plenty of nearby coffee shops and bars.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Dirty and bed lice!!”", "Author": "Dustydj", "ReviewID": "UR114625009", "Content": "Not the cheapest hostel/hotel, but the worst we found in Europe. Beds were infested with bed lice and other biting bugs. Couldn't get out of there fast enough. Complained, and little was done to fix. Shared bathroom was never cleaned either. Disgusting place.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Expensive for a hostel, but it was decent”", "Author": "acrossthepondtravel", "ReviewID": "UR111950585", "Content": "We booked the Deluxe Private 4 bed ensuite room, and it was very similar to a hotel room. We had our own bathroom, towels, a TV, a hairdryer that didn't work too well, and we could keep our bags in our room without worrying about them getting stolen. The beds were comfortable too. Customer service was just okay - we had to wait probably 30 minutes for a receptionist to help us when we first arrived. We had friends that didn't have a private room, and they had a completely different experience, so I guess it just depends on the room type you reserve. Our room was a bit pricey for a hostel, but it was worth it. The hostel is a 5 minute walk from Heineken Experience and within walking distance (maybe 15 minutes) to Rembrandt Square. There is a tram station nearby that will take you to and from Centraal Station. I recommend the Deluxe Private room, but maybe not the other room types.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "kent", "Title": "“Great budget hotel”", "Author": "toyboyKent", "ReviewID": "UR106207351", "Content": "Great little hotel for the price. Staff were pleasant and helpful, clean and tidy rooms. Close to tram into city centre, close to museums. Only negative was our room was on top floor , up a very steep and narrow staircase. 5 star this isnt but worth a good 3.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "lancashire", "Title": "“Would not recommend”", "Author": "sharpeyLancashire", "ReviewID": "UR101995712", "Content": "We have just come back from a weekend in Amsterdam. We booked this hotel on the internet, and it looked ok. On arriving at the hotel, our first thoughts were that it was quite far out, and that it looked quite old fashioned. We were informed the lift wasn't working, but that it would be fixed that day, surprise, surprise it still wasn't working when we left on the Sunday. We had to climb up 3 flights of stairs, which are spiral, and when you have bags, it is a bit of a pain, we then had to walk across a bit of a bridge thing, that didn't seem to be safe at all. When we got to our room, it was very small and basic, but clean, the bathroom was very small, and our toilet was on the corridor, but we did have a key for this, but we didn't think much of this. We were woke up during the night, about 3.30 with people coming in slamming doors, and chatting on their mobiles, and then we were woke early with the door slamming again. The breakfast was fine, but the dining room is very small, and you may have to wait for a table. My suggestion would be to shop around when booking your hotel, I believe you can get better value for money than this hotel. We paid 130 euros a night, and didn't think it was worth this sort of money. We popped into a really nice hotel, which was more central, and the prices here were very similar. We would not recommend this hotel, nor will we be going back.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“the worst possible experience imaginable”", "Author": "rozy82", "ReviewID": "UR92787511", "Content": "GUYS don t go there !! the worst possible experience imaginable. In this hotel there are thieves, we had 10 PX and one day when we come back in the night we found the room open and some staff, important staff was stole, we call the police and they said than is the third time in 2 week than someone stole in the room , probabbly somone from the bar,... so please don t go , i spend 2 day of my holiday with police and a lost something very very important, maybe other peaple had nice experrience but not me!!", "Date": "January 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Czech republic", "Title": "“Very good hotel, excellent price, great location”", "Author": "September73", "ReviewID": "UR87463861", "Content": "We have found the Linda hotel because had to leave another hotel we have booked in advance before (the room was not prepared). So Linda was one of the nearets one. We were pleasantly surprised with the prices! (much lower then in the dirty hotel we have left). Location is great, very close to the tram *4 stop with the direct connection to Railway Station, walking distance to the center and exactly near one of famous market ( do not miss to visit and eat this excellent salty fish sandviches with local people! It opens every day). Alos we found family run Indian restaurant near by ( never tasted Indian food before) and then visited that several times. Room was clean and the windows side was quiet, so there is no noise at night time. Note - there are no mini-bar, telephone safe-box in the room. Bathroom is good and clean, although very small. Breakfast was included: simple but fresh and very ok - eggs, jougurt, ham, cheese, butter, juice, good choice of coffe/tea. Especially good were those nice cookies with raisins!!! Stuff is friendly!Linda is very reasonable choice! Nothing bad to say! We defenetly would come back.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wollongong, Australia", "Title": "“hmmmmm think twice....”", "Author": "AussieW0rldExpl0rers", "ReviewID": "UR78163140", "Content": "gentleman at the front desk wasnt the friendliest man in amsterdam the bathrooms were flithy especially the bath/shower. mould all over the walls. loud outside. didnt like the fact that i had to give the key back everytime we went out... kept thinking they were going into the room but i mightve just been paranoid. didnt realise there was a city fee of 3% or something and the guy was really rude about it.. it says it on the website clearly in bold writing... pfft whatever mate heres the money... right near a tram stop which was good but for the money i think we couldve found something better", "Date": "September 3, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“awful”", "Author": "AlessandraM3", "ReviewID": "UR75693692", "Content": "Far from the downtown, but close to tram station, a lot of stairs to climb with a heavy bag, not so clean, good breakfast. At the twinbed there isn't stairs and is a quiet tall.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Amsterdam", "Title": "“OK FOR 2 STAR HOTEL - YOU GET WHAT YOU PAYFOR!”", "Author": "JoyRG", "ReviewID": "UR74810945", "Content": "There appears to be two hotels called Linda in Amsterdam So be careful. This one is 2 star. We stayed in room 101 (yes 101!) . The room was small but clean. It had a minute bathroom with brand new shower, sink, loo, hairdryer and tiling. Extremely clean. TV was about 15 years old with no on/off switch. Staff were friendly and the tiny breakfast area had nice simple continental breakfast food to eat. There was no air conditioning so we had to open the large windows which meant that all sounds were heard including some inconsiderate person with a very loud mobile alarm at 2 in the morning! and some noise from an air duct or similar, Overall OK.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Poor value dirty and very noisy lift”", "Author": "jaundiced", "ReviewID": "UR74803622", "Content": "Our room had 4 beds jammed in a space for a max of 3 at a pinch. One of the beds was obviously broken. There was nowhere for clothes no cupboard or drawers never mind a wardrobe, barely room for the cases in the room. The hotel varied between dirty and grubby throughout. There was half eaten food waste under the bed. Towels were change daily but did not appear to be clean. Lift is very noisy which meant that none of us got any sleep.Our backpacking son said that he had usually been in far better hostals backpacking at a quarter of the price per person. Plus point breakfast was OK.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "England", "Title": "“2 Star Hotel offering a 2 star experience.”", "Author": "Halibut88", "ReviewID": "UR73151024", "Content": "This is a 2 star experience.. not one I normally choose. Situated on the main street, it is nonetheless, quite quiet. My room was at the back on th top floor.. great views extremely quiet... except.. my room was orginally a much larger room wihchhad be partitioned off to create two separate rooms. I could easily hear the gentleman coughing next door. The advertised Flatscreen Plasma was there, but so high on the wall, it could not be usefully viewed from the low floor bound mattress. (the colours in a plasma TV become distored when viewed from extreme angles). The toilet seat dismantled itself in a racket as none of the pieces, the lid or the seat!.. were actually attached!! :) Funny as they all fell noisily to the tiled floor. The rest of the small bathroom / shower unit was still clean and useful for its purpose. Reasonable shower at least. The room was very small. no storage space except the small floor foot print. Reception desk staff were friendly and helpful. The stairs inside are very steep (its a dutch style town house) but they have a lift as well. The location is quieter than central Amsterdam, although that is only 25minute or so walk away. Overrall, for what it offers, I think it provides reasonable value for your money and expectations as a hotel in a major city charging slightly lower prices. Would I stay there if I could afford slightly better... I would stay somewhere slightly better. Getting there from the station: Hotel Linda is located on the outer-ring road circling the traing station. It is a 40 odd minute walk to the station, about 15 minutes by tram (A No.4 or 25 takes you to within 50 yards or of the hotel or.. a taxi (which cost me around 15eurors. (A bit expensive I thinks !).", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Slagelse, Denmark", "Title": "“Great place”", "Author": "CanoMann", "ReviewID": "UR71208936", "Content": "I just returned from my stay at Hotel Linda in Amsterdam. I forgot to check reviews before booking, so I got kinda spooked when reading the other reviews here. That being said I figured, well it is cheap, so I'll try it and see for myself. And what a good thing, because everything I saw in negative reviews, or almost everything, was proven wrong when I arrived. The hotel is not located in the middle of city, but it's close enough, so that it is worth it. Keep in mind that I had a broken leg while staying there. The guy in the reception, when we arrived, must have been the jerk other people wrote about, because he had nothing to do in the service business, it was painfully obvious that he hates tourists, and his job. But I am not staying on a hotel to make friends with the staff, so that didn't matter. The elevator looks brand new, so the reviews where the elevator was the main issue are no longer valid. The stairs are steap, but no where near the steapest I seen in Amsterdam. And on my broken leg I went up and down the stairs with luggage and all, so no one should complaint over that. The room on the second floor had a view of the canal and De Nederlandse Bank, the dutch national bank. less than 100 meters from the hotel you'll find the Albert Cuyp Market. The included breakfast was really nice, compared to the price. All you an eat, including bread, eggs, youghurt, cereal, milk, juice, cocoa, coffee and tea. The only thing missing was a smoking room in the hotel, but the weather was really nice, so we went across the street to sit on the bench at the canal. I am going to stay at this hotel again that is for sure! The closest coffeeshop is a sportsbar, called Ibiza Coffeeshop, located about 150 meters from the hotel. Right past the Lidl Supermarket. They have good smoke, and great prices, but the guy working there needs anotherjob, because he doesn't like working in the service business, as most of the jerks working in coffeeshops and other places in Amsterdam. On my next visit I am going to try stealing one of their jobs, because I am much better at their job, than they will ever be. I didn't try Mellow Yellow, so can't say how that one is, but it is also close. My favorite coffeeshop on the way to the city centre is Stix, which is located on Utrechtsestraat, which starts right after the Frederiksplein park. I not only would recommend this hotel, I would say that for the priceaware traveller, this hotel is defenetly worth every penny. When we left to the airport, we took the lazy solution, and went in a taxi. Which I thought would cost 50â‚¬ but it turned out to be \"only\" 37â‚¬ The only bad thing I have to say about Hotel Linda, is the asian guy working there at nights, he has no business working with people. If I was the owner I would fire him asap. All the other staff at the hotel was really friendly and nice.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "luton", "Title": "“worst hostel ever, don't stay there!!”", "Author": "pinky666uk", "ReviewID": "UR71135434", "Content": "even though this was ages ago, but i want to warn people against this place, if your staying in the hostel part: I'm very disappointed with this hostel it's my second time here this year and I was pleased the first time, but not the second time, I had my laptop stolen out of my locker and they didt do nothing about it and it was expensive as well, and also it's infested with mice as well, beware of that!!!, I defiantly wouldt recommend anyone staying here if you got any valuables, the lockers are useless and people can easerly break into them, I'm not a very happy person now, I have to pay alot of money for a new one", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Freiburg", "Title": "“Not a nice hotel!!”", "Author": "NakaNiko", "ReviewID": "UR70226510", "Content": "We stayed at this hotel in Easter time. Such a disaster that we had wished we never went to Amsterdam that time. The hotel is quite far from the city center and you need about a good 15-20 minute walk to reach the heart of the city. When we got to the hotel, they raised the prices to what we were quoted but seeing as how we didn't have any other option we decided to go with it. We we offered the first room which was dirty and very dusty. We complained and they moved us to another room which was even worse that the first. Finally the third room was descent enough to stay in, although by no means nice. The staff is very unfriendly and they don't seem to know anything about Amsterdam as we got: \"I don't know\" to almost every question we asked. There is no elevator in the hotel at the time (although there seemed to be work on installing one) and with the narrow staircases can be difficult for people with walking difficulties or elder people. The breakfast room was tiny and the food selection wasn't nice. Overall, I would not recommend this hotel to anyone.", "Date": "July 9, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Australia", "Title": "“Worst place ever”", "Author": "Shane69Australia", "ReviewID": "UR68410434", "Content": "What a dive. Hostel area in basement with tiny windows facing direct onto footpath and traffic. The room stank, all variety of wiedos interested in booze, drugs and eating fast food in the airless hole. Stank of smoke. Trying getting to sleep in that with weidos coming in and out at all times of night. Stayed 4 nights, managed to find alternative accommodation on one of those nights despite already paying good money for this dive. Counter staff dismissive, not even provided with a room key, had to \"share\" with weirdos one key who also moved all my gear around to get a better bed. Could not wait to get out of the place and unfortuntately this dive gave me a very bad impression of Amsterdam. Never again.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good quality-price value”", "Author": "plambecker", "ReviewID": "UR66422195", "Content": "This is a nice hotel. The staff is friendly and helpful. We stayed three days in a family room for four persons. The price is quite reasonable, only the first night, Saturday is a little more expensive. Our room is spacious and quiet. There are a lot of choices for breakfast. It is very convenient to reach the museums from the hotel on foot. In general, we enjoyed our stay at hotel Linda very much.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "England", "Title": "“WORST experience ever. Do not stay here!”", "Author": "Jadecotterill", "ReviewID": "UR65321533", "Content": "I was travelling around Europe last summer with my friend and Amsterdam was our last stop so a few friends came out to visit and stay with us our last few days. We stayed in the hostel bit downstairs because it was cheaper (although still more expensive than most hostels we had stayed in) and we were on a strict budget, however i now wish id spent a bit more as the stay ended up costing me hundreds. Firstly after our first night two other girls staying in our room stole my Â£120 straighteners and when informing the manager he was of no help what so ever. The next day someone broke into the window of our room (that was very easily opened without even being smashed) and stole my whole suitcase, hangbag, everything, including my passport. Again the staff were of no help and were extremely rude, talking about us and laughing about the situation. Not once did i hear an apology or any help about where the police station was or anything. I could go on about how awful the place was but hopefully this will be enough to discourage you from stayingin this hole.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "England", "Title": "“An awful experience, don't go there!”", "Author": "UkDjw", "ReviewID": "UR61396106", "Content": "When we arrived we were given a tiny room at the back of the hotel which was totally unsuitable for two people. After complaining and being told all rooms are the same we were given a far better room at the front. The stairs are horrendously steep with rickety bannisters although a lift is being installed at the moment. Other maintenance work was being done and carpet being laid. This was left out all over the place causing a hazard, as well as pot holes in the floor and bath handles coming off the wall. The room was not cleaned properly and I couldn't be certain but I don't think our sheets had been changed after the previous guests. Breakfast was basic but included. Proximity to the centre is reasonable with a good tram service across the road.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great bargain”", "Author": "holoudays", "ReviewID": "UR59593253", "Content": "I stayed at hotel linda with my boyfriend for our anniversary. We were really happy with the hotel, which may have been luck due to some of the reviews. but we found our food very clean with a decent bathroom and a very comfortable bed. The morning breakfast was very basic but was good for a quick bite to eat before an adventure around amsterdam, which included breads,cereals and eggs with juice and hot drinks. The lady on the front desk was really friendly and helpful, which was pleasant. The location was great just a 10-15 minute walk to the centre of Amsterdam, so far away from the caos and noise of the night life..the tram is just outside the hotel also..We thought Hotel Linda was a perfect hotel for the price and we would visit it again..hopefully having the same experience!", "Date": "March 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“The cheaper but still good Option”", "Author": "louisej84", "ReviewID": "UR58366092", "Content": "This hotel is perfect for people such as myself and a partner who were looking for somewhere close to town that was cheap. If you want a nice room with expensive furnishings and posh meals then don't stay here. If you want somewhere thats cheap, has a bed and a good place to wash then this is for you. The hotel provides breakfast in the morning ( although the room is small so you may have to wait for a table) and the staff were helpful and friendly. The hotel is around a 5-8 minute Tram ride away ( Tram 25 or 4 stop basically right outside it) or you can walk it in about 20 minutes in to the Damrak. The only negative points were that the stairs are very steep and there are lots of them, so if you are un fit or have trouble walking do not choose this hotel as there is no lift. We also had 2 single beds pushed togethers instead of a double which was a shame. For the girls if you want to dry your hair a dryer is provided but not the best, if you can bring your own haridryer do it!", "Date": "March 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "uk", "Title": "“NEVER AGAIN”", "Author": "ourcajuk", "ReviewID": "UR55630069", "Content": "I came here with my husband and 2 friends for my birthday and we were so disappointed with the Hotel. There are no lifts so its hard work getting your luggage up there, and then to find that you couldnt hold on to the bannisters as they were all rickety and loose. Very dangerous ! The room wasnt cleaned the first day, and the 2nd day only when I complained. The breakfast was very poor, minimal & basic, and you had to be welcomed by an oriental girl who didnt have any manners or how to smile. In general the reception staff were not very helpful or welcoming. Outside our window we had pigeons and their babies making a racket all night and there was pigeon poo everywhere. Not very hygienic. My friend was approached at 2am to say that his tv was a little bit loud, but no-one said anything to all the people coming in at 3 and 4 in the morning, yelling at the tops of their voices, making a racket. Double standards ! On top of that, there are renovations being done which meant that half of one side of the hotel was all open with a few boards covering it up. The only time we got a smile from anyone, was the lady on the morning we left, who said \"hope to see you again\". I think not madam, and I would certainly not recommend this hotel to anyone if they have any sense.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "swansea", "Title": "“lovely hotel”", "Author": "tez_22", "ReviewID": "UR53619924", "Content": "check in the hotel (the Woman at the front Desk very nice and helpful) then we were told we not in this building we are next door so I said ok I donâ€™t mind I want to have a nap you know so then we went to the building next door and then saw the 4 flight of stairs i wolud go back the breckfast was good", "Date": "January 16, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pleasant Hill, California", "Title": "“nice hotel, good location”", "Author": "CasseyM", "ReviewID": "UR51313150", "Content": "the rooms are very small but were perfect for me and the 1 person I was traveling with. They do provide a small breakfast every morning which saved us time trying to find food before going sight seeing. The locations was perfect. It is about 1/2 mile from the Heiniken Experience and another half mile more to the leidseplein which is full of pubs, restaurants and nightlife.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“MICE in room & luggage!!!TRAUMATIC”", "Author": "Arch80", "ReviewID": "UR50867515", "Content": "DO NOT stay here! Woken up in the middle of the night cause of MICE in the room and luggage! Damaged my goods! MICE in a hotel is NOT acceptable No information that the place was under construction when I booked. Construction site outside my room! TERRIBLE and hotel should be shut down", "Date": "December 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“very clean and fresh place”", "Author": "AgaLeeds", "ReviewID": "UR46865024", "Content": "quiet, nice looking hotel, very clean place!!-every day cleaning service, nobody asking \"where do you came from?\", good location for every important attraction", "Date": "October 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“basic but good location”", "Author": "UkSpacecowboy", "ReviewID": "UR41544761", "Content": "We had a room at the back, so nice and sunny. Clean and spacious room. Quiet. Good location: a 10-15min walk into the main drag. Close to Heineken factory/museum.Canal cruises start nearby. Female receptionist very friendly and helpful, male staff less so. Breakfast is labelled as 'sumptuous' but Id call it basic. There is a selection - cheese slices/ hamslices and bread for toasting in a toastie maker+ cereals and eggs. No drink making facilities in the room. 6.5 out of 10.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Gloucester, UK", "Title": "“Great value for money”", "Author": "Montyspaw", "ReviewID": "UR26690956", "Content": "We're just back from a stay at the Linda in Amsterdam. Having stayed at many Hotels in the city, we felt that this one offered excellent value for money, although the location was a tad too far out of the centre. Our room was very comfortable, and one of the biggest we've ever stayed in in Amsterdam. We were on the fourth floor, and would understand that the final staircase to this floor might be a killer for some, as it is virtually vertical! Long steep staircases are common in the city due to the shape of the houses, but this one was extreme! The out-of-town-slightly location isn't a problem if you can master the city's easy to use transport system, as there is a tram stop just across the road that takes you right into the heart of the action (Trams 4 and 25). Breakfast was the usual Dutch affair of cereals, breads, cheese, sliced meats, eggs, juice, tea, coffee etc. and was more than adequate. All in all, for the price, I would definitely stay here again, and I'd recommend it to anybody.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London ,East", "Title": "“Worth the money, excellent”", "Author": "twazwakky", "ReviewID": "UR24963114", "Content": "Read other reviews about this hotel but still was not put off.Got a room on the 1st floor (RM110). Only one flight of stairs to go up.Ensuite shower with toilet. Not much of a view from the window (but who does sight seeing from a window), pleasant night sleep. Staff were all helpful. Excellent Breakfast. Trams 4 and 25 takes you to all the right spots (Centraal Station, Damrak and Dam Square) Yellow Mellow and Littles are the closet coffee shops which both had a good atmosphere. Saturday market 1 minute away sells everything. Will definitely be staying here again on next visit.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "manchester england", "Title": "“cheap good quality accomdation”", "Author": "leeash", "ReviewID": "UR24632842", "Content": "we have just returned from our first long weekend stay at the hotel linda in amsterdam . this hotel is great value for money, nice clean bedroom and bathroom with clean towels every day and comfy beds you also get a basic cold breakfast. Please take no notice of the photos that people have put on in the passed the hotel has had a new carpet fitted .the hotel is in a quiet part of the city ,but there is a tram stop just across the road from the hotel which takes you to the dam and centrral station. the only bad point was the stairs were very steep up to the room other than that this is a nice clean cheap hotel and we will be staying there again when we return to amsterdam later in the year", "Date": "February 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Nicely Surprised by Hotel Linda”", "Author": "Lara067", "ReviewID": "UR24633011", "Content": "Hotel Linda, reasonably priced, just outside centre of town, 10 - 20 mins leisurely walk to places of interest, although Hotel in need of some updating, our bedroom was rather large given that most in amsterdam are box size. We had the usual twin beds pushed together as a double, which were really comfortable and together, almost made the size of a Kingsize bed! The bathroom was small but adequate and most importantly clean. Beds were made and fresh towels left each day. We had 3, floor to ceiling length windows and a set of french doors which opened onto a tiny balcony facing the back of the hotel, onto a quiet residential street. (the balcony is handy if you smoke). Although there were no coffee or tea making facilities in the room, you can use the machine in the breakfast room for free! By the way they offered a decent sized european breakfast buffet so you can fill your face for the day ahead!", "Date": "February 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "cardiff", "Title": "“great hotel”", "Author": "nkwales", "ReviewID": "UR21649566", "Content": "having just returned from amsterdam, i wanted to share our experiences. Despite all the reviews for the hotel, we found it very clean and tidy. We had two rooms and although rooms were very compact, they had everything we needed.one room which was behind the reception, could be noisy at times but perfectly manageable.the telephone wasn't working in the room but was fixed after a couple of days.The staff were very pleasant and helpful,i would recommend this hotel .", "Date": "November 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "jcmartin1980", "Title": "“sleepless nights”", "Author": "jcmartin1980", "ReviewID": "UR19853784", "Content": "hotel was clean and staff friendly but thats all i can say. we stayed there for 3 nights the fire alarm went of 2 of the nights and although smoke free hotel this was clearly allowed to go on, was very noisy on a night slamming doors and shouting. was concerned about lac of facilities in room as hen alarm went off no fire intructions any where in room,", "Date": "September 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oz", "Title": "“ok for money”", "Author": "dumbozboy", "ReviewID": "UR19811435", "Content": "Easy tram ride from central station. Clean with new towels everyday. bathroom very small. toilet down the hallway wasn't very nice and my knees were hitting the door while sitting down. Lots of pillows on bed wich was good. staff seen friendly enough.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ruiselede", "Title": "“Nice Low Budget Hotel !”", "Author": "xtinabelgium", "ReviewID": "UR18594946", "Content": "Me and my boyfriend stayed in Hotel LInda for 2 nights. I have no complaints about our stay. I had a lot of problems for searching a hotel in Amsterdam before we left, but I think I made a good choise. The hotel is clean and nice. The rooms may be a bit small, but for that price you can't expect much more I think. The only 'problem' I had was that the toilet was a bit smelly, so we left to windows open our whole stay, and it helped. The breakfast is good. I have no complaints about the staff, they were nice. I would recommend this hotel to everyone who wants to see Amsterdam, and not pay to much for a hotel. The hotel is near public transport. We payed 145 euro for 2 persons for 2 nights. I can compare, our friends also went to Amsterdam the same date. They stayed in a hotel 50 km outside the center, and they payed 100 euro more then us. And they also said that their room was small, and they only got to see the city for 2 days, we got to be there for 3 days.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Bed Bugs”", "Author": "Spotty101", "ReviewID": "UR16648590", "Content": "Myself and my friend stayed in this hotel in May 08. Our room (101) was small, the view was non-existent, and the room was hot. It was a last minute deal and was convenient for the city centre so we thought it would be OK. After 3 nights we were COVERED in bites - we initially thought this was mosquitos but it became clear that it was actually bed bugs. There were blood stains on the sheets (we now realise from squashed bugs) - we asked for them to be changed, which they were, but it did not help the situation. We found a number of bugs in the bed and there were also suspicious black splats against the wall. Judging from the some of the other reviews, there is definitely a problem with insects at this hotel - but appears to be confined to certain rooms. We have both returned to work with nasty red spots all over our face, necks and arms. It is not just the odd bite - we are covered - which suggests a serious infestation. Please do not stay here. If you have already booked and they try and give you room 101 - SAY NO!", "Date": "June 3, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "123Elle", "Title": "“Scarey stairs...”", "Author": "123Elle", "ReviewID": "UR14491372", "Content": "Staff were welcoming, and helpful. Four of us went, two of us had a huge room, really spacious and lovely, the other two had a tiny room though. Rooms were clean and well kept. The stairs getting to the top floor, (4) were the scariest things ever. Nearly vertical, they are hard to climb at the best of times, let alone with any luggage or after a drink!! Breakfast was nice, only problem was there werent enough seats to had to stand around eating breakfast some mornings. Location is good, with a tram stop just outside, and within walking distance of the centre.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hereford", "Title": "“Absolutely Fabulous”", "Author": "woody34Hereford", "ReviewID": "UR14244734", "Content": "Just returned from a 5 night break in this hotel which we booked online. It was brilliant for the money we paid. The room was very clean and the reception staff all friendly. Towels changed daily and beds made for us. Buffet breakfast most enjoyable. The location was good, very near a tram stop and it was easy to get wherever we wanted to go. The only negative comment I can think to make is that there weren't enough coathangers in the wardrobe! Will definitely return!", "Date": "March 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Staff have no respect for sleeping guests”", "Author": "ArmedJimmy", "ReviewID": "UR14205183", "Content": "The staff were friendly and helpful, and while the room was small that didn't really bother us as we were just sleeping there so only needed a bed and toilet. We got room 503 which was in the basement, right beside the staff exit and delivery entrance, where all the linen cupboards are and where the staff toilet is. At 2am every night we were woken by staff shouting at each other, or running down or up stairs to use the toilet. At 7.15am every morning the delivery door would be slammed shut shaking the whole room. The breakfast room was also directly above our room so at 730am we would hear all the chairs being scraped about the floor above. Finnally on our last night the fire alarm went off at 2/3am. Was only for a second but woke us up and found it very difficult to get back to sleep as we could hear receptionist talking as well. The fire alarm going off isn't hotels fault normally but this lasted only seconds so could not have been set off by anyone other than staff. I suspect if you get another room in the hotel (except 502 which was in basement as well) then this hotel would be fine, but I won't be staying there again as the risk is not worth it.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good locatiion”", "Author": "Gramoo", "ReviewID": "UR8251367", "Content": "Took a gamble here given some of the reviews. Reception staff were friendly and helpful. We booked late so got room 100 which is right against footpath and reception area. Footpath and road noise was barely noticable but lobby noise (ie people using snack machine and talking) was. Breakfast was good but get there earlier than 9:30am. Location good (tram 25 from Central station, 5 or 6 stops). Rough and ready but hey......its amsterdam and this place is fine for a couple of days in town.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens, GA", "Title": "“The best for the price”", "Author": "fwb", "ReviewID": "UR7967192", "Content": "This hotel was the only one reasonably priced for the middle of June when booked a few days earlier. I stayed 5 nights with my wife. Our room was on the third floor (4th US). It was reasonably sized, the bathroom nearly new, the windows solid and blocking the noise pretty well, and the bed with double pillows. Fairly quiet except for two evenings when the 4th floor occupants were apparently dancing. A call to the reception helped the first time right away, and only my wife heard the second time. Breakfast was pretty good and everything was clean. The hotel is next to a tram stop, one long block from the Heineken museum, and two long blocks from the Museum square. Perhaps not in the middle of action but also without a corresponding noise. About 7 min nice walk to Rembrandt square. Plenty of restaurants, some elegant, and a grocery store within a block. The stairs are very steep but this was part of an attraction being in an old house. I would gladly stay there next time. One warning. This hotel is also backpackers in the basement. However, they appeared civilized. IM", "Date": "June 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Scary stairs!”", "Author": "randy885", "ReviewID": "UR7856825", "Content": "Our family of four had the quad room on the fifth floor. The biggest negative for our three night stay at the Hotel Linda was the challenge of getting up the stairs, a tiny circular stairwell with steep small stairs at all four flights and the steepest set of stairs at the top. Carrying luggage is extremely difficult, and ascending and descending feels hazardous. Our fourteen year old son fell down the steep top flight and was rug burned and shook up. The room was decent size and clean with a good view of the street in front and canal. But at night the heat was such that we needed to keep the windows open. With open windows the traffic noise kept us awake. Tough choice - lay awake sweating or hearing the traffic noise. On the positive side, the clerks were friendly and helpful (except about our request to move to a lower floor. ) Breakfast was good and included in the room cost - scrambled eggs, cereal, etc. A computer in the lobby was available for lodgers to use for free- it stayed busy but it was possible to get on. The hotel, on the outskirts of the canal district, was a long walk to the action in the core of city center, but it's an easy bike ride. Rent a bike; it's the best way to get around Amsterdam, for natives and tourists. A car in Amsterdam is bad news. The hotel parking was not availible for us - we found parking on the street right in front of the hotel and put 18.90 Euros in the meter every day (we never drove the car once we arrived in Amsterdam; bikes took us everywhere. Primarily because of the imposing stairs, we would seek a different hotel should we return to Amsterdam.", "Date": "June 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "EAST SUSSEX, UK", "Title": "“Great For Mountain Goats”", "Author": "PIGASIMU", "ReviewID": "UR7671442", "Content": "Having made a last minute booking through HostelBookers for a low budget group of 14 pax coming to a Rugby Tournament, the pax got exactly what they paid for, namely a cheap, clean and conveniently located place to sleep with no frills. Watch out for the dormitory (10 + 4) as it is on the 3rd floor right at the top of the steepest set of 3 staircases I have ever seen. Fine for youths but watch out if you have any heavy luggage or are scared of heights. Also watch for an additional 5% \"City Tax\" that is payable on top of the bill. The Hostelbookers confirmation merely confirmed the room balance. The extra 5% was noted on their web page for the Linda but was missed at the time of the booking and came as an unpleasant and unwelcome surprise.", "Date": "May 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "bristol", "Title": "“no problems!”", "Author": "tulipman", "ReviewID": "UR7393804", "Content": "We stayed at Linda hotel for a few nights,and were pleasantly surprised, considering the reviews written from some people! The bedrooms were clean and airy, the bedding etc carefully tidied during the day, the staff very pleasant and helpful, and a good selection for breakfast. The steps were incredibly steep to the 4th floor bedroom, but no problems for a fairly fit person! We booked on the internet, and had no problems with this-we had our room keys within 5-10 mins of arrival. In all, an enjoyable stay. For a cheap stay in an expensive city for hotels, not bad!", "Date": "April 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "newcastle", "Title": "“good value for money”", "Author": "gateshead1", "ReviewID": "UR7341932", "Content": "Booked a double room for 4 nights. Room was very clean and en suite looked new - shower excellent. Rooms are small, double bed and dressing table with chair - no wardrobe, but it didnt matter. TV was fine, with loads of channels. Breakfast was plentiful, basic continental food - but loads of staff to help and food just kept coming. Staff where particularly helpful and genuine. The stairs to our room where very very steep - which was ok but you would need to request a ground floor room if you have trouble with stairs. Transport links excellent - Tram number 4 direct to city centre, just accross the road. Found a FAB market just round the corner. If all you want is a clean and safe place to rest your head, then i would recommend this hotel - after all we didnt spend any time in the placxe except to sleep!!!", "Date": "April 12, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "england, UK", "Title": "“very nice”", "Author": "steve_says", "ReviewID": "UR7215861", "Content": "hello, we booked this hotel with one days notice from a random hotel site. we did this in england and flew out the next day. upon arrival staff were very helpfull and freindly. the room we stayed in was room 115 and its absoloutly brilliant. the ensuite was amazing, with a shower and sink that all worked didnt leak and the shower was very good. beds comfy. Location is good because of a casino 5 minutes walk away and the heineken factory littereally down the road again 5 minutes walk away. also local supermarket / grocers for self caterers 2 minutes walk. very close to leidersplien which is a very poplular location and the main centre. trams take you very close and is very easy walk from centre as well as being easy to find and known well be the locals.", "Date": "March 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bergen", "Title": "“Loved it, just loved it!!”", "Author": "MadameE", "ReviewID": "UR7189754", "Content": "My friend and I were looking for a cheap, clean hotel with good location and a friendly athmosphere for our weekend in Amsterdam. I'm happy to say that despite all the bad reviews, Hotel Linda was the perfect choice. Friendly, helpful staff, great breakfast (the eggs just kept on coming - waaay after 10 pm!) clean, cosy room with view thowards the river (and just enough wardrobe space for two jackets), and the stairs are no problem - Seriously! I wouldn't stay anywhere else!", "Date": "March 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Not if You want to sleep...”", "Author": "becksLondon", "ReviewID": "UR6815911", "Content": "Only saw reviews on this website after we had booked and payed for our weekend trip. Thougt we'd give it a go despite some of the things said about it. Our experience with the staff was friendly and helpful. The room was very small but clean. View towards inner courtyard was not very nice and made the room very dark. This was nothing however compared to the sleepless nights we had. We are not in anyway against partying and enjoy a good night out as anyone else, but this was ridiculous. All night partying with smoking anything but normal cigarettes which filled the corridors and our room with a nasty smell. The fire alarm kept coming on during the nights and we had receptionstaff coming into the room during the night to check if it was us smoking... There we were me and my husband in pyjamas trying our best to sleep at three in the morning...Breakfast was a rather sad affair with coffee from a machine worse than in the office...You get what you pay for though and although Amsterdam hotels are expensive, next time I will happily spend more money on another hotel.", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wales", "Title": "“Good Accommodation.”", "Author": "Saphy27", "ReviewID": "UR6532825", "Content": "Nice hotel, with reasonably good sized room (smoking rooms available too), cleaned daily. The staff were fine, no frills but pleasant enough. The breakfast was continental as expected and with a good choice. The hotel is situated about 1 mile outside of Amsterdam Centre and is next to tram and bus stops if you can't face the walk. We walked in everyday and thoroughly enjoyed the opportunity of exploring some of the less well known areas, little markets, antique shops etc. It's also near the Heineken Museum if that's your kind of thing. So, on the whole a good place to stay in a good location, for a reasonable price. I would recommend to anyone really, but especially couples and lone travelers. The stairs are typically steep so might not be ideal for anyone infirm.", "Date": "January 1, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Swansea", "Title": "“OK - don't agreee with some of the other reviews”", "Author": "swanseatripper", "ReviewID": "UR6230967", "Content": "Booked this then saw some of the reviews and was afraid it had been a mistake. No problems at the hotel. It was pretty much as expected for the price. No problem with the e-booking. Receptionist was friendly and offered to move us from 3rd floor to 1st floor as one of us was an OAP. Glad of this as the stairs were steep. Room was a bit small but not a problem. En suite facilities were new and excellent. Everything clean. Breakfast room was a bit spartan but food was average and good choice on buffet. Hotel was fairly central and very convenient for Albert Cuyp market - very good market - and for museums. Would be happy to stay there again but would not want to be in a basement room.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“clean room, good location”", "Author": "feehatesrain", "ReviewID": "UR5621966", "Content": "No matter what all of the other reviews say i give a big thumbs up to Hotel Linda. We booked the hotel with a little apprehension however I'm gald to report we had a great stay. As you can imagine, hitting Amsterdam mid August accommodation wasnt easy to find. Using a discount hotel website we booked Hotel Linda 3 days before our departure from home. The hotel is located only 5 minutes from Dam Square on the tram or 20 mins walk. We had a double room overlooking the canal. The room was bright and looked like it had been recently refurbished. The ensuite was clean and shower was great. We had a continental breakfast included in the price and although it was quite basic there was plenty of it. Staff were friendly and helpful and they offered luggage storage on our departure day. The only slight flaw was that the room was very warm and although we had a fan the windows didnt open. All in all a great stay and would definately reccommend.", "Date": "August 18, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "US", "Title": "“Mixed Review”", "Author": "lkat", "ReviewID": "UR4932691", "Content": "The hotel is centrally located and the girl who works in the morning is very accommodating and helpful. She greeted us warmly and recommended local places to eat and shop. It was shocking later to deal with the girl who took over in the early evening - she was unbelievably rude, literally picking fights with us as we entered and exited the hotel - I cannot express just how unpleasant this girl was. The room was very small, as was the bathroom, and the stairs were so steep, we had to make several trips to retrieve our bags. Another complaint - the only way to make calls from the room is through a long distance carrier that asks for a credit card number. Although they quote you a low connection fee, we are now fighting charges of up to $50 per call. I reccommend you go to an internet cafe instead, there are several along the Albert Cuyp street market. There you can make an internationl call for approx. 10 cents per minute. The breakfast at the hotel was mediocre. One morning we arrived 5 minutes after 10am, and since other guests were still eating, we hoped to grab a roll and jam for the road. Instead, the server gave us a dirty look and quickly pulled dishes of food off of the counter and put them away in the kitchen. Overall, the hotel has great potential, but the management should look into improving the attitude of its staff and encouraging them to be pleasant to their guests.", "Date": "April 4, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Huddersfield, England", "Title": "“Not as bad as people say!!!”", "Author": "Meech1980", "ReviewID": "UR4896702", "Content": "5 of us (all girls) stayed at Hotel Linda in October 2005. We weren't expecting much and we were not disappointed! The room was basic and quite small, but it was clean and tidy. The shower was clean, with good pressure and was hot. No complaints except the t.v needed fixing, although we did not watch it anyway! And it did get very hot in there during the night. Staff were friendly and we even had someone help carry our bags up the 4 flights of winding stairs. All in all, was reasonable for what we paid, and i would go again.", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "derbys", "Title": "“had a great time !!!!!”", "Author": "sharon43", "ReviewID": "UR4738114", "Content": "a group of us stayed at the hotel and were a bit wary as there are some bad reviews for it. We are glad we gave the hotel the benefit of the doubt, we had a lovely time. The hotel was clean and welcoming. the rooms were very nice and the staff were helpful and friendly. The breakfast room was small but the breakfast was typically european and there was plenty of it. We will definately stay there again and recommend it to others. Well worth the money!!!!!!!!!!", "Date": "March 27, 2006"}], "HotelInfo": {"Name": "Hotel Linda", "HotelURL": "/ShowUserReviews-g188590-d260058-Reviews-Hotel_Linda-Amsterdam_Noord_Holland.html", "Price": "$131 - $263*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Stadhouderskade 131</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1074 AW</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "260058", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c5/d4/c5d43d6c542906079c4ea56c306c487b5large.jpg"}}