{"Reviews": [{"Content": "Near Train station, noisy neighborhood, priced right I booked the reservation through Ratestogo.com. The price was right, the location is near the Hauptbahnhof, only 1-2 blocks distant and maybe a five minute walk. The room was good sized compared to some others we've seen in Europe and it seemed that it was remodeled not long ago because the bathroom and tile grout was quite clean. The staff was standoffish at first but were friendly after we talked for a while. They spoke some English with varying degrees, and I was glad for that because I cannot speak German. The only problem, and this was covered in other reviews is that the neighborhood is a bit roudy and loud consisting of Bars and sex clubs. I recommend asking for a room facing the back of the hotel, not the street.. But once inside the hotel, there is no bother.", "Date": "Oct 30, 2007", "ReviewID": "UR978541517", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "NewguySFO"}, {"Content": "Not for the faint-hearted In the middle of the red-light district: sex-shop to the right, nightclub to the left, peep show opposite. The hotel is frequented by workmen (no female guests were seen except for me). The room, on the other hand, was recently refurbished, decently-sized and clean. Very cheap, so if the surroundings don't deter you it's ok.", "Date": "Sep 25, 2003", "ReviewID": "UR808447843", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "ottimo ed economico, location...quella che 猫!   showReview(10638934, 'full');", "Date": "Nov 6, 2007", "ReviewID": "UR648013822", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "ElisabettaMilano"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d260146-r10459525-Crown_Hotel-Frankfurt_Hesse.html", "HotelID": "260146", "Price": "$186"}}