{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reno, Nevada, United States", "Title": "“Our favorite home away from home!”", "Author": "Carole P", "ReviewID": "UR126375914", "Content": "We have been coming to Kahana falls for several years it's like coming home every time. The staff has always been pleasant and helpful. Suzy who is the manager is always available for any concerns. It's true the hotel rooms are small but our 2 bedroom lockout works perfect for us and guests. Kahana Falls is an older resort across from a beautiful beach and within walking distant to many stores and restaurants.. The pool area is beautiful. Coming to a smaller complex has its advantages....not too many people and an atmosphere of peace ..the fact that people are saying they are seeing ants and bugs.....well for goodness sake this is a tropical island ... There are insects! Let staff know the issues and they will addressed. I think we may have had one occasion where we dealt with some ants....really, no big deal! The past few years have seen refreshing and upgrades regarding the furniture and flooring. Tvs have improved and pretty much every year we come we notice something had been improved. This is a beautiful place to spend sometime exploring and enjoying the beautiful island of Maui!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kegs605", "Title": "“nice condo, awesome location”", "Author": "kegs605", "ReviewID": "UR126281579", "Content": "we stayed at the begining of the month and realy enjoyed the condo.The pool and hottubs were nice,. the hotel staff were great. The condo was spacious. It was our first time there and we will be going back.. we did spend alot of time at the resort due to the rain, we had bad weather.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary", "Title": "“Back again”", "Author": "JaneLacey", "ReviewID": "UR126008202", "Content": "We stayed here again in March 2012 for a week. Some renovations since last visit 3 years ago. Condos are clean and comfortable and quiet. We had rain this time so we were in the condo more than usual. Pleasant staff and visitors - all friendly. Toilet broke but was fixed immediately. Smiling, appologetic staff was at the door in 5 minutes and had it fixed in 10. BBQ'd a few times as were others and lots of chatting with others vacationers. Pool is great. Very shallow seperate pool for small kids. 2 unique hot tubs. Lots of lounge chairs. Easy access. 20 minutes to Lahaina. 2 pubs within walking. 2 convenience stores also. Beach across the street is good but we usually drove 10 minutes to public beaches for snorkling. Nice place. Would return.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockton, California", "Title": "“Good Location”", "Author": "fredsredt", "ReviewID": "UR125870599", "Content": "We own a timeshare at the Kahana Falls week 8 in a 2 bedroom 2 bath this was my first time using it as we usually rent it out but we really liked the place & location roomy & comfortable, the staff are very nice & helpful We like that they only come in to clean on Saturday & Tuesday so we can sleap in if we want & not be bothered", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Friendly staff and small hotel units with perks.”", "Author": "Kutless-inspired", "ReviewID": "UR125577067", "Content": "We traded into this Timeshare through RCI. The hotel unit was small but had a large bathroom with double sinks. We appreciated the mini fridge, full size microwave and kitchen sink in the room. Towels and trash service was provided daily, very rare for a timeshare. Older building but maintained. Free plug in internet. Common room upstairs of reception with full kitchen available. We moved into a studio size unit and it was much larger with full kitchen and washer/dryer. Even though it's advertised as 'Lahaina' it is about 20 minutes north of Lahaina town. Staff were great and we would consider staying again", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Lethbridge, Canada", "Title": "“Great facility”", "Author": "Sandra M", "ReviewID": "UR125547139", "Content": "My friend and I stayed there Feb.18 - 25. We thoroughly enjoyed the facility but our hotel room was small, cramped with poor ventilation. We had a time share but could not get an upgrade to a suite even though the place next to us was vacant for the whole week we were there. Towels were the best we had on our 6 week trip to Hawaii, room cleaned promptly each day. The pool area was great and the sand bottomed hot tub a treat but watch that last step, it's a long drop. One thing you must do is enjoy the Iron Imu BBQ truck that comes on Tuesday evenings. Fantastic value and great food. Do not be tempted to eat at the Sands of Kahana restaurant across the road....food is terrible, service is terrible and the bill will be huge even particularly after they add the automatic service charge to your check. There is a small shopping centre about a block away which has a Whaler's store, good for snacks. The Maui Brewing Co. offers good food at a reasonable price and there is a MacDonalds. Our only complaint and one that would prevent our return was the incredible winds that blew all week. There's no controlling the weather but we'd elect to stay more in the Kihei area because it is much calmer.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Our 7th Time to Kahana Falls”", "Author": "Kevin R", "ReviewID": "UR124641340", "Content": "This was our 7th visit to Kahana Falls and our stay during the week of Feb 2 - 10th, 2012 was better than ever. The concerige was great and provided us with some outstanding trips and tours during our stay, most notibly the Maui Aqua Adventure. The cost provided to us was very reasonable and affordable compared to the high pressure vendors in Lahaina. My wife, who is deathly afraid of the water had a great experience in a very relaxed atmosphere, with great instruction...She was able to swim at Molokini crater on her own and enjoyed the time she had their...The newly renovated common area upstairs in the main building is a great improvement which was needed. The front desk and housekeeping staff were also very good with respect to the servics provided.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Walk from the airport”", "Author": "Brian K", "ReviewID": "UR124130071", "Content": "I came on a budget trip, solo, and my \"hotel unit\" room was satisfying. The room had a sink, refrigerator and microwave, so I could easily make myself breakfast. Kahana Falls is in a good location * Close to Kapalua (JHM) airport, I just walked 20 minutes down the hill to the hotel. * Next to the hotel is a small convenience store: I bought breakfast cereal and pastries to eat in my room. * In the same area there is a Boss Frog, where I rented a bicycle, which I used to get around. This was so much better than renting a car! De-merits: * The room had wired Internet, but wireless would be most welcomed. * For this price ($100+tax) I didn't expect an ocean view, but the one window faced a walkway.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Surrey, Canada", "Title": "“hotel rooms are very small but over all nice...”", "Author": "romanles", "ReviewID": "UR123754660", "Content": "if staying in a hotel room then you will have very little room to do but sleep... window is over looking walkway ...so stays shut all the time---- on positive side ok size fridge,microwave,toster,coffee maker,nice washroom,cleaning only one a week since this is RCI (time share)propety,no restaurant,very good staff,nice bbq by the pool ,fitness room,good atmosphere, if you geting 1-2 bedroom you be happy,for sure. Place is right a cross the road from ocean,no water view from any rooms.. shopping at times supermarket 3min by car-a must in Maui, good luck!@!", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary, AB", "Title": "“Lovely, relaxing, excellent service”", "Author": "twinmom", "ReviewID": "UR123677491", "Content": "Not sure why all of the grumpy reviews here; we stayed in 405A/B and it was lovely! Daily towel and trash service if you wanted it - rare for a timeshare resort, and beautiful grounds. Short walk across the street to the beach in front of Sands of Kahana, where there is a great little restaurant with good prices and happy hour every day at 3-5:00. Our unit did have a bit less square footage than some others we've visited, but who stays in their room anyway? I can see if you booked the studio unit only, it is very small with no lanai but well equipped and nicely decorated, so just be aware when you make the reservation. We felt like we were in paradise every day, having breakfast on the lanai in the morning, whale watching during the day, and enjoying the great staff and other travellers at the pool. They rent (very cheaply) all kinds of equipment including boogie boards, beach chairs, bamboo mats and other items, with a portion of the $$ going to charity. Very helpful and warm staff members at every turn. Would go back in a heartbeat!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shaunavon, SK, Canada", "Title": "“Wonderful stay”", "Author": "DianneGreenlay", "ReviewID": "UR123178983", "Content": "We stayed in a 2 Bedroom,2 bath ( #109 A?B) for a week ( Dec.17-24/11). We had another couple along with us who had never had a tropical holiday before, so we really wanted everything to be perfect on this one. Kahana Falls was easy to find, had plenty of parking space, and the grounds are beautiful. There are 2 hot tubs, both with sandy bottoms, which we used every night. They were easy to access, the temperature was very warm, and the sand is a great experience. One of the hot tubs has a waterfall flowing into it. The kitchen in the unit was very well stocked. One in our party is a gourmet cook and he was able to prepare all of the dishes that he planned for with the dishes and utensils supplied there. The fridge had an ice maker as well. The second bedroom had its own microwave, sink, coffee maker and dishes, as well as a small table and chairs, and there was free internet hookup there. This bedroom was a lock-off so it also had its own entrance door and full bathroom. The main bedroom had another full bathroom attached and a very large storage closet. It also had a keyed safe to store valuables in. The beds were very comfortable, although I found them to be small for 2 people. (Felt like a double to me, but were advertised as queens. We have a king size at home.) We even slept one night on the fold-out couch bed to see what it was like - the mattress was thin and lumpy - definitely not for two adults. However, afternoon snoozes on the couch (not pulled out into the bed) was very comfortable. There was a second free internet hookup in the living room and a set of washer/dryer. Our patio opened out onto a small stream that ran past and emptied into the swimming pool via a waterfall. Very nice ambiance! The sound of the stream was very relaxing and dulled any traffic noise. This outdoor water flow is turned off from late evening to early morning so no sleep interruption. Kahana Falls has a room that has books to exchange/borrow, beautiful chairs/couch to read in, a brand-new workout room, and a shared room that had a kitchenette with a fridge in it. We were able to store our perishable groceries in this fridge until our room was ready on our first day there. Towels for the beach are available at no charge from housekeeping in the basement of the main building. The pool is designed to look like a tropical lagoon but the water is bone-numbing cold - nice to look at though! :-) There are many convenience shops and a gas station and a mall just 3-4 blocks away. Housekeeping were very efficient and came daily to empty the garbage. The barbeques were extremely clean and a good place to meet other visitors. Our guests were so impressed with their holiday here, that they bought a one bedroom timeshare for themselves at Kahana Falls and can't wait to go back. All in all, a great holiday!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "North", "Title": "“Heaven on earth!”", "Author": "Mauihiker", "ReviewID": "UR123062686", "Content": "We have stayed at Kahana Falls 3 times, and will be there for our fourth this year. We couldn't ask for a better place. It is very clean, well-maintained, friendly, and beautiful! The staff is very helpful and friendly, especially the concierge, Betty. She is wonderful with booking excursions, and she is very knowledgeable. The rooms are clean and tastefully decorated. The pool area is gorgeous and well maintained. I highly recommend this place for your dream vacation", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Silverdale, Washington, United States", "Title": "“pleasantly surprised”", "Author": "Amanda C", "ReviewID": "UR121674368", "Content": "After reading many horrible reviews, I was almost devastated that kahana falls was our destination. I called and tried to upgrade our room and we were put on a waiting list. I was a little frustrated, but we decided to just go with it and hope for the best. I am so glad that I didn't listen to the crotchety, high-maintenance opinions of other reviewers, and waste money on an upgrade! There was absolutley NOTHING wrong with our room! Yeah, it was \"small\" but it had everything that we needed! A bed, a dresser, a table, a sink, fridge, microwave, and a huge bathroom. I was on the lookout for bugs after all of the other reviewers were complaining, and i did not see a single bug the entire time we had our room. And i was on the lookout. But if you're any type of person that has common sense, you know that you will run into some type of bug or creature at least once on your trip to Hawaii, so get over it is all I can say to those complaints. The room itself was comfortable and cozy. No, it didn't have a balcony, which was a bit of a bummer, but I should thank them for giving us a room without one... it got us out of our room more, and that's exactly why we went to maui on vacation.. it gave us more of an excuse to get out and see and enjoy every bit of the island! The staff was also amazing and super friendly. I only have 3 complaints about this resort...first complaint is that the pool was really cold, but I can see how that would be enjoyable in the hot summer, so i didn't mind..(and it made me visit the sand bottom hot tub more, which was AMAZING!) second.. we shared a door and main entry way with the bigger room next to us, and they were a rather big and loud family that was up very early and back in very late, and we heard every single door click and conversation. But, we were on vacation, and so were they, so \"it's all good!\" .. My third and final complaint is the uppity people who would come to the front desk and loudly announce how HORRIBLY UNHAPPY THEY WERE WITH THEIR SMALL TINY DARK ROOM! HOW DARE YOU TREAT ME THIS WAY! (pretty sure they stole those lines from these past reviewers) ... all i can say to that is, thanks for runing my vacation with your disgusting attitude, and WHO DO YOU THINK YOU ARE! ... main point, you're on vacation, so enjoy every bit of it! stop comparing your hotel to the other high-end resorts on the island and you will have a fabulous time! you will have a complaint about one thing or another no matter where you stay, so get over it, and yourselves! kahana falls gives you an amazing stay for the price you pay, and i think the staff and \"private, quiet\" feel of the resort make up for any minor issues you may find! It's a very happy place and gives you that \"island vibe\"", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“a visit to Kahana Falls”", "Author": "bob b", "ReviewID": "UR121599174", "Content": "This was our first visit to Kahana Falls Resort in Maui. The resort has two excellent coneceirges in Betty and Mark. They were able to schedule activities and send us to the best places to eat and other great places to see. The beach is just across the street and easily accessible. Great time here. Roda at the front desk was very accomodating to our needs.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Lake in the Hills, Illinois", "Title": "“Vacation from hell”", "Author": "Ted N", "ReviewID": "UR121519923", "Content": "My wife and I stayed here last week through an RCI exchange. We were put in a room in the two story out building at the back of the property. I requested a change as soon as I checked in, but was told that RCI had their own inventory and I would have to contact them, which I did....no luck there! The second morning we woke up to no hot water. That evening we still had no hot water, plus we had a roach in the kitchen. We were given a key to the next door unit so we could use the shower and our hot water was fixed the following day. We again returned to our unit the 3rd evening to find another roach. We checked out after 3 days simply because we felt dirty just being at this place. Kahana Falls \"tower\" units may be very nice, but the 2 story units in the rear of the property are awful. Incidentally, when we checked out 3 days early, nobody asked why, how was your stay, etc. Never again!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Livermore, California", "Title": "“Great Concierges and Service”", "Author": "jacklich", "ReviewID": "UR121426212", "Content": "My wife and I were spending our 25th Anniversay at Kahana Falls and the Concierges Betty and Mark were great in helping my wife and I enjoy some romatic and fun experiences on our trip. They also were able to get us some good discounts on the things we wanted to do. The front desk clerks and all the staff were very friendly and attentive to all our needs. It may not be a huge resort with the greatest amenities but the room, pool, jacuzzi and work out room were all sufficient and it is located near great beaches and nightlife, shows, shopping, etc. I would definitely recommend this resort.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bellevue, Michigan", "Title": "“Ok for budget travel”", "Author": "LLLDMB", "ReviewID": "UR121057221", "Content": "We stayed here with some friends. We had the studio with a kitchenette. Our friends had the attached condo with the full kitchen, living area and balcony. It suited our needs but it was quite a ways away from all our activities. The hot tub and pool were nice. We would've liked some newer pillows, they were flat and hard as rocks. The beach across the street was very nice. It was close to Lahaina. We were glad for the use of the washer dryer in the main room.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Great location”", "Author": "Nancy D", "ReviewID": "UR120865858", "Content": "We spent 7 nights here and had a great time. Though it's not right on the beach, the beach is across the street and easy to access. Located about 5 miles from downtown Lahaina. We had a one bedroom with a kitchenette. Everything we needed was right there. Had access to the laundry room at no charge. Would definately book our stay here again.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lloydminster, Canada", "Title": "“Clean and Comfortable”", "Author": "SunshineStarky", "ReviewID": "UR120745192", "Content": "We stayed at Kahana Falls and were as well apprehensive due to previous reviews. Therefore we were not expecting much, however we were pleasantly surprised! We stayed in a studio room, it had a full kitchenette, including blender, coffee maker, casserole dishes, as well as washer, dryer, microwave, oven, fridge. I thought it was very comfortable. The gym was good, better then we expected. We stayed in 601, however we seen what the 1 bedroom was like and you could not see out side - only towards the hall way. These also had no washer or dryer and were quite small. Groceries are available for reasonable at Times which is only a short drive away. Probably about a 25 minute walk. There is also a farmers market/organic food place 20 minute walk away. Free Internet in room, so you can bring your computer. We didnt and had to use the one in the main lobby which you are only allowed 10 minutes per guest and you could not use facebook, which is how I needed to communicate with kids back home. However McDonalds is a 5 minute walk and there is free WIIFII there.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Great Maui Kahana Resort”", "Author": "otis t", "ReviewID": "UR120511237", "Content": "Great modest resort. 1 and 2 bedrooms the best, studios small and I would recomend not staying in one. Very clean, up to date furnishings. Concierge's Betty and Mark are great! Book all activities through them. They have the discounts! Great bar and grille right next door.. Dollies' good food, great prices, and take out as well. Very nice beach across the street. Groceries up at Napili a mile and a half. Nice pool, and grounds. Don't expect an ocean view as those rooms are reserved for owners. Nice accomodation facility.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Loved it and would go back in a heartbeat!!”", "Author": "maxxy_10", "ReviewID": "UR119735695", "Content": "When reading reviews for this property be careful what you are reading about. There is one building of very small hotel rooms which get bad reviews. However, we were in a 1 bedroomed apartment in the main block. The room, bedroom & bathroom were very large. There was a new large fridge & oven & a washer drier in the room. We had a lovely view over the pool. The staff were fantastic, nothing was a problem. They had fresh pineapple, Halloween candy & coffee out for the guests each day. There was regular & good cleaning of our room. The pool & hot tub are absolutely gorgeous you feel like you are swimming in an open stream. The pool is not heated, but it is Hawaii! The beach is an easy walk across the road, and a lovely beach for swimming. They opened a new gym while we were there and are setting up a large owners lounge soon. Did I mention that this was one of 3 RCI timeshares we stayed in on our Hawaii trip and by far our favorite.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Oregon", "Title": "“A Great Disappointment”", "Author": "momsmelodies", "ReviewID": "UR119275671", "Content": "We were all excited about going to Maui and staying at Kahana Falls. We figured it wouldn't be as bad as some of the reviews stated...but it was...maybe even worse. First of all the bed in the room they gave us was broken down. We went to the front desk to request a different room and we ended up having to wait till they finished checking everyone else in to see if there would be a room...WRONG! We finally got another room and our view was of a fence. Oh well. The couch was very uncomfortable and the dishwasher was hard to open. There were cockroaches so we had to make sure the sinks and bathtub plugs were in place. Parking spaces were definately small so make sure you are renting a small car. Handicap parking is very limited too. The pool are is okay but the pool is COLD, whereas the ocean is a lot warmer. The beach is assesible from the hotel across the beach but not really handicap assessible. The spa area on the side had a BBQ and laundramat which is nice. We bought steaks and BBQ'd them one night. It was great! The laundramat is free, which is also nice but you have to buy your own detergent, only one individual box is provided free, after that you have to buy it. We would never recommend this place to any of our friends or relatives. It might have been nice when it was first built but it isn't now. It needs a lot of work done. We still enjoyed Hawaii though, after all we were on vacation and made the best of things.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "vancouver", "Title": "“You're Flipping A Coin”", "Author": "j b", "ReviewID": "UR118820688", "Content": "We also purchased out stay here off of a GROUPON. We weren't so lucky. $400 plus an additional $100 in hidden fees. The room was extremely small. Most of the hotel rooms share a door with an adjacent hotel room and we had the pleasure of listening to the other guest listening to the TV late at night. Cleaning service was minimal. Pool wasn't great. I liked free access to the average workout room. Close to a decent beach and amenities. We flipped a coin and lost. Best of luck to you.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Simple, Quiet property WELL worth the price”", "Author": "vwilki2", "ReviewID": "UR118589763", "Content": "My boyfriend and I got this place on a great deal from Groupon. 8 days, 7 nights $400 total!! We bought it on a whim and THEN read old reviews and got freaked out. People were saying awful things so we expected the worst. I'm not sure which part of the complex other people were staying but we were pleasantly surprised. We had a privately owned condo on the 2nd floor in the back 2 story bldg of complex. There was no ocean view but we weren't bothered by that. There was public beach access across a small road so when we actually went to the beach at the hotel we just packed up a bag and snacks and walked over no big deal. The accomodations were fine. A little out dated and very island themed of course ;) wicker and bamboo furniture with island print pillows lol It was a good amount of space - full kitchen, bathroom with shower/tub, bedroom with queen bed and a large walk in closet. Kitchen was fully equipped so we made quite a few dinners and breakfasts ourselves. As two young adults we found the price AMAZING and were just happy to be there together, i have no idea what the prices are like not on a groupon so i can only say that the $400 price was all the way worth it ;) Also the laundry facilities were free (helpful if ur on a long trip) and they provide you with a box of powder if u forgot your own. The only negative i can think of was a random giant hole in the parking lot that was roped off by old pool chairs and caution tape that never seemed to be getting dealt with. All in all you dont go to hawaii to stay in a room all day so outdated furniture and formica countertops dont bother me like they must for other people. We rented our own snorkel gear (there is a BossFrog's retailer less than a block from the complex) , found random spots to snorkel at, braved the Road to Hana,went to a Luau, took a snorkel boat trip, explored Lahaina and just had a good time - that's what HI is all about :)", "Date": "September 26, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Huntington Beach. CA", "Title": "“Kahana Falls- great location and family destination!”", "Author": "Brigetteandco", "ReviewID": "UR118207004", "Content": "We stayed in a 2 bedroom on the top floor (August 2011). The master bedroom had a view of the ocean as well as the pool and waterfalls, as did the lanai. Both rooms had Jacuzzi tubs! We had 2 teenage boys with us on the pull out couch that said it was not very comfortable, but I read somewhere they are slowly replacing those. Also- some rooms had new flat screen TVs but ours did not. We didn't come to Maui to watch TV anyway. The full sized kitchen and BBQ came in handy to save a few $$. Staff was very helpful- our flight didn't leave until 11 p.m. and we were able to extend our stay and keep the rooms for $75. Very convenient. The park across the street was full of turtles! There is a decent grocery store (Times) not too far away, plus a small general store within walking distance. If you are looking for luxury, this is not the place. If you are looking for a great, clean place to stay in an excellent location with family- it is for you!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Great Place for Your Maui Stay”", "Author": "FoodTravelerAZ", "ReviewID": "UR117989822", "Content": "Kahana Falls is a decent property, a bit dated, but definitely a good pick for location/price in West Maui. The amenities are fine, we stayed in a hotel unit, which is rather small, but works ok considering it has a large bathroom. In the Kahana neighborhood you'll be near both downtown Lahaina (Front St) - a short drive, and the famous ka'anapali, kapalua, and honolua bay beach areas. There's a beach across the street from the resort property. The pool area is beautiful but why do you come to Hawaii if not to go to the beach!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice place-As advertised”", "Author": "ChrisW218", "ReviewID": "UR117429182", "Content": "I booked this thru RCI exchange. It was a great little resort-let. Small pool, no bar/restaurant. My room didn't have a view, but it was as I expected. Everything in the room was neat and clean. Staff was friendly and helpful, one of the maintenance guys hauled my full bag up to my car as I left without me even asking. 3 resort kitties were adorable :) Bonus jacuzzi tub in the room. The not so great- the bed was hard (I am used to a softer bed- others may not be bothered by this). Also housekeeping knocked on the door at 8:30 in the morning! (There was no DnD sign), hello I am on vacation!! Overall I enjoyed my stay.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sue4az", "Title": "“Good value for the money”", "Author": "sue4az", "ReviewID": "UR116588705", "Content": "Nice 2 bedroom condo. Nice full sized kitchen. Nice lanai that overlooked the pool and spa area. The second bedroom is offered as a studio alone. It is very very small Across the street was a small park and small beach area. If you want a resort that offers water slides or hugh fitness center this is not it. If you want a quiet place to sleep and fix a meal in it works great. The barbeques were really nice and kept up very well. You could also rent chairs and snorkels from the resort.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chesapeake, Virginia", "Title": "“Appreciated help from Paradise Vacations at Kahana Falls”", "Author": "NotSurfRiderinVB", "ReviewID": "UR115931029", "Content": "Was concerned with a review that said there were bugs in the room. Our studio was roomy enough for the two of us to celebrate our 25th wedding anniversary and not a bug shared the room with us. Within walking distance to a beach and short driving distance to more. beaches. Recommend Kapalua beach - partk at the tennis center nearby. Reserve with Paradise Vacations at Kahana Falls - Feast at Lele, excellent luau! Snorkel with Aquua Adventures - excellent excursion and crew. Celebrate life in Maui! Mahalo.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Comfortable, great location!”", "Author": "sasakidalem", "ReviewID": "UR115574754", "Content": "If it's the beach you are looking for, than it's not here as it is across the street from the beach. However, if you are going to Maui, you want access to all it has to offer, so you could easily walk to the beach and there are a lot of other beaches that are great you can easily drive to. It's location is only 10 minutes to Lahaina or Kapalua. The rooms are very good and all the cooking facilities make it easy for breakfast, leftovers, etc. There are grills provided to cook out on as well. The pool and hot tub are great for kids and adults. You are in walking distance to great restaurants, a small grocery store, etc. I would definitely stay again!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Qualicum Beach, Canada", "Title": "“Loved it, want to move there!”", "Author": "ajit22", "ReviewID": "UR115056500", "Content": "It was a fantastic bonding trip for our family. We fell in love with the lifestyle, the weather and the people. Everyone was so friendly, especially Betty at the concierge desk. The staff was extremely helpful and were able to answer all our questions and book all our activities. We will be going back next year.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“We loved it”", "Author": "KevinNancy", "ReviewID": "UR115015033", "Content": "The only truly annoying thing about this place is the thin parking spaces. It looks like they repainted the lines so that a Ford Focus barely fits without guaranteed door dings. Unit 604A/604B was great. Top floor; sort of on a corner. Rainbows to the left, a partially obstructed beach view to the right and the water fall pool below. Nice breeze and very private. Plus two bathrooms with the combined unit. Pros: => two bathrooms => great balcony & views => Great staff => We saw a group of sea turtles close to the beach one evening => short walk to a nice beach => Free high speed internet => daily towel exchange + mid week cleaning Cons: => Very cramped parking spaces => Two families dominated the grills every night => A very small (full size?) bed => You have to rent cheap old beach chairs that break easily", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "San Marcos, California", "Title": "“We checked in and checked right out...”", "Author": "BearBurriss33", "ReviewID": "UR113946111", "Content": "After planning my vacation for a few months, I arrived to this hotel with an utmost surprise. The place was so outdated... they still have VSH players, toilets had black rings and they clog up at one use. It was horrible. I was desperate to find other accommodation immediately after I arrived. There was no way I was going to stay one night afraid I was going to get bed bugs. Although the front desk tried to accommodate me by upgrading to me to a studio (at my expensice) with a pull out bed... no way I was going to stay for a week sleeping on a pull out bed. Maui is our favorite vacation spot and was married on this isle, this experience made me feel never to come back. Even though it wasn't in out budget, we still managed to find a 5 star hotel to enjoy our vacation. The koi pond was dirty and there were a lot of construction going on.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "West Seneca, New York", "Title": "“NOT FOR DISABLED PERSONS”", "Author": "HawaiiLover403", "ReviewID": "UR113945920", "Content": "Bath tubs are whirlpool, I needed step to get inside and outside of tub. Mattress wasn't firm, sheet had hole in it. Furniture was old and soft in living rm. We had a 2 bedroom 2nd bedroom extremely small. Pool wasn't accessable due to 12 inch step down for 1st step needing 2 knee replacements was not able to get out of pool because that same 12 in. step down, you had to step up. Walkways were on steep incline, made of stone, which caught your sandle causing you the chance of falling. Not good for anyone having walking difficulties. Parking spaces too small.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great place, has everything you need!....”", "Author": "Stevyc79", "ReviewID": "UR113789856", "Content": "We came here with uncertainty of what we were walking into due to some bad reviews we read, but once we arrived, we were pleasantly surprised! We had the studio-full kitchen, arrangement, the bed was kind of odd at first glance, but once u slide it out and then turn it 45 degrees, it is just like having a normal bed for two... It is not a couch-like slide out spring stack with a mattress pad like you may think....IT IS an actual true box spring and mattress top set up (i wish i had been told this prior or our arrival, i would have worried less!). The grounds are very well kept, within walking distance to anything you may need, and if you are uncertain about anything...just ask the front desk-they are willing to help and give you local tips when needed. We did however avoid the concierge desk area, as all they seemed to want to do is sell you excursions and timeshare related items....which we were capable of finding our own deals on trips nearby and do not need to be sold a future vacation when we are trying to enjoy the one we had just arrived on! The Pool and hot tubs here are never busy, grills are very nice and very accessible, this location is close to the beach, public transportation, dining (with happy hours), and just about anything else that may be desired. When we requested room service to deal with our towels etc and it was after their daily cleaning time, they responded in person to our room in LESS THAN TEN MINUTES and happily serviced our room! (we had left the do not disturb sign out too long on that given day) Internet worked great here and the kitchen had all the utensils we needed with no problem. In the end, we would return if we are looking for the great deal that was offered this time around. Please note, the \"hotel style\" rooms appear to be small and not as desirable as the regular hotel area.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fort Worth", "Title": "“Best pick for Maui!”", "Author": "zuszm", "ReviewID": "UR113281794", "Content": "The grounds are immaculate, friendly staff, very hospitable. Our reservation was in the hotel but the room had a small refrigerator, microwave, toaster & coffee pot. All utensils, dishes and cleaning supplies were included. Housekeeping was mid week but fresh towels were left daily. We were worried we should have reserved an efficiency but we had everything needed for a couple in the hotel for less $$. You don't go to Maui to stay in the room or effeciency and you will get more bang for your buck at Kahana Falls.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrenville, Illinois", "Title": "“Great place if you have the right room”", "Author": "Marine03", "ReviewID": "UR108643681", "Content": "Just spent a week at Kahana Falls. I couldn't have been happier with the place I picked especially for the price I paid. Stayed in 307A and it was large with a full kitchen, fridge you name it. Dining and living room with newer LCD TV. Large patio with access from the bedroom and living room. Clean nice bathroom and we never had to turn the AC on just open the windows and the wind did the rest. The important thing when booking is to make sure your are getting a larger unit with the full kitchen and living room. They have smaller rooms with a bad view that attach to the larger units so that big groups can be close together. They also have like a Motel 6 looking thing in back of the parking lot which is where the bad reviews come from I think. We never used the pool because we went to the beach but it seemed nice. We did use the grill's for fresh fish a few nights which was nice to save money. The front desk will rent you beach chairs, coolers etc for very cheap and all money goes to charity. I actually lost a chair on the Crater but bought a new beach umbrella so they were very nice about it. Also ask about road to hana cd's I gave them one as well. I would come back for sure if staying in the same type of room.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Maui, Hawaii", "Title": "“great 2 bedrooms with large patio”", "Author": "lulugotoborabora", "ReviewID": "UR104867561", "Content": "we had unit 306 AB- 2 bedrooms, it was a large and updated unit with large patio and washer/dryer. pool is beautiful and beach across the street is quiet and wild. perfect for calm holiday at the beach :)", "Date": "April 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chino Hills, California", "Title": "“AVOID Kahana Falls”", "Author": "aThinBlueLine", "ReviewID": "UR101681301", "Content": "My wife, our 3 year old daughter and I checked in on a Saturday. We were told the elevators have not worked for a day & it would not be repaired until Tuesday. We were given a room on the 4th floor. We were also told they were having problems with the locking mechanisms to the rooms. They had to issue us their Master Key, making us sign a form stating we would pay a fee if it was lost or damaged. The room was OK and somewhat outdated. No flat screen TVs. The bed was THE MOST UNCOMFORTABLE BED we have ever slept in. There were ants in the kitchen so we had to make sure everything was put away every day and night. The elevator was repaired on Tuesday for approx. 3 hours and it was out of order for the remainder duration of our 7 day vacation. It was AWESOME walking up and down the stairs while carrying my daughter, luggage, groceries, etc. The elevator was still out of order when we left on Saturday. The toilet paper provided by the \"resort\" was almost the same quality of toilet paper you would find in the worse gas station restroom you have ever been to in your life. Called the desk one time to request toiletries but they did not have any staff available to bring the item to our room. Very few rooms at this location have good ocean views. There are other resorts across the street, located between Kahana Falls and the ocean. We received ZERO contact or notification from the staff when the area our \"resort\" was located was put on Tsunami Alert and were recommended to evacuate by the government. Best part of the \"resort\": PLENTY OF PARKING.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wausau, Wisconsin", "Title": "“Maui is the best”", "Author": "brendalasoffbula", "ReviewID": "UR97433504", "Content": "betty at the conscierge planned our whole trip and did a wonderful job. our friends and family had never been to maui before and the tours we went on were the best. sheraton luau was great. kahana falls is a nice place to stay. great location to get to every place you need to go. if you have any questions just ask betty or one of the others they know everything.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Casual Maui”", "Author": "LongBeachBoludo", "ReviewID": "UR95130691", "Content": "Stayed in a one bedroom - two bath condo. Had a great veiw of the ocean, and just across the street from the beach. The condo is located in the area north of Lahaina called Kahana....great place if you want feel more like a local. While the place is very comfortable and clean....it is a little dated. I see how the place would work if you got just the hotel room.....that would not work. The room would be very small and no view. I would only stay here if I got the whole unit. I f you read the bad reviews here - almost all were from those who stayed in a \"hotel room'.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oregon", "Title": "“Comfortable enough”", "Author": "rusty0628", "ReviewID": "UR94518188", "Content": "We stayed for a week in December and found the Kahana Falls to be comfortable enough for the money. I am sure you can find fancier nicer places if you are willing to pay. My mother and Aunt who are in their 60s were more impressed than I was. I am 47.... It is about a 40 minute drive from the airport as most roads only allow 35 mph. It is a few miles from a nice big market and close to many restaurants and small stores/coffee places. Our unit was a one bedroom with a sofa bed. The bedroom was nice with floor to ceiling windows throughout. The sofa bed on the other hand was paper thin and you could feel every spring. The bathroom was large with a large closet the only problem I could see is it is quite a step to get into it if anyone had knee, back or balance problems. The lanai was quite large and overlooked the pools and BBQ area which are nice. Plenty of lounge chairs I never saw all of them full. It did not appear that too many people stayed and hung out during the day. There were small ants in the kitchen which I sprayed with Windex.....No vending machines.... I only had one interaction with the concierge which was initiated by me. I specifically wanted to go on the Wild Dolphin Encounter which she said does not exist. I told her I had seen it on many websites and in many magazines/brochures. She still insisted nobody takes anyone out to see dolphins that you may see them when you see whales if you are lucky...She did sign us up for a whale watching trip which was nice. We stayed with a female and two males for almost 2 hours, they spy hopped 12- 15 times, slapped their fins etc...that was the most awesome thing I have ever seen and it made my trip. We did find out the next day that indeed the Dolphin Encounter does exist, I could have bought a ticket from a number of people in Lahaina which makes me wonder if the resort gets commissions or some kind of incentive for selling certain tours. Not a way to do business if your guest specifically asks for something you should accomodate them or say I can't book that for you here is a number to call. **Warning** Most if not all of the people in Lahaina that have signs to book trips for you are timeshare salesman who do a very hard sale to get you a better deal on the trip if you do a 2 hour tour of their resort. They will not tell you this until you have already agreed which tour you want, picked a day and time and received a quote. It is a big waste of time if you are not interested in the presentation. Lahaina is about 10 minutes from Kahana and has a lot of touristy shops to buy t shirts etc...It also has many good restaraunts. We did not have a bad meal anywhere and found interesting that most places are open and birds fly in and jump around eating crumbs off the floor. The Banyan tree takes up an entire city block and is amazing as well as the harbor which boats take people out on tours from. We spend several days walking around. We took a road trip north which was a very very windy high road which was beautiful. Along the way a few spots have little shacks or vans that sell fresh fruit and you can watch the surfers Overall it was a good trip other than the sofa bed and concierge not helping with the tour.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomingdale, Illinois", "Title": "“Kahana Falls & the Ladies at the Concierge Desk plan your stay and all your events to be enjoyable!”", "Author": "sonythebaby39", "ReviewID": "UR92224016", "Content": "The afternoon we arrived we were greeted by Kathleen and Betty two wonderful Ladies at the Concierge desk. They helped us plan our whole week within a few minutes. I loved that because everyday was an exciting day! I did not have to worry in what we were going to do next and that alone made my vacation carefree. We were offered to take a family portrait, something I had been wanting to do for many years. The beach sceneries are amazing and the pictures we will treasure forever! Our family did leis out of fresh flowers with the help of Cristy, the aroma was incredible! We watched whale slides, so much to learn about the whales and took many walks to the beach. Went on an amazing snorkeling and turtle town adventure with Quick Silver! Traveled the road to Hanna and did lots of shopping! We couldn't have done it without the help of Betty and the Ladies, it was their warm smiles we received each and every time we passed by the front desk that started our day : ) Aloha & Mahalo!", "Date": "January 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chesapeake, Virginia", "Title": "“Roaches & Ants”", "Author": "DKBond007", "ReviewID": "UR90898135", "Content": "Sad Sad Sad. Many people only get to visit Hawaii once in a lifetime. Unfortunately, our one visit was tainted by the outdated timeshare called Kahana Falls. Any \"resort\" that keeps roach and ant spray under the counters in each room should be avaoided. Once my wife and I arrived, we understood the need for the insecticide. Ants crawled on the walls, sinks, and tubs. Roaches were found under the bathroom and kitchen sink. It was a little difficult to sleep wondering what was crawling on the bed next to you. The receptionist let me know that all of the rooms had bug issues; therefore, there was no need to switch. I felt so bad that my wife had to endure a week in these accomodations. I did not have the heart to tell my parents about the experience that we had in their timeshare. BEWARE!!!!!", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, AB", "Title": "“It was OK”", "Author": "Angelblue44", "ReviewID": "UR89695460", "Content": "Stayed here thru RCI, more like a last call points so can't really complain with the money and points we save. The hotel has everything you would need. We stayed on a small hotel room that has a fridge, microwave, dishes, glasses, etc. which is quite nice and convenient. The furnitures are outdated but we're not really in the room most of the time anyways. It has excellent access to the beach. The beach is smaller than Kaanapali but it's also not crowded and a great place to relax. They only clean the room and change the linens once a week, although housekeeping comes everyday to change towels and garbage. They'll give a pack of coffee on the first day and then charge $1.50 after that. Check out is early at 10am and they charge $50 for every 30 mins you extended check out. There is an island orientation for first timers on sat-mon and Lei making on Tues. There's also a desk for paradise activities where you can book activities in the island. Overall we did enjoy our stay at this place and will stay here again in the future. It's a quiet place to stay and recommended for people with young children and seniors, which is 70% of the guests here. Some of the guests we met we're staying at Kahana Falls every year since the 90's.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Friona, Texas", "Title": "“Second stay and really pleased with Kahana Falls”", "Author": "LarryK806", "ReviewID": "UR88695474", "Content": "My wife and I stayed here Sep 17-23, 2010 in a 1 bedroom, 1 bath unit on the 5th floor corner. The lanai was a beautiful ocean view just behond the Sands of Kahana timeshares across the street. The beach was about 60 yeards across the street and thru a parking lot. Our unit was very clean, modern furnishings with working appliances. The staff was very friendly and helpful with our many questions and booking activities. We stayed in a hotel unit, June 2009 and it was pretty small, but this 1 bedroom unit was very spacious. We will definately stay here again and we would highly recommend this timeshare.", "Date": "November 30, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Wisconsin", "Title": "“Would not stay here again!”", "Author": "vickiandphil", "ReviewID": "UR84774361", "Content": "My husband and I stayed at Kahana Falls last week. We were very disappointed with this place. We had what was supposed to be a one bedroom, 2 bath unit. It ended up to be a studio and lock out room combined. The furnishings were very old and dated and the set up of the 2 rooms together was very weird. Our lanai overlooked a small parking lot where the employees and service workers came and went. We never used it because of that. Who wants to look at garbage coming and going and supplies being delivered? We actually called RCI to see if we could be moved somewhere else. This place needs some serious updating just to become average. The best things about this resort is they have air conditioning, a computer for guests to use and a mid week cleaning service. The location was not good and I would never recommend this place to anyone.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Worth the visit”", "Author": "Avril49", "ReviewID": "UR79557877", "Content": "We visited for a week starting on Labor Day weekend. This was our first â€œrest, relax and restoreâ€� vacation. The staff was excellent. The concierge, Betty, made our stay enjoyable. Her friendliness and attention to detail was remarkable. The room was clean and comfortable and the kitchen was fully equipped. The outside furniture and BBQ grill were also clean and well maintained. We met a couple who have stayed at Kahana Falls every year for the past 10 years and others who are return guests. We full filled our vacation desire but was still enjoyed the fun things Maui had to offer. Our only regret was leaving Kahana Falls and returning to reality. This will be our vacation spot on our next return to Maui.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Centennial, CO", "Title": "“Much better than expected”", "Author": "cubbybear1", "ReviewID": "UR69946160", "Content": "Based on some bad reviews, I thought this place might be a bit shady, but was pleasantly surprised. We stayed in a one bedroom/one bath â€“ three people (two in bedroom, one pull out couch). This was a great place to stay, assuming you not expecting a posh resort experience. The good: Clean and well maintained. There may have been an occasional miniscule ant, but I donâ€™t know how you can avoid it in Hawaii. Right across the street from Kahana Beach â€“ a pretty nice little beach Good size unit, bed was comfortable Prompt maintenance - fixed an issue within 10 minutes! The lanai was nice â€“ Iâ€™ve stayed in Maui before and had problem with lanai having the air conditioning unit on the lanai and it was a hot, wet mess. You are really close to West (and North?) Maui activities The bad: The pull out couch mattress was pretty bad â€“ management notified when we left The washer/dryer worked but were very loud I happened to see the hotel unit â€“ and yes they were very small", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tijeras, New Mexico", "Title": "“Quiet and Peaceful”", "Author": "martin4449", "ReviewID": "UR68015910", "Content": "Location was great. Near grocery, shopping, restaurants, adventures and activities and yet a hidden gem away from the noise of the night life crowd when you were ready to get away from it. Studio unit was very cute, arranged nicely and comfortable for the two of us. Staff was exceptional, helpful and so friendly. We'll go back again. Jim and Cindy from Albuquerque, New Mexico.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Relaxation at it's best!”", "Author": "TravelCPA", "ReviewID": "UR67184265", "Content": "First of all, the resort has updated the rooms and they are clean, cozy, and very comfortable. All the right amenities. They still need to work on better maintenance and updating the fitness center. It's usuable but could be better. The concierge services are the absolute best. They help you get all your activities scheduled for the week with great information on various companies so you know you are going to have a great time. They even help you arrange for delivery of your pinapple to the airport! The employees from front desk to maintenance are sweet, accommodating and extremely helpful and available. Although the resort is small and not on the beach, it's QUIET without a ton of foot traffic. And besides, who spends time in their room in Maui. Everyone GOES to any number of the wonderful beaches on Maui. Being small, you get more attention and help from staff and you don't have to contend with a noisy busy pool where you can't find a nice place to take a nap in the sun with the cool tradewinds blowing.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“A wise use of your time and money”", "Author": "Mellon", "ReviewID": "UR64133536", "Content": "As nearly every reviewer in the last year has learned, Kahana Falls is an excellent place to stay, and is well worth your time and money. It is a relatively small resort, and it should be viewed mostly as a place to stay while you go out and explore what Maui has to offer. After a short while, you will feel that you are coming home every time you go back to your rooms. The rooms are comfortable, clean, have kitchens and functional furnitures, and the resort is in a very peaceful location. There is also a pool with a waterfall, and ample room to relax outside. Flat screen TVs have replaced the tubed models that were there the last few times I stayed at Kahana Falls. FYI, my wife considers this her home in Hawaii and tries to come hear annually. FYI, word is that the fitness center may be moved to a sunny location on the top floor of the main building. Go elsewhere if you want a large beachside resort with restaurants and constant activity. Kahana Falls is for people who are perhaps a bit more independent and do not depend upon a hotel to provide all their activities. Kahana Falls has an agreement with the beachside resort across the street, allowing guests to use the beach there. FYI, that second resort has a fun restaurant with daily happy hours. It's easy to look forward to lava flows and mai tais. There are several good restaurants nearby - and some are even within walking distance. A few minutes walk from the resort are RB's Steakhouse (with a pineapple brulee that is astounding), Roy's (topnotch seafood), and Dollie's pub. Driving south a couple of minutes brings you to Java Jazz - great food and drinks in an eclectic setting.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Virginia", "Title": "“Worth it!”", "Author": "Mr_and_Mrs_Smith06", "ReviewID": "UR53813718", "Content": "My husband and I were slightly worried once we read all the negative reviews, but once we got there we were blown away! The location was amazing, the service was out standing and we were literally in paradise! Yes, the rooms are kind of small, but who in thier right mind goes to Maua to stay in their room. As far as the rooms, it had everything we needed. We had a hotel room attached to a one bedroom condo. The pool area is beautiful with the two waterfalls and greenery growing around. Certainly check out the two koa ponds. As for the service, everyone we encountered went out of thier way to make sure we were happy! The grounds and house keepers were always working to make sure everything looked amazing. Please do not let the negative reviews discourage you from this wonderful place!", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cape Cod", "Title": "“So much better than I was expecting!”", "Author": "Vikkioria", "ReviewID": "UR52168188", "Content": "We came to this hotel with low expectations and very pleasantly surprised. We had a studio, which was small, as studios usually are, but was more than enough room for the two of us. There was a large bathroom, full kitchen, dining area, living area and a lanai. There is also a washer and dryer in the unit which is awesome and they supply some laundry detergent. The staff was very helpful and accommodating. The hotel offered more amenities than I was expecting, some of which include a fitness area, two hot tubs, fresh towels daily (both in the room and for the beach/pool), and rentals (boogies boards, coolers, Hana CDs) at a very, very reasonable rate. There are huge grills by the pool, cleaned every morning and free for the guests to use. This proved very useful to use after an unexpectedly successful fishing trip landed us with more catch of the day than we could consume. The location is great, we were close to Lahaina and Kaanapali but far enough away that you didn't feel too crowded. The beach across the street is fine for sunbathing but not for an inexperienced swimmer. There is a steep drop off and can be wavy. It is great for sunsets though. A short walk south on the beach will take you away from the hotels and the beach will feel like your own. This unit was perfect for our busy vacation where little time was spent at the hotel. I would not recommend this hotel for someone looking to never leave their resort, but for those of you looking for a nice place to end your day, this very well could be the place for you.", "Date": "December 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Convenient Location. Good value for money.”", "Author": "dumma187", "ReviewID": "UR52128945", "Content": "Located 5 minutes from Ka'anapali beach, meant that we spent most of our time outdoors & very little time in the room. Room was small, but had all the basic amenities (refrigerator, microwave, cutlery), & was quite clean & well maintained. The staff were very helpful & even mapped out different attractions, & helped us plan our stay. Only complaint is the lack of privacy. The walls were really thin & we could hear guests in other rooms as well as walking down the corridors. Altogether a pleasant experience (contrary to some of the scary reviews we read before coming!).", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Gig Harbor, WA", "Title": "“We were surprised and pleased with what we found.”", "Author": "GSLGigHarbor_WA", "ReviewID": "UR51213592", "Content": "After reading mixed reviews, we weren't quite sure what to expect. We were surprised and pleased with what we found at the resort. We had a one bedroom (sleeps 4) bedroom with a corner lanai, and it was perfect for the two of us. I do not think I would want to be in a smaller unit. That being said, I don't think we've ever been in a place where they were constantly cleaning the pool area, painting outside curbs etc. It was very clean, the staff was friendly, courteous and very helpful. We would not hesitate to go back again. I would advise, though, to go for a unit at least the size of ours.", "Date": "December 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alaska", "Title": "“Two Weeks, can't wait to go back”", "Author": "levergun", "ReviewID": "UR47897163", "Content": "My wife and I just spent two weeks 1st week in Hale Kippa 1 bdm, 1 bath, 2nd week 1 bedroom 2 bath. Since I had read the reviews, I was not expecting much. But, I was suprised as the room was more than adequate. Rooms were clean and well appointed. I did not go to Maui for time to spend in the room. Yes the beach access right accross the street was great for morning walks and sunsets evenings. The staff were helpful, and very polite. I stayed in Wakiki once in a room that would make the Hotel rooms at Kahana Falls seem grandiose. What I really liked was the location in that you are near the end of the road as far as hotels go, and at the same time not very far from amenities. If nothing else go to Roys, next to McDonalds for their desserts, especially thier chocolate mousse. There are great beaches not far away, Kapalua, Honolua, and Fleming St park for the boogie boards. The communal use gas barbeques are clean, and the pool while not large is not overcrowded. Would I stay there again. Yes.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sacramento", "Title": "“This was a great place to stay”", "Author": "scubatravler", "ReviewID": "UR47864973", "Content": "The hotel was well maintained and had all the amenities of home. The layout of the room plus the extra room provided ample space. Kitchen had 14cu foot refrigerator and all the necessary items to cook meals plus a nice washer dryer for keeping your clothes clean while on vacation. The location was well kept clean and staff was very friendly and helpful. They amenities included a pool, spas, barbques and a nice coi pond. The sites I have seen had a lot of bad commets about this hotel and when I visited I found this place to be great. Very homey feeling with everything needed for a great vacation. The rooms each had a television. The main room had a dining table, balcony had a dining table and the bedroom had a small table. Two bathrooms were available for use. This place was definately a great place to go in Maui. There is definately a choice do you want to pay $250-300 a night for a hotel or stay somewhere where you can have all the comforts from home and save the money to have fun versus spending it all on hotel. The location was clean with free parking and amenities that were available to rent such as a cooler and also boogie boards. (they make donations for the local charities with the proceeds) Great Staff would stay again and recommend to friends and family.", "Date": "October 27, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“Great Location”", "Author": "wldcats98", "ReviewID": "UR46331702", "Content": "Recently stayed here for a week long vacation. Without a doubt the location of this hotel was the BEST! Beach across the street and many shops and restaurants nearby. We stayed in a studio. The kitchen and washer and dryer were nice but the bed/couch thing was horrible. It made for uncomfortable sleeping. And having to push it in and out every night was a pain. Another thing was that since we were on the ground floor after leaving food out for one night we had many visitors!! Cockroaches were everywhere!!! When I found the bug spray under the sink knew I wasn't the only one with this problem. I have to say the ammenties of this hotel make up for the bugs and the bed issue. Beach rentals, towels, and tours were all right there for us to book and use!", "Date": "October 8, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Value": "5", "Location": "4"}, "AuthorLocation": "East Grand Forks, Minnesota", "Title": "“Relaxing vacation”", "Author": "mbies", "ReviewID": "UR46224123", "Content": "We stayed at Kahana Falls in Maui in August and found it to be a very pleasant and relaxing experience. The staff was very helpful and friendly. The area was beautiful. The sound of the waterfall in the pool area was peaceful. This hotel was kept clean inside and out. The hot tubs are cleaned every week. The gardens around the pool area makes it's feel like your in a tropical paradis.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Winchester, California", "Title": "“Basic resort, close to the beach.”", "Author": "satrel", "ReviewID": "UR40495676", "Content": "We used our RCI exchange to book in Maui, and from talking to some timeshare reps there, the nicer units are reserved for the owners, and people who exchange get, well, what's left. We had a studio with full kitchen, laundry, and a lanai. I was not expecting much, but it was not bad overall. The Studio is tiny, only has a sleeper sofa in living room (so good for a single person or couple at most), dining nook, and thankfully, well appointed full kitchen. With restaurant prices in Maui, cooking most of the meals in the room saved us alot of money, however groceries were not cheap either....the room was clean, the full bath was big enough, and being few stories up, we had a tiny piece of ocean view from our lanai. But the location of the hotel made up for it, cross the street and the beach was right there. Parking was tight, if you rent a larger vehicle good luck trying to park and not get the doors dinged...some people just gave up and took two spots...not nice, but sometimes unavoidable. The resort was pretty, had a nice pool and hot tub, tropical landscaping. The building will need renovations soon, but overall not too bad. Located close to shops, few food places withing walking distance, also a rental place for all your water gear. Bottom line, you're not in Hawaii for the room, it was good enough to sleep and eat in, enough for us two. If you're planning to spend alot of time at the resort and in the room, many fancy hotels are nearby...I recommend this one for basic comfort and convenience, and can't beat the price for Hawaii for $299 a week!", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Value. Great Location.”", "Author": "czand", "ReviewID": "UR38263673", "Content": "We stayed at Kahana Falls through an RCI timeshare exchange. We had a very nice 2 bedroom unit with separate entrance for the 2nd smaller bedroom. The unit was very well equipped with a large lanai overlooking the pool and we could also see the ocean. The pool was on the smaller size, but really never that busy, so we could always get chairs. The front desk staff were always nice and helpful. We rented beach chairs, umbrella and boogey boards when we went to the beach. I think one of the bonuses of Kahana Falls was it's location. We were 10 minutes away from the touristy hustle and bustle of Lahaina and 10 minutes away from the huge resorts and beautiful beaches of Kapalua. Even Waelea was only a 45 minute very scenic drive. We did a number of excursions, but the best 2 were the Trilogy Catamaran to Linai (full day - worth every penny and more) and the bike ride down the volcano (they pick you up at 1:30am to see the sunrise and then you bike). It was very easy to come and go at Kahana Falls with loads of parking included. If you're looking for a true 5-star resort, then this isn't the place for you. Go to the Ritz Carleton or the Westin - but, then again you also get the price tag that goes with it. I'd go back in a minute.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Silicon Valley", "Title": "“Decent, not fantastic”", "Author": "BitterKnitter", "ReviewID": "UR36853555", "Content": "Booked through timeshare - despite the fact that most of Hawaii was empty due to the economy, we were told this was the ONLY room/time available... ok, fine. The resort itself seems to be quite large - 3 big buildings that all share a fairly small pool with only about 20 deck chairs. We thought it would be an issue getting a spot to sit at the pool, but due to overall emptiness of the resort & that the resort is not directly on the beach, pool was mostly empty all day. The deck area had plenty of sunny & shady spots through the day. The landscaping was lovely, and I enjoyed watching the koi in their ponds. There are also 2 hot tubs, the back one was usually not in use. The studio room we got was pretty spacious - full kitchen amenities, and having a washer/dryer in the room was great! Kitchen was outfitted pretty well for cooking, even some tupperware for the days we decided to pack lunches. We had free wired internet, wireless was down the entire time (they said it's maintained by a 3rd party, and not well). Our patio was on the corner overlooking the pool/waterfalls - definitely a lot of white noise while the doors were open, but I find that relaxing. Doors blocked the noise well for sleeping. The biggest complaint we had was that being a studio, the bed/couch was some weird mutant piece of furniture. It was I think a double bed, making for pretty \"cozy\" sleeping. Half of the bed was hidden under a cabinet type thing, and you had to pull it out each night for sleeping. Since the \"couch\" had bamboo arms, it made it really hard for one person to get in & out of bed - had to climb over the other person. There's some local coffee shops, a couple of restaurants, but not a huge amount within quick walking distance. Beach in the area was quite nice (we just walked through the Sands of Kahana to get to the beach... otherwise beach access is difficult). The hotel staff was nice - didn't seem shady at all. Groundsmen were nice. Considering the nightly cost for our studio, it's ok. One issue with being north in Kahana is that it's more often rainy/cloudy than it is further south in Kaanapali. Even 5 miles made a huge difference in weather during our visit.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Orange County, CA", "Title": "“Nice, comfortable stay at Kahana Falls”", "Author": "merry2", "ReviewID": "UR36722190", "Content": "Stayed for one week through a timeshare exchange. We stayed in a 1 bedroom /1 bath unit that has a queen size bed and sofa sleeper. The bathroom was in the masters bedroom which was somewhat inconvenient (but I feel is worth it since we had a washer/dryer). We were in the 3rd floor which had some view of the ocean (Kahana Falls is not an oceanfront resort. It is across the street from the beach and there are other hotels blocking your view but has nearby beach access). There is central A/C with ceiling fans in the bedroom and dining room and a nice patio where we ate some of our meals overlooking the pool and garden. Another reviewer mentioned about the noisy waterfall which is turned on at 7 am and off late but the patio doors block the noise quite well (so you have to use the A/C. Might not be for some people who would like to sleep with fresh air). There is ample parking. The kitchen is well-equipped with microwave, stove/oven, fridge, dishwasher, coffeemaker, etc to prepare your meals and they have 2 barbecues by the pool. There is a small area on the back side of the resort (where the hotel units were) that had another barbecue, shuffleboard, spa (supposedly miniature golf but I didn't check this out). There is a pool and koi pond (which they were kind enough to give my son some fish food to feed the koi). There is a concierge desk who are willing to help you with booking your activities. I found the staff very helpful and they're always around keeping the grounds clean. There is a daily charge (I think $15) for wifi in your room. There is a computer/printer in the front lobby to check your e-mail and print your boarding passes. The fitness room in the lower level has a treadmill, eliptical, bike and some gym equipment (plus a scale which we used to weigh our luggage). Also in the lower level, you can check out beach towels and they charge a nominal fee for use of a swim noodle, ice chest (handy for packing lunches on your outings) and a road to Hana CD which was helpful to know your stops to check out the views. Yes, we drove to Hana and continued around (there is about 5 miles of unpaved road but we did it in a Hyundai Sonata). They have info on a small surf/snorkel shop that gives 10% discount to Kahana Falls customers which is located about 1 1/2 miles away (we rented a boogie board with a glass window which my son loved for about $8/week). Along Lower Honopiilani Road are various restaurants and shops. We enjoyed China Boat, a take-out place Okazuya (?), and the Lava Flow smoothie at this small Nachos Grande restaurant in the Star Market shopping area. We found that groceries are quite expensive in Maui but they have a Costco and Wal-Mart (not a super Wal-Mart). I did like going to the Farmer's Market which is a mile away for produce(MWF 7-11) My GPS was quite handy! We enjoyed snorkelling at Honolua Bay (which was north of Kahana) but we really liked Ahihi Keanau reserve in south Maui (which is about a 45 min-drive depending on traffic). My husband and daughter enjoyed the Molokini Crater trip through Trilogy (book online and they have discounts;also, their kids rate is up to 15 years old which is half off the adult's). Kahana Falls is about 10-15 min from Lahaina which had the best shaved ice, Ululani's.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chanhassen, MN USA", "Title": "“For the Value a Good Place and Great West Island Location”", "Author": "msp2phl", "ReviewID": "UR26776033", "Content": "The GOOD The staff along with the tour hosts were excellent Well equiped condo suite - kitchen was great and very well maintained Good location in the Kahana area Easy walk to the beach and shops Nice pool area Plenty of parking The BAD The sofa bed was very uncomfortable for our 2 girls Beach items were not provided in the condo Room service missed towel exchange on 2 of our 6 days there The location of the bathroom in the bedroom made it difficult for privacy OTHER No beach or ocean views if your looking for that (wasn't important to us) The water falls in the pool area make lots of noise so beware They need to upgarde to WIFI (single high speed wired cable connection)", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Langley, BC", "Title": "“Great hotel, but hardly any view of the ocean”", "Author": "laura2412", "ReviewID": "UR25114636", "Content": "We stayed at Kahana Falls Feb 2009. We had a 2 bedroom, which was a nice size, it was connected to a studio room, which I was extremely glad we didn't get because it was TINY! And no view of anything at all. This one overlooked the pool and gardens, and had a tiny view of the ocean across the street (we were behind another hotel on the ocean). We got this through RCI, but were charged a $140 fee at check in, the employee didn't seem to know what it was for but I am assuming parking and internet, as most other hotels charge for those things. I was kind of annoyed we didn't know about this to begin with. Rooms were air conditioned and well laid out, also there was a washer/dryer. We found quite a few tiny little ants in the bathroom and kitchen - they got into our Krispy Kremes so that was the end of those. Also found one little cockroach in the sink. I guess this is typical in Hawaii. Pool area was really nice, waterfalls going into the pool, koi pond next to it, and a sand-bottomed hot tub. 2 BBQ's by the pool, not really enough for everyone staying at the hotel. LOVED the torches around the pool area. Pool was quiet most of the time, not heated though so it was cold. They clean your room once a week and empty garbages and change towels every day. Employees were really nice and accomodating.", "Date": "February 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary", "Title": "“Kahana was a great condo”", "Author": "JaneLacey", "ReviewID": "UR24066193", "Content": "Myself and 3 friends stayed in a 2 bedroom unit. It was great. We found it to be very relaxing. Since this is not directly on the beach (but just across the street) we thought that there was less traffic going throug the lobby and on the grounds. We drove around to some wonderful beaches just 10 minutes north. More secluded and protected from wind/waves. The snorkeling was fantastic. There are plenty of very good resturants nearby. We did BBQ one night and we did use the kitchen for breakfasts. Staff was very helpful but not in your face trying to sell tours. They had great suggestions on tour deals and restaurants.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nashville", "Title": "“Good Suprise”", "Author": "seessels", "ReviewID": "UR23538451", "Content": "My friend invited my wife and me to go with him and his wife. He has another friend with a timeshare and let us use it for the week. We got the two bedroom two bath, which was actually two rooms that were connected. There was an A room and a B room that had two different entries, but could become one if you opened the common door. I was a little worried after reading some of the reviews, but then I could understand after seeing the B room. The key is to get the big A room or the two bedroom two bath. If I had to stay in the little B room for a week I can understand how cramped it would be. The little B room had a small fridge and a sink and was like a small bedroom with a lot of furniture. The big A room was great. It had a balcony with a view of the ocean (we saw whales while sitting there 6th floor) it also had a great view of the property. There was a full size kitchen with a living room that was plenty big enough for the four of us. The rooms do need to be updated, but they were clean. The staff was very friendly and they were always working on the property the entire time we were there. Everybody you ran into was very friendly and willing to help any way possible. The only reason I did not give 5 stars is because the rooms need to be updated. The location was also great, you only have to walk across the street to get to the beach. Also the hotel itself is located in a great part of town. I would recommend this place.", "Date": "January 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "oklahoma", "Title": "“a great place to stay”", "Author": "fabolous_thang_69", "ReviewID": "UR21579881", "Content": "we went to kahana falls for a week on our honeymoon, and after reading most of the reviews on here, i was freaked out because some werent so great. but the plans were already made and we couldnt turn back! once we arrived, we walked into the lobby, which is very pretty and the guy behind the desk was so friendly and helpful! afterwards, we were goin up the elevator and i just knew the room was gunna be horrrible. but we walked in and i couldnt believe what i was seeing!! it was beautiful, a full 2 bed 2 bath house pretty much! now i will give it to you straight, the tvs were older, but that was the only thing i could complain about. the full kitchen was great and new appliances. they even did the dishes one afternoon while we were out!! they change sheets every wednesday,, which is fine because you are the only ones sleeping in them. towels are brought daily and the workers are very friendly. it was a very pleasurable experience!! it is a great place to visit!!", "Date": "November 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "wisconsin", "Title": "“above average stay”", "Author": "jfap", "ReviewID": "UR21254266", "Content": "I stayed with a friend who has a timeshare, they had 2 weeks and her husband could only come one. We were in units 507a and 507b. Large, clean, 2 bedrooms, 2 baths, large lanai with view of pool and ocean. People were friendly and accomodating. Pool is small, but very nice with a waterfall. You need a car in Maui, and we visited some neat beach breakfast places in Napili and then spend time at the turtle beach there. It is 10 minutes from Kahana Falls. Very relaxing, I would recommend to anyone.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Southern Calif", "Title": "“Don't believe what you read!”", "Author": "heidilun", "ReviewID": "UR21104751", "Content": "I went solo to get away from everything and I had a 2 bedroom 2 bath condo. It was huge! Great Lanai that overlooked the pool. Very quite which I needed. Friendly staff. I have to admit after reading the reviews before going I was a little nervous. I would definitely come back to this place! Just a side note definitely do the hana tour it was fabulous!", "Date": "October 22, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oahu - Makakilo", "Title": "“We loved Kahana Falls”", "Author": "1xtinejackson", "ReviewID": "UR20812928", "Content": "We loved staying at Kahana Falls! It was a 2 bedroom with two full baths - jacuzzi tubs, full kitchen - stocked and three TV's!! A/C and laundry. We had so much space it was like home away from home. We came over from Oahu and I can see us coming back again! No complaints and will recommend to all our friends!! Thanks to the staff at Kahana Falls!!", "Date": "October 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Michigan", "Title": "“Avoid this place, at all costs”", "Author": "TravelAddictMichigan", "ReviewID": "UR18436262", "Content": "I was given a week long stay at this resort as a gift through RCI Travel, and I had no idea what to expect. I cannot imagine that this place gets a repeat customer. I could not force myself to stay in the room that was assigned. The cloth bed board was severly stained. It looked like 10 cups of coffee or more had been spilled on it. The sheets and the carpet were both dirty and stained, and the carpet smelled. As the above room was unacceptable, I tried to get transferred to another room, but the desk staff was not very accomodating and was darn right rude. Needless to say, I could not bring myself to stay one night in this place. Now, this \"resort\" claims I caused the stains and the smell during my 30 minute visit. I advise that you avoid this resort at all costs. RCI Travel still needs to resolve this issue for me. They also should take this off their list of places for others to timeshare, as its rooms and service are unacceptable for a \"resort\".", "Date": "July 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "miami florida", "Title": "“gorgoes”", "Author": "mauiigirl8", "ReviewID": "UR18204567", "Content": "The hotel grounds was absoulutley amazing . The first night we got there a lady named Crissy was extremley obnoxios to us. are room had a small bug problem,but despite what other reviews said the room we had was very large,we had won it at a auction, just dont rent 1 small room.also be aware that theres a $200 some tax for check in we didnt know about that. the grounds were amazing and we got a complimenterey breakfeast with a free seminar.Just take my advice and dont go to the thing were they want you to buy a condo.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "PA", "Title": "“ants, roaches and mice OH MY!!!!!!”", "Author": "mjb1teach", "ReviewID": "UR17892390", "Content": "The bed was AWFUL. My wife and I couldn't wait to get back to our termpur-pedic at home. Ant and creature infestations led to them spraying, bombing the whole place and stinking it up. Like that was healthy to breathe. You have a can of bug spray that you HAVE to use. SO GROSS, I mean Hawaii is awesome, but cancel your reservations and wait til next year if this is your only place to stay. PS Towel service happened 2 times in 2 weeks.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Nothing to complain about â€¦ and plenty to like”", "Author": "PaulMcBay", "ReviewID": "UR16420441", "Content": "We spent a week at Kahana Falls between May 3 and 10, 2008. We booked prior to reading the reviews on this site, and since many of them portray the place as very small, or old and dirty, I was quite nervous that we had not made a good choice. We stayed in 303 and had both units A and B. Unit A was a nice bright clean south facing studio with a full galley kitchen, sitting room, eating area and full bathroom. The couch doubled as a pull out bed (which we didnâ€™t sleep in.) The lanai was small and not particular scenic. Unit B is what youâ€™d expect to see in a hotel room. It had a queen size bed that was comfortable, a big bathroom with two sinks, a small jetted tub, bar fridge and microwave. There is absolutely no view and very little outside light at all in unit B. Since all we used this room was for sleeping in â€“ no problem. The furniture in both units was the normal sort of stuff youâ€™d expect to see in a three star hotel and was in decent shape. Since we had both A and B, there was plenty of room for just the two of us. I'd also say that there's plenty of room for a family of four. Kahana Falls itself is also nice. They have a daily pick up of trash and towel exchange, something rare with timeshares â€“ but a great idea. There seemed to be a lot of staff and they were constantly cleaning. Maybe some of the older reviews were correct and there were problems with cleanliness, or bugs - something that certainly seems to be rectified now. Another nice feature was free internet. Again, many timeshares weâ€™ve been to donâ€™t offer this in every suite. Their pool is small, and having a couple of waterfalls flowing into it sure looks nice, but is loud. But then again, why sit by a pool when the Pacific Ocean is just across the street. (And yes, it was sandy when we were there â€“ although weather can strip a beach of sand at times.) The review â€œGood little resortâ€� (Mar 7, 2008) does a real good job of summarizing the various sizes of rooms, and the fact that the price of this place is not as expensive as many others. I would only add that if you donâ€™t mind staying in a solid three star hotel for your other travel, you will find Kahana Falls suitable for you.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oak Harbor, Washington", "Title": "“Hale Kipa Unit and Resort Wonderful”", "Author": "DGLions", "ReviewID": "UR14011239", "Content": "We stayed at the Kahana Falls Resort, Feb 22 - Feb 29. What a wonderful surprise. Our unit 112 (Hale Kipa) was clean, no bugs, nice furniture, comfortable beds. We had what seemed our own hot tub just on the side of our building. It was clean and no one seemed to know about it. We enjoyed doing our own Bar-B-Que which was near the hot tub. The laundry facilities in the same area were FREE, two washers and dryers. Parking is free and pleanty of spaces available. The welcome Mai Tai party was very enjoyable which was held by the main pool area. Free Mai Tais and snacks. All the staff from the front desk to the maids were very pleasant and helpful. The activities personnel were very interested in making your outings enjoyable and affordable. There is even a free business center, where we checked our email daily. A couple of nice restaurants are just a short walking distance (1 block) from the resort. We have a timeshare that week in that unit and are so looking forward to our next visit.", "Date": "March 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“A Big Disappointment!”", "Author": "DGMNB", "ReviewID": "UR12399883", "Content": "The resort is old and rundown; it was supposed to have been upgraded two years ago. Obviously the owners do not want to invest the money. We had the misfortune of staying in their so called \"studio\" room which was smaller than a university dorm room. Small is an understatement for this room: there was no place to put our luggage, the appliances were old and cheap, the mattress, bedcovers and rugs should have been changed 10 years ago. There was a small table and two chairs pushed into the corner of the room, but inorder to sit at the table one person had to sit partly into the bathroom. The location of the resort was good and was close to some nice restaurants. The pool was small and not very inviting.", "Date": "January 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Indiana", "Title": "“Needs to be renovated”", "Author": "Travelsforcoffee", "ReviewID": "UR12202569", "Content": "This resort is in need of major updates and renovation. While we were there they were replacing some of the floors of the unit next to ours but not any of the furniture, which was old and dirty. THe beds were not very comfortable. We had a two bedroom lock-off unit that faced the pool and could see a bit of ocean if you leaned over the rail in one of the far corners of the lanai. In the front bedroom on the morning of the first day, there was a roach on the wall near the ceiling. We contacted the front desk and someone came up immediately to remove it. We didn't see anymore during the trip but yuk! The pool was nice but the weather was not nice enough for us to use it much as it was rainy and windy in Kahana most of our trip. (A vendor at the arts and crafts fair told us that Kahana is the \"cold\" side of the island). There was a beach across the street that was nice at the Sands of Kahana. However, it did rain quite a bit in Kahana so we went down to a toddler friendly beach about a mile away by the Farmer's Market--also good for snorkeling where it suprisingly was not raining. There was also a good beach in Lahaina (about 10 miles south) where the weather was always sunny and there was a very baby and kid friendly beach and many, many shops and restaurants. The good thing about Kahana Falls is the staff. Everyone was very nice and helpful. The Concierge---CIndy- was great! She even drove my parents down the street one day when it was raining so they didn't have to walk in the rain (my husband and I had the car).", "Date": "January 1, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Idaho", "Title": "“Stay Somewhere Else!”", "Author": "wonderfultotravel", "ReviewID": "UR12117686", "Content": "We stayed here for our 10-year anniversary as a RCI exchange. When we first checked in the person working at the front desk was so rude that it was shocking. She tried to make a copy of my driver's license and credit card on the copy machine when I wasn't watching. When I requested an explanation of why she needed that, the only thing she could come up with is that if we lost our keys we would have to show our ID to get a new one if we didn't let her keep the copy. I didn't feel comfortable with the situation and asked for the copy (would much rather show my ID if I lost my key). She crinkled it up and put in the trash (which doesn't take care of the problem). I asked her for the copy again and she said No, it's fine. I asked for a third time and she finally gave it to me and was VERY RUDE. I felt like she was trying to scam me. I travel a lot for work and pleasure and have never experienced such a rude check in or someone trying to make a copy of my driver's license. Needless to say, it wasn't a good first impression or a way to start out our vacation. The rudeness in which we encountered can't even be expressed here in words to do it justice.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great place to call home in Maui”", "Author": "4tobin", "ReviewID": "UR8509978", "Content": "I was leary about this resort from the comments I read here. I can't stress enough how wrong the reviews are. Kahana Falls was beautiful roomy clean and insect free. The staff was great and the grounds could not be more beautiful. We enjoyed a week in a one bedroom two bath lock off condo with a a beautiful view of the pool and obstructed view of the ocean. We would definitely stay here again, and are strongly considering purchasing here. With all the island of Maui has to offer the location of Kahana Falls could not be more convienient. Minutes from some of the best beaches and shopping on Maui. With Lahaina town a short drive down the road the dining options were endless. Kahana Falls is great for families, Friends, or granparents. If you have the chance we strongly suggest a visit. The Tobin Family", "Date": "August 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Gilbert, AZ", "Title": "“Do Not Stay Here!!!!!”", "Author": "TravelerGilbert_AZ", "ReviewID": "UR8071988", "Content": "Maui was beautiful.........but this was the worst place I have ever stayed in my life!!!!!!! Room was so small you have to go out in the hall to turn around. We got an upgrade and it was worse than the small room. We could hear the people above drop a spoon and just about every work they said. Terrible....I suggest they should close the place down!!!!!", "Date": "July 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Jose, Ca", "Title": "“If you like spacious rooms, seek another hotel.”", "Author": "ksilver105", "ReviewID": "UR7565321", "Content": "Perhaps the smallest hotel room I have stayed during my many years of travel. The only window was facing the breezeway in the hallway. No ocean, no garden view. Very disappointing. First time that I have ever lived in a dungeon for a week. Now I know how those enemy combatants feel like in Gitmo. Other than the room, the resort is adequate. Across the street from a beach, although not the nicest one around. Small pool and spa. Free Washer/Dryer for the guests a plus. Place is clean and staff friendly. Location is good near sights etc.", "Date": "May 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“A Dump”", "Author": "bogueplayer", "ReviewID": "UR7478124", "Content": "This is similar to a old Motel 6 or an OLD Super 8. Everything in my room needs to be changed. I can't beleive that they rated this as a 3 star resort. It is more like a 1 star. A complete and disgusting DUMP. Be Warned!", "Date": "April 28, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Crete, Illinois", "Title": "“Kahana Falls”", "Author": "TDSGOLF", "ReviewID": "UR6433053", "Content": "Kahana Falls -- December 12th 2006 We had the unfortunate luck to have to stay at one of the hotel rooms at the Kahana Falls Resort last week. By the time we booked our room these were the only rooms available, according to what they said. The only good thing about the resort that we could see was the staff are very polite and helpful. We asked about a posible upgrade to a larger room and were told that the upgraded room would cost $30.00 more a night and has a sofa bed as the sleeping accomodations! If you go to Kahana Falls make sure you have at least a decent size room.", "Date": "December 12, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Tucson, AZ", "Title": "“Badly In Need of Remodel”", "Author": "Wolf1955", "ReviewID": "UR6060679", "Content": "Returned to Kahana Falls in August 2006. We had stayed there in 2001 and thought it was a very nice resort. We had a 2-bedroom, 2-bathroom unit both times. This time, however, the units had an ant and a roach problem. The first time they sprayed automatically each week - not so this time, they just gave us a can of bug spray. The beds were horrible. They were thin, lumpy and very uncomfortable! The bathroom was run down and the countertops and cabinets were in very shabby condition. The entire unit needed a remodel and upgrade. They have lost their RCI Gold Crown rating, but are still advertising themselves as a luxury resort when they are worse at this time than a hotel. They need to make upgrades, especially with regard to the beds and linens, in order to keep people coming back! I was very disappointed this time! Definitely not what it used to be!!!", "Date": "November 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego, California", "Title": "“Very Relaxing!!”", "Author": "tbirdie1", "ReviewID": "UR5837013", "Content": "We stayed in a two-bedroom, two bath unit and it was very comfortable and exactly what we needed. I enjoyed this property very much. It is small and quiet. The two bedrooms are large, they have a full kitchen, dining room table, living room, with a spacious lanai (balcony) stackable washer/dryer, and two full bathrooms. The bedroom without a bath attached also had a kitchenette and the sofa in the living room has a pull out sleeper. We did not use this, but if you need it, it is there. The grounds were well kept and the fresh water pool was great (but small and a little cold) It was very tropical and the jacuzzi had a sand bottom- that was neat. We would love to return! Thank you Kahana Falls!!", "Date": "September 25, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "S[pokane, Wa", "Title": "“Lovely place to stay”", "Author": "ChattyKitty", "ReviewID": "UR5807842", "Content": "We were finally able to trade our RCI week for one in the Maui location we wanted but were only able to get the \"hotel room\" available. Reading some of the reviews made us very nervous about the size and lack of window so we were very pleased when we checked in. The room was very nice, large enough for two and the jacuzzi tub was a great bonus. We had a microwave, fridge and toaster and could warm up simple meals. The grounds are beautiful, landscaped and maintained very well. We always had a comfortable place to sit and especially liked to take a dip in the hot tub and pool at night with the tiki torches and lights creating a lovely atmosphere. There were places to bar-b-que and eat outdoors, great for those of us without a kitchen. Everyone around us seemed to be enjoying themselves. The staff was wonderful. The resort was small but so nice we are considering buying a unit on the resale market. Yes, not having a lanai or view did detract from the location but we were grateful to finally spend a wonderful week in Hawaii.", "Date": "September 16, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco", "Title": "“Worst hotel ever”", "Author": "eylchu", "ReviewID": "UR5730742", "Content": "This was the worst hotel experience in my life. We first booked a smaller one bedroom in the back but when we went to look at it, it reeked of bug spray and the room was tiny. I don't even know how they can call that a one bedroom. So we upgraded to a bigger one bedroom on the 3rd floor. The room is a nice size and that's about all I can say about it. We had a roach problem in the room -- we had a few crawling around the living room and one woke up my husband in bed as it crawled up his arm! Needless to say we were both very traumatized and would never stay here again. We spoke with the hotel but they said it was normal to have roaches since it was a tropical island. They were also in the process of spraying the entire complex during our stay. Needless to say the smell was offensive and uncomfortable. We've been to Maui and other islands many times without encountering a roach in our hotel! In addition to the roach problem, the furniture was old. The bathroom was also very old. And the facilities were all very small. The pool is barely bigger than a kid size pool. We will never stay here again.", "Date": "August 31, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "San Diego", "Title": "“Room is like a Dungeon”", "Author": "sinasohn", "ReviewID": "UR5562666", "Content": "Problems we encountered: 1. The \"hotel type\" unit was absolutey tiny and very dark with little to no light, especially as there was no window. There was one small window to a dark lobby. 2. The ceiling fan which was supposed to be fixed in 30 minutes didn't get fixed until the second day. 3. I saw ants in the room. 4. When that small window was open, you heard the loud sound in the room of what appeared to be a very old AC unit. 5. While the manager was professional in her concern for the guest, the night desk clerk who worked there was EXTREMELY rude and made we waste a lot of time very much ruining my vacation mode for a few hours. I was shocked at what he told me. 6. No patio or lanai to open up door to get some fresh air. Just closed off walls (e.g., the dungeon feeling). Not on the beach, but I did know this so it was not there fault. 7. Was disappointed that they had another room, a studio, that they would not allow me to use even though it was available. They did let me stay there for one night but I basically had to move mountains to make this happen. As a very experienced business and personal traveler, I believe good management would have made the room upgrade at no charge. They wanted to charge me $35 per day. 8. Toilet was not working properly as it would run. 9. Room in general, could definitely use a face lift (e.g., AC, television was very small, bathroom outdated, carpets) Positives: 1. I bought last minute over the internet and only paid $275 for the week. Otherwise I would have been extremely angry. I guess it once again proves, you get what you pay for. By the way, this is the first time I have ever written a review of a resort and I have stayed at a lot of places.", "Date": "August 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Small resort, but very nice!”", "Author": "shorty20", "ReviewID": "UR5492719", "Content": "My husband and I stayed at Kahana Falls for a week while on our honeymoon, and had a wonderful time. The resort is small, but very clean and well kept. The pool was warm, beautiful and very relaxing. I can not say enough about the front desk staff, one gentlemen in particular, who was very helpful. He gave us great advice on wonderful little places to eat and visit that we would never have found on our own. The room was small, but had everything we needed for a great stay. My only complaint was the slamming doors. Our neighbors left every morning at about 6am, and woke us because the doors do not catch themselves and close quietly. Other than that, I have no complaints. It was also close to restaurants, which was very nice. If you're looking for a 4 Seasons or Ritz Carlton type place, don't stay here, but if you want a low key relaxing vacation, I recommend Kahana Falls.", "Date": "July 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Canada", "Title": "“great little resort”", "Author": "A TripAdvisor Member", "ReviewID": "UR5458229", "Content": "Kahana Falls is a wonderful place to stay. It's quiet and relaxing and very friendly. If you're looking for a 5 star resort as in Hyatt or Westin.........this isn't it. Of course you won't be paying those prices either. The staff is friendly and helpful. The concierge are incredible.. very good, know their stuff. Betty, Kathleen and Jeremy are the best, they took care of us from start to finish. They told us that the price wouldn't be the cheapest .....but we got the best service and the best recommendations. You get what you pay for. The person who found a cheaper Helicopter tour probably got a cheaper helicopter tour. . The concierge recommend the best companies and then they offer great discounts on those. If you want to go with a cheaper tour......they will book it for you but..........don't complain later. Everything we did was top notch. Kahana Falls is a fun place to stay........we recommend it.", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Calgary, AB", "Title": "“Hotel unit”", "Author": "Stag88", "ReviewID": "UR5375297", "Content": "We traded 2 hotel weeks at Kahana Falls from June 1-8, and June 8-15. Both RCI and resort's websites warned us that the room is very small, 276 sq ft. Since we don't intend to stay in the room for too long, we confirmed the request. We don't usually cook while on vacation. A hotel room with light kitchen is good enough for us. The first week we stay in room 105B. The room is smaller than average hotel room. The bathroom is quite large with 2 basins. There is a microwave, an under-counter fridge, a small bar sink, and utensils enough for 2 people. The dining table is very tiny about 3 feet in diameter with 2 small chairs. When we pull out a chair, it blocks the entrance door. The window is facing the hallway. So we had to close the shutter most of the time. The resort is in a very convenient location. There is a public beach (Kahana Beach) access path immediately across the street, next to Sands of Kahana. Pohaku Beach is about 2-3 minutes walk. The second week we were assigned to room 605B. The front desk told us to pack everything and leave in 105B. They will move the luggage to 605B when it was available. The setup of 605B is identical to 105B. This unit has a good view of the mountain. Once again, the window faces the hallway. All hotel room units have no sitting area. If we wanted to watch TV, we had to sit on bed. The furniture layout plan in Kahana Falls' website is not in proportion that gave us a false impression. Our neighbor occupied a studio unit. By combining the studio and the hotel room, they form a one bedroom unit. The studio is quite roomy because it contains a pull out bed. It also has a lanai and a good size of dining table with 4 chairs, a full kitchen and a dishwasher. We donâ€™t mind to go back to Kahana Falls. If we have a choice, we would request a studio or a one bedroom unit. But a hotel room is just fine for us too.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "5", "Rooms": "2"}, "AuthorLocation": "Edmonton", "Title": "“Hotel Room - Very Small”", "Author": "sierrasue50", "ReviewID": "UR5356538", "Content": "We knew we were going to be in a very small room, but were taken aback when we walked in. It is SO TINY. The door when opened, hit the chair, and there was barely room between the bed and the kitchen to stand. And NO window. Well, that's not exactly true. The window was about 1.5 feet high, and 5 feet or so long, with shutters, but looked out onto the hallway by the parking lot. The bathroom was GREAT! Huge big jacuzzi tub, 2 sinks, and Lots of room!! All that being said, the grounds were beautiful, as stated by many others. Waterfalls cascading into the pools, and lots of lush gardens. Two Barbeques were available, and there were laundry facilities in a separate building. The concierge staff were very helpful - attended the welcome orientation meeting and booked a couple of activities. I called this \"room\" the Dungeon in Paradise. So, if you can get one of the larger rooms do so. But I'd still go back even if it was the only room available again.", "Date": "June 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Edmonton", "Title": "“Maui No Ka Oi”", "Author": "Kapulanikai", "ReviewID": "UR5035324", "Content": "Maui is the best and what makes partly makes it so is the Kahana Falls. A timeshare place that's a cut about the rest with a great staff, super accomodation, great grounds and a free form pool that while not big (in fact, tiny) is a joy to behold. If you're an architect then go to this place to see how many buildings can be squeezed into so little space and it doesn't look crowded. Be warned that there is no ocean view and there's a bit of noise from the constant plane traffic at the airport only a couple of blocks away but then you'll want to get in your rental car and drive down to where ten of the worl'ds best beaches are located south of Kihei and Wailea, particularily Makena (big and little) and Ulua beaches. Enjoy your trip to Kahana Falls and Maui.", "Date": "May 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Service": "4"}, "AuthorLocation": "Orlando, FL", "Title": "“Great, but beware of snoopy maids.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4998127", "Content": "What a wonderful resort this was. We stayed here 4/13/06-4/20/06. We we in the 2 bedroom/2 bath on the bottom level (Aloha tower) that had a great pool view. We didn't spend much time in our room, but it was a great place to sleep, shower and relax. We loved the sand bottomed jacuzzi and the pool which was surrounded by waterfalls. Paradise!! We participated in the free Hula workout but missed the lei making, boohoo. Our hula teacher invited us to watch her free show at the Ka'Anapali beach resort, it was fun. You recieve a mid week cleaning, they do the dishes, change sheets, more towels, ect. We also had to vacate one day for a few hours, ug, for the bug lady. We did have p--- ants in the bathrooms. Still saw some after the bug spray, no biggie. We live in Florida and are used to those critters. Our only complaint was that during two of our daily towel exchanges the maids help themselves to my Pineapple Wine in the fridge (I noticed two long black hairs closed in the cork, and my mother and I both have light blond hair) and they tried on my lip gloss (They blotted on a tissue and left it on the counter, and I have never blotted my lipstick in my life) and they tried on my mothers lotion in her bathroom. We notified the front desk and they are going to investigate which maids cleaned our room on those days. So to detour them the rest of our vacation I locked up my toiletries and jewelery in the safe and went ahead and finished my wine. Kathleen the concerge was so helpful. They cut you a small discount and help out with dinner reservations and activities. Mom left her a Thank you card. Overall we really loved our resort and location. JJust make sure you lock up your personal unless you want somebody snooping. Or better yet, just put the \"Do Not Disturb\" on the door.", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Reno, NV", "Title": "“AQuiet Beautiful piece of Paradise”", "Author": "A TripAdvisor Member", "ReviewID": "UR4578809", "Content": "We lived on Maui for several years and now take a yearly visit back to enjoy the island and friends. We love Kahana Falls. They are in the middle of a total renovation of the rooms and should be done by summer 2006. We stayed in the 2 bedroom lockout this time and it was perfect for 4 people. Its location in wonderful-walking to shopping and dining and a short drive to the large market. Lahaina and Kaanapali is just a few minutes by car. The complex is also very quiet and peaceful and the staff has been very accomodating and friendly. Can't believe another reviewer found the staff lacking. There is a small beach across the street--but get in your car and find the beautiful beachs all along the Maui coast. Just a short distance away is Napili with gorgeous sand beaches.", "Date": "March 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Greenwood, South Carolina", "Title": "“Great Base for Touring Maui”", "Author": "stayput", "ReviewID": "UR4311734", "Content": "Because of some of the negative reviews on here, I was very nervous about visiting Kahana Falls. It turned out that I was pleasantly surprised. The staff was friendly and efficient. We had a one bedroom unit with daily maid service. No bugs. There is public access to the beach across the street, and the beach is sand, not rocks. There is a great coffee shop within walking distance, as well as various other types of restaurants. The place is beautifully landscaped and the pool is small, but nice. I would definitely stay here again.", "Date": "December 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Warren, MI", "Title": "“Quick review of the Kahana Falls Resort”", "Author": "A TripAdvisor Member", "ReviewID": "UR3941529", "Content": "My wife and I stayed in the Kahana Falls resort for 8 days and 7 nights at the end of August, 2005. The only reason why Iâ€™m writing this review is because before our trip to Maui I read reviews that scared me. I have read reviews stating that there are bugs in the rooms, I can tell you honestly that our 2 bedroom, 2 bathroom, living room, dining room and kitchen were very very clean (NO BUGS, someone had to been very unlucky or dirty). We stayed on the second floor just above the waterfall, our balcony was overlooking the pool which was very nice and we could see a little bit of the ocean far away. Number one thing that is a must in maui is a car. Without a car you are stuck, there are not a lot of things to do in Kahana (Lahaina). If you had a car you could drive 15 minutes to a near by city (i don't remember the name sorry) there are lots of activities and shopping there. The resort is not very big but its CLEAN. The people who work there are nice. The workers who sit in the main lobby and are supposed to find the best deals on activities for you, in my suggestion don't find the best deals. If you look around i guarantee youâ€™ll find better deals then what they are offering (We did, $150 cheaper for a helicopter ride by the same company). If you like to hike, I suggest you buy a guidebook. I bought a book called Maui Revealed, which talked about many hidden trails that lead to water blowholes, waterfalls, swinging bridges, to zip lining through the jungle that normally you wouldnâ€™t find. Ohh yeah grab a good pair of hiking shoes. We did everything from scuba diving to parasailing (Great Times!!!). We had a great time and would definitely go back! Check out the pictures i took of the resort. Enjoy your stay. I would be happy to answer any questions you might have via e-mail. Please make the subject: Maui questions, otherwise I won't open the email. Thank you !", "Date": "September 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Kahana Falls a LET DOWN !”", "Author": "bellavita1", "ReviewID": "UR3934998", "Content": "Kahana Falls Resort is NOT a resort, but an OK hotel with very, very nice (but small grounds, with a very, very small pool). There's nothing to do there and it is a far drive from anywhere. You are neither on a beach (but you do have a great view of the hotel across the street -- :( nor is the closest beach even swimmable, since it is all ROCKS! The front desk and the concierge/activity director were both cold and aloof and arrogant. The only good thing was the cleaning staff! We would not recommend this resort. Unbelievable that RCI considers this a Gold Crown timeshare resort. Just unbelievable!", "Date": "September 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London England", "Title": "“Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR3612474", "Content": "Just arrived home from Kahana Falls to England and had a fantastic holiday. Kahana Falls is a quiet hotel but very nice, the accomodation is spacious and very clean. Pool area has a small pool but is compensated by lovely waterfalls, very relaxing place to stay. The whole place is lovely and clean and well kept with beautiful landscape. Staff are very nice and always happy to help. Every room overlooks the the pool. Good location for getting around. Car a must. Will defiently go back to Kahana Falls.", "Date": "June 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Orange County, California", "Title": "“Maui Fun”", "Author": "wschaaf", "ReviewID": "UR3482153", "Content": "Stayed at Kahana Falls early May this year. Best thing about Kahana is the free-form pool and spa area. This area is very nicely landscaped, looks very natural. Easy to relax there. We stayed in a 2 bedroon, 2 bath unit in the Falls building. The Falls building faces towards the ocean, and on the 4th floor you get sort of a view of the water between two other resort buildings. The entire grounds are very well kept up. The rooms are acceptable in size, but to get a two bedroom, you get the one bedroom lock out studio along with the full one bedroom unit. The small studio has a bath and small kitchen area w/coffee maker, microwave, and small refridge. I would be hard pressed to spend an entire week in this small area. No view through small windows overlooking parking lot. Staff is very pleasant. On-site activity center was convienent, and offer discounts to most activites. Walking distance up the street are at least two good restaurants (Roys and Outback), along with a Shell station and McDonalds. Lahaina is a short 10 minute drive from Kahana. Would stay there again.", "Date": "May 18, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Little Rock", "Title": "“Great Place!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3274339", "Content": "After reading several reviews I was interested to see what this was really like. So, I was pleasantly surprised to find Kahana Falls was, indeed, a Gold Crown Resort. Now, if you are looking for a large, activity driven, resort then Kahana Falls is not for you. It is small but it is very restful and a wonderful place to stay. For those who stayed in a \"hotel room\" I would agree that the rooms are very small. We stayed in a 2 bedroom condo and it was plenty spacious. There was a large living area with a hide-a-bed couch. There were one very nice sized bedroom (with bath) that would be the master. The smaller bedroom could be locked off and was what someone would have if they just had the \"hotel room.\" The pool is small but very pleasant. The sand bottom hot tubs (two of them) were very nice. I have found that you usually find the kind of people that you are looking for. I found the staff to be very helpful and very gracious. They seemed genuinely pleased that we were there and wanted to make our stay comfortable. To tell you the truth, I found it to have much more of a local feel than a resort feel. It's all in what you are looking for. If you are looking for an amusement park environment then you need to go somewhere else. If you are looking for a nice, quiet, restful piece of Maui....this place may be for you. It was great and we will go back!", "Date": "March 15, 2005"}], "HotelInfo": {"Name": "Kahana Falls", "HotelURL": "/ShowUserReviews-g60634-d260244-Reviews-Kahana_Falls-Lahaina_Maui_Hawaii.html", "Price": "$99 - $129*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4260 Lower Honoapiilana Rd</span>, <span class=\"locality\"><span property=\"v:locality\">Lahaina</span>, Maui, <span property=\"v:region\">HI</span> <span property=\"v:postal-code\">96761</span></span> </span> </span> </address>", "HotelID": "260244", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/08/59/0859f0493bc38afae5108eaeba84d3f71large.jpg"}}