{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Its cheap for a reason”", "Author": "basil07", "ReviewID": "UR96883163", "Content": "Very small dingy room, it stank of smoke and had the smallest most uncomfortable bed I have ever slept in. Unless you are on a seriously small budget or its the last place left in town I would avoid it.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“here you can not sleep well”", "Author": "Goscha", "ReviewID": "UR86956173", "Content": "We stayed at hotel Europe at the beginning of November. The hotel has good location, it’s not expensive. Room was quite simple, but clean. Towels were changed every day. WC and Shower are on the floor for joint use, but there are sink and mirror in the room. Windows face narrow street, and you can see, what is going on at opposite house, don’t forget to close your curtain, if you are not exhibitionist. In the lobby there are 2 pc with internet connection. At night it was noisy. One can hear everything, what happens in corridor and in the street. I think, this hotel is more oriented to young people and backpackers, because judging by the noise many people came back to hotel after 12 p.m. and we saw only youth in corridor. If you have sensible sleep and want to sleep well, it’s not your place.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Cheap stay in the center of the city”", "Author": "comnen", "ReviewID": "UR86823290", "Content": "Simple, but cheap hostel in the very heart of Barcelona. Location is the advantage. The drawbacks are noise in the night that is heard as if it happens in your room (very thin walls!). They have 2 computers for free use (mice and keyboard are dirty and old; to type something is a challenge!). We stayed there 3 nights in a triple room. One of them was really terrible – new guests arrived in the midnight and we could hear everyting. They change towels everyday, all was pretty clean.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ghent, Belgium", "Title": "“best price/quality and location if you don't want to spend fortunes”", "Author": "belgicos", "ReviewID": "UR75443260", "Content": "we been here in july, after staying there in february for the first time.. My girlfriend doesn't like the paintjob on the walls, looks like something brown and yellow mixed up on the walls :) but u can be sure, it's paint! The location is perfect if u like going to bars, restaurants, shops or the rambla.. and if u like to stay in the heart of barcelona and so u don't need to take any taxi or metro at night .U can't get any closer to the center than this for the same price. Always clean btw. Just so u know, don't expect design-furniture! No-nonsense in this hostal. I recommend it for young couples especially!", "Date": "August 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "far far away", "Title": "“AVOID!”", "Author": "bashoFarFarAway", "ReviewID": "UR30284987", "Content": "Unless you are a movie director seeking dingy locations for a sordid crime thriller, it might be best to avoid this one. The staff were friendly but the room menacing. My innocent family were hoping for somewhere cheap and cheerful right in the historic centre but, fooled by a grainy photo of the exterior on a hotel web site, booked this one, cheapish and depressing. The owner of this establishment ought not to be rewarded with your hard-earned funds. Lying, sleepless on that bed, staring at the crazed texture of the walls and ceiling, I was drawn to imagine the tragedy of life in a 19th century lunatic asylum. Surprisingly, there were no cockroaches.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Adelaide, South Australia", "Title": "“Like a shack”", "Author": "Yerac", "ReviewID": "UR17091746", "Content": "We arrived in Barcelona without a booking on the May Day long weekend when half of Spain was there! We feared the worst as I had read some poor reviews of Europa. Overall we ended up happy with our stay and we would probably be happy to go there again. It is slightly cheaper. It has a tiny elevator and not too many stairs to the entrance which is great if you have a lot luggage. The rooms reminded of staying in a very basic beach shack and it is a bit of a maze to get around. The walls are thin and the plumbing is noisy so you are relying on your fellow guests for an undisturbed nights sleep. We used the share bathrooms and they were fine, clean and plenty of hot water. The location is superb right near Ramblas and the old city as well as the market and a subway stop. Furthermore there is a lot of accommodation around if you don't like the look of it.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“New Year In the best city in the world”", "Author": "webster34", "ReviewID": "UR12307646", "Content": "Just returned from the best 4 days of our lives. Due to structural problems at another hostel we were moved here at short notice. 10 of us stayed between 31/12/07 until today 3/1/08.We had preconceptions about EUROPA but to be honest with you we were not that bothered. Okay it's not luxury (far from). We had a mixture of en suite and communal bathrooms so we experienced both. The rooms were quite sparse but everything needed to pass the time when you were not soaking up the fantastic, fun, friendly atmosphere and believe me that time was short. The communal bathrooms were spotless and always kept spotless, as was the entire hostel. It was 24hr reception so the place was always secure and the staff always seemed willing to help. We've stayed at hotels all over the world and as you know you get what you pay for so remember that when you book here. All in all we paid around £150 each for 4 days in Barcelona getting there on new years eve morning and then experiencing one of the most amazing sites. (Approx. 70 thousand people rammed into Placa de Catalunya PEACEFULLY Letting in the new year). Centrally located in the best city in the world. DO IT and don't forget to visit SCOBIES IRISH BAR. For a top night", "Date": "January 3, 2008"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "England", "Title": "“Ewwwww/desperation only!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3549724", "Content": "Errr, if you're desperate or beyond desperate then this place is ideal! To be fair we were so it was a place to lay our heads...I checked out a few of the rooms and they all have the same dingy/dark/slightly stale and smelly vibe. Our room was as I can only imagine an asylum cell. It was clean though. And the shared bathrooms were VERY clean too. But no hot water, towels were envelope size..mm about A4 and sandpaper like in quality. It wasnt too noisy and is in a great area and handy in that respect. Our room also was internal so the windows opened into the internal courtyard...aromas from the toilet outlet pipes were a bit rancid. The staff were friendly enough, other residents variable. And they lent us a fan so we could have some air given we had to have the windows shut cos of the stench. It is somewhere handy to stay but only that...shame but desperate so greatful.", "Date": "June 13, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "The Netherlands", "Title": "“maze”", "Author": "A TripAdvisor Member", "ReviewID": "UR1385240", "Content": "I stayed there for a week with school, and I thought it was just fine, it's right in the middle of town, just of the Ramblas, perfect! Nothing fancy but it's clean, and for a good price. Just be careful you don't get lost in all the halls...=)", "Date": "October 12, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "UK", "Title": "“Dark and Dingy”", "Author": "A TripAdvisor Member", "ReviewID": "UR983273", "Content": "I stayed here and found the price to be reasonable ideal for students, backpackers and people on a budget. The rooms are dark and gloomy and shabby though so confort is not a priority. Basically you get what you pay for. I found it to be a good cheap place to lay your head down and the location is perfect.", "Date": "April 26, 2003"}], "HotelInfo": {"Name": "Pension Europa", "HotelURL": "/ShowUserReviews-g187497-d260794-Reviews-Pension_Europa-Barcelona_Catalonia.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">18 Carrer de la Boqueria</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "260794", "ImgURL": ""}}