{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't be fooled, the cheaper rooms are VERY basic.”", "Author": "PhilWhoTravels", "ReviewID": "UR119898505", "Content": "Our cheap room turned out to be a smoker's room. We unded up paying much more for something decent. Very unfriendly management ruined our Berlin-trip.", "Date": "October 30, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not recommended, we won't be going back!”", "Author": "Mon100", "ReviewID": "UR114247851", "Content": "When my partner and I first arrived to our room, we were quite surprised. It was unlike the pictures that were presented on the internet. It was also extremely, extremely small (just fitting 2 single beds) and it stunk of cigarette smoke. Each night we had exteremly noisey neighbours until 3am and when we complained to reception the woman simply shrugged her shoulders and said there was nothing she could do. This we thought was extremely poor service. Our room was shared bathroom facilites which more often than not were found filthy. I don't feel the need to go into 'filthy' I'm sure you can picture it. When returning to our room one afternoon we found it had been 'made up' but the towels were damp! Whether they were our used towels re-folded up of simply towels that hadn't been dried properly we're not sure. Another morning after breakfast my partner enquired about hiring bikes (as stated in the hotel room book) and the woman on reception said she was too busy, that she was the only one on reception until lunch time and so he could come back then but otherwise there were plenty of place on the street to hire bikes (which there weren't on the street the hotel was on). Breakfast was quite good, but we had to chase the staff down receive coffee or tea which became annoying each morning. I enquired about a late check out (2 hours later because that was when we had to leave for a flight) again it stated in the hotel room book you could ask for one however the same woman at reception throughout our stay said an immediate no, without even checking if there was another booking after us. Mind you we were leaving mid week. Other annoying things about the room were that it was quite noisey being close to a busy road, there isn't a working lift, so many flights of stairs and the TV switched itself off after a short amount of time. Overall we would not recommend it. We were not made welcome what-so-ever. Instead we were made to feel very unwelcome and of an inconvenience. We seemed to be the only westeners staying in the hotel that didn't speak German and as a result we felt that staff weren't interested in helping us in anyway and didn't value our business.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bydgoszcz, Poland", "Title": "“Not too expensive and very comfortable”", "Author": "Rafal_G_11", "ReviewID": "UR98907935", "Content": "Good service, hospitable. Large and very clean rooms, comfortable bathroom. Very good location, 7 min to metro stations Hallesches Tor and Mockerbrucke. Bus stop near front door of the hotel. Good breakfast. Cheap parkingplace.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“The hit in the bull's eye”", "Author": "HappyTheMan", "ReviewID": "UR80452230", "Content": "I stayed with my wife in the hotel from Satruday until Tuesday. The hotel is just 10 minutes walk from Potsdamer Platz (Also buss M41 drives there), Checkpoint Charlie and Niederkircherstrasse, where a piece of the Berlin Wall still stands next to the Topography of Terror. All the main attractions of the city is in your palm. Further, the a train takes you in 30 minutes to Potsdam. The hotel itself locates at the end of Stresemannstrasse next to Willy Bandt House. It evidently has gone through a renovation lately, as everything seemed to be just painted and clean. Breakfasts were nice and sufficient in breakfast room on the first floor. If I want to warn is the steep staircase, and as such those handicapped want to stay here must ask the ground floor suites.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Farmington Hills, Michigan", "Title": "“Good place”", "Author": "mtaiwai", "ReviewID": "UR63142495", "Content": "The hotel is like 5-10 minutes walk away from Anhalter bahnhof. and in front of the hotel you have a bus stop that takes you to Berlin Hbf.. I'd say this place is strategic. The breakfast is fantastic. The room rate is a bit on the high side though.. Other than that, the room is fine.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Kenya", "Title": "“Good value for money”", "Author": "Bayonic_Frog", "ReviewID": "UR26781677", "Content": "Nice little hotel, the staff are very helpful. It is also very quiet and centrally situated. Free WI FI is a plus.", "Date": "March 25, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Great Hotel !”", "Author": "GoldenPooch", "ReviewID": "UR10269562", "Content": "This is the second time I stayed at the Anhalter Bahnhof. I am even more satisfied than the first time. It is not a 4-star, and it doesn't have a lift, but it is very clean, nicely appointed, everything worked as it should, the bathrooms were very nice, the amenities adequate or better, and the location is great. The location is on a quiet - very quiet street. Little traffic to worry about. There are a couple restaurants and cafes within 2 blocks. It is also very well-connected to public transport. There are S- and U-Bahn stations within a three-minute walk. And the best part ... only 88 Euros a night!!!!!!!!! In the heart of Berlin. Definitely recommended for most people, excepting those seeking the 4-star experience.", "Date": "October 23, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Wexford, Ireland", "Title": "“A bit away from the main areas but good value”", "Author": "blueyedpuss", "ReviewID": "UR6811124", "Content": "My partner and I are just back from a 3-night stay at this hotel. The hotel is approx. 10-minute walk from the Anhalter Bahnhof station, which is one stop from Potsdamer Platz. It is situated in a quiet residential area. The hallway and the stairs of the building reminded me of the old hospital in my home town, there are locked doors off this hallway leading to corridors where the rooms are. The reception is on the first floor. This hallway is the only area that's a bit grim. However, the reception was much more comfortable, warm and inviting. The breakfast room is just off reception. Reception staff are very friendly and helpful. As we had an early morning flight, our room wasn't ready when we arrived, so we left our bags and set out for the city. When we returned about 5pm, we collected our room key and bags and made our way to our room, back down the stairs and through the locked door onto the corridor where our room was. The room itself was quite big, with a split king sized bed and individual duvets, a spare single bed, wardrobe, table, mini-bar and sat TV. The en-suite, although a little small appeared to have a reasonably new suite. Everything although not luxurious was spotless. My only little niggle about the room was it took ages for the hot water to run through the shower but its an old building, run the shower and by the time you've brushed your teeth it will be fine!! Breakfast was a simple affair, meats, cheese and bread, but despite the small selection there was plenty of it and the platters were refreshed regularly. There was also a thermos pot of coffee on each table. Overall I would recommend this two star hotel as it is good value for money - we paid €95 for the two of us, per night.", "Date": "February 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Virginia", "Title": "“Very nice”", "Author": "Mikebebop", "ReviewID": "UR5651635", "Content": "Very nice hotel for the price, however the service was a bit brusque. Earlier reviews panned the breakfast, but things have changed (photo attached). Nice spread with coffee, tea, various juices, eggs (hard boiled), various lunch meats, cheeses, breads, and cereals. All food was fresh and continuously replenished. At 40 Euros a day for a very small single, it was exactly what I wanted. Great location.", "Date": "August 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Cheshire,England", "Title": "“everything we wanted and more than expected”", "Author": "DaveSpencer32", "ReviewID": "UR5047994", "Content": "We stayed at the suite horel during a mini heatwave at the start of May, booked after great reviews on trip advisor. My wife has a disability so they gave us one of several disabled rooms, great space, quiet location at rear, very clean, friendly helpful staff, large bathroom. The bed is very firm but certainly not poor quality as suggested in one review, a supervisor called to make sure we were happy with standard of housekeeping. Only a croissant ( no butter etc) and cup of tea/ coffee is included for breakfast. You can make your own drinks and there is a microwave, use the Aldi around corner the other to right then left is horrific. The Italian restaurant tried to rip us off, the hotel denied it had anything to do with them but I doubt this is true, it certainly appears in the publicity in the room. That was the only minus point, a bargain price just over £30 a night in a capital, good nights sleep, I'd tell them to get rid of paper cup though. Still foir someone who hates Accor hotels this one is a gem. The S Bahn metro is a few yards away and diabled access via lift, also bus to Zoo goes from the road outside hotel. Everything you could want is within a couple of metro stops.", "Date": "May 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "usa", "Title": "“Good hotel, excellent price, wonderful location”", "Author": "xxrrttyy", "ReviewID": "UR4825824", "Content": "For those interested in luxury, this is not the hotel for you. When I booked it, the ad I saw indicated that the hotel was \"nice, cheap, in the heart of Berlin\". It was all those things. I paid 40 Euros a night for a single!! This hotel offers basic acomodation - nothing fancy - but if you're looking for a place to sleep while exploring Berlin from a base that is central to everything, this hotel is ideal. Located on Stressemannstrasse, which is a wonderfully quiet street, very little noise or traffic. It is 10-15 minutes walk from many sites. The staff was helpful and polite and spoke excellent English. My room did not have an en suite bathroom, that was down the hall, and the furnishings were bare-bones, but again, where else to find a decent hotel downtown for the price? I would stay there again, particularly if I were on a budget.", "Date": "April 1, 2006"}], "HotelInfo": {"Name": "Hotel Am Anhalter Bahnhof", "HotelURL": "/ShowUserReviews-g187323-d260886-Reviews-Hotel_Am_Anhalter_Bahnhof-Berlin.html", "Price": "$79 - $158*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Stresemannstrasse 36</span>, <span class=\"locality\"><span property=\"v:postal-code\">10963</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "260886", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6a/e9/6ae9fd281eab64e2657d24353e6f8dc51large.jpg"}}