{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Do not expect much, but consider it on a budget”", "Author": "Mala F", "ReviewID": "UR125145558", "Content": "We originally booked a twin room in Ivy house hotel ( several of this hotels in the same street), but at arrival we asked for a double room, so they gave us one in Alexander House. Reading many of the reviews about London budget hotels, you are aware you are going to get a tiny room. I couldn't imagine such a small bathroom, though. We went there last week (so, February) and it was really worm in the room, which I liked very much, since I'm cold almost all the time :) Room needs a lot of ,,refreshment''-walls had stains, doors and windows are in poor condition, but I must admit it was clean. We got clean towels and soaps every day, bed sheets were clean and so was the bathroom. It is small and old, but it was clean! Breakfast was a great start for the day, a little bit of toast, butter, jam, cerials, juice...I mean-what would you expect for that price?! The best thing about this hotel is location. Very near to Victoria station, from where you have 3 metro lines (Victoria, District and Central) and station of Gatwick express. There are several ok restaurants/pubs, it will keep you full untill you get to know the area. You can even walk to some locations. Noise-I heard a little bit of trains first night, but I was so tired it didn't bother me. If you hear them, that means you didn't walk around London enough! :D I would recommend it for younger travelers and for a good place just to come back at the evening to go to sleep. For that it is really ok, considering the price.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“cheap but adequate for overnight stay”", "Author": "NINOKAZ", "ReviewID": "UR122720759", "Content": "I stay in this hotel when in London on business. It is is central. It is clean and warm in the winter. Thought the price reflects what you get in London. It is part of a chain of hotels in the same Road behind Victoria Station but at the end of the Rd is a great pub with good pub food,", "Date": "January 7, 2012"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Merida, Mexico", "Title": "“Its better to stay away”", "Author": "EnriqueLP", "ReviewID": "UR117231851", "Content": "ANNEXE HOTEL, ALEXANDER HOTEL AND HOLLY HOUSE ARE the same hotel, same owners. Stay away. The rooms are very very small, the beds are small, the toilets are microspic, rooms are very noisy besides Victoria Station. The trains seems to pass through the rooms...it is very noisy ! The only good thing maybe is the location. I was 3 days and I changed from one hotel to the other to check if I coud get something better, but 3 hotels are the same worst thing.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Like a Scene from National Lampoon's European Vacation”", "Author": "MataKari", "ReviewID": "UR14310854", "Content": "This place is THE reality check for budget travelers in London. The Dollar to Pound exchange rate is abysmal, so if you are too proud to bunk down in a hostel, be prepared to budget more or you will end up in some place just like this. The room was cramped, like a closet with a bed shoved in, with worn carpeting and an unrelenting musty smell. The private bath is squeezed into what must have been the coat closet, so compact that while sitting on the toilet I could rest one elbow in the sink and the other against the shower wall. We slept fine the first night, being jetlagged from our first day after a transcontinental flight, but the second night was a doozy due to the constant noise from Victoria Station trains running right below our window. On the plus side, this place is an easy walk from Victoria Station.... Do not confuse this hotel with the Alexander House Hotel in Sussex, a 4-star luxury hotel and spa. At the time of my review, the tripadvisor site links to THEIR photo page instead, which is infinitely more glamorous.", "Date": "March 16, 2008"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Texas", "Title": "“BRING BUG SPRAY!!!!”", "Author": "pink_pony", "ReviewID": "UR3452323", "Content": "This hotel ia horid. When we first walked in the door it was horrible the loby was nasty that smelled like waste. The desk people stole my credit card and put charges on it. The room had no room exept for the bed and the bathroom had a showerhead exept it was in the wall and a drain. The toliet didn't work so if we had to go to the bathroom we had to go by the nearby resturant. The curtains had stains on them. We found a rat behind the bed and the heater didn't work. We found a leech in our bead along with a cockrach.", "Date": "May 9, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Chrstchurch New Zealand", "Title": "“CHEAP AND CENTRAL”", "Author": "A TripAdvisor Member", "ReviewID": "UR3293306", "Content": "Cheap accommodation within a stone's throw of Victoria Station. Very friendly helpful staff although not all proficient in English. Street is quiet and rooms just adequate. But it is budget accommodation and you get what you pay for. I have stayed twice in 2004 and would use again.", "Date": "March 22, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ely, East Anglia, UK", "Title": "“Not what I booked”", "Author": "A TripAdvisor Member", "ReviewID": "UR2794199", "Content": "Booked on-line. I wanted a cheap overnight stopover with full breakfast. As many others have found, the room I booked was not in the building I was shown to (the owner owns 5 or 6 buildings adjoining one another). If they made clear that this was the case and that alternative accomodation i.e. not a specific room in a specific hotel, the feeling of unease might not occur. The single room became a three bed (single and a bunk) room with bathroom. I fortunately wasn't spending much time in the room as it was TINY, dark and very cramped. It also backed onto a railway line that was fairly busy and the rooms are not exactly soundproofed. A basic clour TV, kettle and tea/coffee are available in rooms. The bed linen was clean as was the room although spartan. The full breakfast consisted of fruit cordial, instant coffee, cereal and toast with a selection of jams. Hardly a full breakfast but adequate - why not just say continental as that is closer to the truth? All in all not a disaster, but not accurate in terms of the advertising blurb.", "Date": "October 29, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Orchard , Singapore", "Title": "“we were cheated”", "Author": "A TripAdvisor Member", "ReviewID": "UR1762242", "Content": "Me & my husband just came back from our vacation in london. We booked one nite stay in a double basic room and 4 nites stay in the double en-suite room. I stood in disbelief when I saw the the double basic room. It was right at the top of the bldg. It was so small & cramped. There was not enough space to even put our bags in. The room had been partitioned with wood, therefore we could hear everybody else' conversation & bedroom lambada the whole nite. I thought the nightmare would end when we were to move to the double en-suite room. I was very dissapointed as the room had a double decker bed & a single bed. There was barely enough space to move about. And the room was facing the railway tracks & it gets quite noisy. Overall, I would never go there again & my advice to anybody is you gotta spend a bit more if you wanna have a comfortable vacation.", "Date": "April 3, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "bilbao", "Title": "“be careful! don't book it”", "Author": "A TripAdvisor Member", "ReviewID": "UR1726052", "Content": "having reserved one month before they took us to another hotel they owed and tried to make us both sleep in an individual one, same price. but that's not all! what an individual. Dirty, unclean, and tiny! no way 2 people could sleep there and I swear I've been camping all my life and even slept in bus stations and so but...", "Date": "March 15, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Austin,Texas", "Title": "“lesson learned”", "Author": "A TripAdvisor Member", "ReviewID": "UR1375965", "Content": "Reserved a double room @ Alexander House Hotel on Hugh Street in advance and after arriving in London found out the owners owned 5 Hotels on Hugh Street and we were shown to a different hotel than the one we reserved. The BB's are clean(looked at 3 of them) but very small, dark, and cramped spaces. If you are looking for low cost (50 pounds per night) and don't mind cramped, dark spaces, this is the place. We found another place to stay for our trip on the day we arrived. I will do beter research and ask more pertinent questions the next time I reserve.Austin,Texas", "Date": "October 5, 2003"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "West Lafayette, IN", "Title": "“At these prices, expect hostel-like accommodations”", "Author": "A TripAdvisor Member", "ReviewID": "UR1257647", "Content": "If you pay as little as 40 pounds for a bed in London, don't expect much! The B&B's on Hugh Street are all very similar; same layouts and basement dining rooms where breakfast is served. The basement rooms were musty and not always well vacuumed. Reminded me of a hostel. If you don't mind that, then perhaps this block of hotels will suit you fine.", "Date": "August 23, 2003"}], "HotelInfo": {"Name": "Alexander House Hotel", "HotelURL": "/ShowUserReviews-g186338-d261727-Reviews-Alexander_House_Hotel-London_England.html", "Price": "$56 - $190*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">32 Hugh Street</span> | <span class=\"extended-address\">Victoria</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW1V 1RP</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "261727", "ImgURL": "http://www.venere.com/img/hotel/1/5/9/2/62951/62951.jpg"}}