{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Travelodge - what a difference a year makes....”", "Author": "fatzandfamily", "ReviewID": "UR126443863", "Content": "We last stayed in this hotel a year ago, using it as a base to get into London for a weekend of sightseeing. The hotel was a little disappointing, poor cleanliness and frankly a bit depressing. What a difference a year makes - don't know if there has been a change of management but it was a much friendlier, more comfortable place to stay this year. Room was very clean - still the decor was a bit shabby, but I expect Travelodge rooms get a hard life. The public areas were also very clean and tidy and the breakfast was very good. We had breakfast in the hotel and the children ate free. As much as you like, good hot food, wide selection of cereals and even fairly decent coffee from a machine. Good value for money. A much nicer place to stay this year and parking tip - the Travelodge website is not that clear. 24hrs parking is £5, after 15.00hrs it is £3.00 until 12.00hrs the next day. I didn't think £5 for all day parking was too bad.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value”", "Author": "XRayD0c", "ReviewID": "UR126144331", "Content": "The room and bathroom were very clean. There was a problem throughout the 2 days of my stay that the ventilation in the bathroom was not working - i.e. you always had to open a window. The main reason for 3 star rating is that the mattress was very soft and saggy. The fried breakfast had a limited choice, but was of good quality.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lincoln, England, United Kingdom", "Title": "“I was delighted with my stay”", "Author": "Helen S", "ReviewID": "UR125941911", "Content": "at Kew Bridge travelodge. I was looking for somewhere cheap to stay overnight, near to Kew Gardens, and wasn't expecting much, to be honest. I was very pleasantly surprised. The room was clean and spacious, and the staff extremely friendly. I loved that I was able to take my meal up to my room to eat, as I was staying there alone. The other facilities were great. My room was very quiet and I hardly heard the other guests.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wales", "Title": "“Happy with hotel except for the Bed”", "Author": "meinir", "ReviewID": "UR125664143", "Content": "Stayed here for one night - was happy with the basic room as you would expect from a travel lodge - except for the bed. Had a very poor night sleep as the mattress was very uncomfortable and sagging in middle. The staff were very friendly and helpful. Breakfast was passable.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“very comfortable stay”", "Author": "izzy96", "ReviewID": "UR125487420", "Content": "from kingscross -tube to south ealiing, no 65 bus across road from station and straight to the steps of this travelodge. Initally i was given a room on the ground floor (near the cafe) road noise was obvious, but could have lived with it, however turning on the TV there was a loud booming noise which made it unbearable. Went to reception and had no difficulty in being given another room, still on the ground floor but on the opposite side. The difference was like night and day, no street noise at all. The booming noise from the TV appears to be reception difficulties and only affected ITV (was not there to spend all my time watching TV so not a problem). Room and bathroom was typical travelodge, clean and spacious, the shower was brilliant, the bed was comfortable. Plenty of towels which were replaced everyday, as was the biscuits (also stayed at a best western where biscuits were not replaced at all) , Breakfast was good no issues apart from thier useless toaster which takes for ever and you could see how this would be a problem if they were busy, Ordered one evening meal which was disgusting - chips looked like reheats, puff pastry was brick hard and filling looked congealed, no problems in refusing it and getting money back. Wi-fi in the room is expensive but no problems using it for free in the public areas. Overall a very good stay, the staff were very friendly and apart from the evening meal i would recommend this place to anyone.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pontypridd, United Kingdom", "Title": "“Cheap, but does what it says on the tin”", "Author": "algorithmandblues", "ReviewID": "UR125442128", "Content": "Stayed here for the 2012 Carling Cup Final. Booked room a month in advance so only paid Â£19. Wasn't expecting much and was happy with that, the idea was get to London, drop all of our belongings in the room and go watch the match, couple of drinks afterwards and come back to the room just in time to fall asleep. Staff member at the desk was very helpful on our arrival and gave directions to the nearest tube station. Hotel room could do with a lick of paint but it wasn't terrible. Probably could have done with more than one cushion each, but this is only a minor point.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scunthorpe, United Kingdom", "Title": "“hotel ok for short stays only nothing special”", "Author": "gary047", "ReviewID": "UR125193972", "Content": "room was clean but nothing special,evening meal was ok and what was expected but not sparkling,breakfast can only be described as caos really all you can eats a bit of a joke. on the supply issue could not keep up with the demand it was not really busy so if it was then be prepared for a long wait thats if it comes at all shame really because it could have being good value.two small toasters was very poor with large ques forming. travellodge have a long way to go am afraid compared to premier hotels chains i have visited pay a bit extra and get better service thats my view.", "Date": "February 25, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“I'm not a complainer, but.....”", "Author": "bkb01", "ReviewID": "UR125037148", "Content": "Stayed here for 2 nights last weekend, reception was friendly and helpful and accomodated my request for a riverside view room. After waiting (having paid for an early check in) we were given a room on the top floor that smelt dreadfully and it was clear it had been recenly sprayed with a chemical air freshner to disguise the smell. The bedroom bathroom dividing wall was filthy and an attempt to clean it made it all the more worse. It looked as if someone had cleaned it with a floor mop from 20 paces away!!!! Consequently when lying on that particular side of the bed you were faced with an unattractive sight. Before leaving late afternoon on the first day I spoke to the reception staff and asked to be moved to another room the following day and my request was logged to be dealt with by day staff in the morning. Having left the window open all evening and throughout the night, the room smelt fresher and as a result rescinded my request for another room the following day but asked that the wall be cleaned properly (I also asked that chipped cup to be replaced). Neither were these 2 requests met and as result on checkout the following day, I requested some recompense. I was told that the manager was unavailable and a message would be given for him/her to call me later that day to discuss my request. I'm still waiting for that call ............................................................................................................................................................................................................................................................................................................................................................................................", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, England", "Title": "“Close, Clean & Convenient”", "Author": "JohnWB1", "ReviewID": "UR124914642", "Content": "Used as a base to visit Kew Gardens. The hotel was easy to reach and there was convenient parking very close by. Some nice restaurants in the wharf area, about 5 minutes walk away. We went to an excellent Persian restaurant at the Old Fire Station. The hotel was exactly what we expect from a Travelodge; clean, well located and providing everything we need for a short break.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dartford", "Title": "“Easy Access to Wembley Arena”", "Author": "coppitters", "ReviewID": "UR124857583", "Content": "Stayed the night because I needed to be at Wembley Arena early Saturday morning. Very good standard of cleanliness and very comfortable. Only disadvantage was paying for parking, but I suppose thats inevitable given its close proximity to Central London. Well done, Travelodge!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "York, United Kingdom", "Title": "“Bargin Stay at Kew Bridge”", "Author": "ThePottersYrok", "ReviewID": "UR124699503", "Content": "Managed to get in for Â£ 12 a night on a Saturday,Sunday & Monday night - a bargin. We did our homework as we wanted to take the kids into central London to see the sights for a few days & this Travelodge was the idea base. 7 minute walk to Kew Bridge Station & then 25 mins on the train straight into Waterloo station. Car park was abit iffy..I was slightly put off that unlike most Travelodge carparks it was open to the public, no barrier & several signs telling me that car crime was rife in the area...but my fears were unfounded as we had no problems. The room was clean & nicely made up each day during our stay, we had paid for the breakfast & this was fine. Travelode breakfasts won't win any awards..but for Â£12.5 for us & the kids, it fed us well. Staff on the whole were fairly good apart from two occassions, one when we wanted a extra pillow & we had to argus slightly that we did indeed only have 3 in our room & on the second occassion when we tried to come up from the underground carpark, the eastern european member of staff only seemed able to say \"pull the door\" even though is was still stuck...I counted and this sentance was utter 6 times in total but I'm maybe just nit picking. All in all we paid Â£ 73.50 for 3 nights bed & breakfast just outside central London & this was a bargain....we got exactly what we expected... a clean comfortable stay..I would highly recommned it as a good base to drive in an stay for a visit to central London", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Wales, New York", "Title": "“Excellent value for money.”", "Author": "nikki_p2011", "ReviewID": "UR124195769", "Content": "Stayed at this Travelodge in January 2012 and had no problems. Rooms nice and clean with plenty of towels. Only a short walk to the Kew Bridge train station which goes direct to Waterloo. McDonalds a 5 minute walk for cheap breakfast. Would definitely stay again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Northumberland", "Title": "“Good cheap stay”", "Author": "boppsey", "ReviewID": "UR123638049", "Content": "Good room -if a bit knocked about at the edges! Comfy bed. Warm 'human' welcome. Restuarant very spartan, but a tub of 'Oat so simple' in the room sufficed for breaky and there's a good selection of eating pubs over the bridge at Kew green. For the price (Â£39) couldnt complain at all. Lots of buses stop outside. NIce view of the river.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worcestershire", "Title": "“It's absolutely fine!!!!”", "Author": "mandyfizz", "ReviewID": "UR123517312", "Content": "I have stayed at many Travelodge's including this one once before, so I was rather alarmed and worried by the negative feedback this hotel has received recently. However, from start to finish my stay was just fine. Firstly, this is not a 5* hotel so if that's what you want, why book a Travelodge?? The reception staff were all very friendly and helpful, the room (a double) was an adequate size, clean, serviced daily, beverages were plentiful and the TV worked fine as did the remote. The car park, which incidentally has surveillance cameras, was occupied by several high range cars, Merc's, Audi's, Jags, BMW's and as far as I am aware there was no damage or crime reported. The external doors and lifts only work if a key card is used, reception is manned 24/7 and as a single female traveller I did not feel threatened or unsafe at any time day or night; the bus stops right outside the door. There are no hair driers in rooms, when I asked at reception one was supplied without problems. A guest asked for extra pillows, again provided without any problems. In fact nothing appeared to be too much trouble for the staff. So......a word of advice, if you want value for money and clean, comfortable, convenient accommodation, then this hotel ticks all the boxes, if you want posh choose the Hilton!!!!", "Date": "January 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "hereford", "Title": "“what do you expect for the money?”", "Author": "birkonian", "ReviewID": "UR123268563", "Content": "Having vowed never to stay in a Travelodge again I found myself seduced by the low price. Bed sagged in the middle, vacuum cleaner obviously didn't reach to under the bed, solitary bar of soap wafer thin. Didn't look forward to returning there for second night. BUT on the plus side this Travelodge is fairly new and very well situated just off M4 easy to get into central London.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Good Value”", "Author": "Bigboy7Devon", "ReviewID": "UR122982784", "Content": "Good location, just off the M4. As far as Travelodges go this is one of the better ones. Its very easy to get into central London, take the 237 bus from directly outside the Hotel to Gunnersbury station and then the tube. Parking is behind and underneath the hotel at a cost of Â£5 per day. There are a few free spaces in the road that is adjacent to the hotel. There is a Mcdonalds 200 yards away and a Morrisons about a mile further down. I always think it is worth getting the eat all you can cooked breakfast for Â£6.60 if you pre-book. Polite staff for a change was nice. You know what your going to get with Travelodge so try and get an early special offer room because they are not worth the lastminute prices. They do need to improve starting with beds, bedding,pillows,televisions,towels and toiletries.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "langley, berkshire", "Title": "“adequate for the price”", "Author": "cmb1972", "ReviewID": "UR121897503", "Content": "for Â£29 for the night the travelodge kew bridge was perfectly adequate for the price. It wasn't the nicest i've stayed in and would probably pay a bit more and stay at Premier Inn however i needed a room for 1 night to stay in save me travelling home after a Xmas party and it fit the bill price and location wise. It needed a bit of maintenance but nothing that made my short stay uncomfortable. Cheap and cheerful.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "lestartit spain", "Title": "“short stay”", "Author": "ken r", "ReviewID": "UR121797698", "Content": "stayed at travelodge as parking was reasonable and quite easy. Ok for a short stay but lacking in comfort zone facilities.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“good location but poorly run”", "Author": "0121raymond", "ReviewID": "UR121421450", "Content": "A party of six adults and 2 children stayed at this hotel, non of the extractor systems in any of the bathrooms worked. My shower cubicle was growing something around the edges, the hand set for the TV was broken and the batteries missing, The cafe / bar is a bit of a shambles with the bar man serving cold beer and spirits in hot glasses 'and the bar closed at eleven'. Also the average hot breakfast was served on cold plates. be better to stop up the road at the premier inn, this is a far better run hotel.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Right location but dirty”", "Author": "welshhen_11", "ReviewID": "UR121249979", "Content": "We stayed here for one night while visiting WWT Barnes. Location was perfect at the end of the M4 but that's where the good review ends. We had to wait for a long time for service at reception, then even though we'd asked for rooms next door to one another we had one room on the ground floor & another on the third floor. The room was a fair size however, the pillows were non existent - one thin one each and the bathroom. The shower curtain needed throwing and both the toilet, sink and shower/bath were nowhere near clean. I certainly wouldn't stay in a travelodge again & certainly not this one. It was an expensive place to stay where you couldn't have a shower & you have to pay an extra Â£5 for parking.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Richmond, North Yorkshire", "Title": "“Absolutely Right Location For My Purposes”", "Author": "WarWalker", "ReviewID": "UR121224991", "Content": "I try to get down to London at least once a year to spend a few days on research at The National Archives (TNA). In the past, I've stayed at B&Bs up to 28 miles away, often finding myself stuck in my car for up to 2 hours driving into Kew. This year, I travelled down by train and booked 6 nights at Travelodge, London Kew Bridge. It was absolutely the right location for my purposes. Two buses (first right outside the door) got me to about half a mile from TNA. Alternately, a 30-minute walk (pleasant in good weather) got me there too. Reception was smooth, efficient and friendly (an Eastern Eurpean lady). The room had plainly enjoyed a high level of occupancy but was spacious, warm and clean. Daily servicing was very satisfactory. A bar and restaurant service was available but I chose to eat and drink out. I appreciated the foyer internet facility. The only downside (and it was entirely my fault) was that I'd forgotten that I'd booked my last night of the trip in the Kings Cross Travelodge. The consequence was that, when I returned from TNA, I could not access my room. The receptionist said that I should have checked out that morning. The outcome - I had to pay the rack rate for that night. As I said - my fault. Lesson learnt. Would I stay here again? For this sort of trip - ABSOLUTELY, YES!! Thanks.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Much better than expected”", "Author": "Patti53_11", "ReviewID": "UR121082689", "Content": "We were apprehensive about this hotel having read previous guest reviews. However we were pleasantly surprised.The accomodation was standard - clean warm and comfortable. The staff we met were polite and helpful. We purchased breakfast and an evening meal as well as drinks from the cafe bar and had no complaints. The locality is undergoing regeneration and parking even in the underground car park is risky due to unrestricted public access. Cost Â£5 for 24 hours. Transport links into the city are very good. Nice independant cinema opposite hotel showing current releases.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Worcs", "Title": "“OK”", "Author": "JG2410", "ReviewID": "UR119713566", "Content": "Dont know if this is franchised or company owned, this is a budget hotel with minimal staff and unfortunatley it shows, never seems that clean to me, exterior is dirty and weeds growing everywhere, could not close window in bedroom as the catch had broken and room very dusty, stay there because it is just a base, however Premier inn just down the road is better, but costs on average Â£25 per night extra.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cambridgeshire", "Title": "“Only the Price is right....”", "Author": "AdTheLad", "ReviewID": "UR119357301", "Content": "Our stay at this modern day detention centre was thoroughly depressing and should be avoided at all costs unless Â£26 is all you can afford. Weird smelling room with paper thin walls and floor, utterly disinterested staff, wheely bin clearance at 02.30 ( I thought a plane had crashed nearby) plane hadn't crashed but the flight path did start at 5pm) and a miserable breakfast in Hi de Hi canteen. Pleased to escape back to the sticks.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Scotland", "Title": "“Basic but nothing wrong with it”", "Author": "P&AEdinburgh", "ReviewID": "UR118986282", "Content": "I was booked in as part of a study event and when I read the reviews was wary of what I would find. Travelodge is the most basic of the budget chains these days and doesn't provide toiletries or a hair dryer, although there was some basic tea and coffee supplies in the room. However unlike previous reviews I was reasonable happy with my room and it certainly was clean. Only problem was that even with the window open it was too warm. With the window open, you start to hear the longhaul planes coming into Heathrow from about 5am. Breakfast was fine with one staff member working hard to do everything front of house. The desk staff were ok too. The entrance is a bit strange and not very obvious or welcoming- up steps or a ramp at the front and off a side street at the back.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Horrible!”", "Author": "ursidia", "ReviewID": "UR118765687", "Content": "I stayed here for one night - I was moving from my flat in Brentford and thought I would have a comfortable night before a stressful day, rather than sleep amidst the boxes, on the floor! Oh dear, oh my! I can confidently say it was one of the worst hotels I have ever stayed in. Reception staff were off hand to the point of rude and the reception area dreary and nasty. The room was basic, with an elderly TV. It was an extremely hot day - 82f and there was no zircon - and the window opened only a couple of inches. I unwisely had prepaid dinner - which was chucked in the microwave by the receptionist's sidekick - I am not sure of his function. It was unspeakably vile. The cafe is about on the level of a school canteen - but with less atmosphere. I took my dinner to my room - which was awkward and no help was offered, even though they flaunt the fact that you CAN take food to your room. There was no bath in the room and no shampoo etc. Bed was OK - not particularly good, and there was some noise - this does not bother me as I lived opposite for 12 years and am used to it. The one plus is that there was tea and coffee facilities in the room. ( less work for the incredibly ignorant staff, I guess) It was clean enough, but having stayed in similar hotels in Europe, I am very ashamed if this is the kind of service we offer in the UK!", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cornwall", "Title": "“Convenient location”", "Author": "SpeckleCornwall", "ReviewID": "UR118411100", "Content": "The Travelodge is perfectly located for visiting Kew Gardens - 30 minute walk or a short bus ride, frequent service from right outside the hotel. Slightly put off on arrival by a lot of 'car crime in this area' notices, but used the hotel car park (Â£5 per day) with no problems. Was disappointed with the room allocated, small, ground floor and overlooking the road, but reception were very helpful and let us move to a larger room on a higher floor with a good view of boats on the canal. Definitely worth booking in advance - the average room rate was Â£21 per night and there was a great web offer of a 2 course dinner for Â£6 per person.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "devon", "Title": "“great budget stay.”", "Author": "devonsheepy", "ReviewID": "UR117356291", "Content": "great location if you drive to London from the South,and then wish to use public transport. Bus and train stops nearby. Room was clean and comfortable.Asked for extra towels and pillows which was no problem. Great budget stay.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Boston", "Title": "“You get What you pay for, not suitable for business travel”", "Author": "joejoe923", "ReviewID": "UR115209868", "Content": "The hotel is loud both inside and out. I stayed here because i was in a rush to find something close to Brentford and my usual hotels were booked. I won't be staying here again. If you are on a tight budget this hotel might be ok for you. It is not really suitable for business travel which is what I am doing. My usual is Marriott or Hilton. Bed and pillow are one step above a hostel. View is looking out over a dingy apartment building.", "Date": "July 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“They really don't care”", "Author": "Jjaneymo", "ReviewID": "UR114988562", "Content": "So, first impressions are important, and the first impression of this hotel (walking for train station) is of a derelict coutyard, raised beds full of weeds and overflowing bins. At checkin, the automatic machines were out of order... But the hotel had not bothered putting additional staff on to deal with the extra load on check in. It took the best part of 20 minutes to get our key. I nearly shrieked laughing when the check in assistant answered the question of the man in front of us by saying \"I have already told you that\"... Then still did not answer the question. The room was overheated- and it was impossible to open the window wider, as it seemed to only be attached by one hinge and a bit of string. The bathroom stank of mustiness, there was no extractor fan, and as a result (I guess) there was mold in the tile grout. The matress was very old, and consequently sagged. We stayed two nights. The second day, the room cleaning left a lot to be desired. Maybe I expect too much - but shouldn't they wash up the cups? On departure, we were told that, unlike every other hotel I have ever stayed in (I think) they could not store our bags for a few hours. All in all, I will be staying elsewhere in future.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Merthyr Tydfil, United Kingdom", "Title": "“Nice and local”", "Author": "catherine082", "ReviewID": "UR113250081", "Content": "Hotel is one of the better, cheap and cheerful travelodges. Apparently the under hotel car park is a little safer but can be quiet intimidating for a lady on her own at night, you either need change for the parking machine or have to pay by card over the phone. Took a long time and not very user friendly, especially when standing in a car park on your own. Dont think it has CCTV. Staff are very friendly and nothing is too much trouble for them. Would use again.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Basic but close to bus, train & attractions”", "Author": "Zumba12", "ReviewID": "UR111707255", "Content": "We've stayed here a few times because of its proximity to London & recently stayed here with a group of friends to attend a party in London. This is a basic Travelodge but is modern & in a reasonable location, close to Kew Gardens, the Steam Museum, the river & pubs & cafes. The bus to Richmond & Kingston (plus other destinations) stops outside & the train station is about a 15 minute walk. Also you can walk to Kew Gardens in about 20 minutes. There are pubs on the river over the bridge. It can be a bit noisy with fire doors banging, but the staff are happy to find rooms in a more quiet location if asked. Be aware that coach parties (eg football fans) stay here plus school parties. However, noise seems to be kept at a minimum. Fairly close to Heathrow also. Worth staying here if you don't mind a basic hotel & there are plenty of cheap offers when booking in advance on the Travelodge website.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brighton, England", "Title": "“Not too bad for a Travelbog”", "Author": "Keith-in-Brighton-UK", "ReviewID": "UR110015666", "Content": "My second Travelbog in a week! Yikes. Good points: clean, tidy hotel and rooms, for what it is I couldn't fault them on that. Bad points: 1) I had booked 3 rooms online a week before the stay (boys night out with 2 friends). Names, credit card details all pre-provided yet check-in took a ridiculous 15 minutes. 2) The car park had about 3 or 4 cars in it excluding ours but they couldn't even find us rooms on the same floor let alone adjacent rooms. 3) We got to breakfast at 9.40, 20 minutes before it stopped. 3 sausages left, no bacon, scrambled eggs like hard rubber. We had to push and push to get more food, being told more than once 'we stop at 10 you know'. This was advertised as an 'all you can eat' breakfast buffet we were there in time. Not good enough!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London", "Title": "“Wouldn't Recommend”", "Author": "heenas23", "ReviewID": "UR103753048", "Content": "I was only here for 1 night so it was passable but I wouldn't stay here again nor would I recommend this to anyone ..I got no sleep - there was alot of noise and disruption through the night.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lytham St Anne's, United Kingdom", "Title": "“no frills, but friendly”", "Author": "LythamLaurel", "ReviewID": "UR102682201", "Content": "I recently stayed here for one night with my 2 teenage daughters. We only spent a short amount of time here, not arrinving until midnight and leaving at 10 the following morning. The check in was straightforward and friendly and at breakfast the staff were friendly and were very efficient at clearing the tables. You just help yourself at breakfast and the food was the usual selection of cereals, croissants, bacon and egg etc. and they were topped up regularly. The room was clean and the bed comfy, much like any other travelodge. The only gripes I have are that the bed settee was not made up and it only had poor excuse for a duvet supplied for it which was barely warm enough for my daughter (the duvet on the bed was fine. Also there were only 2 sets of towels provided. This seems to be the norm inTravelodge family rooms and I don't understand why when they know in advance how many people are sleeping in a room the room is not prepared for that amount! As we only arrived at midnight and were tired the last thing we wanted to do was make up a bed and chase round after blankets and towels. I know rooms are cheap but I think its only fair to expect a fully prepared room for the amount of people staying in it. We were visiting family in Kew and it suited our purpose but if I wanted to spend more time in a hotel I would pay a bit more money for a hotel which provides more amenities. Its fine if you want budget.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Coventry, UK", "Title": "“Nice no frills hotel”", "Author": "jettoes", "ReviewID": "UR102003838", "Content": "My husband and myself stayed at Travelodge Kew Bridge in London for 6 nights. The hotel itself is not situated in central london. It is in zone 4 and it is close to an overground train service. In order to catch an underground service you have to walk some 30 or 40 mins to the nearest underground station at Kew Gardens from where the District Line goes through from Richmond. We stayed in other Travelodge hotels before so we knew what to expect. It is a no frills hotel - so I suggest you check in their website what they do not provide in their rooms. Incidentally they provide more things than other no frills hotels. The hotel is situated on North Street and next to it there is a nice old church and in front of the hotel there is a small garden on the quay - an nice place where you can take lunch or a small stroll. Up the road there is a drive through McDonalds and if you walk down the road in the opposite direction you will find a Steam Museum and another museum of music. The river Thames is also close by and can walk onto the bridge crossing the river. There is not a lot of greenery around the hotel. If you prefer not to walk to the Kew Gardens underground station, you can take one of the more frequent buses which pass from North Road. The room was clean, nice clean carpet, properly hung and clean curtains and we found the usual kettle and the nice assortment of coffee, tea and milk on the tray including two mugs for our perusal. Everything was clean and nicely displayed (including the menus for the breakfast and other meals). The bathroom consisted of a shower with shower curtain, sink with plenty of space where to put lotions and other commodities and of course the toilet. As with all travelodge hotels, there are no toilet brushes but every morning the cleaner comes in and does a perfunctory clean of the room and bathroom. If you want to replace your towels do not forget to put them in the shower so that the cleaner will know that you need new ones. There is no carpet in the bathroom and this is also explained in their website. The cleaner will do your bed but will never touch anything which is yours. Your pjs or nightdresses will remain where you left them and they will not tidy the room at all. The first evening we suffered some noise from our noisy neighbours but fortunately they left that same evening and the only noises we heard where the cars passing from the main road outside the hotel. We also had a faulty bedside lamp and asked for it to be changed and it was fixed on that same day. The receptionists at the desk were always helpful and always with a nice big smile on their faces. The first night we ate at their own restaurant of Travelodge but I would not recommend eating there unless you like the prepackaged ready meals that you normally buy at leading supermarkets. On the other hand they do serve alcohol at the bar. You will be able to pay extra for more TV stations and you can also pay for Wi-Fi. The bed was clean with nice clean sheets and pillows and we had an extra pillow if we needed it. The bed was a bit too soft for what we are used to but it was sturdy and did not make creaky noises when lying down on it. In the room there is plenty of open shelves and also an open wardrobe. They provide bins in both the bedroom and the bathroom and they are cleaned every day by the cleaner. The mugs are also cleaned daily and the coffee and tea tray is replenished every day. Downstairs in the lobby there are two machines with candy bars etc in them and you will also find shaving foam if you forgot it or pain killers if needed. In short this hotel like others of Travelodge is located in a nice (peaceful area for London) and the hotel itself is clean, has friendly staff and good customer service. I would recommend it for those who know how to travel to central london or do not need a central positioned hotel but want to stay in a nice, clean, friendly environment in a safe area of London.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cockermouth, United Kingdom", "Title": "“Perfectly Adequate Budget Hotel”", "Author": "traveldoc65", "ReviewID": "UR98282283", "Content": "Stayed overnight with some trepidation after reading the reviews on here but needn't have worried -the hotel was perfectly adequate for our needs.A good 10 minute walk from Kew Bridge Train Station - set back from the road so was difficult to spot so had to ask directions several times but was in fact on the correct road.Efficient and friendly check in. I felt safe due to the key card system required to operate lifts and access the floors. The lifts were very slow. The room was very clean with beds made up. The bathroom was spotless with plenty of hot water for bath and shower.Plug was supplied but no toiletries.There was a kettle with tea and instant coffee sachets and UHT milk pods. Decor was a little scuffed in places .Room temperature was fine and the room was quiet at night.The only outside noises heard were one noisy van unloading about 11.30 and youths passing for about 10 minutes around the same time.The hotel was much quieter than many other city centre hotels I have frequented.Breakfast on Saturday was from 8 am and was fine.Usual selection of cereals ,croissants muffins,bread ,toast ,apple or orange juice and coffee machine.Despite previous reviews the cooked breakfast was Okay -sausages tomatoes scrambled egg and beans and crockery was replaced quickly when requiring replenishing.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "York", "Title": "“Rooms ok but restaurant terrible”", "Author": "alliebdive", "ReviewID": "UR92248082", "Content": "We stayed here one night when stranded by snow at Heathrow and then moved elsewhere. Its pretty standard Travelodge accommodation, quite expensive at Â£69 per night per room. The parking is underground and rather odd in that you need a key card to access the lifts (security issues from other reviews) and at the end of your stay you need to keep your key card right down to the car park and then leave it on the floor!!! The hotel is pretty much in the middle of nowhere and no other restaurants in walking distance. We ate in their own restaurant which was awful. The lighting was soooo bright it was almost painful. All the food was clearly precooked and then microwaved, very tasteless and unappetising. Food was delivered out of sequence eg burger with chips following about 15 minutes later. Not great if you have a choice.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "York, United Kingdom", "Title": "“Not very nice”", "Author": "bb1976", "ReviewID": "UR88531877", "Content": "We chose this hotel because it was cheap(ish) and reasonably near Kew Bridge station. That was about the only good thing about it. We arrived at 11.30 knowing we wouldn't be able to check in, but we weren't even allowed to leave our luggage. Something about security. First hotel I've ever been to where you're not allowed to leave your luggage. So we had to pay Â£10 extra for early check-in, but this wasn't until 12.00. So we spent a very unpleasant half an hour in the McDonalds down the road (as the hotel bar was shut). The room we got was small and scruffy, but was clean enough. However, when we came back that night we noticed that the heater didn't work, and it was next to a cupboard with some sort of electrical apparatus in it - it was humming very loudly. I asked the reception guy and he moved us straight to another room - so plus point there. The second room was much bigger, warmer and quieter. But, it was all rather depressing and shabby, and the toilet leaked water onto the bathroom floor. Didn't bother wasting money on their breakfast. Overall, just a really unimpressive, slightly depressing stay. Luckily, we weren't in the room for that long.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“afraid to leave the hotel room gangs roming the hotel no staff”", "Author": "leeg123007", "ReviewID": "UR84737476", "Content": "right i had a terrible stay in this poor excuse for a travel lodge there were gangs of hoodies fighting outside the hotel and then i dont know how they got in but then they were fighting outside our room when we dared go out when we thought they were gone the guy on reception said they were not guests he thought they must have just came in for a warm he said as if i were a normal weekend thing then for breakfast or the lack of it they served cold raw looking bacon and sausage and the guy serving drinks came and said that there is breakfast but theres no knifes and he did not know where they were as he had just started and was not part of the managment team then one of the other guests went to get the guy of reception who then screamed at the new guy in the kitchen but all the guest could hear then 5 knifes appeared so we shared a knife between four of us it was just the worst place i had ever stayed and i have stayed in hostels", "Date": "October 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Derbyshire, UK", "Title": "“Hottest hotel I have ever stayed in”", "Author": "CleggDerbyshire_UK", "ReviewID": "UR73781989", "Content": "Just got back from a 2 night stay at this hotel. Only paid Â£49.50 per night and worth the money. was visiting relatives as well as visiting Kew. The staff were good but nowhere near enough. the room though was really hot and made getting a nights sleep difficult. There was little noise in the hotel bearing in mind it is near a main road. Would I stay there again? Yes but in cooler months.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Honolulu", "Title": "“Cheap, but you get what you (don't) pay for”", "Author": "blazingfingers", "ReviewID": "UR72891127", "Content": "The price is right; rooms are basic and we were fine with that. But, this hotel has taken \"basic\" to a new (low) level reminiscent of the pre-glasnost Soviet Union--no toiletries in rooms (not even soap!), no stoppers in the bathtub, and no phones in the rooms. They probably figure everyone has cell phones now, but our daughter got sick and we kept having to run downstairs to buzz somebody at the front desk (and they were often slow). What if a person traveling alone had an emergency and couldn't contact the front desk from the room? This seems a health/safety issue. There's also no a/c, often not a problem in UK but rooms are stuffy if you happen to hit a heat wave (they will provide fans on request, but you have to ask, and you have to go down to get everything--they won't bring stuff to you). Location is awkward unless you know SW London very well, which we do--and if you do know it, you can save a few bob by staying out here. It's nice to walk to be able to walk to little museums like Kew Steam and Musical, or to Kew Gardens. It's quiet and there's a nice Indian restaurant at Waterman Centre nearby. Breakfast \"buffet\" is lowish in quality but all you can eat for eight pounds fifty; it helps that kids eat free, and there are a couple of cheaper cafes in a nearby parade of shops. If you're on a tight budget (especially with a family) and you don't mind staying out a ways and having minimal service, the place could work. However, Premier Inn just down the road is probably a better deal, with little luxuries like in-room phones, a/c, soap and tub stoppers. Internet access was pricey but stable.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Very good value for money, but watch out for local taxi firms”", "Author": "Jeanthelibraryqueen5", "ReviewID": "UR72832541", "Content": "We have stayed here before when visiting friends in London, and for the money it is extremely good value. The staff were pleasant and helpful, and the room was good. However (and this is in no way a reflection on Travelodge), when we asked for a taxi to a restaurant a couple of miles away, the receptionist called a firm that tried to charge us Â£18 for a journey of 2.5 miles on the grounds that they were a limousine service. After negotiation the price came down to Â£12. On the return journey the taxi called by the restaurant charged us Â£8. We should have asked before getting in the first taxi! We mentioned it to the Travelodge manager, who promised to investigate.", "Date": "July 29, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cornwall", "Title": "“Too hot to sleep....”", "Author": "treenyweenywoo", "ReviewID": "UR72217029", "Content": "Firstly, the weather was very hot. The problem however is that there was no way to cool our room down. The windows would only barely open and there were no fans or air conditioning (although there was in reception). This resulted in the room being too hot to sleep in. Added to this, we asked for extra pillows on the first evening. These did not materialise. The remote control did not work and when we asked for a replacement, there wasn't one. The hotel feels like it needs a refresh. There are stains on carpets and it feels a bit tired.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“FIRST STAY AT A TRAVELODGE”", "Author": "MONEMK", "ReviewID": "UR63583814", "Content": "We booked as it was the nearest to Kew Gardens and having read reviews were apprehensive, well needn't have been. We arrived late following a trip to the theater. the welcome was not good as we had to ring three times for attention, our room 110 was of a good size at the end of the corridor at the rear of the building with a view of an apartment block. It had the standard hotel interior, it lacked a hairdryer which I shall bring in future. I had read complaints about there not being a clock, phone and toiletries, well this is a budget hotel so bring them with you in future. The hotel is in a good condition the room was fresh, warm and pleasant, bed linen and towels were of a good standard. We spent two nights on the first day we visited Kew which is a 20 min' walk or 4 stops on the 65 bus taken from the bus stop stop on thhotel side. On the second day we had breakfast in the hotel costing Â£7.50p per person, we were met by the two friendly, courteous and helpful staff who informed us what was on offer. it was a substantial breakfast and as it was a quiet day following a Bank Holiday the room was not crowded and there was plenty to eat. Good location and easy to get to by bus from Hammersmith with a bus stop conveniently located just outside the hotel, good links to rail station, tube station and road. We certainly enjoyed our stay and will return to stay here even if we plan to go into central London. Excellent value and no complaints.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Cheap and Cheerful - Good Location”", "Author": "Mindaleena", "ReviewID": "UR63048454", "Content": "You can't really complain when you get a decent room for 4 nights for Â£120 in London ! Staff were good, room was no frills but what you want as a base - good shower and really comfy bed. No noise probs. Didn't bother with breakfast but bar was good for taking drinks to your room. Travelling into London was easy - get the bus ( bus stop outside ) to Gunnersbury Tube rather than Kew Bridge - straight through on the District Line takes about 20 mins. Really recommend O'Rioddons Pub across the road ( opposite the Musical Musuem ) ... lovely people and great food ! Only complaint was the housekeeping - although we got fresh towels and the bathroom was cleaned etc they never collected any glasses if you'd brought drinks back to the room from the hotel bar, dusting could have been better and someone needed to re-set the freeview box !!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Bath", "Title": "“The worst Travelodge in the UK ?!”", "Author": "AlfieandEddie", "ReviewID": "UR61238538", "Content": "This Travelodge is terrible. It must be the worst managed / staffed hotel in the UK ! Run on a shoe string that doesn't even include a chef/cook to do breakfast ! The bar closes before the time it advertises, they refused to change a light bulb in a bathroom due to health & safety and when we went down for breakfast, we were greeted by residents milling around due to there being no food, china or cutlery. This review could be so much worse if I could be bothered to go through our stay in detail ! Premier Inns must be rubbing their hands with glee !! Surely this is a one off and not the normal Travelodge standard ?", "Date": "April 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Great place if you get it cheap enough”", "Author": "BizzyLizzy1", "ReviewID": "UR57883591", "Content": "I booked this well in advance and paid Â£12 so it was excellent value for money. I stayed on the 4th floor and did not hear any outsided noise. HOWEVER, the fire doors along the corridor were VERY noisy and my room was right by one so I did begin to get very cheesed off everytime someone went thru one...several times the noise made me jump. I was told by reception that this is being addressed. I bought some earplugs which helped a bit. The room itself was spacious and clean other than the carpet/floor which had the previous occupants long hair here and there. I asked the cleaner if she could run a hoover over it but she could not understand /speak English but smiled and did get someone to translate.I thought that was bad when all I was asking was for the room to be hoovered....suddenly a little issue became a big one! Lots of piping hot water and my towels (2) were replaced each day. The room had a great view of the River and a little of Kew Gardens too.The reception staff were friendly and very helpful, particularly Martin who did his upmost to oblige.Park in the car park even if you have to pay...the side road (North St?) looked dodgy re. night time parking. One car had his windows smashed. Good amenities all round the hotel...Morrisons up the road , Chinese takeaway (who deliver to your room) and a McDonalds. I did not eat breakfast there but I did have a pizza one eve which had a weird taste to it and was overcooked. I would stay again for sure if I can get another good rate, but this time I would try and get a room away from the fire doors.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "north west england", "Title": "“Time for a change”", "Author": "harters", "ReviewID": "UR55740758", "Content": "I stay here for a few days each year while I undertake research at the nearby National Archives. Frankly, if there was somewhere else as reasonably priced, I'd go there. And it might be time for me to bite the bullet and spend a bit more elsewhere. As with all hotels in the chain, it's basic. And it's getting time for a bit of a make-over. I've never had real cause for complaint here. But, with my first room, the very loud fan in the bathroom wouldnt turn off. It was no problem to get a room swap. The bed in the new room was showing signs of age and was very soft. As always, breakfast is vile and, if the weather is fine, you're better off walking a few minutes to one of the cafes on Kew Bridge or along the the main road back towards the motorway. If you do have breakfast at the hotel, as I did this week, expect cheap ingredients such as fatty bacon, undercooked and kept insufficiently warm under the serving lights. Nothing is hot - one day the scambled egg (set in a solid lump) was cold. Expect your croissant to be on the point of being stale - it had probably sat out for a couple of days service. But, you can eat as much of this as you like for Â£7.50. And if you must inflict this dismal muck on your children, they eat for free.", "Date": "February 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Boston Area", "Title": "“Cheap and tolerable for London”", "Author": "Diogenes-NE", "ReviewID": "UR53053179", "Content": "Traveling with wife and adult daughter and this was one of the few hotels I could find that offered 3 adults/one room. Cost was â‚¤381.00 ($621.00) for five nights, which is cheap for London area. Room was small but reasonably clean and the hot water worked. Area of hallway near elevator (2nd floor) smelled strongly of mold. Staff was helpful and courteous. Didn't try the bar/restaurant so cannot comment. Travelodge offers cheap accommodations and you get what you pay for. They do not furnish shampoo, hair dryer, or free WiFi (available at a price). Bus stop is right in front of hotel and takes you to Chiswick (shopping/restaurants) or the Kew Bridge Rail Station (10 minute walk). NatlRail goes straight to Waterloo Station (30 minute ride); round trip ticket is ~ â‚¤7, but if you buy your ticket after 9:30 am you get the off-peak rate both ways. Be sure to get an 'Oyster Card' for your bus and Underground trips (but not good for NatlRail). This hotel was OK for the money, but on our next London trip I will look around for something better", "Date": "January 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Did the job”", "Author": "vanboro", "ReviewID": "UR48062251", "Content": "Stayed one night on the Â£19 advanced booking deal and thought the room was perfectly adequate. My room was tucked around the corner from the bar/restaurant and I was worried about the noise but I didn't hear a thing. The beds are a bit soft but after sleeping on utilitarian beds in 2 star Italian hotels for a week, I thought the Travelodge beds were heaven. We didn't have breakfast so can't comment on that but we did take advantage of the tea and coffee making facilities in the room. This was my first stay in a Travelodge and I thought it was a perfectly decent functional hotel for our overnight between Kew Gardens and the National Archives. Although, my view might change if I had to pay the Â£72 quoted by a previous reviewer!", "Date": "October 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Yorkshire, England", "Title": "“Accommodation is good - breakfast provision is not!!”", "Author": "NickandJulie", "ReviewID": "UR47993575", "Content": "I have stayed here on a number of occasions. The hotel is in a pleasant area and there is easy access to an overland rail link to Waterloo. The rooms are typical of the Travelodge chain - basic but reasonably comfortable. The benefit of this location is that it is quiet as it is out of the central part of the city. There are also a number of local pubs that provide good food. The problem is that if you arrive for breakfast either early or late you are likely to receive a fairly reasonable offer but if you arrive at the busiest time the offer is appalling. You are likely to be faced with no cups, crockery or cutlery, tables left uncleared, food depleted or missing altogether. They are unble to cope when the hotel is busy. Buy the breakfast voucher after you have checked the restaurant - this way you can guarantee the service and offer. If busy, you can get a breakfast elsewhere and save yourself the heartache!! Despite this shortcoming, it isn't a bad budget hotel to choose for a stay in London.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wales, UK", "Title": "“Excellent value”", "Author": "Ken007", "ReviewID": "UR37803059", "Content": "We stayed three nights at the Travelodge at Kew Bridge. It was easy to find, and had very convenient parking (at Â£5.00 per 24 hours, pay by mobile phone). On booking the room was Â£45.00 per night, and by booking breakfast we saved 25% on the normal price of Â£7.50. The room was quite large for a travelodge, with a very comfortable double bed, soafa and arm chair, and plenty of hanging/storage space. The hotel cafe/bar was very good - starters from Â£2.50, main courses from about Â£5.00, in a very attractive restaurant that was so convenient! The buffet breakfast was very comprehensive, including a full English breakfast! The hotel is literally 5 minutes from the main entrance to Kew Gardens and Kew Palace (get there early and there's plenty of parking). It was about 25 minutes from Hampton Court (again easy parking inside the grounds). The hotel staff were extremely helpful and friendly, and all in all we think it was a lucky find!", "Date": "August 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Good Value overnight stay”", "Author": "smwgeorge", "ReviewID": "UR37047778", "Content": "Decided in visit National Archives so book to stay overnight sunday so only short drive next day. Had read about parking charge on th website. Room clean, at side so view of flats and aeroplanes going into heathrow. The travelodge is near a busy London road so you get traffic noise which goes on most of the night. Staff brought extra duvet and windows up when we requested them. Good pub within walking distanceon same side of road with an oasis of a beer garden considering proximity to busy road, evening meal at Travelodge reasonable but one slightly overcooked.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“Lastminute booking - not out of choice”", "Author": "jaymanek", "ReviewID": "UR36473855", "Content": "Saturday night in Central London... Supposed to be staying with my friend who has had a family emergency... so at 10pm me and my wife need to find somewhere to stay. I rang various hotels i knew but were all booked...I then tried the travelodge national line... got through to india where i was informed that they only had one room left in the whole of london and surrounding areas! Ill take it at Â£72.. Bed was so soft my back problem has returned with a vengeance. No shower gel or soap provided... Â£72 and no bloomin soap... The place was clean, parking secure and i guess we had a roof over our heads.. but i wouldnt choose it again.", "Date": "August 2, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "wirral", "Title": "“travelodge kew brige london”", "Author": "fagsym", "ReviewID": "UR35839181", "Content": "travelodge is worst hotel i have ever stayed in wouldnt advise my worst enemy to stay here poor staff, poor rooms, poor food just dont ever stay at this hotel", "Date": "July 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "somerset", "Title": "“Okay rooms with horrible breakfast”", "Author": "spartacusathome", "ReviewID": "UR34752578", "Content": "Arrived around 7pm to a place that looked like student digs. Parked outside and then had to pay Â£5 and no-one in reception. However pressed button and someone came immediately. Not exactly friendly though and would not give change for parking. Had to ring a number for the parking which took ages. Anyway checked in, found lift (didn't work) trekked up stairs with suitcase. Adequate room and clean. No extras though, like no hairdryer, shampoo. Only had soap and not enough towels for family of 4. Apparently you can buy these items. Room was very hot, tried to open window. Will only open a centimetre or two. Discovered our view of a brick wall. Bed comfy, but just too hot to sleep. Went to breakfast in the bar cafe (free for children when paying for an adult). However, not impressed at all. It was luke warm, had to wait ages for items that had run out. Just was not edible, and I'm not a particularly fussy eater. Orange juice was running out of the machine and so it turned to disgusting water. Coffee was also bad. Left very quickly and would never stay there again.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Derbyshire", "Title": "“Adequate”", "Author": "Mojos090", "ReviewID": "UR30944581", "Content": "Our second visit to this Travelodge. Well placed for Kew Bridge Station and the West in general. Not the most pretty of locations. If you can then do request a room to the front of the building. Both times we have been given a room at the back overlooking grotty flats but to the front are pleasant views of the river. Very noisy youths in a room next to us and also across the corridor. They were up shouting in the corridor and slamming doors until 4am!!!!!!!!!!!! - not funny when you have two children. We complained but the problem continued to the next night. Shame Travelodge doesn't have the same policy as Premier Inn where if you don't get a good nights sleep you have your money refunded. After saying all that it was a cheap way to explore London.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Kew”", "Author": "accadia", "ReviewID": "UR30577288", "Content": "Conveniant for Kew Gardens as it is so close - just across the bridge. The station is very nearby but it is further to the underground station. The M4 is also really close. Underground parking was fine - it is Â£5 from 3pm to 12noon. The staff here were very good, reception called a taxi for us but the fare was very expensive. The key cards to operate lift as well as to access rooms rarely worked first time. Rooms were your typical Travelodge type - bathrooms are either bath or shower. Family rooms have a sofa bed and are also bigger than the other rooms. Stayed on the top floor (4). As a result there was hardly any traffic noise. Beds are comfortable. Breakfast in the Cafe Bar was good. The room is large, light and airy and clientele were nice. A wall mounted TV shows the news. I didn't try the cooked breakfast. There weren't enough knifes. Overall, I would recommend this Travelodge if you are visiting Kew Gardens or anywhere in Richmond upon Thames, especially if you book in advance and get a cheaper deal.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Kiev", "Title": "“Simple budget bed”", "Author": "Etymon", "ReviewID": "UR30235845", "Content": "This hotel is too simple to rewiev it. Just nice that you can book such cheap bed staying in London. You can choose any of the numerous options they offer all over the Greater London and UK. If you want to save on your hotel in UK, better offer would be difficult to find.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Co Durham", "Title": "“What more do you want for Â£9 per night?”", "Author": "axcooper", "ReviewID": "UR28215254", "Content": "Stayed for two nights instead of family's spare room in Chiswick (2 miles away). Typical Travelodge. Clean and functional room. As much tea and coffee as you can drink. Hot water. Safe and secure. Staff when we checked in were okay but staff next day couldn't do enough to help. We didn't visit the bar or the restaurant because there are high streets full of choice just over the bridge or down the road in Chiswick. Parking is a little confusing as it's run by someone else but if you call the number of the box you can sort your whole trip without feeding meters. Great location for Kew Gardens. Worth a visit. What more could you possibly ask for for Â£9 per night?", "Date": "April 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "sussex", "Title": "“Good alternative to a central London Travelodge.”", "Author": "sussexperson", "ReviewID": "UR27897530", "Content": "Our room was - as usual for Travelodge - tidy, minimalist. Wonderful ensuite, a search revealed one tiny bit of black mould in the shower/bath tiling, otherwise spotless. Plenty of ice-white fluffy towels, plenty of pillows. Bed extremely comfortable with immaculate, smooth, white linen. The room was very spacious, about 20ft by 12ft. A 5ft (king size) bed and a seven-foot long sofa, hanging space, shelves, one chair. Everything in excellent condition and clean. In reception there are three vending machines selling ice creams, cold drinks (a can of Coke is 90p so it's not extortionate) and snacks like pot meals, chocolate bars, crisps, also toothbrushes, headache pills and shower gel. Next to these are internet terminals. The hotel faces across the Thames and Kew Gardens but apparently there are no windows on that side of the hotel, which seems very weird! But you can walk across the road where there is a park set above the river. Our 2nd floor room faced a decrepit, ugly building down a side street. The window opens and you can look sideways over the river. You can lay in bed and watch the planes descending on the path to Heathrow. They are not noisy, even with the window open, but quite interesting to watch. On the Sunday morning we were rudely awoken at 8am by the sound of pneumatic drilling right under our window as the council workmen renewed a bit of tarmac, but that isn't the fault of the hotel. There is a bus stop right outside that takes you to Chiswick High Street, an excellent shopping street, lots of restaurants and quirky designer shops as well as chains, The bus goes on to Stamford Brook tube station and then to Hammersmith bus station, which is a better choice because there are lots of buses into central London, although the tube will get you there much faster. Hammersmith has two separate tube stations, about 300 metres apart, so very easy to get to South Kensington, Earl's Court and into the centre. Kew Bridge railway station is also very close, takes you straight to Richmond, Clapham Junction and Waterloo. The hotel is extremely convenient for Kew Gardens which is a walkable distance. There are two small museums just metres away from the hotel: the Musical Museum and the Kew Steam Museum. There are hot drink making facilities in the room and the staff replenish the tea, coffee, sugar and milk daily. We paid about Â£39 a night --- just Â£20 each! The only thing that stop me giving this stay a perfect rating was the cafe-bar. The decor is really trendy and wonderful, the food was nothing gourmet, it's rather like chilled supermarket food reheated in your microwave, but that's acceptable because it's really cheap in comparison to a proper restaurant. What let this place down was the staff! At dinner the service was slow, they forgot our dessert, despite having few customers. But breakfast made me knock two stars of the overall rating, which is sad! Although there were three members of staff running about it was a farce. It's a help-yourself affair, with egg, bacon, sausages etc laid out in hot dishes. But when we got there some bits were missing and it took them far too long to replenish them - quite a ridiculous amount of time! Then when they did replenish one thing, another had run out! So you could have egg and sausage, but no bacon, etc. (PS the egg is scrambled and tasteless, no idea why they cannot provide friend eggs like everywhere else). I've eaten at many of these self service hot buffets and everywhere else the staff had sufficient intelligence to keep everything topped up all the time. The situation was not helped by the fact that the manager was totally ignoring the debacle that was going on before his very eyes in favour of fiddling about with the till! The situation annoyed me so much that I intended writing the manager a letter when I got home but in the end I didn't. He can read it on here! This breakfast isn't \"free\" - it costs Â£6 and if I had walked into a cafe and been given half a breakfast and made to wait twenty minutes for the other half I would have walked out. But I guess in a hotel you are a \"captive audience\" - they've had your money upfront and so you are hardly going to walk out, are you? If we had not had dinner or breakfast this stay would most definitely have been 5 stars straight! If you cannot get a cheap room in a central London Travelodge, or are visiting Kew Gardens, this is a good budget option, and it will cost you Â£2 each way per day, plus an hour's travel each way, to get into central London.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Leicester", "Title": "“New Year 2008/9 Disaster”", "Author": "ThemTwo", "ReviewID": "UR24449076", "Content": "Good Points - Breakfast and the breakfast team. Bad points - Too many to list but, took almost 2 hours to check in - computer problems. Rude, unhelpful reception staff. No management or leadership on site No towels and a problem getting them. Previous guests underwear left in the room. One night guests receive refunds but multiple night stays do not. Will not go back", "Date": "February 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Somerset", "Title": "“Fantastic location, easy to find”", "Author": "ukholidays100", "ReviewID": "UR24370659", "Content": "Our family of 3 stayed at this hotel for 3 nights for the stupid price of Â£27 (Â£9 a night) - Our room was great, we had a side room so had partial views of the River Thames which was nice, we just wanted a base for exploring London so this was ideal. I paid an extra Â£15 to park the care there for 3 nights as it didn't look too safe to leave it down the side lane (lots of drunken activity late at night down those streets). What I always love about Travelodge is the unlimited amount of piping hot water it seems to have, you can have a hot bath run within a minute as the pressure is so strong.", "Date": "February 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Great base for London travel”", "Author": "janieflo", "ReviewID": "UR24015923", "Content": "My partner and myself booked this travelodge as a last resort when we were coming to London for a wine tasting and a day away. I booked on line and it cost Â£190 for the two of us for three nights which was reasonable it was the family room. We hit a snag earlier in the day and phoned to say we would be late, the indian man on reception was very obliging and when we arrived at 8.15 he was pleasant and helpfull checked us in, gave us our key and told us about the cafe/bar The room was large with a sofa bed and a double it was airy and clean, I didn't get a soft bed I would have preffered that, mine was quite hard but not unduly uncomfortable. Sheets were clean as was the room there was a television kettle, teas coffees etc. Bar/cafe was adequate, food standard fare but we found the staff really friendly, buffet breakfast again adequate but all par for the course for the price paid Â£6.75 we only had one there. Don't bother with the tube the overland train is the best route to take to town 8 minute walk to the station at Kew bridge and then straight in to Waterloo Â£4.20 return and a really smooth ride. We will use this hotel again we have stayed in pricier hotels that were not as clean and for the price it was top notch The only downside is the views we looked out onto the car park but hey we basically only slept there so it was fine.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Winchester, UK", "Title": "“Ultra cheap, much better location than most Travelodges”", "Author": "Lorks", "ReviewID": "UR23865925", "Content": "At Â£19 a night (advance booking) this is a very cheap place to stay in Brentford (It's not really Kew at all) but the hotel is let down by the distance to transport, and appauling design. With a location high up, right on the river Thames, you'd have thought the hotel would have made the most of it. Not a bit: the hotel just has a blank wall facing the river, and even the bar & restuarant has the kitchen at the front, with the views: you sit at the back, where even the glass has been frosted over. What a waste. There are also rooms on the ground floor leading to the bar: these are incredibly noisy. High up, the rooms are much quieter: indeed, the family rooms (also Â£19 if you book far enough in advance) overlooking the car park are silent, and have a good sofa/bed too. Design of the rooms is pretty standard travelodge: Kettle, but no fridge. No phone, but decent TV, with the 5 domestic channels, plus BBC News Channel, Film Four, and Four Music. Radio with BBC 1, 2, 5 and TalkSport. Wifi is Â£5 an hour. The bar is pretty good, but pricey. Â£1.30 for a tiny coke, or Â£2.95 a pint. Food is microwaved but presented well. The Chilli is good, Lasagne basic, and the Garlic Dough balls rock hard and a waste of time. It tends to fill up in the evening with a lot of people eating alone: many people staying here seem to be tradesmen. 5 minutes up the road is a McDonalds, a petrol station selling basics, and an off licence. There are also a couple of decent pubs. There is a large car park (Â£5 a night) but public transport is a bit of a problem: It takes about 45 minutes to walk to the nearest Underground Station, Gunnersbury: it's all the way up the road, left, then under the M4, and a further 10 minutes on the right. However there is an overground station just 30 minutes walk: Kew Bridge. It goes into Waterloo. Altogether, this is a much newer and more pleasantly sited Travelodge than the ones at Park Royal and Wembley, but it's a bit more of a hike on public transport.", "Date": "January 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Darwen, UK", "Title": "“A good base from which tovisit Londons sites.”", "Author": "andychem18", "ReviewID": "UR23671683", "Content": "A great place to stay if you want to see London over a few days. the hotel is just over 1 mile from J2 of the M4 so is realy easy to drive to, plus you pass 2 petrol stations selling fuel at far cheaper prices than on the services. When you get to the hotel you can try and park on the side streets near by for free or pay Â£5 per 24 hours to park at the hotel. the hotel is on 5 floors with good sized rooms with showers but not a bath. however the bed we had was extra extra soft so watch out if you have a bad back. the hotel does have a restaurant, but if you walk over Kew bridge there are some realy nice ones. Getting into London is realy easy, its a 5 minute walk to kew bridge station (4 trains an hour on sat, 1 an hour on sun), or you can catch a bus from outside the hotel to Hammersmith and pick up the tube network from there.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "scotland", "Title": "“Travelodge, more like Travelshodge!”", "Author": "ScotlandBertie", "ReviewID": "UR20905124", "Content": "Arrived at the hotel at 2300, following a 10 hour drive from Scotland to discover, although we had booked a room there were no rooms available. There were several other people in the same predicament. We were offered a taxi to another hotel. However, we had our dogs with us and therefore we had to go in our own car. Firstly, we were offered another hotel close by. I asked the duty manager, Hannah to ensure they would accept the dogs. She did not ask them on the phone and when I asked her she said they would accept the pets. To make sure, I asked her to call the hotel again and the hotel said they would not accept pets. We were then offered a travelodge hotel in Brentford and was informed it is a 'centre of excellence'. If this hotel is a centre of excellence I dread to think what the other hotels look like! We then travelled back to Kew and discovered another customer checking in at reception. When I questioned the receptionist about this I was informed, very rudely that this customer had arrived earlier in the day to guarantee a room. The customer arrived back at reception 2 minutes earlier to say that there was someone already in this room! With much persuausion we were eventually allocated a room (even though I had been informed there were no rooms left). The room was filthy. The toilet had not been cleaned and had faeces on the toilet seat and the duvet was covered in stains which looked like dried in vomit! I complained to the duty manager, re sending us to the 'centre of excellence' hotel and about the cleanliness of the room and she replied 'do not fuss with me'! Eventually, we were given a room in Heathrow terminal 5 for one night and we were informed we HAD to return back to Kew for the rest of our booking. I informed her we would not return to this filthy hotel and she said we had no other alternative but to return there the next day. Arrived at the heathrow hotel to find it was modern and reasonably clean. We were told the next day we did not have to return to Kew. Phew!! On the third night our keycard would not allow us access into the lift or to our room. I went to reception three times and eventually it worked. However, the room had been cleaned and they had changed the duvet cover with a cover which had stains on it and the bathroom sink was covered in pubic hairs. I went to reception to complain and the receptionist and duty manager informed me very bluntly that their policy is to change the duvet cover after the 4th night stay and therefore it must have been the duvet we had been using. They were both very rude and incorrect. We were allocated another 4 rooms and each room smelt badly, had stains on it and was not clean. When we were on our way to be shown another substandard room, the member of staff was talking to a colleague through a walkie talkie and we overheard them saying we were 'complainers' as we complained in Kew and to not give us another room. We ended up having a poor nights sleep on the sofa in the original room. We will never stay in Travleshodge again. The may be cheap, but even then it is not worth the money!", "Date": "October 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Out in the sticks", "Title": "“\"I don't have to justify that\"”", "Author": "Gottagotothecity", "ReviewID": "UR19479810", "Content": "Travelodge management should be ashamed of themselves. They have the potential of assets in their staff, but through shabby policies, no training and a total disregard for the satisfaction of their customers they are alienating most of their share of the market. We arrived at 12.30 on the afternoon of our booking. Planning to head into central London to shop, eat and see a show, we told the receptionist that we were here and that we did not need our rooms or room keys, we just wished to ensure that if we returned at 11/11.30pm later that day there would still be a room. Names and booking references exchange, assurances made, we left. Fast forward to 1130pm - No rooms (we had booked and paid for two doubles). We were promised a speedy taxi to the nearest available lodge (Heathrow Term 5) and the receptionist advised that the taxi would take @ 15-20 minutes, but to have free drinks while we waited. An inattentive bar man mutely shrugged to any question we asked and we gave up and helped ourselves to cups of tea. Taxi arrived.....driver didn't know where he was going and took us to the terminal building. AN HOUR AND A HALF later we arrived. Checked in swiftly and fell into bed. Next morning arriving back at Kew at 0930 the receptionist advised us that we still hadn't got rooms.....despite many promises the night before that whatever time we arrived the following day we would be checked in. I know it doesn't make sense, we did know that the hotel couldn't miraculously magic us a room on a Sunday morning when it didn't have one the night before. The duty receptionist did suggest that last night's shift said it to get rid of us! Then when I asked her why she had assured us of our rooms and booking security the day before and we ended up being shipped out to elsewhere, she told me \"I don't have to justify that\" Funny, because I would have thought that the first responsibility of your job was to look after your customers and do what you say you are going to do. To be fair, I do think that she did her job and did it well. I think she was let down by careless handovers between shifts and no set procedures for booking people in. Anyway, we finally were allocated one of our two rooms at about 11am and when we returned at 6pm we got the second. The final Griswold (National Lampoons vacation reference, for those unfamiliar) moment was when at midnight; I could hear tapping on the door next door followed by my Dad's voice. Then tapping on ours. The muppets had only allocated other suckers to their room. Only my Mother's love of double locking every room she ever stays in saved them from the embarrassment (and terror in my Mother's case!) of Mr/S Sucker getting into the room. When they returned to reception Mr Reception frog-marched them back to the room to get to the bottom of it. This ended up with my naked hubby sticking his head around the door (in the style of a tortoise emerging from his shell) and suggesting that we discuss it in the morning, while Mr Reception continued to ask to see our original booking confirmation. God help any of us had their been a fire, because Fireman Sam and his mates wouldn't have been looking for us.......surely this is basic health and safety at the least. Anyway, if you like the sound of any adventure weekend, with a bit of sightseeing and confrontation - Go for it!", "Date": "August 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Good Location, Design means Hotel can be Noisy”", "Author": "Perpetual-Motion1", "ReviewID": "UR19356890", "Content": "A clean hotel, with a good location. However, the hotel is L-shaped, with the front door of the hotel being near the crux of the L. As you can't smoke in any of the rooms, people congregate here to smoke and talk. They bring out drinks from the onsite bar and drink these here too. A group of young people attending a wedding were staying at the hotel when we were, and after the wedding ended, the came back to the hotel and spent several noisy hours outside in this location. The hotel manager did try to quieten them down several times, but was not sucessful. Unfortunately, the hotel has no air conditioning, and the night was sweltering, so we could not close our windows to the noise. If you stay, ask for a room facing the street to the side of the hotel. Should be quieter.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Good base”", "Author": "RachSB", "ReviewID": "UR18949153", "Content": "Just back from a trip to London where we stayed at this Travelodge. My only complaint is that the hotel was so hot and without air con, it was quite hard going! However, this is a typical Travelodge ie. clean, basic, everything you need, and at a fair price (we got a brilliant deal for Â£29). It is a 5 min walk from Kew Bridge SW Train service (30 min into Waterloo). I would stay there again if it suited what we wanted to do in the area.", "Date": "August 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "sale, cheshire", "Title": "“Give it a miss”", "Author": "merlot81", "ReviewID": "UR18305451", "Content": "Booked 1 night stay. Room generally unclean. We requested family room -when we pulled out the bed from under the settee it had not been changed since the previous occupant The reception staff were rude. Room not air conditioned and on a hot July night with the window open the noise from traffic and aircraft made it impossible to sleep", "Date": "July 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, England", "Title": "“Overpriced, not value for money.”", "Author": "Turmstrasse", "ReviewID": "UR17359090", "Content": "Queue on check in and despite having the confirmation of the internet booking on top of the reception, the receptionist asked me my name, how to spell it and had I paid for early check in. I had and suggested that she look at the confirmation on the desk in front of her. The room and bed was clean enough but the shower was covered in the previous guest's hairs. The shower head was also fixed and by no means was it a power shower in any shape or form. The breakfast buffet was ok. But on arrival 2 of the trays on the hot buffet were empty during the 30 or so minutes while we were there these were not replaced. The cost was Â£105.00 for a double room with breakfast and early check in. (Â£80. room only rate.) Not worth it unless on special offer.", "Date": "June 30, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ross on Wye", "Title": "“Mmmm, not really that good”", "Author": "memberRossonWye", "ReviewID": "UR17316591", "Content": "I know that the location is really good and London area hotels are expensive, but this souless hotel left me cold. I've stayed in plenty ofTravelodges before but this time the economies were very obvious and they grated. No wardrobe doors, a bathroom so small you had mm between the toilet and and the door, one towel (had to ask at reception for a second), one block of soap the size of a custard cream.... I could go on. Two things that really irked were a window that didnt open more than 2 inches on a very hot night (I think this was in case you decided to throw yourself out of it) and having to use your key card to operate the lift (security measure to deter unwelcome guests, made you feel like being in a low secuirty prison). I know Â£80 is cheap for a room near the Capital, but it made me think of Butlins circa 1950, which I suppose these budget chain hotels are. The Premier Lodge down the road is better and worth the extra Â£12odd!", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Very large spacious family room”", "Author": "JeebesLondon", "ReviewID": "UR16938492", "Content": "Very modern Travel Inn. Huge beds, very clean and staff really helpful. Handy for Kew Gardens. We drove there and parked across the road in public car park which is free Saturday night / all day Sunday. Limited underground car parking spaces which can cost Â£7.50 if there is room or Â£15.00 if there is no room in Travel Inn reserved spaces and you have to park elsewhere.", "Date": "June 15, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berkshire", "Title": "“Excellent crash pad”", "Author": "GeoCroc", "ReviewID": "UR16935029", "Content": "Stayed here on the night of my company's big summer party. Living outside London I wanted somewhere cheap by comfortable so I didn't have to disappear early in the evening to catch the last train home. Not stayed in a Travelodge for a while, but this was comfortable and clean. Easy to get to, particularly from Central London, and then a short walk from Kew Bridge station. Man behind reception on arrival was a bit grumpy and uncommunicative, but the woman the next morning was very pleasant and chirpy. Traffic noise was a bit of a problem, particularly first thing in the morning, and if its a warm night you'll need the window open as there's no air con. But overall, a good budget find, and if you book early better value for money than other Travelodges elsewhere in London.", "Date": "June 15, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Nottingham UK", "Title": "“good base to explore central london from”", "Author": "DavidGill", "ReviewID": "UR16699787", "Content": "Stayed for 2 nights, bargain at Â£29 a night, when booked well in advance.Good base to explore central london from.5 minute walk to kew station and 30 minutes into london.Check in staff not terribly helpful but room was fine.Clean and comfortable.20 minute walk to kew gardens.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Cheap, simple accomodation, perfect if you are 3-4 on a budget”", "Author": "Hemsedal", "ReviewID": "UR16214781", "Content": "Stayed here one night in February, and they offer a simple good service that delivers just what it promises. For under 80Â£ its good value and one room can easy hold 4 people if you are on a budget. For business travelers it offers a good size desk and internet access. Parking is secure. All you need, no more, no less. There is nothing to do outside the hotel, its in the middle of nowhere, but there is nice Thai place and a McD just down the road. My problem with London hotels are the carpets and this was not any better. Sleep with the window open.", "Date": "May 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Good value”", "Author": "SteveLlanelli", "ReviewID": "UR16198173", "Content": "I've stayed at this Travelodge several times on business and have no complaints. The staff have always been friendly and helpful and the rooms clean, tidy and modern. The bar and restaurant are ok, but we tend to eat out in the evening. There's an excellent Thai resteraunt about five minutes walk away, turn right outside the hotel and it's just past the Premier Inn. The underground car park and open air car park are very handy. It's now Pay and Display, but reception staff are happy to provide change. The charge is Â£5 for 24 hours. Two small things, there was no bath, but I didn't request one! and I do wish that Travelodge and Ibis would wise up, spend a small amount of money and put hairdryers in their rooms.", "Date": "May 19, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "isle of man", "Title": "“dont bother”", "Author": "IsleOfManMarzy", "ReviewID": "UR14909024", "Content": "this hotel is dirty the staff are unhelpful if you say the food is not good the will not serve you any more for the lenth of your stay even if it is one person out of a group of 18 they bar had run dry and they wiuld not stock up any of the pumps they ran out of coke so went to the super market round the courner and bought botttles for 1.45 and charged 1.95 for a glass they never changed the bed linnen or towels in our stay and we were their 4 nights they allways ran out of food at breakfast and watch out for the rats out side the hotel in the raised flower beds you only get one key card we loved london stay away from the hotel", "Date": "April 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Most impressed”", "Author": "CEWEngland", "ReviewID": "UR13449608", "Content": "I stayed here for two nights with friends, and I didn't choose the hotel but wasn't expecting much. I was therefore pleasantly surprised to find it appears to be a brand new Travelodge with bar and restaurant, and also a a secure underground carpark. The rooms we had were clean, modern and had everything I needed (with the exception of a hairdryer). For Â£29 a night, you simply couldn't fault it! We paid for the hot and cold buffet breakfast on both mornings and it was great value for money. Location wise, the hotel is a 10 minute walk to Kew Bridge station (and from there 30 minutes to Waterloo) and a 20 minute walk to Kew Gardens, or 10 minutes on the bus into Richmond. In my experience, Travelodges tend to be a bit hit and miss, but this is a great one both in terms of the hotel itself and the location. I can highly recommend it!", "Date": "February 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great location but inconsistent with service”", "Author": "flyby21", "ReviewID": "UR13254499", "Content": "This hotel is in a great location between Kew Bridge and Brentford. Nothing much going on in Brentford but gives easy access to get into London, onto the M4, Chiswick & Richmond. Buses stop just outside and Chiswick is about 15 minutes walk or 5-10 minutes by bus. 15-20 minutes bus ride is Richmond. A 20 minute direct train into Waterloo leaves every 15 minutes from Kew Bridge. 5 minutes walk away. South Ealing is the closest tube and a bus will take you right to the door of the hotel. Boston Manor is not near at all. Kew Bridge tube is also a good 20 minutes walk away. Restaurants and bars are poor around Brentford - McDonalds is close by and the Thai restaurant is good. I've never eaten in the lodge's restuarant. Premier Travel Inn is just down the road and the rooms have air conditioning which in the Travelodge they don't. Windows will only open a few inches and in the summer the rooms are like saunas. This was often a complaint from customers during hot nights in the summer. Holiday Inn Express by the canal at Brentford is very nice and more of a business hotel - like the Premier have well decorated rooms and air conditioning. The bar and restaurant is also very good here. The rooms in the Travelodge are functional and clean. Some have baths and others don't - request a room with a bath if needed. If you are a non-smoker watch out if you arrive late as the hotel will check you into a smoking room and there is a strong smell of smoke. Disabled rooms are available and are spacious. The staff would often try and book me into one which wasn't a preference. Family rooms are good and have a comfortable sofa - I would request these rooms at check-in at no additional cost and request a front room facing the Thames. Ground floor rooms are closer to traffic noise and main entrance. There is a small seating area at the main reception and a microwave is available. Somerfields is about a 5 minute walk away. The Travelodge appears to suck all the goodness out of new recruits who start very enthused and gradually lose all motivation and acceptable behaviour when serving customers. I have witnessed many arguments directed by staff at reception to customers and a general stressed or unenthused manner. Check-in can take a long time and there is never enough staff on. I have experienced reservation problems where there has been no booking - only to be found on a different system at the main reservation call centre! The staff have a transactional approach to service and don't expect any kind of recognition if you have stayed there previously - I never did and they don't enter into any kind of rapport building. Overall - they do their job ok and it is noticeable when someone is in a good mood or is motivated as they have just started. Breakfast is inconsistent as it will sometimes be left outside your door and other it won't. There was times that they ran out of breakfasts and would not offer a sandwich as an alternative. For easy London access, Kew Gardens, Chiswick and Richmond this hotel is ideal but expect to get the bare minimum around service when staying there.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Great for London if you're driving to the capital”", "Author": "ChrisMancs", "ReviewID": "UR12330815", "Content": "One of the more modern Travel Lodges and always had good rooms when staying here. Situated just by the end of the M4, it is ideal for driving to London and dumping your car then using the bus, tube or train during your stay. Chiswick is a short hop away, with a few underground stations and plenty of pubs/bars/restaurants...and a few familiar faces off the telly if you keep your eyes open! The hotel itself has an underground carpark and also outside parking. There is an onsite restaurant although I have never used it. Staff always been pleasant. There is a Sainsbury's in Chiswick and a small Tesco which stays open late on the Chiswick High Road. If you are driving to London then Kew Bridge is outside of the Congestion Zone.", "Date": "January 4, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "birmingham", "Title": "“Some problems”", "Author": "gadaboutBirmingham", "ReviewID": "UR11602025", "Content": "Travelodge Kew is quite a distance from central London, i got the tube to Boston Manor and then a taxi which cost Â£6.00 takes about 1hr so not ideal if travelling with children. The hotel charges Â£10.00 for early check in I arrived at 2pm and they wanted to charge me Â£10.00 even though my room was ready but if i waited till 2.30pm there would be no charge - I waited. Car parking is Â£5.00 per day. I was staying on my own and there are no phones in the rooms on the second night there was arguing, shouting and banging on doors in the corridor outside my room I had no way to contact reception and felt very vulnerable. Travelodge do not display the hotel phone numbers anywhere so could not contact them from my mobile. Although the price charged is cheaper than more central hotels the extra costs and time taken to travel out to kew bridge outways the savings.", "Date": "December 16, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“It's a Travelodge”", "Author": "Jabei", "ReviewID": "UR8489250", "Content": "I don't usually review Travelodges as I stay at a lot through work and, essentially, they are all the same. This one was worthy of note though because of the staff. I arrived late and was given a smoking room after booking a non-smoking...Not a good start...then they key wouldn't work...twice..and a master key had to be used. In the end, I got in and went to bed. Next morning, I was presented with a free breakfast voucher and not charged for my overnight parking. I suppose, I would have got these concessions if I had made a scene and complained, but it was a pleasant surprise to get them without prompting and as an acknowledgement that there had been problems with my stay. Congratulations to the staff on duty.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wolverhampton", "Title": "“A good find”", "Author": "roles", "ReviewID": "UR8355860", "Content": "This travelodge was a really good find. Like most Travelodges, the family room (2 of us) was spacious and clean. The location was perfect for us. We wanted to be in easy reach of London, but be out of the rush and to have a decent, but reasonably priced place to stay. The staff were helpful and although we paid a bit more for transport to get anywhere, the No 65 bus came past the front door every 10 minutes or so (and I think, runs all night). We took this in one direction to get to the South Ealing tube station to get to London and in the other direction to get to the Kew Gardens main gate. With an Oyster card, each trip cost Â£1. The room had a window looking out on the Thames and a corner of Kew Palace, in the Gardens. I wish we were allowed to open the window a bit more, though... 'health and safety rules' they said. The hotel cafe/bar was not cheap and had the feel of a hospital canteen, so we chose not to eat there and found pubs in Richmond (a short bus trip away) and a nearby Somerfields (a longish walk) to feed ourselves.", "Date": "August 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "dalston", "Title": "“good value travelodge”", "Author": "havenexile", "ReviewID": "UR8126991", "Content": "Another good value travelodge. Everything nice and clean. Helpful staff. We were going to Twickenham, and got a bus outside the travelodge, and walked back - it was a long walk but not a problem. It also has a very nice bar.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bristol", "Title": "“Bad check-in staff”", "Author": "pmcpb", "ReviewID": "UR7935305", "Content": "Room was OK. Problem was the first member of check-in staff we had to deal with was rude and un-cooperative. We arrived by train and had our bags. Tried to check in early (12.10) and were greeted by shrugs and '3 o'clock is check-in time'. I know it's not always possible to check in early, but for no rooms to be available, it would have had to have been full the night before, and it didn't look like it. Asked to leave our bags and she said we couldn't because the police had told them not to. This seemed odd as we'd been in a hotel in central London the day before, and there'd been no problem there, so we were out on the streets again for over an hour. The second member of check-in staff couldn't have been more pleasant, though!", "Date": "June 19, 2007"}], "HotelInfo": {"Name": "Travelodge London Kew Bridge", "HotelURL": "/ShowUserReviews-g186338-d262460-Reviews-Travelodge_London_Kew_Bridge-London_England.html", "Price": "$97 - $175*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">North Road, High Street</span> | <span class=\"extended-address\">Brentford</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">TW8 0BD</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "262460", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a2/b5/a2b50b5aeb93a04b02212b5922f632331large.jpg"}}