{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Beautiful! We will be back!”", "Author": "adasmith", "ReviewID": "UR25846072", "Content": "My friend and I were looking for a hostel to stay last minute on a busy booked up weekend in Sydney but found this serviced apartment for a great deal and scooped it up. Great location, right near Kings cross but it the safe, non-sketchy part in Elizabeth bay. A park is right behind it on a little harbour. I really got the local feel staying here. Cute little balcony looking over the street. The staff was medium to very friendly, and very helpful. It felt safe and quiet and was very roomy and clean. Loved it!", "Date": "March 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nz", "Title": "“lovelly staff and good clean rooms”", "Author": "jasonnnz", "ReviewID": "UR21614773", "Content": "i liked this hotel, good clean rooms, although the building is a bit run down but they doa good job keeping it clean, it has a lovelly garden, but that means there is a few flies around i had to use insect repelent, but they provide fly sprays in the rooms if you decide to sleep with window open. while i was there they were upgrading their fire systems so a little bit of noise, but over all i liked it and i would go back again.", "Date": "November 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Affordable”", "Author": "aimantakkisah", "ReviewID": "UR15487407", "Content": "I stayed here for 6 nites with my family (3 children). I have requested a family unit. Upon arrival 10am I was immediately given a unit which was not in the same buiding as the motel but was directed to another unit accross the street. The unit has full kitchen facilities inclusive of stove, oven, microwave, utensils, pots and pans. In terms of the beds, there was 1 single bed, 2 bunk bed and sofa bed. A dvd player and flat tv. The unit is more like an apartment on its own. It is located 7 minutes from the King Cross Station which is convenient as it is 2 stations away from Bondi Junction and Town Hall which is mainly the shopping area. I took the airport shuttle from the airport (AUD$12 per person) and took us 30-40mins. Overall, I would recommend this place for budget conscious people like me and just a place to sleep comfortably. The previous week I had also stayed in Westin Sydney which was more expensive and the expectation is different when you are paying half the rate you are paying there. In conclusion, it is usually 'you get what you pay'.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Wellington", "Title": "“Bugs!”", "Author": "moose08", "ReviewID": "UR14953109", "Content": "We stayed here for three nights while in Sydney, it seemed like a reasonably priced hotel with a great location. When we arrived there was flyspray in the room which we thought was a bit odd but soon realised why after our first night when we found three different types of bugs and fleas in our bed. We complained and they moved us to another room, insisting that this had never happened before. I opened a cupboard in the new room and there was a flea bomb inside. We were bitten the following two nights allthough not as badly as the first night there. The bites didn't bother us too much at the time but a week later they are extremely itchy, swollen and infected. We have over a hundred bites each on our faces, arms, legs and well, pretty much everywhere. Stay here at your own risk.", "Date": "April 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Perfect Location, great little budget hotel”", "Author": "MinandSteve", "ReviewID": "UR14753395", "Content": "Stayed at Roslyn Gardens Motor Inn with my partner and child in a family studio. The apartment had a Queen bed plus a single for our 4 year old. The bathrooms were basic but clean, good water pressure. The kitchens were compact but self contained, we ate most nights at home and enjoyed the garden views from our balcony. Staff courteous and helpful with directions/tours/maps. The best part though was the location. We had stayed in the CBD in the past but loved Elizabeth Bay. Easy walk to city even for our little one. Beautiful big harbour park (can't remember the name) near to the hotel which we lazed around in after our big days touring. Great little hotel.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "a", "Title": "“fantastic location and hotel”", "Author": "maraptco", "ReviewID": "UR14132483", "Content": "hey i booked this place for my parents they came to see me. great place free parking amazing location and top it off it was only $130 a night. the rooms have a kitchen too so it really was great to have my mum's baked meals again... really loved it..", "Date": "March 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“Not worth the money”", "Author": "Up-from-down-under", "ReviewID": "UR12965272", "Content": "A budget standard hotel asking three star prices. If you have no option, and very little money its just passable for a night. If you're staying longer go elsewhere.", "Date": "January 24, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Location": "2", "Value": "1"}, "AuthorLocation": "uae", "Title": "“Do not stay here if you if you dislike overprice backpacker family room”", "Author": "slee10200", "ReviewID": "UR7553231", "Content": "The family room and standard room is way overpriced. it is old, ugly, and definitely for backpackers. watch out you have to pay 2 days penalty is you decide to move out early.", "Date": "May 7, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cambridge, England", "Title": "“Great value for money”", "Author": "Annaw1602", "ReviewID": "UR5422825", "Content": "I enjoyed my stay at Roslyn Gardens. I stayed in a single room and had all facilities I needed, including internet access and laundry service. Kitchen facilities were good and room was a decent size. The bathroom was small and would have liked some blinds for the windows, but overall a good stay. Am returning in August for a week!", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Singapore", "Title": "“Overpriced lousy back packer Roslyn apartment”", "Author": "A TripAdvisor Member", "ReviewID": "UR5337502", "Content": "This apartment is self-rated as 3-stars apartment when it should be categorized as back packer inns with attached bathroom. Imagine staying in a tiny studio apartment, arrange in dormitory bed style but charged a 3 star hotel price? Kings cross hotels are better deal for the same price or cheaper price. Definitely not worth the money. besides, you will be charged two nights stay if you want to cancel/shorten your stay. I would suggest booking just one night stay and decide if you like to stay longer.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Liked Roslyn Gardens”", "Author": "hollandgirl", "ReviewID": "UR5298761", "Content": "We spent 4 nights in this Apt. Hotel and found it to be an excellent deal. Living in NYC, we did not find the location very noisy, just keep the windows closed. We were on the 3rd floor and liked having a balcony. Would have liked additional sheer curtains for privacy. Bathroom and shower are \"cozy\" but clean, towels are changed every day. Kitchen is serviceable. Would have liked a remote for the TV. Elizabeth Bay is a quiet residential area behind Kings Cross, The location is excellent, bus around the corner, walking distance (20-30 minutes) to most sights, supermarket on a nearby street, free computer use in the lobby (next to the curled-up cat!). Staff very friendly, offered to mail my postcards on our last day.", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Highbury S.A. 5089", "Title": "“Take your Earplugs”", "Author": "ojnab", "ReviewID": "UR5044258", "Content": "The Roslyn Gardens Serviced Apartments are situated near two busy roads, traffic noise volume can be extensive, consequently we had to buy earplugs. The building itself is four stories high and most likely built in the 1960's, little has been done to upgrade the facilities. Four nights were spent here and quite frankly we were glad to leave, it is basically a motel with an added cooking area, we ate out, cooking facilities were not good, little crockery supplied, mostly chipped or cracked, there is only one curtain on the windows. The front of house staff were very friendly and helpfull, but we will not be staying there again.", "Date": "May 9, 2006"}], "HotelInfo": {"Name": "Roslyn Gardens Service Apartments/Motor Inn", "HotelURL": "/ShowUserReviews-g255060-d263590-Reviews-Roslyn_Gardens_Service_Apartments_Motor_Inn-Sydney_New_South_Wales.html", "Price": "$133*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4 Roslyn Gardens</span> | <span class=\"extended-address\">Elizabeth Bay</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2010</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "263590", "ImgURL": ""}}