{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockton-on-Tees, United Kingdom", "Title": "“Good value and location”", "Author": "nicuola", "ReviewID": "UR128003933", "Content": "After having read the reviews I was obviously worried! But to my surprise the hostel was great! Easy to find, 5-10 min walk from the train station. Lovely helpful staff. Stayed in room 103 on the first floor ( thank god the stairs are steep! But to be expected in this type of building!) 4 bed private room. Lovely and clean - especially the bathroom! Beds were comfortable too. No sign of any mice but then we took notice of the signs and didn't take food into out room. Great location for access to Dam square/ red light district and other central locations. Always felt safe. Thank you for a good stay! My rating of excellent is in relation to the price paid and general expectations. It's a hostel. Don't expect the world but good value base for seeing the city!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bonn, Germany", "Title": "“Good location, bad environment”", "Author": "Mark F", "ReviewID": "UR123960571", "Content": "I stayed here with two of my friends for three days. It has a really good location close to the Dam, and also it's quite cheap. The staff is also very friendly and good English-speaker, but these are all positive things about this Hostel. The rooms are overcrowded and not very clean, you have sleep with 5-7 people in a really small mixed room. Security is also very poor, there is no safety locker, you have to keep your belongings in your room, where people go in and out every time. Therefore it was not surprising, when during our sleep somebody has robbed us. If you have chosen this Hostel, You would mind your belongings, and stay in the Hostel as little as you can. All in all, I do not reccomend this Hostel.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“good stay”", "Author": "pabzy", "ReviewID": "UR122808195", "Content": "stayed here with three friends, after gettting of the train we headed down the road with friends looking for a cheap hotel for the week, as we had not booked in advance, everywhere was full we were getting a bit worried and bored, then we found this place 30 euros a nite, stairs very steep but thats just the way the buildings are roundhere, very clean with comfy beds, one of the first things he said was smoke as much as you want just open the window ! would return !", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Cheap and cheerful”", "Author": "MayColquhoun", "ReviewID": "UR120328550", "Content": "When we arrived there was a mix up with our card and apparently we had not paid for the hotel beforehand which we thought we had, the man on reception was not very helpful of empathetic even through my friend who had done the booking was very visibly upset about the mix up. After we got that sorted we eventually got up to the room, everyone is complaining about the stairs but they were fine, nothing worse than other hotels I have stayed at in Holland. The room was tiny, I am not sure how they managed to fit three bunk beds in the room but it was far too crowded for 6 people and was a bit of a challenge, we couldnt all stand up and once and it was a bit like playing musical chairs. The beds were comfy enough and the bedding was clean etc. The best thing about this hotel is the location, its good as a place just to crash but don't book here if you are planning on spending much time in your room or you are off for a romantic break!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't do it”", "Author": "Valentinoaustralia", "ReviewID": "UR120326262", "Content": "My brother and I checked in here for a 3 night stay, but after finally getting the wifi to work, promptly checked out. I dont have time to list all the problems but I'll try to sum them all up, it felt like a people smugglers boat had been turned into a hotel. Don't stay here!!!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pekin, Illinois", "Title": "“Nice and clean”", "Author": "p g", "ReviewID": "UR118981340", "Content": "location was excellent. Close to everything!!!! helpful staff, Windows lookind on gothic Niewe Kerk! lockers and safe on the reception and Kitchen for free use on the ground floor. Free fast WI-FI! Supermarket neraby,i would recommend to stay there.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California, United States", "Title": "“Karma -- They Shipped My Cell Fone -- and Paid the Postage!!!”", "Author": "Rachel K", "ReviewID": "UR118914363", "Content": "My daughter and several friends on a semester abroad in London stayed at the Mevlana for a long weekend. I assume their stay was fine but my comment has to do with the kind compassion demonstrated by the management. Checking out in a rush, my daughter left her cell phone in the room. When she arrived in London, she phoned the Mevlana and spoke to the manager who went to her room, located her phone and promised to mail it to her. We were dubious to say the least. After a few kind, comforting emails back and forth from the manager, my daughter was reunited today with her cell phone, which of course contains her entire life (phone numbers, photos, calendar, etc.). The manager refused to be reimbursed for the overnight mail postage. The kindness displayed by the Mevlana restored my daughter's faith in humanity, and I believe deserves our strong recommendation. This is a great place for visiting students to stay. Thank you Mevlana!", "Date": "October 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Great Stay at the Mevlana”", "Author": "surfdogs88", "ReviewID": "UR117572487", "Content": "Did book a trip to visit friends. Than hosting did not work out so i booked at Mevlana. I had a bed at the 2nd floor in a 4 bed dorm. A sink and a TV and 2 bunk beds. Very clean sheets and good sheet and pillow. There is only one shower and one toilet for 4 rooms but this is kind of standard at this places. Every day the rooms are cleaned and over all the place was very clean for a hostel. Downstairs they have a little coffee place where you can get snacks and drinks. There is free WIFI at the place and they have one computer free for guests. There is a little kitchen with a microwave and fridge. The place is run by very friendly people - every question you might have - they try to help. Close to the train station as well as the dam with public transport in front of the door. Also a very big Albert Heijn supermarket only 2 minutes away.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Very Surprised and Would Happily Come Back!”", "Author": "reddog91", "ReviewID": "UR114715524", "Content": "We visited as a group of 5 and after reading some reviews were not expecting a lot of the hostel. Our group had the private room on the top floor (up many stairs and a ladder) we were very impressed with it and the girls in the group were delighted there was an en-suite shower room. The room was tidy, clean and the beds were comfortable the reception has free internet access (hostel also has free wifi throughout) pool table, kitchen and serves drinks and light snacks; we found this to be handy in the early hours of the morning. The best bet though is to buy some beers from the supermarket down the road as they are quite happy to let you drink your own beer. Location wise the hostel is located a 2 minute walk from dam square, 10 mins from centraal station, 10-15 mins from red light district.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Could be much better”", "Author": "christianacoespinaco", "ReviewID": "UR107767736", "Content": "Im a guy staying in this hotel, and the first 2 days i' ve been quiet good. Well, I complain cause the chinese workers who are working here they try to make me pay every day more and more.... whatever.... What I complain about is that you are allowed to smoke, but is also you responsability to take care with the fire alarm. So if you are going to smoke better disconnect the fire alarm, otherwise the chinesse workers they will shout you and they will misstheat you like it hapenned to me.... And the last thing but also important is that the say every where they have free wifi in the hotel. THATS A LIE. It does not work and they don't give solutions.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Does what it says on the tin!”", "Author": "JamieT1992", "ReviewID": "UR106655262", "Content": "Arrived here after a fracas with Hotel Princess and it was satisfactory for our 3 day stay, Toilets/showers were not cleaned in 4 days so we took it in turns to clean it ourself, beds were never made/changed while we were there but 6 guy coming home drunk/stoned everynight didnt really care what state the bed was in to be honest. Staff were incredibly friendly and helpful with anything you asked them directions,sights,fresh towels etc. After reading a few reviews on here which say the rooms smell, we did at points in our stay all believe we could smell urine/feces but didnt know if this was because of our sobriety or we were just being silly, also noted on the site people complaining of rodents, i never once saw any mice/rats but i did have an encounter with their cat which is obviously used as a detterent. all in all i would recommend this hotel for its friendly staff and for being close to all main tourist attractions 3/5!!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tampere, Finland", "Title": "“Rats are in the rooms, no invoicing, corrupt and lier Chinese manager...”", "Author": "Totario", "ReviewID": "UR102464977", "Content": "1. We were constantly asking for the bill/invoice but just got promised every day (\"next day\") so at the end we have not got any invoice...of course it might be better for the hostel management to avoid paying tax after our stay...That is why the case is going to be reported to different Dutch authorities and Police and the preliminary report has been signed by 6 visitors. 2. There were couple of rats in 2 of our rooms and the only thing that the Chinese hostel manager was willing to do was that \"his cat could check it\"...No comment, he was absolutely serious...These Chinese owners' behavior was very far from European norms... 3. The toilet was incredible dirty every day (we spent 4 nights in the hostel). 4. The internet did not work on our floor, the Chinese was telling lies that he would check and repair it but never happened, of course... 5. The stairs were very narrow. 6. Basically everyone could easily get in to the hotel since you just have to ring the bell but no real face controll with identifying the person. 7. The location was good. 8. Some of us moved to another, nice hotel situated 200metres from this crappy one (because of the rats in the rooms) but the hostel manager was not willing to pay any compensation back...That is why the case is going to be reported to different Dutch authorities and the preliminary report has been signed by 6 visitors.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Mice”", "Author": "Jack188590", "ReviewID": "UR97898650", "Content": "If you are a rodent fan then you definately need to stay here. WE arrived to find the room incredibly cramped with three sets of bunk beds pushed close together. The room was smaller than a pool table. On the second night of our stay we heard rustling coming from the corner of the room. We discovered a mouse upon futher investigation. After we looked around to check our stuff another mouse ran out of the bags. this place is a rundown dump that should be shut down. I don't think that im being petty when i ask to change rooms because of a mouse. i think it's my right to move rooms and not be split up when there is mice around. absolute disgrace!", "Date": "February 24, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Alba Iulia, Romania", "Title": "“very good location, but small room”", "Author": "PaulaMuntean", "ReviewID": "UR95457322", "Content": "the room was very tiny, but considering that every locotion from amsterdam, the central and historical part is small i coul say it was ok. the location of hostel is very good, right in the historical center of amsterdam", "Date": "February 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“one star for the price of three”", "Author": "teddysdaddy", "ReviewID": "UR91191384", "Content": "What a disappointment! Reception is in a bar dominated by a pool table, stairs are near vertical and grubby, room is just bigger than the bed. This is student accommodation and if you get student prices, it is OK. We took one look and departed after agreeing a refund for our 3 day visit. Despite pushing from booking.com they subsequently denied this and kept the money. We found an excellent 3 star hotel in the same street at the same price. The bathroom alone was bigger than our bedroom in the Mevlana. We chose this based on the Michelin Guide. They should stick to tyres & food if this is their standard.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“At least we got most of our money back”", "Author": "rssd", "ReviewID": "UR79967371", "Content": "First, the good: We got an almost full refund. Now, the rest: When we made our reservation we discovered it was a weekend when all hotels in Amsterdam were already fully booked due to a technical conference of some sort in the city, and so we had to pay double their normal rate, which was fine because we agreed to it and knew exactly what we were doing. What wasn't fine, is that we booked a non-smoking double room, and once we paid our 10 euro key deposit and got up to our room, we discovered we got a twin room with an ashtray on the table and unbelievable cigarette stench in the air. We went down to reception, and were told that we can't be given a different room because everybody had already checked-in, but we can move the beds together if we want, and - wait for it - we can either smoke or not smoke in the room. That, by the way, was only after the receptionist tried to convince us that the smell probably came from one of the neighbouring rooms, which it most certainly didn't. When we voiced our disbelief at the answers we were given, she said we can also cancel the room and be refunded the money we paid, even though it was a non-refundable reservation (hence, the good part). I think it's probably a good opportunity to remind you now that we paid 235 euros for this room, and that this was a fully booked weekend in Amsterdam, when there was no way in hell we were going to get a room in another hotel, whereas the marvelously unwelcoming hotel Mevlana will surely find another couple to stick in that room in a matter of minutes. Anyhow, we decided not to stay there - thank god for relatives in Rotterdam - so we got back upstairs, dragged our luggage back downstairs to reception, and were told we won't be getting our 10 euros key deposit, because now they have to order the cleaning people again. This is, of course, quite a cheeky claim to make, as the reason they now have to call in the cleaning people again stems from their very own utter lack of respect towards paying customers, to say the least. They wouldn't budge on that, because as they see it - I obviously have to pay something for their mistake. So I guess it all comes down to our freaking 10 euros buying us - apart from the need to lug ourselves and our luggage all the way to Rotterdam - also the right to make this rant. If it wasn't clear, here's the bottom line: if hotel Mevlana will one day be the last hotel not only in Amsterdam but on Earth - I'd still never sleep there.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Terrible - Stay away!”", "Author": "candy_skies", "ReviewID": "UR71937266", "Content": "This place is a fire hazard and unsafe. They crowd 3 bunk beds into a room that cannot handle it. The rooms are cramped and not all of them contain lockers or lockers that fit a backpack! The showers smell and there is only one shower and toilet per floor (for approx. 18 persons). The location is handy, but that is about it. You complain about something and it goes unnoticed. For example, we had a guy staying in our dorm who brought a friend home - where there were only supposed to be 6 of us in our dorm, but then there were 7 and the 7th \"stoner\" snored and slept on the floor. There is no control over who is accessing the building as the reception is in another building. You can't open the windows for fresh air as the bunk beds are cramped up against the windows. They do not have a restaurant or kitchen to use. The stairs are also an issue - the whole place smells and gets hotter as you go up the stairs. The floors in each room are also slanted, on an angle. The walls are paper thin so you can hear everything that is going on in each room. They do have free wi-fi - but it is continuously broken and does not work well at all. This place is a rip-off. Stay away.", "Date": "July 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "California", "Title": "“Great location and very safe!”", "Author": "calidude1989", "ReviewID": "UR66067444", "Content": "just outside of the redlight district, it had a great location. It was also really close to the central line which we used almost every day. Didn't have to worry about random drunks coming in and making noise because they compared i.d.s to a guest list at the door. Would definitely recommend this to anyone looking to have a great time in amsterdam", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Alright”", "Author": "cmabone", "ReviewID": "UR64068041", "Content": "It is close to the best part of Amsterdam. The rooms are small, but the staff is friendly.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good times”", "Author": "AdriannaJH", "ReviewID": "UR7802814", "Content": "It does'nt seem like anyone has stayed in this hotel lately as there are no recent reviews. Well we just turned up in amsterdam and did not have a hotel to go to. One hotel was not to nice and on our second try came across this one directly. We was given a key to view the room first and liked it immediately - very clean and airy. Rooms and bathroom looked newly done and even the outside shared bathroom was exceptionally clean. Good location also everything well within easy reach to get to as just behind Dam Square. Very enjoyable stay. We will be staying there anytime we go back to amsterdam. As i have read in many reviews the hotels the stairs are serious - but that did not affect my stay in anyway.", "Date": "June 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Great location and price”", "Author": "bfmbaker", "ReviewID": "UR5622724", "Content": "The Mevlana Hotel was a great find after searching for hours at other over-priced hotels. My fiancÃ© and I were on the road from early morning until well in the evening. We were tired but picky. We didn't want to spend a lot of money on a hotel where we would only be for a few hours a night. The Mevlana Hotel was a great find. It was located near Dam Square and only a few blocks away from most of the museums. I would say that I couldn't have asked for a better location. We were right where everything was going on. The Hotel itself was very clean and bright. It was small but clean and very cozy. We both loved the Amsterdam Archetecture that the hotel had to offer (the small width but built a few stories high). We were located on the 3rd floor and had a room overlooking the street. It was a great view. This hotel also had their own kitchen/restaurant which was a family run business with the Hotel. The family was very pleasant and very attentive. Great people!!!! If and when we return to Amsterdam this is the place for us. -The Hennessey's", "Date": "August 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great find”", "Author": "A TripAdvisor Member", "ReviewID": "UR3692332", "Content": "Having walked around Amsterdam for 2 hours looking for somewhere to stay I was regretting not having booked somewhere in advance. It all worked out for the best though as it meant I stumbled across this great budget hotel. It is now my preferred place to stay in the Dam - clean, good location, helpful staff. Only the stairs might cause people problems, there are a lot of them!", "Date": "July 22, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego, California", "Title": "“A Surprising Slice of Heaven”", "Author": "Nytshade", "ReviewID": "UR1089259", "Content": "After a long train trip and a real bad experience at another hotel that turned out to be something out of the movie Trainspotting, we came across the Hotel Mevlana. This surprisingly nice, little, no-frills hotel is perfect if you are in Amsterdam on a budget. Along with clean rooms and shared facilities, is a fantastic Turkish restaurant on the street level. The people who own and operate the hotel were very friendly, albeit quite, and very helpful in suggesting places to go within Amsterdam, and did I mention the food? While the Ritz, it is not, it is ideal for a short stay over and/or for the backpacking crowd. Two thumbs up!", "Date": "June 14, 2003"}], "HotelInfo": {"Name": "Hotel Mevlana", "HotelURL": "/ShowUserReviews-g188590-d263964-Reviews-Hotel_Mevlana-Amsterdam_Noord_Holland.html", "Price": "$113 - $595*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Nieuwenzijds Voorburgwal 160</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012 SJ </span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "263964", "ImgURL": ""}}