{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Nice Stay”", "Author": "Kit K", "ReviewID": "UR128005640", "Content": "My boyfriend and i stayed for 3 nights and it was the perfect location in leideseplein city centre, with many bars and restaurants and coffee shops nearby. The toilets were really clean as well and the room that we had was spacious. The room was cleaned daily and fresh towels were provided on a daily basis. Overall this is a great hotel and it is value for your money! If you do not mind the noise, this is the best hotel for friends and young couples. :)", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Near to park and quiet part of the city”", "Author": "Can_Tun", "ReviewID": "UR126699392", "Content": "It was an average family run hotel. Rooms are small. Stairs are noisy. Think it just for sleeping. The receptionist - son of the owner - tries to upgrade your room.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cairo", "Title": "“Quiet, centrally located and reasonably priced - I'll be back”", "Author": "AlSt1011", "ReviewID": "UR126675622", "Content": "The Hotel Sipermann is a simple and functional hotel, centrally located within a five-minute walk from the tram and bus stations Leidseplein. I was in town on business for a few days and needed a retreat away from the louder crowds, who come to Amsterdam to let loose - but at a reasonable price. The Sipermann is just that: A no-frills, uncomplicated, impeccably clean and very reasonably priced accommodation, but still located in-midst of the city. It's also right around the corner from the beautiful Vodelpark. One thing that may be an issue for guests at this hotel is the combination of a steep stairwell and lack of an elevator. This is not a fault of the hotel itself, but characteristic of traditional architecture in Amsterdam per se. I stayed on the top floor and consequently hauled my luggage up (and down) three flights of stairs - but this is also the case in many other narrow (read traditional) buildings in this city, hotels and private homes alike. The rooms at the Sipermann are relatively small, so they are better suited for people who spend less time indoors and more time on the town. Because the wi-fi did not reach to the 3rd/top floor, I was provided with an ethernet cable upon checking in. There's no wake-up service, so bring a reliable alarm clock. There is a 20 Euro cash deposit required for the house/room key, which you will get back upon checking out and a 7% surcharge for paying with cards.", "Date": "March 26, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Slovenia", "Title": "“Great location”", "Author": "revolution81", "ReviewID": "UR113153518", "Content": "We liked staying at The sipermann. If you only need a place to stay overnight and you plan to explore the city during the day this is nice place to stay. We managed to get a good deal directly at the owners of the hotel (25 Eur/person). We stayed in the room on top floor which was very small. Everything was ok apart from the sink in the bathrom which was hard to use due to awkwardly positioned shelf.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1"}, "AuthorLocation": "UK", "Title": "“stinky”", "Author": "br1000", "ReviewID": "UR111121699", "Content": "Hotel was overpriced. It was very basic. The place stank of curry which after 3 nights had got into my clothes. unless you're booking last minute its not the bast place to stay in amsterdam.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Krakow, Poland", "Title": "“Better than expected from these reviews”", "Author": "NathallieP", "ReviewID": "UR103048358", "Content": "College students stayed 3 nights in a 4-person room on the 2nd floor (American 3rd floor). It wasn't the top floor, so there were no slanted walls like someone here had mentioned. Ceilings were high, no stooping needed. The hotel was full with other young people, so there was not a 3-person room we could have switched to when one person in our group couldn't end up coming to Amsterdam. - Yes, the stairs are steep. (and as far as we could tell, no elevator) - Yes, there is a 40 euro key deposit, we got it back at the end. Unfortunately we only had 1 key card for room (so the 4 of us had to share) - Yes, there is a surcharge if you pay by credit card or if you arrive past 10pm, but there's a bank machine not too far to help solve the first problem. - Yes, there is a slight curry smell (but only in the reception area), as someone here mentioned, but I don't know why this bothered them. it's mild, not overpowering. - Someone on here said they didn't get fresh towels and bedding each day. So we were surprised that we DID get new sheets and towels and room cleaning every day! - Yes, the room is small, but it was spacious enough (even if all 4 of us had been there). We didn't have much baggage though, just backpacks. - I had a great sleep every night. My friends had some trouble sleeping because the beds were too soft for them (you might even say they were sagging beds... but again, I had no problem with this so it depends on you). - The owner was pleasant. (Didn't even give me dirty looks after I threw up in the stairwell on our first day.) - Supposedly there is WiFi, but we didn't try it out because we didn't bring our laptops. There is no computer there for guests. The location was great. Close to the museums and Vondel park, close to Melkweg where we had a concert to go to. Convenient to get around on the tram system. We went on a weekend so a lot of hostels were booked up or expensive. A 4-person room at Sipermann hotel was the same price or even cheaper than if we had paid for 4 dorm beds in a hostel, so that's a main reason why we chose this hotel (we ended up paying 33 euro each per night, while the popular hostels can jack up their prices to 45 euro per night!). Coming from Eastern Europe, I still found these Western prices a shocker. (I rated this hotel as a 4/5 value, but that's only relative to other Amsterdam options.) Overall, I definitely recommend Sipermann hotel to budget travelers who can manage steep stairs.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Health Hazard”", "Author": "Ibnbatuta1", "ReviewID": "UR100963788", "Content": "Booked the place through the tourism counter at Schipol; What they did not tell me is the steep staircase - 20 small steps without a bend! Most accommodation is on the first, second or third floors. I was on the second floor. Oh - the tourist board accepted fully payment at the counter. On reaching the place, they wanted a 'key deposit' of 40 Euros; Had no cash on me; The choice was to pay by credit card and yes, there is a surcharge for using credit card; The other option was to surrender my passport, for which no receipt was given; The room had a funny smell and felt like I was in some one else's place! The shower on the 2nd floor did not work well - There was either no adequate pressure for the water or it is designed to tick a box with the tourist board without actually providing what is needed. One of the many poor customer experiences in Amsterdam, that adds to the list of why the city as a whole is so over-rated and fails to deliver basic services despite an expensive price tag. The tourist board are also to blame for certifying such shoddy places Slept the first night, but the second night was up the entire night waiting for dawn!", "Date": "March 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Empoli, Italy", "Title": "“Wouldn't stay there again”", "Author": "Fabio M", "ReviewID": "UR76418934", "Content": "We did stay here one week. To make a long story short... what we did like: - the hotel is in a very good position, a few steps from the entertainment area of Leidsenplein and from some of the most important museums (Van Gogh museum, Rijksmuseum and Stedelijk museum). - the changed towels every day what we did not like: - the room was so small it was difficult to move in two persons and to find place to put our belongings; furnishing was dated except for the bathroom where, anyhow, all was minimal; no shower gel supplied, only two small soap bars for the entire week. - they kept a 40 Euro deposit for the electronic key: never seen in any other hotel I've been. - they make you pay 10 Euro for each hour after 10 p.m. in case of late check in: never seen in any other hotel too. We checked in before 10 p.m. but the booking terms of conditions stated that. - they charge you of a 5% if you pay by credit card, forcing you to arrive with a bunch of banknotes (as we did) if you don't wont to pay this surplus: again, never seen. - the price was unreasonable for what we got. I wouldn't definitively recommend this hotel.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Leuven, Belgium", "Title": "“sleep in the smell of indian take away”", "Author": "beop007", "ReviewID": "UR61934422", "Content": "rush upstairs to your room. Open and close your door very quick because terrible smell of indian cuisine all over the hotel. Terrible beds. Used towels. I would pay a little bit more for that extra comfort in another hotel", "Date": "April 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Thessaloniki", "Title": "“Nice hotel- would go there again!”", "Author": "Sapfo", "ReviewID": "UR60015271", "Content": "i stayed at the hotel for 3 nights in a 3-bed room private on the second floor.Apart from the stairs that are a bit difficult to climb,the room was bigger than i had thought. It was cleaned every day,not perfect but ok. They changed towels every day.The bathroom was big and there was hot water all the time. And also very quiet,never heard anything of a noise. we had to leave a deposit of 40 euro for the key that we got back on check-out The location is just perfect.Its 4 minutes walk from Leidseplein, 15-20 minutes walk from the Museums and 2 minutes walk from the wonderful Vondelpark. Also there are plenty of trams and buses outside the hotel. Overall i am very satisfied and i would definitely go there again.Great value for money.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "France", "Title": "“Charming and cute”", "Author": "mestable37", "ReviewID": "UR58724066", "Content": "I really liked this place. For Amsterdam, the place was actually big. For the price, it was located well, right next to some great areas and restaurants, and only about a 20 minute walk to the center (though we took longer from stopping at all the boutiques and stores on the way). Clean, and well organized. We were annoyed that we reserved a room with one double-bed, and one single bed...and when we got there, it was three single beds and the receptionist didn't even appologize for their mistake...oh well. There are some really steep stairs...and no elevator. We did not mind...but if you're mobility-challenged, then this is not the place for you.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Be careful of overcharging, cost and quality”", "Author": "Pipsicle", "ReviewID": "UR34384328", "Content": "The Sipermann has a good location and is in quite a picturesque street close to the museums. However, beware they don't overcharge you. Without asking us, they added 5% city tax, which Expedia had already said was included. Second, they added 5% for paying by credit card. Never had this before. They didn't even tell us before placing it on the card. The room wasn't terrible, but left a bit to be desired for what we were paying. The room had holes in the walls that needed filling and about six worn holes in the pillow cases. The whole place also has a strong scent of curry powder, which isn't bad if you're OK with it. Service was always graceous though.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bratislava", "Title": "“Good location, good price, good hotel”", "Author": "Milan P", "ReviewID": "UR31084142", "Content": "We stayed in Sipermann hotel for 5 days and it was great. We had a room for 3 people and it was big enough. It is also allowed to smoke in the rooms. Hotel is located in a nice street just 5 minutes walking distance from Leidesplein, Hard Rock Cafe and Vondelpark from the other side. Museum Quartier with Van Gogh Museum and Rijksmuseum is 10 min walking. In addition the tram stop is just around the corner. It is a family run hotel. Staff was nice and really helpful. No problem at all. Rooms are clean and big, towels were replaced each day. There is a 40 Eur deposit for the keys, but it was returned at check-out.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“Basic”", "Author": "BobYourUncle", "ReviewID": "UR28186690", "Content": "Sometimes, you don't have a choice when someone else books a room for you. You never know what their constraints are. I am not complaining - but it is with this trepidation that I entered the Sipermann. Its fairly commonplace I guess for the row houses in this part of the city to be converted into accommodations for travelers. And it is also commonplace for the owners to stay in part of the facility and rent out the rest. Consequently, the rooms could be a little \"tight\". The Sipermann is ideally located - close to the Vondel Park, where one can go for a run and close to a happening part of town - Liedesplein, walking distance from the hotel. This is where the attraction ends. The room itself is very small. The bath-cum-toilet will surely rank as the smallest that I have seen in all my travel. But then at the end of a long day - all that you want to do is to get back to a place with a roof over your head and with running water for your use. Additionally, the internet works well! The family will provide breakfast at additional cost - but I thought I'd be better off exploring the options close by. In short, if you are looking for cheap accommodation and are willing to cut corners (literally) then this is the place to go to.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Oslo", "Title": "“Very ok for sleeping”", "Author": "glennik", "ReviewID": "UR26312084", "Content": "I went to Amsterdam to visit a trade fair at the Amsterdam RAI, and had no other requirements to the hotel other than being cheep, clean and a bit slient. Hotel Sipermann fulfilled these requirements in every aspect. Its is not a modern or fancy hotel, which I did not expect, but for sleeping and showering it was just perfect. The room was small, clean and tidy. The location is actually really good, just a short walk from Leidseplain which is the restaurant area in Amsterdam, the tram and bus stops only a 100 meters from the hotel, there is a nice park just behind, and it is just a short walk to the Museumplein. So, if you just want a cheep and clean hotel, pretty central, hotel Sipermann is really ok.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london, uk", "Title": "“now better.”", "Author": "travel-lite-often", "ReviewID": "UR14626696", "Content": "hotel now fully renovated but still retains the character of an old dutch house.private facilites now in all rooms. breakfast room now gone but additional bedrooms on ground floor,ideal for less fit visitors. plenty of breakfast places a short walk away. room prices are still very good.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Good Place to Stay for the Money”", "Author": "myreallastname", "ReviewID": "UR11326042", "Content": "We were told that there are basically 3 types of hotel rooms in Amsterdam -- expensive, small, and dirty. Rooms at Sipermann are definitely small, which may shock you at first if you're not expecting it. The rates are very reasonable for Am*dam. Our room was *very* clean. Although it was tiny, the appointments in the room were fairly new, modern and nice. The bed was comfortable. We always had warm water and good pressure from our en-suite shower. The manager (owner?) and staff were nice and helpful for the few times we needed them. No WiFi, but the plug-in high-speed internet connection was solid and rocked! The location is perfect! Sipermann is nicely located in a quiet neighborhood about 2 blocks away from Leidseplein, several museums, Vondelpark, and several tram and bus lines. The stairs, like most of the older buildings in Am*dam, are quite steep and there is no elevator. Although the walls are solid, you can easily hear what's going on in other rooms around you. We were told by locals that we'd actually gotten a good deal by Amsterdam standards. Sipermann is not exceptional, but, in my opinion, a good value for an Amsterdam hotel. We'd consider staying there again.", "Date": "December 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Very charming place”", "Author": "muffinmanX", "ReviewID": "UR8206928", "Content": "We booked the Hotel Sipermann at the tourist office at the train station. Its most obvious attributes are its price (very affordable) and location (close to museums, leidesplein, etc.), but my friend and I found it to be a diamond in the rough. The room was expectedly tiny, but it was nicely furnished, had wood floors and a nice view, etc. The hotel itself is in a beautiful building on a quiet residential street just of the Vondelpark. The owner greeted us at the front door and was accomadating and very friendly throughout our stay. What the place lacks in size, it makes up for in charm, and who wants to stay in the hotel room anyway? The owner made sure to mention that his brother will be installing televisions in the rooms soon, so they've got that going for them, too. This is a great value, the perfect home base in an awesome city, and a fabulous alternative to the hostel scene.", "Date": "July 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Richmond, Canada", "Title": "“a big disappointment”", "Author": "tamagotchiboy", "ReviewID": "UR5947498", "Content": "Summary: Don't stay here unless you don't have an alternative. Booked this hotel with the help of the Holland Tourist Info Office at the airport. This was the only 2 star hotel available at that time and our alternate was a 4 star hotel which was 40 euros more expensive. We experienced both the room with shared bathroom facilites and also the room with toilet and bath. As mentioned by a previous review, you do notice the smell of indian style cooking and spices upon entering the building. I believe the people in charge live in the basement and the aroma of their cooking \"whafts up\" to the main corridors. It's actually a pleasant smell if you like east asian cuisine but not good if you don't enjoy that kind of food. The staircase is indeed narrow and steep. It was a struggle to bring our suitcase up and down the stairs. There is no \"sound proofing\" in these old buildings so we heard every step of everyone that walked pass our room. On some occasions that the other guests came back late at night, you are actually awakened by the noise they create. The beds we had in the shared bathroom unit were small, more like the size of cots, about 2/3 the size of a single bed. The shared toilet had a floor mat that was so dingy and gross. Don't know when it was last changed or washed as it was all matted down and dirty. For the shared shower, be sure to wear slippers when you go in. The grout is black and you can see mildew all over the edges. We had a chance to also stay in one of the bigger rooms. As mentioned also in a previous review, none of the furniture pieces match. The glass on the table top is cracked. There is literally a caked layer of dust on the radiator. A similar piece of floor mat can be seen in the toilet. The shower stall had strands of long hair dangling from the rubber mat. We brought along disinfectant wipes and literally wiped up layers of dirt from the cabinet. The size of the bed is just the size of the 2 \"cots\" pushed together. There is no free breakfast included. Breakfast costs 5 euros and has to be booked ahead of time. The rooms have a small TV which is located high above the cabinet. The only comfortable way to watch TV is when you are in bed. Otherwise be prepared to get a strained neck. The bed linen was clean and crisp on the first night. However, the blanket that was overtop of your sheets doesn't seem to have been washed and we got itchy after sitting on top of it. The sheets and pillowcases were NEVER changed through out our stay although they did make up the bed everyday. Towels were changed daily but bring your own soap as the we only got 2 tiny pieces of soap on the first night and never got any on subsequent nights. We also noticed that the cleaner placed the clean sheets and clean towels right on top of the carpets in the hallway. Honestly, the carpets in the hallway did not look clean. Hated to imagine sleeping in the same sheets that were on the floor and towelling yourself up in the same towels that were on the floor. As to noise, if you have the windows open, the traffic from the nearby street and sound of the trams are clearly heard. If we had known we would have spent the extra 40 euros for a better hotel. We have stayed in many 2 star hotels all over Europe and this one is by far the worse and least deserving of it. If the proper authorities are reading this maybe it's time for a reinspection and reclassification of this hotel. As we went around town we saw many other 2 star hotels that looked much better maintained. What a huge disappointment. Never will we stay here again.", "Date": "October 13, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Danbury, CT", "Title": "“Nice location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5413780", "Content": "Recently I stayed for the weekend at this hotel. It is a beautiful town house, located on a quiet street not far from leidseplein and museumplein. Public transportation is within 5 minutes of walking distance. But the room I stayed in was tiny (just big enough for a single bed) and the bathroom and shower are shared among the guests.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3927147", "Content": "Backs onto Vondel Park, small and cozy rooms. Owners are delightful. 2 minute walk to Liedseplein (restaurants and nightlife) 10 minute walk to Museums and Concertgebow. I've stayed in at least 10 hotels in this city and since finding this little gem I'm only staying here. Incredible value for the price.", "Date": "September 21, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "new brunswick,nj", "Title": "“Good Area”", "Author": "john1951", "ReviewID": "UR3523301", "Content": "I picked this hotel for budget reasons and location. My room was very small and sparcely furnished. I was ok with that because I didn't plan spending much time there. However, it didn't have a elevator (lift). I'm 54 years old and I had to carry my bags up to the top floor using a winding staircase. Needless to say it took awhile. It was a handful even without carrying luggage. I was entirely happy with the area.I was close to Vondelpark,concert hall,and restaurants. If you are a budget traveler like me than I would recommend this hotel as long as you can navigate the climb up the stairs.", "Date": "June 3, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Marrakech, Morocco", "Title": "“alternative only to a hostel”", "Author": "renegsx", "ReviewID": "UR3280638", "Content": "If you're looking for a really cheap hotel this is it. Sipermann Hotel. Nice Asian couple greet you. The reception doubles as a breakfast room with basic Dutch standard breakfast of breads, cheese and jam. I was booked in for a single but they gave me a twin room instead at no extra cost. It was very simple. Everything from the furniture to the decor very tired looking but clean. The salmon coloured room after not throwing up I could live with eventually...why did they colour it that! YUK! The tv worked, the bed although very slim and lumpy was ok as I doubled it up with the other twin bed so not to fall out. There was a window which opened ok. The sink worked ok and there was hot water. That's all I can say about the room which wasn't all that big. The singles and twins share a bathroom on each floor. Mine at the top floor was a walk in wet room with a walk under shower and toilet and corner sink. This was clean. But if you needed the toilet in the night you got your feet wet! YUK! I would go back here because of the cheapness of it and I liked the couple who were very polite, friendly and sincere. A very rare commodity which I greatly appreciated in a city that can have some very unpleasant hotel landlords - or is that slumlords! The only down points were living around shabby, tired, old furnishings and decor - and the intense stink of Asian spicy food that permiates the air from the minute you walk in, until you get to your window and open it. Fortunately, the room inside didn't stink of that. Only in the corridors till you get out. Altogether, an ok rating, you at least beat the sleepless nights of having to be in a hostel for the same price and some cases, cheaper.", "Date": "March 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Ames, IA", "Title": "“Nice affordable place”", "Author": "AmesIowa", "ReviewID": "UR2704027", "Content": "Very nice, affordable place to stay in Amsterdam. The large room is really large - gorgeous high ceiling - though the bed is short for anyone over six feet. The attached bathroom is small but fine. Clean, quiet (distant noise of trams, but not really disturbing, especially at night). Very helpful, responsible management. Interesting street; convenient to museums; very nice view over park. Would stay here again.", "Date": "October 14, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool", "Title": "“Excellent value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2307072", "Content": "This hotel is very clean and excellent value for the price. It was the cheapest I could find, right nr Leidseplein and good for those who like to sleep at night as it's quiet! Staff are friendly and free breakfast, i would go again!", "Date": "July 19, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "arnhem", "Title": "“Okay hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1670801", "Content": "Okay hotel, with very friendly people and fair prices! In the center of Amsterdam, near the park and close to many restaurants.", "Date": "February 26, 2004"}], "HotelInfo": {"Name": "Sipermann Hotel", "HotelURL": "/ShowUserReviews-g188590-d264607-Reviews-Sipermann_Hotel-Amsterdam_Noord_Holland.html", "Price": "$94 - $197*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Roemer Visscherstraat 35</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1054 EW</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "264607", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4a/d2/4ad26fc1a2a395f7efaea295398838731large.jpg"}}