{"Reviews": [{"Content": "Aviod it if you can! About the best thing I can say is that it is central and close to all the main sites including the Rail Station and the Duomo which is just down the street, after that it all goes down hill. Getting there is a nightmare and you have to park round the corner in a private car park. It's expensive but then inner city parking always is. My advice would be to leave the car and get in on the train. You can't use it once you are there anyway. We found the staff unfriendly and unhelpful. The room was quite the worst I have ever stayed in with no window to speak of, certainly not one that you could look out or one that gave any natural light to the room. The furniture was old and tired though the bed was comfortable enough and the cleaning staff worked miracles. The bathroom was awful with a tiny bath the surface of which was peeling and stained. The plug was missing to both the bath and the sink.The shower hose attached to the bath worked but there was nowhere to fix it and no shower curtain though that didn't matter because once in the bath you could not stand up in it anyway as there was a low beam in the way! Tiles were cracked, different colours and had grout missing. When we complained they said Ah room 58 is like that and they had no others available. Breakfast was poor with nothing warm and not even the ability to make toast. At 鈧?05 for the room per night, it was without doubt the worst value for money hotel that I have ever stayed in. I would imagine that the most satisfied guests would have been the mosquitoes which abounded.", "Date": "Jun 22, 2008", "ReviewID": "UR966058448", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ClackerGibraltar"}, {"Content": "Great Location at a Good PRice We arrived to the Hotel Martelli after taking a night train from Paris to Florence. We emailed the hotel a few weeks earlier to let them know that we were planning on coming a day earlier than planned. Although we had a confirmation email stating that this would be no problem, the lady at the front desk was not aware of the change. Thankfully I had a copy of the email and we were ensured that our room would be available at the normal check in time.We were extremely surprised that we had been upgraded to the best room in the hotel. (It is the blue room with paintings on the walls that is featured prominently on their website just in case you want to check it out.) Sure beats the night train accommodations! The breakfast was nothing special and the help at the front desk was hit or miss but we loved our room! Very convenient location to the sights and to the train station as well.", "Date": "Jun 9, 2008", "ReviewID": "UR453653650", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "sam4282"}, {"Content": "Nice hotel, great location Location of this hotel is great - easy walk with luggage from train station. Lobby pretty small and rooms fairly plain, but clean and comfortable. Gentleman working desk was great - lady was not near as friendly. He gave us all kinds of help with tours and such. Breakfast was fine - croissants primarily with some fruit Easter Sunday. Location was the best perk - not only close to train station but tourists sites also.", "Date": "Apr 5, 2008", "ReviewID": "UR582032471", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "LittleIndian"}, {"Content": "Great location Very central location. Friendly reception staff. Large room. Bathroom suite needed renewing but it all worked with enough hot water etc. Breakfast ok - crossaints cold have been fresher, would have liked a herbal tea or hot water.", "Date": "Mar 25, 2008", "ReviewID": "UR598385476", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "CiaraO'R"}, {"Content": "Stayed here 3 times The inside of this small hotel is very cozy. The rooms are really nothing special but they are clean and the staff is helpful. The location is ideal and the building itself is charming.", "Date": "Mar 13, 2008", "ReviewID": "UR916384602", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jry-i"}, {"Content": "quite good the location of this hotel is perfect, only about 4min walk from train station so we didn't have to haul our bags around for any length. the market was only around the corner and the duomo was only down the road. Any staff we encountered were very helpful and polite. The room had loads of character, wooden beams, old chandalier type light, shutters on the window etc... the room and bathroom were clean, the only fault i have is that there was no shower curtain so the floor would get soaked everytime the shower was used. The breakfast was good, the same as in any other italian hotel we stayed in really. Overall this hotel was quite good", "Date": "Feb 12, 2008", "ReviewID": "UR876998244", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "roisinIreland"}, {"Content": "This hotel was awful Let me start by saying that I am not a picky hotel stayer. As long as I am comfortable and the location is ok then I am satisfied. My husband and I hated this hotel. We hated it so much in fact that it ruined our stay in Florence. Where to start? All but one of the reception staff were either rude or indifferent. Our room had bugs squashed all over the ceiling and walls and was located underneath a set of squeaky stairs that seemed to be a main thoroughfair all night! The room was incredibly noisy. The sewerage system had some contraption attached that made an almighty noise whenever the water or toilet was used that gave you the fright of your life. Breakfast was an awful experience - the woman who ran the breakfast room was rude and inefficient. There were dirty plates all over the room and there was not enough space for the amount of guests staying in the hotel, meaning you had to wait to be seated every morning. We were expecting some mail to be arriving while we were there and when it didn't come we asked if it could be redirected - the answer was just 'no'. No discussion. Horrible horrible hotel. I am unsure why there are some good reviews listed. We too read the good reviews and ignored the bad. A mistake. Do not stay at this hotel. A backpacker''s hostel would be better.", "Date": "Nov 1, 2007", "ReviewID": "UR361943293", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "Amiatu"}, {"Content": "Not as bad as people say-decent experience My Wife and I entered the Martelli armed with the knowledge of the previous bad reports. The staff was curteous and helpful. The room, while sparse, was certainly not terrible. It posessed what we required: firm comfortable bed, decent bathroom (though the shower curtain was not up to par) and above all AIR CONDITIONING. It is in a decent location of Florence-close to the Duomo/Academia. While we don't plan to return to Florence in the near future, if we did, we wouldn't mind repeating our stay. The only real negative was the limited breakfast that was served, but again, we took what we desired and snacked as we headed out to explore a lovely city.", "Date": "Aug 17, 2007", "ReviewID": "UR398096064", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "pete2599"}, {"Content": "Nightmare on Via Panzani We arrived at the Hotel Martelli to book in to the double room we had booked online. Within minutes of entering Room 40, my wife and I realised it was one of the most dire hotel rooms we had ever seen. The old damp patch and resulting peeling wallpaper and general glumness of the room rang alarm bells. The mildewy grout and dilapidated condition of the bathroom and musty smell made us look at each other in alarm and then the broken air conditioning finally sent me back to reception to request a room change. I was offered Room 31, which looked acceptible and my wife and I carried our luggage down the stairs and settled ourselves in. We were then told that we could not have this room after all and had to heave our luggage right across the hotel to Room 69. The bedroom was ok, but had squashed mosquitoes on the wall. The bathroom was mildewy, but at least had no smell. However, the shower tap looked a bit 'dodgy'. Two nights later, after a sweaty day's sightseeing, the tap came off in my wife's hand meaning neither of us could shower. Another trip to Reception was met with 'Its not my problem' and the offer of another change of room the following day. My wife and I were not offered any means of cleaning ourselves that night even though I stressed that this was our key concern and had to use wet towels standing in front of the sink, washing our hair by sticking our heads under the tap. We investigated three rooms the following morning, one of which had a disgusting bathroom, one a window which didn't shut, smelt damp and had a massive dip in the mattress, and the third was similar to Room 69 (not surprising as it was Room 67, almost next door to 69!). However, it had the most awkward and peculiar bath and shower combination I have ever seen.Both Room 67 and 69 inadvertently gave us light displays every evening as the lights either did not work, or did not work but later flickered into life, or did work, only to flicker out of existence.Every night we had to chase mosquitoes out of the room. The breakfast was hardly evident and when I wanted to complain to the manager, or duty manager when the shower in Room 69 broke, he was unavailable and uncontactable by phone, even in event of an emergency according to the receptionist, who obligingly tried to contact him (or her) by phone. The location of the hotel is excellent however, near to the train station and landmarks. The bed linen and towels were changed every day. The young lady in reception and the man that looked like Bryan Ferry were very helpful and cheerful. It is a pity that not all of the staff on reception were the same.However, from my experiences there, I cannot recommend it! We had the misfortune to have booked for 7 nights. We had 4 different rooms and looked in 6, every room offered had faults and they did not look anything like the ones on the hotel's website.I will not be staying in the Hotel Martelli ever again!", "Date": "Jul 28, 2007", "ReviewID": "UR139364102", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "mosquitoman"}, {"Content": "Great Location, poor hotel The hotel is in a great location but that is about the nicest thing I can write about it. Rooms are dark and dingy with non existent air conditioning. Kids room had blood splattered insects over the walls and bedding - yuk. Front desk staff very grumpy and unhelpful Food at breakfast was nasty, cheapest quality everythingParking is 26 Euro's per night which we felt was very steep and not mentioned on the site we had booked through", "Date": "Jul 28, 2007", "ReviewID": "UR602807013", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "LouiseNewZealand"}, {"Content": "This place is a dump This place is a dump!!!! Our room smelled like sewage. After complaining all night the moved us to the top floor and it was the room that they advertise online. My parents stayed in another room that too was a dump. The staff was ridiculous. The breakfast was terrible, and everyone seemed annoyed. I cannot believe they charge what they do!!", "Date": "Jul 19, 2007", "ReviewID": "UR233483694", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "roo617"}, {"Content": "Disgusting, Awful, Rotten, Smelly       Disgusting Room", "Date": "Jun 5, 2007", "ReviewID": "UR401997997", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "HonestlyNC"}, {"Content": "Martelli Hotel - Didn't like it much. We felt like we were in a completely different hotel when we eventually got to our room. We had to take the lift to the first floor then walk all the way along the corridors and through the breakfast room to another lift that took us to the 3rd floor. There was a lot of traffic noise and loud music from the restaurants around the corner and a view of another building. Our bed was two singles pushed together. Ensuite bathroom with shower over bath, but a very high sided bath made it a bit tricky to get in and out. The location was good though, only 5 minutes walk from the train station and the Duomo, and close to a couple of good markets. We used the stairs to get up and down as the lift was very small and did not feel safe. Breakfast wasn't in a pleasant environment and it wasn't very appertising either. Your typical European breakfast but the staff attitude was horrible.", "Date": "May 18, 2007", "ReviewID": "UR418319836", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "kiwimel"}, {"Content": "The worst experience Let me begin by saying this - I am so not picky. I can pretty much lay my head anywhere especially if I'm not spending much time in my room which was the case here. Too much to see in Florence to worry about the room but this was bad. From the moment my wife and I got there we felt attitude. The person at the front desk was short and unpleasant. Seemed to be bothered by more Americans. Not all american travelers fit into their idea of what we are. I never complained...I took it because that's what I do. The room was a joke. The bed was resting on plywood and the mattress was about 3 inches think. Not too comfortable. We thought the people at the front desk were bad. The woman serving breakfast was even worse. Slamming dishes into the sink as it appeared she was very annoyed. Food was gone by 9:45 and she didn't seem to care about replenishing anything that was out.It was unfortunate but I swear this lodging experience really kept me from enjoying myself in an overcrowded, rude and overall unpleasant city. Was soo glad we still had Venice on our intinerary.", "Date": "Apr 18, 2007", "ReviewID": "UR731673760", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "clapthis"}, {"Content": "Great Value, Martelli       fantastic bed in our room", "Date": "Apr 2, 2007", "ReviewID": "UR196338001", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Gerryire"}, {"Content": "Amazing city but... After some initial confusion over the room, the first one were shown was horrendous, we ended up with a reasonable room that looked a little tired but was very clean and the bed was firm and very comfortable. The bathroom was spotless and well furnished. There was a minibar, not that we used it, but there were no glasses. The photos they show are the expensive rooms, not the standard ones.Breakfast was disappointing, even for a continental buffet but at least the coffee was good.Aircon was switched off so the first night was cold but we found the fuse swich for it ouside the room the next day.The staff were pleasant enough but not overwhelmigly so.Interesting building and great location but I'm glad I paid well under rack rate for this hotel, not sure how they can justify the rates!", "Date": "Apr 1, 2007", "ReviewID": "UR536120828", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "Irisred"}, {"Content": "Fabulous Florence My partner and I planned a travel trip through Europe by train through a travel agent. Our requests were, moderately cheap (but not a complete dive), close to town and pref not ILES away from the train stations so we would have to haul bags all over the city. Well, this place was absolutely perfect! The hotel has great character with old world art and cheesy Italian decor in the rooms. Our room was basic but very bright and clean and he bathroom was great. The staff were friendly enough, never really went out of their way to be really friendly but were nice enough. Our contintental brekky's were included and they were awesome. Yoghurt, pastries, cereals, fresh fruit, juices and the usual tea and coffee.The location was perfect being about a 2mins walk to the thick of the gorgeous inner city streets.  I would recommend this place to anyone wanting to go to Florence on the cheap but not having to worry about getting depressed when needing some downtime in a hotel room. When we go back, we'll be staying at the same place! Great value for money especially if you go on the tail end of summer/autumn.....still nicer weather and half the crowds.", "Date": "Nov 16, 2006", "ReviewID": "UR931577586", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Serenity_H"}, {"Content": "Gppd value My friend and I have just returned from a 4 night stay in this hotel. It is a small hotel in a past palace belonging to the Martelli family I believe.There was lots of art around as well as wall paintings giving an air of splendour, We had a room on the first floor which was spacious, tiled floor, no view but very quiet as we didn't face the road, small but adequate shower room. Room was clean  kept so durning our visit, comfy beds, clean linen each day, fridge for our necessary water supply, tv was a bit blurry on some stations but we were so busy in the city it was no problem. As one other reviewer wrote staff were friendly except for one guy on reception who was surly to say the least  really gave a bad impression which was a pity. However the other two staff on reception were very smiley, helpful  friendly. The breakfast room was very striking  in charactor with a past palace. Food was plentiful juice, cereal, yoghurt, rolls, pastries, jam, honey, choc spread  soft cheese, tea or coffee. It is in a great position within easy walking distance of both train  bus arrivals. The Duomo is close as is the market  food hall. We felt it was good value for money  would stay there again,", "Date": "Oct 16, 2006", "ReviewID": "UR544586851", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "patti08"}, {"Content": "Florence, Hotel Martelli, nice... This is a smaller hotel, family run, only 53 rooms. Inside it is oldfashioned decorated, cosy impression.Very centrally situated, you can walk to everything in the centre of Florence.I stayed in a single room, costing Euro 155 a night. Rather much for a small room with not much space. A TV that presents all programmes with snow and usually in black and white, not the advertised radio... Service though is great, new towels and bedlinen every day.It's a 3 star hotel, but I'ld call i 2 star for the cramped single rooms.", "Date": "Aug 10, 2006", "ReviewID": "UR609542249", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "TaraG"}, {"Content": "Would Not Return My family (5 women) stayed at this hotel recently. My Aunt had seen this hotel on her previous visit to Florence and thought it looked nice. This four star hotel needs desperate help. We were first put it the best rooms in the hotel(as quoted be the gentleman at the desk). The floor was rotten and the rooms smelled. We slept in these rooms for one night and decided that we could not take it another night. We were moved to a modern room for the second night. This was like a different hotel. I still would have expected more from a 4 star hotel, but these rooms were clean and the the bathroom was nice. We will not stay here again. As the previous review states, we will check out the Sofitel and spend the extra money!", "Date": "Jul 12, 2006", "ReviewID": "UR763838198", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good location but not cheap and not so cheerful. The hotel is well-located - close to the airport shuttle bus station (which is just next to the railway station) and a short walk to the Duomo. We were able to deposit our bags on arrival (which was several hours before the check-in time at 14.00) which was appreciated. The staff at the front desk were generally good, though we did have one guy on check in who seemed to think that marking several places on forms and saying sign-here was sufficient explanation for what he was asking us to do. Got room 69 which is accessed through crossing the breakfast room - via two lifts or easy stairs if you prefer. The room was dark - the room backed on to another building and even with the shutters open the trade-off was to use the room lighting instead. Didn't manage to get the bedside light bulb replaced even though I removed it and left it on the bedside cabinet to demonstrate that it had blown - the bulb was removed but no replacement made. Squashed mosquito on the wall didn't add to the room's ambience which was tired in appearance and only really cheered-up by the blue duvet cover - beware the pics. on some websites as they make the rooms appear to be classically and tastefully decorated in a renaissance style - they're not! Neither are they sound-proof - lots of noise from the cleaning staff and other guests bright and early (7am) and if you don't take a shower v. early don't expect hot water...tepid at best. Overall we felt that we should have paid more and gone for a 4* hotel as this 3* wasn't to our taste. The Italian-only TV was a minus too (not that we came to Florence to watch TV but, you know...)Overall I'd say check out the Sofitel - which is nearby; its probably a lot pricier but it looked stylish.", "Date": "Jun 14, 2006", "ReviewID": "UR134740238", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A great hotel in central Florence We stayed in this centrally located hotel for a long weekend (4 nights) and thoroughly enjoyed our stay. The room was fine, the staff very friendly who all spoke good English and seemed to appreciate our attempts at Italian. The staff were knowledgeable about the area and were able to answer most of our questions. The location is superb - just a 5 min walk from the main train/bus station (Stazione Santa Maria Novelli) and well within walking distance of Il Duomo (the cathedral) with Giotto's Bell Tower, the Pont Vecchio, the Uffizi gallery and the hundreds of market stalls. I would suggest maybe getting a room at the back of the hotel - where ours was - as the front in on a busy main street and I would imagine get a bit noisy. If visiting Florence (Firenze to the locals) make sure you go to the Mercato Centrale (central market) food market - again just a few minutes from the hotel. My only complaint about the Hotel Martelli would be the breakfast - rolls, pastries, cereal, biscuits, jam/butter/soft cheese coffee/tea and fruit juice but no cold meats or hard cheeses - or hot food. Most of the other continental hotels we have stayed in had cold meats and cheeses on the breakfast buffet but this is a small complaint as what was there was ok. I would definitely go to this hotel again.", "Date": "Feb 21, 2006", "ReviewID": "UR437105433", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very plain, but in a good location We stayed here for three nights in November, 2005. The hotel lobby is very spartan as well as the rooms. We liked the fact that it was close to the train station and close by everything we wanted to see. However, the breakfast was about as bad as it gets...the coffee was awful and the rolls were bone dry. I would recommend that if you stay here, just skip it and eat somewhere else. Our room was okay (beds were sort of soft and lumpy) and the T.V. was from the 1970's and only got one channel (we thought it was kind of funny). The bathroom door would not close and the light was burned out. Front desk staff was not very friendly, but not rude either. I may stay here again if I couldn't find anything else, but probably not.", "Date": "Dec 16, 2005", "ReviewID": "UR715034108", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "MarkaPolo"}, {"Content": "Excellent Location, Old Fashioned The hotel is at an amazing location. If you arrive into florence by train, it is just 3 minutes away walking. It is in a very lively street and shops, restaurants etc are all around. The duomo is a few minutes away walking. As for the rooms, the hotel is somewhat old, the airconditioning isnt that great, and it seems the rooms havent been re-done for ages (old TV, old bathroom, furniture etc). Although in general it is reasonable. The reception were Very helpful in finding anything in the city, from a bus/train to Pisa, to finding a nice nightclub at night. Overall pretty good long as youre not staying in the room much.", "Date": "Aug 5, 2005", "ReviewID": "UR464542011", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "horrible Stayed there 3 days and will never even try to get close to it next time. 1) Rooms: dirty, small and cheap, ok for a 1 star hotel2) Location: it's in the most chaotic road of florence, close to the duomo is ok, but you won't sleep .3) Staff: terrible, seems like you're doing a favour to them staying at the hotel.Do yourself a favour and stay away from it, there's much better around.", "Date": "Mar 15, 2005", "ReviewID": "UR193052215", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great hotel great price great location Stayed here for 2 nights in November. The hotel was excellant value for money, clean linen , tidy room and public areas, good basic breakfast to start the day. The hotel was actually part of an old Medici Palace. Only 200 yards from the station and close walking distance to major sites. The hotel represents excellant value for the room rate.", "Date": "Nov 14, 2004", "ReviewID": "UR119022124", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Too Noisy This is old fashioned, chintzy hotel, though in a very good position. Our room was of reasonable size, clean although furniture was a bit dated. The breakfast was OK, and served in a nice big room. Our main problem was NOISE - there was no sound proofing on the window, which is crazy for a city centre hotel (particularly in summer). The air conditioning was also very noisy. We bought ear plugs...", "Date": "Sep 17, 2004", "ReviewID": "UR323030980", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "An OK Hotel Having booked a week at the Martelli I was concerned to then read the comments on the hotel on the trip advisor website. We spent 7 nights in the hotel (Room 23) at the start of June 2004. I would describe the hotel as 'basic' but 'comfortable'.Location is excellent - less than 5 minutes walk from the SMN Station and 3 minutes walk from the Duomo.All the members of staff we encountered were friendly and helpful. The public areas were smart and clean. The breakfast provided was good (continental).The room was basic and clean and the bathroom was perfectly adequate - no problems with plumbing or smells! Bed linen and towels were changed on a daily basis. The room was at the back of the hotel, well away from the road, and was very quiet.If you want a basic 'value for money hotel' in the centre of Florence then you should consider the Martelli (but note that rooms close overlooking Via Panzani might suffer from traffic noise).Lots of good restaurants nearby.", "Date": "Jun 12, 2004", "ReviewID": "UR680454748", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "soso Train workers went on stirke so we were forced to get a hotel for one night in florence. Saw hotel martelli and decided to stay there for it was so close to train station. Front desk was amiable though they charged alot more for the room then they should have. Phone didnt work well, wake up call never rang in and we missed our train the next day. The showers were nice though a piece of the shower was missing and we had to call the front desk to come up and fix it. After she told me no one could come up for 3 hours i yelled at her and 5 mins later front deks came up and fixed the problem. Breakfast was one of the bets though, ususlly just got bread and jam but at martelli there was cereals and yogurts which was a chnage. OVERALL not bad but they def shouldnt be charging 90 euros though.", "Date": "May 12, 2004", "ReviewID": "UR655577576", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hated it! Hotel Martelli was terrible. We hated it there and could not wait to get out. We booked a room before going to Florence at San Giorgio  Olimpio Hotel in Florence. When we got there, they told us they had no room for us. I explianed to them that we booked it and paid for it. The front desk man said something in Italian to another worker who told us that they would escort us to another hotel. We did not like the idea of this. We got there, which was Hotel Martelli, and it looked awful. It was filthy, the woman was confused, and it was so old and depressing. The room was worse. The shower was big enough for a 10 year old, we had no hot water, not towels, and the tv was broke. We stayed out as long as possible so we did not have to come back. We left the next day for Rome. Also, our phone did not even work to get a wake-up call. Do not stay there. Find a cleaner, nicer hotel for the same price.", "Date": "Mar 30, 2004", "ReviewID": "UR590132694", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Our experience at Martelli We arrive to Florence by train and the location of the hotel Martelli is great because it's close to everything important in Florence: The Duomo, the city market, the Ponte Vecchio, etc. They assigned us to room 57: at firts sight it was nice, even when furniture is old fashioned. The room had a bath tub with courtain and a shower (the one every european hotel has that looks like a telephone). The floor of the room was really cold (the outside temperature was around 45?F) and the heat just didn't work at all. I made the complaint at the front desk but the lady in the reception (the old one) told us to turn the buttons on and the heat surely will turn on; we tried and we suffer a really cold night. Next morning, other nice young receptionist was on duty and nicely changed us for room 65: wooded floor, and the heat worked fine. Breakfast isn't a big deal: bread, coffee, jam and cereal, just the average in european breakfast. There most be better choices to stay around the area, but our tour opetator only gave us this hotel choice.", "Date": "Mar 30, 2004", "ReviewID": "UR987802935", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Better value elsewhere We were very disappointed with the overall condition of the room. The beddings looks very very 'anicent' - someone should recommend a change soon - and the bathtub could only fit a very small kid. While the location is very central, we realised that tere are better value to be have elsewhere with equally centralised location here in Florence. To sum up our experiencein one word - DON'T!", "Date": "Jan 30, 2004", "ReviewID": "UR926784749", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Martelli Experience We arrived in Florence by train and were surprised to find the train station very close to our hotel, only a couple of minutes walk away. On arriving at the hotel we asked for a quiet room as it is on a very busy road. We did manage to have our quiet room but it was a miserable looking room, the furniture had seen better days, the television didn't work and the bathroom was very old fashioned and in need of a total overhaul. We suffered the room for the first night and asked to move the next morning. After a short discussion with the receptionist she did agree to move us. The first room she showed us was not a lot better than the first and had a bad smell in the shower, the second room was OK, so we settled in. For the next 3 nights we were perfectly happy, albeit the furniture looked about the same and the television looked liked it had come out of the ark, and the hair dryer was hanging off the wall, but the bed linen and towels were beautifuly clean, and the location of the hotel could not be better placed for siteseeing, and if like us you fall in love with the beautiful sites of Florence, the hotel will seem totally adequate for your stay.", "Date": "Sep 12, 2003", "ReviewID": "UR231415871", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "浜堟兂銈堛倞銇倛銇嬨仯銇燂紒   showReview(21744295, 'full');", "Date": "Oct 1, 2008", "ReviewID": "UR914780395", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈堛亱銉偙銉笺偡銉с兂   showReview(20753324, 'full');", "Date": "Sep 21, 2008", "ReviewID": "UR767678715", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴閲嶈銇柟銇伅銇婂嫥銈?#x201d;   showReview(19914649, 'full');", "Date": "Aug 7, 2008", "ReviewID": "UR277611536", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "鐙亱銇ｃ仧銇戙仼娓呮綌銇с仐銇熴€?#x201d;   showReview(19172580, 'full');", "Date": "Jul 12, 2008", "ReviewID": "UR636221712", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴鏉′欢銇屾渶楂?#x201d;   showReview(19172551, 'full');", "Date": "Jul 11, 2008", "ReviewID": "UR333767606", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈ゃ偪銉偄鐗堛偄銉°儶閮ㄥ眿   showReview(19169255, 'full');", "Date": "Mar 6, 2008", "ReviewID": "UR924671232", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "閮ㄥ眿銇屻偔銉偆   showReview(19169104, 'full');", "Date": "Feb 29, 2008", "ReviewID": "UR113168903", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "瑕冲厜銇究鍒┿仹銇欙紒   showReview(19168723, 'full');", "Date": "Feb 12, 2008", "ReviewID": "UR872381325", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鏄斻伄銈层偣銉堛儚銈︺偣銇倛銇嗐仾寤虹墿   showReview(19167726, 'full');", "Date": "Jan 9, 2008", "ReviewID": "UR373517487", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "瑕冲厜銇究鍒┿仹銇?#x201d;   showReview(19167196, 'full');", "Date": "Dec 20, 2007", "ReviewID": "UR192401134", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "澶ф簚瓒?#x201d;   showReview(19166626, 'full');", "Date": "Nov 25, 2007", "ReviewID": "UR530261585", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Mi estancia ha sido de 4...   showReview(11358643, 'full');", "Date": "Nov 9, 2007", "ReviewID": "UR914311058", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄   showReview(19164095, 'full');", "Date": "Sep 12, 2007", "ReviewID": "UR306408305", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel centrale molto carino.La...   showReview(12648555, 'full');", "Date": "Jun 28, 2007", "ReviewID": "UR693182671", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Firenze 猫 splendida e l'albergo...   showReview(11358644, 'full');", "Date": "Apr 15, 2007", "ReviewID": "UR821891832", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "椐呫伀杩戙亜銇с仚銆?#x201d;   showReview(19160474, 'full');", "Date": "Mar 16, 2007", "ReviewID": "UR526605986", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "锛撲汉銇ф硦銇俱倞銇俱仐銇?..   showReview(21802305, 'full');", "Date": "Mar 14, 2007", "ReviewID": "UR238025357", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉涖儐銉€€銉炪儷銉嗐儍銉?#x201d;   showReview(19160329, 'full');", "Date": "Mar 1, 2007", "ReviewID": "UR741433101", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Fredda accoglianza e problemi...   showReview(11358645, 'full');", "Date": "Dec 18, 2006", "ReviewID": "UR233065865", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銇撱伄銉涖儐銉伅銆侀鍓嶃伀...   showReview(21802005, 'full');", "Date": "Nov 12, 2006", "ReviewID": "UR586552221", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鍫存墍銇€侀鍓嶃仹渚垮埄銇?..   showReview(21801487, 'full');", "Date": "Aug 19, 2006", "ReviewID": "UR387054130", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈炽偣銉堛亱銈夊垽鏂仚銈嬨仺...   showReview(21801374, 'full');", "Date": "Jul 30, 2006", "ReviewID": "UR594621309", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鐩銈併伅閻樸伄闊?#x201d;   showReview(19157465, 'full');", "Date": "Apr 27, 2006", "ReviewID": "UR772455610", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉曘偅銉兂銉勩偋銇儔銈︺儮...   showReview(21800775, 'full');", "Date": "Feb 10, 2006", "ReviewID": "UR314990889", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "椐呫亱銈夈伅寰掓锛斿垎銇愩倝...   showReview(21800699, 'full');", "Date": "Jan 9, 2006", "ReviewID": "UR795054942", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銇欍仈銇忎究鍒┿仹銇椼仧銆傚€?..   showReview(21800466, 'full');", "Date": "Sep 13, 2005", "ReviewID": "UR239920142", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Struttura molto...   showReview(11358647, 'full');", "Date": "May 30, 2005", "ReviewID": "UR683797728", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Nulla da dire! forse solo la...   showReview(11358646, 'full');", "Date": "May 4, 2005", "ReviewID": "UR827416077", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "L'ho trovato scadente e con...   showReview(11358648, 'full');", "Date": "Jan 13, 2005", "ReviewID": "UR817231433", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "L'hotel era molto bello e molto...   showReview(11358649, 'full');", "Date": "Nov 23, 2004", "ReviewID": "UR733036781", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "鍙ゃ亜銉撱偢銉嶃偣銉涖儐銉仺...   showReview(19927222, 'full');", "Date": "May 9, 2004", "ReviewID": "UR261648289", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儍銉椼儷銇亰鍕с倎銇伄...   showReview(19926256, 'full');", "Date": "Mar 31, 2004", "ReviewID": "UR350125812", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "锛楋紣锛愶紣鍐嗗急銇銇犮仯...   showReview(19924730, 'full');", "Date": "Feb 1, 2004", "ReviewID": "UR204259640", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "椐呫仺锛わ嫉锛辑锛伄闁撱亸...   showReview(19924692, 'full');", "Date": "Jan 31, 2004", "ReviewID": "UR627503911", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉涖儐銉伅鏈綋銇彜銇勩仹...   showReview(19924476, 'full');", "Date": "Jan 24, 2004", "ReviewID": "UR339108971", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鍏ㄧ劧鍟忛銇傘倞銇俱仜銈?..   showReview(19921336, 'full');", "Date": "Sep 16, 2003", "ReviewID": "UR884493748", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d265069-r17129716-Martelli_Hotel-Florence_Tuscany.html", "HotelID": "265069", "Price": "$201"}}