{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Great Service and Good Bargain”", "Author": "pepeanddizzy", "ReviewID": "UR126592060", "Content": "My wife and I stayed here both at the beginning and end of our trip abroad. The service was incredible- more than excellent. Emmanuel and Cedric were great in helping us retrieve our Air France misplaced baggage and giving tips for restaurants and things to do. While the rooms are not large they are very neat, comfortable and a great bargain for such prime real estate. The hotel was very convenient for us to either walk or use the Metro to get around the center of Paris. The nearby Metro and train stations made getting to Charles DeGaulle Airport also very easy. We will definitely consider this hotel on our next trip to Paris and recommend it to friends.", "Date": "March 24, 2012"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Very enjoyable”", "Author": "Suzanne574", "ReviewID": "UR126119246", "Content": "The Apollon Montparnasse Hotel in Paris was very enjoyable, especially because Emmanuel was such a delight and went out of his way to ensure we were taken care of. He took plenty of time to tell us how to get to the metro, where to eat, where to get snacks, and how to make reservations for tours. He was a true delight and made our stay that much more fun. The room and bathroom were small but that is typical for many French hotels. The breakfast was in a lovely downstairs wine cellar setting, very quaint.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St Austell, United Kingdom", "Title": "“Perfect for a city break”", "Author": "WilkoCornwall_UK", "ReviewID": "UR126051394", "Content": "I booked 2 twin rooms via their website for a long weekend. The website was accurate to what we found at the hotel. The booking request translated to English and was easy to use. The confirmation email was very detailed and gave clear instructions to find the hotel and get there. Rooms and public areas where very well maintained and spotlessly clean. Beds where comfy and sheets crisp. The bathroom (shower room) was a good size and although the shower cubical was on the small side the shower was powerful and of a consistent temperature. We didn’t eat at the hotel for breakfast, so can’t comment on that. Reception staff where very helpful with directions and recommendations for bus routes etc. Free WiFi is available throughout and there is also a free to use computer in the lobby with internet connection. The location is excellent, in a relatively quite street for Paris and within a comfortable walking distance to a choice of metro stations and buses. No hesitation to recommend, and would stay again if in Paris.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Beijing, China", "Title": "“A little gem in Paris”", "Author": "andr123", "ReviewID": "UR125751649", "Content": "Amazing little hotel in a cozy neighborhood , with a friendly staff . Steps from the subway. All of this for a great price! It was perfect 4 me, will stay again there next time!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dunkeld, United Kingdom", "Title": "“Ideal Tourist Hotel”", "Author": "Garratts", "ReviewID": "UR124068232", "Content": "Close to Metro station Pernety and relatively close to Montparnasse rail station. Area around hotel well served with restaurants and delis. Good clean and friendly boutique hotel. Do not need any more than this.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great place”", "Author": "Sphak", "ReviewID": "UR123405667", "Content": "Great place to stay. Excellent location, close to metro and close to gare montparnasse, where you can connect to any other metro line, train or bus from the airport. Friendly staff and good breakfast included. Will definetly consider it again next time!! other reviews say that rooms are small but everything is small in france, you will not be dissapointed.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Convenient neighborhood hotel”", "Author": "D M", "ReviewID": "UR123365126", "Content": "Located in the 14th arrondissement of Paris, at a 10mn waling distance from Montparnasse, the Apollon Montparnasse offers clean albeit small rooms and courteous service at an affordable price. A very good option for travellers looking to stay in that neighborhood or traveling on a budget.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, Maryland, United States", "Title": "“Un bijou”", "Author": "PSJMFR", "ReviewID": "UR123299695", "Content": "Very clean, cozy hotel. Room small by American standards but well it on account of location and price. Great location: at most 10 minute walk to/from Gare Montparnasse (and Air France bus stop to/from CDG airport), small half block away from post office, small block away from Metro station Pernety. Neighborhood in which located has everything: cafes, wide variety of restaurants, grocery/wine-beer-liquor stores, boulangeries, etc. Staff (especially Emmanuel) extremely friendly and knowledgeable. If you stay, you will not be disappointed. I will be staying there on my trip back in May 12.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Excellent choice!”", "Author": "Pal1977", "ReviewID": "UR122370439", "Content": "We stayed at Hotel Apollon Montparnasse for eight nights in mid December and are very happy of the choice we had made! The hotel is worth more than its two stars! As a preliminary remark, the hotel was only a few minutes walk from the metro station Pernety and the area where the hotel is located appeared safe. Joel and Emmanuel at the reception (and the staff in general) were always very kind. At our arrival we were also provided with a free wi-fi code valid for our entire stay. The double superior room was spacious and very clean for Paris standards and was completely put in order daily. We are really happy that we chose this hotel for our romantic stay in Paris!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Awesome location, right next to metro, good restaurants, very clean, staff very friendly. Highly recommend.”", "Author": "Honeymoon05-11", "ReviewID": "UR121890329", "Content": "We stayed there for our honeymoon. We loved it! It was a great location, wonderful place, everything was great. The room was small, but worth it for the location and the deal. We highly recommend.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Perfect hotel for a budget trip to Paris!”", "Author": "Denise A", "ReviewID": "UR121390527", "Content": "1. Clean, tidy and cosy 2. 2 mins walk from tube station 3. Extremely helpful and friendly staff 4. Quiet area during the night 5. Don't think twice, just book and enjoy! BON VOYAGE!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Reasonably Priced (for Paris) But Getting A Bit Worn”", "Author": "pcsqueen", "ReviewID": "UR120465521", "Content": "When my husband and I visit Paris, we usually stay in a hotel near l'Ecole Militaire. Our last trip, which took place in early October, was organized at the last minute when a client asked my husband to attend a trade fair. (Like he was going to say no... Paris?? Free???) The hotel in which we usually stay was booked - probably because of all the stellar TA reviews - but they kindly provided us with a few other recommendations, one of which was Hotel Apollon. Pros: - Reasonably priced (for Paris, as I already mentioned) - Extra-clean, especially the bathroom - Bathroom recently renovated and, for its size, offers a remarkable amount of space on which to put your stuff. - Plentiful - and HOT - water in shower - Friendly and helpful front desk personnel - Great neighborhood with some absolutely outstanding restaurants. (We actually prefer this neighborhood to the one in which we usually stay. It's a real place, with real cafes that actual Parisians visit - not just tourists or traveling businesspeople.) - Metro exactly one block away - Free Wi/Fi that works exceptionally well. (Note: I had no problem whatsoever with getting a new code every day. Heck and it's just an elevator ride downstairs, something that can be accomplished in less than 5 minutes.) - The room has a small frig. Cons: - The rooms are small, which is absolutely typical for this type of Parisian hotel. To me, it's not really a con, but for many it might be --- so fair warning. - Because the rooms are small, the walls get a bit of abuse from luggage. Consequently, the wall paper in both the halls and the rooms is beginning to get pretty dinged up. - The carpeting thruout really needs to be replaced. It's not totally disgusting, but is showing its age and the wear and tear that it receives. - Clothes storage is pretty much non-existent. There's a tiny (and I might add, very dusty) closet in the room. It holds four shirts, two business suits, one raincoat -- and bursts at the seams. - Storage for luggage in also non-existent. The only saving grace is that the beds are on legs, not on a platform. We were able to shove my husband's suitcase under a bed. I had to keep mine out because that's where my clothes lived during our stay. I might add that I must have stubbed my doggone toe on the doggone suitcase about 35 times. - The beds were not at all comfortable. By day two we were both complaining of aching backs and we're both pretty fit people. - The sheets were quite clean and crisp, but the blanket really could have used a good wash. - Our beds didn't get a bedspread put on them until the third day. When we arrived, it was just sheets and a blanket. Bottom Line: Would I stay there again? Yes, if there were no other options. I think, however, next time we go to Paris we'll return to the neighborhood, but look for a different hotel.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bergerac, France", "Title": "“Very helpful staff and good value for money”", "Author": "SandraB1962", "ReviewID": "UR119252491", "Content": "We stayed here for one night 11 Oct and found the hotel to be very comfortable. The staff were very helpful, particularly as we needed to leave our bags all day, return to and deposit some items in them and return yet again later to catch a train. We found the two gentlemen at reception very keen to assist with directions, etc., which is not always the case in Paris. We are a French/Aussie couple so it is not an issue for us but both of them also spoke perfect English and didn't resent doing so. We stayed in room 406 right next to the elevator which was a little bit noisy to be honest in terms of elevator noise and people coming and going on the floor but good in that it overlooked an internal courtyard so there was no street noise. The bathroom was well equipped and the shower in that room was a good size and, for once DIDN'T leak (why oh why are most hotel showers designed such that you end up with a puddle on the floor?). Overall we thought it was a good little hotel at a good price - stay there!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Aarau, Switzerland", "Title": "“Just great”", "Author": "Andreak79", "ReviewID": "UR118936158", "Content": "I am a travel agent and both of us (my boyfriend and myself) worked for a long time as tourleaders. So I have 15 years experience in tourism and i know about what i am talking. I had the possibility to get a hotel for a much cheaper price such as an Ibis for example. But i didnt want to have a standard room, i wanted to feel the parisian lifestyle. I checked diffrent pages and i found the hotel with many good reviews in tripadvisor. The hotel is not in the centre but the metro is around the corner and makes it easy to discover paris. There are a view nice coffee shops near by for a coffee in the morning or a late night drink. The staff at the hotel is very nice and so helpful, they really have time and care about their tourists. When we arrived we got the key, so we went to the room and we remarked that this room was not ready yet but the room next to it just finished. So we went back to the reception and without any problem we could change the room. The room was really tiny as other mentioned before but seriously you are in Paris and you need just a bed to sleep. The room had everything you need. Fridge, aircon, tv, telephone, even shampoo and shower gel was in the bathroom. Everything was quit new and very clean and I would defenetly book this hotel again.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Awesome Surprise”", "Author": "Stephen O", "ReviewID": "UR118789908", "Content": "We were relocated here from The Hotel Londres-Eiffel which had overbooked. The staff at Hotel Londres-Eiffel were very apologetic and generously arranged for a cab at their expense to take us to Hotel Apollon Montparnasse. The staff at both properties were absolutely lovely. Nonetheless, we were apprehensive about the new property. That apprehension was quickly abated by the warm reception and lovely room. It has a modern contemporary design and ambiance. Clean, quiet, well appointed and well located. Nearby grocery, fromage shop, laundry as well a great central location provided a distinctly neighborhood feel. Undoubtedly the best hotel we stayed at during our 3 1/2 weeks. I unhesitatingly recommend Hotel Apollon Montparnasse.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Small rooms, nice bathroom, short walk to Metro”", "Author": "Ki K", "ReviewID": "UR118628714", "Content": "I recently stayed at Hotel Apollon Montparnasse for the first 3 days during my trip to France. The rooms were extremely tiny but so were some of the other rooms we stayed in. If you are looking for a spacious hotel this is not one of them. The lobby area is pretty modern considering some of the other hotels in the area and the staff are somewhat friendly. The bathroom looked newly renovated and was very clean. The Metro Station is super close to the Hotel which is a plus after a long day of sightseeing. The hotel itself is not close to many of the attractions in Paris that people want to sees, but is a train ride away which is convenient. It's not too much night life in the Monparnasse area, however you are a 30 minute walk from the Effiel Tower and some great cafes. . Pack light, I learned the hard way. Overall I can't complain about my stay at Hotel Apollon Montparnasse.", "Date": "September 26, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Paris, France", "Title": "“Nice and helpful staff. A shame about the room cleanliness.”", "Author": "charliechaplin15", "ReviewID": "UR118228215", "Content": "Rooms are tiny but that's expected in Paris. As my partner and I walked into the room we noticed hairs on the bathroom floor, stains on the bed cover and dirty towels. Considering this hotel was renowned on trip advisor for being clean, we were a little disappointed. The hotel, however, is close to pernety station (which can be used to get to many of the attractions). Breakfast is probably not worth it (we didn't bother) as you can pick up a nice baguette/pastry from a local patisserie at a cheaper rate. I would recommend another location if you can afford it, closer to champs elysees or even the center of st germain. If you are on a budget though, the location is easy enough to get around from with staff always willing to help.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "singapore", "Title": "“Small rooms but well furnished”", "Author": "extacy2508", "ReviewID": "UR118139624", "Content": "This little hotel is slightly away from the main tourist area but is well connected via metro which is a short walk away. Manager was nice and friendly when we arrived and let us choose from two rooms which were available. The rooms were nicely furnished and clean. Loved the scent of the toiletries which were provided. Free wifi was also provided although we had to get a new password every 24 hrs. We asked the hotel manager for a recommendation for our dinner one evening and he introduced a gem of a restaurant just down the road from the hotel which made our Paris experience so memorable. It was our favourite restaurant of the trip.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great little find away from heavy tourist traffic”", "Author": "Claudette S", "ReviewID": "UR118072080", "Content": "Very welcoming and friendly staff from all 3 front desk personnel who also spoke English (Desk is open 24 hours a day). Room was nice (but small as expected). Bathroom was recently refurbished and in excellent condition. Up the street is the Pernety Metro (less than 1 minute walk which is nice where you arrive late from an outing). You can easily walk to the Gare and Tour Montparnasse (Galerie Lafayette) in less than 8 minutes. Lots of restaurants in the area. Across from Hotel there is a hamburger and sandwich shop. Across from Pernety metro several restaurants including a pastry and coffee counter which was handy in the morning to feed our family. Staff helpful in giving directions for outings via metro or by foot including finding the type of restaurant desired. Wifi access worked fine, but must be renewed (for free) if you use up 24 hours of internet time (we were there 4 days and did not use up our 24 hours). There is also access to two hotel PCs in lobby. I had bought vouchers for Disney online and the staff offered to print my vouchers for me. Frommers Paris guide also recommended this hotel as good value for your money which we had consulted before going. We were happy with our choice.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Well located, clean and super friendly help.”", "Author": "TrekkerPhotog", "ReviewID": "UR117958759", "Content": "Located near the Montparnasse train station about 1 block away, cute non-touristy neighborhood, about a twenty minute walk to Eiffel Tower. Hotel was clean, quiet and just what we needed to relax and then explore Paris at end of our trip. I wish I knew the name of the guy at the front desk as he was outstandingly helpful and professional. Only issue was that every 24 hours I had to renew wireless userid and password (no cost, but a hassel).", "Date": "September 11, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Excellent qualite prix”", "Author": "Amie50", "ReviewID": "UR117385823", "Content": "Tastefully refurbished; comfortable, clean and well located for Gare Montparnasse. Very friendly and helpful reception.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Quaint and Wonderful. Loved this place!”", "Author": "eliza002", "ReviewID": "UR117233216", "Content": "Super convenient to the Metro. Very clean. Staff is very helpful. Loved my little room. As a solo woman traveler, I felt very safe here.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Fantastic in every way”", "Author": "tasharu", "ReviewID": "UR117181052", "Content": "This is a top class hotel. The staff was always friendly, helpful and their English was very good. The room was small, like most hotel rooms in Paris, but was clean, well maintained and recently remodelled. The neighborhood was quiet, and there was lots to see and do there. No problems finding a meal or a drink. The room had a refrigerator and air conditioner, and both worked well. Nice shower. Comfortable, but very firm bed. Really, no complaints and a very nice experience. I'm also hard to please. In particular, I normally hate hotel rooms in Paris, but this one was really great.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great hotel and great location”", "Author": "Ash S", "ReviewID": "UR117073472", "Content": "Stayed here on vacation in early August. The hotel was right off the Pernety metro stop, making the commute into the heart of Paris a short one. The people working the desk were extremely kind and helpful, and their english was superb. The rooms themselves were incredibly clean and well-kept. Newly renovated, the hotel was warm and inviting. Will definitely return again soon!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“a friendly hotel with great breakfasts”", "Author": "janelle d", "ReviewID": "UR116952131", "Content": "While visiting Paris for the first time with my family, we found this hotel warm and welcoming. the staff was friendly and very helpful. We arrived early before check in due to an early flight but were allowed to go up to our room with our luggage. We had two rooms and while both were small they were nicely decorated and very clean. The bathrooms are especially bright and modern. The central air conditioning was quiet and kept the room cool. The location was good on a fairly quiet street with residences and shops within walking distance to a metro. The breakfast is served downstairs in a cozy room. We enjoyed the fresh croissants and self serve fruits and cheeses.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“exactly what we were looking for”", "Author": "Robert K", "ReviewID": "UR116911376", "Content": "A weekend in Paris meant for us being out in the town as much as possible. So we were looking for just a basic hotel with parking space. This one fitted the bill. Although the room was small, it was perfect for the occasion. Same for the bath room. But main asset was the helpful and friendly staff.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Friendly, neat and clean.... out of the centre”", "Author": "Londonlass7", "ReviewID": "UR116700568", "Content": "Pleasant little hotel, quite far out but good value for money. The receptionist took the trouble to remember our names, gave us 'Summer' rates and was exceedingly helpful at all times. Free internet downstairs. The twin room small, but neat and clean (a minor issue was that the bathroom door didn't close properly). Quite far out from the 'main' attractions, but that didn't matter as it was right near a metro station and perfect for several nights in Paris. We would definitely stay there again.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“An excellent option in an interesting and conveniently located neighborhood.”", "Author": "Daniel61", "ReviewID": "UR116463862", "Content": "This hotel provides amenities that are well beyond what one would expect on the basis of its two star designation. Though the rooms are small (this is Paris, after all!) they are newly renovated and tastefully decorated. The bathrooms in the rooms we had (we came as a family of 5) were large and modern. Though breakafst was not included in the room rate, it was quite cheap (5 Euros) -- less than you would pay in a cafÃ©. Staff was helpful and went the extra mile to respond to our needs. The location is wonderful. It is a stone's throw from Montparnasse, in an up and coming neighborhood that includes a lot of great, diverse restaurants, and some off-the-beaten-track entertainment options (in particular L'Entrepot, a mere block away, that presents movies, concerts, art exhibits, and a nice restaurant that does a great sunday brunch).", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very convenient, very friendly staff.”", "Author": "Nauyf", "ReviewID": "UR115013741", "Content": "Very close to the tube station; close to travel to all the nice places; vibrant and friendly neibourghs; 24 service; staff can speak good quality English! :)", "Date": "July 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wonderful, quaint independent hotel with great value!”", "Author": "scotthef", "ReviewID": "UR114800694", "Content": "Wonderful staff, wonderful service, and great value. Out of the tourist zones and pleasant neighborhood. Would definitely stay here again.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Clean, bright, hotel in nice neighborhood with easy access to metro.”", "Author": "NYYankeefan2728", "ReviewID": "UR114677537", "Content": "We took two rooms for a long weekend which were typically European, small but very clean. Good firm full size beds and well equipped bathrooms. Showers are small but clean. Individual A/C in each room that worked wonderfully. The large French windows can also be opened up to a quiet street for fresh air. We could not have asked for a better hotel for the price. One block to the Metro, plenty of cafes and shops in the area. The hotel had all the basics and the staff was always willing to help with anything from directions to advice on where to go and what to do. We would definitely come back again.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Great hotel with great service”", "Author": "The_Jeremy", "ReviewID": "UR114374179", "Content": "We recently traveled to France for a 10-day trip across the country. We started in Paris, with our first night at Hotel Apollon. The hotel was easy to find, within a great little neighborhood just steps away from the Pernety metro entrance. Due to our overnight flight from the U.S., we arrived extremely early in the morning. I fully expected that we would not be able to check into our room, but Monsieur Joel, at the front desk, was extremely friendly and accomodating. My French was fair, but certainly not as good as I anticipated. Fortunately, Monsieur Joel spoke perfect English, and was obliged to do so. The entire hotel had been recently renovated and looked great. The rooms were a little small (typical for Paris), but very clean and comfortable. Our room overlooked an adjacent street, but the double-glazed window was very quiet. The price of the room was affordable for Paris, and the hotel was a short 10-minute metro ride from the primary museums and attractions. The petit-dejeuner was extra, but very welcomed. I definitely recommend this hotel, and I will stay here again on my next trip to Paris.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“Nice surprise”", "Author": "ellabella_8", "ReviewID": "UR111565581", "Content": "On previous trips to Paris, we have stayed in the more touristy areas. What a nice change and experience this was! The hotel is very close to a Metro station, which is just down the street, so getting around was easy. At the end of the day, we enjoyed going back to the neighborhood. There were plenty of restaurants nearby and the neighborhood was so pleasant. The hotel was immaculate and the staff was extraordinary. We loved our stay and would definitely recommend this hotel.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "manitoba", "Title": "“Very Nice”", "Author": "librarian11111", "ReviewID": "UR110921175", "Content": "We stayed there for three nights and the service was great. Very helpful front desk staff. Clean rooms. Close to the Metro and Gare ( although with luggage it is a good walk.) Le petit dÃ©jeuner a bit expensive @ 11E per person for 4 of us. but good. A few restaurants and pubs in the area, stores. Will recommend it to others.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value for the money!!”", "Author": "Zetoniox", "ReviewID": "UR109733998", "Content": "Very clean room and bathroom! Good n friendly service! Good location near bakeries, restaurants, markets n the metro! The best part was the lack of tourists! Really felt like a Parisian while there! Will come back next time in Paris!!", "Date": "May 24, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good hotel”", "Author": "Mariola_Cz", "ReviewID": "UR103671837", "Content": "Very good, small, renovated hotel. Close the metro station and restaurants. Rooms are small but nice. Free WiFi. Friendly staff. I can recommend that hotel. It is really good for reasonable price.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Reston, Virginia", "Title": "“An Excellent Value & Perfect for our Needs”", "Author": "DdoubleB", "ReviewID": "UR103416456", "Content": "Well located near the Pernety Metro stop, the room--while small--was clean & comfortable, the bathrooms sparkling & modern, free wi-fi, and the staff very friendly and helpful. Really, the only minor complaint we could make was the fact that we had to close our window at night to keep out the occasional street noise outside--next time, I'd request a room facing the back of the hotel. It was great to be just a few Metro stops away from the historic core of Paris but not pay the higher price for a similar room right in the heart of the city.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Falmouth, Massachusetts", "Title": "“Well suited to our needs.”", "Author": "Ratchette", "ReviewID": "UR100631816", "Content": "The hotel is nice, clean with friendly helpful staff. The location is great with a metro stop at the corner and the train station in walking distance. Free internet, good plumbing, quiet. Couldn't ask for more. Its Paris, after all.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bend, Oregon, USA", "Title": "“Very Nice and Quiet Accomodations in Convenient Location with Excellent Service”", "Author": "GlobalTeachers", "ReviewID": "UR99053269", "Content": "We enjoyed our restful two-night stay at Hotel Apollon located in the Montparnasse area (in arrondissement 14). The lobby decoration is chic and very inviting. The hotel is conveniently located for attending the many theater performances or shopping in the area. It is also very close to Metro station - Pernety, cafes, creperies, small markets, a postal office and the Monparnasse tower. All 33 rooms in the hotel recently had been remodeled, including the bathrooms. Ours was in excellent condition. The hot shower and good water pressure were refreshing after our long flight. The fixtures and finishes in the bathrooms are top-quality and very nice. The hotel property is very well managed and maintained. Everything is in excellent condition, clean and attractive in the hotel, making it appealing to us as tourists and comfortable for business travel. Since we had 34-hours of travel time from home (in the U.S.) to Paris, the management provided us a quiet room, away from the street, to assist in conquering our impending jetlag. It was easy to fall asleep, because the room was dark and quiet. We slept for 22 hours and then, refreshed, we enjoyed our time exploring the Montparnasse area. The staff, including Joel and Alain who assisted us, were especially helpful in recommending places to eat and shop and in making us feel very comfortable upon our arrival and throughout our stay. The breakfast area, one level below the lobby reception, was very private and attractively decorated. We enjoyed the coffee and breakfast in this setting. We highly recommend this hotel for its service, comfort, quality and the convenience of its location.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“3rd visit - and the hotel just gets better”", "Author": "Gregelvis", "ReviewID": "UR94385484", "Content": "I have now stayed here three times: once with my fiancee and twice leading a school Art trip. I teach students who are used to very nice hotels - and they were all impressed with the Apollon Montparnasse", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Lovely hotel”", "Author": "Tasmac", "ReviewID": "UR92894158", "Content": "I liked this hotel very much. Friendly, helpful staff, immaculately clean rooms and a charming neighborhood that is not overridden with tourists. A bit off the beaten path, but only a block from Pernety metro station so very easy to get around Paris. I did not think the room was small at all - maybe I had one of the larger rooms? It was a very good size for Paris, and an excellent high spped wi fi connection. Many thanks to the front desk clerk who guided me to the AirFrance bus just blocks away when I was running late for the airport - saved me a frantic metro/RER trip and got me there in plenty of time.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Clean, comfortable and convenient”", "Author": "AntNahman", "ReviewID": "UR92630779", "Content": "Convenient location (30m from Pernety metro), with some great local restaurants nearby. Most of the staff were friendly and helpful, and were happy to help us in English, even greeting us by name on arrival. Our room was a bit on the small side and there is some noise coming off the streets at night, but it was clean and comfortable, and in general we were very happy. Great value for money.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ideal if you have visited Paris before”", "Author": "MattyBK", "ReviewID": "UR89912441", "Content": "We stayed one weekend (fri-sun) in the Apollon Montparnasee. We had visited Paris once before and stayed in Marais. I think this is a good follow up location; more local, quieter but still charming and easy access to the rest of the city (both walking and metro). You are 30 seconds walk from Pernety metro station. We enjoyed the shops and pattiseries of Rue Raymond Losserand as well as the charming local 'bib gourmand' restaurant Cantine du troquet 200m down Rue de l'ouest. In terms of the actual hotel, very attractive contemporary styled lobby. We received a pleasant welcome from the desk, very quick and very easy check in. The hotel is relatively small and nicely decorated beyond the lobby. We booked a superior room at 95e per night. It was relatively small without being restrictive. Pleasantly decorated, clean & modern bathroom, powerful shower, sufficient storage space, and a fridge. It was sub zero temperature outside so very nice touch that the heating was turned up for our arrival. The only criticisms that I could level at the room were that it was noisy when the two adjacent rooms opened and closed their doors. You can also hear the shower running in the adjacent room. We experienced no street noise at all. Throughout the stay, desk staff were always helpful in providing directions to specific places we were trying to find. I would definitely consider staying here again.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Lovely Paris find at a great price”", "Author": "savannahj3", "ReviewID": "UR88690019", "Content": "My mother and I stayed at the Hotel Apollon Montparnasse last week and loved it...the rooms were well appointed and comfortable, the light buffet breakfast was delicious and the front desk staff was excellent! They went above and beyond to help us with a few small requests throughout our stay. The hotel was just a block from the Pernety station, so we found the location wonderful and easy to navigate as well. We would definitely stay at this property again!", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Intimate, excellent, spotless.”", "Author": "mitchtwilson", "ReviewID": "UR87298505", "Content": "Stayed with my girlfriend at the end of Oct. 2010. First off, hotel staff on the phone and in person were very helpful, courteous and polite. Arrived at the hotel, a two minute walk from Pernety Metro station. Reception expected us, and right away had the mail we were expecting delivered to us. Very warm attitude at the front desk -- I can't tell you how helpful they were throughout our stay. We were allowed to check in early, given a brief walkthrough of how to get around the neighbourhood, just fantastic. The rooms are small, but this is Paris. If you come from the US/UK or Canada, don't be expecting room sizes in continental Europe that match what you're used to back home. What's more important, is that the rooms were absolutely spotless. The mattress was excellent, the decor was tasteful. Space for luggage, immaculate bathroom. Overall, I cannot say anything but praise for this hotel. If you are going to Paris and you do not want to break the bank in hotel bills, I strongly suggest you book at Apollon Montparnasse. Also, we stayed on the fourth floor, room 404. The view of Paris rooftops and impossibly blue autumn skies was fantastic. Writing this review is making me miss the trip already. More hotels need to be like this, haha.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“perfect for our site seeing trip to Paris”", "Author": "heleneliz", "ReviewID": "UR85583905", "Content": "Having searched extensively I was very much driven by other reviews for this hotel on T/A. It has exactly what has been said previously-small rooms but as everyone says this is Paris (I liked my room though, single room 102, it was quirky and didn't feel that small as it was a corner room so had two double windows). Very clean with lovely new showers. The staff are very keen to please and helped with any enquiry we had. It is less than five minutes walk from the metro (even for an 84 year old). Taxi's home from most places were around â‚¬10/â‚¬13. We didn't eat here so can\"t comment on the breakfast. There is respect among the guests and everyone seems to settle around 23.00. Comparison wise it seems to be good value. No complaints at all.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Georgous Hotel”", "Author": "bobbie1922", "ReviewID": "UR85447941", "Content": "We booked online from Australia in April 2010. Within minutes of booking we were sent a confirmation email. We arrived late afternoon by taxi and was greeted by Emmanuel who assisted with our suitcases. Booking in was a breeze and Emmanuel answered all our questions. The hotel foyer wasdecoreated beautifully just what I would expect in Paris. The size of the lift was no surprise as we had been in smaller lifts(and much older) in Greece and Italy. We were on the 5th floor. We had a window we could open for fresh air or close and have the AC on. Although our room was small by Australian standards we had stayed in smaller rooms elswhere in UK and Europe. Loved the decor. Having a fridge was a bonus, The bed was very comfortable and we utilised the extra pillows provided, they were much appreciated. . The bed linen was changed everyday. The bathroom was great, again we had experienced much smaller ones in other hotels .Fresh towels daily The shower was over the bath but that was not a problem for us. The rooms were cleaned daily. The hotel location was great and we would highly recommend it. There were tourist maps available in the foyer.The Metro was about 2 mins up the road. There was a number of restaurants within easy walking distance. There was a supermarket close by. Emmanuel had booked an Airport transfer for us 2 days previously.( While we were in Paris there was some industiral action taken by workers which had an impact on the Metro system, therefore it also had an impact on traffic and the number of people wanting transport to CDG airport.) We along with Emmanuel were becoming concerned when it did not arrive. Emmanuel was fabulous he rang the company to find out what was happening. He wasput on hold on the phone for quite some time all the while he was apologising to us. Eventually the transit van arrived and off we went. We were very grateful to him for his assistance and persistance as we don't speak french and to coin an Australian phrase \" would have been up the crrk without a paddle\". We loved Paris and had a great time. We have very happy memories of staying at the Apollen Hotel. Emmanuel and his staff were friendly, professional and extremely helpful.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Burwell, Cambs", "Title": "“Clean, friendly and well positioned for the metro at Pernety”", "Author": "Evaluna71", "ReviewID": "UR84879437", "Content": "We have just returned from a long weekend in Paris, and we stayed at this hotel, which I selected owing to the good reviews on this site. The room was small but comfortable, and looked newly decorated. We didn't try the breakfast as it seemed expensive at 11 euros each, although in hindsight, all eating out in Paris is pricey so it actually is about average. This hotel was in a good location for restaurants if you were prepared to walk about 5-10 minutes up the street towards Gaitie and Edgar Quintet metro stations, this was a lively theatre district area close to the Cimeterie du Montparnasse. The Metro Bar on the corner of the street very close to the hotel is friendly and serves good food at a reasonable price. We really enjoyed our stay in this hotel and discovering the area of Montparnasse, as well as some of the more touristy parts of Paris. Would recommend.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Good Value for location.”", "Author": "OwentheFlowerpot", "ReviewID": "UR84044043", "Content": "Nice hotel. Clean but small. Which is no bad thing as you'll probably be out all day anyway. Metro staion 20m away gets you into the thick of it in 10 minutes.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Awful Rooms”", "Author": "amaztraveler", "ReviewID": "UR83653882", "Content": "This hotel has pretty pictures posted on its website but the actual rooms are anything but. Cramped, dark, functionally obsolete are just some of the ways to describe the room we stayed in. This is the ultimate in false advertising. Also, the hotel manager is more than a bit rude when there is a problem. Finally, the room was quite dirty : ( Don't ruin your trip to Paris. Stay somewhere else.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Mateo, California", "Title": "“Best Hotel of the Trip”", "Author": "winespam", "ReviewID": "UR83481327", "Content": "Well put together rooms with comfortable beds and decent-sized bathrooms (for Paris). The bathtub/shower is a little tall and tricky to get out of. Great area with bars, restaurants and cafes all over the place. The Metro is only a block away. The 24-hour on-site staff were excellent, friendly, helpful and spoke great English. I recommend booking the airport shuttle advertised at the front desk to save any hassles going home. If this is your first time in Paris, stay somewhere in the 7th Arr. closer to Eiffel and the Rue Cler area where everything is in walking distance and there are more English-speaking waiters. However, stay at Hotel Apollon Montparnasse once you've mastered the Metro (only one block away) and feel comfortable in a less tourist-visited area. This is where I'm staying when I come back next year!", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wollongong", "Title": "“Lovely hotel in an interesting location, but don't try to get a taxi!”", "Author": "Baz_of_the_Gong", "ReviewID": "UR81277694", "Content": "We chose to stay at the Hotel Apollon based on earlier reviews and we really enjoyed the place. The rooms were very clean though compact; the bathroom modern (but in-bath shower would challenge the less able-bodied!); the internet was free and the breakfast in the cellar great value. There is a lift to all the floors, though it will only take two people, which can be quite romantic with the right companion. The staff were informative and helpful, and the 24-hour front desk was great in a smaller hotel - especially for those arriving back late after enjoying the Paris nightlife. The Apollon is situated very close to the Metro, and there are many lovely restaurants close-by (try 'Le Plan B' for a great meal and atmosphere). Overall, we had a great time until we tried to leave, when we found getting a taxi to Gare du Nord (for the TGV/Thalys) is IMPOSSIBLE at 8:00 in the morning!! Despite the best efforts of the staff, no taxis were available after 20 minutes, even though we had also tried to book one the night before. This delay left us with a rush across town on the Metro with two 20kg bags and hand-luggage - in the rush-hour!! The Metro is great if you have minimal luggage (escalators are rare, and there are many steps) but not recommended otherwise. There is an advertised shuttle service for the airport, so maybe the same problem does not occur for that destination. We would recommend the Apollon to others, but be aware of the taxi issue.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent friendly service, clean and comfortable, excellent value”", "Author": "georgekaz", "ReviewID": "UR81148034", "Content": "We stayed in this hotel in April 2010 and found it to be really excellent value and perfect for us. We're not the sort of travellers who spend a lot of time in our hotel, so it's more a place to drop the bags and access town. Although it's not bang in the centre of Paris, it's only a few stops from town on the Metro and within close proximity to a lot of the nicest areas. The owner (or at least the person who welcomed us) was really helpful, gave us a look at the rooms and the option to choose ours, made some phone calls to find attraction opening times for us, and let us leave our luggage there for the whole of the last day after checkout. The room was not massive, but it was clean, had a good shower, a comfortable bed and was quiet. I'd highly recommend it if you're looking for a good value stay in Paris.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Roma", "Title": "“Very bad stay”", "Author": "AndyRoma", "ReviewID": "UR81147323", "Content": "My twin room was big enough to walk around the bed. With the luggage for a week you probably need to rent another room for it. I had some screws and stuff on a table, which means they were working on the room and they forgot to take them out. The hotel has (one was mine) 3 rooms at ground floor, so you can't stay in the room with the window opened or you can talk to the people walking on the street. Of course traffic noises are very disturbing during the night. Probably due to the needing of putting 3 rooms in an ill-fitting place, the walls are like paper, so you can clearly hear people talking or going to the bathroom in other rooms . The breakfast room is underground, small, they don't have coffee(!!!!!) but just tea, they don't have toasted bread (!!!!!!!!) but just bread, and the coast for it is 11â‚¬. Immediately after seeing my room, I went to the front desk to ask for a different room and the employee(the afternoon one) told me that the hotel was full and it was impossible to help me... ok, I understand the problem, but.... could you please rise your eyes and take a look at me IN MY EYES while you're talking with me??? I guess I can expect to talk to someone who is taking care of me, not looking at his facebook account!! So at the end, you can go there, it has a very nice hall and a sufficiently good position, even if you have to walk more than a bit to reach a nice area, but.... be sure they'll provide you an high floor room, the price is the same, the stay...is appropriate! (I left the same comment also on venere.com)", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Wonderful Experience”", "Author": "mshiloff", "ReviewID": "UR81023964", "Content": "This was our first trip to France and we were delightfully impressed with the Apollon Montparnasse. The staff spoke excellent English and provided directions and suggestions along with a comprehensive map of the Metro. The rooms were a little on the small side, but who spends much time in their hotel room when there is so much to see and do in Paris? They have been recently redecorated with freshly done bathrooms in each room. The Metro is just down the block and from there you can get anywhere in Paris and the surrounding area. There are also several extremely nice restaurants in the neighborhood along with groceries, bakeries, and beer and wine stores.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "US", "Title": "“Great hotel, great staff, great location”", "Author": "texnote", "ReviewID": "UR80964556", "Content": "We stayed at the Apollon Montparnasse for three nights in late September 2010 (two adults, and a five year old child). The hotel, which apparently has been recently renovated, was exceptionally clean. The room was on the small side, but this is expected from many hotels in Paris. The bathroom was fantastic. Above all, the front desk staff with their perfect English were absolutely wonderful and the most helpful staff we've seen anywhere. Wireless Internet access was reliable, with a strong signal. We've been to 4-5 other hotels in Paris over the past few years and by far, in this price range, this was the best (we have stayed in better hotels but the price was quite a bit higher), The location of the hotel is great too; only 2-3 minutes walking distance to many supermarkets, bakeries, and eateries, as well as Metro Pernety station. If you walk a little longer and venture to Blvd Montparnasse, Rue dâ€™Odessa, etc, you will find great places to eat at very reasonable prices. Highly recommended are Creperie Les Glenan, Le Relais de l'EntrecÃ´te, and Chez Bebert . Overall, we highly recommend this hotel and especially their staff!", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Roseville, California", "Title": "“Nice hotel - everything it promised”", "Author": "WanderlustRoseville", "ReviewID": "UR79775137", "Content": "This hotel is not located in a tourist-infested area so you get more of a local neighborhood feel walking down the street. Nevertheless, it is very close to the metro - 2 min walk and you can get around all of Paris very easily. The hotel is newly renovated and even though the rooms are small, they are nicely decorated and very comfortable. The bathroom is not much bigger than an airplane lavatory but with the addition of a small shower. It's very clean, brightly lit and does not feel as cramped as you might think. There is even a small refrigerator in the room which is convenient for storing drinks, yogurt, and cheese. The bed is comfortable with clean linens. The air-conditioning is a plus for a good night's sleep. The only negative that I could think of is the thin walls between the rooms. My neighbors' conversations are audible in my room and the slamming of the doors are loud whenever someone leaves or enters their room. The hotel clientele seem to be aware of this and are respectful of other guests so it's very quiet after bedtime. The staff at the front desk is professional and speak English well. They are present 24/7 so you don't have to worry about being locked out of your room. The hotel has a policy for the guests to leave their room keys at the front desk when they leave and pick up when they return as a security measure to prevent loiterers. So for you single travelers, this hotel is a safe bet.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“Great location & services, close to metro station”", "Author": "Atirek", "ReviewID": "UR79693583", "Content": "The hotel was a great find on tripadvisor. The staff was super helpful, and the hotel is only a block away from the metro station. The rooms were clean, and the size was reasonable, given the cost and that it is in Paris. Overall, a great find, and highly recommended.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Elgin, Scotland", "Title": "“Excellent staff and ideal location”", "Author": "linseyjx", "ReviewID": "UR79601158", "Content": "Reception and breakfast staff were very friendly and helpful. Ready to give directions/advice in French or English and even provided us with a couple of bits and bobs so that we could go for a picnic! Hotel in an ideal location, Pernety Metro right across the street so you are only 10mins from everywhere. Area typically French, exactly what we were looking for, lovely restaurants/bars etc. Couple of housekeeping complaints, but doesn't everywhere? i.e. hair in the bath and a dirty top sheet on the bed, but was changed for us immediately when we made them aware. Would definately stay again! Breakfast is definately worth the 11 Euros when you compare what you get for that out and about, nice little touches like a large jug of hot milk served with your coffee. This hotel has no bar or restaurant area but with so many options in Pernety this didn't affect our stay at all. There's a lift to all floors and a nice modern seating area at reception. We paid 120 Euros per night, including breakfast and were given a surprisingly spacious room with a bath and shower en-suite.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“I can't imagine staying anywhere else!”", "Author": "Speedtwins", "ReviewID": "UR79565353", "Content": "The Hotel Apollon Montparnasse was one of the greatest hotels we've stayed. I took my wife to Paris for her birthday and chose this hotel based on the reviews. The hotel was located just a block from the metro, the neighborhood was safe and the hotel was clean, updated and well maintained. All of this was no surprise as all of the reviews stated so on TripAdvisor. The real surprise was the hotel receptionist, Joel. He was without a doubt the most helpful receptionist we have ever met. It did not hurt that my wife is Brazillian and we both speak Portuguese, as Joel is Portuguese as well. But he was simply awesome! He told us all of the great places to go, and even went through great lengths to book a reservation for us to a Cabaret show on our last night. I can't say enough about how much he helped make our trip one of the best ever. If you ever go to Paris you have to stay at this hotel. You absolutely will not regret it. A couple of points to know. Plan on arriving after 2PM as it was the case for us that our rooom was not available when we arrived in the morning. That wasn't a big deal for us but you might want to make note of that. Also, our room was a little small, but then again, we didn't spend much time there so it wasn't an issue for us at all. It was clean, comfortable and even a little \"cozy\". We will always stay at this hotel anytime we go back to Paris. Thanks Joel!", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Marlow, United Kingdom", "Title": "“A wonderful hotel with superb staff”", "Author": "Ajortho", "ReviewID": "UR76437093", "Content": "From my initial conversation to the moment we departed this hotel ticked all our boxes. After two weeks in the South of France and after a 7 hour drive to Paris we were greeted with a smile and an ease of check in that many major hotel groups would do well to copy. No fuss, no lengthy wait whilst processing a credit card guarantee, just a distinctive focus on getting us to our rooms as quickly as possible with minimum amounts of fuss! This enabled us to then find a local Bar ( Bar 57) across from the hotel to eat and drink and keep our three travel weary teenagers very happy! Yes the rooms are small but who cares, we visited Paris to see the City not spend hours in our hotel bedroom! The bathrooms were small too but a powerful shower and good lighting enabled me to feel clean and my wife to put her make up on without complaining about the poor light very often found in more upmarket hotels! The hotel was quiet with little invasion of traffic noise so a great sleep always followed the drinks we downed at Bar 57. Breakfast was a treat too! Down in the cellar an attractive breakfast of croissant, bread, fruit, cereal, yoghurt etc was served with a smile. Our children's request for milky hot chocolate was always met with enthusiasm and each day was set up perfectly following Le Petit Dejeuner. All members of staff went out of their way to help with restaurant recommendations and things to see. Overall a super hotel in a non touristy part of the city that was within 200m of the metro. We ate mostly within 0.5km of the hotel in a great Algerian restaurant and at Bar 57. I have been to Paris many times both for work and pleasure but this vacation was simply the best and all because of the hotel and it's staff.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“A safe bet in a city with too many poor hotels”", "Author": "Justin_Dillon", "ReviewID": "UR76410447", "Content": "The Hotel Apollon Montparnasse is clean, reasonably decorated and close to a Metro station. The staff are helpful and in some cases delightfully chatty. If youâ€™re paying extra for breakfast, itâ€™s probably worth it. It is, as the two stars suggest, compact. That is, youâ€™ll probably need to get into the shower sideways if youâ€™re above average height. The beds have relatively thin mattresses but theyâ€™re quite comfortable. The air conditioning works well even in Parisâ€™s humid summer. The wireless Internet works and its free. Overall, this is a good 2* hotel not far from the city centre. If room size isnâ€™t a problem then the Hotel Apollon is a sound choice. I've stayed here on two separate occasions and would be happy to return.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great hotel for the price. Exceeds expectations.”", "Author": "yogini1301", "ReviewID": "UR76164648", "Content": "This hotel was absolutely perfect for the price. It was charming, clean and the staff was very nice and helpful. It is a little far from the main attractions, so the metro, which is right down the street, is really helpful. Also, the rooms and the bathrooms, as in all Paris hotel rooms, are very small. Overall, I will definitely return to the Hotel Apollon.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "swindon", "Title": "“Nice stay”", "Author": "loveisahoax", "ReviewID": "UR75296003", "Content": "we stayed here for one night in August 2010. the hotel was quite hard to find with all the one way streets and google maps was trying to send us down a street which was blocked off due to building work. But the hotel was lovely, the room was nice, the man at the reception was brilliant. all in all a great little cheap hotel.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southport, United Kingdom", "Title": "“A chic, friendly hotel with very helpful staff”", "Author": "mh1_10", "ReviewID": "UR74259145", "Content": "My wife and I stayed here with our two daughters aged 16 and 12 in two rooms. We asked to be next to one another and this was no problem. The rooms were on the small side (pretty typical for Paris in fact) though very clean, and smartly decorated with excellent bathrooms. Staff were very helpful and friendly throughout our stay. The hotel is 50 yards from the Pernety Metro station, and in a nicely untouristy district; there are bars, restaurants, a variety of shops, a post office and cashpoints more or less next door. We would definitely recommend this hotel.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Burlington, Canada", "Title": "“Nice Place in a good neighborhood in Paris”", "Author": "AMac333", "ReviewID": "UR73931609", "Content": "Spent 2 nights. A nice neighborhood 5 minute walk from Montraparnesse station and Montraparnesse tower, 75 yards/30 seconds from subway station. Easy to find, safe neighborhood and good location to explore Paris from. A very reasonable price compared to other hotels in Paris. Air Conditioning worked well, bathroom was clean, bed was comfortable, staff was helpful, rooms were small but all that was needed. Not a lavish Paris experience but good place to stay for 95 euro/night. I beleive price was a promotion.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mountnessing, Essex", "Title": "“Great value, friendly and good location.”", "Author": "rhodesde", "ReviewID": "UR72453445", "Content": "The hotel is well situated close to a good selection of local restaurants and bars, prices for which are so much better than those in the central and popular areas of Paris. The rooms were tidy clean and more than adequate. The reception people were brilliant and were always ready with a friendly welcome and a willingness to help where possible.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tacoma, WA", "Title": "“Best Value in Paris, Experience the Local Community Outside of Tourism”", "Author": "tkhagen", "ReviewID": "UR72094391", "Content": "We stayed three nights at the Apollon for almost what it cost our one night near the Louvre. So expect a simple, small, clean room. The service was very, very good. Actually, the shower was much larger at this hotel as well, but no tub. They really cared about our stay, and spoke enough english to help us out. The best part of our stay wasn't the hotel, but eating and hanging out in a working class neighborhood. We lucked out to be in town during the World Cup, and while France was long gone, the local bar/cafe had TVs placed out in the street corner showing the other games. The local food and eateries where authentic and economical. Look, if you can afford to stay downtown with a view of the Arc de Triomphe or are uncomfortable taking the subway, then the Apollon isn't for you. But for the rest of us who travel on a budget and are willing to take public transportation (subway entrance is one block from the hotel) this was the best value in town. Simple and friendly. I would return next time, save my money and hang out with the local French people anytime. Our best experience in Paris was this local neighborhood.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“The Front Desk said it All!”", "Author": "McRenn8", "ReviewID": "UR71268665", "Content": "This was our first trip to Paris and, of course, we used Trip Advisor to find a nice, well-priced room. We booked kind of late and was surprised to find Hotel Apollon as it was highly rated. We arrived after the Chunnel, the crowds at Paris de Nord, and several Metro changes - the directions provided by the hotel were perfect. Emmanuel greeted us with a huge smile, checked us in quickly, explained the room and amenities, and sent us on our way. The room was typical - compact - and the bathroom well-appointed and efficient. Every time we left the room, we were greeted promptly by the staff and asked if everything was okay. Emmanuel was extremely helpful and assisted us in navigating the area and the top sites. The only thing I would improve would be the size of the TV. Normally, the TV is a distraction, but this was World Cup time and the games would have benefited with a larger screen. You are also in a city, so there was some street noise at night. I would change nothing else. There is also a little Italian restaurant by the Metro station on the same street as the hotel. We had several enjoyable meals there and highly recommend the pizza and house wine. When Paris is on our itinerary again, this is the hotel we want.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oceanside, California", "Title": "“My new favorite hotel in Paris!”", "Author": "run1mkat", "ReviewID": "UR71263346", "Content": "GREAT hotel! The location is perfect: very close to a Metro station, stores, cafes, restaurants, ATM, post office. Also within a little longer walking distance is a major train station and major shopping area! The hotel staff was very friendly, accommodating and helpful. The room was very clean and bright. It was such a bonus to have a refrigerator to keep drinks cold in the horrible heat, air conditioning and free Internet service! This hotel will always be the first on my list when traveling to Paris.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wiesbaden, Germany", "Title": "“A Pleasant Suprise”", "Author": "intheskies", "ReviewID": "UR70059608", "Content": "We spent one evening at the Apollon, as our original hotel booked had lost our reservation and had no rooms. My partner was nervous about the 2 star rating but we could not have been happier and in fact it was nicer than the original 3 star hotel. Rooms are of a similar small size as most urban Paris hotel rooms are. Lobby clean, staff helpful, quiet nights sleep and wonderful air con on a steamy hot sumer evening. Bathroom unusually large for a hotel room, and spotless. Had we known that the hotel we changed to was not as nice and was more money, we would have just stayed here the additional nights. This hotel is a leisurely 10 minute walk from Montparnasse station, but other ones are close by. Restaurants and cafes within a few minutes, as well as the bicycles stands with cycles for rent.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "san diego", "Title": "“Typically small but in a good location, average value with thin walls.”", "Author": "jacksonlui", "ReviewID": "UR69801730", "Content": "Stayed for 4 nights. Staff was helpful and courteous. Breakfast is not included and at 11 euros, not a good value considering the many alternatives available in the city. Excellent air conditioning, works very well and is important to most Americans. The rooms were really small and is typical of the area. There's no space to move around for two people. The beds were comfortable and the rooms were very clean which is also another important factor. The shower stall wasn't working properly so the floor was always wet. Every room as a fridge which was nice for keeping drinks, although the fridge didn't work that well, it only kept the drinks cool. The walls are thin and you can hear when people got up or ran the shower, I think this is also typical so no complaints here. The decor was poor and gave the room a very dull feel. It felt very much like a dorm, I think much can be improved in this department. Housekeeping did a good job. The sheets weren't perfect being that they are not bright white and the top cover felt old and used. However, I didn't have any problems with itching. I felt that you can pay a little more and get more space and a better ambiance. The beds were comfortable. Overall, this is an above average establishment. Has all the important necessities (cleanliness, location, air conditioning, internet access) if that's the only requirements that you have.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“A delight in Paris”", "Author": "Have_Bag", "ReviewID": "UR68156809", "Content": "We compiled a short list from Trip Advisor of hotels that sounded like what we wanted, but as dates were uncertain, we couldn't prebook. We rang another place when we had our dates sorted but they were full. A phone call then to Apollon secured a booking. We had clear instructions given to us over the phone about the Metro to catch and walked straight there. The hotel is smallish (at a guess no more than 30 rooms) and has just been tastefully refurbished in a modern simple style. All the staff we had contact with were committed to providing the best experience for us. The owner was there on a number of occasions and also took interest in our feedback. He was justifiably proud of what the hotel offers and at a fair price. The free and fast internet was a bonus as we were there during the volcano crisis. Even though we had a room on the street, effective double glazing kept it noise at bay.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Devizes, United Kingdom", "Title": "“Perfect for a short stay in Paris.”", "Author": "andyshepp", "ReviewID": "UR67376557", "Content": "We stayed in this hotel for 5 days, it was perfect just 3 mins walk to the neerest metro and a 5 min ride and you are in the heart of the city. The rooms although small are very clean,comfortable and quiet, the staff speak perfect english and were very helpfull. There are lots of local bars and restarants to choose from just a short walk from the hotel.We would certainly stay here again.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "vicenza, italy", "Title": "“Comfy room, great rates, great stay!”", "Author": "mnaylor", "ReviewID": "UR67208452", "Content": "I picked this hotel after reading other reviews on this site and we were not disappointed. The room was big for a European standards, and bigger than i expected. For the two of us it was great--not at all crowded. The staff was so helpful that I kept asking them for more and more help--restaurants, sights, the metro, the airport shuttle, what food is best in Paris, night life, they had a great answer for everything, and they told me with a smile. Really a great place to stay. Not really close to any sights, but because it's right next to the metro it's just as easy as you please to get anywhere you want to go.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great friendly little hotel,close to metro and fine small shopping street”", "Author": "Wisteria9pmq", "ReviewID": "UR67055329", "Content": "The real Paris, not in a touristy zone but 150 metre to Pernety Metro station so you can get anywhere quickly, and a small street full of all you need to eat , drink and enjoy. Walking distance to Gare Montparnasse and Cemetery and a good brisk walk to Jardin Luxembourg. Hotel itself small and quiet. My (single) room small comfortable, affordable (108 euro), good facilities, AC and good shower with plenty of hot water, all essential for me. Staff friendly, helpful and multilingual. I will be staying there next time I'm in Paris too. Soon.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A small but very nice hotel & well worth staying”", "Author": "StueyJ", "ReviewID": "UR66454927", "Content": "We decided to spend the May Bank Holiday in Paris which was also our wedding anniversary. I had tried other Hotels but Paris was very busy and this Hotel was recommended for its value by Trip Advisor. Montparnesses was not an area I would have chosen but the Hotel and the area are ideally based for exploring the Left Bank. the Hotel is small but is very smart and stylish having been recently renovated as I understand. The staff are very welcoming and helpful. The rooms are small but that is typical of hotels in any major city but they are clean and spotless, and cleaned every day. The Hotel is a 2 minute walk from the Metro (Pernety) and the line provides good links and connections particularly to the Gare du Nord. Breakfast was 11 euros each but there was croissants, bread, cereals and yoghurts and cheese and cold meats plus juices and tea & coffee so it is good value and sets you up for the day. The Hotel is on a quiet road and even with the window open we were rarely disturbed. No hotel in Paris is cheap but the Hotel is good value and dont be put off by the fact it only has 2*.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Stay, accessible, clean hotel”", "Author": "Mendeldave", "ReviewID": "UR66421242", "Content": "My wife and I stayed here for a few nights when visiting Paris from the US for a friend's wedding. We had a nice time. It's a quaint, quiet hotel in a \"neighboorhoody\" section of Paris. Very close to the subway and also to a main train station, which was great because we were able to walk there with all of our luggage to continue on to the rest of our vacation. There are a lot of cafes in the area, and it's also walking distance to the catacombs. We actually walked all over the city from here (walked to the eiffel tower, Rodin museum, Moulin Rouge, etc), but being New Yorkers, we're used to walking a lot. If walking does not sound great to you, the subway is literally a few short blocks over and goes everywhere. We were also able to take the train from the airport straight to the hotel. I think there may have been one subway transfer, but it was easy to manage. The hotel staff were quite friendly and eager to speak English to us, plus they had free internet access. The breakfast was good, though a little more expensive than getting the same thing at any of the nearby cafes. If you're an early riser on a weekend, it might be easier to just eat at the hotel, as we found we were getting up before many of the cafes opened. Also, the hotel was very clean. The rooms are REALLY small, but this is normal for Paris. We just wanted a nice bed, a safe room and a good shower... all of which we had. We also had a nice little TV though we didn't really use it. I'd recommend this hotel and will return again. The price was reasonable and the neighborhood was great ---we felt like it was more authentic and we were not surrounded by other tourists.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Location, location, location”", "Author": "sundinkc", "ReviewID": "UR66054094", "Content": "My wife and I stayed at Hotel Apollon Montparnasse for three nights at the end of May. Overall, this place is a great value providing a quality product for not a lot of money (comparitively). The biggest asset of Hotel Apollo is it's biggest drawback: Location. Hotel Apollo is located in the Montparnasse neighborhood of Paris which is a little off of the beaten path. By staying here and shopping and eating in the neighborhood visitors will get a taste of what \"real Paris\" is like. Within a block or two are cafes, brasseries, and stores of all types. The people are less likely to speak English as they are in the more touristy neighborhoods but that's okay. They were all good sports with our limited French skills. This being said, if you are out at any of the Parisian hot spots our eating in the trendy neighborhoods, when you're done, you have to trek back to the hotel. There is not a thriving social scene in this section of Montparnasse. We stayed in room 3 which was an average size European hotel room. The bathroom looked to have been recently renovated and the shower had great water pressure and temperature. The bathroom door didn't really latch completely and the deadbolt on the room door did't function but we decided these were not enough of an issue to switch rooms. The one window in the room overlooked a small interior courtyard which seemed to be used for storage. The room had a small TV with basic cable and a refrigerator. There was free wireless internet and a free computer to use in the lobby if you aren't travelling with a laptop or smartphone. There was an airconditioner that we didn't use. A continental breakfast buffet was available for 11 Euros. We ate it once and it was nice. It provided more than we were looking for so the next couple of mornings we went to the cafe down the street for a cheaper breakfast. The hotel is located 3 minutes from the Pernety Metro station and a 15 to 20 minute walk away from the Montparnasse train station. Tip: if you are mobile and coming from the airport you can take the RER B from Charles de Gaulle or Orly to the Denfert-Rochereau stop. The hotel is a 20-30 minute walk from there.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Tripadvisor reviews are spot on!”", "Author": "yayawhat", "ReviewID": "UR65974295", "Content": "I was responsible for finding cost effective accommodations for myself and 4 other friends for a wedding in Paris, May 2010. I turned to Trip Advisor as per usual and found great reviews of this hotel. I have been to Paris a number of times and this will definitely be my permanent hotel on future visits. Rooms are clean, shower is incredible, very soundproof and quiet at night. The reception was always extremely polite and helpful to the point that we questioned whether we were actually in Paris!! The only drawback was that a friend couldn't get online with her work laptop and they didn't seem to know how to fix it so maybe not ideal for the work traveler. Also in the basement there are drink vending machines, but a snack vending machine would be great for those late night eats.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Waterville, VT", "Title": "“A little gem right next to Gare Montparnasse”", "Author": "HowieDWaterville_VT", "ReviewID": "UR65690723", "Content": "This recently renovated hotel is tiny but just a 5 minute walk from Gare Montparnasse. We chose it for it's convenient location, but were unexpectedly charmed by the fabulous breakfast (served in a basement grotto beneath the lobby), and the helpfulness of the front desk staff. It is a perfect home base from which to explore the city (the Metro stop is just up the block). The Air France bus #4 runs from Charles DeGaulle airport right to the train stations, so you won't need a taxi. The rooms are small, but are immaculate and cozy, and are served by a lift to the upper floors. Treat yourself to this intimate hotel experience while visiting Paris; you will not regret it.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "KÃ¸benhavn", "Title": "“My 10th stay at this hotel”", "Author": "sukkerknald", "ReviewID": "UR65567761", "Content": "I have stayed at Hotel Apollon Montparnasse 10 times during the last eight years. I come back because the hotel is good value for money, rooms are small but clean and all you need is there. The neighbourhood is very Parisien: cross the street is the Metro Pernety which will within 15 minutes take you to all tourist attractions: Grand Magasins, Tour Eiffel, Champs Elysee etc. The care 'Au Metro' on the corner is just lovely and cozy. A 15 min. walk and you are at Montparnasse with great shopping, cinema and restaurant options. Yes, I am coming back.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haarlem, The Netherlands", "Title": "“Convenient hotel”", "Author": "novi76", "ReviewID": "UR65476852", "Content": "Stayed for two nights. Service of the staff was above expectations. Was very attentive and gave us a very good dinner recommendation. The room was not spacious but you can't expect that in Paris. Location was nice since the pubs and shops were also visited by locals. And with the subway around the block everything was doable. It was a convenient place to stay.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester", "Title": "“Excellent friendly and very clean hotel”", "Author": "WorcesterOvalball", "ReviewID": "UR65205204", "Content": "Excellent friendly hotel. Great location, near the Metro . Good bars close by. Real life going on all around. Nice friendly , safe feel to the area. Helpful staff. Rooms and bathroom very clean Mark - Worcester, England", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Best Hotel Experience in Paris!”", "Author": "HorseWisdom", "ReviewID": "UR64544603", "Content": "We were stranded and the owner of the hotel rescued us and \"took us in.\" We felt like royalty and were treated like family. We had a super room with tub and a refrigerator. All is clean and bright and comfortable. We especially grew to love the neighborhood: \"where the real Parisians live,\" and not overrun with tourists. Less English spoken which gave us a chance to practice our French. The prices in the restaurants are less, too - a bonus if you're on a budget. And, the Metro stop was a short block away. We will return the next time we need a hotel in Paris. We stayed 11 nights and were completely satisfied. The Desk Managers were \"over-the-top\" helpful and friendly - truly a fun and welcoming place to stay.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Friendly helpful Hotel in a relaxing area of Montparnasse”", "Author": "Markeile", "ReviewID": "UR63747446", "Content": "A short weekend away with friends and to get away from the big cold hotels we chosea small friendly boutique style hotel in Montparnasse. It is a stone's throw away from Pernety Metro and so the attractions of Paris are just a metro away. The hotel staff go out of their way to make you feel at home from printing out your boarding cards for Airlines, to keeping your bags til time to depart this romantic and impressive city. From remembering your names to suggesting a local brasserie nearby. All in all if your looking for an informal but friendly little hotel check this out.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Berkeley, California", "Title": "“Lovely hotel with friendly service (if you want a respite from tourist central)”", "Author": "bruinoski", "ReviewID": "UR62907447", "Content": "My partner and I stayed at the hotel for two nights. We arrived late on the TGV from Bordeaux and were warmly greeted by reception. The hotel is away from the center of Paris and much of the tourist sites (this was a plus for us!). It is, however, conveniently located one block away from the Pernety station. The room was on the smaller side (like most Paris hotels), but nicely decorated. The concierge staff always made an effort to greet us by name and helpful in making restaurant bookings. My only complaint was some early morning construction next door. We were woken up one morning with the sound of constant pounding. That helped us to get an early start to the day, though! If you are looking for luxurious accommodations, this would not be the place. However, if you're looking for a comfortable hotel at reasonable prices and a friendly staff, I would highly recommend the Hotel Apollon.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Nice Hotel; Good Value”", "Author": "AJEsq2010", "ReviewID": "UR62795680", "Content": "Stayed here with family earlier this month. Very nice hotel that is a good value for the money. The room we stayed in was rather small by American standards, but apparently normal for Paris. Location is great, less than five minute walk to Metro station. Area around the hotel seems nice as well, not very touristy at all. However, because its away from the tourist center, no one speaks English. So pick up some French before you go. The hotel staff are very nice. Emmanuel is very helpful and pleasant. All in all, its a great place to stay in Paris thats not too expensive.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“not bad”", "Author": "BangThida", "ReviewID": "UR62563245", "Content": "We stayed 2 nights in a superior room which was very clean and with a good sound insulation. Breakfast was acceptable.I found the day receptionnist a bit obsequious and one evening we had to wait 15 minutes outside when his night colleague was fixing a shower in a room and had locked the front door. The room and the bed were small, but this is Paris. The neighbourhood does not have much interest but it seems safe and Montparnasse is only 10 minutes away on foot", "Date": "April 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Portugal", "Title": "“Best choice in Paris”", "Author": "PortugalClaudia", "ReviewID": "UR59827010", "Content": "Small and nice hotel with a convenient location just a few blocks from a metro station. Nice decoration, newly renovated, well furnished and incredibly clean rooms . And staff at the reception are incredibly friendly and helpful and they really do their best to make you feel home. Great value for money! Will come back and highly recommend Hotel Apollon Montparnasse!", "Date": "March 29, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vermont", "Title": "“THUMBS UP ON THIS ONE”", "Author": "Ravvermont", "ReviewID": "UR58158225", "Content": "If you want a clean hotel room, an incredibly helpful staff, a solid breakfast before work or sightseeing and all at a very reasonable price this is your hotel. From start to finish this hotel was the perfect base for a very entertaining five days in Paris. Itâ€™s perfect for the romantic couple or the traveling business person. The metro is one block away and the quiet neighborhood ensures a great nightâ€™s sleep.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Friendly place in the 14th arr.”", "Author": "saxnix", "ReviewID": "UR57307673", "Content": "I stayed there for a business trip and the weekend in mid February 2010. While I've been to Paris frequently I still struggled to find a hotel that is privately run and that offers good value with friendly staff. The Apollon offered just this with a small but spotless bath room and a comfy bed and nice interior design. It's located in the Montparnasse residential area so instead of views of the Champs Elysees you find a flower shop over the street and other essentials for Paris neighborhoods like brasseries with oysters up the street opposite the metro station. Hope this helps you.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "South Carolina, USA", "Title": "“Great location, cozy hotel, friendly staff, clean & safe”", "Author": "JillfromSC", "ReviewID": "UR55823841", "Content": "This hotel is in a great location in Montparnasse, it's a nice area that has a neighborhood feel. On the same block as the hotel is a grocery store, the metro, bakeries, shops and some really good restaurants. I ate at La Cantine du Troquet and Les Frangines which were both very good. A neighborhood bar was up the block and the owners are very nice, Brassier 57. I felt very safe here traveling alone. The rooms weren't very big, but I think that is quite common in Paris. They were clean though and since i only used them to shower & sleep, it was fine. I'm not sure that my husband and I would have been very comfortable in the small bed but there were other rooms in the hotel that were larger than mine. Wi-fi is free. And I felt the price was very fair compared to other hotels I researched. Enjoy!", "Date": "February 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Newly redecorated, giving a friendly personal service - my hotel of choice”", "Author": "LadyLalande", "ReviewID": "UR54570473", "Content": "I come to Paris frequently, and I have stayed in many hotels over the years. The standard of decor is excellent, with all the facilities that you need. Most importantly the staff are friendly and extremely helpful. It is very close to the metro, and Pernety is a charming quartier, popular with visitors, without being over run with tourists.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Clean, Cheap and close to the Metro, with excellent staff”", "Author": "AndyWallace", "ReviewID": "UR53662951", "Content": "My girlfiend and I stayed here over New Years and we very happy with it!! The rooms are not big, but apparently they are all like that in Paris. They are clean, comfy and the staff were excellent in helping us around the city and making reservations for us at restaurants. The hotel is also very close to the Metro with excellent links to everywhere. I would stay here again if/when I return to Paris.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Fantastic hotel - Very good value for money”", "Author": "jalpa112", "ReviewID": "UR53324154", "Content": "I loved everything about this hotel - from the location to the staff. We went in early October when the hotel was just refurbished. As all paris hotel rooms, this pne was small too but very clean and neat and had very good interiors. The bathroom was very good and clean. We had no complaints at all. The staff was exceptionally helpful, specially Emmanuel, who made this stay very memorble for us. He was helpful and guided us to all the places. As we are Indians he guided us to a nice Indian restaurant nearby (3 minutes walking distance) and was vgenerally very helpful. Also, this hotel is located in a very quite place so after a day of sightseeing and walking a lot it felt good to come back here. It has some nice coffee shops around it. If I visit Paris again, I would stay here again!", "Date": "January 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“best: Hotel Apollon Montparnasse”", "Author": "webbph", "ReviewID": "UR52813757", "Content": "We stayed11 nights at this lovely hotel over Xmas and New Year's.Absolutely hepful staff that went over and above what I usually expect from personnel.The two ladies who worked the breakfast room every morning were funny,cheerful and a joy to see every day.Our room was always cleaned,towels were changed daily and there was always lots of hot water.I always felt safe in the hotel.We had a room facing the street but it was so quiet because the hotel is just off the main road.The room had heavy drapes that blocked off light at night.Thoroughly enjoyed my stay and would stay here again.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Almost like home when a long way from home”", "Author": "FrancophileOZ", "ReviewID": "UR52621391", "Content": "My second time. Convenient location with Pernety metro a minute walk away: never waited more than 3 mins for a train. Good restaurants nearby. Hotel staff welcoming, and incredibly helpful. 24 hr reception. Le Patron a true gentleman, to his staff as to his guests. He remembered me from a year ago, when he asked my opinion on his proposed renovations, now complete [and very fine they are, too!]. Good breakfast. Rooms tiny yet comfortable, but that's part of the Paris experience!! A laundry nearby, in rue de l'Ouest [there are some others, near Pernety station - but not so good], will take most excellent care of one's laundry - same day service. La Poste is around the corner, too. Is in predominantly residential area, so a true village experience; Sunday morning/brunch in one of the local bistros is cool and laid-back - with very few tourists. This hotel was originally recommended to me by a Parisian medical colleague of mine: best advice he ever gave me :). I'll be back again in 2010.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Well located, clean accomodation for reasonable price”", "Author": "nyikoka", "ReviewID": "UR52620010", "Content": "Very nice and clean rooms, fully refurbished. Not the biggest rooms though, but good enough. Breakfast in the basement, good french stuff. Close to public transport, good location. Extremely friendly staff, actually this is the most appealing factor. There's also free wifi.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Clean, modern if small rooms. Friendly staff and good location.”", "Author": "mynameisjonas", "ReviewID": "UR51546936", "Content": "Was travelling with my father and girlfriend for a one night stop in paris before heading south. We were all pleasantly surprised by the hotel which while one of the cheapest in the areas felt clean and modern. My only criticism would be that the rooms are a little on the small side with no frills or luxuries apart from a small empty fridge. The hotel is just a stones throw away from Pernaty metro station and a short 10 minute walk from the Gare Monparnasse.", "Date": "December 20, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Very pleased with my too-brief stay”", "Author": "joie952", "ReviewID": "UR51350805", "Content": "I stayed at Hotel Apollon Montparnasse while passing through Paris on my way from London to New York. After having stayed a week in London at a similarly-priced but shabby hotel, the Apollon was a breath of fresh air. The receptionists could not have been friendlier or more helpful and welcoming. The room was small - expected - but with simple but lovely decor, and clean and well-appointed. Despite being there on a Sunday night, I did find several places open late to eat. I'd highly recommend this hotel!", "Date": "December 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alison AlmgrenSydney, Australia", "Title": "“Simple, cosy and friendly - and in a great location”", "Author": "Ali_and_Hein", "ReviewID": "UR50318379", "Content": "This was a lovely place to begin and end each day of the seven we spent in Paris. Yes the room was small... but hey! it is Paris. The hotel is 2 mins walk to Pernety Metro station so it was incredibly easy to get to and from most of the major destinations. Room temp was nice, the bed comfy, the shower never lacked hot water. Who'd have thought that in a wee room you could also fit a desk, minifridge and cupboard. Breakfast was simple though each and every croissant and bagette was delicious. The staff were keen to help and had very decent english-language abilities. The immediate neighbourhood includes a post office, ATMs, fresh food shops and laundrettes. Paris is a wonderful city all on its own, but it certainly helps to stay in a place like Hotel Apollon were nothing was too much trouble and the room was a cosy haven to continue the romance of the day.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Decent hotel in a nice area. Excellent value.”", "Author": "Kingerdahill", "ReviewID": "UR48571581", "Content": "Stayed here for 2 nights on a weekend in October. Was extremely pleased with the hotel. It was better than a two star and the superior room we had booked was very clean and good value for money. It was not massive but of an ok size. i was actually expencting it to be tiny! The area is nice but be warned that most shops close on a sunday and monday. Went to Nuxis restaurant on the Saturday night which was memorable.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Great value in a pricey city - wonderful staff”", "Author": "VinSomething", "ReviewID": "UR48018845", "Content": "I originally had reservations at a different hotel in the city, but after reading the reviews here I decided to change my reservation to the Apollon Montparnasse. I stayed for 4 nights with my wife in Room 301 - two other friends also stayed at the hotel in Room 404. Our Deluxe Room would be considered tiny in the USA, but we knew what to expect going in. Pros: Helpful and friendly staff 24x7, safe yet lively neighborhood, close to train station, pastry shops, ATM, restaurants, late-night \"corner\" store across the street for drinks/snacks, great value for price, free wireless Internet that was stable. Cons: No food in room policy, expensive breakfast (11 euro per person, didn't try it - went with crepes or other pastries for breakfast from local shops for much cheaper). Hotel name isn't clear from street - not sure if the name changed recently - but I walked by a few times before figuring out I had to be in the right place. Oddities: You leave your roomkey with the front desk when you leave. It's strange and it bothered me at first for some reason, but I adjusted. I suggest the Air France bus to Montparnasse station. Not as close as Pernety but it's only a short (<10 min) walk away. Easier than navigating the Metro with bags and cheaper than a cab. Budget at least an hour for the ride to/from the airport. I'd stay there again in a heartbeat on my next trip to Paris. If you're looking for a cheap place to stay that's in a safe neighborhood close to the Metro then this is your place. Expect friendliness from the staff, but realize you are not staying in a 4 or 5 start hotel.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Leeds", "Title": "“Good hotel, close amenities, not the best for tight budget or with small children”", "Author": "AmericanInLeeds", "ReviewID": "UR46289050", "Content": "I stayed at Hotel Apollon for four nights with my husband and four-year-old. The room was very clean and beds were comfortable. We felt welcome though sometimes misunderstood. Hotel has much to recommend it in terms of location: one block from Metro, 1/2 block from post office, 1/2 block from BNP Paribus cash machine (free use for Bank of America debit cards), easy walk to grocery stores (Ed and Franprix), 1/2 block from laundrette, and a couple of blocks from the best croissants we tasted all week, at La Fournee d'Augustine (96 rue Raymond-Losserand); also try the chouquettes at nearby Moulin de la Vierge (105 rue Vercingetorix). The more fit can even walk to the Eiffel Tower (past UNESCO) or Luxembourg Gardens. Two main complaints: 1) there's a strict \"no food in the rooms\" policy, which made it difficult to eat quick/cheap breakfast or dinner in the room, something we hoped to do and something that was almost necessary with a small child. Paradoxically, there was a fridge in the room, so we kept milk and juice on hand to tide us over until we could get our croissants nearby. (Hotel breakfast buffet was 11 euros; we never even considered it.) 2) the walls are very thin between rooms! We could hear our neighbors talking, showering, gargling, throwing things away in the bathroom trash, being intimate, and lots of slamming doors and going up and down the elevator. Luckily, we only had neighbors for two nights and they kept reasonable hours. Also note that this neighborhood is a good way from central Paris, but that has the bonus of not feeling so touristy.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“overall good value for money”", "Author": "lemonlym", "ReviewID": "UR46133304", "Content": "When we arrived the exterior was under construction but the inside was very nice and the staff very helpful. Rooms are modern with en-suite, TV and fridge. The breakfast is nice and the staff are helpful. Overall good value for money", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Chic and beautiful, the perfect place to stay in Paris”", "Author": "YoungExplorer6", "ReviewID": "UR45559132", "Content": "My friend and I stayed at Hotel Apollon Montparnasse this september and were amazed at its chic interior. Our bedroom had been recently renovated and contained a flat screen tv, a large comfortable bed, a fridge, a desk and a telephone. The bathroom was beautiful- modern, clean and bright with an excellent shower. Each morning we had breakfast down in the cellar which was like an enchanted cave. We were presented with fresh coffee and croissants and a buffet of fruit salad, cold meats, yoghurts, bread, cereal as well as fruit juice. The location was also perfect as the restaurants surrounding us were used by the locals and we ate one fantastic meal at one nearby called 'Nexus.' It was an easy location to walk to the river from yet we also had the option of the metro which was literally just round the corner. I would thoroughly recommend this hotel.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Penzance, Cornwall", "Title": "“Need a good value hotel for a weekend in paris? Don't look any further.”", "Author": "PZtraveller", "ReviewID": "UR45332994", "Content": "just returned from a weekend away to celebtrate our 10th wedding aniversary, and Apollon Montparnasse was just what we wanted. Clean, close to the metro and incredibly good value. We had a superior double which was roomier than most in Paris. Service was excellent throughout and we were looked after from the moment we arrived to the moment we left. Would have no hesitation in going back. Check out AuMetro, opposite Pernety metro station for a good coffee, lunch or simply to sit and watch Paris go by.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Excellent”", "Author": "Rednaxela11", "ReviewID": "UR41345919", "Content": "After a long car journey we arrived at this hotel to find clean and comfortably furnished rooms and staff who went out of their way to ensure we had what we needed and were sufficiently organized to catch our plane the following morning. These guys were terrific, way better than what you might expect from a fairly modestly priced urban hotel. The location is a few blocks from the Montparnasse train station, making it a bit of a distance (probably twenty minutes by metro) from the main tourist sites but in my books that's a good thing because you don't have to deal with the crowds. I would stay here again no problem.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Super Friendly and Helpful, Very Clean, Good breakfast”", "Author": "NiagaraRiver", "ReviewID": "UR41065343", "Content": "My wife, our grandmother, and I traveled from America to Paris, and stayed here for three nights. Our rooms were small (like most rooms in Paris are), but they were modern and clean. It looked like the rooms had just been romodeled. Breakfast was free each morning. You go downstairs to a cute little breakfast room (we called it the \"breakfast cave\" because it had pretty stone block on the wall). A nice lady served us coffee and hot chocolate. There were plenty of criossants, baguettes, cereals, and juices to fill us up. I don't know if the breakfast is always free at this hotel, but when we reserved our room via the website, we were not charged. It was a wonderful bonus! Wireless internet worked fine on our laptop. And the best part - it was FREE. There was also a free, public access computer in the lobby. The hotel wasn't right in the middle of the tourist area, but the subway / metro was only a block away, so it was easy to get around. Around the block we fond and used a coin laundry shop, two grocery stores, and several little cafes. The neighborhood was very charming. Yohann, the desk manager, greeted us by name whenever we entered the building. He helped us set up our laptop for internet access, gave us directions to tourist attractions, and ordered a taxi for our last day. He is outgoing, funny, friendly, and he speaks English very well. THe hotel was a great value. In the future, when we return to Paris, we will stay here again.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "south coast", "Title": "“Excellent value for money”", "Author": "monicaSouthCoast", "ReviewID": "UR37948896", "Content": "Excellent location close to Metro and local cafes/bars. Wonderful shower and bed very comforatable. Johan on reception very friendly and helpful. Room clean and very good value for two star. Outside renovations did not affect my stay. would retun there again with my husband.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Issaquah, WA", "Title": "“Good location, helpful staff”", "Author": "JAAIssaquah", "ReviewID": "UR37489670", "Content": "After reading Trip Advisor reviews I picked the Apollon Montparnasse and we were pleased. The metro stop is a block away and there are Velib bikes to rent. The front desk staff speaks English and were always very nice and helpful. Emmanuel greeted us every morning by name with a big hello. They are doing some construction during the day but we were out all day so never heard it. We heard hardly any outside noise on the street but could hear a little from the adjoining room. The phone and WIFI worked. Room and bathroom are a typical small Paris size but we really only slept there and were gone till late at night. I would definitely stay here again.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Long Beach, California", "Title": "“Great Neighborhood, Great Price”", "Author": "hatedtownhouse", "ReviewID": "UR36358292", "Content": "I stayed at this Hotel a year ago, when I went to Paris for the first time alone. I speak relatively limited French, and I was happy to find that the front desk staff was helpful, knowledgeable and understanding. As an American woman in her mid-thirties alone in Paris, I felt safe in this hotel. The fact that there is free Wi-Fi also made it easy for me to keep in contact with my husband and children via my laptap in my room. The room was small, but that is to be expected in Europe. The hotel has been redone within the last few years, and they keep it clean and orderly. It is a small hotel, but I'm fond of this type of hotel. The maid service and food service was on the slow side and seemed a tad disgruntled, but friendly and professional for the most part. The neighborhood is one of the best features of this hotel for me. It's really on the edge of Montparnasse, so you don't get the super touristy ritzy aspects of the heart of Montparnasse. Also, it's a hop-skip-jump away from the metro and there's a great cafe right up the street. There are two groceries stores nearby, and just about any kind of other store you'd like, including a charming little toy store around the corner. The people in the neighborhood were, in my experience, friendly to Americans and affable. Ultimately, you get what you pay for...a charming little room, helpful front desk, a sweet neighborhood and a decent overall stay. If you are looking for luxury or American-style rooms and staff, you'll have to pay a much higher price in a far more touristy neighborhood.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Charming, great service, great local location\"”", "Author": "gigi385", "ReviewID": "UR36257318", "Content": "We loved this hotel. It wasn't large, but it had amazing service and lovely rooms. They weren't super fancy but the decor was fun and everything was very clean. The bathroom was recently remodeled and was beautiful! The bathroom actually was pretty fancy. We had a room with a view of the street and that was a great deal of fun. A little noisy at night with the window open, but we enjoyed the sounds of the streets. The location was perfect for us. It was more of a local, working part of the city. We had a ball meeting and talking with local Parisians in the stores (rather than other tourists).", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Ongoing Construction & A Basic Hotel”", "Author": "Yulin_jiang", "ReviewID": "UR36190352", "Content": "We stayed there for five nights in late June. Here are some of our feedback: 1. It is a very basic hotel and a 2-star hotel. So if you want to stay in a nice hotel, it is a wrong choice. The room is small but clean. 2. Location: close to a subway, but not close to the Elf Tower. Paris' Metro is convenient but dirty. 3. The renovation is still going on. The workers started to work early at 8:30am. I understand the hotel needs renovation, but I just do not like the noise and the mess. 4. Service people are friendly. A plus for the hotel. Before we visited Paris, we heard some rumors about French. It turns out French are friendly people. Love their lifestyle.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Huntsville, Alabama", "Title": "“Good value, great neighborhood”", "Author": "Europe2009_withkids", "ReviewID": "UR33306648", "Content": "If you're planning to use the subway / Metro to get around, this place is the best. Not a \"walk to the Eiffel Tower\" hotel but only 90 feet from the Pernety subway stop (you see the hotel sign as you exit) this quiet neighborhood has lots of decent restaurants (the Chineese Trattoria is a fast, cheap, good - they'll provide plates and forks if asked. The spicy shrimp and the \"sugar\" pork fed a family of 4 for 29 euros!) For a more parisian taste, the Cafe Metro was very good. Traveling with 4 it's impossible to find rooms in Paris in June, but they put us up in two adjoining rooms. Desk clerk was ALWAYS friendly, owner drew us a map to the bus stop to the airport (5 minute walk) saving us $100 on a taxi ride. Free Wi-Fi (pronounced wee-fee) in all rooms. The free breakfast is wonderful - baguette, croissant, cheese, ham, milk, juice, coffee, cereal, and lots of it. Save you probably 8 euros a day per person, compared to prices down the street. They ARE doing rennovations in the hallway - plaster dust and plastic on the floor - through August - but the rooms are immaculately clean, air conditioned, with private bathrooms. Small, but the norm for Paris. Elevator is 2-person sized. I'd stay again. The staff is so friendly you wonder who started those rumors that Parisians are anything but wonderful. Great place.", "Date": "June 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Denver, CO", "Title": "“Great Value”", "Author": "msts80231", "ReviewID": "UR33017085", "Content": "I needed a place for one night after an overnight flight from the US, leaving the next am early from Montparnasse station. As noted by another reviewer, it's really about a 10 minute walk to the train/Air France bus, but it was an easy walk even with (rolling) luggage and you didn't have to depend on getting a taxi. The Pernety metro station is really close and goes straight to the \"action\" i.e. Concorde. My room was ready when I arrived at 11 a.m. which was great, and the cost was $116 booked over the internet. The room was very small, a single room actually, and you could barely turn around in the shower but it was clean and more than fine for a tired traveler. There was a small refrigerator and T.V. with CNN, soundproof windows and comfortable bed. There was also a computer available for free, which I learned from the rest of my trip was a real luxury - especially since it takes a while to adapt to a French keyboard. I got Vietnamese take-out from a shop by the metro, and other options were available in the neighborhood.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kennett Square, PA", "Title": "“Excellent location, great Parisian neighborhood”", "Author": "JG-travelers", "ReviewID": "UR32690737", "Content": "We exited the Pernety metro stop, and the Apollon was 50m to our left. The staff was very friendly and helpful, esp. Yohann, the rooms recently refurbished, and rooms and bath were extremely clean. Typically small as Paris hotel rooms go, but plenty of room for my wife and me. The neighborhood along Rue Raymond Losserand is classic Parisian with all of the local shops and restaurants. Our next stop was St. Emilion in Bordeaux, and the Gare Montparnasse was a 10 min walk to the TGV.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "hossegor", "Title": "“Perfekte Lage”", "Author": "loataonata", "ReviewID": "UR31640597", "Content": "I spent 3 nights with my girlfriend in the hotel. We have chosen it for the price and situation close to train, metro and the city center. The quarter is a really nice one with a perfekt and trendy place to breakfast, brunch, eat and drink called \"au metro\". It`s directly in front of the metro station and a typical parisian cafÃ© with nice chairs to sit and watch the people passing by. A full and very good breakfast is 8 â‚¬ which seemed superfair to us - the perfekt start to make plans for the day. The quarter is really save, quiet but interesting. I really can recommend the hotel just for the perfekt typical parisian quarter and it`s super location. All sights are superclose by and quickly accessible by the very good metro system of even by walking - no problems at all. Also important the safety of the quarter - never had any problems also when walking home very late at night. The hotel itself is also great - the people very very friendly. Currently there are renovations going on which no one told us but it wasnÂ´t that tragic. The rooms are small but really sufficient - beds and bathroom all clean and pleasant. All in all for a young couple like us in charge of a romantic paris trip the perfect choice - the weekend was a full success also because the hotel was well chosen. Real luxury you will find somewhere else but for Paris I really think it`s a good price for value deal. Have fun and a pleasant stay !", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Devon", "Title": "“Pleasant Paris base”", "Author": "Mathematica", "ReviewID": "UR31325271", "Content": "Receptionist helpful when we arrived early. Bedroom small - not room for much more than the beds - no storage furniture at all. Did have effective double glazing and air conditioning. Bathroom reasonable, though shower cabinet small. Breakfast had decent buffet, though not as big a range as larger hotels. Claim that it is 3 minutes walk from Montparnasse station is dubious - certainly not with cases. It is very close to Pernety on line 13 - useful for going up to centre, less so for connecting to mainline stations. Range of cheap restaurants and creperies in nearby streets.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brussels", "Title": "“Friendly Desk Staff, Clean Rooms”", "Author": "strawberryfrog", "ReviewID": "UR30779903", "Content": "I stayed at this hotel in February and again in March. I mainly chose it for proximity to Le Cordon Bleu, where I was taking cooking classes (it's a quick bus ride, a 20 minute walk, or an 8 minute bike ride). It's far from most of the sites, but a great place if you want a real Parisian neighborhood slice of life. The rooms are newly redone and very clean, tiny (of course, it's Paris after all). Spotless bathroom. It's less noisy than some other Parisian hotels I've stayed in, but still some noise from other hotel guests (doors opening and shutting mainly). Last time I stayed, they emphasized the no-smoking policy, yet when I left my room in the morning, the hallway smelled like an ashtray. As a woman traveling alone, I felt completely safe in this hotel and in the neighborhood.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Strictly OK type!!!”", "Author": "vasco-da-gama7", "ReviewID": "UR30622846", "Content": "On our vacation to Paris we choose this Hotel,which was somewhat off the track and bit obscure only based on Trip advisor's reviews and previously we were always happy in choosing hotels as per the ratings of Trip advisor.----- but this can not be said true this time. My wife and myself were in this Hotel for 3 nights in the month of May, Booking was done directly with the Hotel and I must admit that despite being a typical Parisian Hotel the response was super fast!!! The front desk team especially Emmanual and Yohannan are excellent communicator and speak reasonably good English. They would even go an extra mile to help you out. We have had heard a lot about typical Parisian attitude, but mercifully this Hotel does not show them any. We got a special internate rate of 110 Euro per night with breakfast for a double,not bad at all looking at other Hotel's rate this was a steal!!! They send me a clear direction,how to reach to the Hotel beforehand and till that time I was overawed by their efficiency. The location is good,but it is subjective! If you are familiar with Paris Metro then Line 13 is not a problem at all. Though it was my first time in Paris but I did a fair amount of homework to familiarize myself with the complexity of Paris metro. Thank God!! It turned out to be gold! We could explore Paris to the tee in the shortest possible time due to Metro.We came back with a very high opinion about Paris Metro,and would strongly suggest people to use it to avoid the traffic and it is quite cheap too. A box of 10 tickets (Carnet) costs us 11.40 Euro,each ticket can be used as long as you are with in the Metro network,that means any number of changes can be covered by a single ticket only. But a word of caution! If you have some luggages with you then be prepared for a good weight lifting workout!!! Quite a few of the Metro stations do not have any escalators or elevators! so the good old stairs have to be negotiated.(Pernety is one of them!) The location of this Hotel is 50meters away from the Pernety station in Metro line 13,which is definitely a big advantage. The Hotel is at least not a pretender! It is a 2star and it declares that,I liked that. Check- in procedure was smooth and fast. The Elevator of the Hotel is an antique, probably from the time of French Revolution!!! If you get in to it with your luggage, then the other person has to wait!!! They definitely need to change the lift as soon as possible. The room was small to say the least!!!. There was hardly any space to move with out banging each other! The toilet was even smaller. if anybody is over 6ft and around 90+kg,then please avoid this Hotel as you will not be able to enter the shower cubicle!!! In the positive side there is an Aircon and it works! Good water pressure and hot water. A lot of reviewer had complained about the low energy lamps,but we did not find them as an irritation! Sound proofing is bad and you can listen to all the conversation of the adjacent rooms. The noise from the road was audiable till mid night!!! But I guess in Paris one need not complain about small room and bath!!! Had I been there for my work I would take it but probably not when you are on a vacation with your family. Breakfast was served in the cellar. It was just OK. Nothing great about it,but the coffee was plentiful and good so was the fresh croissant. There are a lots of good restaurants in the vicinity. Couple of Bristos near the Metro station,and one excellent Chinese small food joint nearby. On the other side of the Hotel there is a very good Lebanese Restaurant. Prices are very reasonable in all the places. We really do not know in Paris how small are the other Hotel rooms but if they are as small as this place then this Hotel would score over a lot of places because of their location and helpful attitude. Will we come back here again ? Ho... Hummm..... May be, may be not!!!", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Leeds", "Title": "“Good value Hotel, convenient for Metro and Restaurants”", "Author": "Andy_B_of_Rawdon", "ReviewID": "UR29697514", "Content": "A small comfortable hotel in a relatively quiet, 'normal' area of the capital. Away from the masses of tourists and attractions but only 100 metres away from the Metro (Pernety). We found plenty of restaurants within walking distance of the hotel - enjoyed Il Gallo Nero on rue Raymond Losserand and a North African restaurant called Hamdous Ali on rue Moulin Vert (huge amount of meat with the Couscous). Staff were friendly and when asked to recommend a restaurant checked to see if it was open as it was a Sunday night. The room was very clean and it had a bath - great for soaking in after tramping around the streets for hours. Plenty of hot water instantly available. Some noise from a party in the adjoining apartment block on the first night was the only negative issue. Like another reviewer we found the room a bit dim until the economy light bulbs had warmed up. One good feature was that there was no mini bar but an empty fridge for keeping our bottled water in. Didn't try the breakfast as it seemed expensive at 11 euros (and we over slept one morning) but there are a couple of good cafes near the Metro for breakfast (and a late night tipple). Would use this hotel again on a visit to Paris.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“A very pleasant hotel, spoilt only by an expensive breakfast.”", "Author": "x7Stuart", "ReviewID": "UR28871985", "Content": "Everything that other reviewers have said in favour of this hotel is true. It's a charming place in a delightful area. The only shame was that the breakfast had gone up from â‚¬6.50 in the guidebook to â‚¬11 which meant we, too, left and went to the cafÃ© along the street.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“A good value, convenient location, friendly staff and clean rooms”", "Author": "FrankoPhile10", "ReviewID": "UR28231115", "Content": "The front desk staff were friendly and helpful. It was less than a block to the Metro, some decent eateries and bakeries. The surrounding area was safe and active, even at night. Walk less than two blocks straight out the front door for a nice view of the Eiffel Tower. The rooms were small but always neat, clean and well-maintained.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kent, UK", "Title": "“Cracking little find”", "Author": "Loudon111", "ReviewID": "UR25362395", "Content": "A small friendly hotel just outside City Centre but with a Metro station within a minutes walk its all very accessible. The rooms are on the small side but spotlesley cleaned every day but with so much to do in Paris they were literally somewhere to lay ones head. The staff were very knowledgable and helpful at all times. Would use again on our next Parisian adventure.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hungerford", "Title": "“Clean, comfortable, convenient”", "Author": "MB58", "ReviewID": "UR24324141", "Content": "I chose this hotel for a business meeting in nearby Malakoff. Location is ideal, a minute from Pernity metro and less than 10 minutes walk from Gare Montparnasse and the Air France airport bus terminus. Pernity has cafes or there is a bigger selection around Montparnasse, so lack of a restaurant is no problem. And there is a specialist beer shop over the road so leave room in your suitcase! Room was fairly small but nicely decorated with air conditioning, a small fridge and a comfortable bed - the bathroom was excellent with a good shower. Only criticism was the room lighting was a bit dim, especially until the low-energy bulbs have warmed up. Breakfast in the cellar is simple but at least you get your own roll and croissant, so no fighting over the buffet. Not a huge spread but everything you need. In summary - a good, reasonably priced hotel in a pleasant area with good transport links.", "Date": "February 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Africa", "Title": "“Friendly and helpful”", "Author": "SAtraveller4", "ReviewID": "UR23779004", "Content": "The hotel is close to the Metro. The hotel room was small but had everything we needed. The best feature is the helpfulness of the guy at the front desk who really went out of his way to giuve advice and make our stay pleasant. This is reason enough to stay there. Otherwise the hotel was reasonably priced for Paris and the breakfast room is quaint and breakast is the only bargain you will get in Paris! Well worth it.", "Date": "January 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Livingston, United Kingdom", "Title": "“Nice small hotel”", "Author": "Neubauten", "ReviewID": "UR23438257", "Content": "I recently stayed in a single room over New Year. Room was small but adequate and very clean, though the walls seem a bit thin, so if you have a noisy neighbour you can hear their conversation! Breakfast is EUR9, not too bad considering the price of things in Paris. The hotel Manager was very helpful, as were all the staff we came in contact with. The lift only takes 2 people at a time, but the stairs were good exercise. There area around the hotel is quiet and there is a supermarket about 5 minutes from the hotel & the metro is a block down, very convenient. I enjoyed my stay and would not hesitate to go back.", "Date": "January 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Great Hotel, Friendly Staff, and VERY VERY Clean Rooms”", "Author": "flightkid", "ReviewID": "UR23100915", "Content": "We stayed in the hotel for 3 nights and the experience was fantastic. The people at the receptionist desk were outstanding. They greeted us by our names and took great care of us. The rooms were ultra clean, great amenities, and quiet area! The hotel is located only a block from the metro making it so easy to get to the heart of Paris in less than 15 min. We had a great experience with this hotel and will for sure stay again here at this hotel! Happy Holidays everyone!", "Date": "December 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Great Hotel and Helpful Staff”", "Author": "TomfromDallas", "ReviewID": "UR21852619", "Content": "I can safely say this hotel is an excellent bargain. The rooms were clean and the service was excellent. All of the front desk personnel remembered our names and greeted us every time we walked in. Everyone spoke very good English. The hotel is well located, 50 yards from a metro station and only a couple of blocks form the main Montparnasse station. While not the largest hotel room in the world, certainly acceptable from a European standpoint and extremely clean and updated. I would defintitely stay at this hotel again and would be comfortable recommending to friends and family!", "Date": "November 14, 2008"}], "HotelInfo": {"Name": "Hotel Apollon Montparnasse", "HotelURL": "/ShowUserReviews-g187147-d265343-Reviews-Hotel_Apollon_Montparnasse-Paris_Ile_de_France.html", "Price": "$93 - $113*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">91 Rue de l'Ouest</span> | <span class=\"extended-address\">14 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75014</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "265343", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b8/b9/91/hotel-apollon-montparnasse.jpg"}}