{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glenside, Pa", "Title": "“beautiful, old world, but rooms and bathrooms are tiny”", "Author": "Sue12959", "ReviewID": "UR128258453", "Content": "beautiful hotel, wonderful staff, old world charm, excellent location right next to the Pantheon and beautiful church, and close to many other attractions and shopping galore! Room service is very expensive, room and bathroom were so tiny I was a little claustrophobic, so luckily we only stayed two nights and spent our days touring or shopping..bed was quite firm so I didn't sleep well. The biggest disappointment was the room size but it was a short stay so nothing we couldn't handle. Staff were excellent, helpful and friendly. Linens were very nice and hotel was clean and full of old world charm. Terrace restaurant and bar were an added plus! Location was fantastic!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canterbury", "Title": "“Midweek break April 2012”", "Author": "AROMANLOZ", "ReviewID": "UR127883502", "Content": "Amazingly central location, Pantheon just a two minute walk, Trevi fountain,Spanish steps, Colloseum and the Vatican all within an easy twenty minute walk.The hotel itself is very classy with a beautifull Art Deco atrium roof in the lobby.On the actual hotel roof is a terrace restaurant and bar with the most spectacular views over Rome. The staff that we encountered were at all times very helpfull and available,Having read other reviews we asked for and got a high floor room overlooking the front, we were not dissapointed, Our room was on the small side, very clean and well presented, beautifull linen. The bathroom area was tightish but very well equipped and everything worked as it should. No tea/coffee making facilities in the room - dissapointed, TV seemed to be mostly pay-for , very few English speaking channels (4 to be precise, all news).Some of the woodwork around the windows could do with some small repair work, but nothing to write home about.Did not need the A/C but it worked fine. When windows closed at night no city sounds to be heard- good nights sleep. Breakfast was served in very nice surroundings,all you could want for, but I have to say, having stayed at a lot of 4/5 star hotels it was on the expensive side. Have read reviews that people found the lfts not to be good, they were slightly on the small side but clean and worked very well. The overall impression that the hotel gives is very good and well worth its starring. Travel time from airport Leo Da Vinci to hotel was about 35-40 mins, Rome has good private taxi service, expect to pay about 80 euro for the round trip (Merc E class). If returning to central Rome I would certainly use this hotel again.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“The best location in Rome”", "Author": "Sergiotrip75", "ReviewID": "UR127288521", "Content": "A few steps from the Pantheon this hotel is within 500 metres from most places worth sightseeing... We had a room (though ours was the cheapest available in the hotel) with a splendid view on the roofs of the city, the sun poured into the room in the morning. The bathroom was tiny, one people at a time. Breakfast was charged 35 euros (!), but there are many places around where you can have one for a few euros. On the whole really good if you don't use the minibar or the restaurant.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Terrible”", "Author": "Preved_Medved", "ReviewID": "UR127082646", "Content": "The worst 5-star experience in Europe. The worst caprese from room service in my life (btw costs Euro 30). No charm, just old, tired and dirty.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“Great weekend accommodation”", "Author": "Claire11111", "ReviewID": "UR126510555", "Content": "I stayed here with a large group of friends for a girls weekend in Rome. A central hotel, situated right by the Pantheon (which was a stunning building to visit). This hotel is not cheap but offers great quality if you are looking for some luxury. We had a couple of minor glitches with items in our room but these were sorted immediately. I shared a three-bed room. The third bed was a sturdy, glorified camp-bed but was apparently comfortable according to my friend. The double bed was roomy and very comfortable. We chose to eat out at many local restaurants and so only ate breakfast in the hotel. Breakfast was good quality with lots of choice. All the staff were friendly and helpful throughout our stay. The barman, Fabio, was lovely and served our group really well when we returned from our meals out. The early evening cocktails we had on the roof terrace were lovely but watch out as all the drinks in this hotel are very expensive. €12 for a limoncello!! All in all a great find and suited our needs well.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Luxury in the heart of Rome”", "Author": "Bonissim", "ReviewID": "UR126412847", "Content": "The hotel is in the perfect location for walking to all the wonderful sites of Rome. The cobbled streets fit in well with the general ambience but do make walking a little more difficult and tiring. It is therefore important that you rest well, and you can at the Minerve. The beds are so comfortable with good quality linen. We had a deluxe room, booked at the advance purchase rate, together with a promotion of 15% discount on best available daily rate, so felt as if we had a good deal. Our room was well designed, plenty of wardrobe space, bathroom was adequate but perhaps a little cold. There was a large radiator in the bathroom but it was not working. Two bottles of mineral water were supplied every day. There was some renovation taking place in the hotel but it was not a problem. Being March, we chose not to eat at the Roof Garden Restaurant, preferring to wait until the barmy evenings of summer when it is at its best. In the bar a pianist was playing sometimes and you always receive some nibbles to enjoy with your drink. The staff are very polite and helpful and I will always choose to stay at La Minerve.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“\" A Good Location\"”", "Author": "Mary L", "ReviewID": "UR125617390", "Content": "Although I have been to Italy before I have never been to Rome so I was at a loss of where to book. I went to a web site I have used in the past called luxurygroup.com. The hotel was listed on their site so I booked it. The hotel is in the heart of Rome, the hotel is sophisticated, luxurious and cozy. Although my stay was only a few days I had a delightful time.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“More good than not so good”", "Author": "Lavinia02", "ReviewID": "UR125310481", "Content": "We stayed for just 1 night here, at the recommendation of friends who have stayed many times before - and would have graded it 3.5 (good) rather than average had there been an option to do so Best features are the location (although the taxi driver had diffculty finding it - so better to have precise directions) and the roof top restaurant Check in was smooth and efficient The lifts were tiny (holding 4 max) - and not recommended for anyone who is claustophobic! We were underwhelmed (indeed somewhat disappointed) upon seeing our room. It was clean, modern and high ceiled but certainly \"compact\" and looked out over an interior well facing into other rooms opposite. Wooden floors which are no doubt cool in summer but seemed rather hard underfoot in the middle of winter! The bathroom was very compact - just about large enough to fit everything in - with hardly any room to emerge from the shower (over the bath) between the edge of the shower door and the edge of the basin! Hand held shower (which I prefer) Towels were good quality and fluffy with robes provided - and there were a few bathroom goodies as well Nice quality linen on the bed - and a pillow menu Room had kettle (but only 1 mug - 2 Tea bags, 2 coffees and no biscuits) - iron and ironing boad and trouser press. Mini bar rather uninteresting - and no water supplied. TV had English sports channels - but we were unable to find an English news channel (although our friends seemed to have one) Bedroom lighting not as bright as we would have liked Room was very stuffy overnight so we turned on the a/c which was rather noisy - and ineffective (despite it being February!) All the staff we encountered were delightful - although we were rather surprised to find there were several staff in the roof top restaurant who spoke very little English and we had considerable difficulty in ordering our drinks! The gin and tonics arrived with \"full strength\" rather than slimline tonic - and when the rest of our group arrived, it proved impossible to order a Southern comfort (we gave up on this one!) and the (2 rather than 3) Ameretto and cokes arrived with \"full strength\" as opposed to diet coke. We didn't complain as we were amused rather than anything else - but the English lady sitting on the adjacent table was clearly extremely angry at having to wait so long for her order of a glass of wine and she took herself downstairs to the bar, carrying it upstairs herself! The restaurant itself is super - no doubt great ambience and views in the summer (although inevitably not quite so great in February with the roof on and sides down) and I'm sure we'll be back. Service was quite slow - although once again we didn't mind as we weren't in a rush - and plenty of bread was served. And the food was worth waiting for. The bar downstairs was pleasant and drinks/coffees were efficiently served with generous dishes of complimentary chocs and biscuits which were most welcome! A little background music might have soothed the atmosphere somewhat So not perfect but not at all bad - and we expect to return - but hope next time we might be rewarded with a better room!", "Date": "February 27, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Canton, Ohio", "Title": "“Excellent Rooftop Bar”", "Author": "Todstours", "ReviewID": "UR124838067", "Content": "My wife and I have never stayed at the Grande Hotel de la Minerve. Too expensive for our travel budget, though our friends have stayed there and they recommend it highly. We have, however, enjoyed the rooftop bar when we are in Rome. In my opinion, this is one of the best rooftop bars in Europe. Catch the sunset over Rome while looking over the Pantheon, drinking martinis and listening to live music....well, it's a pretty cool scene. The staff is friendly and attentive. The drinks are a bit pricey, but you just can't beat the atmosphere.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Juan", "Title": "“Good but expensive”", "Author": "PabloSanJuan", "ReviewID": "UR122765723", "Content": "I stayed at the hotel from 12/28/2011 to 1/07/2012 it is a very nice hotel but expensive, the best part is the location very close to the Pantheon, but our rooms were 340.00 euros/night and they were small rooms. Any drink or food at the hotel was too expensive so we did not try any. Service was excellent and friendly.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A grande hotel”", "Author": "s p", "ReviewID": "UR122360933", "Content": "This is a wonderful hotel in a great hotel that overlooked the piazza. We had the junior suite which is well appointed as expected for the price and service. Highly recommended!", "Date": "January 1, 2012"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Visit to Hotel Minerva - Rome in Sept 2011”", "Author": "Alanah988", "ReviewID": "UR122300034", "Content": "My friend and I visited the roof terrace in this hotel after a long day doing the sights. To our utter dispair we were treated so badly I am now prompted to write a review so that I can save other visitors from the dispectable and shameful behaviour of the staff on the roof terrace. My friend ordered a Singapore Gin Sling and I ordered a Bloody Mary. My friends drink was utterly revolting. God only knows what it was made from! We doubted if there was alcohol in it. My drink was served up with so much chilli it practically burned my mouth. I returned the drink but the new drink served to me had no alcohol - either Gin or Vodka in it at all. The staff here are arrogant and do not deserve to have a job. They also charged us over £100 to add insult to injury. If this hotel was the last one in Rome we would not use it again.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Brunswick, NJ", "Title": "“Even better...”", "Author": "Marchetta01", "ReviewID": "UR121965411", "Content": "I have been coming to the Hotel Minerva for 14 years. My last visit in November, 2011 was excellent. This hotel is not resting on past glory, it is making itself better. The staff was excellent, the room updated, and the breakfast buffet completely revamped and wonderful. I will return again soon.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Highly recommend”", "Author": "A_Light_Sleeper", "ReviewID": "UR121046895", "Content": "Imagine walking out of the front door of your hotel and seeing that you are a block from the Pantheon. Probably just another day to a local, but incredible for a tourist. In addition to the location, the staff are friendly, speak English, and are attentive. There is a rooftop bar to go to to see the sunset over the rooftops of all that is Rome. The rooms are spacious and appealing to weary tourists, and the restaurant is very good. Be sure to admire all of the Murano Glass works that surround you in the lobby.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“The hotel experience was not better than a 3 star”", "Author": "liapa", "ReviewID": "UR120601475", "Content": "Other than location we didnt enjoy the experience at the hotel. Especially for the price or the hightened expectation of a 5-star hotel. We wanted to warn other travellers, as it was a very unusual 5 start hotel, nothing was really living up to that quality. There was not much of client service orientation, just rather indifferent attitude, which you may find in a 3 star hotel (in fact a bit worse than our stay few years ago in a 3-star hotel). We were surprised that common areas were not maintained that well either. Rooms were small and just ok. Location is excellent as it is next to Pantheon, but I am still surprised that a hotel can get such rating for location only. I would not have stayed and would not stay in this hotel.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Only stay here because of its location”", "Author": "tunkeyandthemonkey", "ReviewID": "UR120573812", "Content": "We have stayed in the hotel multiple times, typically annually, so this being our 5th trip, we knew what to expect. This is the first time I have read the trip advisor comments and unfortunately many of them resonate. We visit Rome to walk, not spend time in the hotel. Because of the location this makes each short trip a joy. The comments on the rooms and food are all spot on. We have stayed in a great room with a balcony overlooking the square/elephant. In contrast the classic room we stayed in was pretty awful. We returned yesterday and I fear that will be our last trip to GHdlM. To be great they need to invest in the hotel and the facilities. The gym for example is dark and small. The breakfast is not \"four seasons\" standards though the price is. Final note, whilst in the reply the food bad beverage manager commented that the roof top bar only closes 3 times a year, imagine my diassapointment that it was closed for a christining on Saturday night. Clearly it's not all bad, but it is important to understand that the big draw is location. Trip advisor comments give a good reflection of what I have seen for a number of years. I will stop recommending hotel to friends.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Not so special”", "Author": "Sjtsal", "ReviewID": "UR120153035", "Content": "We just stayed two nights at this hotel. It was not very charming and we looked out at a dirty alley and an dirty rear doors of another building The bathroom was quite small The front desk people were great and the breakfast was delicious Make sure you ask for a room in the front and on a high floor", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Posh Hotel Very Good Location ...”", "Author": "plane_cowboy", "ReviewID": "UR119979347", "Content": "I have stayed in this Hotel on numerous occasions and have never been disappointed. The front desk staff is friendly, the rooms are clean, the bed linen smells fresh, toilet is well stocked, the towels are white and fluffy and the location of the Hotel is second to none, just around the corner from the Pantheon with easy reach to restaurants, Spanish steps and the lovely Trevi Fountain. The lifts are a wee bit small but still all right. A traditional legend holds that if visitors throw a coin into the fountain you will return to Rome one day it is supposed to be for \"good luck\", Despite being the heart of Rome you will find a very good selection of Pizza and Pasta places and most important ... not too expensive ( Pizza already for EUR9.00)", "Date": "October 31, 2011"}, {"Ratings": {"Overall": "4.0", "Value": "3", "Service": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Roof terrace”", "Author": "gsp100677", "ReviewID": "UR119859926", "Content": "Didn't stay at this hotel, but came to the roof terrace bar for a drink. Excellent, friendly service. Well mixed cocktails, and good selection of wines & fizz. A little on the pricey side, but not unexpected for this type of hotel and quality. Fantastic views in all directions. Well worth a visit for an after dinner drink, but was starting to get too cold for it without a jumper/jacket when we visited in mid-October.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Well worth the money!”", "Author": "giorgiadettoni", "ReviewID": "UR119438292", "Content": "This Hotel is expensive \"YES\"..but worth every cent, if you are making your stay a special occasion in Rome, please consider the Minerva, it is an outstanding property, fantastic location, just around the corner from the Pantheon(we could see it clearly from our window). The rooms are generous by European standard, all mod cons, great service, really lovely. We had an error occur while checking in..and the manager could not be helpful enough..we received an upgrade for the trouble. Please consider this hotel, you wont be sorry.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“very good location - worth the price”", "Author": "Sim0ne1971", "ReviewID": "UR119308627", "Content": "I`ve been to Gran Hotel de la Minerva last july with my husband and 2 children aged 9 and 11. The location is really great - a few steps away from the Pantheon, and a walking distance from a handful of Rome touristic sites. We stayed in 2 connecting rooms, fully refurbished, big bathrooms, good showers, scenic views from our windows over Piazza de la Minerva and Le elefantino. Continental breakfast is pricey, but there are many options right outside the hotel. The staff was helpfull when I needed, (but I speak italian), A good experience, overall.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Concord NH", "Title": "“Location, location, location”", "Author": "SophieConcord", "ReviewID": "UR119307608", "Content": "We have stayed at the Minerve hotel several times now, primarily due to its amazing location and its fun rooftop bar. This stay we were given a really nice room with interior ,quiet , balcony (#449) , king bed, good size room and nice marble bath. Beautiful bedding and nice bathroom supplies. Sadly, the rooftop bar we anticipated was closed for a party so we chose to eat at their dining tables. Pricey meal, not as good a value as the bar, nor was food noticeably sophisticated compared to all the good local restaurants. Skip the meal and wait for the sunset rooftop bar experience. Staff was pleasant, rooms clean, hallway rugs need updating, but overall, the ability to walk to the Pantheon with cappucinos on the square, and on to Piazza Navona, Campo dei Fiori, and all the alleyways to Forum or Piazza di Spagna make it a treat.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“WOW”", "Author": "Paul W", "ReviewID": "UR119281404", "Content": "This would have to be the best hotel we have stayed in while travelling anywhere in Europe. Not only is it central (backs onto the Pantheon) but the interior decore and charm of this beautiful hotel are just outstanding. The room we had was magic. The desk staff, hotel staff and hosuekeeping staff were all polite and any problems we had (albeit not worth writing about) were resolved immediately. Our biggest disappointment was probably our last night there when we booked for dinner at their rooftop bar and restaurant. The food and drinks were great but the ambience was a bit hit and miss. The piano player was intermittent with the music but not an issue. Our main disappointment was with one of the waitresses. She was just rude. ignorant and had attitude like she did not want to be there. But that is a minor issue to whole experienc of staying in this grand hotel. If we are back in Rome this is the place we will be staying at again.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "washington, dc", "Title": "“great location, staff and room”", "Author": "jba400", "ReviewID": "UR119250284", "Content": "This hotel was not cheap, but it was well worth the approx $250+ we paid for each night. The location is perfect -- walkable to the coliseum, trevi fountain, spanish steps and piazza navona. If it wasn't so hot, we could have also walked to the Vatican. Our room was very large and comfortable -- our friends staying at different hotels couldnt' get over the size. The staff was very accommodating -- offering suggestions for meals and helping us book restaurant and train reservations. Would definitely stay here again. Be sure to go up to the roof one night for drinks -- we enjoyed a great sunset, amazing view and live music", "Date": "October 13, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Disappointed”", "Author": "BridgetMaryG", "ReviewID": "UR118325080", "Content": "Myself & my daughter stayed in the hotel for 3 nights we had requested a deluxe twin bedded room,on arrival the room was set up with a double bed and not twin beds as requested. This in itself was a small issue, but the lack of printed information material in the room was really disappointing and when we requested same we had to go to the concierge to collect tour information that he had underneath his desk - in a 5 star hotel this information should be located in each room or at least on show in the lobby area surely - we also asked him to recommend some good restraurants in the area which he declined to do. First impressions are so important but for the above reasons this hotel failed to impress -", "Date": "September 19, 2011"}, {"Ratings": {"Location": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "milano", "Title": "“Check in&Check out”", "Author": "bestmilano", "ReviewID": "UR118310261", "Content": "STRUCTURE: in the city center with no landscape, indifferent to the palace without any particular value LOBBYING: dark, foul smell at the entrance, no help with your luggage, annoying staff at the reception, a lift for up to two people without luggage, hospital-style corridors sad, entrance doors to rooms-style cruise ship, abandoned trolleys in corridors. ROOMS: cigarette smell in the room, on the couch and bed sheets, dust on the bedside tables, three star hotel furniture, bathroom not working RESTAURANT: not tried PERSONAL: annoying, not to meet any customer demand, sometimes rude and definitely not professional What I disliked: atmosphere, decor, staff OVERALL: I left the hotel after an hour as unhappy paying the entire night.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“Excellent choice”", "Author": "cherole", "ReviewID": "UR118247159", "Content": "Stayed at this hotel 1 night post-cruise. It was a fantastic location and a beatiful hotel. Great location near Pantheon with walking distance to sites, restaurants, etc. Excellent staff. The room was lovely and spacious. The bathroom was a little odd in terms of shape & space and could use some updates, but excellent shower, etc. Bed was comfy with nice bedding & pillows. Do not miss the rooftop bar. Nice views, accomodating bartender. Was no problem to grab a cab in the a.m. to get to the airport without pre-planning.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Limassol District, Cyprus", "Title": "“Outstanding Hotel”", "Author": "CraigVan", "ReviewID": "UR118141128", "Content": "Recently stay at the hotel just for a long weekend getaway. You can not beat the location as far as I am concerned. Walking distance to everything we wanted to see in a very condensed site seeing tour. We were able to walk about 20 minutes to the Vatican and then turn around the next day and about 15 minutes to the Coliseum, Spanish Steps, Trevi fountain and the Piazza Navona all within minutes. The hotel staff is great they are very helpful with anything you may need. Didn't eat at any of the restaurants because we were always out walking. The rooftop bar is nice to just sit and relax after walking all day and look out over the city night sky.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Great Location”", "Author": "EricaNYC22", "ReviewID": "UR116803709", "Content": "We stayed at this hotel in January. The rooms were clean, hotel is pretty & it is in a great location - right next to Pantheon. Some of the staff is more friendly than others. **Tip - ask to see your rooms before you check in. We had 2 rooms side by side & there was a considerable size difference.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great location and great rooftop area”", "Author": "2VAGuys", "ReviewID": "UR116676841", "Content": "We love the location of this hotel within the heart of historic Roma. Three minute walk from the Pantheon, five minutes from Piazza Navona and probably no more than ten minutes from the Spanish Steps area. The one downside was that our room was incredibly small but it was serviceable. The rooftop bar is wonderful. The views are outstanding - though the drinks are very expensive. The view down upon the roof of the Pantheon made it seem worth the price of the drinks. Breakfast was good but incredibly expensive.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "MI", "Title": "“Beautiful Hotel in Prime Location”", "Author": "KBudz", "ReviewID": "UR115476525", "Content": "The hotel is amazing. It is beautiful and the rooms are spacious. The breakfast is great. The service is friendly, helpful and personal. The staff was very helpful in arranging my tour pickup coordination. It is right across from the Pantheon, and a few minute walk from Navona Piazza. Trevi Fountain is nearby. Since it is right by the Pantheon, you can always find it on a map! Five star accommodations and service.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hertford, United Kingdom", "Title": "“I love this hotel!”", "Author": "SueWithaView", "ReviewID": "UR115022962", "Content": "I have stayed here many times for work purposes. This hotel is in an amazing location; right beside the Pantheon and therefore the Piazza della Rotunda. This is a buzzing square with bars and restaurants where you can sit and look at the Pantheon; 2,000 years of history staring at you in the face. The little streets winding away from here offer cheaper options for food and drink with many churches on your way. The hotel has a wonderful doorman called Paul who seems to have been there forever. He always greets with the same friendly face. The reception hall and lounge has a beautiful glass ceiling, so peaceful and cool to sit underneath. The rooms are a little old, but very clean with a true Italian feel. The roof bar and restaurant offers a peaceful and select place to dine but is obviously rather expensive. The concierge is full of good recommendations with ready maps, as always, to help. I could never tire of staying here as I said previously, such a great location; you can walk to any of the great Roman 'must-do's' from here.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great staff but hotel rooms look tired”", "Author": "Ritalondra", "ReviewID": "UR114933809", "Content": "Rooms are not what you would expect from a Five star hotel. They are quite tired looking and are in need of refurbishment. We stayed here four years ago and the rooms were impeccable. Now there are stains on the walls, carpet and plenty of scratches on the furniture. Also the grout in the bathroom needs changing. Staff is amazing though, very helpful and friendly. The concierge really knows his stuff. Five star staff.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Charleston, Illinois", "Title": "“We loved it and would highly recommend it!\"”", "Author": "Debbydoo3115", "ReviewID": "UR114731749", "Content": "This hotel was not only beautiful with a wonderful, attentive and friendly staff, but it was in a great location. When we were tired from sightseeing, we had only a short walk to the Pantheon and Piazza Navona for food and shopping. Although the hotel was full, we hardly ever heard another person at night.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Rafael, California", "Title": "“Location could not be beat. It felt like I was dreaming!”", "Author": "MelissaBradley", "ReviewID": "UR114656991", "Content": "Love this hotel! The location can not be beat. We were smack dab in the middle of Rome and we walked everywhere, except to the Colosseum. The Pantheon is right in front of this hotel and tons of restaurants are right there in the square with lots of live entertainment; loads of good Italian food and of course Gelato ice cream! We stayed in 2 luxurious rooms. One extremely large and the other was very spacious. I am not sure of the exact dimentions. When I saw some of the negative reviews on TripAdvisor I am guessing those people stayed in small rooms. I did take a look at some smaller rooms while we were there. One of our rooms had a sofa bed so our kids all slept in \"our\" room and the extra room down the hall pretty much went to waste. So about the hotel.... sometimes I like to break it down to the good; the bad and the ugly. Away we go! The good This is hands down the best location, and I am pretty sure the best hotel in this location. The rooms are nicely decorated The bedrooms are spacious We had music below our window everynight from the locals. Everything from beautiful singing, accordion playing, guitar playing and more. If we closed our windows it was pretty quiet, but we loved keeping them open. The room had nice furniture and great amenities. Of course we had robes, slippers, and nice European toiletries and soaps. The baths were very spacious and the towels were bath sheets. The bedroom that didn't occupy our family I preferred to shower in as there was a large window that opened up and you could hear the locals below. It was kinda dreamy. Many times on our visit we felt that it was dream like. So wonderful! Overall the staff was polite and helpful with a few exceptions. The hotel welcomed us with treats for all of us. The bad The Internet connection was by wire not wireless and it was down while we stayed there. We had hoped for connecting rooms but unfortunately the only connecting rooms were small. However the rooms they put us in were very large! A big thank you for that. The pillows and bed could have been more comfy. The bed was large and the linens soft but the matress itself wasn't that comfortable and the pillows were not soft enough for me. The Ugly When we were checking out, we were paying our final bill. The rooms were prepaid so only an airport transfer was left to pay; however the desk person insisted we owed additional taxes on our stay. We had paid over $400 in taxes for 4 nights on-line in advance and our receipt showed we had paid in full so I argued they must be confused and why was this so called tax never mentioned to me at check in when I confirmed all was prepaid and my credit card was put down only for incidentals such as mini bar or room service etc. Anyway after threatening to fish my receipt out of my packed luggage in the car waiting to take my family to the airport the receptionist \"waived\" the fee or as he called it \"the tax\". If there truly was an additional tax why wouldn't they include it in the original price of taxes and fees or at least tell you in someway upfront that you have additional money to pay but at the last second as you are rushing out the door? That is just wrong and tacky. All in all this hotel is great. It is closer to 5 stars then 4 but because of the ugliness at the end; I am giving it a 4. Five star hotels don't do that stuff. I would definitely stay at this hotel again though. I loved it. Please let me know if this review was helpful by checking that little box. It makes me feel good that I am not wasting my time doing all this typing. Also, sorry for any typos. I've got a toddler on the right of me as I type.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Perfect location !”", "Author": "Rejse1234", "ReviewID": "UR114477932", "Content": "Absolutely perfect location. Almost everything is in walking distance from this hotel. Our room was facing Piazza Minerve and Pantheon, and it was so beautiful. Do not go to the Roof-garden to eat. It was overpriced and not good. But the view from the roof-garden is out of this world.. Go to the roof-garden for an ice-coffe or softdrinks in the afternoon instead. You have it almost to our self, and the view is the same!!", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bristow, VA", "Title": "“Beautiful hotel in ideal location!”", "Author": "JNMarr", "ReviewID": "UR113300425", "Content": "My husband and I stayed for three nights as part of a small group tour at the end of May. We had a large, beautiful room with two double beds. There was also a sofa and chair and a flat screen TV. The bathroom was also beautiful. The key card could be a bit of challenge to use until we got the knack! The doormen were so friendly and helpful and gave us great advice and directions. Breakfast was included in our package and it was a delicious buffet - the walnut bread was a special treat. Cappuccino was delicious and they were happy to bring two or three if we asked! The chandelier and sconces in the restaurant were spectacular floral Venetian glass - just stunning. The hostess and the servers were very pleasant. My only unfulfilled wish is free internet in the room. However, there is free wireless in the lobby and in the salons off the lobby, so I set myself up at a comfortable desk and used my netbook. There is also a computer for guest use off the lobby and it is very fast. The location is fantastic and the Pantheon is right outside the front doors. You can walk to so many interesting sights. In fact, it's much easier and quicker to walk instead of taking a cab! I would return to the hotel in a minute - we loved our stay. The rooftrop bar is delightful and there are great views. However, the drinks are VERY expensive - I did not order any myself, but one of my travel mates told me that two martinis cost her 38 euros.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "italy/belgium", "Title": "“great location, very good service, some refreshing useful”", "Author": "claudiac67", "ReviewID": "UR112139203", "Content": "I stayed at the Grand Hotel de la Minerve with my mother for four nights in early June 2011. The hotel is in a fantastic location, within walking distance from many attractions and beautiful spots. Reception staff is extremely helpful and kind. Beds are very confortable and the bathroom of our room, even if small, had all that was needed, including luxury toiletries. The corridors at the floors of the rooms have however a carpet that would need a very strong cleaning or replacing as there is a stuffy smell. The walls of the first room we were given would not mind a brush of paint. Overall, however, a very good experience.", "Date": "June 8, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bilbao", "Title": "“Overpriced”", "Author": "TxakurGomez", "ReviewID": "UR110948389", "Content": "This hotel is totally overpriced. It is very well situated in the heart of the old rome, and the bar at the terrace is great; but thst´s it! The rooms are quite small for a 5* and very dark. It is outrageous how much they charge for a night! I do not recommend it. BTW, horrible breakfast.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Wonderful location but not 5 stars”", "Author": "euronautix", "ReviewID": "UR110055760", "Content": "The location behind the Pantheon is unbelievable. Wonderful. But the Hotel is not a 5 Star Hotel. The rooms are prepared without any care. A little bit of Touristic touch..... but the location outshine this details ... Roof Garden Bar is adorable", "Date": "May 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Vienna, VA USA", "Title": "“Got the old Tourist Song and Dance - Never again”", "Author": "Santino49", "ReviewID": "UR109389671", "Content": "Arrived at this \"5 Star\" \"Business Hotel\" with a confirmed, prepaid, nonrefundable confirmation for a non-smoking room. They first stuck us in a \"Suite\" that stank of old Marlboros and had a set of matches and ashtray on every table. The clerk explained that it was a nonsmoking room, but someone must have asked for ashtrays and the hotel really has no control over this, yada yada yada. They apologized and stuck us in a sprayed down smoking room, once again explaining that it was no different than the rooms that actually had a \"NON SMOKING ROOM\" sign posted at the door. FINALLY, after three iterations, we got the room we had PAID FOR IN ADVANCE. Clearly, they were trying to foist off their stinky rooms on the unsuspecting naive Americans. Later we became familiar with the cozy relationship between the staff and the various transportation companies around town. Finally, at checkout there was a substantial charge on my bill which clearly belonged to someone else. Could have been a mistake, but after our previous experience, I wasn't so sure. This hotel is clearly aimed toward people traveling on some else's dime (hence \"Business Hotel\") I found it to be overpriced, a bit run down, and didn't trust them at all. Never again. I may look like a rube tourist, but after 20 trips to Italy, I'm not. There are plenty of hotels in t he neighborhood where you'll be treated much better.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Laguna Beach, California", "Title": "“Not worth it even at a discount”", "Author": "JenBarnett", "ReviewID": "UR109098139", "Content": "I am going to compare this place to other 5 star hotels in major cities, so the standards are high. If they don’t want such high standards to be judged against, they should not present themselves as a 5 star hotel. I’ll present the pros and cons so that you can decide if this is right for you, based on what is important to your trip. Pros: Location! You cannot get more in the middle of everything. 10 minute walk to just about every site except the Pantheon which is literally meters away; even the usually out of the way Vatican was a pleasant 20 minute walk. Safe, lots of restaurants and smart shops around (including internet cafes, travel agents who book train tickets, etc). Luxury amenities in the room like fancy soaps, robes, etc. Fair sized room for a city hotel, especially the nicely sized bathroom with full tub (and we were in the smallest room they have). The girls at the check in desk are cute and helpful. They seem to know just about every language between them, so everyone feels at home. Cons: The room itself was just so so on the furnishing and upkeep. For example, there was terrible scratching where the luggage rack is, right in the main visible corner of the room (see pictures). Clearly multiple scratches over many occasions and the hotel just did not care about that level of detail to fix it. Gives the room a 1 star motel feel for sure. The furnishing and bedding were totally on par with Holiday Inn Express (which if you have gone to you know is actually a nice sub-chain of Holiday Inn, but not 5 star). There is no pool or similar area. The front of the hotel is in line with everything else in the area – nothing special at all, and the well lit internet pictures do not give an accurate representation. Don’t expect it to look any different from any other hotel. Lobby was nice but nowhere near 5 stars. Their photographer was again good with the lighting and angles. They want money for every little thing- there is nothing that is high (included) service. When we got there before the room was ready, they stored our one bag and scowled when we carried it to the room (tip free) ourselves. Other hotels of this caliber have put my bags in the room when it was ready and certainly don’t troll for tips. Internet/TV entertainment is a crazy E23 for the full package per day. Not that you are inside a lot when you are in beautiful Rome, but it would have been nice to have something to keep me occupied through that initial jet lag (and to check plane arrangements, etc). Basic breakfast is E35 per person. Again, there are sooo many great places to eat around there, no reason to eat in the hotel, but sometimes if you have an early tour it is nice to have the option of eating in the hotel without mortgaging your home. Overall not worth the price (even half price that I got on Priceline), and although I was not unhappy with my stay (simply neutral), I would not stay there again – too many other places to try in the same area. (Later in our honeymoon we stayed in Paris at a really expensive hotel as well, which was actually worth the splurge for a special occasion.)", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Honeymoon in Rome”", "Author": "horncall19", "ReviewID": "UR108074311", "Content": "This hotel is fantastic!!! We booked a basic room here and got upgraded to a De Luxe room, which was amazing. The location of this hotel is also the best in Rome. It is 10 minutes to the best locations and being next to the Pantheon is amazing. There are fantastic restaurants and some really good gelato. They brought up champaign and chocolates for us, which were to die for! We had a great time at this hotel and recommend it to anyone looking for the prefect place to stay in Rome!", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Superb Location at a Price”", "Author": "JacOxfordshire", "ReviewID": "UR107532251", "Content": "The location of this hotel, next to Pantheon, is excellent, within walking distance of everything you want to see, Walked to Colosseum and taxied back. Husband was on business but I was on holiday. Had meal for one - steak sandwich with frites, glass of Prosecco, glass of red wine on roof top bar Euros 52. Breakfast available until 10.30 and adequate. Plenty of good value eateries in area, without the view! Room clean and well serviced, lovely towels and nice smellies but air con seemed to be centrally controlled not available during the night or early morning. Staff very helpful and professional, organised a guide for us to visit Vatican City and did on line check in for us for return home.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Best location in Rome!”", "Author": "Archie's Mom", "ReviewID": "UR107229884", "Content": "I loved this hotel! The location was beyond my expectations for good. Steps from the Pantheon, very close to some great trattorias, in the square with a hidden gem of a little church with its own Michelangelo. Our room was very spacious, with a big entrance hall, great bath and beautiful appointments. The restaurant on the roof was great. We were told it closed at the end of October, but it was open during the first week of November and the views were magnificent. I have read reviews of old carpet and small rooms at this hotel, but we saw none of that. I consider myself a very picky hotel selector, and this was one of my best picks ever! I highly recommend for the overall ambiance and charm, the beautiful room and the location of your dreams for negotiating Rome.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boston,MA", "Title": "“Great Location but not a 5 star hotel”", "Author": "sarin70", "ReviewID": "UR106963404", "Content": "The location for this hotel is excellent being right near the Pantheon. You are walking distance to most everything which makes it easy to navigate Rome. The service is very good as all of the staff are incredibly willing to help make your stay enjoyable. Everybody from the concierge to the front desk and in particular Paul who works the front door were very helpful and professional. the downside was \"the \"2 bedroom suite\" that we stayed in was very dated and in need of a renovation. I would have been ok with this if the price reflected the condition of the room but in no way did these accoodations warrant the cost. I would stay here again if the price point was more reflective of this hotel being a 3 or being generous a 4 star hotel.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“My Favorite Rome Hotel”", "Author": "JRP07", "ReviewID": "UR106697420", "Content": "We hopped around to 3 of Rome's 5 star hotels using Priceline and this was by far my favorite find. Location is great - as everyone else has mentioned in their review. The staff is very personable (especially the bartender). The view from the roof is exceptional. Without Priceline, I would assume this is a little over priced but for our purposes, it was lovely. Great selection of toiletries (Bulgari) in the bathroom too!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cheshire", "Title": "“Keep saying great location!”", "Author": "sfbsk", "ReviewID": "UR103986854", "Content": "We were disappointed with this hotel, but this could be countered by the fact that it is a great location. For the price, our room was not good value. It was small, and there was no air conditioning which I imagine would make it unbearable in summer. We experienced a catalogue of basic service failures e.g. sat with drinks menu but not approached for our order, waiter forgot to bring milk at breakfast, doorman fails to open door for my wife. Trivia, but it starts to become irritating considering the 5 star positioning. Perhaps it was the time of year (April) but in general the hotel seemed to lack atmosphere. Before staying there again, we would look to see what else was nearby because it is without question a great location.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“nice location vs average service”", "Author": "WakeGuru", "ReviewID": "UR102677034", "Content": "The webpage of the hotel gives a slightly misleading image of the hotel, in real life one will find a pretty old school hotel with an excellent location. But that’s about it. The staff was not ready to handle the needs of our group two mornings I had breakfast without tea, since nobody was able to bring it to me. There was no juice and the amount and choice of food was not on the level one would except for a 5 star hotel. The superior room on the pictures will has superior double bed, instead we had two beds in the room. The ventilation was poor, we had to keep the window open in order to decrease the temperature in the room, but the cleaning lady continuously closed it, as soon as we left the room. Due to the high temperature in the room it had a bad smell stemming from the bathroom! Last but not least Internet was for an extra charge 1eur/h and there was no wi-fi in the rooms. To summarize the only great thing about this hotel was the location, but I am sure for almost 300 Eur/night one can take a taxi 4 times per day and find a better value for money at location outside the old town.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Worst hotel experience ever, and we travel frequently.”", "Author": "JDY60", "ReviewID": "UR102338738", "Content": "Tiny room, chipped furniture, no air-conditioning in March despite humid, hot room. Our room was directly underneath the rooftop bar and next to the staircase to the bar. Party until wee hours at rooftop bar, music blaring, people stomping and yelling. Repeated requests for the bar to quite down after midnight were rebuffed. When party finally ended after 2:30am, staff continued moving furniture at 3 am for reset. Repeated requests for quiet were ignored. Front desk and bar staff were rude and difficult. Repeated requests to speak with night manager were denied. Location near Pantheon is convenient, but this is a two-three star hotel..", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newport, Kentucky", "Title": "“Lovely hotel and great location”", "Author": "Lisadiva", "ReviewID": "UR101323711", "Content": "This hotel was lovely. Great location, right next to the Pantheon. Service was impeccable. Breakfast was very good. Would recommend to anyone.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Hotel surroundings made the trip just that more memorable.”", "Author": "MisterStateTrooper", "ReviewID": "UR97776263", "Content": "Stayed Sept 2010 for one week. Fantastic location, totally central, walk to most of the major sites on all sides very quickly. My opinion is that it's the location and charming surroundings makes this a 5 star. The hotel is just behind the Pantheon (which you really should make certain you go back twice to see thoroughly), it is a fantastic site to have just outside your hotel door, even if just to sit in the piazza and decompress at night with a beer or wine and ponder your adventures, while admiring the almost 2000 year old temple! The hotel shares it's own little Piazza della Minerva with the Basilica di Santa Maria sopra Minerva. The piazza itself has a famous Gian Lorenzo Bernini elephant sculpture, The Pulcino della Minerva, and, get this... the sculpture is a base supporting one of only eleven Egyptian obelisks brought to Rome back in the day, this one was made around 2500 years ago. Did I mention, all this just outside your door! I was looking at some other central hotels, none of which would have had the charm of having these surroundings, it really made the trip just that more memorable. The hotel building itself very nice building, and nicely lit up a night, beautiful lobby, just like the pictures. Our room had a courtyard view with some distant landmarks visible along with the nearby rooftops, some rooms have a view of the piazza and partial Pantheon view, although like I said, it's all right outside your door anyway. The bathrooms were marble or granite, built in hair dryer, the room was cleaned daily, and the bed turned down with complimentary chocolates. The windows open fully for fresh air. The air conditioning worked. The room was quite. The bed was huge, there were a few nice armchairs, table, desk, night stand, luggage rack, large closet, fridge, and mini bar, and TV if you so desired to pay the extra fees. The room itself could use a good paint job. For the room rates my only wish would be at least some free Internet WI-FI in the rooms. Rooftop patio has a minimum charge so I decided to skip it, and just had a few panini sandwiches and beverages nearby and sat in front of the Pantheon like I said, there's no way any rooftop patio could be better. Forgetaboutit. I didn't have much daily interaction with the staff, they seemed helpful when I checked-in, helped with bags, showed my the room, answering a few questions, and I know they helped several times to resolve a bit of confusion on my travel agents part, even before I arrived. I would recommend Grand Hotel De La Minerve. Quick Tips: - Pre-arrange for a ride to the airport at the end of your trip. - Buy your Vatican tickets on-line before you go. - Buy your Borghese Gallery admission on-line before you go. - Buy tickets to the Roman Forum first thing in the morning which include Palantine Hill and the Colosseum which you enter when your ready later in the day. - Research what you really want to see in each of the museums before you go, there's tons of stuff. - Bring a backpack and load up with some beverages to keep hydrated, buy them at one of the grocery stores for better prices. - Stay for longer than a week. - Navigating street by street could get tedious, but if your like me you need to know exactly where you are at all times, look at getting an IPhone with a travel data plan, or use the IPhone App \"Rome MTrip\" to plan your routes. - Bring comfortable shoes and some first aid. - Check out [-] for some cool travel items. Ciao.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“if location is everything then this hotel is for you!!!”", "Author": "GlobalHorizonChaser", "ReviewID": "UR91275976", "Content": "I wanted to set up a romantic visit to Rome for our 10 year wedding anniversary and this hotel placed us in the heart of historic Rome...brilliant!!! if location is everything for you then this will be a fantastic hotel option, but if you are looking for the finer elements normally associated with a 5star hotel then this may fall short. the hotel has an air of sterile stuffiness and may dampen your experience. The rooftop bar provides a great vantage point of the city and is a brilliant location to share a glass of wine or two after a day of sightseeing. we got caught out with the international phone call flyer beside the phone that said calls would be charged at standard international call rates....nothing further from the truth...watch this one. The hotel also tries to hit 5star ratings in the wrong way when attracting so many tourist...no iron available...only an ironing service which verged on the extent of buying new opposed to get it ironed!! if you need a central location and can give on other items then go for it. We had a great time and have no regrets but this is a once only hotel for us...", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas, USA", "Title": "“Glad we made the decision to stay here”", "Author": "HauntedMansion", "ReviewID": "UR90111894", "Content": "We stayed here in March of 2010, and don't regret that decision at all. The location was perfect - from the front of the hotel you can see the Pantheon. It was a nice central location to branch out from every day without worrying about having to take a taxi through the crazy Roman streets. Our room was a corner room which afforded great views in multiple directions. The room was large by European standards, and was comfortable. The bathroom was floor to ceiling marble and huge! The hotel staff was very courteous - no complaints. Our reservation came with 2 included breakfast buffets each morning. This breakfast buffet far exceeded our expectations, and we still talk about it to this day. This would be worth paying extra for if it wasn't included in the room rate. Every day they had fresh fruit as well as fruits in syrup, scrambled eggs, the most amazing bacon I've ever had, breads, cheeses, sliced meats, pastries, cereals, and several types of juices. It sounds typical, but was much better than typical. The hotel offers free internet, but is only wired only (no WiFi) which was a tad annoying. They have free computers off the lobby for use, but during our stay they were remodeling and those were unavailable. We used the third option of using the Internet on the TV which was for a fee, but presumably due to the construction and unavailability of the public computers we were not charged for this use. As mentioned above, they were doing remodeling throughout the hotel during our stay, which I'm certain is completed by now. The staff did a very good job of keeping the disruption to a minimum and keeping us informed daily of any potential work that might be going on during the day, and it turned out to be a complete non-issue for us. We would easily choose to stay here again on a return trip.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Prague, Czech republic", "Title": "“OK stay for two nights”", "Author": "adamkeshner", "ReviewID": "UR88828030", "Content": "Staff are not just willing, the interior had not been renovated for a long time, the hotel is nothing special that there would ever want return. From our room were stolen part of our clothing and the hotel did not want to be taking responsibility.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Loveland, Colorado", "Title": "“Great location, but they need a reality check”", "Author": "Highroad35", "ReviewID": "UR88717326", "Content": "We chose this hotel based on the location for sight seeing and a quick business meeting. The location was great, easy walk to many sights, shopping and restaurants. Our agent booked us for one person, honest mistake. The hotel jacked the price when they saw we were two, stike one. We requested a non-smoking room, were given a smokey, poorly lit room that could not possibly be worth the inflated price, stike two. In general, apart from the well appointed lobby/sitting room, the place was not very clean with soiled carpeting in the halls and stairways. The walls and light fixtures in our room needed a good scrub. Overall, the hotel was very worn looking despite the superficial attempt at luxury. WAY over priced, stike three. We moved to the Weston the next day.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“Perfect Location. Beautiful Hotel. Very nice room. Pay up.”", "Author": "tmh_longisland", "ReviewID": "UR88151338", "Content": "This is a very nice place that a business associate recommended. It is in a wonderful location (you MUST see the Sopra Minvera Church just next door.) We went South to the Coliseum, west to the Vatican, North to the Galleria Borghese & walked it all, with no problem. I've read in previous reviews that the staff was snooty (..or was it snotty?) They weren't on their hands & feet but they weren't that bad. The reviews about the A/C is true..it looks like A/C, it sounds like A/C, but it's more HV than AC. I wasn't thrilled with the room view but I paid with AE points. And at about 6:30am, the barbells from the gym across the hall got a little annoying. I guess you just want to say you dont want to be near the gym. Best part: a very nice rooftop cocktail/restaurant area with a gorgeous sunset view of Western Rome. (Someone had a wedding up there one night...very nice.)", "Date": "November 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "detroit mi", "Title": "“The Cement is Softer than the Bed. AVOID THIS LIKE THE PLAGUE!”", "Author": "jdmapes", "ReviewID": "UR87285086", "Content": "The one and only positive of this hotel is the location. It is very convenient to walk to all the sights from there. The biggest negative I had was the bed. It felt like it was made of cement, neither my wife nor I could fall asleep on it. We asked to either be moved to a new room, as we could tell this mattress was circa 1970, but were informed that since we booked out hotel through hotwire and had a steep discount, that they would not give us another room. The staff was rude, not helpful at all. I don't know who decided this was a five star hotel, I've had better rooms and better service at a motel 6.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cranberry Township, Pennsylvania", "Title": "“Beautiful hotel and great location!”", "Author": "Heatherlp", "ReviewID": "UR83972036", "Content": "My spouse and I stayed here at the beginning of October and very much enjoyed our stay. We were given a very pleasant & clean room on the 6th floor facing the courtyard. I enjoyed being able to open the windows in the room and bathroom to get a nice breeze into the room. The hotel had a nightly turn down service with delicious chocolates as well as huge towels, slippers, and bathrobes in the bathrooms. The shower pressure was wonderful (better than at home) Even though the room was on the small side, there was enough room for 2 people since they had hangers and shelves in the closet as well as a very comfortable bed and a work desk for when we needed to use our computer. We did have to pay a fee for the internet, but didn't need to use it very often so the charge wasn't very much. The tv was a flat screen, but the channels in English were very limited (MSNBC & MTV), but we didn't go to Rome to watch TV. I found out ahead of time whether breakfast was included (it was) and was happy with the choices they had. The wait staff served beverages and were very pleasant. We had very early morning tours each morning so I was only able to enjoy the breakfast one day while I was there. The front desk staff was very helpful and friendly, spoke fluent English, and, on our first night, suggested a great restaurant only a few blocks away. I would definitely stay here again. The location was perfect, being that the Pantheon was only steps from the hotel and Piazza Navona was about 2 blocks away.", "Date": "October 18, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“I will never ever book this hotel again”", "Author": "Mariecaroline12", "ReviewID": "UR82965823", "Content": "This hotel is horrible. When we got there we were told that there was no room for us despite having already paid 900 Euros for 2 nights. The staff told us that a group of people refused to leave their room so the best they could do was to put us in a different hotel in the other side of Rome that had \"kind of the same rating and price\". After having refused to change hotel we eventually got a hotel room which just proved that they had lied to us all along. The service is really poor and not at all what you would expect from a \"5-star\" hotel in this price range. In addition to this the staff were very rude and unhelpful with such things as assisting with reservations etc. Do not choose this hotel for your stay in Rome!!!!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“This location can't be beat!”", "Author": "goldhair46", "ReviewID": "UR81610850", "Content": "The Pantheon is right out the door! The Piazza Navona is a block away. The staff is extremely helpful in every way. Room was very clean. The only thing we missed was not having a coffeepot in the room. I also would avoid the very overpriced restruant on the roof. You won't regret staying here!", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Winnipeg", "Title": "“3 star at best”", "Author": "Kerjner", "ReviewID": "UR80371001", "Content": "Hello Trippies I booked this hotel through Priceline. I got what seemed like a good deal until one of the staff told me that because i got such a good rate normally included amenities now now become chargeable as add ons. Beware of this. If you book through online sites and get a good rate they will nickle and dime you when you get there. Parking - parking is off premise and is 40 euros per night . By the way you have to call one hour in advance to get your car. At 40 euros a night the car should arrive lickedy split. By the way I got my car back with foot prints on the hood and bumper so someone walked over my car. Not quite what you expect for 40 euro a night parking. Wifi - 5 euros an hour for wifi and its only available in the lobby. There was a daily max of 15 euros. 5 star hotels typically don't charge for bad wifi that has only lobby range. Room - because of my good rate thy gave me a subpar room with mold on the bathroom ceiling and a large access panel missing from the ceiling at the entrance. They were unwilling to give me a better room due to my priceline rate. The only good things about the hotel is the location and roof top restaurant overlooking Rome. The roof top restaurant is very pricey for nothing. Basically I found this hotel calls itself 5 star when it's really providing 3 star service and amenities. I hope this helps you in your hotel decision in rome.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Great location, and grand.”", "Author": "BarbaraW75", "ReviewID": "UR78946292", "Content": "We stayed here while in Rome from the advice of Effetto, a travel service. The location was perfect. We were able to walk to almost everything. It sits right next to the Pantheon which we could view outside of our room. It was also on a square, so you could listen to street musicians if you opened the windows. The suite was absolutely beautiful. Canopied bed, about 15 foot ceilings with inlayed wood. Both bathrooms were full baths with jacuzzi tubs. Service was excellent, and the staff very helpful with points of interest. They have a rooftop restaurant and bar which we enjoyed very much the first evening we checked in. Would recommend this hotel to anyone. We would definitely stay here again !", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "middle england", "Title": "“Great location good sleep great place to come back to on a hot day”", "Author": "upperdeckplease", "ReviewID": "UR77940789", "Content": "Stayed for 5 nights in August 2010. We had booked on the web and were put in a superior room, which was fine but too small. I asked to change and they put us in a much larger superior room (108) on the first floor. Location is superb, and in August this meant a lot, as we could come back to the hotel, have a shower and cool off. Bed was massive and very comfortable. Rooftop restuarant was romantic, but overpriced. Rooftop bar has great views. Prices in Rome are absolutely crazy. Very easy to spend 100 Euros for a meal for two. Breakfast buffet was wonderful; freshly squeezed orange juice, fresh fruit, eggs and fifty things to choose from, which sets you up for a good morning's tourism before lunch. At the price we paid (low due to summer) would definitely return.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Pete Beach, Florida", "Title": "“Great Location”", "Author": "ernierad", "ReviewID": "UR74963111", "Content": "Overlooking the Pantheon. Walked to the coliseum, spanish steps, trevi fountain, best shopping district and great restaurants all arond. Try Armondos just 1 block away for incredible differences. Our room overlooked the Pantheon square. Beautiful.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Top Shelf / Professionalism / Courtesy / Acommodating”", "Author": "rico_mad", "ReviewID": "UR74650828", "Content": "It was an expensive hotel but you certainly get what you pay for. Breakfast was great. Eggs, pasteries, cereal, fruit, etc. And good service. The rooms were clean and comfortable. The Concierge, Luigi, was absolutely accomodating. Resteraunt suggestions were fantastic. The front door was always opened for us with a smile when we entered or exited the hotel. The location is as good as it gets. Steps away from the Pantheon and a taxi is always available right outside. We stayed with a our family of 5 including three pre-teen children. Unfortunately they cannot accommodate five in one room so we had no choice but to book two expensive rooms. This is the only negative...cost. But to vacation in Italy is to spend money like it is wine. You need to put yourself in that mode so you don't get aggrevated by being robbed all over town. Great place to stay!", "Date": "August 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston area", "Title": "“Outstanding”", "Author": "ChingoChinga", "ReviewID": "UR73114773", "Content": "Have used this hotel many times over the past 10 years for business, and recently twice in the past year on personal trips. The location is excellent -- just off the Piazza della Rotonda (pantheon) and walkable to all kinds of historic sites in the downtown area. The lobby and common areas are beautiful and the staff is welcoming and professional. The rooms are spotless and very comfortable. Not all rooms have nice views - have had rooms with views of city and also rooms with windows opening into the alley - but that's what you get in a downtown location. The only reason we didn't give it 5 for service on this trip is that our laundry didn't get processed as requested. Was probably an oversight because we have never had that experience in the past. HIghly recommend this hotel to anyone looking for a place to stay in Rome.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Nice Hotel - Great Location”", "Author": "spursone", "ReviewID": "UR73019762", "Content": "This was our first trip to Rome. Traveling were myself, wife and 14 year old daughter. We booked a Junior Suite at this hotel so that we could have some extra room. The room was very nice and to our surprise, came with a very large outside terrace. (app. 15x25 feet) The large bathroom had a shower/bath combination. The furniture was nice and inviting. We found the staff to be very friendly and helpful. Our room did not include the breakfast buffet. We usually ordered a pot of coffee since Italy does not seem to have good places for to-go coffee. There is a nice grocery store about a block and a half from the hotel and we found this a good place to buy fruit and other things for breakfast. The best thing about this hotel is location. It is a one minute walk from the back of the Pantheon. There is also a rooftop bar and restaurant with incredible views of the city, including the top of the Vatican.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver, b.c.", "Title": "“BELLISSIMO & PERFECT HIDEAWAY IN THE MIDDLE OF ROME RIGHT BEHIND THE PANTHEON”", "Author": "mizzjoy", "ReviewID": "UR71966053", "Content": "If you visit rome, this hotel will not disappoint! The location is perfect-right next to the cathedral minerva in a square right behind the pantheon in the middle of Rome. It is safe, quiet, elegant and spacious. The service is stellar! I left my jewels in the safe and the hotel fedexed them to me and all survived and arrived in perfect order within less than 24 hours. The breakfast buffet will leave you spellbound. This hotel gave me the best cappuccino I have ever had. This hotel offers gracious service. The Grand Hotel Minerve is truly a five star experience that should be shared with friends and loved ones. If you are on business, you will not be disappointed. When you come in from the bustling, noisy and urban center, here you enter an oasis of calm and elegance at the Grand Hotel Minerve. 5 stars!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Great Location - no doubt!”", "Author": "ViraatRaj", "ReviewID": "UR71264356", "Content": "We booked this hotel through www.clickitbookit.travel and got a fantastic rate compared to the other online booking sites. We stayed at the Grand Hotel de la Minerve in Rome from the 9 to the 14th of July 2010 The location is fantastic- right next to the Pantheon and a 10 minute walk from the Spanish steps, Trevi, Via Condotti as well as the hop on hop off tour, Piazza Venezia, Colosseum and a host of other cathedrals, attractions and shopping joints. The hotel is an old palace turned into a hotel and hence has a lot of character. The entrance is small though and faces Miverve square right opposite a beautiful church- Santa Maria ( Saw so many cathedrals and churches, i think it was Santa Maria). The Vatican and St Peter's is a One Euro ride on bus 62 or 64 and takes about 8-10 minutes to get to. Service is decent at the hotel. The rooms are well appointed though the aircon could be much better. Breakfast is a decent spread but the hotel would do well to change the menu - even a little-instead of the same offering- daily. However, the staff at the breakfast hall as well as the reception are extremely polite and willing to help - in whatever fashion. They all spoke good English too. All in all, a great stay and i would certainly stay here again. Hope i get the same rates on www.clickitbookit.travel again for this hotel!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "College Station, Texas", "Title": "“Not a good value for the nightly cost”", "Author": "gcaudle", "ReviewID": "UR70188504", "Content": "Two night in this hotel were enough. Minimal accommodation for the price. Our room backed onto a residential street that included open windows and as an added bonus - clucking chickens at six in the morning!!! I thought I was back on the farm. At first it was charming, but it wore a bit thin the next morning. The breakfast was very expensive for our taste (30 euro each plus mandatory gratuity). We thought we were much closer to St. Peter's than we were, but we can't fault the hotel for that. We asked the concierge (Luigi) to run several errands for us. He was gracious and handled everything efficiently. Being close to the Pantheon was a big plus.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“great location....but that's it”", "Author": "Dublady", "ReviewID": "UR67360471", "Content": "I stayed here for 7 nights with my husband and cannot say enough about the location. It is a max of 15 mins from all the major sights and so is a great base for a first visit to Rome. The rest of the hotel however I would not grade as a 5 star - the breakfast was fine however the buffer seemed to run low on some items without replenishment and the rooms at the front are very noisy. The rooms are big however, the bath rooms could be cleaner. Also housekeeping entered our room twice eventhough we had a do not disturb sign up! Overall a nice stay, not a great one.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Williamstown, Massachusetts", "Title": "“Location, location, location, but...”", "Author": "Hamilton6", "ReviewID": "UR66722799", "Content": "I won't repeat the positive comments (all deserved) about the location of this property. We did, however, find the service a little quirky, but we would stay there again nonetheless. When we arrived on an early flight from the states, our room was not ready and would not be ready until noon. We went out for a walk and came back around 9:30 to be told that we could have the same room one floor lower if we wished. We were very appreciative of the woman at reception having taken a personal interest in us. Very impressive. We had a good-sized room with a king sized bed, but no pillows. We found one in the closet and assumed that the others would arrive during the day. When the turn-down service people showed up, we managed to explain our dilemma (they did notice our pillow situation). We asked for 3 and they found 2 somewhere. Good for them for caring! When we called the desk later for the fourth, they called back and said that all rooms were booked that night and they had no more pillows, but would get us one the next day. It never arrived, but having 3 pillows instead of 4 is not a big deal. Later in our stay, we asked the person who was filling in for the concierge to make a dinner reservation for us at a specific restaurant. She couldn't get through, and said she'd do it and let us know. Hearing nothing, I went downstairs later to find the woman gone, the note on the counter, and no call having been made. Marco, the regular concierge, was extremely helpful in getting us dinner reservations and making excellent suggestions for restaurants. So we had a couple of quirky experiences, but generally the staff is friendly, helpful, and professional. The room was extremely quiet and clean, and the location is unbeatable. The room we booked came with free wi-fi, which we always appreciate. We will stay at this hotel on future visits to Rom.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Badly in need of complete renovation”", "Author": "McGyverNYC", "ReviewID": "UR66530430", "Content": "One of the hotels, which arrogantly only counts on it's fine location. In this case next to the Pantheon. Everything else in this so called 5-star hotel is in fact three stars - it's not nearly up to the standards of a 350-Euro-plus hotel and should be closed, till the owners made a complete rennovation with not a local, but an international acclaimed architect.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect sightseeing hotel”", "Author": "Nick P", "ReviewID": "UR66400984", "Content": "The Minerve is wonderfully positioned to see all the wonderful sights of Rome. Our room was literally overlooking the quite remarkable Pantheon. Also on it's doorstep is the Santa Maria church which, like so many churches in Rome has a Michaelangelo sculpture and wonderful art. Nothing in the centre is more than a half hours stroll away (Vatican 20 mins, Spanish Steps 20 mins, Colosseum 15 mins, Piazza Novona 5 mins, The Pantheon 1min) The room we had, a superior, was a little small but comfortable and with everthing one would want, TV, good shower, great toiletries, comfy bed etc. The roof bar/restaurant is wonderful place to relax, food good and they mix a nice cocktail. Staff are couteous and helpful. If you want/have to do the Vatican ask them to book a private tour, 70euros per person but well worth it to avoid the queues (we had a delightful American girl, Cady , who was great and very knowledgable. My top tip is get up early to avoid the crowds, at 8.30am we were the only people in the Pantheon, by midday it was hard to get in! My only gripes about the hotel is the lack of plunge/swimming pool on the quite enourmous roof space, For the loss of probably only one room it would be a fantastic addition to the hotel and a blessed relief on a hot afternoon. Also the air conditioning is a little noisy, but at least the windows open, a rarity nowadays.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Highlands Ranch, Colorado", "Title": "“GH Minerve: Heart of Rome, Quality Service, Mostly Nice Rooms”", "Author": "QueensLanderTours", "ReviewID": "UR66369416", "Content": "My hats off to the Grand Hotel de la Minerve as they provided our recent small group tours from QueensLander Tours an excellent stay. As with the majority of Italian hotels we have found it imperative that our tour directors inspect rooms prior to guest's occupying them - many of the properties in the historical centers of Rome (and the other great cities) are truly worthy of historic note themselves and that simply means they've been there for a long time. That's no excuse to allow a property to fall apart and the team at the Minerve are working diligently to keep their hotel up to a 5 star experience. My criticisms of the Minerve are limited to some stains on carpets in hallways and very few 'scuffs' on the walls from what appears to be luggage damage. Other than that the service, quality of the rooms and amenities are definitely Italian 5 Star. The rooftop terrace is seasonal and that's why we visit Rome during the best season from April to October with our great cities tour. Their breakfasts are great, too. Location is the overall winner for sure - in the heart of Rome but on a 'quiet' street and piazza.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange County CA", "Title": "“Best Location in Rome!”", "Author": "Trisha21", "ReviewID": "UR64878945", "Content": "My husband and I spent four nights at the Minerve in early May. Our room was beautiful and had a great view of the plaza and the Pantheon. Our breakfasts each AM were amazing and all the staff were most accomodating. We will definitely return to this historic and lovely hotel.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“An amazing hotel for a leap into the past”", "Author": "Nicks26", "ReviewID": "UR64213846", "Content": "I was there with my girlfriend at the beginning of May. Ever since the cab stopped at the hotel entrance in Pazza delle Minerva, behind the pantheon, we were totally amazed!!!! It seemed like going back in time! The location is definitely the best in the city, we went around every day, and in walking distance it is possible to reach the best places of the City, like The Spanish Steps, The Trevi Fountain, Piaza Navona, The Colosseum and much more! The hotel is also very close to Via Condotti, which means that you can totally loose your girlfriend for hours in the best shopping street ever! The room was absolutely beautiful with a breathtaking view of the square... i felt like I could have touched the pantheon. My girlfriend and I have travelled a lot and we both agree that luxury make sense only if it offers you something from the past, and this hotel is like a sort of a museum in the heart of the Eternal City! EVERYTHING WAS SO PERFECT THAT WE CAN'T WAIT TO GO BACK...!!", "Date": "May 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cable Beach Broome Western Australia", "Title": "“Great Hotel - but don't have anything ironed!”", "Author": "MonsoonalBlue", "ReviewID": "UR62707204", "Content": "Requested an iron and ironing board for items that had creased during travel. The hotel does not provide an iron and ironing board in the rooms, so we had no option but to have the hotel iron them for us. We paid 88 Euro for 5 items - three of them being very small childrens items. Unbelieveable - how do you not feel embarrased to rip off your guests in such a blatant manner?", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Superb hotel, great staff”", "Author": "lab27", "ReviewID": "UR61772711", "Content": "Beautiful hotel, great location in the historic centre of Rome, extremely kind, attentive staff. Highly recommended!", "Date": "April 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "speechcb", "Title": "“Do Not stay at this hotel!”", "Author": "speechcb", "ReviewID": "UR60351581", "Content": "This hotel was terrible! Service was awful! Rooms were dated, dirty, and not maintained. There were stains on the carpeting and scuff marks on the walls. The hairdryer was terrible! The hallways were dirty. The hotel roof top bar/restaurant was not opened, the air conditioning was not working, and we were never told that they hotel was undergoing some cosmetic work; painting. The all artwork was removed from the hallway leaving the hook and dirty ring where there was once a picture. The room size was small and the bathroom was very small. Very over rated hotel!", "Date": "April 4, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Location - great views”", "Author": "SunSeekerMA", "ReviewID": "UR54174104", "Content": "My boyfriend and I and another couple stayed at this hotel for 5 nights in October 2008. On the same trip we had also rented a house in Tuscany for a week and then spent a few days in Amalfi. We decided to head back to Rome a day earlier and the hotel was very accomoding to giving us an additional night at the same rate. The location couldn't have been better - we walked from our hotel to everything and did not need to take cabs at all except to/from the airport and we actually partially took the train from the airport because of the time of day. (Many of thye hotels in Rome are far outside of the core of the city and you will waste time and money travel to and from them.) I know a lot of people have complained about the price - but hello! This is Rome we're talking about. We paid about $280 per night and we thought it was quite reasonable. The hotel staff were friendly and accomodating. Our room was a good size ( again for a city hotel in Europe) and actually had a separate seating room and two tv's. The bathroom was well appointed and had nice ammenities including a day/night face cream combo which for anyone who travels regularly on planes you can appreciate. The best part of this hotel was the rooftop bar. We met there daily after our travels around the city and met many of the same people there each night and had regular \"happy hour\" crowd of sorts. The views from this rooftop deck were spectacular and if for no other reason this is a great reason to stay here. I would definitely stay again if I were traveling to Rome.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Europe", "Title": "“Paying too high for the perfect location”", "Author": "MBLUX", "ReviewID": "UR52842744", "Content": "The hotel is in the middle of the center and a perfect location to walk around any part of the historic or more modern parts of Rome. There is almost no better location, no need for taxi, bus everything is within 20 minutes walk through this beautiful city. But for the price that you have to pay you get not a lot of value. The breakfast is nice and the special \"tasting\" dinner is perfect; and the lobby is very nice and unfortunately was the terrace on top of the hotel not open as that might have been nice. BUT the rooms are outdated in every way. The suite has an ultra tiny bathroom and smallish bad room with very hard beds. And the living room as so big that the only 1 desk, 2 small chairs and sofa look ridiculous in it. A waste of space and my money it does NOT invite you to go sit there have a coffee and watch a TV which is at a 6 meter distance. Overall a disappointment, luckily the city itself made up for it.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Elegant hotel in a perfect location”", "Author": "philget", "ReviewID": "UR52801044", "Content": "This was our first trip to Rome so we searched Hotwire for a hotel close to tourist attractions, assuming the tradeoff would be noise and crowds. To our surprise, our windows opened onto the quiet and picturesque Piazza Della Minerva. The most notable sound was that of a very romantic violin in the evening. The teenagers got a large room with a balcony, facing a peaceful inner courtyard. We upgraded to a suite so as to not be outdone, giving us a very spacious living area. The spectacular lobby, common rooms and decor contributed to an oasis-like ambience which made it easier to brave this busy city and the crowds at the coloseum, forum, etc. all of which are within walking distance. Breakfast was fine - you're just not going to get homefries and pancakes in an Italian hotel - but we did get cereal, granola, scrambled eggs, fruit, smoked salmon, etc. We got some snacks at the bar one night but didn't eat dinner in the hotel due to the price. We did try several nearby restaurants, of which our favorite was the trattoria-like Ristorante Der Pallaro where, to quote their non-menu, \"what we serve is what you eat\". The concierge staff went out of their way for us on several occasions, most notably when I asked them to get tickets to the sold-out La Taviata at the opera house. They actually came up with two which I foolishly turned down, hoping for a better night. They later sent a staff member to the opera house to search for more tickets. They weren't successful but their effort impressed me. On the downside, TV movies were unavailable some nights and their one slow computer for guests made me glad we brought our laptop. They recognized the problem and let guests use the office computer and printer when asked. I suspect, but am not sure, that cabs are more expensive when they leave from the hotel than from other locations. To sum up, I have no serious criticisms of this hotel and would stay here again gladly (especially for the Hotwire price).", "Date": "January 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Stolen Money”", "Author": "mimi048Houston_Texas", "ReviewID": "UR49978996", "Content": "My husband and I spent a week in Rome celebrating his 65th birthday. We stayed in the Presidental Suite at the Grand Hotel de la Minerve. The location could not have been better, it is situated directly behing the Pantheon. Our room consisted of a very large living room with a full bath and a very large bedroom with another full bath. We put our extra Euro's and American cash in the room safe. The very first night we returned from an early supper and the safe was open and 400 Euros were missing. I shut the safe before leaving because I went back in it to get my watch. We reported it to the front desk but they revieved the log and said no one had entered our room while we were gone. Two days later we returned and our American cash was gone, the safe was closed. Again we reported it but they did nothing. After that we counted our money with a witness at the front desk and had them lock it in their safe. A hard lesson to learn, but as much as the room cost us, and the reputation of the hotel we never thought anything like that could happen. They said they did not have access to the safes in the rooms, but what do they do when someone forgets their code? We had to assume it was an inside job but we couldn't prove it. Just thought this is something travelers should consider when they put their money in a room safe.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Mostly gorgeous, a few flaws”", "Author": "elainesl", "ReviewID": "UR48430056", "Content": "Recently returned from a stay in a 2-bedroom suite. The hotel is in a perfectly-convenient neighborhood, steps from the Pantheon, a 5-7 minute walk to Piazza Navona, a 10-minute walk to Campo dei Fiori. The hotel is venerable and grand, as befits its name. Our suite was roomy and beautifully-appointed, though our rooms had very dim light. Bedside reading was a strain; reading in our suite's lounge was nigh impossible. If we'd wanted to do any real work on computers and such, that would have been even more of a problem. The breakfast buffet was very pricey (31 euro pp, I believe) and while the food quality was very good, I can't say the range of offerings was worth the price, though the convenience counted a lot. When leaving Rome, we had to leave the hotel at 6am to make our early morning flight back to the USA. Incredibly, hot beverages (coffee, tea) are not available at that hour. The 'wee hours' menu included tomato soup, one or two sorts of sandwiches, maybe a plate of cookies, and that's it (4-5 items in all). No coffee. I still find it hard to believe. We were pleasure travelers, and there are business guests as well, who find it reasonable to be able to order coffee early in the morning, especially with this hotel's prices and reputation. Those criticisms aside, we enjoyed our stay.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wiltshire", "Title": "“Great Hotel, Excellent Location!”", "Author": "PeeBeeWiltshire", "ReviewID": "UR47977160", "Content": "Had a room with a view over the Minerve Square. Always something to see/hear. Comfortable room. Great buffet breakfast. There was a problem with our booking on arrival, which was dealt with immediately. The roof-top terrace is beautiful, with an excellent singer/pianist. Recommended!", "Date": "October 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Arizona", "Title": "“Not impressed with hotel employees.....”", "Author": "ctsdoc1", "ReviewID": "UR46550139", "Content": "While true, it is a 5 star hotel in a great location in Rome.....we were disappointed with all the staff at the hotel. NEVER a smile or eye contact upon checking in. Upon leaving we never were asked how our stay was. The conciege was sufficient but less than friendly. Our room was clean but tiny. 2 drinks on their rooftop restaurant/lounge was approx $50 after dollar conversion. And when we went to the rooftop lounge to have a drink, while there were almost no people there, we went to sit on some couches and were told that to sit on the couch would be an extra 10 Euro per person! We moved to the tables....Overall other than the location, we were not that impressed.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tuson", "Title": "“5 STAR hotel, location, staff...can't say enough good about it!”", "Author": "t2009adventure", "ReviewID": "UR45441718", "Content": "This hotel is excellent. Super location right by the Pantheon. Our window looked out on the Pantheon. Room was spotless, huge, well furnished and offered sumptuous amenities -- lovely roof garden, cool and inviting lobby -- very helpful, attentive staff. I would recommend it enthusiastically. It is located in the heart of Rome many plazas offer great restaurants, people watching and easy of travel. Meals in this area are a bit pricey, but no worse than NYC or Paris. You will not be disappointed in this hotel.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manila", "Title": "“Clean hotel, good service and excellent location”", "Author": "FabulousMom", "ReviewID": "UR44050886", "Content": "I have to admit that I was initially a bit apprehensive when I booked this hotel because of the less-than-savory reviews I have read on Trip Advisor. Good thing, I was convinced by our travel agent to give this hotel a try and I can say that I don't regret staying here. First of all, this hotel is but a stone's throw away from the famous Pantheon, walking distance from Piazza Navona, Trevi Fountain and Spanish Steps (although this one I consider a longer than usual walk). The receptionists and concierge were very helpful and were willing to answer \"touristic\" questions no matter how trivial they may be. The room and toilet were quite large and very clean. Internet was not free so that was a bummer. They changed foreign currencies at very reasonable rates. Breakfast was quite good and the selection of breads, pastries, fruits and juices was quite extensive (by European standards). If you need to go to the Vatican, a cab can take you there for less than 10 Euros so it's not that bad. Souvenir shops are practically everywhere, you just have to walk a little bit along the side streets. Saturday nights can be a bit noisy nearby because of teenagers going to clubs but the noise level won't reach your rooms.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Near Pantheon & Piazza Novana - perfect location!”", "Author": "DawnTodd", "ReviewID": "UR38311386", "Content": "Our first trip to Europe for our 20th anniversary was unbelievable! The experience included a wonderful stay in this beautiful Grand Hotel de la Minerve. I searched for weeks looking at websites for many hotels and found this gem. It was elegant and clean, well appointed and very quiet, our room was superb. The staff was also always accomodating, friendly and helpful whether we were coming or going. They sometimes mistook us for imposters when we arrived in back in our shorts and T-shirts from a long day of sightseeing, but a smile and reminder that we were guests, would give us clearance :) The architecture and decor was impressive and location was undeniably the best. All the cafe's at Piazza Novana and the Pantheon were a few steps away! Thank you to everyone who made our stay wonderful.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Not Great... but (ok)...”", "Author": "elyfretz", "ReviewID": "UR37378134", "Content": "I was disappointed with the service at the Minerva, while parts where great such as the roof top garden restaurant and bar, others where completely lacking. When we checked in the night manager was completely unaccommodating and seemed bothered to have to talk to us. The breakfast was good, but overpriced (30 Euro / pp) and the fact that they charge for internet access is quite frankly childish for a so called 5 star property. This isn't Starbucks! We actually experience the same staff member barging into our hotel room only to apologize and close the door, apparently knocking first is a novelty. Luckily everyone was dress! The other major annoyance was the Bell hop operating as the concierge. He had limited knowledge of the city and was generally unhelpful. The full time concierge seemed to return a day later who was much more on top of his game, he was insightful and able to point out a few hidden gems. So hopefully this was just a temporary staffing relapse. Besides these details which seem to make or break an excellent experience, the Hotel rooms were nice and the bathrooms have shower curtains! Hooray, yes this seems like a no brainier to any American, but for some reason Europe opts for the glass retainer that retains no water at all. Let's get to work on that! Seriously, the bathrooms were nice! Stone finish, luxury fixtures, good lighting, etc. The typical rooms decor was nice and the layout made sense. Agreed again the bedding is not 5 star and the pillows are not lush. Complements on the safe it is enormous! You could put your whole laptop inside! Honestly if I was AAA rating this hotel in America it would lose a star, it's not a 5 star property. But then again this is Europe and the whole rating system seems a bit inaccurate. I have seen 5 stars that are 4 and 4's that are 5, 3's that are 4 and vise versa. Decent place for the money, (250 Euro/ night) but don't call this a 5 star hotel. It's no St. Regis or Four Seasons.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "london", "Title": "“Disappointing”", "Author": "vburmester", "ReviewID": "UR34679412", "Content": "My partner and stayed here a few weeks ago and were terribly disappointed. Our room was not ready upon arrival, despite requesting early (12 PM) check-in. If the reception staff had been friendly and apologetic, then we'd have shrugged our shoulders and felt alright about it. Instead, the receptionist was frosty and gave us the impression that we were not welcome. This attitude was to become a theme. Our room was like a Travel Inn - cleanish (last person's pubic hair in bath) but functional. It was certainly not 5* by my previous 5* experiences. The loo leaked (it was fixed) and there was damp and peeling paper near the bathroom. My laundry was lost by housekeeping and the hotel did not feel any responsibility for this. A hotel employee mysteriously barged into the room, without so much as a knock at the door, and my boyfriend was naked in the hall at the time. We did get a complimentary bottle as an apology for this event. It's not that this is the worst hotel you could book into, just terribly overpriced, below 5* and unwelcoming. Try the Regents Grand instead. p.s. the pillows are like rocks!", "Date": "July 13, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“Felt robbed and hugely dissappointed”", "Author": "Charlotte009", "ReviewID": "UR33957367", "Content": "My boyfriend and i did not stay in the hotel itself so we cannot comment on these facilities. We visited the hotel's rooftop restaurant - it has a spectatular location with beautiful views. The positives end there. The food choices are poor (we should have left after seeing the menu), the service average, the food - awful and overpriced. After spending near 30 euro on pasta with seafood my boyfriend had expected more than one prawn and two scranwy langoustine! My turbot was overcooked and the rice inedible. For a supposedly 5 star offering i was terribly disappointed and 80 euro down. In fairness on complianing we were offered another meal - to be honest, the fist one was so bad i just wanted to leave. Go for a drink in the bar - enjoy the view and then leave!", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Petersburg, FL", "Title": "“Perfect choice in the Eternal City”", "Author": "reiddg", "ReviewID": "UR33756947", "Content": "This was our second stay at the Minerva. Our flght arrived early and we were to the hotel by 10 AM. We were pleasantly surprised to find that our rooms were ready. Our room was a junior suite and had a lovely terazza. The rooms were very clean and well maintained. The hotel itself was spotless. The staff was very friendly and helpful. Be sure to stop into the bar when there, either on the rooftop or in the lobby. The bartenders are a hoot and the ambiance is excellent. We have not eaten in the restaurant so we can't speak to their food. However, the snacks put out by the bartenders was unbelievable. Nuts, canapes, etc. Very enjoyable. We like to try different hotels whenever we're in Roma, but since finding the Minerva, we will look no further. It's central location makes easy walking distance to many of the sites. I would highly recommend it to anyone that wants an enjoyable stay. It's a bit pricey but worth the extra $$.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Staten Island, New York", "Title": "“Amazing Location Eclipsed by Price and Not-so-good Service”", "Author": "aseidman", "ReviewID": "UR32977826", "Content": "This hotel is located in what is perhaps one of the best locaitons in Rome. I have been to Rome about 8 times, and each time I stay in a different hotel for the new experience. Grand Hotel De La Minerva was the most expensive hotel I stayed in and I can tell you that my colleagues agree with me whan I say its just not worth the money ! The lobby is beautiful, the rooftop restaurant is very nice, rooms are fine (although small like much of Rome's hotels), but the place is just way to stuffy, expensive and pretentious and the prices for a coffee or the most basic items are rediculous. What was really disapponting was the attitude of much of the staff. It was almost like \"hey, be happy we let you stay here... this is an expensive hotel !\". Well at nearly 500 dollars a night... I think they need to be happy people stay there.. not the guests. All said, it was far from horrible.. and please see my other reviews just so you know I am not a critical traveler. This place just under-delivered and over-charged for everytyhing ! For my money, there are better places to stay in Rome.. unless of course you get a really good rate here.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Good location, Bad service”", "Author": "cmattar1602", "ReviewID": "UR31105263", "Content": "Grand Hotel de la Minerve was recommended to me by a close personal acquantance who had frequently used the hotel many years ago. After he had raved about it so much, we decided to proceed and book 3 nights there. Unfortunately from check-in to check-out the service was horrendous! After pulling up to the hotel, there was no bellman to handle our luggage. Check-in was all but welcoming. After reaching the room, we were on the second floor in a corner room with a window which barely let in any sunlight. The room was standard. It felt more like a business hotel than anything, but generally clean. We asked the concierge for recommendations of restaurants in the area and he seemed almost baffled and ill prepared to respond to our questions. Another incident with the night concierge where we asked for help, he had advised he would get back to us with a reply. After a couple of hours, we went downstairs and asked for an update and he said there was no luck. There seemed to be no real desire to service the guest. Check out service was equally horrendous. My husband brought the bags downstairs to the lobby, pulled the car up to the hotel and put the luggage inside with no assistance from anyone in the hotel. 5 star luxury I DONT THINK SO!!!!!!! Terrible service--- YOU CAN DO BETTER IN ROME!", "Date": "May 29, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Warning about the Sixth Floor and bell staff”", "Author": "jls1", "ReviewID": "UR29305333", "Content": "An expedia booked room resulted in a room on the sixth floor for our Saturday arrival. This floor is no penthouse because with the roof terrace above we were kept awake until 130am by the dragging of tables and the wait staff running through the corridor with the dirty plates and washing in the small hours. A Fawlty Towers moment if there ever was one. We complained at the time, twice, and were promised it would stop. It didn't. We were moved to another room the next day without much apology or explanation, they clearly knew this is major problem, frankly though this floor should not be in use, or they need to think very carefully about the roof. Oh and the hotel arranged a taxi to the airport who refused to honour the mandated 40 eur trip fee, something we confirmed with the concierge. Hotel location is excellent and is an interesting building but given the lack of consideration they give to paying guests, you'd have to be very specific that you will not accept a room on the sixth floor.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Warfield", "Title": "“WoW! Stunning location if you can afford the price”", "Author": "Mickydot", "ReviewID": "UR28751147", "Content": "The Hotel Minerve used to be a Royal Palace and has a enviable position in the heart of this historic city, 30 seconds walk from the Pantheon, 2 minutes from the Spanish Steps and 5 from the Piazza Navonna. This really is the centre of the tourusts Rome, and the price charged by this hotel reflects this. The card on the back of my bedroom door informed me that my room cost 600euros per night, with breakfast 31 euros per person extra, bearing in mind that my room was smaller than my Son's bedroom at home, this is high end pricing. The decor and finishings of the hotel are of the highest standard, but you get the feeling that they have tried to get as many rooms as possible into this stylish ex-palace, rather than creating something you will return to again and again. You must go up to the rooftop terrace/bar/restaurant an hour or so before sundown and get terrific views of the city, but don't expect the same view from your room, most look out onto a wall a few metres away. Saying all this, if you can get this hotel at a good rate on line, and don't expect a palacial room, then the location has it.", "Date": "April 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“THE GRAND HOTEL DE LA MINERVE EXCEEDED OVER EXPECTATIONS”", "Author": "romansunshine", "ReviewID": "UR28669037", "Content": "It is probably one of the most well known Hotels in Rome. I have decided to book there for my Roman latest stay. I must say that reviews on this Hotel do not help. Nevertheless, I ended up booking there since I got a special deal. Then I thought I could compare history, other opinions and what is my perception and taste. Well, the Hotel Grand de la Minerve won my bet. The only way to get there is by cab, however you are in Rome, you are in the real touchable ancient centre of Rome. How breathtaking it is, no words over the feelings while staring around you. The Hotel, just partially refurbished, is magnificent in its early century building, famous Murano glasses all around the lobby, large spaces; traditional in its style as it should be due to the location. Last but not least, professional staff. It is definitely a full 5 star service Hotel.", "Date": "April 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Venice, Italy", "Title": "“Pleasant Atmosphere”", "Author": "anticorpo", "ReviewID": "UR24180688", "Content": "Beautiful property in a very fascinating spot in Rome. Our room was decently large and very quiet. Some parts of the rooms are renovated, other not so much. Overall, very good standard. Bed slighty too stiff. What we liked most was the quiet elegance ad the atmosphere in general. Responsive staff. A bit too expensive.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“Great location, but ....”", "Author": "BianchiNetherlands", "ReviewID": "UR23971675", "Content": "For me it's the same as the other reviewers: the location of this hotel is absolutely perfect. The staff at reception, the concierge and the doorman are very friendly. The lobby and breakfast area look nice. I didn't particularly like the breakfast: dry bread and too many sweet pastries. Paying EUR 25-31 for breakfast is outrageous. My room was huge, so was the bathroom. The shower was great. Lots of space for my stuff. But... the ceiling in the bathroom could do with a renovation and not only the ceiling in the bathroom, but also in the hallways. The wallpaper is torn and the carpet is dirty. The cleaning ladies were chatting away at 8:15 on Sunday morning, which is far too early. If your room is next to the elevators, ask another room because you won't sleep. The elevators are old = very noisy. I didn't pay for the room myself because I was here for business, I would have chosen a modern hotel.", "Date": "January 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "germany", "Title": "“Above average, but some problems”", "Author": "emmessduesseldorf", "ReviewID": "UR23489829", "Content": "Stayed there for a long weekend in January '09. First things first: the location is simply unbeatable! From our room we saw the pantheon; the busy via del corso and corso Vittorio Emmanuele were in walking distance and you could manage campo di fiori and the spanish steps by foot! The staff was very efficient, helpful (concierge gave excellent advise on restaurants) and too well meaning: the room was overheated. Unfortunately. the water pressure in the bathroom was quiet low (okay, so it was on the fifth floor) and there was no room in the bathroom to put your toiletries on. On the other hand, the beds were broad and the breakfast buffet had a lavish range.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Spain", "Title": "“Great hotel and great location”", "Author": "Asia2005", "ReviewID": "UR22908808", "Content": "We just came back from our long weekend in Rome and I have to recommend this hotel. The location is the best and the staff is very proffesional and kind. They sorted out all our questions and little problems we have with Iberia´s strike.The concierge(Marco) was always happy to help us and very proactive. The restaurant (La cesta) has a great chef and the breakfast is perfect!Very good quality products and lovely atmosphere. I recommend the romantic package. Merry Christmas!", "Date": "December 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Location, location, location”", "Author": "Getgerald", "ReviewID": "UR21409953", "Content": "You can not beat the location. 1 minutes to the Pantheon, 2 minutes to the Piazza Navonna etc. The hallway is just beautiful and best feature is the roof terrace. It is just amazing if you sit up there, overlook Rome, listen to the church bells and enjoy the scenario. Absolutely fantastic, but that's it. The rest is just the usual rip off in Rome. I do not want to be too negative.... the rooms are big and definitely need a thorough make over/renovation. Oh yes, I had a renovation but outside the hotel with some nice construction workers doing their job in front of my window. And again, I do not think that you should pay extra for WLAN....not in this category. Would I recommend this hotel? Yup, for business travellers and please have a drink of the roof terrace.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Good Hotel”", "Author": "tker48", "ReviewID": "UR20991665", "Content": "I found it to be above average. It is just a 30 sec walk to the Pantheon. You can easily walk every where from the hotel. The train station is about a ten minute cab ride. The room was not that big, but it had a nice view and was very clean. Half of the staff was really nice. They also have a good view from the top floor. Next time I go to Rome I will probably stay here again-just because of the location.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Washington", "Title": "“Definitely not worth the price!”", "Author": "travelqueen000", "ReviewID": "UR20831087", "Content": "If you are only interested in a good location, Grand Hotel de la Minerve is fine because it does have a terrific location just steps from the Pantheon. But if you want a good night's sleep, helpful and nice staff, good service, etc., this is not the place for you. Most rooms open onto the piazza which provides interesting views, but terrible noise. After our 1st night of basically no sleep from the noise, we asked to be moved to a higher floor to provide a buffer from the cars and scooter noise. The staff did not try to hide their impatience with this request, even rolling their eyes right in front of us, arguing with us and more than once telling us our request was impossible. When the staff see you in the hotel, rarely do they offer any greeting or smile, even after making eye contact. We knew others in the hotel who also experienced this bad behavior, dubbing them rude. Good luck asking for a non-smoking room. They have them, but right next door will likely be a smoking room that filters into your room. They desperately need non-smoking floors to help with that. And they also don't monitor those rooms so the guest before you could have been smoking in your room and they admitted to opening the windows and spraying fragrancers into the air when that happens. The sheets for the bed are so coarse that you have to stay in one position all night, otherwise risking a spa exfoliation that you weren't counting on. The beds sit very low to the floor (easier to see the stains on the floor) and the decor is too modern for the surrounding atmosphere. All of that for a high rate that is no where worth price! There are plenty of other hotels in that area -- research those!", "Date": "October 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Gorgeous Hotel, too bad about the scaffolding.”", "Author": "NYNYGIraffe", "ReviewID": "UR18319653", "Content": "Myself, my husband and our eight year old son stayed at the Grand Hotel de la Minerve for three nights this past July. It is a gorgeous hotel, and also very conveniently located. The service we received was very good. The concierges, in particular, were very helpful. We loved the rooftop terrace. We had drinks there every night before going out to dinner, and it was definitely one of the highlights of our stay. The location was great. Our eight year old son was very upset that breakfast was not included with our room. We tried it one morning, but I frankly felt that it was too expensive for what it was, given that there were plenty of cafes in the Piazza della Rotunda that offered perfectly fine deals on breakfast. He was not pleased. Another problem was that there was scaffolding on one side of the building. They did upgrade us, from the deluxe double room we had booked with expedia, to a junior suite with one window overlooking the Piazza della Minerva. However, my son's pull-out room was still totally dark because of the scaffolding on that side of the building. He did not want to have to stay there again on our last night in Italy, after our visit to Capri. So I cancelled our reservation, and instead booked us into a junior suite at the Duke Hotel for that one night. Expedia was offering a terrific rate. Location was no longer an issue, as we were flying out the next morning. (We had a lovely experience at the Duke Hotel. The room was light and very comfortable, and the buffet breakfast was one of the best we had on our entire trip to Italy. We felt very well taken care of there. My son loved it.) We plan to return to Rome next summer. If the scaffolding is down, which one assumes it will be by then, we will maybe again stay at the Grand Hotel de la Minerve. My husband loved it there. He is an architect and was extremely impressed by the physical beauty of this historic building, which has been a hotel since the 19th Century. He was particularly awed by the ceiling heights in our two small rooms. (I may also check out rates on the Albergo del Senato, however, in order to satisfy my son's request for an included breakfast. He loves buffets. My husband does not wish to return to the Duke Hotel because of the location.) Anyone planning to stay at the Grand Hotel della Minerve this summer should call and find out about that scaffolding. If it is still up, make sure you have been assigned to a room that looks out onto the Piazza della Minerva, and not onto the side street.", "Date": "July 27, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "LONDON", "Title": "“Not up to 5 stars”", "Author": "PERRY8", "ReviewID": "UR17863489", "Content": "We stayed in the hotel for 3 nights. The location is really fantastic. Our room was lovely, spacious and clean. It had lovely views.The restaurant on the roof is wonderful, great setting and great food. Unfortunately we found that the hotel staff, apart from the concierge, were really unfriendly. Not up to the level of service you expect in a hotel classed as luxury. They all seemed that hey could not care less about their clients. The doorman in 4 days has not said a word to us, not once has he said hello or enquired about our day. He was completely ignoring anyone walking in or out of the hotel. The front desk staff is not any friendlier, they hardly say hello or smile. When we checked out no one asked wether we had a good stay and if we were happy with the hotel. A few smiles and a little small talk would have made all the difference. This was certainly not up to 5 stars.", "Date": "July 14, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "west Yrorksire", "Title": "“Great Location and room - food and drink expensive”", "Author": "GOLFERS8", "ReviewID": "UR15757435", "Content": "This was a birthday specila treat - the location could not be bettered - the superior room with fantastic view was all you could ask for. However, we paid the equivalent of £17 for two small beers on the roof top restaurant (with a bowl of peanuts). The breakfast was adequate, but the restaurant evening meal prices were out of the queston - we ate in local tavernas and bars. Jon Shepherd - West Yorkshire", "Date": "May 7, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ireland", "Title": "“Excellent hotel!”", "Author": "Nonameprovided", "ReviewID": "UR15649519", "Content": "We stayed in the Grand Hotel de la Minerve for 3 nights, the hotel was excellent, the rooms were lovely and very quiet at night. Staff very friendly and helpful and the concierge was fantastic in helping us to book into local restaurants. All of the main sightseeing sites are minutes away - the Pantheon is literally on the doorstep of the hotel. We walked everywhere and only got taxis to and from the airport. While the food was excellent, the only downside we experienced was the cost of lunch in the hotel's roof garden. We ate there just after we checked in (on recommendation from the reception desk) and found it extremely expensive in comparison to everywhere else we ate in Rome after that. There are so many great restaurants nearby, I would recommend eating outside of the hotel! Other than that, as other reviewers have said, I would recommend this hotel to anyone travelling to Rome. It is an excellent hotel and you can't beat the location!", "Date": "May 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Location, Mediocre Hotel- Read This”", "Author": "sockster", "ReviewID": "UR15592774", "Content": "This hotel bills itself a five star hotel. It simply is NOT. In a fantastic location near everything, this is a hotel with an atitiude...and not a very good one at that. It seems that they do you a favor giving you a room! The rooms are very small, and we stayed in a Jr. Suite!! The bathrooms are clean and adequate. Food in the hotel is a total ripoff...even if you pay in Euros. I mean 15 Euro for a cocktail? Or 22 Euro for an appetizer portion of pasta...or my favorite from the room service menu, a club sandwich at 27 Euro and Ice cream for 20, bringing the total to 47 Euro or (at $1.60 to the dollar), about $70!! And don't forget if you eat breakfast in the hotel is E25 ($40.00) Amazing. The view from the roof is incredible and like I said before, the location is just fantastic. We would recommend having a coffee at St Estacio (two blocks away), which serves the best coffee in Rome. And it's only 3 Euro. IF you need to stay in a real five star hotel, look elsewhere!! If you don't mind small rooms and a bit of an atitude, do stay here...Very disappointing!!", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Loved this Hotel”", "Author": "luvtotravel100", "ReviewID": "UR14272076", "Content": "The Hotel Grand De La Minerva is in the heart of Rome. Rome is a lot like NYC you want to pay more for being in the middle of it all. This hotel is steps from the Pantheon ( which is the best place to hang out at night) minutes from The Trevi fountain, Piazza Navona and 10 minutes walking to the Coloseum, Forum, Capitol, Theater Marcello etc. Taxi's are hard to find, and you want to be anle to stroll around the city without wondering how you are going to get back to your hotel. This Hotel is not only centrally located, but the lobby is beautiful their breakfast is the best I've had in Italy by far and there staff is polite and very accommodating. I have stayed in hotels in the city center and on the outskirts. This by far is the best! I highly recommend it.", "Date": "March 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington", "Title": "“Heaven in Rome”", "Author": "LillyWashington", "ReviewID": "UR12737659", "Content": "This was a beautiful hotel with a fabulous location. Our room was 1 category above the standard room but it was extremely spacious, and well appointed. We had a room facing the courtyard overlooking the Pantheon only steps away. The windows actually open and you can soak up the night life if you like but it was not noisey. The bathroom was luxurious and had every conceiveable amenity. The hotel sent a welcome bottle of wine and biscotti as a nice touch. The service was refined and attentive. It was a truly memorable experience, one of the finest hotels I have stayed in.", "Date": "January 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena", "Title": "“Absolutely Perfect!”", "Author": "turntime", "ReviewID": "UR12436367", "Content": "My husband and I stayed at the Grand Hotel de la Minerve 4 nights in Rome and had a magnificent time. Although the hotel is beautifully decorated and the staff superb, the absolute best thing about this hotel is location, location, location!. Our window literally looked out onto the Pantheon, there were little pizza and gelato shops steps away, and we were a very short walk from the Trevi Fountain and Piazza Navona. The room was spacious and nicely equipped and the restaurant served delicious food. We highly recommend this hotel, even if just for the location alone. Can't wait to go back!", "Date": "January 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Minerve- Wandering Brit”", "Author": "First_Wandering_Brit", "ReviewID": "UR10970457", "Content": "This was the second time I have stayed at this hotel. Both times I had really large comfortable rooms. So the rooms are great. The bar is good and the food is ok (probably not 5 star but certainly 4-ish). The service is really good without being stuffy or too international. But what makes this hotel such a good place to stay is its location. All the major tourist sights are within walking distance; you are really in a great central location (you can see the Parthenon from front windows which I think is fun) and yet the hotel is peaceful and you aren't woken at stupidly early hours by any City bustle.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Honeymoon in Rome”", "Author": "charles18050", "ReviewID": "UR10449863", "Content": "All, This hotel is, overall, great value and a fabulous location. Its only a couple of steps to the Pantheon and the wondeful Piazza Navona etc. You really couldn't wish for a more central spot. The roof terrace (excellent view) and food is fabulous. Its pricey-ish, but not shocking for the clientele who'll stay here. Quality is very good. The room was clean, large and functional. The bath was the longest I've ever seen !! Minor moans are the lack of variety of the tv channels and the rather \"sniffy\" front desk staff. But hey, these are small distractions to an otherwise enjoyable experience. Recommended.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Over priced and over rated”", "Author": "robbieruadh", "ReviewID": "UR10432101", "Content": "We stayed four nights at La Minerve in late October 2007. Having decided on a last minute trip a week before, we had little choice in hotel and paid the full rate of £320 per night for a superior room, bed & breakfast - a pretty hefty rate for any hotel in Britain. The room was a good size for city centre but not anything to write home about. The first night all the lights fused around midnight and we had to wait until 4 am before we were able to get the night porter to fix things. The young lady at the front desk seemed put out when we complained the next day - even more so when we commented that the night porter said that this frequently happened in that room. We asked for a change and were offered even smaller rooms. Eventually we moved to another equivalent room. In the evening we received an unexpected bottle of wine from the management as an apology. Internet access is charged at £5.00 per half hour!!! All in all, this kind of service and provision for this rate is basically a bit of a rip off. Great location if you feel like burning money!!", "Date": "October 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Let's be honest”", "Author": "SergeAx", "ReviewID": "UR10414085", "Content": "Let's just be honest with ourselves: this is the only hotel of this class in that location, period. More to say: it's very hard to find а 5-star hotel in Rome with this price tag. So everyone who tries to compare it with 5-stars in South Asia or US are just unaware of the overall Rome hotels landscape. You may complain about breakfasts - or you can just have your own breakfast out on a nearest Piazza della Rotonda under the morning sun. You may dislike worn carpets or \"simple\" bathrooms or elevators - or think about an almost 3 centuries history of this place. You may play trouble with taxi - or just be awared of Rome traffic and holidays' roads closures. But you have to understand that you either live that near to every sigle attraction with that level of comfort at that price, or give up. Go on, try some 2-star places around and then come back and write a review :) By the way, the staff was very helpful, and the roof restaurant is just great.", "Date": "October 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great location, great hotel”", "Author": "WBBatlanta", "ReviewID": "UR10021544", "Content": "We just got back from 3 nights at the Minerve, and found it to be a wonderful hotel. Our room, though not huge, was very nice and had a fairly large courtyard overlooking the glass roof of the lobby. We had a package that included dinner at the rooftop restaurant, which was very good and the views can't be beat. The location of the hotel is absolutely ideal -- we walked everywhere, from the Pantheon next door to the Colleseum and Forum, to the Spanish Steps and Treve Fountain; we even walked back from the Vatican and the Borghese museum. The concierge was extremely helpful -- got us a guide for the vatican (which allowed us to avoid the longest line I've ever seen), tickets to the Borghese, train tickets for our next stop in Florence, in addition to taxis, etc. We will stay at the Minerve on our next trip.", "Date": "September 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Terrific Choice - No downside”", "Author": "parveen50", "ReviewID": "UR8722223", "Content": "Stayed for 5 nights at Minerve in early August. Hotel was in the BEST location - 1 block behind Pantheon. Walking distance to everything. The area is basically all pedestrian and very lively and safe at night. I was there with my kids, aged 4 and 11 - and felt safe Staff all spoke some English - they were very helpful - from the chambermaid who helped when my son locked his key in a drawer - to the concierge who ordered taxis for us. Only flaw was that the maids forgot to clean our room one day - but that was fixed with a quick phone call. I wanted to stay near the Pantheon because of the location - and thought about Albergo del Senato - but in the end, I booked through skoosh.com - and the rate I was quoted was only 30 Euros more per night than the Senato - so I went with the 5 star. By the way - I can't say enough good things about skoosh.com. They are a british travel website - and were terrific because they actually answer the phone when you call..! The room itself was very spacious - and spotless. The breakfast was terrific - cereals, pastires, croissonts, etc. coffee and tea - and eggs, bacon, toast, etc. It was totally first class!! I would definitely stay there again! Also - we booked airport transportation through \"romeshuttlelimousine.com\" - They were wonderful - very efficient, courteous drivers who arrived early!!!!", "Date": "September 16, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NI", "Title": "“Very enjoyable”", "Author": "steamroller1980", "ReviewID": "UR8378042", "Content": "Good hotel. spacious rooms, large beds nice foyer. Right behind panethon close to large number of restaurants. turn right and right again for internet cafe Trevi fountain, spanish steps are within walking distance. Colusseum within half an hour walk, vatican about 5 euros in taxi but still walkable. Taxi to hotel from airport 30-40 euro. Taxi to train station 10 euro. The best ice cream shop in the world close by called della palma and the 2 best coffee shops in rome are in the piazza sant eustacchio according to roman people. very good would recommend hotel to anyone", "Date": "August 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Pole, Alaska", "Title": "“True Grand Hotel on excellent location”", "Author": "MOZBOB", "ReviewID": "UR8126491", "Content": "This hotel breathes the atmosphere of true grand old lady as soon as you enter the lobby. Front desk staff is very efficient and check-in is done within a few minutes. The rooms have a good size and are furnished traditionally with a very spacious bathroom. Everything appeared clean and the rooms had everything you would expect from a 5-star hotel in Rome. As soon as you leave the hotel you are in the center of everything, right next to the Pantheon and close to Piazza Navona. Everything from the hotel is in reasonable walking distance, which makes this a perfect location. The Vatican is a 15 to 20 minute stroll, Via Condotti and the Colosseum are probably about 20 – 30 minutes walk away. We would recommend this hotel without hesitation and also go back when in Rome again. I can’t comment on the breakfast, as we did not have breakfast in the hotel. We decided to simply have a croissant and coffee somewhere on a terrace, so that we keep room for a nice Italian lunch. PS: For transportation we used romecabs.com (booked directly via email) and everything was perfect: good cars, english speaking drivers and promptly on time", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan Capistrano CA", "Title": "“Location and Service at a Price”", "Author": "Livinit", "ReviewID": "UR8068242", "Content": "We stayed for 1 week. Great location and nice view of the Plaza Minerve. Could not keep the windows open at night, because the street sweepers come every night (tourist area) and they are very Loud. Service was good. This is not a large hotel, it is fairly small and quaint. Gym was very small, the delux room we had was large for european standards. If I had to stay again, I would not stay in this hotel for a week, a few days would have been better. And then I would have stayed on the coast somewhere. This is a very expensive hotel, and you pay for the location which is a very \"touista\" area that gets old after while.", "Date": "July 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Valley, New Jersey", "Title": "“Location, Location, Location!”", "Author": "strengthcoach", "ReviewID": "UR7552987", "Content": "I just returned from Rome, having stayed at the “Hotel Grand Minerve”. We stayed for 6 nights, in room 459. Our travel party consisted of me, my wife, our 5 year old, and 11 month old. Hotel: Location, Location, Location. We visited Rome for the first time, so we were unsure as to the distance between the sites. We picked this hotel primarily because of its location, and for the size of the room that we could book. The location is incredible. As mentioned before, the hotel sits about 50 yards from the Pantheon, on a relatively quiet piazza. We were able to see much of “tourist” Rome without ever taking a taxi. From the Bourghese Park above Spanish Steps, down past the Collesium and across the river to the Vatican and Trastevere, we walked everywhere. The hotel map was more than sufficient to navigate everything. The actual room was about what we thought it would be. It was a “king” bed – two beds really just pushed together – along with a sitting room with a pull-out queen bed. Mornings were fabulous out on the deck – we had a deck with a table, 4 chairs, and two chaise lounges. Not many of the rooms had this feature, but it was worth it! The bathroom was OK, but they use shower curtains instead of glass doors. Bathroom was of adequate size. Did not watch TV (although there were 2 flat screens) or use the mini bar or room service…We did eat at the $30 euro buffet several times – it’s not easy getting two small kids out to eat early; for us the convenience was worth it. Also, the hostess never charged us for our kids, so it really wasn’t that bad… Service was good. Restaurant service was good, and pleasant. Lots of interaction with the kids. Concierge was also good, and did a decent job of recommending restaurants (more on that later). They took care of the “little” things, like weather reports, having the hotel umbrellas ready, etc. Is the property a little worn? Certainly. However, it looked in better shape than most others that we looked at while there. Quite frankly, there wasn’t much in Rome that wasn’t a little worn (more on that later too). Would we stay there again? If we had to stay in the center of Rome, we would. The central location is that important to us. However, if we return to Rome, we might try to stay further away from Rome’s center, to avoid some of the more “touristy” things going on… The City: Sorry Rome. The first thing that comes to mind is filthy,filthy,filthy. Rome was a giant ashtray with trash strewn about. I understand that the eternal city is old. I understand that soot and ash from cars and trucks will happen. What I don’t understand is the apparent lack of pride that many Italians have in their beautiful city. Everywhere we walked, we were literally stepping over dozens of cigarette butts, old newspapers, and various food wrappers. My 5 year old kept wondering why people were throwing the trash on the street and on the parks! Tourists, I’m sure, are responsible for some of this, but Rome needs to do a better job of cleaning itself up. Food:Surprisingly poor in the center of Rome. ( With the exception of gelato. That was usually good) We mistakingly were under the impression that any corner trattoria would have great food. (Previously, we took 3 trips to the UK, and had a hard time NOT finding a good meal). The center of Rome had many, many, lousy (how can Italians get pasta wrong?) restaurants, with service to match. In our first 7 meals in Rome, our order was wrong on the bill, with each restaurant trying to put things on the check that we did not have! In addition, some of my favorite tricks were 1. Seating charge. (yes, charging you to actually sit and eat) 2. Bread charge – per person.(ex. “bread, 2 Euro” means 2 Euro PER PERSON) 3. Charge regular price for things that are modified. (ex. – our son wanted a non-alcoholic drink at Harry’s. The regular price (with alcohol) was 14.50 Euros. We ordered a non-alcoholic version, and were still charged 14.50 Euros!. We then ordered (at Harry’s) a small plate (saucer size) of pasta – plain – no sauce, oil, butter – nothing – and were charged full price for a shrimp pasta special – 38 Euros! Then, of course, they tried to charge us for something else that we did not order…) That lunch at Harry’s did us in. We decided to only walk outside the center – down to Trastevere – or get specific recommendations from the Concierge. The meals instantly got better, and we finished the trip with several excellent meals. Sites: There are too many to mention. We were not disappointed by any sites or churches. Just alot yourself (as we luckily did) a great deal of time for the Vatican museums and the Collesium. Other: We chose not to bring a stroller to Rome because we thought the streets might not be paved well for them. We were right. Go with a back carrier or a wrap. You’ll get quite a workout as well!", "Date": "May 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, W3, UK", "Title": "“Charming and impressive, but probably a 4*”", "Author": "Lazzer", "ReviewID": "UR7238055", "Content": "This hotel is in a great location (just moments from the Pantheon and lots of interesting little shops and great places to eat) and the staff were very friendly and helpful. We had booked 2 rooms - one for someone in a wheelchair. The 'disabled' room was bigger but apart from that no different (no raised toilet seat, no walk in shower etc) so beware if you are a wheelchair user. There is lift access and helpful staff though. The hotel is impressive - large and beautiful, if a little dated. We didn't choose to eat or drink there but might have done if the rooftop terrace had been open (though again I don't think there is direct access other than walking up the last flight of steps to the top so again not as accessible as it could be for all). The rooms were very clean, and quiet (we stayed at the back) and large. Lovely large bathtowels and big bath and shower. The bed was nice and firm and possibly a queen. The staff always called a taxi for us when we needed and were generally helpful. It is quite expensive for what you get but a great location -and we did bump into Douglas Hurd in the lift - scary!!", "Date": "March 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect location”", "Author": "Scrapster", "ReviewID": "UR7190548", "Content": "Myself, my husband and several work colleagues and their partners were treated to a weekend in Rome by work! All the reviews are correct. It is a little old fashioned in parts and very expensive. 20 Euros for a large Ammaretto! Would I pay with my own money to stay here, yes probably for the location but I am sure there are slightly more reasonable places to stay in the centre of Rome.", "Date": "March 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Royal Experience in Roma”", "Author": "MyEnzo1", "ReviewID": "UR6540675", "Content": "Our stay at the Grand Hotel La Minerve in Rome was a wonderful experience. The staff was friendly, helpful and went the extra mile for you. We received a quote by phone and they confirmed it by email. They followed through on the price and location of the room just as promised. We arrived at the hotel at about 9:00 AM and by 11:00 AM were in our room taking a shower! The size of the room, bathroom and facilities were tremendous for a European hotel. A great value on all ends. The location at Piazza del Minerve was ideal as it is in the center of Rome. I highly recommend this hotel. There is not a bad thing I can say. Bravo to the staff! Janine New York", "Date": "January 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lakeville,mn", "Title": "“Great Location with a Beautiful Room and View”", "Author": "harryandnina", "ReviewID": "UR5884555", "Content": "My wife and I just returned from a cruise of the Italian Riviera and a 3 night stay in Rome. We were celebrating our 35th wedding anniversary and wanted the trip to be memorable. We spent months planning this trip and found the reviews that were posted on Trip Advisor to be very helpful. We selected the Grand Hotel de la Minerve because of its location and the reviews that we read on this site played a role in our decision. We were not disappointed in our selection. This hotel is walking distance from all the sites we wanted to see and allowed us to enjoy Rome on our own by just walking and taking in the sites and the people and their way of living. We arrived at the hotel early and the room we had requested was not ready and would not be ready for several hours. We left our luggage with the consierge and headed out for some sight seeing and lunch. You don't have to go far from the hotel to begin to experience the sites and the history of this fabulous city. The Panthenon is a block away from the hotel with its beautiful fountain and busy Piazza. Just outside the Hotel entrance is a beautiful church with a statue by Michelangelo inside. After a few hours of taking in the sights and fantastic lunch at a local trattoria we returned to the hotel to find that our room was still not ready. This was because we had requested a particular room and the people were late checking out. It was worth the wait! We requested Room 530 based on information we had read from another reviewer on this site. We were not disappointed. The room was a large suite with a great view of the Piazza de la Minerve. By any standards this was a spacious room and for what we have seen in hotels in Rome it was HUGE! This room is right next to the elevator but do not let this stop you from requesting this room. We were never bothered. My wife loved the big walk-in closet and the large bathroom with Jacuzzi tub. The only complaint we had was the mattress was hard as a rock and did not live up to the rest of the room. It was bearable only because we did so much walking during the day that we were exhausted when we got back to the room and could have slept on the floor and still fallen asleep! We cannot comment on the food at the hotel because we never ate there. You cannot go more than block or two without running into a variety of different restaurants, In addition the prices at the hotel restaurant were 10 times higher than what you could find just by walking down the street. The staff at the hotel was attentive and helpful, but this is what you should expect at a 5 star hotel. The hotel offered a breakfast buffet each morning for 30 euro each! We walked about 10 minutes away and found a great little place for a cappuccino and homemade pastry for two for 8 euro. You can also walk to the Cafe St Eustachio in the Piazza St Eustachio which has the reputation for the best expresso in all of Rome. It was OK but I don't know if I would call it the best. Overall we were very satisfied with our experience at this hotel and would return and stay there again. The location is fantastic and you pay the price for it. The service was excellent and the room fantastic. If you ask for Room 530 I do not think you will be disappointed. If you decide to stay in Rome get yourself some comfortable walking shoes, a good map and head off to experience this fantastic city and its ancient history. The city, the shopping, the people and the food are truly memorable.", "Date": "September 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New Orleans, LA", "Title": "“Clean Hotel, Great Location”", "Author": "SisiWortham", "ReviewID": "UR5433623", "Content": "We stayed at the Grand Hotel de la Minerve in June 2006. We had superior double room and a deluxe double room (which was the bigger room of the two we had). The rooms were clean and well appointed. They are fairly modern, and do not have an \"old world\" feel. They were streamlined with clean lines. The bathroom in the deluxe double room was much smaller than the bathroom in our superior double (the smaller room). The rooms and bathrooms are not luxurious, but they are clean. I would have expected a little more for what we spent on the rooms (over 400 and 500 euros a night!). The location is right next to the Pantheon, which is great. It took us about 10 minutes to walk to the Forum and a few minutes past that is the Colosseum. The Piazza Navona is only about 10 minutes away as well. The hotel staff was helpful in arranging our transportation, dinner reservations and tour guides. But, our tour guide was not the best. He was very hard to hear and not very interesting. The roof of the hotel has a great view of the city. We did not eat there, but you have to go see the view if you stay here.", "Date": "July 6, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Providenciales", "Title": "“Unsure...”", "Author": "TheTravelingTaxman", "ReviewID": "UR5421275", "Content": "I stayed at the Grand Hotel de la Minerve in June 2006, for the business part (i.e. expense account!!!) of a trip to Rome. On the other nights I stayed at the Hotel Astrid (see review) and the Rome Hilton (see review). The Grand Hotel is unbelievably well located, literrally one minute away from the Pantheon. This is its greatest asset, of course. The staff was generally pleasant if a little snobbish, as you would expect from a grand luxury hotel. The rooftop terrace was nice also. The meeting rooms were more than adequate for the 40 or so people that we had in there. For the price (385euros/night double, 305euros/night single) the room was somewhat of a disappointment. Average in size, with a decent bathroom, they were very \"plain\" and didn't have anything unique. They were however functional and clean. For that kind of money, however, I would have expected to be \"wowed\".", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Best Hotel!!!”", "Author": "Cristab", "ReviewID": "UR5327208", "Content": "My husband and I stayed at this wonderful Hotel for 3 night before visiting Siena and Florence. We loved this Hotel!! This was the best we encountered on our travels through Rome. I would highly recommend this to anyone! WONDERFUL location!! The staff was very friendly and the area was by far the best. The rooftop bar and restaurant is amazing with the best views of the city The room was a Double delux room with king bed and had lots of room and was very clean. I read other reviews about the beds being horrible but we did not find that to be a problem. The beds in Europe are just different from the US and anyone who has traveled through Europe would know that!! Anyways...LOVED LOVED LOVED The Minerve!!", "Date": "June 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“The Best Location”", "Author": "SusanVM", "ReviewID": "UR5237064", "Content": "As many people have noted, this location is just the best. We first had a room that looked out on the piazza and the back of the Pantheon is right THERE! We were able to walk everywhere. There is an interesting issue in Rome which I was not aware of before this stay. Our room overlooking the piazza was very noisy at night..there is a lot of activity on that piazza. When we closed the windows the room became very warm. The front desk said that they were not allowed to turn on the air conditioning until June!! They said it is this way all over Rome. They said we could relocate to a room facing an interior courtyard or they would bring a fan. We decided to change rooms and this worked out much better for us. We did love that view on the piazza, but we loved getting a good night sleep better. The other issue is that there was no breakfast included with the room and it would have been quite expensive to add....I think it was something like 20E per person. We did know this coming in and were prepared to go out.....a very good coffee place St. Eustachio's very nearby. Our tour guide said it was one of the best coffee places in Rome. I was very happy with our stay and would stay again....in an interior room....unless it was air-conditioning season:)", "Date": "May 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“reservation system not reliable, be aware!!”", "Author": "ILCAPITANOFELICE", "ReviewID": "UR4394839", "Content": "After reading the reviews on this site, I booked three nights at this hotel as a treat for my wife. It was a wonderful hotel and even in winter, for breakfast was no problem at all. The location is so convenient and I had no problem in using the concierge service for informations. Everything was as easy as possible. When leaving, the concierge at the booked our taxi, arranged to have our luggage loaded and called us when it was all ready - to escort us to the taxi. This level of service at those prices was truly excellent. My one small gripe (and this will stop me going back) is that when we arrived, I found out that there were two reservations on my name and before leaving the hotel I was asked to pay for one extra night as non-show penalty (250 euros ). Humiliating and annoying for me. I made the reservation throughout hotel-invest but when i tried to amend the reservation the system generated two reservations. The hotel-invest , along with the Hotel Minerva certainly not send an emal to verify the “doubtful” double booking. In this \"five\" star Hotel the computer come before the guest, seemingly the reception of the hotel have no authority to cancel or sort erroneous bookings.", "Date": "January 29, 2006"}, {"Ratings": {"Overall": "5.0", "Rooms": "5"}, "AuthorLocation": "Potomac, Maryland", "Title": "“Can not be better”", "Author": "A TripAdvisor Member", "ReviewID": "UR4251838", "Content": "We spent our Thanksgiving 2005 in this hotel. The location, environment, and members are definitely excellent. In comparison with the top of line hotels in London and Paris, Hotel Minerve is just simple outstanding. What else? There is a small pizza restaurant 100 feet from our hotel and along the east side of Pantheon. Their pizza is the best that we had in Rome.", "Date": "December 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "5"}, "AuthorLocation": "ireland", "Title": "“honeymoon in rome-dont eat in the roof top restaurant!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4093974", "Content": "My fiance and I stayed here for 6 nights in november . The suite was fantastic. The dinner in the dining room was excellent but the first night was spoilt.The roof terrace has a wondeful view but the maitre d was extremely rude.Did not eat in the hotel after the first night. walking distance form all the main sites in rome-no need for a cab.", "Date": "November 8, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Great location but.......”", "Author": "dwinpenn", "ReviewID": "UR4031183", "Content": "The Grand Hotel De La Minerve is in one of the best locations you could possibily get in Rome - next door to the Pantheon within easy walking distance of most of the interesting sites in Rome. BUT, the hotel does itself have some issues. We arrived on a Saturday evening to stay for 1 week - the hotel did NOT have a reservation for us. When they checked it appeared that the reservation was recieved but NOT actioned. We were placed in another (lower class) room and the best offer we got was free breakfast. When we finally got to our real room on Sunday it was next to the Service area for the 4th floor (we were in 443!) and all night and day there was banging and crashing as people worked in the service area. The roof top restaurant is a fantastic location for a romantic dinner but the menu within the hotel is very limited. Staying for 1 week means that you will have easily exhausted the menu - in fact, it was so limited that we could only eat in the restaurant 2 times. Staff at the hotel are very helpful although do need to be pushed when there are issues aka no room reservation, to come a solution. Would we stay there again? Maybe, but certainly with a more detailed check of what room we would be placed in.", "Date": "October 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Duluth, Ga", "Title": "“We Loved Grand Hotel De La Minerve and Location!”", "Author": "italianwantobe", "ReviewID": "UR4016395", "Content": "My 12 year old daughter and a group of other mother/daughters stayed at the Minerve for three nights in July. We had such a wonderful experience. We had a wonderful package that included breakfast as well as a fabulous 3 course dinner on their roof-top restaurant. The food, service and view was incredible. I was not prepared to love Rome as much as I did. I'm sure much of it had to do with having a wonderfully spacious room to kick back in. We loved the Location. We walked most places but also took cabs to save some time. One plus was also a drawback with the location. Since we were a large group (about 20) we had a large coach between cities, the streets around the Minerve are very narrow (quaint) and it was impossible to get our bus to the front of the hotel. The front desk did not inform us of this problem prior to our arrival. The evening that we arrived it was very chaotic trying to arrange our own transportation from the train station where our bus had to drop us off. Fortunatley things worked out and we were able to manage our own transportation to the hotel. (on the last day of a city wide taxi strike!) Our room on the 4th floor overlooked the back of the Pantheon and a quaint courtyard. Our room was very clean and well appointed. Our maid was the sweetest woman. The bellmen were very warm and the concierge bent over backwards to help accomodate our American hair appliances.(Important when travelling with daughters!) The one area that could use improvement is the front desk. They definitely did not posess the same gracious manor as the rest of the staff. That said we would still recommend and stay at this hotel again!", "Date": "October 12, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "3"}, "AuthorLocation": "kansas city, mo", "Title": "“not worth the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3994036", "Content": "this hotel has a great location, but it stops there. the service is not up to standards. the front desk does not care and good luck getting a bell hop to take your bags. the front desk knows you are a tourist so they just want you in and out. when i was there, the air conditioning in my room was not working, it took 3 trips to try and getit fixed and it still didnt work. they did nothing for me , other than to say , oh we will check into it. can you imagine this happening at a hotel in the us that charges $400 per night. i dont think so.", "Date": "October 5, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "oklahoma city", "Title": "“Wonderful hotel/perfect location, other Rome tips”", "Author": "kaceevh", "ReviewID": "UR3929241", "Content": "Just returned from Rome on 9/18/05. The Minerve is an outstanding hotel, 5 star staff - reception desk, concierge, and bell staff all included - and I'm very picky about hotels. We booked a deluxe queen room for fear of the tiny rooms we had heard about in Europe - it was a suite! All one big room, but suite non-the-less, with king size bed (not a queen), and the entry hallway and closet provided nice insulation against elevator noise - we never heard it and we were right next to it. Windows also shut tightly and completely eliminated street noise at night - individual A/C thermostat in room, so we stayed nice and cool. The deluxe rooms are huge, with nice sized bathroom, all marble, and jacuzzi tub (which was so wonderful after all-day walking). We were in room 530, looking out over the Piazza de Minerva and had a nice view of the Pantheon. Right next door is a beautiful Catholic church (Santa Maria Sopra Minerva) with amazing art and a statue by Michaelangelo (Masses at 8am & 6pm). The rooftop restaurant, Le Cesta, is lovely with great views of the city. We opted for a package that turned out to be quite economical - deluxe room, breakfast each morning (choice of full American buffet downstairs or continental in your room), and one 3 course dinner for two at Le Cesta, for about 495 euros a night. Also a \"welcome drink\" at the lobby bar, but not your choice of drink; sparkling wine or soft drink, although they let me have an espresso instead. Package price sounds high, but not for this particular room, and breakfast would have run us 31 euros per person if we'd payed separately, plus the lovely dinner (4-5 star) we enjoyed on the rooftop would've easily cost us 300USD. Tips: Don't buy water or drinks at the little outdoor stands; there's a supermarket off the Piazza Rotunda (Via Gustnani, I think?) and the deluxe rooms have mini-friges. Long lines at the supermarket, but they move fast. There's also a wine shop with great prices on the street that runs between the hotel and the church - 31 euros for a bottle of my favorite super tuscan that costs $60 at home, and a 9 euro bottle that was also quite good. We ended up enjoying a late breakfast (buffet serves til 10:30am) and not being hungry at lunchtime, so we just kept site-seeing til dinner. You can eat a casual dinner for as little as 5 euros for pizza for two at a little Pizzeria around the corner toward the Pantheon (wonderful!). I don't recommend any of the outdoor cafes on the major piazzas close to the hotel for a nicer dinner - pricey and not great quality. But step around the corner from any of the piazzas and find authentic Italian (house wines are excellent!) for the same price or less. Try one on the street (they're more like alleys than streets) that leads from the north end of the Piazza Navonna to the Trevi Fountain - it has a walkway of flat paving stones set in the middle of the cobblestones; we called it the \"yellow brick road\" becauase it's so easy to follow and leads straight to the Trevi. Best authentic Italian dinners for best prices are in Trastavere (full dinner for 3, with wine, for 43 euros), an area that seemed to be as populated with Italians as with tourists. Shopping was better on Via Cola de Rienze (out by the Vatican, just east of museum) than on the pricey streets like the Via Corso, Condotti, and the designer shops on the Vitorio Veneto. The Cola de Rienze shops seemed to be more frequented by the locals and had excellent quality clothing and other items. After shopping, try taking the boat taxi (1 euro per person!) from Pont Castel Sant Angelo (dock is opposite of river from the Castle) down the river to Trastavere for dinner. Great cafes all around the Santa Maria en Trastavere church, or cross the river and check out the fresh market in Campo di Fiori, then stop in at one of the cafes on that piazza - La Carbonara is right on the piazza and is great with reasonable prices. Also, the fresh fruit is Rome in beyond compare to anything in the U.S. - grown just 30 min. outside the city and picked at the peak of ripeness. Wonderful city, fantastic hotel, wonderful sites, great food - just bring well-worn-in walking shoes, cause the metros are useless (not like Paris; too few trains, not enough stops, and never seem to go where you want to go)and the buses are crowded. Rome is very compact; we walked from the hotel to the Vatican and from the hotel to the Colosseum/Forum - it is never as far as it looks on the map. Plus with all that walking, you can eat anything you want and never gain an ounce!", "Date": "September 21, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Loved the hotel and its surroudings”", "Author": "A TripAdvisor Member", "ReviewID": "UR3730695", "Content": "We picked the Hotel based on our travel agent and trip advisor. It was wonderful. It is kind of pricey with the exchange rate, but to roll out of the front door and see the back of the Pantheon cannot be beat. EVeryone was very helpful, especially the doorman, who spoke to my husband's aunt who lives in Rome for us since our Italian is poor. The rooms have got to be some of the biggest in Europe. I was really impressed. THe only downfall was that there was no breakfast included as in some of the reviews. That was ok in our book becuase there are plenty of coffee bars nearby where you can get some cappucino and a pastry.", "Date": "August 2, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Blackpool", "Title": "“Good location..but have stayed in better hotels”", "Author": "CanastaHotel", "ReviewID": "UR3659701", "Content": "At 300 gbp per night I was expecting something a bit more than I got. OK...we had a suite with a private patio (which had broken plastic furniture by the way). The room was...OK....I have stayed in a suite in Bangkok for 50gbp per night that was ten times better than this (yeah OK Bangkok is a lot cheaper than Rome but...the room was like being in a palace) The concierge was surly and unhelpful...I just didn't feel comfortable...or at least not as comfortable as I should have felt for 350gbp per night...let's face it...I should have been treated like a freaking king for that!! But never got a good morning from anybody. Getting a smile out of the staff was hard enough. Didn't try the breakfast at 30 euros each sounded a bit too much - went to nearby square for fresh fruit brekkie every day. Tried the restaurant one night - meal was FANTASTIC and the staff theremuch more amenable. The hotel is well situated for anywhere...it must be the perfect location. Would I go back there - not after way I was treated.", "Date": "July 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Johnson City, Tennessee", "Title": "“Spectacular surprise”", "Author": "TravelingLibraryLady", "ReviewID": "UR3604073", "Content": "My husband, 17-year-old daughter, and I just returned from an 11-day tour of Italy with one of the major tour companies. Our group was originally scheduled to stay at the Crowne Plaza but was moved to this hotel because of overbooking. We couldn't have been more pleased. Like so many of the hotels in Italy, this one isn't that impressive on the outside, but, unlike many of the others, it is just gorgeous on the inside. The three of us were amazed to find ourselves in a large suite. We had two fullsize beds in our room and the couch in the outer room folded out to a very comfortable bed, allowing our daughter to have a room of her own. Both rooms had televisions (though I can't say much about Italian television choices). The bathroom was very large by European standards and, happily, the shower had a shower curtain. The room was beautifully and tastefully decorated. The breakfast in the restaurant was good and included fresh fruit. The other big advantage of this hotel is the location. It is literally right next to the Pantheon and easily accessible to the major attractions in Rome. Restaurants (and gelatto places) are nearby. After starting our tour with two nights in this hotel, all the other hotels were a real comedown. I'd definitely recommend this one!", "Date": "June 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New York City", "Title": "“Great Location to Rome around........”", "Author": "A TripAdvisor Member", "ReviewID": "UR3594203", "Content": "My Fiance and I stayed at the Minerva for 3 nights and thought it was the best location to see all of the sites of Rome by walking. We had a great suite on the 6th floor. The roof bar gave a great view of the Pantheon as well as many other sites , though a bit pricey for cocktails. I would highly recommend this hotel for people looking to be in the center of it all with great service as well.", "Date": "June 21, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Nice hotel, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3545093", "Content": "Nice hotel. Staff was very helpful. I saw an earlier review about lack of breakfast but we had breakfast every morning and it was included in our rate. Our room was large and very nice. Best thing about this hotel is the location. It is central to everywhere in Rome. We hired a guide through the hotel. His name is Antonio Paladino. His English is very good and he did a great job showing us around. He added a lot of color and interest to the sites.", "Date": "June 12, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Calgary, Alberta, Canada", "Title": "“Bring earplugs in case you get one of the noisy rooms!”", "Author": "hutchy22", "ReviewID": "UR3535450", "Content": "Take your ear plugs if you stay at this hotel on the weekend and end up with a room over the Plazza side. Rome stays up quite late on weekends and people and traffic make noise till 3:00am! We stayed at this hotel two times. The first time we stayed there we had a room that faced the quiet side. It was great! Unfortunately we payed the same high price for a room on the noisy side the second time and had a hard time sleeping for our early morning flight. The hotel could not move us to the quiet side as all those quiet rooms are taken first! The hotels location is awsome, the rooms are clean and the interior is elegant but if you can't sleep the rooms sure aren't worth the $370 euros per night. So be aware that rooms on the quiet side of the hotel are taken first, especially on weekends! Also, I found the front desk staff a little stuffy ab bit rude under pressure and not all that helpful. The roof top bar/restraurant is worth going up for a night cap, but when we ate at the restaurant we found older grey haired Maitre Di to be quite rude and arrogant! The rest of the staff were much freindlier and almost made up for his abruptness. All and all I would have to say that the rooms at the Grand Minerve vary quite a bit so be careful and state \"QUIET ROOM ONLY\" on your booking if you stay over a weekend! Otherwise bring ear plugs!", "Date": "June 7, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Beautiful location but...”", "Author": "CFISH57", "ReviewID": "UR3457783", "Content": "The location is perfect, as everyone says--also the rooftop restaurant is to die for (gorgeous view, friendly smooth service, and delicious food), service is courteous, and the lobby is lovely. However, we stayed at a crowded time and had booked through the internet and were quite disappointed with the room itself. Though reasonable in size, it had not been renovated and looked nothing like the pictures on the website-more like a Holiday Inn, with a dark interior view, which at $450 plus per night is disappointing. We offered to pay extra for a better room, but were told none were available, even though we were booked for four nights. So, if you go at peak season, don't count on an upgrade, and I would check other hotels in the same area rather than reserving the standard room here. Then go eat in the rooftop restaurant!", "Date": "May 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cleveland UK", "Title": "“Fabulous Hotel with suberb sevice throughout.”", "Author": "Robinson-Byrne", "ReviewID": "UR3440389", "Content": "Just returned from Rome 1st May 2005 after a 4 night stay at the Grand Hotel Minerve and it was superb. It was my first visit to Rome and was not sure what to expect of the hotels etc but after seeing what the other hotels had to offer I know I made the right choice. Our first room was small and not suitable for our needs and had an awful view, so after seeing the manageress, who was wonderful, we were give a junior suite at no extra cost which was just amazing. I took my elderly mother along with my sister and we had 1st class treatment from start to finish. Our room was fantastic with views of the Pantheon and the surrounding area, the chuch outside the hotel is breathtaking inside. The staff in this hotel were so helpful right from the manager down to the housekeepers, they could not do enough for you. You must have lunch or dinner on the rooftop this was the best part of our day, we would have lunch and then sit in the sun and relax for a while before going back out to see more sights. My mum has limited mobility and this hotel was absolutely no problem to her in any way. I can only say that this was one of the best hotels I have stayed in throughout the world. If I have any citicism at all it would be about the breakfast, they could do better, there was lots of friut and cereals but very little choice of hot food and breads, but everything else in the hotel made up for this.", "Date": "May 5, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location, weak on hospitality”", "Author": "A TripAdvisor Member", "ReviewID": "UR3434861", "Content": "The hotel is in the perfect location, right in the backyard of the Pantheon. The rooms were very nice, and the bar and complimentary breakfast were perfect. Our only complaint was the lack of hospitality shown by upper management. We were told by the staff, and had read in the informational booklet that they provided, that the roof garden would be open. When it was not, we asked the concierge to be allowed to speak with the manager about this. After pressing him several times, he finally relented and let us speak with her. She did not offer any apology for the signs and error of her employees, and insisted that the garden not being open for drinks was due to the short rain the night before (it had rained for 15 minutes). In actuality, they were doing a photo shoot on the roof that day, and she lied to cover up their misrepresentations. The hotel is perfect if you are staying on business; if you are traveling for pleasure, it is good, but do not expect much in the way of hospitality from the management.", "Date": "May 3, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Philadelphia", "Title": "“Excellent”", "Author": "A TripAdvisor Member", "ReviewID": "UR3313042", "Content": "Just returned. Impeccable service, best location in town, beautiful rooms with every amenity. Fabulous breakfast buffet. What a treat.", "Date": "March 30, 2005"}], "HotelInfo": {"Name": "Grand Hotel de la Minerve", "HotelURL": "/ShowUserReviews-g187791-d265621-Reviews-Grand_Hotel_de_la_Minerve-Rome_Lazio.html", "Price": "$298 - $689*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Piazza della Minerva 69</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "265621", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/58/77/5877220e6961b74d01bd4315a4cdd1c39large.jpg"}}