{"Reviews": [{"Ratings": {"Overall": "1.0", "Location": "1", "Service": "1"}, "AuthorLocation": "Milan, Italy", "Title": "“Hotel? Which Hotel?”", "Author": "meno273", "ReviewID": "UR120490493", "Content": "I booked a room. I phoned several hours before to tell that I'll arrive late, around 11.00 pm. No one told me nothing. When I arrived the hotel was closed, no one was inside, no one was answering at the phone. I had to look for another hotel in the night. The day after they told me that they put on the side glass of the entrance door an advertisment for me about where I could found the keys. I phoned before, they could tell me what to do in case, or send me an sms or a mail; IT are commons in modern times except in the hotel Atlantic, Berlin main town of Germany. They doesn't like to know what customers care is. Of course I handn't my money back. Look for another Hotel, don't lose your time here", "Date": "November 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "West hls, CA", "Title": "“Rude personell and cockroaches to welcome you”", "Author": "motosinaia", "ReviewID": "UR93534299", "Content": "Really bad experience. Arrived directly from airport after a 20 minutes trip by bus, the receptionist that speaks German only, before saying \"welcome\" or anything else, asked for money. I've show my credit card and she looked at me disgusted and let me know that she will not accept my credit-card (a visa one). I've searched in my pocket for cons in my pockets (no ATM's around) and payed the woman (in my country the only payments in advance are for prostitutes). She didn't let me the chance to see my room first. I agree with Brazilian people who described the receptionists as they did. Walking in my room, at the first sight all was clean... until I stepped in the bathroom, where a nice cockroach was on the floor. There was a window. Don't open it! There are two reasons not to do it: 1. if you open it, you will see the mud on the frame 2. there is barely no heating at all. Even you put the thermostat on max, you will never have more than 16 centigrade in the room. If you need internet, don't forget to ask receptionist at the very beginning for access code, because otherwise you will need to descend again in the reception. There is no telephone in the room to call reception.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Saxony", "Title": "“A clean and quiet Hotel near the Airport Schoenefeld”", "Author": "TwoInBlack", "ReviewID": "UR25252560", "Content": "A clean and quiet hotel, near the Airport Berlin-Schoenefeld (10 minutes with car). They are some cheap restaurants around the hotel and you can leave your car just in front of it. A bus line stops directly by the hotel. But you need about 40 minutes to reach the \"Brandenburger Tor\" via subway. For Berlin it is normal if you don't want to stay in a overpriced Hotel. Breakfast is average, like in other 3*** hotels.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Minas Gerais, Brazil", "Title": "“Prejudicism and Dishonesty is their game!”", "Author": "BRMG", "ReviewID": "UR7289103", "Content": "This was one of the worst experiences we've ever had in a hotel. The staff was rude, dishonest and prejudiced. They're bigots, who explicitly showed they didn't like people who are not from european descent and made little sarcastic jokes about our origin. They mistreated us and tried to charge us more for the room than was originaly arranged. If that wasn't enough, the hotel is poorly located: 20-minute walk to the nearest subway station and than 40 minutes by train to get to the center of Berlin. Overall, terrible!!! Cristina and Guilherme from Brazil", "Date": "April 6, 2007"}], "HotelInfo": {"Name": "Hotel Atlantic", "HotelURL": "/ShowUserReviews-g187323-d265987-Reviews-Hotel_Atlantic-Berlin.html", "Price": "$46 - $116*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Zadek Strasse 1 A</span>, <span class=\"locality\"><span property=\"v:postal-code\">12351</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "265987", "ImgURL": "http://www.venere.com/img/hotel/3/9/7/5/215793/215793.jpg"}}