{"Reviews": [{"Content": "First Rate Service We had stayed at another hotel in this chain during our trip and was impressed. We found an America's Best Value Inn on our GPS and it looked to be in a good location and has off street parking. We made our reservation through America's Best Value Inn's main phone number. This one is within walking distance to The Presidio and MANY bars and restaurants. The rate was very low considering the location but what impressed us the most was the service. I have never received that level of service from a budget hotel/motel. Their staff will go to great lengths to make sure the guests are comfortable. I highly recommend this hotel for anyone staying in San Francisco.", "Date": "Jan 5, 2009", "ReviewID": "UR233704838", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "timar81"}, {"Content": "Best quality for money in area I travel from out of state to work in this part of town once a month and have tried most of the budget hotels in this area. This is my favorite and if I get a good deal I stay here (price between the hotels fluctuate -- Travel Lodge Presidio, Greenwich Inn are also fine options). Rooms clean, staff helpful and it's in good location. Only drawback is that Lombard can be loud so try and get a room beyond the main court yard as traffic and loud passers by can be loud.", "Date": "Nov 15, 2008", "ReviewID": "UR658155402", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "mrtobby"}, {"Content": "Perfect for our Budget This was the cheapest hotel we could find in the city for the weekend. We were a little hesitant because of the prior reviews, but we were pleasantly surprised. We were able to check in very early, and by the time we came back from a long day, we still had a place to park. Maybe we got lucky, but even if it was full, there are places to park within walking distance and the metered parking is free after 10 p.m. There are plenty of places to eat, shop and walk to and feel safe. There is even a Walgreens right down the street. The room had all the amenities we needed, including a refrigerator. The only thing..the shower was a little tricky. We couldn't figure out how to turn it on and had to call the front desk. The front desk crew was very helpful, and we would definitely stay there again.", "Date": "Oct 21, 2008", "ReviewID": "UR394069469", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "IslaChica1"}, {"Content": "Good quality and good hospitality The room is simple but it has everything you need: Good shower, good TV, wireless internet connection. The representative Hitesh was very kind and gave nice tips about the neighborhood.", "Date": "Oct 10, 2008", "ReviewID": "UR800687661", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "CacauSP"}, {"Content": "It was really fantastic! The owner was very nice and offered us a nice room for a fantastic rate! We stayed for two nights and went to see a lot of interesting places, which the hotelowner pointed out for us on a map of San Fransisco.The room was also very clean. And the bed slept fantastic.", "Date": "Sep 14, 2008", "ReviewID": "UR979958831", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "Helmer_Regina"}, {"Content": "woderful stay Its wonderful stay. I reach there early but they check in me and the front desk guy is with kind nature and helpful with soft spoken behavior to all the guest who want directions or any kind of help. I can say because I'm woman and traveling alone in the city and if somebody helps you have to appreciate that. room was very good and clean they change the sheet and towels everyday and I like most the SMOKING POLICY of this hotel If you smoked in the room you got charge. Nice Very Nice. location is perfect.", "Date": "Sep 1, 2008", "ReviewID": "UR891903581", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "gurukaka"}, {"Content": "Bed Bugs Following a single night stay here, we woke up to find bug bites on our bodies and bed bugs on the mattress. These bugs tend to infest the areas they live in and can easily hide inside luggage or clothes you bring with you. We checked out and asked for a refund, but were denied. After calling the corporate office, they asked us to submit a formal complaint, but still refused to issue a refund.I've submitted complaints to the city health department...but for now, DO NOT STAY AT THIS MOTEL, by any means.", "Date": "Aug 27, 2008", "ReviewID": "UR633751247", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "TR12345"}, {"Content": "Perfect place on a budget This place was perfect for us- It was a girls vacation: My daughter, granddaughter and me. The Inn's front desk was helpful and nice. Our room was clean and perfect for our stay-we only needed a place to store our luggage, a clean bathroom-shower and bed to sleep in at night. Our room was close to the road but we heard nothing once we closed the door. The location is perfect for catching the bus to go to all the sights and places SF has to offer- the only way to travel in SF. It was close to all the shops, pubs, markets and resturants. I would recommend it to anyone and stay there again.", "Date": "Jul 31, 2008", "ReviewID": "UR916455638", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Sharon423"}, {"Content": "Unfriendly, arrogant front desk guy!!!!!!!!!!!!!!! Good location! This motel is in a good neigbourhood as regards restaurants, bars and transportation facilities. The rooms are simple but were clean. I am aware one can't expect much but the concierge is one of the most unfriendly people I have ever come across. I have to agree with the previous writer鈥檚 comments in that the front desk guy comes across as sneaky/shady/unfriendly/very arrogant. Try get a booking through an online booking service as it is likely going to be cheaper than booking directly at the hotel. I would recommend this hotel to the budget traveller for its good location, however should one require good service, stay clear.", "Date": "Jul 16, 2008", "ReviewID": "UR776864729", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Austrican"}, {"Content": "RUDE, lying, SNEAKY, hotel guy!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! This is the worst experience I have ever had a hotel. I traveled alone to Frisco to see some friends... The tall (6'3), skinny, middle-eastern guy at the front desk was the WORST. (I describe him, b/c I don't remember his name and I want you to avoid him and this hotel!) When I checked in alone, he was kind to me. When I told him I was staying in the room alone for the weekend, he looked at me with the most evil RAPIST eyes I've ever seen. He asked me how much I paid for my tickets on Travelocity, when I told him he got mad... I guess I paid too little for his liking. This guy is the only one that works at the hotel day and night... he was watching me come and go and asking odd questions. The worst part was when he saw me with my male friend in the morning... I took my friend back to my room mid-day after lunch to relax. He accused me of lying about being in my room alone, and while we were out he de-activated my room card, so I couldn't get back in... He also searched my room and found some tobacco in one of my bags and laid it out on the table... When we came back and my card would not let me in the room I had to go to him... he said he would re-activate the card and that HE MUST let me in himself... when he did, he barged in the room, pointed to the tobacco and accused me of smoking in a non-smoking room. Then, he started yelling at me, and he charged my credit card $250 for smoking... which apparently was in the fine print of the contract. I left a day early and will never return. PLEASE, DO NOT TRAVEL ALONE HERE IF YOU ARE A WOMAN.PLEASE, DO NOT USE THIS HOTEL.", "Date": "Jul 13, 2008", "ReviewID": "UR763174947", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "crzewhtgrl"}, {"Content": "Keep your expectations low. Booked this hotel from New Zealand and were a little nervous after reading some bad reviews but when we arrived we were pleasantly surprised with the place. We had no car so had no problems with parking, although I think that probably not the best place for those with cars. Bed was big and comfortable, although the room had no extra amenities like fridge kettle etc. Bathroom was clean and shower was good, and TV service was great. Located in a great part of town close to Fisherman's Wharf and great restaurants. Also perfectly situated for those who are game enough to use public transport. Buses run frequently from almost directly outside to many parts of town including Haight, and the park and bridge etc. Probably more recommended for younger budget travellers and those with an open mind. As I said, keep your expectations low and you wont be disappointed.PS.. avoid the breakfast (a small prepackaged Danish) and head to ihop across the road. The stuffed french toast is mint.", "Date": "Jun 2, 2008", "ReviewID": "UR232001272", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "tashandbradworldwide"}, {"Content": "Perfectly acceptable I got a very good price for a one night stay at this hotel, especially considering my stay was in the middle of the Memorial Day weekend. It's an older property, and that shows. Furniture shows wear. However, the room was sparkling clean, all the windows were new and fit well. There was a small refrigerator in the room, but no coffee maker. Oh well, I can live with that. Plenty of channels on the TV. My room was at the back of the property, and I think I had no neighbors, so my stay was very quiet -- except for someone who marched loudly down the outside walkway at 3:00 a.m.! Can't blame the management for that, though. The managers were friendly, efficient and courteous. Parking is limited, but again that was no problem. There are several breakfast restaurants within a block of the motel, so that worked well for me. Location is good, a block away from a very nice part of Chestnut Street in the Marina where you can find several good restaurants, as well as two movie theaters. The Presidio is nearby, and there are plenty of buses to take you wherever you want to go in the City. I would certainly stay here again.", "Date": "May 25, 2008", "ReviewID": "UR814881456", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "CountryGrrrl"}, {"Content": "Bad Parking and Lame Breakfast We were in San Francisco only for a couple of nights for the Oysterfest. Unfortunately, most of the other hotels in the area we wanted were all booked and we didn't want to pay an arm and a leg, so we stayed here. The parking situation is pretty bad, as noted by others. Spaces are small and there aren't enough for everyone. Breakfast was a joke--a lame little packaged danish and coffee. We ended up at IHOP across the street. The room itself was okay, but it didn't have that clean feel to me. It just didn't seem like it had been thoroughly cleaned and I didn't feel like I could walk around barefooted. It was okay, but nothing to write home about.", "Date": "May 25, 2008", "ReviewID": "UR942127140", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "patty49er"}, {"Content": "UNBELIEVABLE Experience! This is the review that Expedia WOULDN'T let me post:My wife and I booked this place through Expedia. We chose it for its proximity to Fisherman's Wharf and the free parking on site.When we arrived, we found out that the free parking was limited to about the first ten cars or so, and everyone else would have to park tandem and leave ther keys at the front desk.So far, no biggie -- we had a rental car. We were assigned room 218, which according to the elevator is on the THIRD floor. (We'll use that as benchmark warning for all hotels in the future.)The room was servicable, and I decided to plonk down on the bed for a quick nap before we hit the town.I pulled the sheets back, and dropped down into a recent PUDDLE of undetermined liquid on the mattress! (Yes, it was at crotch level, and we came to the same conclusion as to its origin.)We called the front desk and a maid arrived promptly. She surveyed the situation and called the front desk for further assistance.A man arrived shortly therafter, surveyed the situation, and asked me -- accusingly -- WHAT DID YOU DO?I set him straight, and they proceeded to strip the bed, and then they FLIPPED the soaking wet mattress OVER, so that the wetness would be the problem of room 118 (on the second floor).By this time we were on the phone to Expedia, demanding to change our hotel. Expedia said they would find us a room at another hotel OWNED BY THE SAME GUY, but we declined, as not changing the sheets between guests would seem to be an ownership problem.We we returned home, and tried to post this review to Expedia, we discovered that we weren't the first people to discover that this property didn't always change sheets between guests, but we may have been the first to discover a fresh puddle of evidence!", "Date": "May 11, 2008", "ReviewID": "UR105511817", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "acedesone"}, {"Content": "Great price, great location, friendly informative staff, and clean room! My wife and I wanted a comfortable, reasonably priced , clean room, in a location handy to public transportation, restaurants and points of interest. This budget hotel fulfilled our requirements perfectly with a very clean room and king sized bed. Everything worked to our satisfaction including a very quiet efficient heater. The staff was helpful and informative. We stayed 3 evenings and would highly recommend this hotel. We will gladly stay again on our next trip to San Francisco.", "Date": "Jan 14, 2008", "ReviewID": "UR851842630", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "lotsuvgdstuf"}, {"Content": "Good for one short night We would not have chosen to stay at this hotel but the Days Inn a few doors down was remodeling and could not honor our reservation for a room with two beds. The office staff did give us a room at the same discounted AAA rate but I wonder if they got the best of the deal. The room was small and did not include a coffee maker, 'fridge, or microwave. The room and the bathroom were clean. Breakfast consisted of coffee and a prepackaged Danish. Since we checked in late and were leaving early, the room was okay for us. I would not have wanted to stay there for an extended vacation. The hotel is handy to many S.F. sites and included free parking if your vehicle is small enough for their spaces. The Day's Inn allowed us to park our extended cab pickup at their facility; otherwise we would have had to park on the street.", "Date": "Dec 15, 2007", "ReviewID": "UR573556442", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "momwnb"}, {"Content": "America's Best Dumpy Inn! The pictures on the hotel website have obviously been staged. The room we stayed in was dirty and dated. The traffic noise on Lombard was enough to keep a bear in december awake; not to mention the horrible slamming of the elevator door every 15 min. throughout the night. I would not recommend this hotel to anyone who is interested in a clean and quiet space.", "Date": "Oct 29, 2007", "ReviewID": "UR221516310", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "trekkingsf"}, {"Content": "We were very pleased! I was a litle nervous about what kind of place we would be staying based on some of the other reviews I read, but we were very pleased once we got there. First of all, you can't go expecting a 5-star hotel or you will be disappointed. Be realistic!! We checked in with no problems. The room was very clean and was straightened daily. The location was perfect for us. We were able to walk almost everywhere we wanted to go and there are lots of good restaurants very close to the hotel. The staff was very nice and helpful. My only complaints were that you can not make local phone calls from the room which meant we had to use our cell phones (this meant roaming charges for us). There were some electrical outlets that didn't work and there is only one small shelf in the bathroom. Overall, I would definately stay here again and do highly recommend it to any one who just wants a clean, comfortable place to sleep and shower.", "Date": "Oct 18, 2007", "ReviewID": "UR415401729", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "carlanuckolls"}, {"Content": "Not Good The good: new clean bathroom, beds, quiet between 11 p.m. - 7 a.m., IHOP across the road, the price (? by san francisco standards), quiet air con/fan unitThe not so good: no in-room coffee maker, smallish room, no desk, phone message light continually flashed, hotel looked shabby, the lite continental breakfast was definitely lite (coffee and a sweet roll), had to get the tv remote from office.The bad: animal hospital adjacent (dogs barking at 7:30 a.m.), hotel refused to store our bags for 3 hours after we checked out as we had a flight in the late p.m. (never had that happen before), windows and walls were thin (traffic and people noise).The conclusion: you get what you pay for.", "Date": "Aug 8, 2007", "ReviewID": "UR148215527", "Ratings": {"Service": "1", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "happytrails_7"}, {"Content": "Be Aware I had three days to visit San Francisco and I booked this hotel on-line previous research on the web site.Result:No breakfast area nor Complimentary Continental BreakfastNo refrigerator,microwave or coffee maker as indicatedDirty Room -towels,sheets,blankets includedAsked to have clean stuff...probably they don't have clean stuff at all...Complimentary Parking...if you're lucky to find a spotNoise coming from the street horribleSome guests checked-in at 9.00 p.m., they ran and screamed all over the place 'til midnight...I called the owner and he ignored me..Called 911 they showed up an hour later.You want to go to San Francisco...pick something else..for the same price too...", "Date": "Apr 21, 2007", "ReviewID": "UR817316428", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tolindalcul"}, {"Content": "Could be worse Our hotel in the city cancelled at the last second and this was only one of two rooms available. Definately not worth $175/night. The Good: great location - excellent for walking and taking the bus ($40 cab from the airport). The bathroom was renovated and very clean. Our smoking room did not smell. The best breakfast in the city is across the street (Home Plate).The bad: no amenities - esp at $175 a night. Make sure you check for TP before you use the bathroom. This seems to be a common problem.", "Date": "Oct 14, 2006", "ReviewID": "UR517760964", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "4"}, "Author": "stlcurly"}, {"Content": "Terrible, dirty, but free parking We were looking for a place with free parking because we had read on the internet how expensive parking could be in San Francisco. This is definitely a case of you get what you pay for $63 a night.We were traveling from South Carolina and spent my birthday here...the worse hotel I have ever stayed...but the parking was free. The room was dirty, hair on the pillows. Cigarette burns on the furniture and blanket. Shower curtain was filthy. However to their defense...they were renovating and hopefully all of the rooms are going to be completely redone. We were warned re: renovation noise, etc. Be advised of the above and check the room prior to making a decision.", "Date": "Oct 2, 2006", "ReviewID": "UR906157893", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "3", "Rooms": "1", "Location": "3"}, "Author": "SC_SouthernBelle"}, {"Content": "Nightmare Rip Off 8:30 on a Saturday evening in August and after having our reservations not honored at another establishment, we were stuck. This motel was the only one with a vacant sign still lit. The proprietor said that only one room was left and that it would cost us $175.00. Not having any choice other than sleeping in the car, we agreed. When my wife pulled out the credit card, she was asked to pay in cash instead, which we refused. Now about the room. There were two beds and a cabinet with a TV AND THAT WAS ALL! No tableNo chairsNo mirrorNo toilet paperNo waste basketNo cupsNo remote for the TVOne towel and wash clothThe carpets were still wet from being recently shampooed and the room smelled like cleaning products to the point of nauseousness. We had to sleep with the windows open on this very busy and noisy street. The lesson we learned - If your stuck in San Francisco with no room on a Saturday night, drive across the bridge and find an honest hotel farther north. It might be a late night, but at least you'll get some sleep and pay fair prices.", "Date": "Aug 27, 2006", "ReviewID": "UR355977203", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "Hanrahan"}, {"Content": "You get what you pay for Yes this place is incredibly cheap, but then you actually have to stay here.The room and particularly the bath were very small. Towels were tiny and rough to the touch. We had booked this to avoid driving an hour home after a late night event and ended up deciding to drive home anyway. Location is pretty good - very close to the Marina and Cow Hollow, but don't expect anything more than a safe place to crash. Make lots of plans to be out of your room if you decide to stay here. Good news is you'll have plenty of cash left over. :)", "Date": "Aug 17, 2006", "ReviewID": "UR449023606", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "4", "Rooms": "2", "Location": "4"}, "Author": "swelch"}, {"Content": "Nice accommodations in S.F. for $44 per night I weas a bit wary of the Sea Captains Motel on Lombard St. as I had read a couple of negative reviews, but I wanted to spend a few days in S.F. and was traveling on a tight budget. Let me tell you, for $44 per night (plus tax, of course), you get a clean and spacious room with a clean and spacious bathroom and a TV with cable. I'm sure you could spend 3x the rate and get about the same thing in the same neighborhood, which is the Marina- a clean and safe area of the City. If you get a room toward the rear of the motel, the traffic noise from Lombard is not bad at all. And the staff was pleasant enough, despite allegations of rude treatment of guests in other reviews. And there's a Safeway grocery about a 1/2 mile walk away and frequent bus service on Lomabard and Chestnut Sts. to all parts of the City.", "Date": "Dec 10, 2003", "ReviewID": "UR310045317", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "stop shouting! We had some info on this motel from another source and decided to give it a try. Having lived some years in SF I knew Lombard St. might not be ideal, but since we had a car the free parking was enticing, and free breakfast was mentioned... all in all maybe a good deal.WRONG! The staff was continually berating us and others including shouting matches long into the night that even drowned out the horrendous traffic.Breakfast was 1 old cello-wrapped danish per person distributed like in maximum security and some WMD coffee.The parking lot was floodlit to the point you could read in bed all night even with curtains drawn.verdict: double plus ungood.", "Date": "Sep 16, 2003", "ReviewID": "UR654976390", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "In Lombard street c'猫 di meglio   showReview(20745065, 'full');", "Date": "Oct 9, 2008", "ReviewID": "UR315370717", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "PaolaMarcoGenova"}, {"Content": "Bon Rapport Qualit茅/Prix   showReview(20017118, 'full');", "Date": "Sep 12, 2008", "ReviewID": "UR908759113", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "cthsxm"}, {"Content": "bon rapport qualit茅/prix pour un hotel 脿 San Francisco   showReview(19631449, 'full');", "Date": "Aug 29, 2008", "ReviewID": "UR196750330", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Pratique   showReview(19631448, 'full');", "Date": "Aug 1, 2008", "ReviewID": "UR722764622", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Un peu d茅莽us   showReview(18536475, 'full');", "Date": "Jul 29, 2008", "ReviewID": "UR820477651", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "bien pla莽茅   showReview(18536474, 'full');", "Date": "Jul 25, 2008", "ReviewID": "UR845607045", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Excellent rapport qualit茅 / prix   showReview(17429521, 'full');", "Date": "Jun 9, 2008", "ReviewID": "UR288875963", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Einfach, aber noch akzeptabel   showReview(16265675, 'full');", "Date": "May 21, 2008", "ReviewID": "UR237820438", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "Reigelser"}, {"Content": "bien plac茅   showReview(16602717, 'full');", "Date": "May 5, 2008", "ReviewID": "UR747214135", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "F眉r San Francisco nimmt man einiges in Kauf   showReview(11301808, 'full');", "Date": "Nov 9, 2007", "ReviewID": "UR436844788", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "pas decu   showReview(11301807, 'full');", "Date": "Oct 30, 2007", "ReviewID": "UR241457094", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Molto Spartano!   showReview(11664776, 'full');", "Date": "Oct 4, 2007", "ReviewID": "UR268488390", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d267364-r23283258-Americas_Best_Value_Inn_Golden_Gate-San_Francisco_California.html", "HotelID": "267364", "Price": "$132"}}