{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Key West, FL", "Title": "“Nice!”", "Author": "JM11traveler", "ReviewID": "UR136097934", "Content": "Stayed here for a quick overnight to visit a friend and Daytona Beach. The hotel was recently renovated and features the new Courtyard lobby and new guest rooms. My room was very nice and comfortable. Small flat screen TV and everything was very clean. Shamora at the front desk was very friendly and had a great personality. The guy working the bistro was more interested in watching the Olympics than helping guests. I also found the food from the bistro to be very poor quality. The chips were stale and felt like they had been left out for days. Every food item they served with the exception of the drinks were just plain microwaved food. Other than that, the hotel is great and I wouldn't mind staying again!", "Date": "August 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salisbury, NC", "Title": "“Excellent Stay”", "Author": "bayless12", "ReviewID": "UR134664600", "Content": "Excellent stay, close to everything. Very clean and comfortable. Staff were great too!", "Date": "July 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "middletown,in", "Title": "“Nice Clean Convenient”", "Author": "sgmcneil", "ReviewID": "UR133940466", "Content": "Close to the track and shopping mall. Just a few minutes to the beach. very quiet.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "earth", "Title": "“No complaints”", "Author": "heckflosse", "ReviewID": "UR132691073", "Content": "Nice comfortable modern hotel, good location close to airport and racetrack yet just several minutes from beaches, many close restaurants. Friendly staff. No complaints.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ft Lauderdale, Fl", "Title": "“Great location, near everything in Daytona Beach!”", "Author": "frostbitecra2002", "ReviewID": "UR130917356", "Content": "We stayed at this location for a mini vacation the week prior to Memorial Day Weekend. All was fine, rooms were very cleaned, staff was courteous and very accommodating and at every turn they went above and beyond to meet and exceed our expectations. Kudos to all and this location deserves a 9 in my book! The A/C was a bit noisy and we complaint about it but we were told that it would be fixed (never did) but still this location was a great choice. 7 to 10 mins from the beach. The pool was nice and clean and there's a Starbucks in the lobby!", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North DeKalb, Georgia, United States", "Title": "“Super Hotel We didnt want to leave!”", "Author": "Ace P", "ReviewID": "UR127641614", "Content": "Staying at this Courtyard was a great experience. Large rooms and Bathrooms with perfect memory foam beds. Top Enoch cleaning and customer service from all the staff. Hip lobby and restaurant with a Starbucks!! Awesome gym and pool! This location was so nice even the guest were nicer probably because they were just as happy about their Hotel stay as we were! This Courtyard Marriott was so nice I didn't care that is was not on the beach (but is near a mall). I hope all my future stays at any other location are as great as this location was. Great Job :)", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort lauderdale, FL", "Title": "“great location for attending a race!”", "Author": "lablack", "ReviewID": "UR124958786", "Content": "Stayed in the Courtyard while attending a race at Daytona Int'l Speedway. Our room was a queen suite and very roomy. Was concerned with the close proximity to the airport but never heard any noise. Their shuttle runs between this hotel and their Residence Inn down the road which was very helpful when getting to the track. Would definately stay here again, everything was very clean and staff was friendly.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "CA", "Title": "“average courtyard”", "Author": "birdieca", "ReviewID": "UR123460714", "Content": "This Courtyard is near the track, so you can hear the noise from the track, which is to be expected. Not to be expected was that you could hear the noise in the room next to you. I had also asked for a king room but was given 2 queens, strange in that the hotel was hardly occupied the night I was there. Carpet had a big spot on it.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cornelius, North Carolina", "Title": "“modern hotel and amazing value”", "Author": "tigermark82", "ReviewID": "UR122199190", "Content": "Stayed here while visitng family for Christmas. The rate was incredibly low as this is not a busy time of year. I have stayed here many times in the past, but they have renovated the entire hotel since I last stayed there and it looks great. The staff was friendly and the rooms were clean. Everything was in working order which seems rare sometimes. If you don't care about staying on the beach, I wouldn't even think about staying anywhere else.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lakeland, Florida, United States", "Title": "“Great Stay!”", "Author": "Kathy S", "ReviewID": "UR121061257", "Content": "Although we only stayed one night, attending the Turkey Rod Run on Thanksgiving, we had a great stay. The staff was friendly and helpful. This was the cleanest hotel we have had the pleasure of staying at. Just the thought of aleeping in \"someone else's\" bed is enough to send me over the edge -- I have to say I was not creeped out at all. The beds were clean and I slept like a baby. Thanks Courtyard, you are doing a great job!!!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DC", "Title": "“Courtyard”", "Author": "Dunlewey", "ReviewID": "UR120139506", "Content": "Fine hotel for staying near ERAU, airport. Like the modern design of the lobby and stylish room linens . Nothing special but clean and up to date.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very good indeed”", "Author": "Pat A", "ReviewID": "UR119145596", "Content": "My room was clean, attractive and had a crisp look. The service was attentive and pleasant, and the food was good. I would definitely choose it again and recommend it to others. My only difficulty was getting our boarding passes to print on the computers in the lobby, but all in all it was a most enjoyable stay! Thanks, Marriott.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Auburn, Alabama", "Title": "“Okay hotel - but not close to the beach”", "Author": "keb1234", "ReviewID": "UR102280037", "Content": "I stayed here for 3 nights while working in the area. The hotel is right next to the airport, and I could hear planes sometimes during the day, but they didn't bother me at night and I was able to sleep fine. I was not able to use the pool because the weather was crappy the whole time, but it looks decent and it seems they recently updated the furniture. The hotel is convenient to Daytona Motor Speedway, but is about 6 miles from the beach. The rooms are typical of other Courtyards - not 5 star, but not the bottom of the barrel either. The fitness center left much to be desired. There were a few very old cardio machines, one multi-function weight machine, no free weights, and one tv for the whole room. Parking is free.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Goose Creek, South Carolina", "Title": "“Very convenient location with decent amenities.”", "Author": "EddieInIndy", "ReviewID": "UR62897103", "Content": "This hotel is literally right next to the Daytona Beach airport. And while it's not ON the beach, it only takes 5 short minutes in a car to get there, so you have the best of both worlds. What my husband and I particularly enjoyed was the fact that it had a bar in the hotel. You don't usually find this in a limited service hotel. There was not a restaurant but they did serve a hot breakfast in the morning (we didn't partake so I don't know how good it was). Also, there was a nice pool and hot tub area outdoors. While the rooms could benefit from some updates, overall this was a very nice hotel for a relaxing long weekend vacation.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Geneva", "Title": "“Great for ERAU`s parents!”", "Author": "VoyagesduGout", "ReviewID": "UR47166100", "Content": "Walking distance from ERAU, very kind people at the desk, rooms large and clean, breakfast great! Special rates for ERAU.", "Date": "October 18, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“A touch dissapointed!”", "Author": "jimmyb01", "ReviewID": "UR36809769", "Content": "This is your usual Courtyard, everything is as it should be, clean, tidy and comfortable. On this visit it seems on check in and on making a purchase from the store I was an irritation to the young lady on the front desk.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“An average Courtyard”", "Author": "nyuszi", "ReviewID": "UR24052094", "Content": "I was originally pretty disappointed with this hotel (which was selected for me for a business trip), but it's actually a perfectly average/good Courtyard. What disappointed me most was the fact that they do not have an on-site restaurant (except for breakfast), or room service and that the linens were pretty rough and low quality. But that's kind of par for the course at this level of hotel. On the good side, all of the staff members I interacted with were exceptionally nice, friendly and helpful. The housekeeping was quite good - my room was always thoroughly cleaned, but with respect for my personal goods (where at some hotels it feels like they just sort of throw your stuff around to get the cleaning done as quickly as possible). Despite the ugly Courtyard pattern carpet and the not-so-great bed and bedclothes, the room was pretty good - very large with a couch and free wired internet. The hotel is crazy close to the speedway, airport and Embry Riddle. I realize this will be a pro for many people, but it wasn't for me and I was woken up most nights by some kind of loud engine noises from one of those places. There are many places to eat in a short driving distance, but they are all chains like Outback and Longhorn or fast food. On the negative side, the heating/cooling system was just crazy and seemed to have nothing to do with any settings I chose. The walls were thick enough that you didn't have to hear your neighbors, but hallway noise was a problem.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Evans, Georgia", "Title": "“Adequate”", "Author": "BrentFinch", "ReviewID": "UR23740037", "Content": "Very typical Marriott - clean which is a plus. We had two rooms and some complimentary toiletries were missing on different days (including check-in day). The staff (front desk; bar; breakfast manager) were all very helpful and friendly.", "Date": "January 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great value, great location, QUIET hotel!!”", "Author": "davidmeyer", "ReviewID": "UR20672652", "Content": "Stayed here one night. Ground floor room next to the road leading out to rear parking lot, facing the airport. I don't like to be cooped up in a cave, so I open my windows all the time. Normally I am on the upper floors, so I don't worry about privacy all that much. However, you have ZERO privacy on this wing of the hotel on the ground floor. The fitness room is very nice, as is the pool. The rooms are clean and comfortable. If you don't want to go out for dinner, there is a nice order-out company that has excellent food delivered to your door. Nice nice hotel and at a great value.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reno, Nv.", "Title": "“As good as it gets in Daytona Beach”", "Author": "Brucer22", "ReviewID": "UR20357089", "Content": "Have been staying in the area for years, as I have immediate family relatives that live there, so we go there at LEAST twice a year. This is about as good as it gets in the Daytona area. This is not on the beach, but rather located right beside the Speedway. Quite and clean which is a real improvement over some of the other local hotel/motels. You will be happy. Would recommend it to you; if you are staying in the area", "Date": "September 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Great location for Speedway”", "Author": "Brianscreename", "ReviewID": "UR10125095", "Content": "Stayed at the Courtyard Daytona Beach for three days while attending the Petty Driving Experience at Daytona Speedway. Hotel is typical Couryard, but was disappointed that there was not a complimentary breakfast buffet on weekday mornings. I reserved on Marriott's website using points, however the front desk got it wrong and was actually charging me for the time spent there. Was rectified when I brought it to their attention. The room was clean and I had a balcony overlooking the pool, and my overall experience was good. It is about six blocks from the speedway and a five or ten minute drive from the beaches. Overal, a good place to stay in Daytona. Far superior to most all of the hotels on the beach with regards to cleanliness and overall upkeep.", "Date": "October 18, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Great Place!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2987243", "Content": "Stayed there the week between Xmas and New Years in 2003 & 2004. The staff is extremely friendly and helpful and there appeared to be virtually zero staff turnover in the year between my two visits. Very nice lobby and bar area...great, quiet place to hang out at the end of the day for a drink or two. The hotel also features a nice outdoor pool area that, like the rest of the hotel, is very well maintained. The rooms are typical Courtyard decor and are very clean and well kept. My only complaint is about the beds...on both visits, the king sized bed is one of the worst I have slept on...feels like sleeping on a stack of cardboard, a real bummer because otherwise the hotel is one of the best I stay in during 25+ weekends of travel per year. More comfortable beds and I would rate the hotel 'Excellent.' The hotel is located essentially right next door to the speedway, so if you are in town for business with NASCAR or ISC, you couldn't be much closer. There are also plenty of good chain restaurants and shopping within a few blocks. Overall, the Daytona Courtyard is a great hotel with a well above average staff. If you are not interested in the beach, the Courtyard is your best choice for a Daytona stay.", "Date": "January 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“Best choice in Daytona”", "Author": "Pat W", "ReviewID": "UR2154977", "Content": "I have stayed at this courtyard many times and it is my 1st choice of places to stay in Daytona Beach if you do not want beach side accommodations. Clean rooms, nice cocktail lounge area and close to shopping and dining.", "Date": "June 5, 2004"}], "HotelInfo": {"Name": "Courtyard by Marriott Daytona Beach", "HotelURL": "/ShowUserReviews-g34172-d268635-Reviews-Courtyard_by_Marriott_Daytona_Beach-Daytona_Beach_Florida.html", "Price": "$80 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1605 Richard Petty Blvd.</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32114</span></span> </span></span></address>", "HotelID": "268635", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/45/3c/453c17ae06ac7003dc55af96184028418large.jpg"}}