{"Reviews": [{"Content": "Very Great Deal i stayed at this hotel for two nights. The location is very great, just 3 mins from the main station. The room is clean and the staff is very friendly. I think it's a really good deal for such budget price. I will definitely stay here if I go to Florence again.", "Date": "Sep 27, 2008", "ReviewID": "UR813762794", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Fuding"}, {"Content": "Great stay! Will stay again! Located very near Firenze SMN train station (2 mins walk) and a McDonald's. Hotel entrance unimpressive (hotel located in the 2nd floor) but place is okay once you get into the hotel. Elevator/lift available but small, just like in many european hotels. Renovated, clean, big double rooms w/ a terrace which is cleaned everyday. Toilet  shower in room a little smallish but clean. Friendly  helpful owner, Paoulo, and front desk girl, Francesca. With buffet breakfast european style. Had a great time here, no problem. Will recommend this hotel to friends and will go back there again in the future.", "Date": "Apr 23, 2008", "ReviewID": "UR482144429", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "docM2008"}, {"Content": "Book the Berna! I was surprised and delighted with my stay at Hotel Berna. Having read some unfavorable reviews about the hotel and the unsavory area, I was a little worried, but my concerns vanished as soon as we checked in! The front desk staff were pleasant and efficient during check-in. Our room was easily one of the largest I have had in Europe, with an enormous closet and a roomy bathroom. (Keep in mind that a large room in Europe would still qualify as a small one in the US). Free access to the mini-bar (ok, all non-alcoholic beverages, but still a treat!), plus a little welcome snack on the bed. The breakfast spread was also by far the largest I have had in Europe. Pastries up to your eyeballs, scrambled eggs, bacon, espresso, cereal, yogurt...you get the general idea. The hotel bar was also quite nice, with an excellent and attentive bartender. They serve a pretty extensive spread in the evening in the bar - lots of apero to snack on before dinner. The front desk service was excellent. One person was able to juggle three different customers at once and no one felt at a loss for good service, as far as I could tell.While I felt quite safe in the area, it's definitely questionable. There seemed to be some working ladies hanging out next to the hotel. There are not a lot of restaurant choices in close by, and the major sights and shopping areas are probably a 20-minute walk. Still, I definitely recommend the Berna for anyone looking for a great value and service in Milan.", "Date": "Jul 22, 2007", "ReviewID": "UR855888170", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "smith06"}, {"Content": "Horrible! This is the worst place I've ever stayed at. The only positive thing was that this place was very conveniently located to the train station, and it was clean. But overall there was a lot more down鈥檚 than up鈥檚. If you鈥檝e ever tried to sleep with a mosquito in the room then you don鈥檛 want to stay here. Both nights there were bugs biting us the whole night so we hardly got any sleep. When I showered on the first night the water was trickling out of the shower. Then my friend attempted to shower but there was no water. Apparently they turned the water off from 10pm-7am and didn鈥檛 tell us. The lady at the front desk smoked in the lobby when it said no smoking, the mattress had a big indention in the middle so I kept on rolling into the middle. On the second night I opened up the bed and looked at the sheets and found a smashed but with blood! Plus they didn鈥檛 take credit cards. If you don鈥檛 mind having these things happen to you then you should definitely stay here.", "Date": "Jun 20, 2006", "ReviewID": "UR937750859", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good! Really love this Hotel!Near the station and the Monuments, good staff...Excellento!", "Date": "Apr 5, 2006", "ReviewID": "UR973211116", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "loved the Hotel Berna After arriving in Firenze early one morning without any accommodation, it was a stroke of luck that we stumbled upon the Berna after another hotel operator recommended it to us. VERY handy location close to the train station and close to all major attractions. The room was basic but with clean bathrooms and nice terrace. Only real complaint was that the floors needed to be mopped and the mattress was worn but hey you cant complain when you can just wheel your luggage around the corner from the station!! Other problem is that at the time we checked in no credit card facilites were available.", "Date": "Dec 15, 2003", "ReviewID": "UR361068306", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Albergo situato al 3 piano di...   showReview(22769607, 'full');", "Date": "Dec 3, 2008", "ReviewID": "UR816137717", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Una matrimoniale ad uso singolo...   showReview(20237499, 'full');", "Date": "Sep 3, 2008", "ReviewID": "UR938850190", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Muy cerca de la estaci贸n de tren :)   showReview(19222210, 'full');", "Date": "Aug 22, 2008", "ReviewID": "UR451337583", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "-1", "Location": "5"}, "Author": "Mir_79"}, {"Content": "Un po' delusa   showReview(18603154, 'full');", "Date": "Aug 4, 2008", "ReviewID": "UR874001355", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "rebiste"}, {"Content": "Ringraziamo la padronessa per...   showReview(14650032, 'full');", "Date": "Mar 28, 2008", "ReviewID": "UR761485940", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d269194-r20426900-Hotel_Berna-Florence_Tuscany.html", "HotelID": "269194", "Price": "$142"}}