{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“GREAT”", "Author": "maidomo79", "ReviewID": "UR127531159", "Content": "JUST SUPER!!!! Super location super friendly...can't miss it!!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Spangdahlem, Germany", "Title": "“Bed bugs! Beware!”", "Author": "jlhickman", "ReviewID": "UR124948039", "Content": "This hotel has bed bugs! I got bites on my arms, neck, and face. They moved us to a newly renovated room but I got bites two more nights. They were super surprised that I got them in the new room but not in the older room which tells me they knew they were putting me and my children in a room with bed bugs! They tried to tell me they were mosquito bites but it was too cold and snowing out for mosquitoes. When I googled the bites, they were classic three in a row bed bug bites often referred to as breakfast, lunch, and dinner. Also, don't let the photos about the beds fool you. They are nothing but cots with a metal bar that curves upward down the middle. All of our backs screamed with pain each morning. It was like sleeping on a hill. Worst sleep ever... oh, and did I mention the bed bugs? Skip this hotel!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "DEVON", "Title": "“Excellent location”", "Author": "BIGBOOTIES", "ReviewID": "UR124856555", "Content": "Never having been to Rome before, my wife and I were slightly bemused at the building that housed the Marco Polo hotel. It is six storeys high and has a different hotel on each floor! We were on the third floor, accessed by a very compact lift, just about big enough for three people. The rooms are quite small, but we were there to see the sights so a decent bed to sleep in and the means to wash ourselves were all that was required, and the hotel amply provided them. The breakfast in the morning was sufficient to stave off hunger pangs well into the afternoon with plenty of cereals, fresh bread rolls, cheeses, jams etc etc. the location of the hotel, literally, a stones throw from the termini station was ideal. We bought a three day travel pass that gave unlimited travel on buses, trams and the metro, great value. If you want to see Rome you won't find a better location than the Marco Polo. Special thankyou to the staff, nothing was too much trouble.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“A weekend in Rome”", "Author": "Diegomanenti", "ReviewID": "UR124660003", "Content": "The hotel is excelent, clean, comfortable and very well located ( behind the TERMINI station).It is my second time in Rome and I truly reccommend the hotel Marco Polo to anyone who wants to discover the eternal city. Besides, the staff is absolutely gentle and helpful.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Grazie Marco Polo !”", "Author": "Alin M", "ReviewID": "UR124603229", "Content": "Ciao. I stayed in this hotel and I want to say the location is perfect,staff great(especialy Lorenzo -Thank you ‘laziale’ for your support and good attitude),rooms are ok, fully equipped. If I come again I'll stay at Marco Polo.And the rest of employees were very friendly. Great breakfast ; but simple. I will certanly be back when I will come to see Lazio’s game again.And I would recommend to my friends.Bye!", "Date": "February 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Marco Polo is the worst”", "Author": "Sonya P", "ReviewID": "UR122992392", "Content": "The hotel was not the most expensive so we were prepared for a reasonable amount of wear & tear. We arrived early and were able to check in prior to the normal check in time which was very helpful. We were booked into the room behind the reception desk and next to the restuarant and this was very noisy due to the paper thin walls so we were woken as soon as the kitchen activities started and could hear every conversation until people stopped coming & going past reception. We requested a different room and the staff were helpful and found another room after another night. The next room was even noisier and it sounded like the people in the hotel above were in our bathroom. No problem, we knew the people above were leaving that day having heard their conversations so we thought it would get better. Next morning the water was cold in the shower and when we complained at reception they indicated that a lukecold (not even lukewarm) temperature was acceptable (this was in October). We immediately booked into a different hotel and were advised that we would have to pay the remaining 2 nights accommodation. I just want to say that we were happy to pay for our accommodation twice just so we could enjoy the rest of our stay in Rome. Also, don't bother booking in for the breakfast as you will get better value anywhere else.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Weymouth, United Kingdom", "Title": "“\"Our stay at Marco Polo Hotel Rome\"”", "Author": "alan1948-12", "ReviewID": "UR122664745", "Content": "I say \"Our stay\" but we didnt actually make it to the Marco Polo Hotel.No, we didnt stay there ecause on the way from the airport the Driver had a phone call and passed the phone to me it was from The Hotel Manager, at The Marco Polo, to say that owing to the boiler packing up we were being diverted to another Hotel, near to The Marco Polo. We could, probably, move to the Marco Polo on Saturday when it should be repaired (this was on 28/12/2011 Wednesday and we were staying in Rome until 01/01/2012 Sunday) We went to The Tre Stelle Hotel ,one of about 5 in the building. It was actually ok, basic, but it suited our needs.Actually it looked better than The Marco Polo!! Now, you are probably thinking, why am i writing this then about The Marco Polo when we didnt stay there yea? Well, its because, like you are doing now, I read the Marco Polo Hotel reviews before we went to see what other people, who had stayed there, thought about it. And there was several that mentioned that they HAD to move to another Hotel/changed rooms owing for some reason, or other. Now perhaps I am old fashioned, or something, but when I book an Hotel I like to STAY in that Hotel. I mean, fair enough, the Manager did phone us on the way there but it appears to be a regular occurance at his Hotel things breaking down and diverting clients to other Hotels. So. if you are thinking of staying at The Marco Polo Hotel in Rome, firstly assertain that you CAN actually stay there. we, my Wife, Son and I went round to the Marco Polo, on the Friday 30/12/2011, to see if the boiler had been fixed (we wouldnt have moved there anyway by then), it was just to see. It hadnt.One of The Hotels, in the same building as The Marco Polo, is called Fawty Towers!!! However the location is where we wanted, by The Termini Rail Station. And the Hotel that we were sent to wasnt much farther away, about 1 1/2 blocks away. Other than that we had a lovely time in Rome, for The New Year (this was our second time in Rome we spent Christmas there 6 years ago) its well worth going its a lovely City, alot moreexpensive this time though. They, the Hotels, charge a 2 euro tax per person per night and watch out for the service charges. I would check at the Restaurants/ Cafes etc PRIOR to ordreing a meal if they charge a service charge, and they charge for entry into The Forum now.Oh, and one more thing, that i have also informed Thomas Cook about (as well as the above) if you go on a Tour Bus make SURE that you know where each stop is because thet havnt got the Tour operators Logo on the regular bus service bus stops. They stop at them but, brsides The Vatican and Termini, you may find it difficult to know where to get back on the bus Ok?", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“A pleasant stay”", "Author": "angelo w", "ReviewID": "UR121625843", "Content": "I stayed at the Marco polo hotel in October 2011 and I highly recommend it for business reasons and those who, like me, and those who want to spend a pleasant family holyday. The location is strategic and it is one of the strenghts. Located in the heart of Rome, it's a short walk from the Termini railway station, the main transport hub of Rome, giving the possibility to quickly and conveniently reach all the major attractions of the historic center of Rome. Another pleasant surprise are the rooms, very clean, equipped with digital tv and minibar, and in spite of the period, a pleasant air conditioned which made the heat more bearable in october in Rome. Separate mention the current staff at the Hotel Marco Polo, a willingness and sympathy, as well as professional, unique, despite the fact my reservation was not guaranteed for a problem with my credit card I have been contacted and confirmed after my arrival, although I arrived late in the evening, I found my room available. My stay was held in a warm, friendly and familiar, especially one that struck me is the peace that reigns in any room of the Hotel. The breakfast is varied and plentiful and meets all kinds of tastes. What about other things, a satisfying experience, after having stayed at the Marco Polo for work, I will definitely stay here again when I come back with my wife to show her the beautiful city of Rome.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "griifith", "Title": "“Marco Polo”", "Author": "anne m", "ReviewID": "UR121365198", "Content": "We were dissapointed with this hotel, while the guy on the desk did his best- our dates were mucked up!!- we ended up paying more than originally quoted because they had to give us another room when we got back from our viatour trip , they were helpful in getting our bags to the other Hotel that was owned by same company a better one over all. I felt the first Hotel the worst we stayed in Italy,mind you most of hotels were fantastic and hard to live up to!! Not a real ideal location in the area around railway station, lots of undesirables in the walk to get to the hotel ,the streets were filthy, the street it was in was slightly better, other than guys on desk everyone else was not so friendly. the room was clean though and quiet. Breakfast was great though with some lovely fresh bread rolls and enough choice of food. Access was through the ground floor with no real entry till you took an antiquated lift upstairs to main desk. Another Hotel in same building had Fawlty Towers as its name which made us laugh as that was what our Hotel seemed like. If price is right ok budjet accomodation and reasonably close to some attractions..", "Date": "December 3, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Lowville, New York", "Title": "“Do NOT stay at the Marco Polo!”", "Author": "Carol F", "ReviewID": "UR119935213", "Content": "My friend and I had a confirmed reservation but when we arrived, we were told that it had been rejected by our credit card company and the hotel was full. Diego then told us he would try to find us another room. Well, he did at the same confirmed price. We found out later that he put us in a hotel that charged half of what we paid. We did not receive any refund. We had to walk further to the termini and the new hotel did not have complimentary breakfast. Do not not stay with these con artists taking advantage of 2 American women.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“A great Hotel”", "Author": "yuri k", "ReviewID": "UR119252121", "Content": "First of all I want to mention the excellenat room service. Towels and bed sheets are replaced daily. The crew was kind and proffesional. Thanks alot!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“You get what you pay for!”", "Author": "Tree1988", "ReviewID": "UR118622185", "Content": "My girlfriend and I stayed here a couple of years ago and picked it purely because it was close to the termini station and was cheap. We expected when we found the street to be looking for a hotel but after walking past it a couple of times we noticed a sign on a wall saying hotel marco polo - 3rd floor! Our room was tiny and overlooked a wall but we were happy with it because it was clean. Had heard bad reports of the area it was in about pickpockets etc but were careful and never had any problems. The breakfasts weren't very good with just cereals and a couple of croissants left out but we usually went to the supermarket and were happy enough. There was also renovations going on while we were staying but we were up and straight out anyway so tried not to let it bother us. Overall it was good for what we needed, a cheap no thrills place in a good central location.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“It's good hotel”", "Author": "Arevik13", "ReviewID": "UR118079973", "Content": "Hi. I stayed in this hotel one week and I want to say that they have very good staff, especialy Gianni. If I come again I'll stay at Marco Polo. He is very polite, knows how to please tourists. Thank you for your understanding and good attitude.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great value and location”", "Author": "Rossbkr", "ReviewID": "UR117388773", "Content": "Just returned from the Marco Polo with my wife, we stayed for 3 nights, We arrived at Midday on Monday. We found the hotel very easily and quickly from the Termini it's literally a 1 minute walk. Upon arrival to the hotel were were treated by a cool (as in not hot) main foyer to about 3 hotels in this building. There's a small lift which is adequate (don't get why it's an issue to some people. When the building was built, I doubt lifts were in their minds, so anything is a plus?) We got into the reception area and were greated to a very friendly 'Boungiorno' by the Yound lad working there! Our Booking was found and after paying the €12 city tax... We went to our room The room was EXACTLY what we expected, a clean but small room... But was perfectly fine, when in Rome, you only need a place to shower and sleep that's comfy? We do! Breakfast was again what we expected and again, perfectly adequate, fresh breads, pastries, cheeses, hams, coffee, all kinds of tea and fruit juice! Over all, this hotel is perfect for a comfy and low cost stay in a truly beautiful city,! I would happily return and recommend to anyone! :-) enjoy!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Flushing, New York", "Title": "“Decent Hotel but Noisy Electrical Fuse Box in the Room”", "Author": "gln126", "ReviewID": "UR117351649", "Content": "This hotel is very close to the Rome Terminal. It is located on the 3nd floor. The elevator is very tiny. If you have a bigger suitcase, you might need to lug it up by yourself. The room 306 was clean, decent size, and the bed was very comfortable. It has a mini fridge and a safe in the room.The bathroom has a bidet and a toilet. The only problem was the electrical fuse box was too LOUD. (it was like turning on an old fan next to your ears) I need to wear earplugs to sleep. The room required the key card to turn on the electrical power. Thus, it was very hot when we return to the room. Breakfast was good...(cereal, milk, croissants, rolls, cheese, fruit, coffee, tea, juice, and water) The Chinese restaurant next door was pretty good. It costs from 5.50 euro to 11 euro for the tourist menu. Pretty good deal.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Pasadena, California", "Title": "“Avoid this hotel!”", "Author": "Pagel38", "ReviewID": "UR116718851", "Content": "When we arrived we were told our reservation could not be found and they charged our credit card for all 3 nights and sent us to another hotel that was not comparable at all - dirty, clogged sink and no sheets on one of the beds! When we complained they said they could not refund our money. This seems to be common based on other reviews. This hotel is misrepresented in pictures on the internet. The breakfast does not have baskets of fresh bread and meats and cheeses as pictures indicate. The amenities listed are not in the rooms either. Tha safe was not functional, there is no fridge or minibar, the bathroom had mold on the walls and ceilings and it is overpriced for what you get. These people are ripoff artists! There are hundreds of other hotels - don't take your chances on this one!", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Very well appointed hotel”", "Author": "alison c", "ReviewID": "UR116462553", "Content": "We spent a few nights in this hotel which is ideally situated for the main Termini, airport bus, metro and exploring Rome. The hotel is on the third floor, reached by a lift.The reception is manned 24 hours. Breakfast, which is basic but adequate, is served for three hours every morning.The main asset in the hotel is the staff, especially Lorenzo who we had most dealings with. They were all well informed about Rome and nothing was too much trouble for them. The hotel is kept spotlessly clean and the rooms are very comfortable. Air conditioning works well. I left a box of earrings in the hotel. I contacted Lorenzo telling him where I had left them. He then gave me every assistance to ensure the earrings and a camera card were returned to me, in Scotland, as soon as possible. I am extremely grateful for this. We enjoyed our stay and, if back in Rome, would stay there again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“We loved the place and service, and we will be back in the future”", "Author": "Irene155019", "ReviewID": "UR115907780", "Content": "We spend a Christmas week in Marco Polo, and we are very happy that we chose this small and friendly place. Kind and attentive personnel, very good service and a clean room. Excellent location in one and a half block from the railway station. Very good buffet breakfast with excellent unlimited coffee. We liked the best our kind personnel of Marco Polo, privacy of our room, and the location of the hotel. It would be a good deal for the guests to find, and for the business to have couple washers and driers in the hotel. Wishing all the best, and hoping to visit in the future, Irene & Liidia.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Two of our three nights were great!”", "Author": "scout1222", "ReviewID": "UR115549933", "Content": "At check-in, we were told that our room had a plumbing problem, and that we would be rebooked at Hotel Gabriele, a sister hotel that was \"same quality, same amenities.\" Absolutely untrue! We looked up the Gabriele later and discovered it's $30-40 cheaper per night, and it showed. Thankfully nights 2 and 3 were back at Marco Polo, and the room was well worth what we paid. Clean, well maintained, and bigger than some other rooms we've had in Italy/Europe in general. The staff at the front desk was friendly and helpful, and spoke English. The breakfast is adequate for what it is - free. We would happily stay here again.", "Date": "July 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect Location”", "Author": "Vrajs", "ReviewID": "UR113181602", "Content": "Small rooms but comfortable beds, clean bathrooms and decent breakfast. Value for money in one of the most touristic cities of Europe. Easily connected by bus, rail & subway to all attractions. A friendly staff who wil help you when required and they speak fluent English. A must stay for the location & staff. Rome is a city to venture out and just come to sleep at night so a perfect hotel who has such a criteria.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Croydon", "Title": "“Just OK”", "Author": "GJgetaway", "ReviewID": "UR108760731", "Content": "Need a clean bed in a convenient location ? Then this hotel will suit. After a busy day sightseeing in Rome a clean bed is what we needed, however the hotel doesn't impress in any way. Access to the hotel is by a dodgy feeling 2 man lift, the room was small and dark, the shower temperature control hap-hazard. Breakfast very basic, vending machine coffee or tea and a choice of apple or apple for fruit, bread and pastries. But hey, Rome is why you are here and Rome is very impressive.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Good value hotel”", "Author": "stimpy87", "ReviewID": "UR97698275", "Content": "A good value hotel close to Rome Termini train station. The room was comfortable and had a small selection of food stuffs available for breakfast. Free wifi was included in the price I paid. The best thing about the hotel was the helpful staff and the location. Rome is such a walkable city that everything is nearby the hotel and also the metro is quick and convenient. I would certainly consider going back to rome again and staying at teh hotel.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice Value and Location”", "Author": "njab2016", "ReviewID": "UR93665586", "Content": "I stayed at Hotel Marco Polo with my wife and mother-in-law in January of 2011. We enjoyed our stay here, and I would probably recommend it. Overall, it was a nice place for the price in a really convenient location. It is very close to the main train station in Rome, Termini, which is great if you are taking trains to/from other cities in Italy, the airport, or even just the metro around the city of Rome. The breakfast was a typical Italian breakfast with some rolls, yogurt, cereal, etc. It wasn’t fancy, but it was available for several hours in the morning and satisfied us. The staff were generally friendly and helpful. The plumbing isn’t the best; the toilet in our room acted up a couple of times and the shower leaked out onto the floor unless you had the curtain positioned just right. There is a nice restaurant on the street level of the building. Overall, it was a good value and I would recommend it.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“great xmas holydays”", "Author": "JamesMarch", "ReviewID": "UR91967654", "Content": "I had a wonderful xmas holidays in Rome. Me and my family found Marco Polo the best location where to spend our Rome staying. Roome were clean, people great and always gentle and at our complete disposal! I cant complain, and I suggest this hotel to y'all!!!!! James", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“We Liked so much”", "Author": "da__lilaCosta", "ReviewID": "UR91867841", "Content": "We stayed in Hotel Marco Polo and we liked so much. It is a very well located hotel, very clean, the employees are very friendly. We left one of our bags in a car \"transfer \" and they helped us to retrieve it. When we return to Rome we will stay there. We have nothing negative to point out. Family Costa ____________________________________________________", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“GREAT HOTEL AND GREAT LOCATION”", "Author": "kennycamp", "ReviewID": "UR87758933", "Content": "Buy a three day travel pass great value for money you can use it on the metro and the buses I would recomment the airport bus which takes you into the city centre, remember to obtain a boarding ticket from the ticket office located next to the bus stop before getting on the bus", "Date": "November 21, 2010"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Worst hotel ever”", "Author": "mmogaka", "ReviewID": "UR85837971", "Content": "I booked this hotel for 5 nights for about 720 euros ( a double) because I thought it is a nice comfortable friendly hotel. I checked in to the hotel, I have a friend in Rome that I had asked to come and say hallo to me in the hotel... when the friend came, he was registered at the reception, but this friend was not staying over, we had a chat and left. Since I had booked for a double, the intention was to meet with a friend from Milan in Rome, and we would share the room. The friend came the next day, and when I picked my friend from the station and came to the hotel, they refused completely to let him in because my other guest who had come the day before to say hallo, had been registered before... I was not able to let my friend without accommodation and yet I am the one who had invited him... I had to quickily find a new hotel, pay again and checked out from Marco Polo. They refused to refund the money...One receptionist was somehow friendly and willing to talk and help, but two of them were very arrogant, very unfriendly... I had asked for a safe the day I checked in, the receptionst told me that he will come with it shortly, but he never came with it at all until the next day... Very very very unprofessional, unfriendly and unworth hotel.. I will never ever recommend it...", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Greifswald, Germany", "Title": "“Overall a good place to stay”", "Author": "Kolipaka", "ReviewID": "UR81305391", "Content": "I stayed in this hotel for a week. The best thing about it is its extreme proximity to the Main railway station, Termini. Also, the hotel is very clean. The AC was working great. The bathroom was clean and huge for a single person. On the other hand the sleeping room was a bit congested. Helpful staff. The staff were at the reception 24 hours. Also, there are a set of books from Rome guides to Harry Potter which can be borrowed and read. The TV was working great, but I could not enjoy as the programs were in Italian. On one night the light in my sleeping room was spoiled. It was immediately repaired when I came the next day. The hotel was in the 3rd floor with a small lift. One person with his cabin bag can fit into the lift. There is also a small shop just opposite to the hotel where we can buy something very urgent like water/soft drinks/ eatables. Also, there are a few restaurants near the hotel. The minus is that the breakfast is not so great. Especially the bread was really very hard. Also, the sleeping room was small. But, it was ok as I was in the hotel only to sleep. But, for the price taken I wished for a little bigger room.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great choice!”", "Author": "Vivienne072", "ReviewID": "UR79146832", "Content": "I spent a week here with my boyfriend and it was great! Good breakfast, great location - Termini Station is a few minutes walk from where you can easily get everywhere! If I go back to Rome, I'll choose Marco Polo again...:)", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Poeldijk, The Netherlands", "Title": "“This is really an advisable hotel with great personnel!”", "Author": "Lilian042", "ReviewID": "UR75931132", "Content": "The hotel is very close to the Termini station which is really very convenient. From the Termini station you can take all sorts of hop on/off busses. Very kind personnel who advise you on all sorts of trips and nice places. The breakfast was really good. When you are with 4 persons you can best take a taxi from the airport (also to be booked through the hotel) as the cost of the train is higher than the cost of a taxi. Try to book the hotel directly as this saves you money.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Camberley, United Kingdom", "Title": "“A definite must for location and value for money”", "Author": "kegferretfan", "ReviewID": "UR74205214", "Content": "This hotel is located 2 mins from the Terminus and only a 20 minute stroll from the Coloseum, therefore is a very handy location. The rooms were clean and the en-suite bathrooms were spotlessly clean and looked new and very stylish, we were given fresh towels every day. Also at night we closed our windows and used the airconditioning for a peaceful nights sleep. The staff were helpful and friendly and we bought our open top tour bus tickets from them. They also arranged a taxi from the airport to the hotel and also for our return to the airport (very reasonable price and very pleasant not having to worry about public transport, although there was cheaper and regular public transport available). On arrival the hotel had been told by the agent that we had booked two double rooms when in fact we had booked two twin rooms. This the hotel put right straightaway with no fuss or bother. If you require a twin room it may be worth while emailing them direct with your requirements after booking as they had definitely been told that we required double rooms - I was shown the paperwork. My direct emails to the hotel re: hairdryers and taxi service were answered promptly. Even though we arrived at 11.30 am the hotel had made sure our rooms were ready. On the day we checked out they allowed us to leave our baggage with them which enabled us to have a full day sightseeing before returning for luggage and taxi. The breakfast was superb and really set us up for a days sightseeing. There are no facilities for evening meals but there are plenty of restaurants within walking distance. I travelled with my two grown up sons and my mother and we all had a great stay. We would have no hesitation in recommending this hotel to any traveller. The hotel is located on the third floor but there is a lift to the hotel.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Excellent choice”", "Author": "lakers74", "ReviewID": "UR73496647", "Content": "We liked this hotel because it was very clean. The location is ok. Being near Termini Station - it has the advantage of having qiuck access to public transportation as well as many different shops. Also, it is quite close to touristic attractions. The morning buffet was very good, the food was fresh and there was a good variety of choices. The hotel staff was very friendly and ready to help. Everything was nice, working orderly, the staff went out of their way to help us, excellent ac. On the last day, we checked out, left our luggages at the lobby (secure room) and went out for the final day in Rome. That evening when retrieving our luggage, they told us that the maid had found my wife's ring. My wife had thought that it was lost several days before in the crowded/busy tourist spots. See you next year. Robert", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“great hotel, would deffinatly reccomend..”", "Author": "leeuk83", "ReviewID": "UR72962446", "Content": "i have travelled to rome on many occasions and stayed in many hotels and found this to be the best so far!!. the rooms were kept very clean and the air conditions was also very good. the best bit about this hotel were the staff, who were very friendly and helpfull especially the man at the front desk who i think was called lorenzo, he was very helpful.. the hotel is located right next to the train station and city centre so not far at all to walk, would highly reccomend..", "Date": "July 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Don't even go near it!!!”", "Author": "aussie_jetsetter101", "ReviewID": "UR71704241", "Content": "Save yourself from alot of trouble, this hotel is flithy, has cranky rude men at the front desk and does not even have a decent sized lift in the place!!!!!!! Not a pleasent stay at all!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "mexico city", "Title": "“good until...”", "Author": "lizclaya", "ReviewID": "UR69569638", "Content": "When we arrived they asked us if it was our first time in room, then they gave us a map with the bus routes and where to eat and go shopping in central rome. The room was ok, they didn't have good noise isolation, lot of noise from the next door rooms. Flushing the toilet made a lot of noise. Breakfast room was very small. We had to leave the key at reception every time we leave (weird). We asked if we could stay for one more night and they said don't worry we have a room for you, same price, same quality and they sent us to a room to a \"hotel\" around the corner that looked more like a house than a hotel. I think we could find something better in Rome for the same price.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lancs", "Title": "“Nice hotel good standard of room and close to centre of Rome”", "Author": "hudders51", "ReviewID": "UR67665400", "Content": "Friendly hotel, nice room and no outside noise, Breakfast basic , bread rolls ham, cheese etc. but need to get up early if you want everything on offer as it is very slow to be replaced. No tea or coffee facilities in the room . But you get what you pay for, (glad i paid the price from laterooms website)", "Date": "June 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "amsterdam", "Title": "“good location & super friendly staff”", "Author": "cowsandcalfs", "ReviewID": "UR66758529", "Content": "super friendly staff! small room, but clean. Located in handy location.Good breakfast included.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Stay away from this hotel!”", "Author": "Aqua888", "ReviewID": "UR56570630", "Content": "1st, I saw one of the staff put his hands into a coat which was hanging at a hall way where most customers hang their coat. I am not sure if the coat belongs to him, but he is already wearing a coat himself. 2nd, the hotel always tricks to charge me extra fee on internet access by pretending when it was clearly indicated to be \"FREE\" on my booking. 3rd, the pillow was awefully dirty under the pillow case...", "Date": "February 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Mumbai", "Title": "“Awful, this experience ruined our visit to Rome”", "Author": "TaraMumbai", "ReviewID": "UR54760326", "Content": "Beware of this hotel and its staff/management/owners. Our experience at this \"hotel\" practically ruined our stay in Rome. Despite that we had paid in full prior to our arrival (and we did not arrive late, around 6-7pm), our room had been sold. But as we were walking away, there was a room after all! However, they wanted us to pay for \"the upgrade\" - it felt as all they wanted to do was to rip us off. The staff was also very unfriendly. Do your self a favour and stay away from this place!", "Date": "January 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "new jersey", "Title": "“A confortable hotel in every details....”", "Author": "thebestpaul", "ReviewID": "UR54179838", "Content": "I will advice this hotel as the best one ever seen in any details strating from a confortable clime of the personell, a good quality of the rooms and a very good location easy to get to any part or rome. I enjoyed very much my staying because of the good relation with the manager and the entire personell that makes you confortable as it is your house and ready to help you in any needs; I expecially enjoyed the morning with a big continental breakfast and my room was very big and enjoyable in everything!! I hope to come back again and have that much relax never had before!!", "Date": "January 23, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sofia", "Title": "“Good place”", "Author": "LubenZi", "ReviewID": "UR53151596", "Content": "Been there, good place, friendly staff, very good experience, really liked it", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Clean, cheap and close to Bus/Metro Station and downtown!”", "Author": "lele_ballack", "ReviewID": "UR50757600", "Content": "An amazing holiday in Rome! This Hotel is a good value for money, with a great quality. We enjoy especially the welcome and the kindness of the staff when we arrived during the night. The room was large and very clean. Sheets, pillow and bathroom were good! Excellent breakfast, rich in hot drink and juice. Maybe, the external side of the building just needed renovations! The most important thing was the proximity to the bus/metro and train Station of Termini. From there, it was 5 minutes to the downtown and to the main attractions. We stayed in the hotel 4 days and we reccomend this place to everyone would spend a nice holiday (or a relaxing bussiness trip) in Rome! For sure, we'll go there next time in Rome!", "Date": "December 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Shropshire", "Title": "“OK FOR PRICE”", "Author": "voyagerdes", "ReviewID": "UR50502341", "Content": "The hotel was very clean and only a 2 minute walk from the station. There were no tea or coffee making facilities. My travel adaptors did not fit the only socket in the room as it was for a 3 prong plug, so could not charge phone or camera batteries. Mini bar was reasonably priced but we had to ask at reception for a corkscrew every time we opened a bottle of wine. The bathroom was clean although the shower was feeble and did not get very hot. Beds were clean and comfortable. Breakfast was adequate although dining room was too small for amount of guests making it awkward to move around. All in all, we got what we paid for.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Good clean hotel within walking distance of Terravision bus drop off point”", "Author": "NZMartins", "ReviewID": "UR45726201", "Content": "Good, clean and friendly hotel. Air con included and good sized rooms. Instant and powerful hot shower, plenty of storage but no safe. However there is a safe at reception. Like most hotels in Rome, there are 3 different hotels in the same building but on different floors. Shops/cafes on the ground floor and hotels above. This one was on the 3rd floor, however there is a lift. Breakfast was included and consisted of cereal; Pastries; salami; rolls; cheese; fruit juice - buffet style. Good area with coffee bar close by if needed. You can pick up filled rolls from Termini train station downstairs in the supermarket on the right. They are half the price of anywhere else and freshly made each day. Also a good idea to get a Roma pass for 3 days, you will get your money back if you only do the Colosseum; Paladin and the metro there and back to the Vatican. Book Vatican tickets on-line direct with them. Only 4 euros each more and you skip the queues and can pick up a guide book inside for 8 euros that you can take with you! Be careful of ordering tea and coffee outside of breakfast times, you will get charged for it, however it is only 2 euros so not expensive and the staff are very helpful. We will stay there again when we return!", "Date": "October 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "australia", "Title": "“Not Sure if it was Marco Polo Hotel or Fawlty Towers........”", "Author": "gr00mer", "ReviewID": "UR43580965", "Content": "there was a sign outside the hotel that said \"fawlty towers\", we had booked into the marco polo as it was close to train station. no air con as they turn it off after winter!! we asked for a fan, it never came. my wife saw one in the hallway near the dining room and took it. The dining room was small, the meat and cheese were not kept cool. when you press the button for hot water you got sprayed by it. the fridge in the rooms did not keep the drinks cold enough. The toilet in our room was so close to the shower, if a big person had to use it well......", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pescara", "Title": "“A stay to remember”", "Author": "trevendal", "ReviewID": "UR40051717", "Content": "As stated, a stay to remember. A few steps from the center of Rome, within walking distance. Staff friendly and always available for any need. Clean and lovely structure.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City", "Title": "“A wonderful place in the center of Roma”", "Author": "Mikep65", "ReviewID": "UR39751282", "Content": "A very nice and affordable place in the center of Roma, with friendly and professional staff. The rooms are clean and the surroundings safe and close to the hotel. I raccomend this place to evry kind of traveler", "Date": "September 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Istanbul", "Title": "“You must be joking!”", "Author": "Kara59", "ReviewID": "UR39336439", "Content": "We had to stay in this hotel for a week in August with my teenager son and husband. I had arranged this trip by yahoo.travel and had already paid in advance so we could not leave. After I have seen this hotel now I became suspicious of all the traveler reviews. This is not even a Hotel! It is a number of rooms located in the third floor of a five storey building. Every floor is a different hotel. It was like a joke for me when we arrived late last Sunday. In addition to this, When we arrived we found out that our room was sold to someone, although it says \"guaranteed late arrival\" in the itinerary. so they sent us to the hotel on the first floor of the building. (Which was a maybe one star hotel, but worse than ours!). The next day we moved back to Marco Polo. I can say that the only thing that is true in the reviews is that it is close to Termini, the central station. The room was so small when they added the third bed it was impossible to move. The breakfast was scarce, if you think this is continental breakfast it means you have never seen a continental breakfast.! The room they served breakfast had small tables, again impossible to move around. The \"renovation\" mentioned in the features must be only referring to wall colours. The airconditioner and the bathroom tubs were so noisy, it was sometimes impossible to sleep. In short, for the first time in my life I am happy that my holiday has finished. It was a total disappointment.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Antwerp", "Title": "“Very friendly”", "Author": "AntwerpAnna", "ReviewID": "UR36798729", "Content": "The staff was very kind, they give you more information to found the intresting places. The hotel was on a excellent location. Next to the metro and train. You can go on foot to the popular places like the coloseum. The room was a little bit too small, but very clean.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Gold Coast", "Title": "“Great Hotel as a base for Sighseeing”", "Author": "mnmh", "ReviewID": "UR35039511", "Content": "We booked on the internet - no problems. Hotel is minutes from Termini Station but far enough from the noise, Hotel is on the third floor (need to take the lift). A couple of cracks in the walls of the rooms, window view was nothing, lift was small but we didnt care about that, just found it amusing. The staff were very helpfull and breakfast was reasonable. Great base to sightsee from and use for sleeping etc. Room was airconditioned (great since Rome was in the 30's C, fridge worked - cooled our drinks, wine etc. Room was clean, Hotel was secure. At least 2 restaurants in the street and a small grocery shop with a lovely African lady next door. We had no major issues.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "durham", "Title": "“Avoid Hotel at all cost”", "Author": "mdlanders", "ReviewID": "UR34649353", "Content": "We booked the hotel online, after reading the reviews from trip advisor and other sites. It is listed as a 3 star hotel. The hotel is a DUMP, it is maybe a 1 star. The AC does not work. We were booked in the family room which was all beds with no room to walk, we were told that we could have two rooms for 95 euro more for the 3 nights after paying for the family room, then we were charged 95 euro per night extra. Spent over 1000$ for three nights in room. There is another hotel close by called Villa della Rosa would recomend over Marco polo if must stay close to Termini, in Rome. The staff at the hotel is not helpful when adressing concerns, and finally the beddings were dirty and they staff changed them with dirty linens after we complained", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Great value for family of 5 in central Rome”", "Author": "Marcel09", "ReviewID": "UR33680141", "Content": "The only hotel in Rome that accepted a booking for 2 adults and 3 kids in one room and the room we stayed in was recently refurbished to a comfortable modern standard. Location was great with all historic sites in range of a decent walk or bus and metro. Hotel breakfast was basic continental but fine and with decent coffee it was all we needed between the pasta and pizzas! Staff was friendly and helpful with travel tips in Romer.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Very helpful staff”", "Author": "winkun", "ReviewID": "UR32672516", "Content": "The staff are very helpful and kind! My wallet was taken by a pickpocket at Rome. I lost cash, credit cards, drivers license, etc. But fortunately the staff assisted me and arranged everythig to require kindly.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“simply the best place for you !!!!!!!”", "Author": "jumbo12", "ReviewID": "UR26767476", "Content": "i was in rome for 4 days for working ... and I'm really not excited to work and come back without knowing anyone ...well , the hotel Marco Polo is the place similar to home you can find !!! Really clean room , very quite and nice peolpe inside !!! the two guys at the receptions are crazy and nice , they help you always ...and they 'were also so friendly with me!!!!!! thxs my frinds!!!!!", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Haarlem,", "Title": "“Perfect location for daytrips, very kind & professional staff”", "Author": "Agnes_Erwin", "ReviewID": "UR26096793", "Content": "Arriving by train at Termini Station in Rome city centre (costs 11 euros from the Airport, so don't take an expensive transfer if you don't want to, the train ride only takes 30mins!!), we found out the hotel was just around the corner!! Excellent location not only for arriving, tired travellers, but also as a starting point for the many sight seeing trips one will have while staying in Rome!! The first night we spent in a room described in other reviews, very small and not clean, showerhead and hairdryer broken, view on the inside balconies/shaft including the garbage of other people/hotels , etc.. As we were to stay 5 nights, the next day we asked the reception if there was an other room available, which -luckily- there was!!! Totally different scenery!! Nice, big(ger) room, bigger and OK beds, clean, everything working, including TV and mini-bar, nice and clean bathroom, view on the main street, we were very happy to have made the swap!! The internet site of the hotel states the hotel has been completely renewed in the 2001, but this is, obviously, not true. A lot of rooms are apparently still in old state. The reception desk has also not been remodelled as the pictures on the web site lead to believe. Hopefully they will not restyle it, because the counter of the reception desk is beautifully decorated with (fake?) marble, totally in line with the spirit of the city. To Dutch standards the breakfast was poor(ish), but we think it was OK for Italian style. A lot of sweet croissants, jams, Nutella, etc.. But no fresh juice, eggs, or ham (but there was Mortadella!) or common cheese (they had a kind of sweet and a cream cheese), no fresh toast, the fruit presented was so-so. Coffee and tea were OK! The breakfast room is also kind of small, especially for big people from Holland, who like their space J ! The service we met was EXCELLENT! Very kind people, especially the brothers at the reception desk (Lorenzo and Diego) and their colleague from the night shift (we didn’t get his name). They really made time for us, to make our stay as pleasant as could be! Also, we found out that Italian people tend to be a bit of surly/have a closed character at first sight, but if you take an effort into making conversation, they open up like beautiful flowers. So a tip from us, if you want something done from Italian people, try asking it nicely first! And say hello (bon giorno), goodbye (ciao or arrivederci) and please/thank you (prego/grazie) all the time! They really appreciate that!! We had a wonderful stay in Rome and our stay in Marco Polo Hotel really made a contribution to some good memories!! If the Trevi fountain does it’s work properly: we will be back! Erwin & Agnes Stoof-Schreurs The Netherlands", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Prague", "Title": "“The perfect choice for a holiday in Rome!”", "Author": "zborovska", "ReviewID": "UR25677443", "Content": "When me and my girlfriend arrived by train in Termini Station(the central station)from the airport we were so tired....but we immediately found out the Hotel Marco Polo was only 2 minutes walk away!!!! :-) At the reception two goodlooking and very kind guys(brothers Lorenzo and Diego) welcome us,giving us all the info we needed and showed us the room that was really brand new. Infact they explained to us all the rooms had been totally renewed from 1 month!!!! Large and confortable kingsize doublebed,LCD TV ,wifi,minibar,really couzy bathroom with shower and smart decorations and very clean,like the rest of the hotel! In the morning we experienced the breakfast room(new as well),so cute: a buffet breakfast with everything you want included the famous roman \"cornetti\"(croissant)plain,with jam or creme! The location of the hotel is fantastic really close to EVERYTHING, i mean close to the main metro and bus station(only 2 minutes walk!)and still close to amenities,monuments,historycal center,bars,so good restaurants,shopping center. We really can't say anything that was wrong in the hotel! A better secret to discover the city in a Roman Way is definitely to ask to Lorenzo and Diego...they re from Rome and they know Rome so well! They ll be interested and available everytime to give you the right and coolest advices for the day life and for the nightlife! But if you have an idea to attend a football match at the Stadio Olimpico be careful to ask them infos about SS LAZIO 1900(first team of the capital)or AS ROMA 1927(with more fans) because the 2 brothers...support opposite teams!!! :-D The hotel totally satisfied our expectations and it helped us to spend an amazing vacation in the world beautifullest city!", "Date": "March 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Australia", "Title": "“Wouldn't put a stray dog in it - Stay well away!”", "Author": "EuropeanVacation08", "ReviewID": "UR23905723", "Content": "After arriving in Rome - this hotel FAILED to schedule our airport transfer which resulted in a VERY scary cab ride into the city costing 80 Euros per car. After some HOSTILE negotiations the concierge was assaulted by the cab driver. The lift in the hotel takes only one guest and suitcase at at time. When you arrive at Reception it is like walking into the pound. The \"Quad Rooms\" were nothing like is advertised on the website. We were two parties of four adults and we were placed in a room no bigger than a standard bathroom with one VERY OLD STAINED double bed and a set of BUNK BEDS!!! The bathroom was nothing less than septic with mould and scum present all over the bath recess. We were almost tempted to wear thongs in the shower. The shower head was broken and we had to squat to get under it while trying to juggle shampoo and conditioner bottles as there was no shelving in the recess for anything. The toilets were susceptible to not flushing , there were no tea and coffee making facilities and at the risk of getting hospitalised with food poisoning, we refused to eat the stale cereal, warm milk, rotting fruit and room temperature ham (the six pieces that were on display) for breakfast. The reception staff were LESS than helpful and extremely rude and I was called a liar after a dispute about the room size. This absolutely ruined a part of our European holiday. Can I please have that night of my life back???? Warning to future travellers - DO NOT GO THERE - STAY WELL AWAY!!!!!!", "Date": "January 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oakland, California", "Title": "“Very basic, but good deal for the $”", "Author": "MN_SF", "ReviewID": "UR23646281", "Content": "I stayed during the height of summer and was REALLY happy they have air conditioning! The location around the hotel is quite busy with walkers-by, and it's really close to the main Roman train station, Termini. Don't expect a stellar room. It's good deal for the money, though.", "Date": "January 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sugar Land, TX", "Title": "“Great Value Hotel”", "Author": "TexasLSUFan", "ReviewID": "UR22720511", "Content": "My family of four stayed at the Marco Polo during Thanksgiving Week of 2008. The hotel is a great value, inexpensive, clean, next to many affordable but tasty restaurants. But the best thing about this hotel is the friendly service of the hotel staff. They were very helpful in discussing potential trip improvements and weather adjustments during the week. They looked up information on the internet for us and they recommended good restaurants all week including making reservations for us. The rooms were adequate size for Europe and we had a private bath. The breakfast area was adequate and the food made for a good jump start in the morning. The hotel is located on the third floor with both stairs and small elevator access. The rooms were well heated when needed to be. The location is one block from the Train Termini and is within walking distance of many good local restaurants. It is located on the better side of the Termini. Cabs were about 10 Euros just about to any spot in Rome. We thoroughly enjoyed our stay at the Marco Polo and our time visiting fabulous Rome. Overall, a great value hotel.", "Date": "December 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“Good Location”", "Author": "WorldTravellerMumbai", "ReviewID": "UR22654653", "Content": "The good thing about Marco Polo is the location. It is very close to the Roma Termini Station. However, the Hotel can seriously do with some revamping. The lighting is terrible. There is no way someone can sleep peacefully because one can hear everything that goes on in other rooms. Not the best experience. The breakfast can also do with some additions. It is extremely basic and if you get to breakfast by 9 am, all you will get is juice and coffee as the Hotel does not replenish the breakfast.", "Date": "December 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“Nice hotel and convenient to Termini”", "Author": "pgolden", "ReviewID": "UR20642102", "Content": "We were looking for a place to stay for one night upon our arrival in Rome for an Amalfi Coast trip. This was ideal for our purposes - close to Rome Termini (two blocks) and in a safe location. Rooms are fine, and we were upgraded to the newly renovated rooms upon our stay at the end of our trip. Joseph, who I believe owns the hotel, is from Philadelphia and speaks great English. (Just don't tell him you're a Mets fan!!!) It's on the third floor, which is good for street noise, and there is a lift for those with problems climbing. Would highly recommend this for those needing to stay in this part of Rome.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "liverpool", "Title": "“Nice surprise”", "Author": "harrylfcpaul", "ReviewID": "UR20009469", "Content": "We booked this hotel because was cheaper and really near the station. We stay there for 4 nights with my girlfriend. The room was very big and meticolous clean. I particularly liked the buffet breakfast. There was juice, yogurt, croissants, rolls, jam/honey,choccolate, ham, cheese and a hot drink more than adequate. The staff was friendly and really helpful to offer a good direction for visit the city.However is also available a free wireless connection in the hotel. I suggest this hotel to everyone. See u next year.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "birmingham", "Title": "“HIGHLY RECOMMENDED HOTEL!!!”", "Author": "GOLDFISH_318", "ReviewID": "UR17278177", "Content": "The hotel was lovely....had friendly and very professional staff who made our stay there even better. The location was great for site seeing....everything was minutes away. Lots of places to eat around the hotel and some nice bars and cafes near by. The rooms were clean and spacious and had everything you need in them....decor was nice and up to date. Brand new breakfast area and bar...very modern and great breakfast spread...overall a very pleasant environment. Im going to Rome again and definately booking at this hotel!", "Date": "June 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Very happy with our stay!!!!!”", "Author": "cvhjzr", "ReviewID": "UR17141602", "Content": "I booked my family room(3 adults & 2 children) 5 months in advance We also booked a car for pick up and return to the airport. The driver was waiting for us and took us right to the hotel and back to the airport without a problem. Small lift which took one person and two bags at a time. The staff was great! We stayed for 5 nights. Diego & Lorenzo very helpful they booked our visit to the Galleria Borghese. They gave great directions to every church, museum, fountain that I wanted to see! The a/c worked, we had hot water when needed. The breakfast room was small but we made sure we were up early, ate then got ready for the day. Always found a great place to eat in the area, supermarket was in walking distance. This is a place for people who are going to be out all day and need a clean safe place to sleep. Very close to all the buses and trains to get you where you needed to go. I would stay there again.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“Great hotel!!!”", "Author": "amyj123", "ReviewID": "UR15228116", "Content": "Lovely hotel....extremely conveniently located, basically just opposite termini so all tourist attractions are minutes away. Plenty of places to eat round the hotel aswell. Staff (Lorenzo and Diego) were very friendly and helpful and made our stay there even more enjoyable....was sad to leave!Highly recommended and would definately stay there again.", "Date": "April 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Really Enjoyed our Stay”", "Author": "Doolin300", "ReviewID": "UR10770678", "Content": "A group of family stayed in this hotel for 3 nights last november. The hotel rooms were really comfortable and cheerful. Very close to everything. Practically right across from Termini station. The staff were extremely nice couldnt be more friendly. Salvador the night porter was so so helpful. We got married in Rome and the hotel really added to the occasion. It was like we knew them all our lives!! Would stay there again.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Don't make a reservation to stay here!!!!”", "Author": "itagurl07", "ReviewID": "UR8190190", "Content": "First of all, this is not a hotel. It is a pension. When we got there, we gave them a credit card to pay for the reseveration. After they charged us, they said that they didn't have a room for us due to renovation. Instead, they wanted to put us in another room, in another hotel. In addition to this, they would not give us a discount. We went to look at the other room, it was really small & looked cramped. Not only that but, we later found out that it was a hostel costing 30 euro per night. This was 110 euro less than they wanted us to pay. My friend got angry and complained. The staff at marco polo said that we would not able to find another hotel in rome during the busy tourist season. It only took her a couple of tries to find another one. We ended up staying at Hotel Marghera instead. The staff were so much nicer & more honest there.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Northern", "Title": "“Poor air-conditioning”", "Author": "AuntB5", "ReviewID": "UR7973248", "Content": "Excellent location. Two minute walk to Termini station where metro and buses available to all parts of city. Hotel room very small and air conditioning does not work so not recommended to stay in summer months.", "Date": "June 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Holywood Northern Ireland", "Title": "“ok”", "Author": "kathp1978", "ReviewID": "UR6821593", "Content": "I stayed here with my Mother and sister for 5 nights, The hotel was easy to find. But its on the 4th floor and the lift is only big enough for one person and their bag, so it took a bit of time to get up there. The hotel is clean but boy is it small, we had booked a triple room which we got only thing is when there are 3 adults with bags its really tight, there was one wardrobe but no where to store suitcases. The breakfast room is TINY, ther were 6 tables and you can sit 2 at each, my advice go out for breakfast. Its in a good area for transport, but the restaurants near by are not good, best place to eat is the side streets off Piaza Navona. I will be back to Rome but will stay somewhere else.", "Date": "February 21, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Not Impressed!!”", "Author": "I_LOVE_MY_ITALY", "ReviewID": "UR6563052", "Content": "My overall experience at the Marco Polo Hotel was less than impresseive. I was disappointed with the hotel itself and felt that it was overpriced. Aside from the the american desk clerk (John?) who worked with us through our issues, I was disappointed with our stay. I don't belive that I could recommend this hotel to anyone.", "Date": "January 7, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“beware”", "Author": "jlboston", "ReviewID": "UR6556999", "Content": "We booked the hotel from mbetravel-hotel.com. When we arrived, the manager told us the room we booked had some problem. We were given a room 3 blocks away and the room would be \"as comfortable and just more spacious\". He sent someone to take us to that other hotel (Eurorooms). It was a very small hotel (2 stars) and the room had no quality. We believe Marco Polo sold out their rooms (or permitted some kind of double booking). They could charge customers at a much higher rate than the internet rate (96 euros) we had. By moving us to a cheaper hotel, they could make good profit. Do not let them move you to a different hotel!", "Date": "January 5, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Not a three star”", "Author": "JoSve", "ReviewID": "UR6313072", "Content": "We booked a twin room for 3 nights. The hotel canceled our reservation without giving any message before arrival Rome. They did not accept Diners Club as a garantee - the same card as we used when booking the hotel at booking.com. We did not get a twin room, but a small and shabby double room. This hotel is not a three star. The room is very small and the heating was out of function. It was very cold during the night. The shower did not work. There were only a few tables at the breakfast area, so we had to wait for a long time. Find another hotel in Rome.", "Date": "December 1, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Not the best”", "Author": "Perth-Gurl", "ReviewID": "UR6060954", "Content": "Airconditioner did not work. Shower had hardly any hot water and when the hot water was on, it came out as a drizzle, you could however, have a fully pressured cold shower. Toilet also leaked and made a horrible noise flushing. After being told that someone had come in to fix it 2 days in a row and everything was now working, it still didn't work on third day. The hotel did have a good location though.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Gr8 location, quiet, excellent staff”", "Author": "Molyns", "ReviewID": "UR5890672", "Content": "We stayed here for 4 night in September. Price wasn't cheap (160 euro/dbl room) but that seems to be the norm in Rome. Overall a very plesant experience. Staff are excellent - Very friendly and helpful with excellent english. Rooms are clean, average size and very quiet. The shower in our bathroom wasn't the best (room 309)but was adequate. No views from bedrooms but I would stay here again due to the excellent, quiet location. We felt this area was safe at night too contrary to other reviews I've read which highlight the area near termini as not the safest - we walked home every night 3 or 4am and felt as safe as we would at home. Overall a positive experience and I wouldn't hesitate to recommend to anyone.", "Date": "September 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newark, United Kingdom", "Title": "“Satisfactoy but a little tired”", "Author": "Tickle64", "ReviewID": "UR5883249", "Content": "We stayed at this hotel for 3 nights on a recent visit to Rome.This was a last minute trip so our choices for accomodation were very limited. The Marco Polo's best attribute was it's location. Very near to the Termini Train/Bus/Metro stations, so getting around Rome's many attractions was very easy. The Termini station is also the major drop off point for conecting coaches from Ciampino Airport too. The Hotel is on the third floor of a bulding, but it does have a lift of sorts to get you and your cases up to it. The hotel is fairly small and offers clean, functional facilities but it is far from elegant. The rooms although clean, are small and looking a little tired in some areas. Do not expect any sort of view out of your window as ours overlooked a rather scruffy courtyard belonging too the neighbouring fast food place. The staff, particularly on reception are extremely helpful and very pleasant and will do their best to ensure that your stay is without any problems. The breakfast room is minute and we had to wait two out of the three mornings for a table In summary this is a budget hotel which offers clean, nothing fancy facilities in an excellent location. I would stay here again although I intend to try other hotels on our next visit to Rome.", "Date": "September 27, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "1"}, "AuthorLocation": "Monte Sereno, California", "Title": "“OK if Rome is full-good location”", "Author": "jpcali", "ReviewID": "UR5430454", "Content": "Stayed here in two rooms for a family of 7. Location near the train was helpful. Rooms were incredibly small, a/c was inadequate by far, water temp and pressure was inconsistent. After a long hot day taking in Rome, not where you wanted to return to. If we visit again, we will stay at the Holiday Inn or another hotel outside of the center and shuttle in. Can't say we would be back. Staff was the one bright spot in our stay, helpful and kind.", "Date": "July 5, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“don't go to this hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4826841", "Content": "This hotel is only the 3rd floor of an old building. The reception and the rooms are in the same corridor so you can hear people at any time of day and night, our room was so small that we could hardly move, the brekfast room has 5 tables for 2 people, altough there are may be twelve or more rooms.There is a very bad smell in the room. The district is rather bad and ugly. Don't go to this hotel, it really isn't worth even 60 euro whereas we paid 120€.Also they didn't make the discount they had promised when we got there.", "Date": "April 1, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "PA", "Title": "“Not for Me”", "Author": "BeccaBelle", "ReviewID": "UR2961325", "Content": "I really disliked this hotel. The door to our room would not open with the key and it took over 20 minutes to pry it open. When the door finally opened, I took one look and walked right back out! Ugh! The location was not great, but we never walked alone at night. We walked a lot during the day and had no problems. They did offer an okay breakfast every morning. Service was adequate - I can't say I was overwhelmed with their kindness, but I can't relay any true issues either. To be fair, we were not staying in an \"updated\" room. Some of our group did and they were not as perturbed. However, since the elevator was not working during our stay, we were somewhat relieved we did not have to climb six flights of stairs during the hot summer months. We purchased a fan to get through the humid nights...and to drown out the street noise. I cannot recommend this hotel.", "Date": "December 29, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Average”", "Author": "A TripAdvisor Member", "ReviewID": "UR2819719", "Content": "While this is not the most glamourous hotel, it does provide the basics: a decent, quiet place to sleep, and breakfast. The rooms were not particularly neat and clean, and the bathrooms should really have been a lot cleaner, and our window broke, leaving the staff a little dumbfounded. Overall however, the hotel is liveable, and the service was pretty good and very helpful, providing maps and other tips. The location was probably its best attribute, just minutes from Roma Termini, making getting around easy. Would recommend it to anyone looking for a cheaper stay in Rome.", "Date": "November 11, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hull England", "Title": "“A team of real troupers made our stay!”", "Author": "ivvey2004", "ReviewID": "UR2772306", "Content": "After a terribe start to the holiday where we found when we arrived at the Airport that our original accommodation was actually located 30 miles outside Rome, and not 5 miles as they had stated on their web site. They also refused to collect us as arranged, so we cancelled our original hotel with the kind assistance of Fulvia, the Airport Hotel Information Desk clerk, who went out of her way to help our predicament. She cancelled the original booking and found us this small but clean hotel right in the centre of town. Staff here were fantastically helpful, giving us maps, information, booking taxis for us, and recommending the most fabulous restaurants. They even rang ahead to tell staff to treat us well - which everyone did! We have nothing but praise for them. I had my purse stolen from my handbag on the 64 Bus, on the last day, containing credit and debit cards and over 100 Euros. The Police were speedy and efficient but the thief was not apprehended unfortunately. However, the hotel staff lent me money, made all the necessary telephone calls for me to cancel my cards and were totally supportive. The hotel cost is a little high but it is Rome and it was still full of tourists so accommodation was difficult to find, but it was clean and comfortable. Breakfast was basic but included juice, milk, coffee, bread, cheese, meat, jam/preserves, cereal and coffee/tea. The cheapest cappucino in Rome (Euro1.10) can be found just across the street at the Termini (which has a fabulous range of shops and restaurants).", "Date": "October 22, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Minneapolis,Minnesota", "Title": "“You get what you pay For”", "Author": "A TripAdvisor Member", "ReviewID": "UR2131823", "Content": "This is not a 5 star Hotel- located blocks from the train/bus terminal. The rooms were clean-inexpensive, and served breakfast daily. The selection of food was small - but included in the price of the room. The staff was helpful. Many local stores, shops with access to cabs,bus, and trains. Be sure to look at map of Rome -a word of the wise --A walk from the Vatican to the Marco Polo will take you a long time !! But you are there for everything in Rome --the bus ride takes 10-15 minutes at most.", "Date": "May 31, 2004"}], "HotelInfo": {"Name": "Marco Polo", "HotelURL": "/ShowUserReviews-g187791-d269236-Reviews-Marco_Polo-Rome_Lazio.html", "Price": "$84 - $243*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Magenta 39</span> | <span class=\"extended-address\">3rd floor</span>, <span class=\"locality\"><span property=\"v:postal-code\">185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "269236", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ba/6b/ba6b4145c975f16c4d7368b0a47c6db15large.jpg"}}