{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Bristol - England", "Title": "“This place really sucks, do not go here!”", "Author": "jonevs", "ReviewID": "UR128238980", "Content": "After asking for a river view I was told that these are for guests that pay more money!.. Once shown to my room I was greeted by a strong musty smell that was quite overwhelming. None of the windows opened and the view was just awful... The beds were also in a terrible state and wasnt comfortable at all. While we was there we had our own towel taken from our suitcase, I guess this could be a mistake as it was a plane white one, but it was expensive and when we mentioned it to the staff they couldn't care less.. the spa is only 10 euro, but only consists of 1 little steam room and 1 sauna. If you want a massage you have to pay at least 100 euro's!.. There inst anything positive I can say about this place.. Oh yeh, close to the train station.. Just do not go", "Date": "April 20, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“what a gem of a hotel!”", "Author": "CrystalWard", "ReviewID": "UR117804590", "Content": "this is a wonderful hotel in east berlin and only a couple of short blocks from the train station. i felt safe in this neighborhood going out for dinner alone in the evening. the staff are warm, welcoming, friendly and very helpful. there is free wi-fi and a free computer for guests' use in the lobby. they have bicycles for rent - only $10 for 24 hrs. when i was there. there are lots of restaurants, bars, and sights to see that are a short walk or nice bike ride away. the rooms are very comfortable and be sure to get a massage at the spa while there. i changed my room upon arrival and was glad i did. the river view was fantastic! my bathroom was in the hallway, but it was locked 24/7 and i was the only one with a key. i would definitely stay here again!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great balcony view”", "Author": "Alex N", "ReviewID": "UR117146517", "Content": "Loved the 4 star room, big bath and spa. The balcony view over the spree was terrific. We would stay here again. The only downside was we booked ages in advance but when we checked in their advertised rates were a lot lower than we paid, over 3 nights we paid 50 euros a night more than their walk-in rate but hey it was out honeymoon!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“A quirky but fun adventure”", "Author": "stevemusic", "ReviewID": "UR115970035", "Content": "This hotel is certainly worth a try. By the Spree, breakfast with home-baked bread, near the more picturesque parts of E. Berlin. Helpful, but formal staff. As an artist I was treated with a special kindness, amidst the truly unusual decor and ambience. My room was by the river, so I was awoken by the sound of the boats (which was special to me, but to others I could imagine as a challenge!). Recommended for the adventurous and young at heart.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "murrieta", "Title": "“Great Location but some rooms can be noise”", "Author": "taxchik", "ReviewID": "UR81617021", "Content": "We arrived at the hotel at Midnight and found the lobby closed, fortunately there was a restaurant below that knew to send me to the bar next door where I could pick up my room key. There was a set of confusing instructions and going through 3 or 4 locked doors to get up to my room, the room was facing the street and very very noise. Also there is no parking available and if you park on the street you could it towed or ticketed. The good news is that when I called the desk first thing in the morning they more than accomodated me, they very quickly provided us with a new better room (at the same price) and very quiet, offered us use of the spa, and sent someone to our room to transfer our baggage to the new room. The location is right on the river and the restaurant next to the hotel is great, 2 nights we sat on the patio over looking the river and had drinks or dinner. You can see the Friedrickstrause station from the hotel which was very convient and everyone was really nice. Just make sure you ask for a quiet room and get there before those close there reception at 10p and don't bring a car.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Good Hotel - Not fancy but great location and friendly and helpful staff”", "Author": "flytoomuch", "ReviewID": "UR42926753", "Content": "Booked a \"Standard Room\" direct with the hotel - after not receiving a confirmation, called and they sorted it out okay (very apologetic) Great location, very close to everything - was traveling by myself so clean hotel, good bathroom etc was all that was required. Close to bars, food and the like - a good recommendation was given by the hotel staff and about where to eat. Spa was good - but very quiet in the evenings - at night only a few people about. A good mix of locals (well not English speakers) as well as people staying in the hotel. When I was there they started charging for the spa rather than it being free with the more basic rooms - only 10E including Towels etc. Everyone was very friendly, no issues, clean, straightforward. Free Internet access on a computer in reception. No mini bar, but a fridge with a free bottle of water and a suggestion that you can buy your own drinks etc for the mini bar from the supermarket or train station etc - not here to rip people off. Would certainly stay there again, but if I was staying with my partner I would go to a higher room category than \"Standard\"", "Date": "September 19, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "USA", "Title": "“Fabulous spa included for free even for economy rooms”", "Author": "flashnomad", "ReviewID": "UR38766707", "Content": "Traveling with my teen-age son, I found a room here cheaper than if I had booked into the Youth Hostel around the corner... and it included use of the Day Spa, the best in Germany. Our room was very comfortable and it had a balcony looking over the Spree. I photographed the other rooms- many very posh - and have put a slideshow on my website, http://www.flashnomad.com Make sure you ask for the discounted rate if you or your companion is an artist... or if you book three days in advance. Regardless of which room you choose, have a sauna in one of the three different ones they have every day!", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Quirky....great service and a fantastic location”", "Author": "Wuffa", "ReviewID": "UR29834856", "Content": "The hotel itself as a bit unusual. The decor is reminiscent of a '70s porno film and the rooms are accessed via a concrete (albeit painted) stairwell....and reception is shut after 10pm! However, overall it was a great expereience and I will definately go back. The staff were lovely; polite, friendly and helpful. The spa was a nice touch....a big sauna and decent facilities. The room was spacious and clean with great views over the river. The location however is the main thing, right on the river with a great cafe terrace for those sunny days, and a short walk from the shopping of the Friedrichstrasse and the Unter Den Linden. The old east is also so much more vibrant that the Kudamm and there are some fantastic restaurants just around the corner. I would completely recommend this place....if you like something a bit off beat!", "Date": "May 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Great Place for a romantic Stay”", "Author": "Sandokan62", "ReviewID": "UR10073413", "Content": "If you want to spend a few days in Berlin and combine it with a romantic experience then you should definitively go to this place. Make sure to book the superior rooms or suites, some of the suites even have exclusive settings like whirlepool. The rooms are not one look a like and the hotel itself is rather a boutique hotel. Great SPA with great view from the Sauna on the Spree River. No Restuarant or Bar, but just in walking distance there are approx 20 Restuarnats and Bars that will sadisfy your choices. Located near the Friedrichstrasse Railway Station and walking distance to the famous Unter den Linden Allee.", "Date": "October 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "kerry ireland", "Title": "“friendly functona hotel”", "Author": "sean-tKerryIreland", "ReviewID": "UR6552694", "Content": "If location is a priority for you and you possess a healthy sense of \"ostalgie\" (German slang meaning a sense of nostalgia for things from the former East) then this hotel just might suit. Situated on the banks of the Spree with some of Berlin's best shopping on Friedrichstrasse on one side and some cracking restuarants ond nightlife on Oranienburgerstrasse on the otherside this apartment style hotel offers a very convienient base. Staff are friendly and helpful but bear in mind thay all clock off at ten pm so don't forget your night key. Rooms vary according to budget, we took a basic double which was reasonably clean and comfortable and what we felt was a realistic enough price. The spa attached to the hotel offers a favourable guest rate of ten euro for use of the sauna, steam and relaxation room. All towels, slippers etc are provided and this represents an excellent value chill out before a night on the tiles. You may want to book in advance for other treatments as spa is big business these days and this place is no exception. Lobby is bright and cheery and well stocked with tourist info. The bar off the lobby is nice enough to have a coffee or a beer in and watch Berlin go by also.", "Date": "January 4, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PARIS", "Title": "“Some rooms are really worth it”", "Author": "Eric_X", "ReviewID": "UR5580683", "Content": "Even if I stayed in this hotel approximately one year ago, I decided to write this review because of the mixed tone of the reviewers. This hotel has in fact two in one. I experienced both because I spent the first night in one part (I was alone on a business trip) and two other nights in the second one (my girlfriend joined me for the week-end). The room I spent my first had nothing exceptional, and if my evaluation was based on this only experience, it would not have been very good. But, my evaluation is based on the two nights we spent on the second part of the hotel. An expensive (over 200 euros per night at the time) but wonderful experience. Worth the price. We had one of the rooms with a bronze bath tube, and a panoramic view over the Spree (the room had floor to ceiling windows through which one can see without being seen from the outside). The major drawback was the cleanliness of the windows (Ok but not immaculate). One also have to appreciate the decoration: a bit peculiar (I assume the style is not to be taken litteraly).", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Buckinghamshire", "Title": "“Great location, quirky hotel”", "Author": "Buckinghamshireman", "ReviewID": "UR5026839", "Content": "I stayed here one night on business, having had the room booked for me by my German colleagues. The other reviews on this site are pretty accurate. The location is great, right on the river side, but the hotel itself is rather quirky. It seems to be a mix of private residencias and hotel rooms, on the various flooors. My room was run down and functional. The curtains were old and plastic and everything had been painted with amateurish art deco flourishes. However, it was clean and I was happy staying there. As a note to any football fans, it is minutes away from a red light district, but as a note to families, I didn't see any of these ladies at all, when I walked down the same street looking for lunch during the daytime. If you can get a good deal on this place and don't expect luxury, then there would be no harm trying it out.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "England", "Title": "“Very dissappointing”", "Author": "A TripAdvisor Member", "ReviewID": "UR4193526", "Content": "I stayed in this hotel recently. Cheap it was not!, at €130 for a twin room and that did not include breakfast or a river side view! To get from the hotel reception area to the bedroom was itself rather curious. You had to leave through a door and enter a common area before unlocking another door to access the lift. When up on the second floor you had to once again use the key to unlock a second door in order to enter a narrow corridor with a very low ceiling. Very strange. The decor in the room was old and spartan, faded oranges and yellows, beds without head boards, plastic-like side lockers and a radio attached to the wall that seemed to be 25+ years old. The hotel closes down early at night again leaving you to enter the hotel through a rear entrance and unlocking all the above doors. I believe the standard in the hotel was not equal to the price. You won't find me returning there even if it is in a good location.", "Date": "December 6, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Co. Meath, Ireland", "Title": "“Don't stay here unless you're a backpacker”", "Author": "Aldaris", "ReviewID": "UR4158556", "Content": "My husband and a friend are currently staying at the hotel and he phoned me from Berlin to contact this website to say 'we are so sorry we picked this hotel for our break'. The standard of accommodation he described as 'awful', not even a headboard on the beds and decorated in brown/orange hues. Maybe Irish people are spoiled by accommodation in this country-I don't know. He couldn't understand how previous reviewers thought the hotel was fine. He wasn't expecting a Meridian style hotel for the price but said he has stayed in better hostels in Ireland.", "Date": "December 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location and good value”", "Author": "A TripAdvisor Member", "ReviewID": "UR4007452", "Content": "Stayed here for a weekend with a group of friends. The location is perfect as it is so easy to get anywhere from here on the subway / trains (including the airport) and by walking. There are lots of great restaurants and bars close by and the friendly staff will give you help on where to go. However, the standard rooms are that so if you are wanting something other than a place to sleep then I suggest you pay extra for a river view etc. I would stay here again. PS. breakfast is definitely worth it and goes until 12pm!", "Date": "October 11, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Outstanding Value and Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3211371", "Content": "This hotel is a great value for its terrific price and even more terrific location. Just inside the old East Berlin, it is a block from the famous Berliner Ensemble Theatre and a block from a major transportation hub/subway station. You can easily get anywhere in Berlin in its efficient subway system from here. Countless restaurant and nightlife choices within easy walking distance. Not particularly strong on shopping, if that is important to you. This is simply a very interesting part of the city. The hotel's English speaking staff is very friendly and helpful. Several things should be noted, however. The hotel is rather spartan. Some of the rooms are quite small. This is not a luxurious place. And the hotel is locked up after 10 p.m. A guest can get into the building with a room key, but there are no services available after 10. What do you expect for this price?", "Date": "February 19, 2005"}], "HotelInfo": {"Name": "Riverside City Hotel & Spa", "HotelURL": "/ShowUserReviews-g187323-d269204-Reviews-Riverside_City_Hotel_Spa-Berlin.html", "Price": "$64 - $131*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">106 Friedrichstrasse</span>, <span class=\"locality\"><span property=\"v:postal-code\">10117</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> (Formerly Hotel Artist Riverside)</span></span></address>", "HotelID": "269204", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4e/07/4e07b669d3819e172be4b8458e6dfe9e2large.jpg"}}