{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Crystal, Minnesota", "Title": "“Resort of many smells and just plain filthy”", "Author": "Janine R", "ReviewID": "UR139277704", "Content": "My husband and I had reservations at the Desert Inn. When we walked into the lobby I knew we made a mistake. The smell was terrible. We got our room key and parking pass. We parked the car and went in to find our room. When we got to our floor the hall was dark, dirty and smelled bad. We walked into our room and it was gross. The smell was so bad, We did not sit down because the room was so dirty and the chairs in the room had been cut with stuffing showing. I then pulled the sheets away from the mattress and they were brown with filth and age... We looked out on the balcony and the grounds were dirty, the outside table and chairs were also dirty. I had tears in my eyes, my husband told me that we were not going to stay. We walked next door to the Holiday Inn & Suites and booked a room with them. We then walked back to the Desert Inn and my husband went in and gave them back our key and parking pass ~ I could not go back in to that dirty smelly place again. PLEASE DO NOT BOOK A ROOM AT THE DESERT INN RESORT!!!", "Date": "September 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida, United States", "Title": "“Desert Inn / Daytona Beach”", "Author": "Frank W", "ReviewID": "UR137051333", "Content": "For our nice 4 day, first stay on Daytona Beach & the Coke Zero 400 Nascar race, all was good except the motel. Built in the late 50's or early 60's, that was the last time it had paint or was cleaned, I would imagine. The mold smell & cleanliness wouldn't pass for most normal people.The website is very deceiving.. It is a shame!!! If the price was a bargain, maybe, but we paid $170.00 a night for a dump...Can't say it any other way... You have to watch it out there...Good luck on your travels....Frank", "Date": "August 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Gastonia, North Carolina, United States", "Title": "“Roach and Flea infested”", "Author": "Dixon704", "ReviewID": "UR136396548", "Content": "Worst Hotel I have ever seen. We arrived in Daytona beach on Aug 4, 2012, and wanted a place to spend the night before driving back to NC. I was a bit concerned when I saw the lobby, but I thought the rooms would at least be clean. We paid for an ocean front room, and they put us in a very dirty street side room at first, I called the desk to let them know this and they were supposed to call me back, after waiting for about 10 minutes and not receiving a call back, I called again, and was told to come down to the front desk and they would take care of it. They reluctantly changed our room and gave us an ocean front room. As soon as we walked in we could tell it was a smoking room, and it was very dirty looking, I went down to get our luggage, and came back up. My wife had found some nasty looking substance on the bedspread, I tried to call the front desk but the phone in the room did not work, I noticed something on the bed while I was trying to call the front desk, and realized it was a roach, I then found several more, and told my wife we were leaving, I went down to the desk with my wife and our luggage, and told them we could not stay with them. They refused to refund our money, so I had to call my bank to dispute the charge. After we left I realized I had flea bites all over my ankles from the room. The owner claims on this site that they are a 3 star Hotel, I would love to know who rated this place, as it is not even worthy of 1 star. Up until our experience with the \"Desert Inn...Daytona's #1 Resort & Convention Center\", I'd always wonder where the term \"flea-bag hotel\" came from. Now...I know. What a way to celebrate my 50th birthday.", "Date": "August 6, 2012"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ormond Beach, Florida", "Title": "“just stopped to check”", "Author": "Pat M", "ReviewID": "UR135684074", "Content": "As we did not stay here this is not a review on staying. We live near and wanted to check it out, to see if the reviews were right on and believe me they were. This hotel should be banned by Daytona Beach tourist center. The place was so filthy hard to even walk thru A maid was cleaning (or so she thought she was cleaning) we walked in the room and backed out !!!!! How terrible to have this hotel in our beautiful beach. Please someone do something about this hotel.. To anyone who stays here I would hate to see where you live !!!!", "Date": "July 29, 2012"}, {"Ratings": {"Overall": "1.0", "Location": "5"}, "AuthorLocation": "Alachua, Florida", "Title": "“Extreme Makeover Couldn't Help This Place”", "Author": "Brenda B", "ReviewID": "UR131357705", "Content": "My husband and I recently moved to Central Florida and spent Memorial Day weekend on Daytona Beach, our first weekend away. The website on this hotel was extremely deceiving, hence why I made a reservation. We were to stay 2 nights, but thinking everything was booked we suffered through 1 entire night at this \"rat hole\" (and I'm being nice). First we were given a smoking room after requesting a non-smoking room. The door to our room wouldn't shut. The public hallway carpet was dirty and smelled like mold. We stayed away from the room as much as possible, because of the smell. I wore shoes in the room so my feet would not touch the carpet. But the worst was yet to come...when we went to bed and pulled back the sheets, they smelled of mildew.The mattress was wrapped in plastic (which crinkled everytime you moved in the bed) and was hard as a rock. The headboard on the King bed fell forward away from the wall when we sat on the bed. All of our clothes, even in our suitcase reeked of the smell. Black stuff was falling out of the AC vent in the bathroom ceiling, Television had no remote and the carpet was filthy. After the discovery of the mildewed bed, my husband found availabilty elsewhere. After a sleepless night, I paid a visit to the hotel clerk. I told her we would be checking out and she replied, there is no refund, since we were required to pay for our 2 night reservation up front. I told here yes there would be a refund. The rate for one night with tax ended up costing me $224.00. I got a refund of $156.00, which is exactly with tax what we paid the next night at the Holiday Inn (next to the Desert Inn). Your circles should go into the negative for this dump, this place should be condemned. I don't want anybody else to go through what we went through, so here's my warning...if you decide to stay at this place after reading my review...then pack cleaning supplies (to clean your own room), clean sheets for your bed and have your family fitted for gas masks so you can breathe clean air, because you won't find any of that at this place. If people will STOP staying at this place, it will soon be known as the \"Deserted Inn\", a much more deserving name. I'm not through yet...Chamber of Commerce of Daytona Beach will soon know how disappointed I am in this place.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Haines City", "Title": "“WORST HOTEL IN DAYTONA”", "Author": "mriversredd", "ReviewID": "UR130813440", "Content": "My name is Marcus. Me and my family just recently stayed at the Desert Inn Hotel for the Memerial Day weekend. This is by far the worst most nastiest unsanzitized hotel in Daytona. We knew when we pulled up we had been mislead. It smells, and reeked of old mold and dirty lundry. It looked like they painted right over the mold on the roof. We had bugs in our room had a big roach, spiders, ants. In my cousin room they had some type of bed bugs. Even though the staff was friendly they dont take pride in cleaning their rooms and making sure things are neat for their guest. They thing was really pissed me off was I couldn't get a iron even a hole in the wall hotel have irons for their guest. Dont be fooled about what you see on the internet. What you see is not what you are going to get.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“I'm not all that picky”", "Author": "Marc T", "ReviewID": "UR130792602", "Content": "But I don't expect the entire hotel to smell. It was like some combination of mold/mildew with something sprayed on top of it to try to cover it up. It's dated and tacky which is some of it's charm but what do you really expect for that price? It's a nice property, right on the beach, but just a shame some one doesn't spend the money to just give it a good cleaning. You can tell that even the people who work there are embarrassed at it's condition. It's kind of like everyone just gave up. I bet it was something in the 60s.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Worst hotel ever!!!”", "Author": "adriana g", "ReviewID": "UR130578012", "Content": "As soon we walked in we realized we had made reservations in the wrong place... Horrible!!! I don't understand how this hotel is in bussines, this place should be demolished, it is nasty, dated, tacky, they advertise they have fitness club, game room, indoor pool..etc..game room (video games) does not work, indoor pool has a black ring or dirt around.. I just can't say enough to describe our terrible experience.... The first night I just wanted to cry and the second night I did the same as Jenise H.. had to drink to forget I was in that in that horrible place.", "Date": "May 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "manasquan", "Title": "“Okay for a night or two...”", "Author": "ginny110411", "ReviewID": "UR130299537", "Content": "Necessity called for us to use this hotel on the beach in Daytona. Outside, it looks very nice but you can search fro a better place to stay if you want something along the beach. It was expensive to start with (graduations and the like going on so the prices were raised). We did have a place to park the rig and it was pet friendly but for $25. While the bar was open most of the day and into the evening, come morning, the restaurant which was supposed to open at 8 AM was not and they were still waiting on the cook by 8:30-8:45! The gift shop never opened while we were there as well. Accomodating a multitude of grads, the place was a little rowdy with things being tossed from the balconies. If you required their \"free internet\", it came only with the beach front rooms which cost more than the street front rooms. So internet wasn't actually free. We noticed several prostitutes in the parking lot who had gained entrance thru a side door as well. There were no places for meals within a decent walking distance. The rooms were small and basic - kept up just enough but still needing maintenance. The A/C was extremely loud which unfortunately, you needed to use due to the Florida weather. Was not at all impressed with the place and will not stay there again. For the price, it should have been a little better!", "Date": "May 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“super swimming pools!”", "Author": "MALCOLMSMOMLuray_va_", "ReviewID": "UR130049003", "Content": "i enjoyed staying at this hotel again last week,especially the swimming pools. the outdoor one is perfect for lap swimming and the indoor pool is nice and warm, though smaller, stilll good for lap swimming. my room was ok and comfortable,but no refrigerator in it,which would have been a great help. the staff was kind and helpful. the rooms, pools, and general hotel area was very clean.", "Date": "May 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sanford, Florida", "Title": "“Awful Place to stay”", "Author": "Deliac34", "ReviewID": "UR129483881", "Content": "Wow where to begin, this was the worst Hotel I have ever stayed in. The place is older and run down. Carpet though out the hotel was filthy, We had to switch rooms because our room had NO HOT water! When we went to the front desk the clerk was very rude unfriendly about the ordeal but did however switch our rooms. The pictures posted on the web site must have been taken quite some time ago the rooms are dirty and need repairs the bed was hard as a rock. Around 5 in the morning we were awaken to people fighting and screaming in the hall outside of our door. I would never take my children to such a disgusting lack luster \"resort\"! Will never return.We wore our shoes to take a shower the floors are dirtier than the parking lot!", "Date": "May 6, 2012"}, {"Ratings": {"Overall": "1.0", "Rooms": "1", "Service": "2"}, "AuthorLocation": "Southwest Ranches, Florida, United States", "Title": "“Disgusting Hotel!!!”", "Author": "Jenise H", "ReviewID": "UR129070471", "Content": "This hotel is so disgusting, I had to drink myself to sleep & I'm not a big drinker. We had left the Howard Johnson in Ormond Beach because it wasn't all that clean, to this one which was worst. We wore flip flops to take a shower and never touched the floor with our bare feet. The only reason why we stayed was because we had our puppy with us. I felt so bad for my puppy, that I bathed her immediately upon leaving this hotel. It's better to just pay more money for a nicer hotel than to get bed bugs and have them come home with you. Stay at either Perry's, Holiday Inn (1615 S. Atlantic Ave.) or the Hilton. Those are my recommendations.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Pooler, Georgia, United States", "Title": "“This was the worst hotel i have ever stayed in .... there were trash every where . room was filthy !”", "Author": "Kandy K", "ReviewID": "UR126390806", "Content": "I ha d already payed in full for this room so i couldnt just find another place . cause it was non'refundable (now i see why) ..... i was suppose to have had ocean front , instead got a roach infested 705 i think it was , so i took the bug to the front desk and demanded another room , so then i got room 535 not no better that room was , i was facing trash on the roof , curtains wouldnt close , not latch on door , this is HORRIBLE PLACE !!!! DO NOT STAY HERE !", "Date": "March 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Iron River, Michigan", "Title": "“The most disgusting place I've ever been...”", "Author": "nicolet77", "ReviewID": "UR125513150", "Content": "I was visiting a friend in Florida. We decided to take the kids to Daytona Beach overnight the following evening. Since it was a last minute trip, most reasonable hotels were booked - so our options were pay 400.00 for one night or 89.00... we were hesitant, but her husband, a County Deputy - but a few counties over, thought he remembered staying there and thinking it was OK... (I will begin by saying he forgot to mention he stayed during his initial college years - not when he was a responsible family man....) We found the hotel and walked into the lobby. We should have turned around then. I agree that the smell was awful. It was a mixture of mildew, mold and chlorine. The inside of the place looked like we just stepped on The Love Boat. Very gold-lame , mirrored, disco 70's theme. We checked in and were given our room key. WHY we kept our reservations, I'll never know... We rode the rickety elevator to our floor, opened the door and I couldn't believe it! There was black mold on the ceiling (two of the children with us have terrible asthma) and several stains on the carpet and bed spreads. I turned on the bathroom light to see the floor was soaking wet - truly like a 1/4 inch of standing water all over the floor. After closer inspection, I noticed dead bugs and burn holes throughout the room. The kids were really excited to stay at the beach, and we moms were thoroughly disgusted with the place. I went back to the front desk to explain what was going on. Like others, I was told there wasn't any other available rooms. I asked that they put us somewhere else, and that was \"against their policy\". We never removed our shoes that entire trip (even while sleeping), except when we were out on the beach. I was terrified to look at the sheets (thankfully we'd brought our own blankets which we placed on top of the bed and wrapped ourselves in. Even the pool was filthy, with grit, grime and sand covering the floor. For some reason I found myself in the basement where the pretend workout room was. Truly it reminded me of some terrible scene from Criminal Minds - as in dark and creepy with the only light coming from a single dangling bulb. If there is anything (and man am I racking my brain) positive to say about the place is for one hour while the kids played poolside, the hotel had arranged to have a DJ there who had fun activities/contests that the kids could get into - like races and stuff. BUT TRUST ME WHEN I SAY, THAT - BY NO MEANS, MADE UP FOR THE FILTH AND NASTINESS...", "Date": "March 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“At least we didn't have to sleep in our car.”", "Author": "Cyndy305", "ReviewID": "UR124934391", "Content": "If you are desparate, and there are no other hotel rooms available, this is a possible place to stay for the night. Front desk staff was nice. Decor was bizarre in the lobby and very old school. First given a room on the 4th floor. The elevator opened and the smell hit us -- it just smelled awful, but I don't know what it was. Went to our room, but the keys wouldn't work. That was just as well, since there were lots of noises coming from the rooms nearby. Went back downstairs to complain, and were given a room on the 7th floor. This time, no smell coming out of the elevator. Hall was quiet, but carpeting really dirty, ugly and worn. Just tacky and old and dirty all around. The room itself was passable to stay the night. The sheets were clean -- we could tell because they had black lights conveniently mounted above the beds near the ceiling. The mattress was surprisingly comfortable. But I just can't recommend this place. Overall, a lack of cleanliness, extreme wear and tear. Smell on the 4th floor was nauseating.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Raeford, North Carolina, United States", "Title": "“Worst hotel ever!”", "Author": "Vera P", "ReviewID": "UR119375201", "Content": "We were put in a smoking room and tried to change but was told there were none available. We ended up buying scented candles and clorox just to be able to stand the smell. Not only did it smell of cigarette smoke but of mildew and wet socks. The whole place was very eery and not clean. We did stay in this hotel a few years ago and it was much better. I will never stay at the Desert Inn again. Even though the rates are cheaper than other hotels on the beach, it is not worth the smell or the feeling I may catch some sort of germs from filth!", "Date": "October 16, 2011"}, {"Ratings": {"Location": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Weaverville, North Carolina", "Title": "“OMG! Run Dont Walk”", "Author": "Nancy M", "ReviewID": "UR118089880", "Content": "This place was horrible. The Hotel had a nasty smell between wet dog and mold. When we got to our room it was nasty and smelled. We have a one year old and he was picking up stuff off the carpet. It was definatly not place for children the rooms had the huge columns in them and the screws stuck up from the base about an inch and the wall outlets either didnt have covers on them or they were falling out of the wall. My husband went to complain and they showed us another room that was just as bad so we asked for our money back. The guy at the front desk said they would give us our money back but we would have to come back the next day because there was not a manager there when i questioned him that we had just paid with cash he got hateful and said he didnt have to give us back all the money but if we would come back in the morning he would. I then questioned him about the pictures of the hotel on the internet and the ones hanging by the desk not looking like the pictures and he said all the hotels doctor thier pictures. So take my advice run dont walk the other direction.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“WE VISIT EVERY YEAR”", "Author": "happy34678", "ReviewID": "UR118014751", "Content": "This is an older hotel but great features indoor and out door pool,resteraunt, bar,gym, gift shop and righton the beach! It's close enough to the pier to have a nicewalk down the beach to go to dinner. The staff is friendlyany try to fill every want or need asked. Once again THIS IS AN OLDER HOTEL THAT HAS NOT BEEN REMODELED RECENTLY BUT IT HAS A MOBSTER VEGAS CASINO FEEL. Very fun for a group to vacation in Daytona.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Most Unfortuate Experience”", "Author": "Chasmyboy", "ReviewID": "UR117551583", "Content": "Many of the staff were pleasant but they had nothing to offer or work with. Lounge/restaurant was open erratically and understaffed. The rooms were just horrible; VERY old appliances which failed intermittently; concrete chipping from the exterior of the building walls near the balconies [called the front desk and they said \"they haven't fallen off yet..] ; a dark dank 'workout room' with broken equipment in the basement and black lights near the beds--creepy! Would NEVER stay or let anyone I know stay there again.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Charlotte", "Title": "“Vacationers Beware!!!”", "Author": "TGrierNC", "ReviewID": "UR117083238", "Content": "This is the worst place on the beach!! We found out the hard way, the advertisement sold us before we actually got there and once there we were totally disappointed and the staff would not cooperate with us, they act like we were bothering them. We complained about our rooms within 15min of getting there. They did not offer us any kind of assistance with changing rooms, they told us that all the rooms were booked and we had to keep the one we're in and to find out later that evening that the they had plenty of rooms that they could have moved us to. We had mold in the bathrooms, water leaking from the sinks, ceiling! Big water bugs alive and dead in our rooms, kitchen was no better!! Found out from the local law that they have been raided, on the news. Once we left the next morning, we were getting appoligies from other hotel staff say \"Sorry you had to go through that!\", \"I know that was a nightmare!\"", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Sorrento, Florida", "Title": "“Would not recommend hotel to anyone!!!”", "Author": "pearls627", "ReviewID": "UR116124605", "Content": "My family booked rooms at the Desert Inn this past weekend. We had a family of 10 and got 3 rooms. We were EXTREMELY dissappointed. The rooms were disgusting, carpets were wet, mold growing on floor in one of the rooms, grease still on stove from previous people, lifted the sheets on mattress and there was MOLD growing on mattress and bathrooms were gross. They would not refund our money and intially told us that there was no more rooms. My husband went down and spoke with them, they eventually moved us up to one of their suites. This was a little better but not by much. We payed $300 to stay there one night!!! I would not recommend this hotel to anyone. We stay at the beach often and will go back to our previous hotel that we stayed at. The Fountain Beach Resort!!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Ocala", "Title": "“Nothing like what it looks like online!”", "Author": "Ashley126Nicole", "ReviewID": "UR116016920", "Content": "We payed for two nights in a jacuzzi suite - totaling almost 400 dollars. The jacuzzi didn't work when we got there on a friday so they said it would be fixed. They never got the jacuzzi fixed, the carpet had huge burn holes in it everywhere and was disgusting, the bed smelled and the room in general smelled like mildew. I didn't even want to take my shoes off the entire time because the carpet looked so disgusting. VERY disappointed. Oh and indoor heated pool, yeah right, it was colder than the outdoor pool. The indoor pool is NOT heated!", "Date": "July 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Tampa, Florida", "Title": "“Worst Hotel Experience Ever!!!”", "Author": "tlbt_2004", "ReviewID": "UR115824424", "Content": "The first room they gave us had no refridgerator so we called the front desk and asked if they could bring one to the room and they said no that we would have to upgrade to another room in order to get a fridge. I wasn't too happy about that since we had already settled into the room. I went back to the front desk and the girl there said it would be an additional charge per night. I agreed and got the key. My wife and I moved rooms. When we got to the new room it was disgusting. The carpet was so filthy that we could not take our shoes off. There was old dirty gum in the carpet and looked like it was 30 year old carpet that had never been cleaned. We were trying to make the best of it although we were both very uncomfortable. My wife then went to take a shower when she turned it on there was not enough pressure for the shower to come on. We then knew that this room was not going to work so we called the front desk again. The same girl answered and rudely said that she would send someone up. My wife was not comfortable with that and we had plans so we decided that we wanted to check out and change hotels. We told the lady on the phone that we were coming down to check out. Once we got down there a man at the front desk asked if he could help us and we said yes we would like a refund and need to check out. and he said you are not getting a refund with a smile on his face. I thought he was joking and I said thats funny and he said no Im not joking your not getting a refund. I was livid! I said if I call the police to come assist me you will give me our money back and he said \" I dont care if you call the [-] FBI you ain't getting your money back.\" I could not believe what I was hearing and we paid cash so there wasn't much we could do. At that time we knew we had no choice but to stay or loose our money so we said can you give us a clean room and he rudely gave us a new room. We were very upset and felt like we were being held there against our will. We got up to the new room and it was again very dirty but better than the other. Needless to say we toughed it out for the weekend but it was very uncomfortable and a filthy hotel. We will never never never stay there again and we have told our whole family which has stayed there in the past to never stay there again. I am glad it is over!!!!! It felt like we weren't even in Daytona Beach.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Burlington, Kentucky", "Title": "“party place not for families”", "Author": "kydad07", "ReviewID": "UR115792992", "Content": "this is a great place for some wild spring breakers that want to spill beer on the floor and party like rockstars i stayed on spring break and had a blast .. however im grown up now and have a family and came back to desert inn to realize how drunk i was when i stayed .. the place is filthy outdated and very overpriced . I have a better 19 inch tv in my garage its moldy the beds need to be thrown away and replaced some fresh paint and sprayed for bed begs . The diner downstairs is pretty good however . i recommend this place for the wildest of party people parents dont let your daughters stay here the security isnt top notch but if u want to score a bag of smoke give them a shout .. STAY AWAY FROM THE DESERT INN AND HOLLY HILL FAMILY GOERS. OH and replace the damn elevater before someone dies on that thing.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Fla", "Title": "“Terrible Stay”", "Author": "nana19591953", "ReviewID": "UR115736298", "Content": "This without a doubt is the worst place my husband and I ever stayed.The mold smell was awful.The non smoking room we had ,had smoked cig. buttts all over our \"Private Deck....I can only say Nasty.Our room smelled like an pet zoo.I was really upset with overall condition of hotel.Needs much ATTENTION...For 180.00 a night surely mangement can arrangesome kind of detail cleaning services..My husband thinks they should have paid us to stay instead of us paying them. We travel a lot and never wrote a complaint,but THE DESERT INN is AWFUL.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Safety Harbor, Florida", "Title": "“Worst hotel I've ever stayed in”", "Author": "suitechar", "ReviewID": "UR115633136", "Content": "Very deceptive advertising! This hotel hasn't had a single upgrade in over 40 years. WiFi NOT available in rooms, only in \"restaurant\" and on pool deck. Gym is disgusting, indoor pool was colder than the outside one, and we could hear EVERY word from our next door neighbors! Internet cafe is a 6'x6' room with a table. The water coming out of the kitchen sink was brown!! ALL LIES!!! I can only imagine what was crawing around while we were sleeping.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Stay away!”", "Author": "vacationer60805", "ReviewID": "UR115261573", "Content": "Staff was very courteous and helpful. They have an indoor pool and an outdoor pool. However, the room was deplorable! To begin with, I requested a non-smoking room with my reservation and received a confirmation showing a non-smoking room booked. I was given a smoking room! The carpet was tore and filthy. There were goldfish crackers from previous guests around the room. The outlets in the bedroom did not work. The sauna did not work and the steam in the steam room smelled liked mildew. The woman's bathroom located at the pool caused my daughter to have an asthma attack, due to the mildew. The garage leaked and was slippery. The last straw was when we came back to our room, a half eaten donut was in our box of donuts. I have no idea but it was not anyone with me, ugh!!!!!!! I paid $209 per night for that!!!!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "fl", "Title": "“One Bad Apple”", "Author": "unhappy_camperFl", "ReviewID": "UR115228309", "Content": "Our stay started in the middle of the week.The first couple of nights were great ,nice families,helpful and friendly staff,met some wonderful people and was having a great time.Then came Friday night, was a great day,enjoying food and drinks with our new found friends.After a fun filled day and with the kids inside resting for the night ,we ADULTS thought we would have a few drinks on the pool deck and chat awhile,this is where the Bad Apple came in. It was Midnight and understandably the pool was closed,but we were on the deck sitting and enjoying ourselves, not disturbing any guests with loud and obnoxious behavior.Then came Don, supposedly the night security ,his first words were OK kids its time to go to your room.Just let me say that we were all well over 30 years of age.There was no reasoning with this guy. Evidently your vacation ends at Midnight, for in his words everything is closed at the Desert Inn. We were told to either go to a bar , go to the beach or go to our rooms,in other words we were not permitted to sit anywhere on their property after 12,this really puts a damper on your vacation.The next night was the same scenario,except this time this same gentleman was very rude with not just my party but other guests as well.We were all told it was not his job to -- babysit people after 12 and that he should not have to clean up our shoe prints off the lobby floor from us going to the elevator.To try and make a long story short,this man pretty much ended our good times at the Desert Inn.Upon checking out I asked to speak with the manager and was told they do not hear complaints.So in my opinion unless you plan on being in bed at Midnight or taking a chance on a DUI or a PI for having to leave the Desert Inn property at Midnight,you might want to find another place to enjoy your time at Daytona Beach!!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Tennessee", "Title": "“Wouldn't stay again, but not that awful.”", "Author": "carp57", "ReviewID": "UR115101025", "Content": "I read the reviews before we stayed, and was very leary of staying here. Our family had 4 rooms. There were NO bugs in any of the rooms. The furniture was very outdated and beat up. The carpet was dirty, and there is a strange smell of mildew throughout the hotel. Our beds were very firm. The door to our room looked as if it had been broken into. The AC worked well. The view from our balcony was awesome. The staff in the Beachfront Grill were very friendly and helpful. The pool was nice as well. No, I would not stay here again, but when it is the last minute during race week, it will do. This hotel needs a serious investor to come in and totally gut it and start all over. It may have been a very nice place in 1960's, but they need to put some major money back into this hotel. It looks as if there has been too many spring breakers at this location. If you do choose to stay here, ask for one of the rooms on the end like room 517. We had a peek in there, and it was nice. We spent a lot of our time at the pool and away from the room, so the room didnt bother us too bad.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Penna", "Title": "“Dirtiest hotel I ever been in”", "Author": "Luluip", "ReviewID": "UR115051935", "Content": "Yuck..I had an oceanfront efficientcy room, needless to say, there were bugs in the kichen, under the fridge. and in the microwave..Totally disgusting...the housekeeping never even cleaned the coffee maker where the coffee filters went from the previous guests.. I left them there too and when I checked out they were still there. I lived out of my suitcase cause the drawers were'nt even clean..The hallways on my floor (7) were dirty and needed some cleaning against the walls where the sweeper stopped.. But they sure kept that main lobby entrance clean...putting on a false impression...Had trouble w/key cards too and had to keep going back down to the desk to get remedied.. NEVER AGAIN...Stay away!!!!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Port Saint Lucie, Florida", "Title": "“This place should be condemned. \"REALLY\"”", "Author": "kanes48", "ReviewID": "UR114998580", "Content": "Went to see the Coke 400 and wanted to stay on the beach so we selected this hotel. From the moment we walked in we new we were in trouble. The employees wouldn't look you in the face and were insulting. There was flooring of every kind and it was filthy. The rooms all had loud, old, deteriorating window units and serious rusting throughtout the hotel. The door was to small for the room and sometimes wouldn't shut. The ceiling fan would not turn off. We were supposed to stay for 3 days and left on the second but we had to pay $60.00 more dollars to leave early. Clearly the city and code enforcement do not inspect this hotel.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Tampa, Florida", "Title": "“THIS HOTEL NEEDS TO SHUT DOWN”", "Author": "pixie143", "ReviewID": "UR114807367", "Content": "I just got back from 4 days at this hotel, FILTHY AND RUDE HELP Tile floors stay soaking wet, almost fell 3 times in the kitchen till they gave me towels to put on the floor, due to they told me so hot outside and so cool with ac inside, made floors stay wet, there were used coffee grounds still in the coffee pot, for who ever used before we got the room, Fridge was broken, brought a new one the next day, after maintance didn't come till 10Pm at night to tell me yep it doesn't work----then on 3rd day I put sign out for maid service and maid asked me what i wanted done, dang I thought she knew her job, but asked to change the beds, and she said no, she would just change pillow cases, what the heck, they didn't even empty the trash cans ----I asked for some of my money back but of course told me they couldn't do that, so here I am, telling people what a rat hole this place is, stay away, to much mole and mildew, stay clear, not enjoyable at all, never again", "Date": "June 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Horrid”", "Author": "Yellermelon", "ReviewID": "UR113551638", "Content": "Scary, nasty, overpriced. The website is very misleading, wish we had checked reviews before staying. The furniture and decorations are so bad it's comical. We have had much better luck with the Hilton.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "Augusta, Georgia", "Title": "“We Hated It We had to find another hotel”", "Author": "29212Travelgirl", "ReviewID": "UR112198185", "Content": "It was awful they showed us 3 rooms none was up to standards the wash cloths were dingy and very thin the tiles were falling from the celing in the bathrooms . The eating table had 2 chairs this was a 2 bedroom 2 bath suite the furniture had stains and burns. we left our luggage here long enough to find some where else to stay it was hard because it was somethibg going on I think something to do with cheerleaders but thank God we found something and went back and got our luggage the Manager Marie would never talk to me when I called to speak with her about our problems with her rooms and service on checking into a decent room.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "DeLand, Florida", "Title": "“Bugs all over beds”", "Author": "miney808", "ReviewID": "UR111779336", "Content": "We were looking for a dog friendly hotel, so that is why we chose this one. They make you pay for your entire visit up front, with no refunds, which is the first red flag. The lobby smells like mildew, then when you go up to your floor, there are \"Caution Wet Floor\" signs in the hallway where there is carpet, with dead roaches all over. The rooms have mold/mildew everywhere, and the worst part was there were bugs crawling all over the beds, countertops, sofas, etc. We asked for another room and were given attitude at first, but were finally shown another room and it was just as bad. Needless to say, we spent as little time in our rooms as possible and ended up leaving a day early (not getting our money back for it either) and put all of our belongings in garbage bags and straight to the laundry when we got home so that we wouldn't infest our homes with these bugs. Had nightmares about this place and it's made me so much more cautious when selecting a hotel.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“A nasty place..”", "Author": "1Jane123456", "ReviewID": "UR110587895", "Content": "A nasty hotel it has not been updated some of the floors smell horrible. My power went out and the lady at the front desk got an attitude with me. I had a room with a hot tub and could even use it bc the water was so cold when I called the front desk they told me thats how it is suppose to be. I would NEVER stay there again even if it was free!!!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boston", "Title": "“DO NOT STAY HERE!”", "Author": "Coconut1220", "ReviewID": "UR107662142", "Content": "This is the absolute worst hotel I have ever stayed in! The place is gross and dirty, We were only here for a few nights but we seriously considered leaving to get a new hotel it was so bad! If youre a college kid looking for a cheap party hotel then this is probably the place for you. Kids were in the hallways at all hours of the night partying drinking and screaming. They stole our chairs of our deck and broke them. Overall this was a horrible hotel I will never go back and I could never recommend this hotel to anyone!", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clermont, Florida", "Title": "“We loved it and enjoyed it very much...Do not understand why people leave such bad reviews when its just NOT True!”", "Author": "TRAVISNDEANNADEAL", "ReviewID": "UR106702805", "Content": "We give Desert Inn Resort a 5 Star Rating......I do not understand why people are so rude and gave all the bad reviews to this Resort, We stayed three nights last weekend and checked out on May 1, 2011......This was the most awesome and amazing weekend we have spent in Daytona Beach, We live in the Orlando area and we travel quit often to the beach and this was the very first time staying at the Desert Inn n Resort and let me clarify to everyone, all the bad ratings are NOT true, first of all the staff was wonderful, the bartenders and the restaurant located by the deck side of the pools was amazing the bartenders made sure that you were satisfied with your food and drinks and let me add that you receive a 10% off of your food being a guest at the Resort.......The prices were very affordable and the food was fantastic.........A big Thanks to Bill in Reservations was great for making our stay even better, our original plan was to just stay for Fri and Sat night, at the last minute on Thursday at 5pm I called and spoke w/ Bill and he made it possible for us to come that evening to make it 3 nights w/ the same room so we didn't have to stay in a room for one night then change for the other two.....The Resort made it possible for us not to leave the Resort not one time, they offer everything that you could ask for, wonderful Outdoor pool and Kiddie pool as well as a very nice Inside pool, a gift shop located on the Lower Level of the resort, pool tables, ping pong table, a Internet Cafe, Fitness room w/ Spa and an arcade game room, in room movies to rent, and I'm sure I'm going to miss a few things they have to offer...oh they also have a Free continental breakfast which we did not make it too, so we just ordered out Breakfast off the menu and it was wonderful and on Saturday the DJ on the Deck was amazing the Music was fantastic he not only catered to the Adults but for the children as well should I just say Kids of all ages., he had planned activities and everyone just had plain clean fun. Let me add that the resort offers small pets are allowed and being a loving pet owner, this is a PLUS because if you check out other Hotels on the beach there are so many that will NOT allow you to bring your pets.......Let me add that the Parking is FREE......you need to check this out when making your reservations cause many Hotels charge you for parking, We had an amazing Ocean View room on the 7th floor in room 751, it was very beautiful we had two double beds, Table w/ chair and there was a couch that made into a single bed for sleeping which we did not use, but very nice, even tho it had a small tare on the bottom of the couch, who cares folks.......if they had to replace things like this every time something happens , that is when you are going to see big price increases and this will not allow for some people to be able to come and enjoy a vacation if you can't get a reasonable rate.....By the way there was NO trash and smell located any where on the premises during our stay and for you folks that complained about water n smell on the lower level decks for parking, that was NOT the case during our stay either, the parking deck was fine and I can see if there was a lot of rain and wind that may be a problem but USE common sense and just don't park under there and get your umbrella out and use them......and let me add to the people that left bad reviews and saying that the Resort has bed bugs, well first of all you probably brought them from your own home and there is a Website that you can go to the Bed Bug Registry and you can see for yourselves that this Resort does NOT have them and you would be surprised by the ones located in Daytona that does............so check that out and see for yourself.......Over all we had an amazing time @ the Desert Inn Resort w/ no complaints what so ever and this will continue to be our home away from home and plan on making our reservations again in the next few weeks can't wait to go BACK! Let me add one more thing I'm a very neat n tidy young lady and to let you know we are in our mid forties and enjoying life to the fullest, some of the reviews came from young teenagers that just wish they could stay at the Ritz and yet wanna pay reasonable rates....Go figure!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "NC", "Title": "“Needs MAJOR overhaul”", "Author": "MikiNC", "ReviewID": "UR106345552", "Content": "We stayed for one night (driving home from cruise vacation). I am sure that in it's day, this was a ritzy resort. But it is 2011 and sponge painting, black lights, purple carpet and gold painted trim is WAY out of style. The pool is nice with the exception of the dislodged pool lights. That was scary. When we came in from the beach, the outside shower wouldn't turn off and then when I took a shower in the room that evening, the shower in the room wouldn't turn off. 8-/ Certainly not the cleanest most inviting rooms ever. They need to get rid of all the tacky decor, repaint the ENTIRE facility (using professionals!) and re-decorate simply. The room had been recently painted but it was hideous, looked like 5 year olds did it. Our tv had brown stuff all over it, we're gonna assume it was paint? Lobby does have a weird smell. Underground parking deck is small! Do not atttempt to drive a SUV in there. We had a difficult time in a sedan and the lot was empty! Didn't eat at grill or breakfast. Could really be a neat place but needs a MAJOR OVERHAUL!", "Date": "May 1, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Pittstown, New Jersey", "Title": "“Terrible place and liars!!!”", "Author": "worldpeacelol", "ReviewID": "UR105345351", "Content": "I have to say, I had so much anticipation for this place , as I aquired two tickets to go down there for me and a friend for my 20th birthday (Spring Break 2010) during spring break. We'll i arrived around 4 a.m with my friends, literally too the guy 45 minutes to check us in... So buy the time we walkedup into the room, the sun was already out.... BUT.. the Worst part was that during the week, I Personally walked myself down to the lobby just to re-assure myself that i would get my depots back, which is 100? .... the reason is because as soon as we got in our room a litlle after 5:30, on our deck there was about 30-45 empty cans, bottles, trash, ect.... I never once walked on the deck... as I said I went down to the front desk 2 times during the 5 days I wasdown there, and both re-assured me that it wouldnt gt charge or my deposit taken becuase \"It's spring break.\"... We'll, the last day comes and were in line checking out, watching for the bus to the airport... as soon as I give the guy my information, he tells me I cant get my deposit back because, \"the deck was trashed.\", I tell him my story of how I came down to the front desk twice to tell them that, and he didnt want to hear that..... I said outloud. \"this is rediculous!\".... and he said \" Alright [--], now your really not getting your money.\" please please PLEASE don't go to this place!", "Date": "April 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Tampa, Florida", "Title": "“Awful place”", "Author": "FLSNSHN", "ReviewID": "UR100969834", "Content": "We all got bitten up from bed bugs it was very disgusting. We will never stay here again.We even got the room with the spa in it . Sorry but having bed bugs is enough to keep us away.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Gross and Nasty!!! STAY away”", "Author": "jburris17", "ReviewID": "UR100932594", "Content": "This hotel is on the beach, but it is probably cleaner if you camp out on the beach. There was trash everywhere, only once in a weeks time did I see a cleaning lady. The Hotel smelled bad. The staff at the hotel was very rude, and didn't tend to the need of its guests. I would suggest finding another hotel.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Augusta, GA", "Title": "“Stay Away! Very disgusting hotel!”", "Author": "tropical1224", "ReviewID": "UR98605058", "Content": "Having never been to Daytona before, I let my husband, sister-in-law, and brother in law talk me into going for a week to the Desert Inn. They said it was great, it had a huge pool right in front of the water, and there was a DJ at the pool during the day. As soon as we walked in, I knew they were wrong! All of the reviews about how delapidated and disgusting this hotel is are TRUE! Yes, the pool is big, and it is right by the beach and they have a DJ, but believe me, they also have ants, mildew, mold, and rooms that look like they have not been taken care of in 30+ years. I was not happy! My husband said I was just being picky, and it wasn't that bad, so they decided we should stay there again the next year, much to my dismay. This time, my husband finally opened his eyes and saw what I did, thanks to more ants, filth, and a pile of human or dog waste (could not tell which) outside of the elevator when we got off on our floor. It had the whole hallway smelling like crap (literally), and ended up on the wheel of our luggage cart because there was no way around it. But, thankfully, that was the end of our Desert Inn days. Believe the reviews on this place!", "Date": "March 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Hopkinsville, Kentucky", "Title": "“NEVER EVER AGAIN- RUDE AND NASTY!!!!”", "Author": "beckyu", "ReviewID": "UR98087462", "Content": "to start with we forgot this was the place we stayed last year i swore we would never be back , so i got on line and found this really nice place (looks can be deciving) i booked it for 3 nights when we pulled up i was upset i asked them for a clean room no black lights , she told me they remodled they were nice and no black lights haha! so we get our room nasty spiders,hair in bed,gum on headboards,matress and sheets with brown stains and smears -requested new room just as bad ! no room service had to change our own bed sheets. front desk very rude and hatefull. would not let us speak to managment or refund our money we will disput this. so to anyone that chooses to stay there good luck. o yes they also told us they had bed bugs but just put plastic over matress instead of replacing! check for cameras 2!", "Date": "February 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Lusby, Maryland", "Title": "“It may have been a Resort in the 1970s, but is a gross misrepresentation now.”", "Author": "bite-em", "ReviewID": "UR95200867", "Content": "Paid $200 a night to have the two bedroom apartment. One room had too much heat, the other one no heat, so they had a barn heater sitting on the dresser. Small kitchenett had no exhaust fan, so we had to open the sliding glass doors on both sides of the apartment to air it out after I cooked breakfast - it was 33°F outside. The only Ice Maker was downstairs (we were on the 6th floor). Hotel attendant said that they used to have Ice Machines on each floor, but the colledge kids kept tearing them up during spring break. Staff did try to accomodate, sent the maintence man up immediately when we told them that there was no remote for the TV in the living room. We did not see any roaches - maybee they were too cold. The dead bolt on the front door could not be used due to sagging of the door. You had to hit the door with your shoulder after you used the card key to jar it open. Pictures on the wall were nice, but I do not choose a hotel for nice pictures. Continental breakfact was a joke, some mini-muffins, danish OJ and Coffee. I think they are blowing smoke up your [---] when they say other hotels are envionous and are writing fake reviews. I was worried when my best friends son sait this was a major party hotel during spring break. Never again would I ask my wife or friends to stay there. We are in our mid fifties . You I expected a better room for over $200 a night.We stayed on Dec 26th and 27th.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Go somewhere else.”", "Author": "bcfireman14", "ReviewID": "UR95004044", "Content": "I see that the hotel management keeps posting so I know my comment will be replied with something like this ain't true.... Lies lies lies!!! This place is pure filth!! Disgusting trash everywhere, including the locals and other \"repeat\" guests! Pay the extra Money and go somewhere that's CLEAN!! This hotel is a disgrace!", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“The shelnutts from orlando love the desert inn!”", "Author": "sarahpoo", "ReviewID": "UR94950484", "Content": "my family and i livein orlando and like to think as the desert inn and the sun viking as our home away from home.let me start out by saying i have never seen a single roach or other insect for that matter n i find the decal part of its charm it reminbds me of the days when the desert in was the THE place to stay because of it n it is always clean which is the most important.the staff has always been nice and since we stay for usually a month we end up being treated like family!now i am writing this because i just saw the review on the news n had to make sure i supported one of my fave hotels on daytona beach!", "Date": "January 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Redding, California", "Title": "“Hellacious”", "Author": "judeco", "ReviewID": "UR94649182", "Content": "I guess you live and learn but don't believe anything they tell you or the pic's you see on the internet it was a dump, very good location as far as the beach goes but other than that its horrible could burn down at anytime because of the horrible electrical plugs and lines...they told us that the competion writes the bad reviews and puts them on the internet but don't believe it its really bad and they don't care!!!!", "Date": "January 27, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Shortest and worst hotel stay ever”", "Author": "Purediva64", "ReviewID": "UR94463931", "Content": "My family and I went to the beach for vacation. The photos on line looked great, so we booked the room. Arrived late because of storm. Even when we entered the main lobby we knew we had been deceived. The hallway smelled of urine. And the room was more depressing. Ceiling caving in peeling. Rust around knobs of sink and shower. Found a bug crawling on my cell phone. Ants on the wall. It was awful. We checked. In at midnight and checked out at 8 am the next morning and went to the Hilton.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Southgate, Michigan", "Title": "“Not for human occupation”", "Author": "jpl788", "ReviewID": "UR94427129", "Content": "Was reminded of my terrible stay at this hotel by a local NBC news story ranking the 5 worst hotels in America, Desert Inn was ranked #3 worst hotel in America. Read my review below **News story here(http://www.clickondetroit.com/consumer/26613357/detail.html) I stayed at the Desert Inn back in September and I must say I wish I had the common sense to look up reviews prior to my stay. I was reminded today of my terrible experience while watching the news and a piece on the 5 worst/dirtiest hotels in America and I wasn't the least bit surprised when I saw this hotel was rated the third worst hotel in the country!! I'm sure some of you might not think that this place is as bad as these reviews but I assure you it is, and the link to the news story proves it. I assure you I am not the competition down the street, I'm from Michigan...so you can imagine how upset I was when we went all the way to Florida for vacation only to have to stay in this dump(couldn't afford to re-book) This hotel was filthy. When my friends and I got to our room we couldn't help but feel ripped off. The room was not fit for human occupation. The floor was obviously not cleaned seeing as there were still peanut shells on the floor which any amount of vacuuming would have taken care of. The walls were peeling and we were not surprised to see that a picture that was hanging on the wall was covering a hole. The gold trim on the ceiling was chipped and missing in certain places. After seeing the news story I read other reviews and seen the \"management\" respond saying dadudu123456789's review was false because the hotel doesn't have gold trim on the ceilings. I can only assume the management is delusional from the diseases they probably caught from working there because it most certainly has chipped gold trim. This place is full of bugs, mainly roaches and ants and you can hear rodents in the walls at night. DO NOT bring children here, they will never want to go on vacation again because of the traumatizing effect this place will have on them. Stay away at all costs. The only good thing from this experience was the staff was fairly nice, especially considering the amount of complaints they receive on a daily basis.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cocoa Beach, Florida", "Title": "“some things never change”", "Author": "joeyandjeanne", "ReviewID": "UR94426150", "Content": "i partied hard at this hotel during my late 20's early 30's as i worked at one of the local clubs.... this place was tore up then and this place is still tore up now. i recently made a stay again because of the claim of \" remodled \". lie-lie-lie. i think it's gotten worse. i walked into the old confrence/ball room... unreal !!!!! i dont know how the city lets you stay open... im sure after making the top 10 dirtiest hotels in the country, city code inspectors will be calling open season on the desert inn once and for all. STAY AWAY FROM HERE...", "Date": "January 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Come to our rooms to have roaches, & ants on the wall & ceilings over ur bed!!!”", "Author": "dingalls", "ReviewID": "UR94417942", "Content": "Although the upper floors are supposed to be more money for more luxury, We had to leave a room w/a kitchen. We came in at 10 p.m. w/ groceries our 2nd night of 2 wks, ROACHES scurried everywhere!!! MY KIDS & I screamed, went to a manager & they moved us to another room.- Which the refrigerator was too small.We decided to give them a chance the next summer, BAD ,MISTAKE !!! ANTS were crawling up the walls over our beds. THATS IT, SECURITY TRIED TO PUT US IN 2 MORE ROOMS DAMAGED & BALCONY DOORS BROKEN & TAPED OVER!!! NOW THATS DANGEROUS, DONT YA THINK??? FLOORS LEAKING WATER & SMELLED LIKE MOLD ON UR WAY TO VISIT THE POOL.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“VERY NICE HOTEL”", "Author": "MALCOLMSMOMLuray_va_", "ReviewID": "UR94320263", "Content": "stayed here in nov. 2010 and loved it. am a repeat customer at this wonderful hotel and really enjoyed my stay here. staff was very kind and helpful and housekeeping made sure i had everything i needed. front desk very kind and helpful. loved my courtyard room located between outdoor and indoor pools, which i enjoyed so much. glad that indoor pool had heater turned on this year, which made it so enjoyable and comfortable. my room very clean and so comfortable with a refrigerator and microwave. bed very comfotable. room looked brand new. plan to return here in a few months.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Spring Hill, Florida", "Title": "“The bugs,The smells,The resident low lives! OH MY!”", "Author": "karen34652", "ReviewID": "UR91394939", "Content": "DO NOT BELIEVE their photo's ,, the bugs ,,the smells, I was sitting on the bed talking to my husband,and up the back of the chair rain a roach, not a palmento bug, a german coachroach, they come from flith,,we rented a room with a jaquzzi, and a sun deck,,could'nt go out on the sun deck, it was loaded with cans and cig butts,,plus the people a few floors up,,that looked like they lived their,,we're pure low lives,yelling things down to me,,plus the doors to the sun deck, did'nt lock,, we went up to the Hilton, $50 more a night,,and beautiful rooms, felt safe ,no critters crawling or bites on us!", "Date": "January 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“no romance possible at this dump”", "Author": "upsetlocal", "ReviewID": "UR89548573", "Content": "local daytona beach resident trying to give spouse a romantic night on the beach instead i feel like i was just robbed for my money i wasted on this dump.I got a oceanfront jacuzzi suite to have a early christmas romantic night with my wife and we spent maybe a hour in the room and had to get out of there before we caught something!The room was nasty and smelled of mold and had not been cleaned by anyone that has a clue about housekeeping.My wife is a executive housekeeper at a millon plus condo down the street so she knows clean and this is not even up to budget hotel standards,i would not bath my two dogs in the jacuzzi and someone needs to tell the maintence/painters how to paint even the clock radio had paint all over it.I thought we would support a locally owned hometown business what a joke.The most distrubing part is when we went down to the desk to inform them we were unhappy the clerk said nothing when we informed him that we had checked in early in the day and after spending a hour in the room later that day that we were very upset and just going to check out we never were asked why or offered any kind of apology or any expression in the slightest the clerk took our room cards and walked away we assumed to get a manager ask us why or something he then returned and asked is there something else he could help us with no regards that we were charged 133.00 and were not happy with the room.no offer of new room no i am sorry how can we make this right for you,just a blank expression of a staff that must hear this every day is immune to upset people.This place needs to be condeemed.I want everyone to know what a rip-off this is and should have gave my hard earned money in the ocean at least some castway on a deserted island might get some cash it would have been more useful.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Not worth it!”", "Author": "travelgroup1", "ReviewID": "UR87146141", "Content": "We arrived in Daytona got the this facility and my husband went to check in. He looked at the room first and the first room that security took him to see had not been cleaned. The second room when he got there and turned on lights roaches and bugs were everywhere. Needless to say we did not stay there. And what bothered us the most was the front desk clerk seemed not to even care. I can always depend on the Laquinta to provide great rooms and great prices! I would advise NO ONE to go here yes they are on the beach but bugs and filth are just nasty!", "Date": "November 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Greenville, North Carolina", "Title": "“Don't stay at Desert Inn, Daytona Beach... Don't be fooled!”", "Author": "omg000", "ReviewID": "UR84260493", "Content": "OMG! My husband and I deceided to rename this place.. The DeSerted Inn or The Dirty Inn. We came to Daytona for the Biketoberfest. Upon arriving, walking through the main doors was this God awful smell. I can't describe it, but it smell like old packed away clothes that you tried to spray some cheep dollar store air freshener on. The floors had not been vacuumed in the lobby, the place was just dirty... it gave me the \"heebie- jeeveis\". The rooms look NOTHING like what you see on line. Oh, did I fail to mention the pets that greet you when you walk in the bathroom? ANTS! The room had mix-matched furniture, just your ideal cheep city hotel. I must admit, the staff was nice, but our stay was absolutely horrible. Also, we had no heat in the room.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“Worst hotel stay ever and we travel often!!!”", "Author": "mdavis328", "ReviewID": "UR83948541", "Content": "Did not have power in our room. Maintenance called corrected for about an hour then spent rest of night in the dark. Had cockroaches in spa. Six adults checked in to $240 night suite with 2 double beds and 2 sleeper sofas. Absolutely no bedding available for sleeper sofas. Front desk basically told us we were SOL, but a manager would call on Monday. Still haven't heard anything.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Disgusting”", "Author": "Limey0533", "ReviewID": "UR82461431", "Content": "Where to start? This place would be considered outdated a decade ago. The place is in major disrepair, has a musty smell to it and is simply in horrible condition. The rooms are large (not that you want to spend time in them), but from the decor to the condition of EVERY SINGLE THING in this place, you feel uncomfortable even being in the hotel. Mold, rusted shower/bathroom fixtures, stains on the walls and ceilings, tacky decorations, TV's from the early 90's, excessive road noise, lumpy beds, and, and did I mention the smell of the place? AWFUL... Do not spend the money (even if it is $49 a night). Buy a sleeping bag and sleep on the beach, you will be better off!", "Date": "October 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Don't, Don't, Don't stay!!!!!!!”", "Author": "nurseypoopoo", "ReviewID": "UR81774130", "Content": "We arrived late, checked in, opened our door and there were peanuts all over the kitchen, bathroom, and room floors. We went downstairs requested a different room, was told they were gonna upgrade us because of this, went into this room and it did not have peanuts BUT the patio doors would not lock on 4th floor. it was after 12AM and desk staff said it would besafe and fixed in Am. Well needless to say I did not sleep at all. Next AM requested different room and Manager siad we had to pay for upgrade, they made us pay the whole week in advance so our money was tied up. We were lied to by manager and other staff repeatedly, rooms unsafe and dirty, and there were ants and roaches! Never ever make this mistake.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "florida", "Title": "“fun place”", "Author": "broy", "ReviewID": "UR78951734", "Content": "older hotel with 2 great pools-- dj by the pool makes for great fun for all . have stayed here several times in past 4 yrs and it is ez access to all of the beach activities the jacuzzi rooms are the draw for us and the bar well thats always fun ask if joe or ronnie is working cause they are the best bar tenders on the strip. they have been changing rooms around and upgrading the last 2 x we were there -- and that is always good to see too many hotels in daytona do not update their place. thanks again for a good time see ya in oct for bike fest", "Date": "September 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“DO NOT STAY IN THIS ROACH INFESTED HOTEL!!!! YOUR FEELINGS WILL GET HURT!”", "Author": "dexishot268", "ReviewID": "UR78630613", "Content": "This is the MOST disgusting hotel i've ever slept in! They have dead roaches all over the hotel and they dont even bother to pick them up. When you first walk in they will fool you into believing that the hotel is nice but once you start walking and end up in your room you will be so disgusted! Seriously. I enjoyed myself in Daytona but I hated the hotel. There was a big hole at the top of our door and also in our wall! And all of the workers look like crack heads heroin addicts! Really! PLEASE LISTEN TO THESE REVIEWS AND DO NOT STAY IN THIS ROACH CITY HOTEL!!!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Had a great stay and fun time”", "Author": "ratdog25", "ReviewID": "UR78170136", "Content": "Living in Orlando I am half way between Tampa St Pete and Daytona Beach. Having a choice of over 100 Hotel/Motels my clear choice is the Desert Inn in Daytona Beach. From the moment you step into the lobby, you know you are someplace special. From the marble floors to the painting of sea life on the walls/ceiling you immediately know you made the right choice.The front desk staff were polite and helpfull. I was early for check-in and my room was not ready...NO problem, they gave me a free upgrade to a beautiiful ocean front/balcony. I found the room clean and comfortable. The view of the ocean was breathtaking. The first day it was raining, so I decided to go to the heated indoor pool. The water was a perfect temperature and the pool was clean. We met some people from S carolina and had a great time.We realized it was after 6pm and should decide on dinner. We decided the 4 of us should eat at the Beach Front Grill which is the hotels restaurant over looking the outdoor pool and the ocean. The food was prompt and tasted great.They give you 25% off the menu prices if you are staying there. The four of us ate and after discounts our check was very resonable. We had such a good time we decided to go back for lunch and coctails. Bartender Ronni was great. Another good time was had by all. Finally made it to the outdoor pool. They had a DJ who played just the right tunes. The pool was clean and inviting.Our new friends left the next day. We still had one more day to go. Another great day. Hated to check out.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Where are the renovations?”", "Author": "Nesia03", "ReviewID": "UR77911335", "Content": "When we first walked into the room, we just just stood there in disbelief for about 10 minutes. We immediately paid more money to get a room change, thinking that must have been the cheapest room they had...no improvement. I repeatedly examined the brochure which stated they had made all these renovations and kept looking back in the room and halls wondering where they were. We assumed that maybe the rooms facing the pool were the ones that were renovated, but judging from the other reviews on this site they were not. The hotel was literally falling apart. One day we walked down the hall and saw a piece of the hotel tile on the floor. It had fallen off the wall. In the room itself, it seemed as if the ceiling tiles were going to fall from the kitchen any minute. The hotel is quite old and has an odor throughout. Like others said, we too, saw a cockroach while there. There were random rooms which seemed like they were still being renovated, but there were no signs saying do not enter. My niece and I walked past one large room in the lobby area. It seemed as if it used the business center, but the ceiling had fallen through, so we decided not to enter. There was another small room in the basement area with a pile of broken chairs. We finally found the business center next to that room, but it was full of kids, on 2 or 3 computers, so we did not enter. I have to admit that the tub was probably the cleanest thing in the room. Hotel staff did clean each day and gave us plenty of new towels. However, there was mold in the bathroom on the wall behind the shower curtain.We were not comfortable there for the three days that we stayed, but dealt with it anyway. I would never go there again and would never recommend this hotel to families. This is clearly a party hotel considering that the majority of the people walking around enjoying themselves were either drunk or drinking. I would recommend this hotel to a bunch a partying college students that are just going to destroy a hotel anyway. I have to say, however, that when I was a college student and went to FL for spring break, we would have never stayed in a hotel like this. I find it interesting that hotel management (or whomever) is taking the time to respond to all of the bad reviews on this website. I find many of the responses from management to be funny because they simply are not true. I have been in agreement with all of the bad reviews I have seen except the comments about the hotel staff. They were quite friendly and helpful whenever we needed something, but their friendliness was overshadowed by the poor quality of the hotel. Just to give a hint of how honest the hotel website is, I have attached a picture. The hotel says that your room either has a view of the beach or a view of the river (we kept wondering what river). YAttached you can see our view of the river from our patio. It is located right behind the two orange spots in the background. I wish I had taken more pics of the hotel itself, but judging from the overall rating of the hotel, they are not needed. Oh and one more thing, I am a \"homebody,\" and when I go on vacation, I spend all of my time in the room relaxing and watching tv...not at this place. I stayed on the beach or in the pool area with my little neice and nephew just so that could get out of the hotel.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Seriously .. Bed Bugs!?!”", "Author": "Love_Juicy", "ReviewID": "UR75070579", "Content": "So my family and I stayed here for 1 night and i got horrible bed bug bites all over my arm. The hotel looked old and run down, there wasn't even an iron in the room. We changed hotels the same day. NEVER EVER going back there again. This place needs to be torn down.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Dunn, North Carolina", "Title": "“Do Not Stay At This Hotel, Nothing Like The Website”", "Author": "tammyby", "ReviewID": "UR73070822", "Content": "I went by the website pics and reserved a room with a jacuzzi, Terrible Mistake!! The jacuzzi was nothing more than a bath-tub with jets which didn't work right and smelled like stagnant water when you turned it on. Our room smelled terrible and was nasty!! The entire place smelled and the elevators are extremely slow. There were bags of trash sitting in the halls. The carpets in this place is nasty and outdated just like the entire hotel. This place was so bad we only stayed one night and we slept on top of the covers on the beds. The restaurant is pricey but also looks nasty. The pool area looks like it is never cleaned. Save your money and go to another hotel, I wish I had read these reviews before I let my family stay here. I don't recommend at ALL!!! STAY AWAY!!!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ethel,WV", "Title": "“It's Time \"dated\"”", "Author": "lmalt", "ReviewID": "UR72747414", "Content": "Very dated ,time for some remodeling, cleaning . Carpets need changed out in rooms I was in and some repair work , sliding glass door in the room was very hard to open and the handle was broken because of it., staff needs to spend a little more time cleaning around the pool area ,steps going to the beach , I don't think was hosed off the four days that we were there. The pool deck need some attendation also , The steps going from the sun decks to the inside were nastly all the time. I can not recommend this Inn to anyone for a family stay ,may be ok for the spring break group.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Lima, Ohio", "Title": "“Worse hotel ever!!! please listen to the reviews we didn't and we should have”", "Author": "kati23", "ReviewID": "UR72440300", "Content": "The staff at the place is very very rude. You have to fight to get the stuff you need the room because they will never just give them to you. We had 9 people and everyday we had to fight to get enough towels for all of us..Because they would only give us 4 to 5 big towel a day. 1 wash cloth a day. And you had to fight for garage bags and toilet paper. The staff would make up ever reason for the problems. The place smells really bad. It doesn't even look like the place on the website.. Then when you want to talk to a manager they will refuse to let you talk to them. I was there a week and heard many people asking and getting the same answers I got she is busy.. I finally talk to her today and she was just as rude as the staff are. I will never go back to the place at all.. Please dont waste your money like we did for the week.. Just out other places.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Family has been staying here for 25+ years...will NEVER go back!!!”", "Author": "dag8370", "ReviewID": "UR71562088", "Content": ".Every year my family stays at the Desert Inn. My grandparents began staying when my father and his brother were teenagers. I am 25 years old and have been going with my family since I was 4 years old. This year my grandparents agreed that we will NEVER go back. The hotel has steadily decline over the past few decades. Now that I am old enough to see the terrible conditions of the motel I felt the need to tell others about it. This year we traveled with two small children (5 yrs and 7 months). Our room was WAY too small for the five adults and two children we had in our group (we have stayed in larger rooms before). We had so little space that we could not all sit in the living room together! With one sofa and one small chair someone always had to stand or sit in the bedroom or on the floor. The pull out bed was gross with a large dark colored stain across it. The bathroom door was so warped by moisture that it would not close. The bathroom floor flooded every time someone took a shower because the lip of the handicap shower did not prevent the water from running out of the stall (we wore flip flops everytime we went into the bathroom, like a college dorm!). Only one burner worked on the stove. While cooking one night the cabinets suddenly fell down. The fridge was not the usually size but had been replaced with one much smaller, we could not store food and drinks! One day at around 11am we hear a loud banging sound from next door. The 7 months old was napping at the time. The baby woke up screaming and his mother (my cousin) walked next store to complain. It turns out that maintenance was installing a vent that would empty out on our balcony! (But of course no one bothered to call and tell us so that we could plan accordingly) At least the maintenance guys were very nice once they realized that they had woken up the baby and they apologized several times. And finally, on the day of our checkout we called the front desk early to see if we could have an extension so that we could let the kids play out at the pool before their 14 hr car ride home. We were told that we could stay until 2 o'clock (regular checkout is 11am). At about noon we received a call from the front desk telling us that we had to be out ASAP and that the previous person we spoke to had made a mistake. My cousin Josh walked down to the front desk and advised that the kids were in the pool as the rest of us were packing and that the front desk had given us an extension. The man at the front desk acknowledged that it was indeed the Inn's fault and said that we could have an extension until 2pm. At 12:30 a women from the front desk called and ask why we were not out of our room yet. I explained that we were giving until 2pm and that we were currently loading the cars. The woman was very rude and said that 2pm was too late and that we had to be out by 1pm (do these people not confer with one another???). Thankfully the kids and my grandparents returned within a few minutes after that phone call. We finished loading the cars, cleaned up the kids and left...we will NEVER be back!!!", "Date": "July 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“DON'T BELIEVE THE HYPE!!!!!!!!!!!!!!!!!!!!!!”", "Author": "bosslady_atl", "ReviewID": "UR70340631", "Content": "OMG............. This hotel is not what the internet says it is. My husband and i traved all the way from Atlanta Ga only to be DISAPPOINTED by this rundown hotel. We were very skeptical once we arrived but decided to check in any way. Once we got on the elevators to go to the room they reaked of urine smell. When we made it to the room we had to open the patio door because it smelled just as bad as the elevator. The tile was coming from ceiling in the bathroom. The tile in front of the door was damp and my husband almost fell. After being here for five minutes we immediately checked out and checked into the Hoilday Inn which is located right next door. I would never stay at the desert inn even if they were renting the rooms for FREE............ This place needs to be torn down IMMEDIATELY........ IF YOU ARE EVER THINKING ABOUT STAYING AT THE DESERT INN ON DAYTONA BEACH PLEASE THINK TWICE.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Spartanburg, South Carolina", "Title": "“BE-FREAKIN-AWARE!!!!!!!!!!!!!!!”", "Author": "dadudu123456789", "ReviewID": "UR70070656", "Content": "I would definantly NOT recomend this place to anybody, not even a hobo in need of shelter! The pictures of this place were very nice. But untill you see the real thing, dont stay here! The bed inside of the couch was small, nasty, holey, very uncomfortable when I sat on it. The beds were just disgusting. Nasty, wet, stinky 10 year old towels laying EVERYWHERE. The plastic, painted gold ceiling liners were chipped and ugly. The lights were flickering down the hallways, felt like i was in a scary movie about to be killed. The parking area was hard to get in and out of, the floors in there were nasty and damp. I steped on the floor and my shoes stuck to it!! There were creepy drunk people hanging out down there. The patio was crumbling, and the plastic furniture sitting out on the patio were nasty and sticky. The tiles were falling, OFF THE WALL, who puts tile on the walls?!?! Dont not ever ever ever stay here, go to the La Quinta down the street for a few extra bucks.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Apopka, Florida", "Title": "“AWESOME PARTY HOTEL!”", "Author": "flboy4life", "ReviewID": "UR69246471", "Content": "love dersert inn! i hate when people down it. its stritly a party hotel.. if u want fancy go somewhere else. if u want a great hotel to party at and not worry about getting into trouble this is it! the cheap rooms are crappy but the suites are worth it! love the people and the atmosphere. its not for everyone but definetly for me! :)", "Date": "June 30, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "", "Title": "“WORST HOTEL ON THE PLANET!!!”", "Author": "Emorphiliaty", "ReviewID": "UR69107419", "Content": "There is probobly better ones on pluto. Bad service, bloody sheets, police caution tape around the pool, wet stinky towels layin around all over the place, the couch bed was crusty and had holes and rat crap on it. My brother-in-law sat on the couch bed and fell thru it. The tiles were coming off, there were black lights over top of the beds that flickered, a weird pole was right in front of the patio door, walked out on the patio and thought we were gonna fall thru it! I would not recomend this hotel to anybody!! IF YOU WANT TO LIVE, DONT STAY HERE! (:", "Date": "June 29, 2010"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Attalla", "Title": "“Should be ashamed.”", "Author": "LuBuDa", "ReviewID": "UR68997625", "Content": "Parking area is like a dungeon, wet and dank. Hallway from parking area to lobby, wet and dank. We were awakened several mornings by what sounded like woodpeckers on steroids. Office said it was maintenance work. Balcony concrete is crumbling.The floor tile in kitchenette stayed wet and dangerous. My wife who is 69 slid down and hurt her lower back and the back of her head. She had a knot as large as a baseball in a matter of minutes. This required medical attention the next day. I phoned the office seconds after it happened, then had to call again before anyone came up. I filed an incident report with the office and have received no response. We kept towels on the kitchenette floor after that. Not one person on the staff asked about my wife that night and the remainder of our stay, nor has anyone called to check on her.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Novi, Michigan", "Title": "“ABSOLUTELY REPULSIVE”", "Author": "belle0101", "ReviewID": "UR68484057", "Content": "We didn't stay there, but we came very close. After looking at the reviews we decided we shouldn't. But we ended up walking over there just to see what it looks like. Worst hotel I have ever seen. Floor tiles falling off the steps, unidentified substances on the ground, ceilings falling down, mold on the outside and inside, smells strange, unused rooms that look like they have been abandoned for 20 years, and worst of all.... We saw two cockroaches. One was alive and was crawling up a wall while the other one was half dead lying upsidedown with its \"legs\" moving in the air in the middle of the hallway. And these aren't just your average cockroaches, these were EXTRA LARGE cockroaches. By far the biggest, ugliest cockroaches I have ever seen. After seeing these two creepy crawlers, we immediately left knowing that the more we explored, the more cockroaches we would see. I just can't imagine what the rooms look like if the rest of the hotel looked this disgusting!", "Date": "June 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Winter Park, Florida", "Title": "“Warning! Beware of False advertisement”", "Author": "bbarcia", "ReviewID": "UR68477667", "Content": "This place was sooooooo gross! We had to file a formal complaint with the department of business regulations in the state of Florida and Board of Health. In my complaint I told them of the dangers that lie in this hotel. There is no security of any sort. The front desk staff could have cared less who was coming or going from this place. (They were toooo busy texting on their cellphones) The manager \"Marie Could Care Less\" about the health or welfare of any patrons staying at the hotel that she is in charge of. She was very Cold and None emotional when hearing our complaints...She must hear so many complaints that she has become numb and Just shuts down or places the blame else where. The photos on the website are from years ago when the hotel was taken care of. Now it's just a Run Down Mess! For a few dollars more you can stay at the hotel next door...La Quinta.", "Date": "June 23, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Lakeland, Georgia", "Title": "“desert inn differant”", "Author": "wishbone5", "ReviewID": "UR66266133", "Content": "it is a little old but,it does have good features the new ones don't. and not to much money for the good stuff. big fenced in balcony looking at the ocean. big swimming pool outside and a little one too. good loud music by the pool. nice heated indoor pool. good eating place and drinks.plus alittle lite on rules. and the inside the room jaquizzi works it was nice. got to smoke,party,and take my dog on his first beach trip.i had a good time.", "Date": "June 2, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Mechanicsburg, Pennsylvania", "Title": "“What a dump!”", "Author": "Bear625", "ReviewID": "UR64079996", "Content": "I was suckered to this place by an internet ad that pictured a vibrant casino atmosphere and low prices... maybe 20 years ago. The place is run-down, dark and dirty. I didn't stay - went down the street to the La Quinta - another world for only a few bucks more.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mount Juliet", "Title": "“STAY FAR AWAY”", "Author": "neelyc", "ReviewID": "UR61259139", "Content": "This is by far the most disgusting place that I have ever stayed. This place has not been cleaned in quite some time and it is very apparent. There were roaches in the room, water leaks setting up mold, hairs on the sheets, cheese stuck to the elevator door, bags and bags of trash in the hallways, and feces on the floor in the bathroom for the pool. Horrible. I reported to Volusia County Health Dept. [--]", "Date": "April 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "florida", "Title": "“AVOID AVOID AVOID”", "Author": "cathy7676", "ReviewID": "UR61049344", "Content": "if you don't mind swimming with people that are high on drugs, drunk and trashy then this would be good for you. The staff is very rude. Not accommodating at all. Sleep quality was horrible. All night people were screaming from the balcony and throwing bottles. The TV in the room did not have cable. Hotel said they had free wi-fi, but they don't. The rooms stink like urine. Elevator smelled and there was empty beer bottles on the elevator floor. One guy invited me and my nieces/nephews to his room saying he had weed, ecstasy, crack for sale. While getting the invitation, 2 young men showed up and clearer looked to be high already. The guy selling the \"Happy Items\" excused himself and said he had to go take care of his business. I cannot believe I drove such a far distance to stay in this DUMP!!!!!", "Date": "April 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Michigan", "Title": "“Avoid at all costs”", "Author": "MythoughtsMichigan", "ReviewID": "UR58124451", "Content": "Horrible plact to stay with incredibly rude staff. Tried to speak to the manager for three days but Marie was never available. Trying to discover who the owners are to let them know how disgusting this place truly is. Ceilings are caving in, rooms are filthy...try any place but this one. Worst place I have ever stayed.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“THIS IS A DUMP!! AVOID AT ALL COSTS”", "Author": "TimeTraveler416", "ReviewID": "UR57478780", "Content": "little bugs everywhere, Dirty, not at all even passable. I wish I could give it all zeros. I would bulldoze it down and start over... Do Not Stay Here.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ohio", "Title": "“Nightmare”", "Author": "richard_ne", "ReviewID": "UR55601168", "Content": "Very outdated, dirty, disgusting! The furniture was very old, outdated and nothing matched. Looked as if it was picked up at rummage sales. Even the trim was plastic, painted gold and not removed from the walls before painting. The carpet was very old and dirty. The sofa bed was old and dirty. The only closet had to be accessed by climbing on the bed. We had a purple light above our bed. The drop ceilings were only inches above our heads with light bulbs hanging down. The kitchen table was a piece of counter top mounted to the wall with 2 pieces of plywood for legs. The pool area smelled of alcohol. The hand rails in the elevator fell off when touched. We got our money back after the first night and went to a nicer hotel. The locals called \"Desert Inn\" the drug capital of Daytona.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "pa", "Title": "“Dirty”", "Author": "sadindaytona", "ReviewID": "UR52961074", "Content": "Worst hotel we ever stayed in-please dont go by the pics-payed 100.00 a nite-wasnt worth 1.00 a nite-couldnt wait 2 check out! DIRTY DIRTY DIRTY", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "jacksonville", "Title": "“Great Hotel and great service!”", "Author": "philly098", "ReviewID": "UR45945102", "Content": "I stayed here for a lond weekend with some friends and we loved it. The pool area is really nice and the restaurant that looks over the pool is really good and there are a lot of great deals at the restaurant if you are staying there. The indoor pool was also really nice. The rooms were really clean. The staff was very friendly and kind. If I had a complaint they dealt with it right away and were very nice about it. There where no chairs on the balcony and when I called to complain they were sent up immediately. The prices were really good and it was in a great location. Close to everything. I would recommend and will be going there again soon.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Chattanooga , Tennessee", "Title": "“Desert Inn (Very Dissapointing)”", "Author": "G0ldwingRider", "ReviewID": "UR41192844", "Content": "If you visit the website of Desert Inn, they will send you a VIP card with all of the things that they will give you for staying with them, dont believe it, you will not recieve the 300 Gasoline voucher, however they will upgrade your room for you, but the rooms are so dirty your upgrade is still as bad as what you booked, the people were friendly there but it is a bad resort not happy", "Date": "September 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "DeLand, Florida", "Title": "“Help Don't Stay Here”", "Author": "StardustCruiser", "ReviewID": "UR37922146", "Content": "What you see on the website is correct. Years ago...and now the upkeep in awful....they cater to Spring Breakers...do a walk through first before giving your hard earned money...DO NOT REG. ONLINE...do it in person.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Florida", "Title": "“Beware”", "Author": "Beansquean04", "ReviewID": "UR37184594", "Content": "My family and I booked at this hotel without checking with Trip Advisor, in error. When we showed up the place and it did not match the pictures on the website unless they were taken 20 years ago. The whole place is constantly moist...floors always wet. Even on the 6th floor the smell of mildew was overwhelming. The room was dirty...crumbs under the sheets, no blanket underneath the bed cover, huge stains on the carpet, no bedskirt. The main light for the room is a blacklight...who does this? It seemed more like a place you rent by the hour than a place that calls itseft \"Luxurious.\" There was no way to latch the security latch, no emergency plan on the back of the door, and mildew all over the vents. I would strongly advise against staying here if you have any allergies or respiratory problems. This hotel is a mess and I would suggest spending the extra $20 and go somwhere else.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "tifton ga", "Title": "“Believe the Reviews”", "Author": "bmcclain36", "ReviewID": "UR35980664", "Content": "Anyone reading this please believe the reviews. At first, I didn't believe the rooms could be that bad. Actually, they were not bad, they were horrible. I won't write too much I will let the pictures speak for themselves. Dont waste your money. The Florida health department should do a serious inspection on this place for the mold and dirt. The houskeeping is terrible and our room was dirty. I hate we spent 245.00 for two nights and we lived like pigs. We felt robbed and cheated for what we paid. Our room was considered a miny suite.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Central Florida", "Title": "“Never Again...Place Is Not Clean...Cockroaches!!!”", "Author": "peanutnichols", "ReviewID": "UR35560692", "Content": "After reading the reviews I see that we are the only ones VERY DISGUSTED with The Desert Inn.........The entire property needs CLEANED, starting with the pool deck, the restaurant, and the rooms. We had a \"jacuzzi room\" on the ground floor. The private patio area was nasty, the carpet and not been vacuumed. The water pressure is so poor is took an hour to fill the tub. No overhead lighting in the room, three lamps, only two worked. Five light bulbs above the vanity area, only two worked. No coffee maker in room. Very SMALL television. They advertise 'premium channels', we never found them. The undrground parking area was nasty, trash everywhere and WHAT is that SMELL?? We paid $159.00 a night for this dump, they should have paid us to stay there...NEVER EV ER AGAIN!!!!!!!!!!! And I HATE Cockroaches!! !YUCK!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Lake Worth, FL", "Title": "“Never ever ever stay here”", "Author": "SouthFLmom", "ReviewID": "UR35279567", "Content": "Look, a place can be old without being disgusting. The fact that this hotel has not been updated in any way is not nearly as problematic as the terrible housekeeping and maintenance issues. Yes, you can get an oceanfront room with a balcony. But you won't want your bare feet or hands or any other part to touch any surface in your room. You won't want to drive in the parking garage, much less walk in it. You won't want to walk down any of the hallways and you won't appreciate the \"cuisine\" served at the restaurant. Please don't even think of using the public restrooms. Don't allow your small children to be present at the poolside \"entertainment.\" Just don't stay there.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Atlanta", "Title": "“This place is a disgusting rat hole. Don't waste your money/vacation time!”", "Author": "JHCochran", "ReviewID": "UR35200168", "Content": "The Desert Inn is easily the most disgusting dive that I've have ever set foot in. The room was so musty that the bed sheets were actually damp. We literally had to lay a towel on the fitted sheet so that we could fall asleep. If it wasn't for a few shots of tequila and several beers, we wouldn't have even been able to sleep! The walls are paper thin. You can hear everything that goes on in your neighbor's room...which is great when they decide to bring a screaming baby and a ridiculously vocal 15 pound lap dog on vacation with them (that's right, dogs are welcome!!!). We took two showers and the water never even drained out of the tub. Ridiculous. Don't waste your money. You'd be better off pitching a tent on the beach.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Ohio", "Title": "“Go with your gut!”", "Author": "TripletMommy", "ReviewID": "UR34460520", "Content": "We took our 3 children to Disney World for their birthdays, and decided to take a trip to Daytona Beach, so the kids could experience the ocean and beach. We actually had reservations at Comfort Inn and Suites down the street, however they messed up our reservations and we ended up with two rooms on separate floors rather than adjoining, so my husband went on a quick search for another hotel and came across the Desert Inn. The woman who answered the phone said, they have suites availalbe, it's clean, they are updating, and all this other stuff that makes them so great. From the outside/beach side it looked acceptable however when we went in and he saw the sign above the front desk saying \"no refunds and you must pay upfront\" we should've packed up and ran!!! The basement of the hotel, where they tell you to park, had water leaking into it and seriously scared me! It was nasty looking, dim and very dingy. The walk way to the elevators was full of water, now it just rained, so I am sure the run off went right into the basement/parking area. When we checked into the room, a maintenance cart was in the room, pictures laying all over, nails and a utility knive on the floor. Apparently they were hanging new pictures on the walls. The room was one of their \"suites\", which I'm sure back in the 1950s this place was the Taj Mahal, however it smelled musty and just seemed like no one stayed in there for eons. The room for our large group was the best option, two bedrooms, two baths, kitchenette, and both a city and ocean view, was probably the best part of this hotel,seeing out both the front and back. We paid over $200 per night for this place, and feel we were robbed, but again, since our other hotel messed up we basically had no options. We did enjoy the pool, DJ, and ocean, which pretty much saved us from going crazy in the room, at least we were able to swim and enjoy the beach, but that was about it. As for the continental breakfast, what a joke! It was only from 8am - 9am and you could only take 1 muffin, 1 danish, or 3 mini muffins...that is it! No coffee after 9am unless you want to pay $2.50/cup with only 1 refill. Daytona Beach was the low light of our vacation, mainly because of this hotel.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "kentucky", "Title": "“Would Never Go Back”", "Author": "jkpatrick3476", "ReviewID": "UR33842560", "Content": "Were there from June 26th to June 30th and was suppose to check out on July 1st, but the room smelled of sewer so bad from where it was leaking from the floor above us into our bathtub that we just could not stand it any longer. We complained two days, with the first calling twice and no one came. The second time was around 11p.m. the following night. The maintenance man came and called downstairs and told them they were defininity a smell and were going to try to move us, but never heard anything else about it. After three mornings waking up nauseated and couldn't stay in the room and having to always first thing in the morning having to go out to keep from being sick we lefted earlier. This place is not what it is represented as. Our room number was 546, so if anyone gets that room be prepared to be nauseated while you are in that room.", "Date": "July 3, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "2"}, "AuthorLocation": "Jupiter, Florida", "Title": "“Do not stay here!!! Not even for my enemies!!!”", "Author": "ViviVale", "ReviewID": "UR33227868", "Content": "I have stayed in many hotels in different places & countries ... but this is even worst than a \"4th World Country shak\" ... horrible, dirty, bugs everywhere, people actually live in that nasty hotel!! SUCKS!! Would not stay there ever again even if it was for free!!", "Date": "June 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "GA", "Title": "“A nuclear deviced needed to start over”", "Author": "psarnett", "ReviewID": "UR31800851", "Content": "I always review the official website and others such as this. I realize first hand you can't please everyone, in fact I have never written anything this negative. With that being said, I gave this dump a chance. When we arrived I found water standing in locations in the lobby area, the windows were water spot stained. I checked us in to get to the parking garage that had water standing in it, stinking and humid. Once we got to the room we found the A/c unit above head leaking water. There was mold in places around the baseboard, so we were moved. A few days later, we went to Disney World only to return and find the door partially open. Two laptops and a PSP later we were dealing with the local PD. The first question they asked was, is the balcony locked. Well considering I was on the third floor I didnt think to much of the fact that the lock was messed up, which i noticed the first day. This is the worst location period in daytona.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Tampa", "Title": "“YUCK! YUCK! YUCK! Don't stay here!”", "Author": "chick1245", "ReviewID": "UR30940645", "Content": "Yuck! This place was disgusting. When we walked into the lobby it was actually pretty nice. That was pretty much all that was nice. We parked in the parking garage. The whole bottom of the garage was flooded. The reason why is because all the water from the other levels get drained into the bottom level. Now, if you want to see stalagmites’ and stalactites’ without going to a cave. This parking garage is the place to go. It was poorly lit and because of all the leaks, you would get water all over you. In a parking garage! It was disgusting! Then the smell. The whole hotel had a nasty mildew smell. The carpets were moist/wet and the bed spread was moist/wet as well. Oh and our bed had rubber sheets on it, so when you made even the slightest movement on them, it would squeak. In our bathroom there was blood on the door and on the toilet paper roll. The computer room had a huge water leak and instead of putting a bucket to catch the water. They put a computer chair under it to catch the water. I will say it is an awesome location and right on the beach. But that is the only good thing I can say. Would not recommend to anybody. EVER!", "Date": "May 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Orlando", "Title": "“DONT”", "Author": "lisalala1382", "ReviewID": "UR30324047", "Content": "What can I say other than DONT stay there. My husband and I live in Orlando so we get away for the weekend quite often. The first thing I noticed was standing water everywhere. Later found out the 7th floor had flooded. Upon entering the room we noticed the air was not quite cold enough, later found the hot water was not working . We were without hot water for two days. The staff was not helpful at all, in fact they could care less. On top of this we got stuck in the elevator...another thing not working. Not to mention that this is one nasty place. Spend your money elsewhere, next time we will.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Believe the reviews”", "Author": "jworden", "ReviewID": "UR30207819", "Content": "I read many of the reviews and also visited the hotels web site. We decided to give it a try because the website looked great..........wow they should update their pictures since they were taken about 30 years ago. The place needs to be condemned. We walked into our room and walked right back out. Our feet stuck to the floor, it was filthy, and we had to wait 3 hours after check in for our room. Believe all the reviews. I also tried to comment on the Desert Inn Website but of course my comment wasn't posted. I didn't even dare sit on the couch........it was absolutely disgusting.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Jacksonville", "Title": "“Wouldn't stay anywhere else, even if it were free.”", "Author": "vckltn", "ReviewID": "UR29124843", "Content": "This is a very old hotel and does need a few upgrades, but the staff is among the best in the world and we travel everywhere. From the front desk to housekeeping and the restaurant, we have always been treated with outstanding service and courtesy. We stay there year after year and will be back for Memorial Weekend and other weekends during the summer. The DJ, bartenders and activiies are the attraction for us. We come to have fun, and we always do. Ron and Vickey", "Date": "May 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "5.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "indiana", "Title": "“PARTY”", "Author": "sis72490", "ReviewID": "UR27936895", "Content": "If you're the age of 18-24 this is the place to go ! I went with a group of people my age (18) and we loved it. It's the place to go if you're looking for craziness! It's a dump and it's super ghetto but the parties make it all worth the while!", "Date": "April 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "PEI", "Title": "“Totally Filthy!!!!!!!!!”", "Author": "pewill25", "ReviewID": "UR26396243", "Content": "This hotel looked beautiful from the first glance at the lobby! We checked in! The room was filthy, gross, terrible! I would not recommend anyone stay there! There was bugs(cockroaches) in the rooms! The rooms had been painted to cover up some of the filth! The carpets were filthy! My husband got up in the night and found a big cockroach in the bathtub! The next night he got up and couldn't believe the size of the cockroach in the tub! He called to wake me up to see it! I took pictures of it and caught it in a cup and brought it down to the front desk! The worker was not surprised at all! There was mold growing in the hallway and steps coming from the parking garage! There was lint growing out through the walls in the laundry room! There were signs in the restaurant advising guests to only take one bagel or cinnamon roll per person! You could get coffee, but no hot tea! The only thing that looked half decent was the lobby! Once past the very front of the lobby, the filth started! There was a cigarette butt on the floor the whole five days we were there!", "Date": "March 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "5", "Location": "5", "Rooms": "1"}, "AuthorLocation": "indiana", "Title": "“Very Nasty And Dont Expect To Talk To A Manager”", "Author": "spowell96", "ReviewID": "UR25206909", "Content": "Lets just start off by saying this hotel is very nasty, the staff is very rude and dont ask for a manager because you will not get one nor a will you get there name. The hotel was nothing like there website and do not recomend this hotel to no one. The room when you walked in looks like the ceiling could fall in at any time the toilet had to plunged several times, there were ants everywhere, no heat and when reported to front desk that there was no heat we were suppose to get heaters and never did, housekeeping put blood stained sheets on the beds and when we reported it and asked to speak to a manager was told that the manager would be in, in the morning at 8:00 and come that time there wasn't a manager suddenly they were in Miami and would not be back until Friday or Monday and when asked for the name its there policy not to give it out. BEWARE STAY AWAY", "Date": "February 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Orlando", "Title": "“Worst hotel resort I have ever had to step foot into”", "Author": "FlbeachloverOrlando", "ReviewID": "UR20759973", "Content": "I saw their ads in the Orlando Sentinel and went to their web page and decided to try it. We arrived to a nasty looking building with no doorman or bell hops to be seen. The lobby odor was enough to make me ill (I'm allergic to mold) But I said ok - lets just try it. Our room was just plain gross. Ugly, old, carpet that I would not even walk on bare foot. The \"full- kitchen\" was all different types of equipment and mix/match furniture. The elevators were so moldy that we held our towels over our noses down to the pools and beach. The \"heated pool\" was not heated. And just before my 3 1/2 year old went to get in, grandma grabbed her and said \"no way\". There was fungus?mold?gonk all built up in the corners of the pool, along with dirty cups - and there was only 1 person on the pool deck when we got there. NASTY We went back up to our room - I got out the phone book and found a different place. We had to pay the full day price for the total of 3 hours we were on their property. Please - unless you like filth - do not go here!", "Date": "October 9, 2008"}, {"Ratings": {"Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Location": "3"}, "AuthorLocation": "debary", "Title": "“This is a nasty hotel very dirty and moldy”", "Author": "trickpony", "ReviewID": "UR20350305", "Content": "I just stayed at this hotel and got a suite so it was there best.It was very dirty hair on bathroom floor crap left in toilet but with a just cleaned tape on the top.The couch was moldy the bathroom had leaks that were painted over and and the walls were soft.At night there were lots of fights and blood was all over my door.I am not against partys but this place was a mess.I asked for a discount and they did nothing........", "Date": "September 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Georgia", "Title": "“Run away!!!”", "Author": "Rake1996", "ReviewID": "UR20271093", "Content": "Booked the room and went to dinner (did not go into the room yet). Came back about 11/2 hours later and went to the room (451). My husband took his shoes off and the floor was so wet he had to change his socks. Pulled down the bed spread and there was a roach in the bed my 2 kids started screaming. We got our things went down to the lobby and wanted our money back. The night clerk said he couldn't because we were in the room over 2 hours. We said we had only been in the room maybe 5 minutes and we would call the police if need be. He said fine call them this is private proberty and I can throw them out. When the police got there (and did not get thrown out) they told us that this hotel has been closed down before for mold problems and legionairs disease (spelling?). The clerk said come back in the morning to talk to manager and maybe get a refund. We went next door to Holiday inn (very nice). The next morning we went to see the manager and of course she was with someone and then on a phone call and another and another, we were determined to wait her out. After about 45 minutes she saw we were not leaving she finally came to talk to us and she did refund us but took $15.00 for cleaning fee since we pulled the covers on one bed down.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jacksonville NC", "Title": "“Desert Inn Resort”", "Author": "rondog21", "ReviewID": "UR19546682", "Content": "very nice hotel, lots of things to do. i stayed for a week and definetly would do it again. Thank You", "Date": "August 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "SC", "Title": "“\"Looks Can Be Deceiving\"”", "Author": "bigalchevy", "ReviewID": "UR18859907", "Content": "When we got to Daytona we drove around and looked at some hotels on the Oceanside. Saw this place and it looked like a good place to stay. Until we got checked in and got to our 1st room. The room was very nasty and had a funky smell to it. We were suppose to be Oceanside BUT was on the corner with a partial view of the ocean with NO balcony. Went down to the front desk and complained. They opted to move us to another room one floor up. We went to this room and it was the same way but against my better judgment we took the room for the night. During the night got up to use the bathroom and it was roach motel in the bathroom. The next morning got up and the ceiling in the bathroom was leaking. Called the front desk and they sent someone from maintenance to fix this problem. The shower above us was leaking down into our shower. So, once this happened we went back to the front desk to complain again...... Wanted to check out but was told could not refund money. Wanted to move me once again to suite. This being the 3rd time moved at this Dump Hotel. May have been a suite back in the day. There was broken glass in the kitchen, and MOLD on the vents from the AC. Still complained and wanted to speak with the manager and was advised she was in a meeting again. Left my name and telephone number for her to contact me and I am still waiting on her to contact me......... So, therefore I went to the Better Business Bureau. Take a word of advice from me. \" DON'T STAY AT THIS DUMP HOTEL \"", "Date": "August 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fernandina Beach, Florida", "Title": "“I've never complain: but take a second to read this...”", "Author": "delma411", "ReviewID": "UR17814848", "Content": "After many, many weekends in Daytona Beach we decided to try the Desert Inn based on the exterior appearance and location (we didnt check tripadvisor.com obviously) My wife and I are bikers and dont complain about much, we only ask for clean linens and bathroom. Minor flaws, cosmetic or otherwise, are ordinarilly overlooked. After seeing this room I was embarased for the staff there. We unpacked and decided we would 'tuff it out\". The longer we stayed the worse it got. We started by taking a dip in the pool. there were tons of smashed beer cans, cigarette butts and baby diapers (full of dookie) next to the pool, the daiper was almost IN the pool, missed by inches. Otherwise, this is the highlight of our stay. Once back upstaris in our \"Jacuzzi Suite\" (room 641) we showered where there were bugs in the tub, toweled off where there were bugs on the vanity. Just out of curiosity I checked the Jacuzzi and guess what? Bugs. Then decided to lay down where there were bugs between the comforter and the sheets. Nice touch, huh? GENERAL SANITATION IS A SERIOUS CONCERN IN THIS HOTEL! There were neumerous stains and 'stuff 'smeared on the wall. The trim and decor looks like a five year olds coloring book. The painting and wall finish appeares to be done by Stevie Wonder. Around the door surrounds there are substantial mildew buildup. The furniture is cheap and delapitaded, used years beyond it use. The antique carpets were definately not vaccumed. There were bugs (again) smashed on the glass of the sliding glass door leading to the balcony. There were even working blacklights above the bed (why I can only imagine...) Let me just colse by saying this. As for as I can remember, I have never written a review for a hotel. The condition of this hotel gives me genuine concern for anyone with small kids or older people who may become ill. Also, if you are planning on having a romantic get-away? FORGET IT. Just pack your stuff and run away, fast. My wife and I were at this hotel for ~2 hours.We were refused any portion of a refund by the front desk staff, but were welcome to \"talk it over with the manager\" who magically can't be reached. Dont believe what you see online. This was $170 mistake for me and my family. I am seroiusly considering going to the BBB of Daytona should I not get a refund and I will definately tell everyone I know that this place should be condemned. I am not exagerating, consider yourself warned!!!", "Date": "July 12, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Atlanta", "Title": "“Horrible, nasty, never again!”", "Author": "amandajean1209", "ReviewID": "UR17797953", "Content": "Right when I walked into Desert Inn I knew it was going to be horrible. The decor, which was airbrushed on all over the walls, was horrible. It smelled horrible and just looked all together nasty. Some of the staff were drinking alcohol while working. It only got worse when we arrived at our room. Before walking in there was vomit in a corner in the hall way and the staff was just walking by it, not even acknowleding it was there. We spoke to the cleaning lady as she was leaving our room and she told us she tried to clean it as best as she could because the boys before us didnt get their security deposit back because it looked like a dumpster in the room. After watching some guy pee off of the balcony above us we tried to check out but were told we werent able to until the next morning. After a long sleepless night because there was a huge fight in the hallway we stepped out into the hall way to find broken beer bottles and blood on the ground. We immediatly checked out and went next door to the Holiday Inn. It was one hundred times more better than the dump we had been in. If you are traveling to Daytona DO NOT stay at the Desert Inn!", "Date": "July 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Michigan", "Title": "“disgusting!”", "Author": "advisor456", "ReviewID": "UR17758003", "Content": "My boyfriend and I booked a room at this hotel for the Daytona Coke Zero 400 race. The website made it look nice and it was afordable, and seemed to be what we were looking for. We discovered the reviews on trip advisor after we had already put down the deposit, and considering just about every single review was negative we realized this hotel was not going to be what the website made it out to be, but since we already paid for one night we decided to look at the room before moving to a different hotel. Also, I had called the hotel prior to leaving asking if they were aware of the reviews which were posted online. Now obviously he isn't going to tell me the hotel is discusting or anything negative what so ever, but I just wanted to know what their response would be. The gentleman responded by telling me those reviews were due to the fact that they kick out kids on spring break and thats their way of getting back at the hotel and they can asure the room will be clean. We brought an air mattress and blankets so if it came down to it we could just sleep on that. When we got to the hotel it definately looked out dated and you could see from the outside one of the rooms had a light on but if wasn't just a normal light it was a black light, classy, but we still tried to have some hope of it being even in the \"okay\" category; however by this point knew it wasn't going to be. From the moment we walked in the door you could tell this was going to be a disaster. The man at the front desk was very unprofessional and couldn't find our reservations and honestly he didn't really seem too determined to do so; he seemed more concerned about finishing his cigarette, but we had brought the receipt with us so he figured it out from that. We asked to see the room before paying so he called a guy down the front desk wearing a dirty shirt that said security on the back. He took us down some random hallway off to the side past the pool which had a ton of stuff floating in it to our room. We booked a courtyard room. I wasn't aware that a courtyard was a big piece of cement with one plastic table and chairs on it, but I guess you learn something knew every day. Everything already smelled aweful and when he opened the door to the room everything got even worse. I really wish I could have gotten a picture of the room it was such a joke! There were two beds jammed in there so close to each other that I don't think I could have walked between them, piles of dirt were all over the floor, everything was old and dirty, and there was a stove shoved in the corner; the point to that I have no idea considering there wasn't even a fridge or any other form of appliance. We took one look at room looked at each other and said absolutely not! There was no way we could have even slept on the air mattress. As we walked out the guy behind the desk was now playing the guitar and the \"security guard\" never even said two words to us. We went the the Holiday Inn next door but it was full since it was race weekend. The man however did aplogize that we had booked at the Desert Inn and said they get people from there all the time. We ended up at the Sleep Inn which was actually in Ormond Beach, but it was great. We really enjoyed our stay there. The staff couldn't have been nicer and it was very clean. The lady behind the desk asked what brought us to the Sleep Inn and we told her that we had booked at the Desert Inn and she said, \"I won't say anything other than I'm sorry.\"", "Date": "July 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York", "Title": "“filthy disgusting gross roaches nasty nasty nasty nasty”", "Author": "NYGIRL44", "ReviewID": "UR17613676", "Content": "THIS PLACE SHOULD BE CONDEMNED. I am writing to the board of health to find out why it has not yet been closed. We went to Walmart to purchase new bedding and cleaning supplies. The carpeting has never been professionally cleaned, the décor is horrible, there has been virtually no up keep to the place, guests spitting in the swimming pool, horrible smells, trash that never got picked up…..I could go on for days. It was the most disgusting experience I have ever had.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "movedmainer", "Title": "“DUMP !!! Be Warned!!!”", "Author": "movedmainer", "ReviewID": "UR14505286", "Content": "This place is a whole in the wall.... After checking in and seeing the condition of the room... we decided to check out..... We were told from the front desk that we would get no refund and they offered us other rooms.....they handed over the first set of keys to updated room.... what a joke .... we walked in and found the celing tile on the floor.... Went back down to the front desk and they gave us keys to a jacuzzi patio suite.... went in the room and fold another celing tile on the floor and a room that smelled like mold... went back to the front desk and asked to speak to the owner and was told she would be back in the morning..... My wife said there was no way she was staying there..... told my wife let's deal with it one night.... looked around the hotel.... indoor pool water was mint green.... nice -- so we left ...... Don't run into the same problem we did with the no refund policy...", "Date": "March 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rhode Island", "Title": "“Worst hotel I have ever stayed in!!”", "Author": "fxr84", "ReviewID": "UR14444428", "Content": "This is my review I sent this letter to the Desert Inn To Whom It May Concern: My name is John E Conley and I recently attended Bike Week 2008 and stayed at The Desert Inn at Daytona Beach with 4 of my friends. The trip from February 29 to Saturday March 8, 2008 was booked by my friend Jack Shayer. We arrived at the hotel Friday, February 29, 2008 at approximately 11:30 pm. Once entering the lobby which is very nice we were given room 437. The room was anything but nice and clean. The condition of the room was deplorable, the room had two fold out couches that when opened revealed mattresses that were not fit for an animal to sleep on they were very seriously stained. The general condition of the room was unacceptable, the biggest problem it was not clean and the ceiling tiles were falling out etc. We decided to sleep on the floor which seemed to be the better choice than the couches. The next morning Jim Peterson one of the guys in our party went to the desk and informed the person about the conditions of the room. He left his phone number after being told if there was anything they could do they would call him. To make a long story short after a while we were assigned room 232.Going to the room I noticed the conditions of the hallways, dirt, broken tiles, and cigarette butts etc. The general condition of the room was just so so. There was mold in the bathroom and dust on the ceiling also there was a old half eaten egg and muffin under a chair that we had to move. We decided it was better than room 437. We then moved our belongings to this room. After resting for a little while we decided to take showers it was then we discovered there was very little water pressure. This water pressure problem was consistent through the rest of our stay. This was not what we expected for the price we were paying for a room ($2350.00). We then went to get our motorcycles and on my way going to the parking garage I then saw conditions that were very dangerous if not a serious health problem. The area in this walk way was very wet with water leaking out of the ceiling, a fan in the ping pong area was tied to the sprinkler system and there was a very serious mold problem everywhere, and wet electrical outlets plus many other serious problems, exit signs not lit or just broken etc (I took pictures of all this and will be sending them to the proper Health Department and Fire and Safety Officials and Building Inspector). In general the girl cleaning our room though very nice but did the very minimum no vacuuming, no cleaning she did not change the bed linens or cart linens no cleaning the bathroom just supplying new towels and fixing the beds and carts. I could go on and on but I won’t. I will however give you my party’s opinion of the staff and the hotel itself. The staff seems nice but there is a serious lack of supervision and leadership. (As all of us in the party said it seems there is no one in charge!!) The place is filthy and run down and the City or State should do a surprise Fire, Safety and Health inspection of the Hotel. I am sure they would find many serious violations. We as a group would never recommend the place to anyone. We will tell every one we talk to about our bad experience. I must say in my 51 years of traveling this is the worst place I have ever stayed in. Ps Your room card says Daytona’s# 1 Oceanfront Resort Hotel, Lie!!! John E Conley", "Date": "March 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Pennsylvania", "Title": "“Horrible!!!!! Dirty!!! Smelly!!! BUGS!!!!”", "Author": "penntravellor", "ReviewID": "UR13885599", "Content": "We were at this hotel (or scummy place) for the Daytona 500! We booked it online one year in advance. Internet was very deceptive!! The first room we were in had no air conditioning. The Kitchen and bathroom were filthy, the \"deck\" was scummy and the carpets were dirty. We asked to be moved to another room. The second room was worse. There was mold in the bathroom, the mirrors were all fingerprinted and dirty, the carpets hadn't been vaccuummed for what looked like weeks. And to top it all off there were dead and alive roaches!!! YUK!!!! Unfortunately, we had no other option than to stay because every other place was booked because of the race! We actually had to ask the cleaning person if we could borrow the vaccuum cleaner and we bought Clorox wipes to clean the room ourselves! I felt so scummy staying there. Even the sheets smelled! I could not wait to leave. Thank Goodness we only had to stay a few days!!!! I would NOT recommend this place to anyone! They should tear it down!!!", "Date": "February 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“I'm writing this review from my room at the desert inn”", "Author": "bettertoknow", "ReviewID": "UR13876162", "Content": "OK, so I saw the pretty decent website and thought like many others that this hotel might be a good stay at a bargain price. I got here yesterday and here's my unbiased review. On arrival, my fiancee's first words were \"Oh my God it looks like Liberace threw up here\" after speaking with management it appears that Liberace actually DID stay here for real. Cons: On check in we were unimpressedwith the girl at the front desk who tried to charge us for our room we had already prepaid for, also noone is there to help with bags and their luggage carts are from the 1950's, so incidentally are the elevators. Also unimpressed with the used bandaid on the carpet of our room, and the gum stuck to the wall tiles, also the toilet did not flush and the sink did not drain, but the absolute worst concerns were to come later. I manage a 24 storey building in Toronto Canada so I know a few things here when I speak. I checked the fire extinguishers outside my room and found they had not been checked since October 2007, almost 5 months previous! Worse still, after my first night I was shocked and horrified to learn that my electronic room lock on my door did not work. YES, anyone who pushed on my door could walk in! Pros: This place is structually very pleasant, well that is before Liberace's decorator took over. Everywhere you look it seems as if someone with really really bad taste had way too much say in things. Put it this way, anyone who thinks bright pink and gold look good together in a hallway should be shot, urinated on, then shot again for good measure. But this is my pros section so I'll get to the good stuff. The pools are very well kept and as pictured. For my family we were looking to beat the cold of Ontario's winter and for that it worked very well. The staff (though minimal) seemed for the most part interested in resolving our concerns, ok, let's rephrase that, they seemed interested in hearing our concerns. Bottom line: Check your door locks, but aside from that it's no Holiday Inn, beach and pools are great, so is the location so do a thorough site check before accepting your room. In the end if you want the Holiday Inn, it's right next door. Desert Inn would be best advised to FIRE their interior decorator and terrible airbrush artist who painted Nemo and terrible sunsets EVERYWHERE they found a blank wall. Also the graffiti saying \"Go Gay Bulldogs\" could have been removed from the elevators.", "Date": "February 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Loved The Desert Inn Daytona Beach”", "Author": "Kevin-Judy", "ReviewID": "UR12694688", "Content": "Kevin and Judy from Milwaukee Wisconsin. We have gone to the Daytona 500 for about 14 years, Staying at the Desert Inn is the best, The rooms are verry clean, the staff is great, They are always there if you need anything. The pool is always clean, unlike some of the other hotels in the area. we will always stay at the Desert Inn, and we always tell our friends to stay there. Cant wait for February 2008, It should be another great time.", "Date": "January 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ed Whitaker", "Title": "“Don't believe the manager's response...”", "Author": "EDDIEWHITAKER", "ReviewID": "UR12106702", "Content": "I have never seen a hotel as nasty as this place. It would be better if it was torn down and they started over from scratch. My wife and I stayed here in November for what we thought would be a fun, inexpensive stay. Unfortunately, we experienced poor service and a nasty room. Seriously, seriously nasty - I would expect a hotel in this class to rent by the hour. I felt I needed to sleep in my clothes it was so disgusting!", "Date": "December 30, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "florida", "Title": "“the nastiest hotel ever( the place is a dump)”", "Author": "jlove25", "ReviewID": "UR10824863", "Content": "my husband and i were celebrating our anniversay and thought it would be nice to get a hotel on the beach with a jaccuzi in the room. found this hotel on there website and saw the pictures and thought wow this seems like a nice hotel and not that expensive. when we pulled up to the parking we started to think twice but thought this is a old hotel so we gave it a chance. when we got to our floor just as we walk off the elevator we see pink walls with tile the carpet was disgusting and it just smelled so bad. we went into our room and it was even worse. first the light did not go on once we found a light that worked and put it on the room was nasty floor was dirty, jaccuzzi was nasty the grout on the tile was black we didnt even want to walk on the floor. then we turn on tv and roaches came out from behind. we pull on quilt from bed and knats came out along with a big yellow stain on the so called clean white sheets. this place was just horrible and very unsanitary. we called down to manger and requested our money back and got the heck out of there. i would not recommend this hotel even for a hour nap. the garage was also nasty with water all over the place . this hotel needs some serious renovations it needs to be built all over again.......they say they redid the carpets i could not tell.", "Date": "November 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ringgold, Georgia", "Title": "“This place is a Dump.”", "Author": "flyby6563", "ReviewID": "UR10127735", "Content": "This place is a dump. Old and outdated. Mold and bugs. Carpet is very dirty and nasty thoughout the hotel. Smells bad. Don't beleive the reviews that say \"WOW great hotel\" because it isn't. I won't stay here again.", "Date": "October 18, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "tavares, Florida", "Title": "“Worst Hotel EVER”", "Author": "dva19926", "ReviewID": "UR8827207", "Content": "Myself, my teenage daughter and 5 of her friends spent the night in one of their \"suites\". The experience was horrible. The air conditioner did not work properly, there was MOLD growing on the couch pillows, unsanitary items on floor, walls were dirty, doors did not shut properly, old food in the couch bed, front office staff rude, no name tags, no return calls from the manager after several attempts, continental breakfast minimal and stale. Overall experience was horrible. Would NOT recommend to anyone. The same money will get you a great night and several other hotels.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Washington, DC", "Title": "“PLEASE Trust the Reviews - Do not WASTE your time here.”", "Author": "DC-World-Traveler-07", "ReviewID": "UR8459009", "Content": "Please trust the reviews. My family and I planned a three night stay in Daytona Beach and choose this hotel based on the website. We reserved the two bedroom suite with two bathrooms, full kitchen and two queen size sleep sofas in the living area. Sounds great, but do not believe the pictures on the website. The living area on the website was about 4 times the size of the actual living space. We were very disappointmented from the moment we drove up to check-in, more disappointmented when we drove to the parking garage... Imagine if you will... walking from the parking garage to the hotel elevator. First you walk through a small door down a hall with water dripping from the ceiling on the the already very wet floor. Now turn right down another hall without water on the floor, but instantly you are hit in the face with heat from the washer and dryers to your right. Next you see the outdated computer center, game room that some drunk during Spring Break would enjoy, Last you enter the area with the 3 elevators, which only one works unless you find the magical button which operates the second elevator. Even though these were true signs of needed renovation work, I remembered the picture from the website and thought things would improve once I entered the room. My immediate reaction after dropping my bags was to run down stairs and inform the representative that we were given the incorrect room because the pictures on the website described the room differently and had pictures of larger rooms. I was informed that we had the largest room in the hotel. The representative would not entertain my comments about the pictures on the website. I thought no worries, just a long weekend. Events continued through the night, which forced me to move my family down the street to a different hotel, which charged a premium since it was a last minute reservation. I had to fight with the manager for a refund, which she eventually honored, but I had to pay for the first night plus an additional fee. Fine... I just wanted out. Now to further share my thoughts, I have stayed in hotels in Eastern Europe, West Africa, parts of South America and have never seen such a mess of a hotel. If you are young on a very tight budget and want to go to the beach, this might be the place for you. However, if you are taking your family to the beach, choose another location.", "Date": "August 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Apopka", "Title": "“Big mistake nasty,nasty,nasty”", "Author": "daziduks", "ReviewID": "UR8357312", "Content": "Where do I start, well we were there for the weekend with friends. Seven of us 3 rooms all discusting. Well in front lobby under the stairs.There are some plastic plants near the elevators. Last year 2006 spring break my friends saw the same bag of animal cookies under one of the dusty old plastic plants, STILL THERE!!! GROSS. House keeping never came to either room. Toilets didn't flush or they were leaking. Water leaking from the ceiling in the bathroom and kitchen. Toaster was rusted, no alarm clock, blow dryer was broke , ants in the bathroom, beds were hard as concreate slab, pillows were stained. Lamp shade was missing the screw, cheezy paint job on the walls. Broken black light above the bed tacky. Missing fire extingishers in different locations, halls,lobby,rooms everything smelled moldy . This motel not hotel resort doesn't get any rating from me it is exstreamly unsafe and unsanitary to stay there.We wouldn't even eat there. Next door at the Holiday inn was very nice.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Arkansas", "Title": "“terrible old dump”", "Author": "thebuzbeeclan", "ReviewID": "UR8141339", "Content": "This was a dump. I have nothing good to say about this place. I knew when we drove up to the lobby we had messed up. There were people in the lobby with the same complaints. The pictures are totally deceiving. The carpet was filthy. Their brochure reports over 10 million dollars spent in renovations. I couldn’t see where any money had been spent on this place in the last 20 years. I have stayed in 5 stars and I have stayed in Hotels that were cheap, but nothing as dumpy as this place. I don’t see how it could pass building codes. There where loose wires hanging off the old pillars on the pool areas. There was broken out glass on their fire extinguisher boxes. The kitchenette was joke. An old table and no chairs. We have planned on staying in the room, but stayed away except at bedtime and we all slept in our clothes because we did not want to touch anything. We could have checked out immediately but there weren’t any other places available on such short notice. We ended up checking out a day early. The brochure reports a ballroom and convention center which isn’t even open. I would not recommend this place to anyone.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St Louis, MO", "Title": "“Not as bad as expected”", "Author": "DanceMom01", "ReviewID": "UR8073156", "Content": "As others reading reviews, we were terrified of checking into the hotel. But from early on, employees were quite accommodating (we arrived a day early). Other than the usual sea-smell, our room was quite clean and found the beds to be quite comfortable. The one complaint I had as far as the room goes was the AC; it was either On or Off, nothing in between. My little one had a problem with us keeping the room too cold. As for security, my little girl and I would quite often go out to the pool during the evening, and never once did I see someone threatening, and usually there were just family members going to and fro. Security is a big issue with me and I felt quite comfortable there. Sure the pool area during the day was busy, and quite boisterous, but I counted more families than single adults. Perhaps during Spring Break is when more problems arise. This was definitely one of the better places we've stayed, not the BEST, but considering it is an older hotel, they treated us pretty good and everything worked that needed to work. I would definitely stay there again.", "Date": "July 7, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "St. Louis, MO", "Title": "“Yuck!!!”", "Author": "lvthewtr", "ReviewID": "UR8062502", "Content": "Very dirty upon arrival we checked into find a stinky room with a moldy air freshener. The \"Suite\" was small with no bathtub we had small kids so this made it challenging (not that we would want them to sit in an old dirty tub) The maids did not come untill late in the afternoon about the time we came back so the kids could take a nap. The bathroom downstairs by the pool is nasty nasty nasty dont go down there Im not sure they ever clean it. There was a black light above our bed?? This is nice and cheap for teenagers not for families. The holiday inn next door is nice and clean go there!!", "Date": "July 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Absolutely Nasty!!”", "Author": "priceless_157", "ReviewID": "UR8034843", "Content": "Total shock at the condition of this property compared to the website. We checked in, went to our room, looked around and loaded our car to leave. The bed was about to fall down, the couch had holes, just to name a few problems. \"VERY\" disappointed.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "lake city", "Title": "“Disappointment”", "Author": "DIS_7", "ReviewID": "UR8025821", "Content": "Soo... my friend and her mom and my sister stayed at the DESERT INN... which we did not like at all. The pictures on their webpage FOOLED us. It wasn't spacious at all. We booked for 4 nights. We shouldn't have though, it wasn't what we expected. The room smelled. It wasn't comfortable. one of the pillows had a red mark on it. It was crappy, it's not nice. It's 40 years old by the way. ALSO. the room card costs 100 if you lose it. We only stayed for a night, and left to Daytona Resort And Conference Center. It was a really nice place compared to the Desert Inn. I loved everything about it. It is more luxurious and nice. It smelled good, everything was clean. You should go there if anything. But what bugs me is that WE payed for 4 nights at Desert INN and left a day later... and payed 379 more for another hotel. but whatever. i should be back to UPload some photos.. just let me tell you this hotel is a trick. don't go. it's a waste of money and time.", "Date": "June 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Antonio, TX", "Title": "“The Slum of Daytona Beach”", "Author": "Katstar03", "ReviewID": "UR7942341", "Content": "This had to be the worst hotel I have ever stayed at. It was so dirty. There really wasn't a single place in the entire hotel I would consider \"resort\" style. There were many drunk individuals making a scene in front of young children. My advice to college students...go for it. Cheap and right on the beach and plenty to drink. My advice to parents of young children...stay more than 6 blocks away from this hotel. I do not recommend this hotel to anyone except those who totally ignore these comments.", "Date": "June 20, 2007"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Brooklyn", "Title": "“Beware Of The Theft!!!”", "Author": "Anya_NYC", "ReviewID": "UR7839105", "Content": "I should have read the reviews before booking the hotel. We needed only for one night and that was the worst choice ever. We've got very dirty and stinky room. We asked for another one and it was a bit better. But...someone stole my nephew's expensive Disney World towel from the balcony. The other 3 plain towels were where we left them. We notified the front desk and the girl said there is nothing they could do about it. It is not like someone got inside the room. I requested to speak with the manager and I was refused. She came up with tons of excuses why the manager is unavailable at this moment. At 9:30am I asked for the report from the incident and it wasn't ready at 2pm, when I had to leave for the airport. The hotel is nasty, dirty, smells like a sewer and it's definately overpriced.", "Date": "June 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "St. Louis, MO", "Title": "“The Worst Ever”", "Author": "St_Louis_MOBeachgoer", "ReviewID": "UR7836350", "Content": "We just returned from our trip to Daytona Beach, Florida. Our stay at the Desert Inn was a total disappointment. The building is in need of some major repairs and up-dates. Each elevator trip was an experience that thankfully ended safely. There was a 6\" by 18\" hole in the ceiling of the kitchen area. The room was decorated with multiple ant traps. I'm thankful I did not have a young child crawling on the filthy floor. A roll away was delivered upon request. It was a thin mattress that looked as if it had hair. But I must say, my daughter had the best night sleep on that thin mattress compared to the rock hard bed I had. One day our room was not cleaned. When it was brought to the attention of the front desk, their reply was for us to come down to the front desk and collect clean towels since housekeeping was no longer on duty after 2 p.m. When we were charged for the entire stay upon check-in, that should have alerted me that there could be problems. The pool area was very nice, but the DJ entertainment at noon daily till 4 or 5, was so loud. The DJ provided activites for the very young, but everyone on the beach was given a play by play account of all the activites. Going up the steps from the beach, you unfortunately had to pass by the speaker! But alerting all the beach was not enough for this DJ, he also provided another speaker for those along the pool. Restful and relaxing? Not at all! My skin is still crawling from the experience!", "Date": "June 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Michigan", "Title": "“The website makes it look nice”", "Author": "christina069", "ReviewID": "UR7829358", "Content": "The room was dirty. There were stains on the walls and floors. The maid service came in and left new sheets, they didnt even change the beds or clean the room. I tried to get a wake up call 2 days in a row and i never got one. Also, at 2:45 am there were kids arguing about drugs outside my room for about 25 minutes. The front desk said that security was already down there but it lasted a very long time. The pictures in the website make it look a lot nicer than it really is.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Miami", "Title": "“DISGUSTING!!!!!!!!!!!”", "Author": "anjmiami", "ReviewID": "UR7714366", "Content": "This place should be reported! Definately not a place for small children because of the nasty crowd and cheap dirty appearance. Do not ever stay here, there is water on the floor, roaches in the bathrooms, service was terrible, no irons, no safe in the rooms. Bathrooms for the pool are disgusting! No bell service when you check in, people were so rude at the front desk.It is HORRIBLE...........should be closed down. We call it the Disaster inn.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“A true nightmare”", "Author": "DJ_Mayday", "ReviewID": "UR7714062", "Content": "This Hotel is so dirty...The hallways smell like old nasty shoes (mold??)...The rooms weren't clean, some towels with yellow stains on them, terrible food in their restaurant, overpriced for its quality. I do not recommend this hotel to anyone...It's nasty!!", "Date": "May 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "florida", "Title": "“worst hotel ever”", "Author": "necksnappa", "ReviewID": "UR7668608", "Content": "Warning Warning. only stay at this hotel if you are 18 years old i dont know where to begin. the rooms are the worst looking rooms ever. nothing works properly. the air conditioner is messed up, its either cold as hell or off. the phone didnt work. you dont get all the normal cable channels, the remote for the tv was an OLD NINTENDO CONTROLLER thats attached to the tv. my room had a giant black light in it?!?!? there are no \"do not disturb\" signs, (we had to make our own), there is no ice machine, you have to go to the front desk and ask for ice!!!! also there are no phonebooks or any info on restraunts or attractions in the rooms you have to go to the desk for a PHONEBOOK. the bed was as hard as a rock and the sheets were crappy. the only people that stay here are teenagers because the staff lets them run around all night drunk and destroy the hotel..my room had all tile floor so when we came back from the beach we got sand all over the floor and then everytime you walked you got sand on your feet and it got all in the bed, the internet went down and they didnt fix it till the next day. so many reasons not to stay here.", "Date": "May 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ohio", "Title": "“Ick”", "Author": "travelguruohio", "ReviewID": "UR7634199", "Content": "I stayed in this hotel for a college event in which our whole school stayed in the hotel. It was by far the biggest let down of the trip. The first and second floors smelled of mildew and by the end of the trip most people were getting sick from it. Housekeeping never changed our sheets once during the whole trip even though I physically went to the front desk to ask. The ceilings in the hallways dripped water. The restaurant ran out of chicken one day- how do you run out of chicken? Either the hotel staff is normally unhelpful or they just did not care because we were college students, but either way is unacceptable. Also, word to the wise: never book anything in the ballroom. The chairs are rusted and stained. The bathroom had live roaches crawling up the walls and the ground had piles of dead roaches. It was by far the grossest thing i have ever seen and I figured it was usually not in use until I saw it was still advertised on the website. Stay away- it's not worth the price- pay more money to go somewhere else where you can actually feel safe, clean, and respected by the staff.", "Date": "May 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Scary...Could not even sleep...will NEVER RETURN”", "Author": "Indy78", "ReviewID": "UR7484497", "Content": "We stayed there one night ...My husband found that mtv had promoted it so we would give it a try. (Keep in mind we have children) We went in though the parking garage and there was water dripping everywhere. Then we entered the lobby....(Think Neon lights and cheap fake marble - Everywhere.) We got to our room, at first it looked okay then I went to the balcony...Broken glass everywhere...Beer Bottles. Then I went back in the room in the bathroom and along the walls dirt...cleaning issues and it looked like it had been a crime scene. So I went to management ...There is a huge sign \"NO REFUNDS\"....Great! So I asked if they had any \"Clean Rooms\" ....They moved us the new room was better than the first but It still was not even okay ...We did not sleep under the covers. The pools looked so scary we thought we might catch something, so we didn't even get in. The outdoor dance platforms are probably great for spring break...The hotel needs to be torn down, rebuild, and don't allow spring breakers WARNING - NOT FOR CHILDREN!!!", "Date": "April 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "toledo,ohio", "Title": "“ok,but could be better!”", "Author": "pddally", "ReviewID": "UR7430342", "Content": "This motel is not as good as it was three years ago. for the money,go to the sunglow resort at db shores(you get a bigger condo for a lot less money),plus you have the pier right outside your door. the wireless in the rooms did not work at all. motel is very pretty and beautiful pool. kitchen unit had very few pans,ect.. if in Daytona,be sure to check out Blue springs state park in orange city;JUST GREAT!!", "Date": "April 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“very nice hotel!”", "Author": "vicki_weston54", "ReviewID": "UR7429265", "Content": "I stayed for 3 nights with my wife and 2 boys. We booked a 1 bedroom suite ocean front and it was more than enough for my small family. The suite was very spacious, included a large bedroom with 2 full beds, and the living room was very up to date with new furniture and a flat screen tv along with a beautiful view of \"the worlds most famous beach\". Most of our time was spent enjoying the pool deck and laying out in the sun with a view of the beach. Relaxing!! The hotel was also very clean and had all of the ammeneties you would expect from an upscale resort. I paid close to $150 a night and it was worth every penny of it. Also the staff from the front desk seemed ready and willing to help at all times. I would love to return.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Atlanta Georgia", "Title": "“Not even close to a 'Resort'”", "Author": "tamainv", "ReviewID": "UR7389366", "Content": "We read the reviews, thought couldn't be that bad. Well, it's pretty dang close. We couldn't find rooms anywhere else so we had to stay there. Spring Break 2007. I had finally had enough and left there and went to Panama City Beach. The second we walked in our room, which was large in comparison to some hotels, we began getting bitten. Come to find out they were \"sand fleas\". I've been to many beaches in FL and NEVER had this problem. Couldn't even stand out on the broken balcony to get away from them. Yes I said broken balcony. The part where the bolt goes into the side for achoring, it was broken. The kids downstairs were smoking so much pot that we didn't spend much time on the balcony. Couldn't go to the beach for the fleas. The hotel was soooo dirty, I wouldn't even think about swimming in the pools. The staff in the hotel restaurant (if you want to call it that) were friendly but the food was horrible. We finally saw someone cleaning the hotel the last day we were there. The hotel staff was nice. The maids only 1/2 cleaned the rooms. Seems they only made the beds. No vacuum, no clean tubs, sinks, toilets, etc. Dresser had a bottom of the drawer missing, took 1.5 days to get another one. We were told it was because they had to wait for another guy to come in so that he could help carry the dresser, ok that was understandable, however turned out only one guy picked up and brought to our room. This place is not worth the low cost. Stay anywhere else in Daytona, if you must go to Daytona. If like us, it was our first visit to Daytona Beach and it will be our last visit. The only arcade in town, seems to know it, games are $5 per game, for the standard $1 game. Other than the beach with the fleas there is nothing for kids to do here. No go carts, no reasonable video arcade, etc. Go to Ft. Myers Beach, Panama City Beach, anywhere but Daytona for kids and teens. No one walks the streets after about 9:30 pm.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Indiana", "Title": "“Bad Hotel,No Security,Hurds of Men beating on doors,Beating people up”", "Author": "Hound6827", "ReviewID": "UR7166173", "Content": "bad hotel filthy hotel no security trash everwhere check in at 3pm no way try 5 pool has garbage in it. roaches in the rooms hotel did nothing we moved do not stay here.", "Date": "March 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Wyoming", "Title": "“Disgusting”", "Author": "Swimfast25", "ReviewID": "UR7147798", "Content": "We were going to stay there during the Daytona 500....when we got there we had booked a suite and well they didn't give us one.....then once we got in the Caesar Palace Suite.....ya right that is no suite....it was just nasty. There was beer bottle caps when you walked up the stairs to the other room they sunk in and everything was just disgusting...So of couse we left as fast as we could to get out of that place called a RESORT....We went about a mile down the road to find a wonderful resort called the Ocean Walk Resort and Spa for the same price as the other one....never stay at the desert inn.....it is a trash hole and thats it....and the pictures on the internet are not recent at all.....EWW. They lie in the pictures cause that hotel doesn't look anything like they show...", "Date": "March 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "minneapolis,minnesota", "Title": "“Pictures are not telling it like it is!”", "Author": "snowballed", "ReviewID": "UR7003000", "Content": "Don't usually write a review, but feel I need to this time. We just got back from Bike Week which was great. I wish I could say the same about this Hotel. Do not let the pictures fool you, they look much better on the internet than they do when you get there. FALSE ADVERTISING Hotel is very old and very musty. If you're expecting anything more than a 2+ star this is not the place for you. I have traveled the past 7 years now and this is by the far the worst hotel I have stayed at. One thing it has going for it, the staff is very friendly. Location is great. Elevators seem like they were not even up to code! Take this and the other bad reviews as a warning!!!!! Chose another Daytona Hotel, there are lots of them!!", "Date": "March 9, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Greenville, SC", "Title": "“Only if you're desperate...”", "Author": "truchopperchick", "ReviewID": "UR6927727", "Content": "We stayed here during the Daytona Spring Rally - mostly because of its great location - on A1A, oceanfront and only 1 mile to Main St. We asked if they had trailer parking - which is a plus. But you have to unhook the trailer and leave it on one side of the parking lot and move your truck to the other side - kinda stupid and very inconvenient. And not everyone followed the rules, either. The hotel is absolutely the tackiest place we've ever stayed! The lobby looks like it was decorated by a group of 12 yr olds on X - very 70's vegas-style and not in a good way. We ordered a simple breakfast for two - $24 for lousy pancakes, $3 for 2 pieces of bacon and it came in a styrofoam box with plastic silverware! Highlight was having a small cockroach drop on to my shoulder while on the can - memorable. The housekeepers were great and very sweet BUT kept coming knocking on the door at 8am even, ignoring the do not disturb card daily. All this for $250 a nite - what a crime, even during bike week. We are so looking at bike trailer with living quarters just so we don't ever have to deal with this again.", "Date": "March 7, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "tampa, florida", "Title": "“complete waste of money”", "Author": "FloridaHotelguest", "ReviewID": "UR6713648", "Content": "\"Resort\" should be the last word to be used in this hotel's description. You will be meet by a lobby chalk full of life size airbrushed sea creatures, mirror clad walls, faux painted marble columns, and brass fixtures. If you are luck enough to get room #735 you will experience multiple light switches and lamps that don’t work (the one that does is for the purple lighting above the beds who's headboard's still show the handcuff scars), base molding falling off the wall, stained and damaged lay-in ceiling tile, hot water that runs brown in the bathroom, paper thin walls with doors that do very little to keep the cigarette smoke from adjoining rooms out, and your choice of heat or air conditioning (but your choice of only one any given night per hotel operating procedure). I am not sure how this hotel received 3 1/2 out of 5 stars because it has been beaten by years of Spring Breakers and this should be considered when booking.", "Date": "January 29, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Hated it ”", "Author": "FHHS1981", "ReviewID": "UR6504608", "Content": "I have to agree with the last reviewer. My vacation was before theirs but I had to write this because it is so true. When we got there, the hotel definately didnt look anything like all of the pictures I have seen on the net and in the post card and brochure advertisements they sent me. We were highly upset with the looks of the lobby and other areas of the hotel. Our room was horrible. It didnt even feel clean. They claimed to have an internet cafe, which they had a small glass enclosed room with no A/C and 6 or so computers. Some of them didnt even have mice. I wouldnt call it a \"cafe\". Some of the computers didnt even work. They claimed to have a movie theater. There was a door and sign that said it was a theater, it was never open during the whole week we stayed there they never said why. The garage is dimly lit and its full of water all the time. Dripping and dingy. Scary too when you are a single mom with 2 sons walking through there. There is no way to get your luggage and luggage cart from the garage without lugging it around yourself from one cart up steps to the other cart. There is no way to get the carts down the stairs in the lobby to the front doors/entry way either. The pool was dirty, the pool deck was not nice. I didnt find anything at all that I liked about the hotel. Our room carpet never felt vacuumed. It was sandy. Ok, it was at the beach but on the 9th floor. The elevators are scary and dirty. They move slowly. I would definately not recommend this hotel (resort... ha ha) to anyone. We had a \"city view\" room because I couldnt afford much. Well you definately get what you pay for. I thought from the brochures and the pictures I found that it was a great place. NOT! Do not stay here for even a night. Its not worth it at all. It is a horrible place to stay. I do not see why its still open. I see that they have supposedly done some \"more\" renovations. They supposedly renovated before we got there. Dont believe what they say, you have to see it for yourself to believe its nasty.", "Date": "December 27, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tallahassee", "Title": "“Awful Experience”", "Author": "lauralaw", "ReviewID": "UR6479079", "Content": "We arrived at the Desert Inn about 10:00 on Friday night to check in for the weekend of my daughter's state gymnastics meet. Upon arriving we noticed the hotel was nothing like the pictures posted on Hotels.com. When we walked into the lobby music was blaring and the hotel smelled like cigaret smoke. We went ahead and checked in to give the hotel a chance that the rooms might be better than the lobby area. We checked in and were told to park in the parking garage. We entered the poorly lighted parking garage which was wet and water was dripping from the ceilings. Unloaded our luggage and walked to the elevators through the back part of the lobby...which was also dripping water and paint was peeling off the walls everywhere. Took the elevator to our floor and when we got to our room it was not the room we thought we were getting from looking at all the wonderful photos. Photos posted online are not what this hotel looks like. These same photos are posted at the front desk of this hotel. We immediately took our luggage back down to our vehicle and check out. I have never complained about a hotel throught Hotels.com but this was AWFUL. This hotel should be taken off your web site or atleast true photos should be posted.", "Date": "December 21, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Daytona Beach", "Title": "“Had a great time”", "Author": "blkbchbumm", "ReviewID": "UR5821830", "Content": "Stayed there for a cpl of days, rooms were clean...had a jacuzzi suite which was VERY nice. And the ocean front view was extremely nice. The hotel IS older though...been through a few renovations over the years(you can tell), but the improvements were positive. And I would/will stay there again.", "Date": "September 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scottsville, Virginia", "Title": "“Not all that bad!”", "Author": "Joustingbanton", "ReviewID": "UR5596307", "Content": "I had read all of the reviews about this hotel on trip advisor. I only found out about the reviews through another hotel that I had not booked my vacation with. I went into the lobby thinking about the reviews and was quite nervous while checking in. Yes, the lobby was just as described, very nice. Our room was not ready by 3:00, but we endured the delay. The cleaning staff was wonderful during our entire stay. One should consider that most of the hotels on Daytona Beach are older, except for the time shares and places that have been torn down to make room for the new condo units. Our room was clean with everything as booked. We had the two bedroom suite with kitchen. There was a slight problem with the drains in the tubs, but I was able to patch them up so that they drained during our stay. Our cleaning person offered to have maintenance come and repair, but I had it remedied for the time we were there. Everyday I saw cleaning staff and maintenence people working. We did have a lot of road noice, but then our room did have two balconies overlooking the street as well as one that overlooked the ocean. Again, the older places don't have the soundproofing that the newer resorts have. The hotel had a DJ that came in every day to the pool at 12:00, doing fun things there with the kids and adults alike. We could hear the music on the beach, which we really enjoyed. The bar at the pool was quite nice as well. I was told by another guest that we could just take our cooler to the front desk and get it filled with ice rather than just getting a small bag. I never had a problem getting ice at any point during our stay. We were close enough to the Boardwalk to see the nightly fireworks. I went into this hotel with all the bad stuff in mind. I had checked with one person who put a good review on and this place is like she said....if you are used to staying at a 5 star hotel, it is not the place for you. If you are not a particularly picky person, you will have a comfortable stay. My complaint would be with the guests who come there to stay who throw trash down and don't pick up after themselves. Yes, we are on vacation, but I am sure that we all were taught right from wrong. Again, it is an older hotel, but if you keep this in mind and go to have a good time, you will. This place was cheaper than the resorts right at the Boardwalk, so also bear this in mind. It is as the saying goes, you get what you pay for. If you want first class, then go up to the Hilton and pay $300 per night, but for what we paid, we were quite pleased with what we got.", "Date": "August 10, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Calabash", "Title": "“this is the place we will stay next year”", "Author": "calabash-nc", "ReviewID": "UR5502676", "Content": "I almost didnt stay here after reading the reviews on the Desert Inn, after we arrived I was so glad we had not changed our reservations, with the DJ, pool bar-resturant, we had everything we needed right there and never had to leave in our cars. The kids and adults had a blast and we will never stay anywhere else again!", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Not exactly paradise!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5439886", "Content": "My family and I spent 7 nights here during race week. The check-in process went very smoothly and the lobby seemed to be fairly nice. The elevator ride to our floor wasn't as pleasant, it smelled like a wet dog! As the doors opened, we were gasping for air only to be consumed by the damp musky odor of the hallway leading to our room. We had reserved a one bedroom suite with an ocean view. The room was a hole in the wall. The floors were dirty, the beds were hard and damp, the sofa bed was nothing more than linens stretched over some springs, and the kitchen area and appliances were not appealing at all. We spent 7 nights in this place and recieved no maid service what so ever!!!!! We had to call the front desk and request clean linens and change them ourselves. The accomidations here were a nightmare! On the up side, the pool deck was very nice. The DJ was very entertaining and the staff at the poolside bar and grill were very pleasant. We did notice some rooms with their doors open that appeared to be pretty nice, but beware that some are not!!!! Overall, we had a great vacation thanks to the wonderful pool area, getting to see the space shuttle launch from the beach and a GREAT RACE!", "Date": "July 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“don't believe every thing you read”", "Author": "A TripAdvisor Member", "ReviewID": "UR5429972", "Content": "my family stayed there the wk. of june 3rd. we had a great time. the room was clean, no bugs. the help there was very nice. the pool was great. we are going back next year.", "Date": "July 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“AWFUL!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5417560", "Content": "My friends and I started our trip to Daytona Beach thinking we were going to be staying in a nice hotel. Instead upon arrival, I was charged almost $200.00 more than the total I was given over the phone. We checked in to our room thinking we were still getting a good deal on a two bedroom suite with jaquizzi, full kitchen,and balcony view of the beach. However, we arrived in our first room we were given, my first opinion was \"oh my God!\" The room only held 4 occupants and was supposed to be able to sleep eight. The sliding glass door didn't open. Well, I take that back, It was already open by two inches. Then I discovered it didn't close any more or open anymore. The so called full kitchen was barely even big enough for one person to even turn around in. The jaquizzi, there wasn't one. I went to the front desk and asked them what was going on, b/c this is not the room i asked for. The gentleman at the front desk gave me several keys,and told my friends and I to pick the one we wanted. The first room we checked looked as if there was a party in it just hours before us. There was a full salad in the floor under the kitchen table, and the sheets were still off the bed. Anyways, we checked several more rooms,and they all looked just as bad if not worse. I went to the front desk this time with two of my friends that were with me. I was furious! They finally gave me the room I reserved, after trying to argue with me it wasn't. However, I had everything they had mailed me about my room and showed the girl at the desk. She gave us a key to this new room. We were still trying to keep our spirits up and we were all excited running to the room. When we opened the door, the room did look nice. Then it went to Hell, pardon my french. The bath room was dirty from head to floor. The jaquizzi, my friends cleaned, so i wouldn't get any more mad and go back to the desk. We walked out on the balcony, and the floor was risen every where. If you didn't take every step with caution, you would trip and kill yourself. We didn't say anything for a few hours, and we just went on to the beach trying to ignore everything that happened. We returned to the room later that night to go to sleep. Keeping this in mind that we ALL were at the beach, when we tried to go to sleep that night, we moved one of the chairs to pull out the sleeper sofa, which was too big for the room. We had to rearrange the whole room to get it out. We found a USED CONDOM! I was so upset. I ran to the desk to address the problem with the man who was there, and I would appreciate if some one would come get it. He told me to get a tissue and pick it up myself, and that we were just complaining over stupid stuff. I am sorry, but I would not even put my dog in that room. Another young gentleman did eventually come and remove the condom, and I told him to tell his manager I would be down first thing in the morning to discuss this matter. She brushed it off like it wasn't no problem. After nearly 15min. of fussing with her, she gave us our last room for the stay. We go inside, yes it was nicer than the rest, but still not up to health code. Once we started getting our clothes, food, and etc. in place, bugs started coming out everywhere. They were crawling, flying,and some even seemed to be attacking us. These are just the room problems we had. Well, and the problems we had with their rude staff. The maid came to our room and started offering drugs to some of the girls staying with us. WHAT! Then she proceeded to tell us that she even sold it out of her room at the hotel. They said that there was a basketball court and gym. If there was no one could find them. The basketball court was no where to be found, and the gym was never open. They say they have a DJ. He must have been invisble, too. This hotel is falsely advertised, the staff is probably the rudest I have ever encountered, and the rooms are disgusting! I would not recommmed this hotel to anyone, not even my worst enemy! Please think twice before booking a room here. They will lie to you, and you will be just as mad as I was once you see it in person. Again, Please don't stay here, for your own health!!!!!!", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Lawndale, NC", "Title": "“Not the Hilton, but bang for the bucks!”", "Author": "td4095", "ReviewID": "UR5391742", "Content": "We stayed at this hotel with our entire baseball team the week of 6/20/06. If you are looking for a five star hotel or are expecting the hilton, then this is not the place for you. Otherwise, if you can overlook the normal wear and tear of an older establishment, then this is a great place to stay. We had read some of the reviews from others before we got there and were very skiddish about staying there, I even packed my own sheets....But I will tell you that I have stayed in worse. It could have been a little cleaner, but over all our stay was a pleasant one. The staff was extremely courteous and helpful, the food in the grill was great and the pool side DJ's were a lot of fun. They do have rules to obey and don't expect a refund if you don't like it....and it clearly states that at the front desk. I thought someone had stolen my $500 camera, and was very upset...I left my name and everything with the front desk, and the day after we returned I received a phone call that I had left it in the room. They are sending it to me certified mail. To me that shows CLASS!l", "Date": "June 26, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“staying on the streets is better than that place”", "Author": "A TripAdvisor Member", "ReviewID": "UR5375777", "Content": "I did not stay at the desert inn, but I went there to check it out after some friends of mine who were staying there said it was horrible. As soon as we walked in the door we could smell an overpowering stench of who knows what. There were people exposing themselves in the hallways, trash all over the place, things falling off walls...it just wasnt pleasent to look at. When we got to the room we saw that almost everything was broken, the bathroom was very dirty, there were stains on everything on the bed. There was also water dripping down the wall. I was horrified that people actually stayed in this place....and it wasnt only that room. The whole group had 5 rooms and all the rooms were similar to that. To top everything off and make it worse, one of my friends ended up cutting himself on broken glass and had to get stiches and a tetnus shot. The hotel took no responisbility for what had happened and one employee even said that the hotel was not responsible for cleaning up every bottle that someone breaks. Ive read all the reviews good and bad and trust me.....this is not a place you ever want to stay. If you dont believe what people have written just look at the candid pics.....and they arent even as bad as some of the stuff i witnessed there.....the street would have been a cleaner and safer place to stay.", "Date": "June 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Disappointed”", "Author": "A TripAdvisor Member", "ReviewID": "UR5374341", "Content": "The week of August 14-19, 2005, my family (7 people) rented a suite from your hotel. Upon check-in, we were given a room that was dirty, we went back to the lobby to get another room and upon entering this one, it was dirty. We went back to the lobby, the hotel had charged my credit card (1) night stay when making reservations, so I asked them to give us somehing clean and we would leave the next morning, Well the front desk then gave us room 317 which was better with plenty of room so we decided to stay. During the week the hall was always dirty, the inside pool stayed dirty, the bar was closed by the POLICE, you could smell sonthing besides cigaretts in the hall and the water pipe broke on the floor above us which ran into the other two rooms they showed us. On the last night our A/C broke and we had to move everything into another room. I was very disappointed because I paid my money to them to enjoy my vacation, not worry about my familys health just from staying at the hotel. I called and e-mailed them about my disappointment, with no answer.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“and we call it the dirty inn”", "Author": "A TripAdvisor Member", "ReviewID": "UR5192854", "Content": "ok me and 8 friends stayed there spring break! well when we first arrived it was really old looking! we go in check in and the people are rude, there are kids running around in dippers, there's dirt every where. well we have to go down a hallway to get to our room and in the middle its open just like a big slab of concrete. and it was nasty! it had water on it and smelled so bad, there was trash and beer bottles everywhere. we finally get in our room, it was sick!! i would not even unpack my bad or anything!!! there was so much dust and hair on the baseboards, our lamp was broke the sliding glass door out to the pool was cracked, and the air was a window unit that was not all the way in if you looked you could see the pool threw the HUGE hole!!! i mean its a fine place to stay if you just want some where to keep your cloths but if your planning on being in your room DONT STAY THERE ITS SICK!!! thats why we call it the dirty inn!!!", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Hayesville,N.C.", "Title": "“Had a Great Time -Will Be Back”", "Author": "klovestoshop", "ReviewID": "UR5192671", "Content": "My family and I stayed at the Desert Inn last June 2005,we have stayed there alot and really enjoy our stay each and every time we stay.We plan on going back this June and can't wait to get there.You want meet any nicer staff,they are always so helpful.See you in June!", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“it was spring beak but give me a break”", "Author": "A TripAdvisor Member", "ReviewID": "UR5035567", "Content": "PLEASE READ ALL OF THIS !!!! My friends and I drove 13 hrs. from mississippi to have a good party week in daytona for a change. We usually do panama but we figured mix it up and we seriously regretted that decision. We walked into the lobby which by the way smelled like urine and looked like something straight out of the 60's no renovation had obviously ever been done despite what the website says. We made our way to the front desk only to find out that they had booked the wrong room for us. We had conformation numbers that said what room we were supposed to get but they didnt care. We were stuck so eventually we just payed a lot of extra money to stay. The first night there was in event i will never for get first of all in the elevator (that smelled like urine) the head security guard hit on my 20 year old girlfriend he was probably 45-50. Later on that night we went to sleep ealry only to wake up with that security guard standing over my bed telling me and my girlfrined to wake up. I had no idea what was going on. They had broke into our room accusing us of throwing something. I insisted that they get out of the room but they would not. One of my other friends was asleep in the other bed he would not wake up so they started hitting him with their flash light to wake him up. The rest of the week was the same a hallway and elevator that smelt like urine and fesise and a horrible staff. the last night we were in for one more adventure. We had all gone out to eat and when we got back a friend of mine was bit by a rottwhieler in the lobby of the hotel!!!! The same security guard was standing by the front door and had just let the dog by. So don't be like me and ignore the warnings they are all true just please please please reconsider your plans to stay at the desert inn resort.", "Date": "May 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Glad I didn't spend a week here!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4993254", "Content": "Stayed 4/12/06. While passing by Daytona Beach on the way to Clearwater beach, my wife, 3 kids and I decided to stop for the night after driving all day. Our night went like this..... The desk clerk told me our room would be a suite with a separate bedroom, fridge and microwave. The price sounded good for all that. I gave the clerk my Visa and went out to park the car in the ramp. I ran over a pile of broken glass in the ramp (luckily I didn't get a flat). I parked the van and stepped out into some slimey goop that seemed to cover the entire paking surface. The place smelled like vomit. I figured it wasn't cleaned up from spring break yet. We headed into the hotel through the ramp enterence passing a flooded game room with busted up ping pong tables. What a mess. There was another room with computers for internetnet access. This room looked equally devistated with broken chairs and debris all over. I stilll gave the benefit of the doubt telling my wife that spring break was over a couple of weeks ago. They should have, however, got rid of the busted up stuff and straightened up a bit. We passed through the lobby and got on an elevator (which smelled as bad as the parking ramp) and headed up to the 6th floor to our room. We got to the room which was not a suite as the clerk described. They were nice enought to leave us an extra fold out bed so there would be room for the five of us. I was tired from a day of driving. I didn't want to be hassled with trying to get another room. We grabbed a bite to eat and went to bed. The room was warm and humid, so I turned on the AC. The AC made a looud banging noise. The kids couldn't sleep with it. I shut it off anf opened the balcony door. The street noise below was just as bad. We got throught the night and got out of there early. I mentioned to the clerk about the room that we had as opposed to the suite that the clerk that checked us in told me we had. She just shrugged it off and didn't offer any explanation. I just wanted to get back on the road. If ever passing through Daytona and your looking for a place to stop and see the Desert Inn sign.....do yourself and your family a favor and try the next hotel.", "Date": "April 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Glen Rose, Texas", "Title": "“Dirty!”", "Author": "fun2go", "ReviewID": "UR4896442", "Content": "We stayed here in June of '04 and it was really bad. Dirty floors in public areas, unaccomadating staff, broken air conditioner, elevator that sometimes didn't work, moldy-mildew smell, parking garage that collects rain water to the point of almost flooding. Staff said they would get us a fan and never did. Overrun with a teenage 'camp'. The carpet and couch in our room had sand ground-in and looked like they had't been cleaned in a long time. We went with a group and some of our party refused to stay there after one look! They make you pay in advance and have a strict 'No Refunds' policy. Website and internet pictures make it look better than it is. The large, outdoor pool (although with sand in the bottom) and beachfront were the best part of this property. Inside was bad!! Stay someplace else!!", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Beach Lovers Dream”", "Author": "A TripAdvisor Member", "ReviewID": "UR4737728", "Content": "The Desert Inn at Daytona Beach is a beach lovers dream. We have been guests at this hotel for years. We have never had a bad experience. The hotel is clean and the rooms have been refurbished since we started coming here. It has a lot of nice improvements. The bedspread, the linen and towels were new on this visit. The mattresses are typical of nice hotels. The staff has always been accommodating. The pool area was clean and large and we also had access to a private area to layout and overlook the beach and Atlantic Ocean. This hotel is directly on the ocean, most of the rooms have nice views of the water -- ask for a room on the Ocean. The walkway to the beach is convenient and well maintained. The beach is wide and welcoming and early morning beach walks are a must (or any time). The hotel is well maintained, and has plenty of amenities. The restaurant, (The Grill?) has a friendly atmosphere and the menu has some very good choices if you’re not going out to eat. I found the staff to be friendly and ready to be of service. We usually have breakfast here and sit on their patio while reading the newspaper. What a way to start your day! Many nights we dine in a small town south of Daytona called Ponce Inlet. One of the places we enjoy is Inlet Harbor. They have good food and live music on a deck looking over the Halifax River.", "Date": "March 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Daytona", "Title": "“Race Week Savings”", "Author": "peacelove", "ReviewID": "UR4727957", "Content": "During Race Week this year, my family spent 3 nights in the Desert Inn's 2 bedroom suite. This was our first stay there. It is not a \"fancy\" hotel but was perfect for five people (three adults with two small children). The suite is more like an apartment and has two good sized clean bedrooms. I couldn’t believe we also had two full bathrooms! The large living room also had two sofas and two chairs. The suite also has a full kitchen. The cost of the suite was far less than two separate rooms would have been and if we found two rooms at another hotel for what we paid for the suite, I am sure that they would not be nearly as nice. As busy as this hotel was for Race Week, we didn’t have hallway noise to contend with. We had to move to another hotel later in the week much farther away because this hotel was booked for the Daytona 500. My mother-in-law came on this vacation with us so we could go to the races and leave her with our 2 little ones. What was important to them was the indoor pool, (weather in Feb. here is iffy), the restaurant, and game room. My MIL said she met very nice people who also came because some family members were Race Fanatics. We felt more like we were living like locals than staying at a hotel. Desk staff could not have been nicer or more helpful especially when my son cut has finger and needed a bandaid. Altogether, the Desert Inn is a fine choice. We already booked this suite for Race Week next year so we can be sure to have it for the full time. And luckily, my mother-in-law has agreed to come with us again!", "Date": "March 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Spring Break Hell”", "Author": "A TripAdvisor Member", "ReviewID": "UR4725020", "Content": "For Spring Break, me and 4 other girls decided to venture to somewhere new for Spring Break. My friend found the Desert Inn on a great website and we all checked out the pictures and thought it looked great! We checked in and the lobby is just beautiful, so we were getting excited! We got our room up on the 7th floor, and as soon as the elevator opened to that floor, we were overwhelmed with the smell of vomit and urine. I have never been so disgusted in my life! And to make matters worse, in the corner we saw the culprit-- some fresh vomit that must have been from the night before! :( We were just praying our room would be nice, and it was decent, besides there being a dead bug in the corner and some kind of black stuff on the bottom of the bathtub (flip flops always worn in shower!!!) The parties that go on during the day are great for the true spring breaker, so we had no problems with that. On the 2nd to last night of our stay, my friend and I were trying to sleep when a guy busted through our \"room connector\" door near the patio. This door doesn't even have a door knob on it, so it was clear that the guy picked the lock. He started to go through my suitcase until we both screamed at him and called security... IT TOOK SECURITY 40 MINUTES TO COME TO OUR ROOM. Us girls have never been so scared in our lives, we all told the front desk that we will never stay at this hell hole ever again and we will tell everyone about our horrible stay, and guess what the manager said? \"Sorry girls that your generation is like that, hah!\" Take our Advice, There are plenty of nice places on the beach to stay, do not make this your vacation spot -- YOU WILL BE SORRY!:(", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Hotel From Hell”", "Author": "A TripAdvisor Member", "ReviewID": "UR4691031", "Content": "Let's just say, the Desert Inn ruined my spring break! I strongly believe a bomb went off in this so-called \"resort\" because it is the biggest dump I have ever seen in my life and I couldn't stay there for more than a day. The only reason the Desert Inn is considered a resort is because the scum that stays their lives on the streets. The rooms were inhumane for a normal person to sleep in because the toilet in my FIRST room didn't even flush. When I had asked for my money back they said \"no refunds\" so they placed me in a second room that smelled like somebody took a dump and ---- on my pillow. Not to mention my shower contained the previous tendants hair balls. The maintenance their is g-d atrocious. I actually saw a house keeper ash their cigarette on the floor of the lobby in front of me and when I asked another employee where the car garage was they replied \"I don't know\" and walked away. As you can see I DO NOT recommend this ---- hotel for any normal person unless you want to hang yourself off the top floor balcony which would probably collapse before you committed a worth while suicide!", "Date": "March 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Bike Week '06”", "Author": "A TripAdvisor Member", "ReviewID": "UR4594376", "Content": "We came up from Ft. Lauderdale to stay for the weekend and enjoyed the bike week festivites, this hotel was so close to the entertainment. I would stay here again. The hotel for being on the old side has a great charm about it. Not like to cookie cutter hotels the rooms were large and an added jaccuzi was a plus. The outdoor pool was huge and never felt crowded. The bar was fun with large screen TV's. All the staff were very helpful on planning our day, always a bright hello from the front desk as busy as they were. I give this hotel three thumbs up. The other bad reviews do not do this hotel justice. It is a clean hotel with alot of charm.", "Date": "March 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Bike Week Fun”", "Author": "A TripAdvisor Member", "ReviewID": "UR4594221", "Content": "We were impress of how close this hotel is to the center of all the bike week activities. The jaccuzi room, huge pool, large lounge, and great beach views. This hotel is old but taken care of. I liked that there is a big area to wash and dry clothes, and free access to the internet and wi-fi available all free. The staff are very friendly and ready to give help and directions. Will gladly stay here again.", "Date": "March 8, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Race Week 2006”", "Author": "A TripAdvisor Member", "ReviewID": "UR4559379", "Content": "Hey guys! I was here for this past week for the Daytona 500. Needless to say I and the family had a great time. We stayed at the Desert Inn Resort in downtown Daytona Beach. It is conviently located near the board walk and all the main attractions. We had an ocean front suite with spacious room and an amazing view. Every morning we would get up to watch the sun. It was simply fabulous. The room was clean and smelled great. The resort had a full restaurant and bar with huge T.V to watch all the great sports. It was a great atmosphere.", "Date": "February 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Race week fun”", "Author": "A TripAdvisor Member", "ReviewID": "UR4478817", "Content": "This was my third race week in Daytona. This is an 40+ year old hotel and the management has done alot of work enhancing the look. My friends enjoyed all the extra space to put there race gear. It has a large balcony and the view of the ocean. The lounge is on premise so we didn't have to travel for our drinking adventures. We met alot of other friendly race fans. The indoor heated pool was great on the rainout day of the races. Also the other outdoor pool is a large olympic size pool, rare these days. I will return.", "Date": "February 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Never would stay there again...”", "Author": "A TripAdvisor Member", "ReviewID": "UR4478780", "Content": "I wouldn't advise anyone to stay at this so-called resort. They are very deceiving because the pictures on their website look absolutely nothing like the room that we got. We paid $225 a night (five night minimum)for ceiling tiles about falling down from the ceiling, a carpet that looked like it had NEVER been vaccuumed. There were Cheezits and a hair scrunchie in the floor when we walked in the door. The sliding glass door handle was broken and there was no way that you could lock it. We told them we were checking out and they said we couldn't get our money back and that they would put us in a different room. This one was a little better but still NOTHING like what is advertised. I pity the person that just walks off the street, because their lobby is beautiful and people have NO IDEA that the rooms are crappy.... I give this dump, two thumbs down!", "Date": "February 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“White Trash”", "Author": "A TripAdvisor Member", "ReviewID": "UR4468539", "Content": "Last spring me and nine of my friends stayed at the Desert Inn for eight nights and nine days. My initial reason for choosing this hotel was because of the price. Dirt cheap! I should have guessed it would be a dump. To make a long story short the place was nasty! There were ants in both our rooms, throw up in the elevator, \"night security\" were opening vacant rooms and doing drugs inside them or taking underage girls inside. There is trash all over the beach and everything is covered with mold.Saying this hotel is old is an understatement, this hotel is ancient! Also, on the last night of our stay my boyfriends car was broken into by staff members of the hotel(all are punk boys). When asked to see the video cameras they would not let us. We ended up leaving the hotel at eight in the morning with glass all inside the car. I was only eightteen at the time and I was in Daytona to party but in those conditions it was impossible. Who ever believes this hotel is \"nice\" or \"clean\" I can only imagine what your upbringing was like, because this hootel is the bottom of the barrel.I would never reconmend this to anyone for health reasons and many more.. Save yourself from the disaster,even a motel would be better!", "Date": "February 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Nice Place to Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4457750", "Content": "This was our second year at the Desert Inn. Even though the hotel is old, management is constantly striving to make improvements. There are many \"snowbirds\" who stay at the hotel during the months of December, January and part of February. The hotel manager, front desk staff, housekeeping, and maintenance personnel are very customer friendly and responsive to any request or need. We especially enjoy the indoor heated pool and the beautiful view we have from our oceanfront suite. Our rooms are clean and comfortable. We would like other snowbirds to know that they would be welcomed by the staff and treated with the utmost respect and care. Come join us for fun and relaxation.", "Date": "February 13, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Dirty , rat hole, dump, filthy, rip off”", "Author": "A TripAdvisor Member", "ReviewID": "UR4398147", "Content": "We Were SUPPOSE TO HAVE A GREAT WEEK AT A CLEAN PLACE. WRONG!!!!!!!!! Broken Beer Bottles ALL OVER, ANTS in our BED, VERY LARGE COCKAROACHES in BED and All Over Floor, SUNFLOWER Shells all over, MOLD all Over BATHROOM,Place was FLOODED . CERMIC floor WAS BROKEN all up and pieces all over, out on the deck the wood was rotten and Felt Like it was going to fall in. Called housekeeping 4 TIMES when we got there to clean .Called the front desk several times they actd like they didn't care. We LEFT and Went to Tropical Winds,right down the street very clean. Don't waste your money here cause you probably would not let your dog sleep here.BAD, BAD, BAD", "Date": "January 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Loved the Place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4328271", "Content": "Could not have had a better time elsewhere. The hotel is so near to all the nightlife and tourist center, so convenient. The staff go out of there way to help you find anything you need. I wil stay here again, in the near future.", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“We had a Merry Chistmas at the Desert Inn”", "Author": "A TripAdvisor Member", "ReviewID": "UR4312087", "Content": "Just returned from my 5 night stay at the Desert Inn, and I could not be happier with the hotel. It was my first time in Daytona, so I searched the net for hotels along the beach. I found the Desert Inn at a very affordable price (especially over the holidays). When I arrived it was more than I expected. The lobby is beautiful! I had a two bedroom suite reserved that over looked both the city and the beach. MY room was very spacious with enough room to accomodate My entire family of eight. I was very pleased with the room, the staff, and all of the ammenities (especially the heated pool in December). The location is great, close to most of the Daytona Beach attractions. Upon checkout, my Daughter convinced me to stay one more night. The kids really loved the place. It had plenty for the entire family to enjoy! My overall stay at the desert Inn was magnificent! I definetly recommend the Desert Inn for everyone!", "Date": "December 30, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "ERIE, PA", "Title": "“Dirty, Dirty”", "Author": "JULIE91494", "ReviewID": "UR4165221", "Content": "We just returned from a week in Dayton. We were suppose to stay 8 nights in the Desert Inn. We moved after the second night. The Hotel was dirty. There was broken beer bottles on the pool deck. There was vomit on the private deck below our room. On the third day, we saw a live cockroach in the main floor hall and dead bugs on the indoor pool deck. Both pools looked like they had not been cleaned in months. They also charged us extra for leaving early. We will never stay there again.", "Date": "December 6, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Dump”", "Author": "A TripAdvisor Member", "ReviewID": "UR3925514", "Content": "Don't be fooled by the excellent reviews. If you are going to stay here, read the negative reviews and ask yourself if you can stay in these conditions. I have read every negative review and they are all true! We stayed at this hotel before we went to Disney. What a mistake! Our room was musky and moldy. Carpet was sticky. Smells of garbage and something dead in the parking deck. Bad smells in halls and elevator. Condoms on the other side of the bed (my thirteen yo daughter found it!!). Our kids were scared to go to sleep because we had an infestation of moths not to mention the screams from partying teens. And the staff did not seem to care. Not sure how they can work there under those conditions but I could not stay another night and left the next morning. Don't be fooled. This website is here for a reason.", "Date": "September 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "bedford, indiana", "Title": "“Lots of fun!!!”", "Author": "missusP", "ReviewID": "UR3842301", "Content": "The view was beautiful! The staff was extremely pleasant and accomidating. The indoor pool came in very useful since it happened to be raining. The location was great and the value was more than fair. The fitness center was more than adequate and the internet cafe was a nice touch. Can't wait to return!", "Date": "September 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“TripAdvisor Member”", "Author": "A TripAdvisor Member", "ReviewID": "UR3840086", "Content": "My family and my brother's family shared a family suite with an adjoining kitchen. We had 2 toddlers, an 8 and a 10 year old. We had a wonderful time. The rooms were cleaned everyday. The staff was nice. The kids loved the pool with the DJ and the children's activities. The wading pool was the perfect height for our toddlers. We ate in the outdoor restaurant almost daily and the service was excellent. We walked to other nearby restaurants and to Daytona's new water park, Daytona Lagoon. I would recommend this hotel for families in July. We had a great time. We even extended our vacation one day because we didn't want to leave. We ended up staying 9 days and 8 nights. The other poor reviews must have been around spring break where I imagine the hotel is not family friendly.", "Date": "September 3, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Family Reunion”", "Author": "A TripAdvisor Member", "ReviewID": "UR3839967", "Content": "Had my family reunion at the Desert Inn in July, 2005. The hotel was great! The maids gave us coupons for area atrractions that we could take the children to and kept the place spotless. The staff were all nice and took care of us like we were their family. I will recommend this hotel to all my friends. My family came from Ohio, Indiana and Florida. We will continue to meet here for years to come.", "Date": "September 3, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“dump”", "Author": "A TripAdvisor Member", "ReviewID": "UR3755259", "Content": "this was without a doubt the worst motel i have ever seen. we stayed only becuse we could not get our $250.00 deposit back. it was nasty and our reservations stated a 2 bedroom suite which we did not get. air didnt work ,commode didnt work. the grounds looked like crap. there were used condoms on the deck. i just read some other reviews that were favorable, all i got to say to those who said that there rooms were clean and the hotel great, i would hate to see what you live in.", "Date": "August 11, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "orlando, Florida", "Title": "“Horrible ...Don't stay there!!!!”", "Author": "floridaglo", "ReviewID": "UR3743018", "Content": "My husband planned a surprise get-a-way for our 19th anniversary and what a surprise we both got at this DUMP!!! He called several places in the Daytona Beach area and the lady he talked to at this DUMP told him how beautiful this DUMP was. She told him they recently did major renovations.She bragged about how clean the grounds and rooms were. So he bought all the bs and reserved a room with a jaccuzi and an ocean view.. Wellllll I wasnt happy when I walked into the lobby but, not wanting to spoil his surprise I thought well maybe the rooms are better. First of all when you walk in the lobby they have a million different colors and *stuff* going on. The elevator to our room smelled horrible..Getting out of the elevator there was a new smell..Not sure what it was but, it was bad..We opened the door to the room and there was a ladder with tools blocking the doorway..Ok they sent us to the wrong room..Back down that horrible elevator to the lobby and they said OH..thats the one that has the broken air conditioner..I will do you one better so now we go through their dinning room..UCK!! to a ground floor suite..HA HA HA..We walked in and walked out!! Back to the front desk...We asked for something on a higher floor so atleast we could see the ocean..We should have left right then..but, we thought we would give it one more try..So in that nasty elevator once again to the third room..Once again it was horrible..dirty...all kinds of different furniture that didnt match..4 different kinds of tile..Well by this time we were tired and said ok..we are only going to be here one night lets make it work. Although it did have a view of the ocean and the jacuzzi..First the air did not work..You could get only one channel on the tv..The coffee maker did not work and it took 30 minutes for the jacuzzi to fill up..We called down for the tv and they said someone would be right up..Well 45 minutes later no show..So we called and said forget it and went out to eat..thinking that the room would be cool when we got back...NOT!!! by this time it was 10pm and all we wanted to do is sleep..After thirty minutes of tossing and turning my husband went out and got a fan...I was just about ready to sleep in the jacuzzi!!! When we checked out at 8am..my husband told the desk clerk of all the problems..He kept coming up with all kinds of excuses..Oh..when my husband was leaving to get the fan there was a ambulance out front loading a badly beaten man into it..seems there was a fight in their bar and the man who beat the other one up was running from the cops..WHAT A NIGHTMARE..NEVER..NEVER AGAIN WILL WE EVEN GO NEAR THAT DUMP...The staff was not helpful in any way..The guy said we have fans here you should have called..Sounds like they have this problem with the air often to have a supply of fans available..Save your money and go some where else..THIS TRULY IS THE WORST HOTEL WE HAVE EVER STAYED AT AND WE SHOULD HAVE LEFT RIGHT AWAY..OUR FAULT FOR NOT!!!", "Date": "August 7, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“never again”", "Author": "A TripAdvisor Member", "ReviewID": "UR3735466", "Content": "We made reservations at this establishment 3 months in advance,one request that we had was a room not above 5th floor. When we arrive they put us in a room on the 7th floor. We decide okay we'll deal with it it's vacation let's just have agood time. When we open the door to our room it's about 90 degrees. So they call maintence to come fix the airconditioning. Maintence works on it and says that's the best it gets. So they put us in aroom on the 6th floor the air is some better not good but better,by the 3rd day we dont have air again,so they come work on it and and it seems to be a little cooler, but water is pouring from the ceiling ,I ask for a bucket at the front desk all they give me is a trash can, So the rest of our vacation we had to keep it emptied. Need to say dealing with this the staff was rude. I guess because we were guests for the week I personally asked housekeeping to change the sheets or give them to me and I would change the beds because my son had gotten sand in his bed. need to say by the 5th day I couldn't locate a set of sheets or get any one else to either. I will never stay at the Dessert Inn again.", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“never ever again”", "Author": "A TripAdvisor Member", "ReviewID": "UR3728890", "Content": "I have been going to Daytona my whole life and never have I seen any place like this. I have never stayed here before. We always stay down in the shore at the Acapulco hotel. Because it was closed, we decided to try and stay up by the boardwalk. We looked at the website for this place. The website makes this place look good; don't buy that for a second, this place is a true dump. I read how some people said how nice it is and I just wonder if they stayed at the same place I did. We stayed here for two weeks for the 4th and the 400. This place was not cleaned the whole 2 weeks we stayed. They did not vacuum the stairs in the lobby once and the only place they cleaned at pool was from door to the stairs to the beach and that was not to good of a job. We stayed on the 7th floor which is the top floor. One of the days it rained really hard for awhile. The next thing we knew, the ceiling was leaking over our bed. I called the front desk and was told one thing after another but could not get anyone to look at it. Finally, they said they would find us a room to sleep in. On the 4, they had a party on the pool deck which turn into a joke instead of something good. When all the kids from the beach were just let to come up. All they were doing was drinking jumping into the pool on the guest while the DJ's promoted this. By this time my wife and I had enough. We went to the front desk to complain. Tthey looked at us like thet were stupid, until I said okay I'll just call the police. All of the sudden they were kicking the kids out. This place is dirty, the pool deck is dirty, the rooms are dirty, the hallways are dirty. I have no reason to post this here if it was not true. So anybody can read this and make choices but I could never reccommend this place. It is a true dump.", "Date": "August 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Awesome”", "Author": "A TripAdvisor Member", "ReviewID": "UR3711476", "Content": "My family and I thought that this hotel was amazing..We are comming here for all of our vacations from now on.", "Date": "July 28, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“nice place to stay for us”", "Author": "A TripAdvisor Member", "ReviewID": "UR3708253", "Content": "Our family stayed here for 12 nights. Before going I found this web site and was sick.... I was ready to pack all of my cleaning supplies and take them with me. I was ready to buy new bed sheets and everything..... But when we arrived we found our stay to be fine. Our room was on the 5th floor ocean view. Our room was clean, service was nice and I only saw I big bug and that was in the laundry room. We were there over the 4th of July and for the Pepsi 400--so it was packed. They had fun activities in the pool each day with music for the kids--we spent our time at the beach. Each day they cleaned the sand off of the stairs and pool area that led to the beach, but it would get dirty again--that can't be helped. Don't get me wrong there was sand on the floor and in the rugs going to and from the lobby, elevator and rooms-But that can't be helped with all the traffic going in and out. I would see the workers mop and vacuum but the people were tracking it in. BUT we did have a nice stay and I am glad about that. So if you are a neat freak and getting sand on your feet bothers you...think about it.. But--just so you know some people do have nice stays.", "Date": "July 28, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Toooo much blood....”", "Author": "A TripAdvisor Member", "ReviewID": "UR3693332", "Content": "My wife and I made reservations for your site for the period of 7-16-05 till 7-23-05 in good faith based upon advertisement and your website. After making the reservations we started being warned of your establishment by various people and web sites. We called to attempt to get our refund but was informed that you guys did not give refunds on deposits. We decided to give you facility a try and hope that the reports were incorrect. We never got a confirmation, even after we called requesting one we were promised it was in the mail, but as of 7-22-05 it has not arrived??? Upon arrival in Daytona we came to the check in to look at the room before we paid the rest of the week. After standing in line for several minutes hearing complaint after complaint about the room being dirty, the air not working, the noise and numerous other issues. A lady ran in screaming that help was needed at the pool area. A fight had broken out and some guys were throwing beer bottles at each other with children in harms way. One of the victims came walking at me and my crying 10 yr old daughter covered in blood, yes BLOOD his head was cut open very badly needing medical attention the staff allowed him to walk out. I decided that this was no family resort, as advertised to me, and proceeded to find alternate lodging. I came back to give you another try because you can not always be held responsible for others, but to my dismay the gentlemen who were drunk and causing the trouble were still staying at the resort. Also I would like to bring it to your attention that a charge for a pornographic web site appeared on my credit card after I gave the card number to your reservation center, I have been informed by the pornographic company that the stolen charge originated from this location. People beware the reports are all true I witnessed them firsthand.", "Date": "July 22, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "3"}, "AuthorLocation": "E TN", "Title": "“What a Dump”", "Author": "goatfuzz", "ReviewID": "UR3693107", "Content": "My family and my wife's sisters' families made reservations in March for 3 rooms (actually 1- double room, 1- 2room suite, and 1- suite with kitchen). Before we left, we found this site and read the reviews about the Desert Inn. My sister-in-law has stayed there for the past few years and she said the reviews were wrong, and must have been intended fro another hotel. My wife, being very particular and almost a \"clean freak\" decided to get busy and also make a reservation at the Holiday Inn next door. She wanted to stay where her sisters were staying but wasn't gonna stay if the place was nasty. We could always cancel the Holiday Inn (their cancel policy is just by 6pm the day you are supposed to arrive and no cancel fee). ((By the way, the Desert Inn bills your credit card the day you make the reservation, and you lose your deposit if you cancel less than 30 days before your scheduled arrival.)) Please keep in mind, their website boasts a $10 million in NEW Renovations just completed... Read on.. When we arrived, 1st strike, there was a woman complaining to the desk clerk about her son getting 'bugs' in his hair from the bed. This should have been warning enough, right? Anyway, we said we wanted to see our room before we checked in. The clerk studied the computer screen for a while and went back in the office a couple of times. He finally came back and told us that our room was supposed to be on the same floor as her sisters' 2 rooms. ?ok? Then he gave us a key to a 2nd floor room and said we could go look at it. The stairway leading to the walkway and the walkway itself immediately outside the room looked nasty and smelled of urine. All along the walkways of this $10 million renovated facility there were pieces of tile missing and old severely cracked places in the paint. We opened the door to a musty, dirty room. The tile floor felt sandy under our shoes, a rusty air conditioner dripped water INTO the room where it wasn't mounted correctly. The kitchen was an indention in the wall, but the pictures on the website make it look like the kitchen is a totally separate room. I looked it over and wouldn't have eaten anything cooked on that stove, and I was afraid to look in the fridge. My wife went into the bathroom and found the \"clean\" toilet dirty and the corner shower was moldy and mildewed. Our 13yr old son was in the other room saying something about this isn't too bad, so my wife told him to come look in the bathroom. His reaction, \"Ok, I was wrong. I don't want to stay here.\" When we went back and told the desk clerk, he said he couldn't give us our money back, then, looking over his shoulder (I asume he was looking to see where the manager was), he leaned forward and said I should contest the charge on my credit card bill. \"A lot of people do\", he told me. I felt bad for this guy because I know it's his job, and he may not be able to find somethjing else. I sure would hate to work there. One more note, my wife's 2 sisters wound up staying there because they couldn't find other rooms, but even the one who had stayed there before said \"never again\". Oh Yeah, remember me saying the clerk told me we were all 3 supposed to be on the same floor and gave us a 2nd floor room key. Sister 1 was on the 5th floor, and Sister 2 was put on the 7th floor. We never did figure out what the renovations that cost $10 million were. We also checked and found out it is NOT AAA Rated. I wonder why?? Thankfully, my wife had made the other reservation.", "Date": "July 22, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Very Very Nasty”", "Author": "A TripAdvisor Member", "ReviewID": "UR3668379", "Content": "My family and I went to Desert Inn for the first family vacation we have all had together ever. we booked reservations online and I also read all the bad reviews that were online and thought for sure it would be better then that. When we arrived we had reservations for a suit for 5 and we went and looked at the room first to make sure it was ok and it was the wrong room. I went back down stairs and told the guy that it wasnt right and he gave us then a suit and we went to look at it. The room was very nasty and the ceiling was falling in, it stunk so bad, the door wouldnt shut are lock there was puck all in the hall ways and the place was just not clean. We ended up going ahead and staying the night and we woke up to go get some breakfast and head to the beach when my husband and I noticed my 9 year old son was itchying his head alot and I looked at his head and he had brown bugs crawling all in his head which appeared to be crabs or bed lice im not sure. My son had his own bed so we went back to the hotel and looked at the bed and there was brown bugs all over the linen and the matress, I rushed down stairs to speak to a manager while my husband went to the drug store for lice and crab medician and the lady was like whats the problem I told her and I demanded all my money back and showed her my sons head and she said I dont see anything \" OH MY I SAID\" they were all over his head and then she proceeded to go look at the bed where she again said I dont see anything. THEY were EVERYWHERE I again demanded all my money back. Long story short They DID NOT give me all my money back they made me pay for the one night I was there + taxes I lost $180.00 for my son getting bugs in there bed. Please dont do what I done and just hope for the best and think oh it will probaly be ok, belive all the reviews it is the nastiest place I have ever seen, it needs to be shut down by the health dept.", "Date": "July 15, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Michigan", "Title": "“Never”", "Author": "traci", "ReviewID": "UR3666133", "Content": "This place is AWFUL. My family and I checked into a room 2 years ago and as soon as we seen the room, we headed right back to the front desk and told them they could have their room! Now seeing the current reviews, this place hasn't changed a bit and I would NEVER recommend this hotel. There are WAY too many CLEANER places in Daytona Beach to stay. I tell anyone going to Daytona do not stay at The Desert Inn!!!", "Date": "July 14, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Beware of reservations”", "Author": "A TripAdvisor Member", "ReviewID": "UR3645886", "Content": "I made reservations in March. I was told I had to pay a security deposit of 89.00 to hold my room. I was also told that I would receive a confirmation package in the mail. I never received it so I called and told them. They said it was sent but they would send another one. I verified my address. I still did not get the confirmation package. At this point I became wary. I decided to cancel my reservations in May. I was told I would get a refund of 89.00. I did not get it so I called them. I was told it was credited to my account on 6/02. By 7/07 it still did not show up on my bank statement. I called back again and told them I never got it. I was then told by the manger(who I had talked to each time) that it was stated in my confirmation package(which I never received) that I had to cancel within 30 days to get a refund. When I told her I never received the confirmation package, she hung up on me. She was very rude, which was uncalled for since I was being nice to her, considering that I was getting ripped off. I do not recommend making a reservation with this hotel.", "Date": "July 7, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“the best hotel i ever stayed in”", "Author": "A TripAdvisor Member", "ReviewID": "UR3644507", "Content": "This hotel was just wonder. Me and my family stay there about a week and a half for the race down there and the staff was just wonder. The thing that i loved the most was the DJ that played during the day. He did activies with the kids that i love. Then when it was the 4th of july he did music at night and did a wonderful show. The rooms was clean it could have been better but they was nice. I really love this this hotel and me and my family will come back next year. Also i liked the pool area it was very big and i just loved it.", "Date": "July 6, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“good fun”", "Author": "A TripAdvisor Member", "ReviewID": "UR3629300", "Content": "When you walk into the desert inn it has a great feel of hospitality and cleanliness. the rooms are very clean and i had no problems with my room durning my stay here. the staff offers 24 hour room service and they treat you like a guest should be treated. the hotel has a huge pool, ocean front, an indoor pool, internet cafe, oceanfront restraunt, sauna, hot tubs, jacuzzis, great views, kiddie pools, large stretch of beach, and is in the heart of downtown daytona. The rooms in the summer only cost like 100 a night GREAT DEAL. this is my favorite resort in daytona beach.", "Date": "July 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“loved it!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3623468", "Content": "My family and I just got Back from there after a 7 day stay. We got excellent service, the food in the resturant was great, and the rooms were VERY clean! I'd go back again in a second!!", "Date": "June 30, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“worst hotel ever (don't go close!!!)”", "Author": "A TripAdvisor Member", "ReviewID": "UR3621803", "Content": "this was the worst hotel that i have ever seen it was the the biggest dump that there is. Don't ever stay there. I would rather live on the street than live in there. First the elevetor got stuck going up so that was not too goodand when we got to the room we were shocked. Their adds said that it was all newly redone but that was all a lie. It had water all over the kitchen floor and the ceiling was caving in!!! So we complained and like 10 \"cleaning personel\" came up to the room and spent a hour trying to clean the room up. It needs to be cleaned up with a excavator belive me it needed alot of work or torn down. They cleaned it up and we looked at the room again and it looked about the same. there was puke and pheices everywhere and the bed still had a big brown puddle of something on the sheets it was gross. So we refused the room. We didn't get the deposit back but we left to find a better place. So we went to Emerald Shores and let me tell you that this is one one the cleanest hotels that I have stayed in.", "Date": "June 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Loved the hotel, the staff, the pool, the DJ and the view!”", "Author": "Pat S", "ReviewID": "UR3621318", "Content": "My family and I stayed at the Desert Inn last week and we were extremely impressed. It's not the Hilton -- it's more like home -- lived in and comfy. The front desk staff and cleaning staff were all very helpful and friendly and always working despite the heat. The pool was huge and clean and had plenty of lounge chairs available. The DJ who offered music and activities each day was FANTASTIC! He kept all ages busy dancing and playing games including hula hoop, limbo and bellyflop contests. We spent lots of time in our room which was large enough with 2 large beds. The ocean view was perfect from our balcony. We'd chose the Desert Inn again if we decide to go back to Daytona Beach!", "Date": "June 29, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Could Have Been Worse”", "Author": "A TripAdvisor Member", "ReviewID": "UR3542588", "Content": "My family (party of 12) made reservations in February for two (2) two-bedroom suites. According to the person taking the reservations, these rooms would more than accommodate our party. Luckily, we called in March to confirm the arrangements. It appears the person who took the reservations did not know there were no 2 bedroom suites in the hotel. So after a little wrangling, we added another room. We called the day of our check-in to confirm our rooms were ready and were told we (party of 12) only had one room. After 5 mins on-hold, we were told our three rooms were ready (?). The lobby is beautiful and reminded me of a \"50's style classy hotel\". Unfortunately, the rooms are to less than desirable. Although, the rooms are spacious and very clean...they have been poorly maintained. The tile is worn, the walls were cracking and the overall feel of the room was...LOTS OF NEGLECT. The bright side was the pool (big & beautiful), the pizza at the lounge was fantastic and the employees were all nice and helpful. I would suggest looking at the rooms prior to checking in and handing your money over. There are some rooms on the bottom floors (found them while taking the stairs instead of the elevator) that appear to be really dangerous (no lights in the hallway) and pretty gross (that part of the hotel smelled germ infested). With a LOT of $$$, this hotel could be the cream of the crop. I doubt we will stay here again. It's a shame since the hotel was once in its day the \"Four Seasons of Daytona\".", "Date": "June 9, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Rat Hole: Dirty disgusting drunk haven”", "Author": "A TripAdvisor Member", "ReviewID": "UR3509753", "Content": "This had to be one of the nastiest places that I had ever been. Their website makes it look like a nice place, clean and respectable. Far from it. I had taken my family to Disney World then we were going to spend a few days in Daytona. We ended up staying only a few hours. The place was a dump. The room was nasty. There was water standing in the parking garage that appeared to be and smelled like sewage. The balconies appeared to be unsafe. I did not see one person there that did not have a beer in one hand and a cooler of beer in the other. There were beer bottles all over the roof and pool areas. I would not let my kids sit down or touch anything. I informed my family that we were leaving immediately. We lost our deposit but it was well worth it. However they did ruin my kids trip to the beach, since we could not find another room at a decent rate. My kids got to spend the night at a reputable motel in Jacksonville on the way home.", "Date": "May 30, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Partys”", "Author": "A TripAdvisor Member", "ReviewID": "UR3482115", "Content": "LOVED IT...thats probably because i love drinkin, same with everyone i was with...i met nice people and the staff was cool too. the only problems with the place was that they didnt clean it as well as they should of...every single person that stays there should be between the ages of 18 and 24, because its a happening party place...so if ur like me, and u like drinkin...stay at the desert inn, just watch out for those roaches", "Date": "May 18, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Jacksonville. Florida", "Title": "“Nightmare on the Shores!!!”", "Author": "chevelle837", "ReviewID": "UR3447738", "Content": "This was the worst hotel I've ever been to. When we first arrived the atmosphere in the lobby was so pale and dim. Then after standing in line for 30 minutes we get to the front desk. The front desk clerk starts to panic and I ask him is there a problem. He assures me there isn't a problem. So he gave me my registration papers that had me down for a two queen bed deluxe room. Which was totally wrong, I had reserved a deluxe jaccuzi room patio suite 3 weeks in advance, which they had given away. So after a argument with the front desk clerk he told me that they had a poolside jacuzzi suite availabe. I told him that I wanted to see the room before I gave him any money. And he agreed. Upon walking to the room they lead us through this horrible walkway with grass growing up everywhere and concrete falling apart. When we got to the room it was no better the tile was coming up and the jacuzzi had stains in it. The entire room was horrible and it smelled of urine and feces. After that I told the front desk clerk how do you expect a human to sleep in this dump when I wouldnt let my dog sleep here. Please stay away from this hotel. I had read bad reviews before going to this hotel and I just took a very bad chance. Please take my advise and try the Palm Plaza Resort down the street much nicer and cheaper.", "Date": "May 7, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Horrific . . .”", "Author": "A TripAdvisor Member", "ReviewID": "UR3370507", "Content": "My family and I stayed at the Desert Inn Resort the first week of April 2005. I reserved our suite in February after I received their brochure which boasted of many renovations. Being unfamiliar with this facility, I questioned the hotel registration clerk about the conditions of the hotel. He assured me that it was a nice hotel and it had only suffered minor cosmetic damage from the hurricane. Upon check-in, it was immediately apparent that this was not a well maintained facility. Trash was overflowing in every trash container and/or ashtray. Every trash container from the main lobby to the pool deck smell of urine or feces. The tile floors were filthy and the carpet was grossly stained. I was assured that these conditions were the result of spring breakers. I was told the hotel had not been able to keep up with maintenance and cleaning during spring break. However, now that spring break was now over, the hotel would be cleaning up. Due to the disgusting conditions of our room, I called to complain. I was told they would not refund my money. They would move me to another room which was in better repair. As I unpacked our toiletries in the bathroom, I was utterly sickened by the discovery of several hand towels which were soiled with feces that had been placed in the cabinet underneath the bathroom sink. I immediately notified the hotel manager of the feces soilded towels. She seemed disgusted but would not provide us with a refund. A cleaning crew was sent to reclean our room and our hotel rate was discounted by $50 a day. During the week of our stay, the trash containers were never empty. The smell of urine and feces grew stronger each day. A bathroom sink off the pool area was full of feces. During a thunderstorm, our kitchen ceiling leaked such that a container had to be used to collect the water. Also, each night about 11 pm until the wee hours of the morning, there were partiers on the lower balconies who cussed, screamed, threatened, threw furniture, and broke beer bottles. All of these things were reported to the front desk to no avail.", "Date": "April 17, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Totally disgusting”", "Author": "A TripAdvisor Member", "ReviewID": "UR3318691", "Content": "We arrived at this hotel with high hopes. The outside looks fine. When you enter the lobby it looks fine. When u enter the elevator, you start to wonder. When you exit the elevator your eyebrows raise like \"Oh my God\". We entered our room which was totally disgusting. It smelled like somebody had spent the entire day puking in the room with no ventilation. There were rat holes in the walls. Electrical wires hung from the ceiling. We complained and FINALLY got another room where there was nasty hair in the beds. The next morning we went to the front desk and complained and had to pretty much FIGHT to get our money back. Staff ----. Very unprofessional. We moved to the Hawaiian Inn and it was heavenly.", "Date": "April 1, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“grrreat!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3272241", "Content": "I went to Daytona Beach for the bike week the hotel was pretty good. The service was great, food good. Our only problem was that our sliding glass door wouldn't lock. The location of the hotel was great right next to all of the big party spots, you walk to them from the hotel. I read the other reviews and i think they are completely wrong i did not once smell anything bad. I would recommend this hotl to anyone of my friends.", "Date": "March 14, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“A Filthy Noisy Place”", "Author": "A TripAdvisor Member", "ReviewID": "UR3225697", "Content": "We stayed there from 2/16/05 to 2/22/05 for the races. The place may have been at the top in it's prime, but today it is at the bottom! This is the first place we have stayed at for 200.00 a night and couldn't sleep because of the noise. When we complained about this the front desk handed us ear plugs. They also wouldn't change rooms or give a refund I've never had to were ear plugs to sleep except when flying on a KC-135 in the Air Force. In addition to the outside & inside noise the place is dirty. Don't believe the internet sight or the brochoure, this place is nothing like that! Don't make the same mistake we did! Ken & Susie P.S Watch out for the shake, rattle & roll elevator. One of their elevators shakes so bad you wounder if the doors are going to open on their own.", "Date": "February 24, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“not safe”", "Author": "A TripAdvisor Member", "ReviewID": "UR3194128", "Content": "i stayed here i march break two years ago. the pice was not bad for the time of the yearm but it was the other guests that were the problem. I would wake up in the morring to find many of the hall lights were riped off the wall and broke on the floor, during the night hours some guest would put the pop machine in the eleavtor making it impossibale to use have to force other guest to take the stairs. you tell the front desk about it and all they can say is they are working it out, i found that it was a horribal week and ill never stay their agien.", "Date": "February 15, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“This place sucked!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3014991", "Content": "We stayed here for Biketoberfest in October. It had to be the nastiest place on Earth. The rooms were musky. The air condition vents were molded and rusted. The door barely locked. The hallways smelt of vomit and mildew. The elevators were just as bad. The sliding glass doors would not hardly open. The front desk clerks were the biggest jerks I have ever met. They were all rude. The tv in our room did not work. We called several times and reported the problem. but it took hours before we got anyone from maintenance up there to help us. On top of all of this, we were told that there was plenty of room to park. We had to park our trailer 5 miles from the resort in a parking garage because there was limited parking. I was almost afraid to even lay my head down on the sheets. Thank God, we brought our own. Don't waste your time or money staying at this place.", "Date": "January 18, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Words cannot describe...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2858429", "Content": "This is the ABSOLUTE filthiest hotel I have ever had the misfortune to have stayed in! Evidently, they have tried to remodel the place but whoever they hired had to be DRUNK! One example they evidently spray painted the walls in the suite but did not move the fake potted plant, therefore that was sprayed white also!!!! Do yourself a favor and stay somewhere else!!!", "Date": "December 1, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Never again”", "Author": "A TripAdvisor Member", "ReviewID": "UR2854445", "Content": "I have stayed here previously for the Turkey Run car show on Thanksgiving weekend. I always make reservation with a credit card months in advance. This year they claimed when I checked in that I had not made reservations. They wanted to run off the people who had made reservations in order to get the higher rates from walk-in customers. They pulled the same stunt with a friend that was traveling with me. The place has always been a dump, but it's not been as important to me since I only use the room to sleep and shower. The HVAC system has never worked properly. The bathroom fixtures are dilapidated at best. Do yourself a favor and stay away from the Desert Inn!", "Date": "November 29, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“robbers”", "Author": "A TripAdvisor Member", "ReviewID": "UR2718162", "Content": "We had rooms reserved for bike week in Oct. We cancelled the first part of Oct. because of illness and they will not give back our deposit.", "Date": "October 16, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“senior trip that fell apart”", "Author": "A TripAdvisor Member", "ReviewID": "UR2526284", "Content": "My senior class trip was to Daytona Beach and we stayed at Desert Inn. When we got to the hotel several rooms had something wrong with them. Some air conditioners did not work, locks would not work, and the hotel smelled bad! (maybe because the carpet was wet from the beach and pool) It certainly was not the cleanest place. One room in my senior class did have somethings missing after room service came in. They were real small things that most people wouldn't notice like cameras and snacks, but it's still the principal of the situation. The sauna did not work and the exercise equipment wasn't much. If I were to visit Daytona Beach again, I would not stay at Desert Inn.", "Date": "September 13, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Savannah, Georgia", "Title": "“Falling apart.”", "Author": "mystery250", "ReviewID": "UR2443220", "Content": "Well, I went to the hotel for the Daytona Beach summer Youth camp, sponsered by Crossed-up ministrys. It's a nice hotel, nice people. But it's falling apart. Right when we got there, the door wouldn't unlock to our room. After that, the toilet handle fell off. 3/4 of the computers don't work. The stairs smell like urine. It's not the best hotel. But it does have some nice people that work there.", "Date": "August 12, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“filthy! old! dilapidated!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2438663", "Content": "We chanced it and booked reservations. Huge mistake! I knew we had messed up when we pulled in the parking lot. When my wife was checking us in at the front desk I took my kids to the lobby restroom. Absolutely filthy! I couldn't believe I had booked here for a week, drove over 600 miles, and dropped a $1000! We got to our room and it was old, dirty, and dilapidated. The door was propped open with a piece of wood. I felt like I was in a nightmare. The room was oceanfront, but the layout of the hotel made the beach seem like a mile away. The balcony overlooked a patio (I guess you could call it that), and two kids were throwing rocks at the cars below. When we started down to get our luggage, the door wouldn't completely close because the lock was falling apart (the key wouldn't lock the door either). I wasn't going to subject my family to this, so I went to the front desk. The people in front of me were requesting ice (the clerks distributed the ice in a zip lock freezer bag). When I told the clerk I wanted my money back he said there were no refunds and that he would get a maintenance man to fix the lock. I repeated that I wanted my money back. He finally agreed to refund all except the first night. We wouldn't have stayed even if it were free. After only about 30 minutes at this place, we just wanted out! We left immediately not knowing if we could even find a room. We ended up staying the night a few miles away from the beach at a Courtyard Marriott. We needed a suite which made it tougher to find a room spur of the moment. Fortunately, Palm Plaza in South Daytona had one opening up the next day for the rest of the week. We ended up there and it was great. I've never written a review before, but I wouldn't want something like this to happen to anyone else.", "Date": "August 10, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“The most filthy hotel I have ever seen”", "Author": "A TripAdvisor Member", "ReviewID": "UR2350413", "Content": "This hotel has to be the most filthy place that I have ever seen. It looked like it hadn't been cleaned since the picture was taken for their brochure. Once they take your credit card there is no chance for a refund if you leave early. \" It's not in their policy to make refunds.\" If you want to watch tv you will need to wait for someone to bring a remote up to your room. That would be when it is convenient for the front desk. What about that \"Olympic size pool?\" Someone used a great camera lense to distort that view of the pool. The deck and chairs were dirty. Plus I don't think I have ever seen so much scum and as many large hair balls floating in one area. I wouldn't send an enemy to this place. Never again would I go to the Desert Inn. My friend should have canceled their credit card for the last day.", "Date": "August 2, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Desert Wrecked Our Weekend!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2347957", "Content": "We thought it would be a nice place to relax and get away for our anniversary. Instead it was so noisy all night; we couldn’t fall asleep until 3:30 in the morning. Adults were in the dark in the kiddy pool yelling and screaming. You could hear doors opening and closing, walls were so thin. We listened to Channel 13 News blasting for endless hours from the room right next door. We had a no smoking room but the people next door sat outside right next to our room smoking cigarettes and cigars the wall air conditioner pulled the smoke right in our room. Not to mention the decor of the room. I wondered if the builder was drinking or blind! Ceiling fan missing parts; large nails sticking out of the wall where pictures had been; small refrigerator with microwave stacked on top and coffee pot on top of the pile. Hats off to the maid the room was pretty clean. The front desk employees were happy to check people in. I’m sure there are better rooms in Daytona for $155.00+ a night!", "Date": "July 31, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“What a dump!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2346834", "Content": "I walked in to this place off the street, because it APPEARED to be nice from the outside. Once inside it was still nice. After being assured by the person at the front desk that the property was just as nice inside as it was in the lobby, I booked a room. AGAINST my better judgement after seeing the sign that says \"NO refunds must pay UP FRONT\". Thats how they screw you, you see. If you pay up front and they dont refund, then you cant get your money back as soon as you walk in and see how it REALLY is. By the time I parked my car I knew it would be horrible. My room was nasty, there were holes in the doors to the entry and the bathroom. The sink was held up by a piece of wood. The shower barely worked. The phone was missing the faceplate. I took pictures of all of this...I plan on posting them wherever I can. Not only was the hotel crap but so were the people staying in it too. People with mean kids (I have 3 who were well behaved, I saw maybe 1 more that was as well- the rest were AWFUL because their parents were too). OH by the way, I got two phone calls..... one at 5:00 am with a hang up, the other 30 seconds later with a wakeup call I didnt ASK FOR. I asked for one at 8am. Nice huh. The holiday inn is right next door, stay there and hey stay there CHEAPER. I was duped by the \"childrens activites\" and stayed at the Desert Inn. The ping pong tables were torn apart. The pool area was clean until you went to the bathroom, my husband went in to the pool area bathroom and said it was about what I would compare to a porta potty at a death metal concert. NEVER EVER again. I plan on telling as many people as I can about this hole. They have a nice brochure. They even said they just rennovated (I guess maybe that was the half assed patches in the walls). Please. Its a DUMP. I stayed at Bahama House in Daytona Beach Shores while down there as well.... its GREAT at about the same rate. Top class with kids activites for REAL.", "Date": "July 31, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Whatever you do, do not stay here”", "Author": "A TripAdvisor Member", "ReviewID": "UR2326882", "Content": "We found this hotel on the internet. They sent us this beautiful brochure. Everything in the brochure and on-line looked perfect for our family of 5 to go on vacation and have a good time. What a mistake that was. We arrived at the hotel to find a run down dirty, cracked, grafetti on the walls, furniture ripped, pool green, kids walking around yelling, partying, playing loud music, no basket ball courts as advertised and the shuffle board had cracks in it and weeds growing through the cracks. Then they required us to pay for our whole stay right up front. Should have known something was wrong then. Once we walked around the hotel and saw it. We immediately demanded our money back. They refunded all but the $99.00 deposit. We were told that we had to return the next day to speak with the manager to get the $99.00 back. When I arrived the next day to get the refund, I was informed that the deposit was not refundable. Of course we raised - you know what and threatened to call the BBB. We did receive our money back, but only after getting ourselves quiet upset. Whatever you do, do yourself a favor and stay somewhere else. I recommend the Dayton Beach Resort. They are great. That is where we ended up after that mess at Desert Inn.", "Date": "July 28, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Read the review - stay away”", "Author": "A TripAdvisor Member", "ReviewID": "UR2320921", "Content": "This was one of the worst places I have ever stayed. My wife and friend made the reservations without searching the internet on complaints. I searched and this is the first site I hit. I would have told her not to book at this place. As it was we only stayed one night out of two and they told us they would not refund the money. I contacted my credit card and hopefully they can handle. The rooms look like those on TV where you would pay by the hour! None of the rooms are smoke free, they tell you they use an IONizer to clear the smoke, does not do much for the odor on the furniture. PEOPLE READ STAY AWAY!!! We ended up going to St. Augustine instead, much nicer place and accommodations were top notch.", "Date": "July 25, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Beware!!! Slimy operation!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2320279", "Content": "These people stole my reservation deposit by not refunding it after saying it would be done. Constant lies about a issuing a credit. This place is a joke. If they do this with a deposit imagine what they would do with your stay. Staying in a dumpster would be a better option.", "Date": "July 25, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“God awful!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2316052", "Content": "My family has stayed at this hotel on two different occasions, both being for the Pepsi 400. The first time wasn't all too bad since they were about the only reasonably priced place to stay. the first room we checked into was a disgrace...complete with mold on the ceiling and NO BALCONY but a rail across the sliding glass doors... The second time....well....lets just say I had reservations at a different hotel further up the coast, but the DI management contacted us and begged us to come back since we were \"valued customers\", PROMISED to make it worth our while!! So we decided to give it another shot, they do have a nice pool with a DJ, and a pretty decent location to activities in town. BOY DID WE MAKE A MISTAKE...The first room had the usual moldy ceilings, and what was suppose to be a suite?? was a poorly remodeled room splicing....the one set of sliding glass doors did not shut, and the \"full kitchen\" was a tiny little knook....we changed rooms..next room appeared cleaner, better view and a larger kitchen, after about 6 hours the truth started to come out....The kitchen table which was glued to the wall and held the microwave almost fell.....The shower leaked so badly that we had two inches of water on the floor...ruining hairdryers and bags...Managements response...\"we'll give you extra towels and just stack them up to hold in the water\"........The room Did have the typical moldy ceilings, just missed them on first inspection!! The only nice thing about this hotel is the cleaning staff...who picked up 40lbs of wet towels everyday!! Did not like seeing an exterminator in the hallway, and don't be in a hurry to use the elevator...don't use the washing machines because they ruin your clothes, had two tvs' only one worked...broken drawers, filthy roomIf it wasn't for the beach and the race the whole trip would have been a disappointment!! If your a family on a budget....LOOK ELSEWHERE..........They make it sound fantasic but I honestly would not stay there if it was free!!", "Date": "July 22, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“We discovered a blood stain on our sheet!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2293459", "Content": "This resort was the nastiest place that I've ever stayed! My family and I were on our way to Port Canaveral when we decided after a 14 hr. drive that we should stop in Daytona for a night. We weren't being picky about a place to stay, we only wanted somewhere clean to sleep! With it being 11pm we made the mistake of not checking out the room first...the bathroom was so gross that none of us wanted to take a shower in it. There were hairs hanging off of the clean towels, the toliet was dirty and the floored looked as if it hadn't been swept. When my husband unfolded the sleeper sofa we discovered a BLOOD stain (about the size of a half dollar) on our sheet. It had soaked through and was also on the mattress, which proves the fact that the maid had not changed the sheets! After notifying the front desk, instead of getting another mattress, we got another sheet! So after layering it with every blanket we could find, we had to sleep on it, it was so old that it caved in the middle, instead of being flat. We all kept our flip flops on instead of walking barefoot in the room, and we even slept in them. I've never felt so dirty in any resort before! Upon checking out we only got a half-hearted apology from the man at the front desk! We were very dissapointed that we spent our hard earned money on this resort.", "Date": "July 13, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Do Not Stay Here”", "Author": "A TripAdvisor Member", "ReviewID": "UR2184895", "Content": "This hotel doen't deserve at rating at all.Do not be fooled if they tell you that these bad reviews are from spring break. I was. I called 2weeks ahead of time to ask about negative feedback, they told me that was from older people who didn't understand about spring break. They assured me that spring break was over and the hotel was wonderful. As soon as we pulled up to the hotel I was not happy. This was a terrible place. It looked nothing like the pictures on the brochures. The first thing that I saw was the big sign that says no refunds. I requested to see the rooms b4 paying. As soon as I stepped off of the elevator I was ready to go. The elevator was dirty and smelly. The floor was filthy in the elevator and hallway. And the hallway smelled awful. My 2 bdrm suite with a full kitchen was actually 2 rooms connected by the tiny kitchen. The cabinets were falling off. The trays for the stove top had foil on them. The refridgerator was dirty and smelly. It was not clean at all. If you get one of the brochures that they send out. The hotel nor the rooms look anything like that. The only thing that looks remotely similar is the pool outside which had a DJ all day that plays music loud enough to hear while in the ocean. They would not refund our $200 deposit. I was so discussed that I didnt care about the money. Me and my family, group of 20 people stayed next door at the holiday inn and suites. It was great!!!!!", "Date": "June 12, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“very nice for an old hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2171509", "Content": "our stay at the desert inn was ok........the a/c is not very good and they need to update the flier they send out because there is no longer tennis courts there...but they have very nice pool outside and its right on beach....we had a jacuzzi suite and that was great.....if your looking for a bargain in price u will get that here.....but its an old hotel so for the most part that is all u get is the bargain of price.....", "Date": "June 8, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Hell could have better accomodations”", "Author": "A TripAdvisor Member", "ReviewID": "UR2152924", "Content": "Tuesday June 1, 2004 we checked into this absolutely pathetic motel. Should have known we were in for a few surprises when they refused to honor our AARP or AAA and gave us a credit card receipt already charged. Got a room with a King Size Bed went to the room at 3:00Pm dropped our bag and left to view the area . had a fantastic dinner at Bubba Gump's , did some t-shirt shopping and returned to our room at 9:15PM. Pulled the covers on the bed down and there must have been 50 spiders crawling all over the sheets. My wife screamed I looked up and saw spider webs throughout the ceiling and on the light. Immediately grabbed our bag and went back to the front desk and was rudely told there would be no credit to my account as we had the room for 6 hours. Stay away from this place . Went next door to The Holiday Inn and for $5.00 cheaper got a fantastic room complete with two comfortable chairs, a microwave, refrigerator , great view of the ocean, a great bed - a wonderful experience. The front desk clerk at The Holiday Inn told us that The Desert Inn is their source for business everybody checks out of The Desert Inn. The Daytona Beach Tourism Guide Book shows they spent $500,000 to modernize it unfortunately they forget to spend a $1.98 for a can of spider and roach killer. -", "Date": "June 4, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2070630", "Content": "I come to the Desert Inn every year and it is always fun! It is very clean and there's always an event taking place. The pool is really fun and they always have music playing! Stay here", "Date": "May 17, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Gotta love the D.I!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1934137", "Content": "I spent my 4 day vacation at the desert inn a few weeks ago and it was a dream. I came with a few friends and we had a great time. All of the ammentities were there, the lobby was beautiful, and my room even came with an extended balcony about 30ft long! Wow! I felt welcomed from the moment i walked in and was greeted by the buzzed cut front desk guy. He was cute BTW! Also, the pool deck was huge and very clean. The location was great, very close to the important places in daytona...clubs, shops, bars, boardwalk...etc. This is for sure a great hotel with a friendly staff and comfortable rooms with great rates!", "Date": "May 12, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Cut-Throat Business”", "Author": "A TripAdvisor Member", "ReviewID": "UR1925263", "Content": "This was place was absolutely disgusting. We found a used condoms in our room. The room was infested with moths and they were coming from the venthood in the kitchen. No telling what else is breeding in that venthood. The spring breakers were allowed to do whatever they wanted. They were on the huge decks huffing some type of drug out balloons and smoking pot in broad daylight. We heard shouting and screaming well into the night - At one time we were not sure if someone was getting raped or murdered!! The room that should have slept 6 only slept 4 because the fold out couch was broke! So for over $300.00 my husband and I slept on the floor the entire trip. And they would not give us our money back. We should have known when they charged our entire stay to our credit card the first night! Management knew someone would complain and did not care because they already had your money. Take my advice, stay away!!!", "Date": "May 11, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“it was ok not the best but not the worst”", "Author": "A TripAdvisor Member", "ReviewID": "UR1902744", "Content": "i went to the desert inn for my birthday may8th 2004 i just turned 15 and when we got there it looked incredible but when we got to our room there were no lights that had a shade on it the maids and service were bad. that noght they had prom and everyone there were all drunk and getting stoned, i was on the 3rd floor and it smelled like pot and in the indoor pool there were real human hair like somone cut it off themselves it was gross. the only good part about it was the price", "Date": "May 10, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“VERY POOR I will never be staying here again.”", "Author": "A TripAdvisor Member", "ReviewID": "UR1785566", "Content": "The night manager was horrible Ill never stay there again! im a florida resident that stayed there often but due to this night manager that worked on april 9th at 12:14 am i will never be returning there. I recommend that you dont either. HORRIBLE Service VERY RUDE. He would also not give me his name so I would be able to report him.", "Date": "April 14, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Desert Inn Resort is the *Last Resort*”", "Author": "A TripAdvisor Member", "ReviewID": "UR1773579", "Content": "Oh my gosh! We stayed there for 5 nights and it was terrible! We drove from Ohio to see a piece of junk on the beach...a hotel i might say. Our air conditioning broke, we were supposed to have an ocean veiw and we had to lean over the balcony and look to the side to see it. The stairs to the beach were all watery and sandy and wet! NASTY!! The bottom of the pool was covered in sand and who knows what else there was down there. The parking garage was all watery and smelled like poop! The elevators felt like you were gonna drop down to the earth's core! Luckily we were on the fourth floor because the first floor, people were drinking and smoking. The bathrooms were disgusting! Cob webs and spider webs everywhere. The rest areas we stopped at on the way were better than that \"DUMPSTER\"", "Date": "April 11, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“It's the trashy party spring break hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1750793", "Content": "The Desert Inn was only a crappy party Spring Break hotel that should be cheaper becuase it is falling part...duct tape in the elevators to hold the lights up...classy! The vomit smell was a nice touch, and the stair well should never be allowed to have people go in because of the urine everywhere. Other than that...if you want to tear the place apart and not give a D$@# on Spring Break here is your place. Same ol' DJ everyday...same trashy contests...and a wonderful aroma to walk around in...The Desert Inn is your place!!!", "Date": "March 29, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Not to bad of a place”", "Author": "A TripAdvisor Member", "ReviewID": "UR1750458", "Content": "I've stayed at the Desert Inn several times, I alway go the week before Biketoberfest, I have found very few problems with it, the resturant is expensive, I don't like going to the desk to get ice, (should be an Ice machine on every floor). But I've had no bad times there and always got what I ask for from the desk and especially the maids. The person I took last year complained about the carpet being dirty, but you can't have everything spic and span.I like to have a good time as well as a lot of other people, but do it at decent hours,By the way, if it makes any difference, I'm in my early 50's, So just suck up and enjoy.", "Date": "March 29, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“simply amazing”", "Author": "A TripAdvisor Member", "ReviewID": "UR1746839", "Content": "People go to spring break for many reasons, reasons you will find at desert inn. This place lets kids get away with murder. People hanging off of balconies, yelling through megaphones and walking around with bottles of jaeger. Clearly the best time. If you want room service and clean sheets, go to the hilton. This hotel is \"party\" central with excellent poolside parties including beer relays and belly flop contests. There is also a meal plan one can accuire for $50. The food is good too. On my last night there, a water mane burst on the 3rd floor. --- was like old faithfull coming out of the wall. We were using the floor like a slip 'n slide. Everyone in the hotel was doing it. I only went out to the clubs 3 times out of the 7 nights. The hotel was too fun to leave. For the price, it is a steal!", "Date": "March 26, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“Party Central, but TERRIFYING!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1735284", "Content": "Me and some frineds decided to stay here for spring break '04. The price was right and the parites were never ending. Unfortunately getting any assistance from the maids or security was impossible. It was kind of a -------- but we were free to do whatever we wanted. There was always entertainment out on the pool deck, the lobby was clean (no water on the floors) but there was a hoorible smell coming up from the parking garage, it was a mixture of warm beer and hot trash. Other than that it was a decent place to stay. However, the aladdin suite 2 floors below us was out of control. When beer bottles were being launched from their room to ours, through our glass doors, security was nowhere to be found. We couldn't stay in that room for obvious reasons and it took security 30 minutes to even get to their room. They were escorted out after 3 nights of anarchy, which wasn't soon ehough for us. We left a day early and didn't get our deposit back. On top of us leaving we had to take the stairs due to some violent behavior in the elavators, the screams coming from the hotel were so scary. This turned out to be the worst vacation. I would not recomend staying in this hotel for saftey resaons. It was terrifying.", "Date": "March 21, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“Partiers welcome, families not!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1730769", "Content": "Desert Inn can either be awesome or completely awful. It depends on what you are going to Daytona to do. If you are going to party your *** off night and day, drink all you want, do whatever you want whenever you want, this is def. the place for you. This place is a non-stop party hotel and it's nothing but crazy drunk people running around doing whatever the hell they want to do! If you are going for a nice, peaceful, relaxing vacation with your family, then STAY AWAY! Parties don't stop at Desert Inn until about 6 in the morning, and that's no lie. The stuff written on the hotel about vomit everywhere and people breaking stuff and throwing things off the balconies are completely true! It's a very dirty place that has a weird odor to it like beer and throw up everywhere, but i've never had this much fun on Spring Break in my entire life! So to sum this up, partiers this is your place and families, like I said, STAY FAR AWAY!", "Date": "March 18, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“It was Absolutley disgusting”", "Author": "A TripAdvisor Member", "ReviewID": "UR1727513", "Content": "O my god, my boyfriend and i went down there for spring break, we drove 20 hrs from massachusetts, thinking we were going to this beautiful hotel we saw on the internet. This was the most disgusting place i have ever seen. First of all we were suppose to have an over sized delux room, the room was tiny, we probably had 2 feet in width to walk between the bed and the draws. There were holes in the wall, the bathroom looked like they literaly cut a hole in the wall and put a door on, there were cigarett butts on the floor, we were on the ground level and when we got there the window was open so we went to clese it and it fell off , so then we couldnt even close the window never mind lock it, you have to ask for ice behind the front desk, and the only safes they have are behing the desk so evry time we needed a lil money we had to go to the front desk, and the most disgusting thing of all was i walked out in the hall way and there were 2 dead cock roches, So if you are looking to stay at the Desert Inn dont be fooled by the picture on the web site it looks beautiful but when you get there it is really a run down dump.", "Date": "March 16, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Oh My God”", "Author": "A TripAdvisor Member", "ReviewID": "UR1721690", "Content": "I went here for spring break for 4 days. It was so bad that everywhere i walked, was either a puddle of someones piss, or someones vomit. The rooms were diry, well...the whole place was dirty. But...it was a great party atmosphere, just standing in this hotel gets you wasted! Spring break 2003! WOO HOO", "Date": "March 12, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Disgusting!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1720029", "Content": "The Desert inn was absolutely disgusting! The Air conditionning did not work therefore the room was not only hot but humid as well! the bathroom did not have a ventilation system, so if someone showered, the steam would stay in the room for a long time and everything would be wet, hence the black mildew around the bathtub! Gross! i was promised a microwave and fridge, when we entered the room there was nothing to be seen. The ocean side view ended up being the street where bikers and loud cars would drive by at all hours of the night. The staff looked like zombies who couldn't care less about the establishment they work at. Our wake up call that we asked for never happened and our carpet never got vacuumed once!...please if you are thinking of the desert inn as a vacation spot...think again.. the pool may be nice but check out the pool's public bathroom and you'll reconsider the whole thing!", "Date": "March 11, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tampa, Florida", "Title": "“Do NOT stay here”", "Author": "Flharleygirl1508", "ReviewID": "UR1719462", "Content": "After booking a 2 room suite for $375 per night, found ourselves in a 1 room filthy, sagging bed horror. Complained to management who, after initially being very rude, offerred to move us to a suite for $400 a night - a vastly discounted rate, I was told. Transferred into the \"Alladin Suite\" which was probably very nice - 20 years ago. Again, filthy, holes in the walls and the badly discolored ceiling, loose tiles in the bath floor, ancient saggy mattresses - I can't even describe how bad it was. Nieghbors partying and screaming until 4 AM and desperate calls (on old, busted up phones) to hotel \"security\" produced NOTHING. Paper thin walls - not peace for the 2 nights we were there. The big feature of the room was a big jacuzzi tub which we never touched and a big balcony which was so dirty you had to have shoes on to walk on it, dodging the cigar butts and beer bottles the people next door left on OUR balcony. The common halls of the place were no better - worn, filthy carpet, Huge bags of trash left in the hallways all night, broken glass on the floor in the elevator hall - we tried desperately to get another motel but it was bike week and everything was booked. Next time I will sleep on the beach before I ever go near this place again.", "Date": "March 10, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“3rd time and never again”", "Author": "A TripAdvisor Member", "ReviewID": "UR1713394", "Content": "We've been to the Desert Inn on 3 occassions, this by far was the worst, the only reason we went back was we saw on the website where they did many renovations. The only advantage to this property is its close enough to walk to places in Daytona for night life, but the hotel complex itself is a disaster with the exception of the pool. To start with our truck was broken into in the parking garage and items stolen the very first night there, and management could have cared less, and wouldnt even review the garage tapes to see if anything was visible or may have been recorded. They wouldnt call the police, we had to drive over to the Police Station to make the report. We had rented two oceanfront rooms both with kitchenettes, which the kitchens had missing ceiling tiles, drawers just hanging in the openings, and just generally dirty. Had this been during or right after bike week or spring break it'd be understandable, but this was the 1st week of August. The door handle on the slider to the balcony of our bedroom broke off in our hand, when we went to open the door, and when it rained, the carpet in front of the slider was soaked almost 2 feet into the room. We had two young ladies squat in front of our adjoining room and relieve themselves in the hall, and it ran under the door into the room, we called housekeeping to clean it up, but they never showed up. We ended up cleaning it up ourselves, we understand they cant control the guests but at least clean up after them in those type of circumstances. We ride bikes and not much bothers us, but this place for a hotel is much closer to a rally site campground than a hotel. It needs to be completely revamped totally, or torn down and completely redone, its lived beyond its prime...........but then again I'm not too sure Daytona Beach hasn't exceeded its prime also, time to find another vacation spot. Good luck.", "Date": "March 8, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great Hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1705761", "Content": "I stayed with my family summer '03. The staff was very sweet, especially the maintenance man! If I had any questions someone always knew the answer. I am going again on Spring Break '04 and will not stay anywhere else! It was convenient to have all of the amenities they offer work, unlike other hotels I stayed at in Daytona, and I am there every summer. I feel bad for the people who had a bad stay, because the staff and the room made it worth my while to stay. I won't stay anywhere else.", "Date": "March 4, 2004"}], "HotelInfo": {"Name": "Desert Inn Resort", "HotelURL": "/ShowUserReviews-g34172-d272114-Reviews-Desert_Inn_Resort-Daytona_Beach_Florida.html", "Price": "$65 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">900 North Atlantic Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "272114", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/69/9f/699f5b53d27ff6bdacf0db87c0ae8a461large.jpg"}}