{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“My kind of place!”", "Author": "John R", "ReviewID": "UR126506248", "Content": "Perfect location to main drag (5th Avenue) and beach. Small rooms but spotless and quiet. Great value for the price.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A tranquil haven in the middle of it all”", "Author": "John R", "ReviewID": "UR126371490", "Content": "I spent a few days in Playa on my own following a friend's wedding in Tulum. Based on a great review in Lonely Planet's guide to the Mayan Riviera and an unbeatable online price, I booked my stay there and I'm so glad I did. It's a beautifully designed hotel, steps away from the beach, 5th Avenue and the town's nightlife. The rooms are elegant and cozy - nice touches like azure bedspreads, smooth rock shower floors and in some, fun open lofts with a winding wooden staircase to the bed. The property has a nice open-air pool with a waterfall wall, at the top of which is a roof deck offering a great view. The staff are friendly, worldly and accommodating. Equally enjoyable for couples and singles.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Thank you Kinbe!”", "Author": "mle1616", "ReviewID": "UR125462423", "Content": "My husband and I were in town for a wedding and the Kinbe was recommended to us by the wedding couple. We aren't into the all inclusive thing so once I saw their website and read reviews I knew this was where we wanted to stay. We luckily booked early and got a GREAT room, the garden terrace with a view of the beach and great big deck area. All the rooms are differents shapes and sizes, our friend had a great lofted room and another a regular size room perfect for a couple. A lot of friends from the wedding stayed there, including couples with children and our elderly friends. Our room was cleaned thoroughly everyday. All the front desk staff was friendly, helpful and honest. Our room had a mini fridge which came in very handy. They also have a great, huge rooftop deck I wish we used more. The price was very reasonable and definitely worth it. The decor is warm, welcoming and flourishing with bright greens and flowers. (side note: book your airport transportation with the Kinbe, reasonable price and our driver was waiting for us at the airport, smooth ride to and from the hotel) The location could not be better! To the left is the beach, to the right is the main street, 5th Avenue. We enjoyed the lounging at the Zense (sp?) on their beach chairs. We also enjoyed the cafe past the Starbucks, I believe it's called Sasta, delicious bagels and coffee, much better than Starbucks. The bar kiddie corner from Starbucks was our favorite laid back, grab a night cap kind of a place. We also ate at Fridas a couple times down 5th avenue for lunch. Our dinner at Sur was the best service we had there. We also recommend a day trip to Tulum. It was super easy to catch a shared van/shuttle about 8 minute walk from Kinbe. We opted for a cab back which was about $40, but between 4 of us not bad at all. We explored the ruins and made our way to Playa Paraiso, which is beautiful. Thank you so much to Ian, Elena, Alejandro and the entire staff at Kinbe. You really made our lodging experience relaxing and comfortable. If we're ever back in Playa we'll be sure to stay with you again. Emily", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland", "Title": "“In Town and CLose to Everything”", "Author": "Estebon", "ReviewID": "UR125366190", "Content": "My trip started at a all inclusive at the Wyndham. After one day of soggy, tasteless food and beds that were so hard it was like sleeping on the floor we decided to move. The hotels policy was liberal and we didnt loose any money. That was nice. There was really not much evening atmoshere and since I was traveling with a old friend we were bored. Staying is town is the opposite as staying at an all inclusive. The people at the Kinbe are really great. They were laid back and local people. Although two of the people who worked there were Italian. Lots of Italians in PDC! Since my friend is a pilot we were offered the largest room with a second floor area with just enough room for a bed. The first floor area is small but it has a really great balcony. The beach is a one minute walk - maybe 150 feet. We bought some food at the restaurant on the right and stayed there all day. Its crowded buy great people watching. The other rooms are small, even for wuropean standards, like a college dorm room. But the large room was kind of cool. First street is up the road 150 feet as well, so you are in the middle of both primary activites downtown. This is a nice boutique hotel with character. Wi Fi is free but doesnt work so great. If you really need wifi then go up to the corner at Starbucks and pay some crazy money for a coffee, but the wifi is good. BTY 3 doors down from Starbucks is a local coffee place, half the price and excellent.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mpls", "Title": "“Hotel Kinbe--Playa del Carmen”", "Author": "nancyn34", "ReviewID": "UR123503105", "Content": "I actually stayed at this hotel January 2010. This hotel is a good value for the money you pay and is like a \"boutique\" style hotel. Since it's been 2 years since we stayed at this establishment, I'm sure that they may have done some renovations or improvements. The staff is very helpful, except there it seemed like there was no one on staff in the late hours of the night. It's a very modern looking hotel, there is no pool except for the pool that looks like it's only for looks near the lobby. The hotel is within 2 blocks walking distance to the public beach and you can get beach towels from the front desk. When we got there our room was not ready and they upgraded us to the Garden room. We did not like this room, the bathroom toilet wasn't flushing right, it had a very small flat screen tv, a futon, coffee table and the bedroom was upstairs because it was a loft style room. Not very convenient when you have to use the restroom and have to journey down some wooden stairs. We only stayed in the room one night and they put us in the Moody room. This room was nicer and more spacious. There is a rooftop that you can go to that has chairs and tables, but there is no pool and the view isn't that great. The hotel is in a great location blocks to the beach and the main area for shopping and restaurants. This hotel is a good value for the money that you pay for, which is for the location.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Thomas, Ontario, Canada", "Title": "“Love KINBE”", "Author": "Carrie D", "ReviewID": "UR123448343", "Content": "This was our second trip to Kinbe, we absolutely love this little gem! We love that the beach and main street are literally seconds away. My personal favorite spot at this hotel is the rooftop, it's perfect for sunning and watching the hustle bustle of the streets below. Our room was cleaned everyday and the air-conditioning worked extremely well, we woke up cold and had to turn it off a couple of times! The front desk guys are amazing, they helped us with all of our questions and even helped us out with our Spanish when we had questions. I would recommend this hotel to anyone, it is absolutely gorgeous!", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent Island, Maryland", "Title": "“Hard bed”", "Author": "kentmorrdave", "ReviewID": "UR123412863", "Content": "A very nice building. A new employee took us up 3 flights, over the roof, then down 2 flights to are room, # 29. Everything about the room was nice, except the hard bed. Close to all of 5th ave and the beach, and dive shops.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“Nice room, friendly service, excellent location!”", "Author": "NorthShore11", "ReviewID": "UR123132777", "Content": "We enjoyed our stay at Kinbe, and were very pleased with the hotel overall. Pros: location location location (right between 5av and the beach!), interesting design/decor, nice pool, quiet, big comfy bed, very clean, discounts at excellent beach club down the street, let us check in early when we arrived, and had great customer service. Cons: the snower was a little funky (not dirty, but the floor was made up of rocks which was unusual to stand on...). It isn't a swanky place, but still is really good value for the $100-ish you spend per night. We really enjoyed our stay and would definitely recommend the hotel to friends. I might suggest that my parents stay somewhere else since they prefer the high-end type of travel, but for us (no kids, still like to go out and party, not too much time spent in the room) it was perfect.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Spring Valley, California", "Title": "“Great location, Poor Showers”", "Author": "Vakas S", "ReviewID": "UR122947530", "Content": "We stayed here over New Years 2012. The hotel was clean and nice. The main complaint we had was that the shower had lots of fixture issues. The shower only pumped out cold water and it was hard to get a warm or hot shower. Also the shower water kept spilling out of the shower onto the bathroom and sprayed all over the sink and surrounding area. Inside the shower there all multiple wall mounted showerheads that either don't work or if they do only have a spray of cold water coming out. We also had phone issues. Our phone in the hotel room didn't work the first day. We requested a repair and it was fixed on the second day. But again that night our phone stopped working. The wifi is spotty at best and we had to request them to fix it on multiple occasions. There is no elevator so you have to climb up a few stories of stairs to get to your room. Carrying up our luggage was a hastle, although the front desk man did help carry a bag up. We asked to repair the showerheads and they did attempt to fix them but we still had cold/lukewarm water most days. There were no ocean views. Their is a manmade wall of water which was not turned on most days until around 8 pm or so. It usually was shut off around 10 pm. The AC is a wall unit that worked very well. The bathroom has a european style toilet built into the wall. It frequently would get clogged or require multiple flushes to work. The walls to the next rooms are close by and if you are trying to get rest in the morning you will be awoken from the slamming of the doors of the surrounding hotel rooms. The balcony is very unsafe as it is supported by a frail metal bar and wood pieces.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value, great location, great stay.”", "Author": "Wazdoggy", "ReviewID": "UR122745303", "Content": "We stayed at Hotel Kinbe for 3 nights between Christmas and New Year and really enjoyed our stay. The staff were very friendly and helpful and always up for a chat, and the room was comfortable without being overly luxurious. It was well priced (relatively speaking for this time of year) and good value for money especially given the fantastic location, just 50 metres or so from the beach, opposite a whole selection of dive shops and right by 5th Avenue. The in room airconditioner was excellent, and the pool looked nice (although we never used it as the beach is 50 metres away!). The only minor thing worth noting was that the water (and especially the hot water) in the shower in our room was only a trickle, not much pressure at all but we didn't really need a hot shower so we didn't bring it up until check out. Breakfast wasn't included but we used the discount vouchers (10% off etc) at the nearby beach clubs and put brekky towards our tab at the club to get a free chair. Oh one thing - we hadn't taken note when we booked and didn't know there was a rooftop terrace until I just read some trip advisor reviews now! No one at reception told us when we checked in and there were no signs or indications anywhere so make sure you check it out. We hope we will be able to visit Playa in the future and would definitely stay at Kinbe again.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“A good hotel”", "Author": "ishq-rose", "ReviewID": "UR122464804", "Content": "The hotel is striking in its appearance with minimalist furniture, its art, pool and set inside a jungle garden. It is attractive and therefore a calming place to stay. The staff on the whole were friendly and attentive and provided us with discount vouchers and local knowledge. Our room was fine, spotless and had a very comfortable king size bed, and the shower was excellent and always had hot water. We stayed for a week over Christmas and were not disappointed. It is well placed to explore everywhere and easy access to the ADO and collectivos to get you out of the bustle of Playa if required, or 50 metres from the beach and beach clubs for breakfast. My only gripe about the stay was our toiletries were not replaced every day and I had to request them a couple of times, which was inconvenient. I agree with the below reviewer if a hot tub was on the roof that would have been a bonus. However these are merely observations rather than complaints and we really enjoyed our stay at Kinbe in Playa - thank you.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“Nice hotel close to the beach”", "Author": "mayaruinsonly", "ReviewID": "UR121966979", "Content": "I've stayed here a few times in the past and have no complaints at all. I enjoy the closeness to the beach and the staff is always very nice and helpful.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Morelia, Mexico", "Title": "“Good enough, close to the beach but really bad internet.”", "Author": "mixmaak", "ReviewID": "UR121643385", "Content": "Everything was pretty ok in the room, very small room but clean and at a very good price. The place is really close to the beach, the only problem was the internet, very slow and sometimes there was no sign at all...", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oaxaca, Mexico", "Title": "“Great location, nice staff”", "Author": "zaachilalady", "ReviewID": "UR121318003", "Content": "Our room that overlooked the cascading pool was quiet and refreshing. Jan, the staff on duty, upgraded us to this room for just $6 US a day. When we needed to leave a day early due to a family member being ill, Jan worked this out for us. Loved the location, just off the beach and 5th Avenue. The room was a bit small for a business traveler (I was working on a project), but for those coming just to vacation, it was lovely and comfortable.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Nice small hotel, great location for Playa del Carmen”", "Author": "checo", "ReviewID": "UR120995618", "Content": "Small hotel, nice rooms just what you need nothing more, good quiality. I think we paid less than $120 per night, not bad for what you get. Pool & includes access to near beach club. Nice place to sleep, one block away from 5th ave @ Starbucks corner.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oakland, CA", "Title": "“Don't be taken in by the coolness”", "Author": "Klipzlskim", "ReviewID": "UR120684893", "Content": "This hotel was very disappointing. It looked cool in the photos, and it does in person too, but the rooms are not nearly as nice as the lobby. Our room was tiny, it smelled bad (something emanating from the shower drain), and there was no peace at all. There were a lot of partiers staying there, who stumbled loudly up the stairs late at night, and then stumbled loudly down the stairs early in the morning to catch a cab to the airport. We could also hear music and shouting from the local clubs. There’s also no parking anywhere nearby unless you get super lucky. On the plus side, it’s a block and a half from the beach and the price wasn’t bad.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toulouse, France", "Title": "“Very good hotel in great location in downtown Playa!”", "Author": "Olaf T", "ReviewID": "UR119723629", "Content": "Very nice hotel downtown! Close to beach – just a 30 seconds walk away. I booked this hotel online not knowing what I will have, but I was pleasantly surprised. I went for a Moody room with balcony and so the room assigned to me was not big, but enough and had a nice view to the beautiful garden! Kinbe is a lovely hotel just a 2 minutes walk from the restaurants, markets and nightlife. Still good protected against the noise during the night. Staff were super friendly/helpful and my room was clean all the time. The hotel has a small pool with waterfall although I didn't use it as the beach was so close. ;-) The free WIFI was great as well. Take the breakfast voucher, as you will have the pleasure to take it in an Beach Resort close to the Kinbe – I really recommend this for a good start in your day!! I will come back to the Kinbe… of course!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wixom, Michigan", "Title": "“First time at Kinbe Hotel”", "Author": "Steadman3", "ReviewID": "UR119174995", "Content": "Extremely nice hotel in Playa Del Carmen. My wife, my daughter and I stay there for 3 nights. We had a \"Garden\" room that had, a king size bed upstairs in the loft, a fold out bed in the lower level, and a small balcony, that was perfect for those chill out times. Courtyard, ground are extremely relaxing. The staff was very attentive and friendly. The beach was 3 minutes away and the mamin drag 5th Ave, is 30 yards in the opposite direction. The negative comments we have are, there should be a full lenth mirror somewhere in the room, and anothte light for the lower level. As others have said, this is a cute, yet perfect hotel for Playa Del Carmen vistors. Oh and yes...we will be back!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely hotel and lovely staff”", "Author": "ginsberg300", "ReviewID": "UR118373195", "Content": "Lovely quirky hotel. We stayed in one of the new rooms overlooking the pool and would recommend this place to anyone. The room was very modern with a nice balcony containing wooden patio furniture. The bathroom had a fantastic shower with 5 jets and really nice toiletries. The beach is 2 minutes round the corner and Alex on reception was very friendly and helpful. If you’re looking for a trendy hotel with a personality I would book into Hotel Kinbe", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great Hotel.”", "Author": "Hanswijk", "ReviewID": "UR118105527", "Content": "Great hotel at 50m of the Beach. We stayed here 5 years ago and it's a perfect place to stay when you are in Playa. Rooms and hotel are nicely decorated", "Date": "September 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“WOW!!! Stay here! Its the best!”", "Author": "mayecontreras", "ReviewID": "UR117814504", "Content": "I read about this hotel in the Lonely Planet : Mayan Riviera, I went directly to it once arriving from Tulum and the treatment was excelent! Top reasons to stay: 1. Location: the best beaches, restaurants and 5th Avenue 2. Rooms: clean, excelent shower with cryspy clean water, perfect minibar. 3. Price: the price was very accesable for this classy hotel. Do yourself a favor and stay here! The staff is very nice!", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Berne", "Title": "“Very good hotel”", "Author": "Marie_Line_8", "ReviewID": "UR117811508", "Content": "Cool hotel with very nice pool and garden. Only the breakfast place is a bit far away and the person at the front desk doing the checkout was not as friendly as the other staff members (calling somebody to check the minibar in front of us, e.g.).", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“peace”", "Author": "luciano_frezza", "ReviewID": "UR117458458", "Content": "a hotel where feel the peace on the skin......the kindness is not an optional", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Love it, so close to everything!!!! And right across from the best diving:)”", "Author": "RozanneWhyte", "ReviewID": "UR117245148", "Content": "Right next to the beach literallt a few steps out the door to the left and to the right is the main shopping strip. Everything is close. The people are great, the smiles are infectious. We loved the crystal clear diving and Jorge at Scuba Playa across the road made everyday a pleasure:) Thanks for a great stay and we will definitely be back!!!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great location and super friendly staff.”", "Author": "erin b", "ReviewID": "UR117080106", "Content": "We stayed in the garden loft and it was beautiful. The lush landscape made it easy for us to leave everything behind and soak all the beauty Mexico has to offer. Staff was super friendly and got us great deals on snorkeling and traveling to other tourist attractions close by. The location was the best- right in between the beach and 5th ave (where all the shop and restaurants are located). It was also nice to have10% off at Zenzi and be able to go down to the Beach Club for a day of daiquiris and sun bathing- plus their food is amazing! The best part of Kinbe has to be the pool, the perfect shady spot to lounge when you need a break from the sun!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Clean hotel, great location, loved it.”", "Author": "Sophie S", "ReviewID": "UR117070235", "Content": "Went travelling with a friend in July 2011. Planned on staying a week in Playa before travelling Mexico for 2 weeks. We had a great stay here, the rooms were small but clean and nice, the staff were very helpful and friendly. The rooms are all set around a garden which gets daily upkeep. Nice roof terrace. No breakfast included, but they offer discounts at beach bars about 5 minutes walk away. The location was perfect, about 50metres from the beach and on the next block to all the bars and clubs and restaurants. There is a great little restaurant right next to the hotel which is cheap, and even though it is near the bars it is very nice. Air conditioning was a plus. Would definitely stay here again.", "Date": "August 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice stay!”", "Author": "Mhenr", "ReviewID": "UR116962563", "Content": "We stayed at Hotel Kinbe early this month for 2 nights. It's very nicely decorated with wooden stairs, a lovely pool and a great balcony. There was some noise on the first night from nearby bars / clubs but that's to be expected given the hotel's convenient location. Right near the beach too!! An upgrade to a room with balcony as it was our honeymoon was a very nice touch, especially as we didn't request it.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Naples, Italy", "Title": "“We liked it”", "Author": "sbollo", "ReviewID": "UR116959938", "Content": "it is a pleasant place to stay at but rooms are quite small or at least ours was small. Do not know how many times hit my head against the tv. Plus but this is a policy other hotels in Mexico adopted and I personally found pretty unfair, you cannot pay the reservation on line before your arrival but are obligated to pay once you get there at the hotel rate which is usually disadvantageous compared to the current rate. Therefore I would suggest to the Kinbe Hotel starting accepting online payments.", "Date": "August 19, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Really nice hotel, and excellent service.”", "Author": "murking", "ReviewID": "UR116727904", "Content": "It has a unique and great decoration, the pool is beautiful and the location couldn't be better: one block away from the 5ta, and one away from the beach.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kalamazoo, Michigan", "Title": "“Great location!”", "Author": "saschlueter", "ReviewID": "UR116581635", "Content": "Smaller hotel with great loccation. Staff was friendly, roof top patio and pool nice. We stayed on the Tierra side on the second floor with our own balcony over looking the garden. Would definately return there.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“in reply to: \"There is a Pattern here... RIP OFF\"”", "Author": "SpanishGlobetrotter", "ReviewID": "UR116176300", "Content": "Really I was shocked about this comment!! I’ve been at the Kinbé several times in last 2 years and these people seem speaking about another hotel. I’m a traveler and rarely I found anywhere the excellent service provide me by the Kinbe’s staff; the front desk were very personable, friendly, helpful and amusing. They gave plenty of suggestions and tips about everything and all the time these suggestions were correct and overall totally honest. I guess a great staff comes only from a great management; everyone working here was pleasant and helpful, rooms always clean and well maintained. So I can’t understand where these undeserved words come from. Be aware before pass unfair judgments based on your personal issues. I strongly recommend the hotel Kinbé…. And I can't wait to see you on December guys!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Very nice boutique.”", "Author": "JGRToronto", "ReviewID": "UR115857743", "Content": "Small rooms, but great location and very nice staff. Nothing fancy, but nice vibe.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“The good, the bad and the ugly”", "Author": "DoodlePhilip", "ReviewID": "UR115284869", "Content": "The staff was pleasant and courteous. The location was a half block from the beach. The room was decent. When it came to check out time though, we were overcharged for the room. The clerk charged us one rate at the hotel, but when we returned home, my credit card statement showed the bill to be higher. I called the hotel to ask why and they didn't have an answer. I wrote the manager an email for an explanation, and I never received a reply. Overall, our trip was amazing, but being taken for more money than promised, left a bad taste in our mouths. Plenty of hotels to choose from in that area and pleasantly surprised to see that there were lots of vacancies, even in July.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Portland, Maine", "Title": "“A perfect retreat.”", "Author": "Chrisn123", "ReviewID": "UR114804896", "Content": "This hotel is unique, cozy, and just steps from a gorgeous beach and attentive beach bars/restaurants. Michelle at Zenzi is the sweetest hostess on the planet. My heart was heavy when I had to say goodbye to the staff. I'm sure everyone falls in love with Jan and his charm, Alex was a little harder to get close to and what a sweetheart he turned out to be, Andreas is just plain adorable. I hope they know what an important part they played in contributing to a wonderful vacation for me. All the staff there is terrific. On a small sidestreet, but just a few steps from '5th avenue', Kinbe is one of the best locations. I like to get to know a place intimately when I travel, so I'm not into the all-inclusive resorts. This hotel offers a nice place to stay with style and personality. I stayed in a Moody room which is on the 'earth side' nestled in a lush garden with a beautiful path leading to rustic stairs. The description they use is accurate, it has a treehouse feel. Not for people who need to use an elevator. No balcony and not much light in my room, # 7, which is perfect for me. I use my room to rest and sleep, the remainder of my time is spent on the beach or exploring adventures in food, music, salsa dancing, and pathways to more quiet beaches and cenotes! The shower is rough on the feet as it's made with natural stones, something I got used to easily. No shelves in the shower but I used the sink nearby to hold my shampoo, soap, etc. I woke up fairly early as there are some very vocal birds living in those beautful trees. But even that added to the charm and character of the Kinbe hotel. The other side of Kinbe is 'water'. The rooms are more modern and are near the pool and waterfall-type wall. It's very pretty. Staying here added to my adventure in such a wonderful way. It's my first excursion where I was truly traveling alone. I felt safe and comfortable.Part of my heart will be at the Kinbe hotel forever. :)", "Date": "June 27, 2011"}, {"Ratings": {"Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cary, North Carolina", "Title": "“Ideal place to stay in Playa del Carmen”", "Author": "carytourist", "ReviewID": "UR111369301", "Content": "We had a great stay in Hotel Kinbe. There's a nice garden courtyard. You can get a breakfast buffet on the beach. The staff was friendly and can recommend restaurants for you. The rooms are nice, cozy, and clean. The hotel has a unique personality. It's quiet at night and very convenient to everything. It's just a block off of 5th Avenue and easy walking distance to bus stations and the ferry to Cozumel. If you need a taxi, they're lined up across the street. I highly recommend the hotel and would definitely stay there again.", "Date": "June 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Irapuato, Mexico", "Title": "“EXCELENT HOTEL, GOOD PRICE, CLEAN AND WELL LOCATED AT”", "Author": "autosdeeuropa", "ReviewID": "UR111317311", "Content": "This hotel was the best option for our honeymoon... In resume: Very clean Nice bedrooms Personal treatment of the owner's. Private for honeymooners Excellent located to bars and 5th avenue attractions. Excellent restaurants for breakfast. Honestly the best option in Playa del Carmen.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kaneohe, Hawaii", "Title": "“Stay here!!!”", "Author": "zendiscordia", "ReviewID": "UR107558043", "Content": "The Kinbe was an amazing hotel and after the ruggedness of the Azucar in Tulum it was nice to check into an upscale trendy spot with all the amenities. The only reason I didn't give this hotel an \"excellent\" was its check in policy. Throughout our Mexico trip most accommodations were able to work with us if we showed up a bit early ... not the Kinbe... check in is at 3pm (1500) NO EXCEPTIONS ... even at 2:47 we were unable to get our room. So ... great hotel, amazing location ... arrival time ~ plan wisely (though they will hold your luggage in the main area until check in time). .. also, there is no onsite parking .... you pull your car up and unload your bags and then use the pay garage (170 pesos per day) or roll the dice on finding something legal in the street.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leon, Mexico", "Title": "“Elegant and contemporary”", "Author": "MelaLoaiza", "ReviewID": "UR107543465", "Content": "Close to the beacj and 5th ave, clean, freat service and contemporary design, even though rooms are small it has all that you need to get back from a long day at the beach or an all night party", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Quaint Hotel”", "Author": "Lillonis", "ReviewID": "UR106879266", "Content": "Pretty boutique hotel convenient to the beach, restaurants and shopping. The staff was friendly, the room was clean. We opted for one of the loft rooms which afforded the most privacy and a pretty view of the garden.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Such a great place”", "Author": "churchwell", "ReviewID": "UR106021375", "Content": "We booked this hotel online not knowing what we would find but were pleasantly surprised. We went for inexpensive/the cheapest room and so the room we were assigned was not all that big and had a view of the garden, which was beautiful. But then I saw that the door to the room next door was open. It was on the third floor and had a balcony. I walked out on to the balcony and the view was breath-taking. This room not only had a balcony, but a spiral staircase up to a second level with a king-size bed. It was available and we were able to upgrade for just a small amount more. The guys at the reception desk were so helpful and friendly I felt like we had made friends for life. The pool isn't big, but quite unique and beautiful. We were a block from the beach and a block form the pedestrian/shopping street. I could not have asked for a better first impression of Playa!!!", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good hotel. Close to beach. Quiet.”", "Author": "Alexmc12", "ReviewID": "UR105152698", "Content": "Nice hotel. Close to beach - 30 seconds walk. Great pool which others look at with envy. Rooms are small and basic, but air con works well and fridge comes in handy. Friendly staff. No restaurant, but many close by", "Date": "April 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "oklahoma", "Title": "“Failure to honor quoted rate”", "Author": "oologah", "ReviewID": "UR104314291", "Content": "After seeing our room we decided to upgrade to a larger room. We were told one rate for the room we chose, but charged another when we went to check out. I had read in reviews that some of the rooms were small, but they are TINY. We ended up in a loft room (18) with stairs that were unsafe. The tread depth was not consistent or safe, if there were building codes enforced in Playa this room would not have a loft. The room has a television which is difficult to watch downstairs or upstairs. The room furnishings were sparse and simple. After staying at the Kinbe, I can definitely say that the three rooms I saw were over priced compared to the other hotels I have stayed at in Playa over the years. My brother and sister-in-laws were booked up the street one block away and had a larger and better furnished room for about $35 a night cheaper.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“Great location, great price, cute hotel”", "Author": "littlebunny76", "ReviewID": "UR103558617", "Content": "Hotel Kinbe is a cute boutique hotel. Well decorated with great ambiance a cool waterfall pool and an upscale swiss family robinson vibe. Location: great, right off 5th avenue, but not too noisy. Walk out the lobby and view the gorgeous ocean. Rooms: a little small with not many places to put your things, but comfy and very cute. Staff: Jan was awesome and really helpful when we came in late at night and tired from getting lost on the way home from Chichen Itza. He also suggested great places to eat and helped us find a place for our rental car until we could return it the next morning. Overall, a really cute chic hotel with great ambiance, location and staff. Would stay here again in a heartbeat!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Amazing!”", "Author": "dclmoney", "ReviewID": "UR102640823", "Content": "This place was easy to find taking the bus from Cancun and arriving at the station on Avenida Cinco. It's right off the main street, so maybe a little removed from the nightclub music at night, but a few nights the bass was thumping in the early morning. It was perfectly cute for my girlfriend and I-- small, simply cool designed room, charming garden courtyard and chic pool & waterfall area, and sunny roof area great for reading a book, taking a nap and enjoying views of town and the ocean. It's about two blocks from the beach. The best part were the staff, Andrea and Alejandro, who both alternated shifts and helped make our trip amazing. They were extremely friendly and willing to offer advice on places to eat and things to do, providing us a terrific taxi (Ivan) who we used the whole trip and just who we looked forward to seeing everytime we returned to the boutique hotel from a day of adventure in and around Playa and the Yucatan region.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“really relaxing place”", "Author": "pabloManchester", "ReviewID": "UR101431007", "Content": "Kinbe is lovely, the rooms are good, we had two different rooms on different nights, the ambience is great, ditto the location. The staff are unobtrusive but always around to help. there's great places to eat just nearby, the beach is really close and the pool is such an asset. watch out for grackles bathing at the top of the wall next to the pool and splashing you! We'll make it our stop off point in playa from now on. John and veronica", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location”", "Author": "Ana_Carol_Barreto", "ReviewID": "UR101264310", "Content": "The hotel is very well decorated and the staff is very friendly. Another big plus is the location: few minutes from the beach and the main street in Playa del Carmen (5a avenida). There are 2 main areas in the hotel representing water (where the swimming pool is) and earth (the garden, with beautiful plants). Also, the terrace is a great place to spend the end of the afternoon if you are tired. The rooms are very quiet and we had no trouble sleeping; there is a night club tight behind the hotel but we would not have noticed it if we have not walked around the hotel. Our room was a bit small but it doesn’t matter as I believe nobody would spend the day in the room in a place like Playa del Carmen. An additional note, avoid the restaurants in the 5a avenida. Although they are very well decorated, it can be very tourist and overpriced (and the bill always comes wrong – for more, obviously!!). The hotel would give you nice tips for good places to go (and they are not commissioned for that, the tips are truly genuine!!) If I needed to point something negative about the hotel, I would highlight that the prices for the rooms does not include tax of 14% (as most of the businesses in Playa) so when we came to pay the bill the price was higher than what we were expecting initially. I also recommend to do the payment in dollars rather than in Mexican pesos as the exchange rate used by the hotel can be disadvantageous (again, as most of the businesses in Playa).", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice hotel with good service”", "Author": "Mikaelgustafsson", "ReviewID": "UR100635312", "Content": "We stayed in Kinbe for our 11 day diving holiday in Playa Del Carmen. Apart for some minor situation with the toilet not flushing (taken care of immediately)we had no problems whatsoever. The staff are nice and helped us with whatever questions we had. The nearby night club played music quite loud, but it was nothing too serious.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kittery Point, Maine", "Title": "“Nice modern flare in a great location”", "Author": "drumpoint2003", "ReviewID": "UR100522014", "Content": "This is a nice safe hotel right in the middle of the action of downtown playa. The building is quiet and you check in at the front desk every time in and out. This is great because one does not need carry the key anywhere and the Kinbe staff can keep track of who is in building. The staff are friendly and helpful. Although, it would have been nice have had someone give us a list of good tour operators. There is one right across the street they use and we did not even know it.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“great place - great location!”", "Author": "tportela74", "ReviewID": "UR98965198", "Content": "Very friendly staff - remember you every time. clean hotel, great spot - very close to beach. will stay again!", "Date": "March 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Niles, M", "Title": "“Hidden gem!”", "Author": "kebrews", "ReviewID": "UR98822611", "Content": "We just returned from a 7 day stay, the hotel and staff were great! Garden room was small but staff kept it and property spotless. Jan and the other desk staff were friendly, helpful and concerned about a medical issue I was experiencing. Hotel is very accessible to 5th Avenue and the beach. We will definetly stay there again. Other reviews noted noise from 5th Avenue, we heard none and we were there over a weekend. We were very sorry to leave.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“The Hotel Kinbe was a lot of fun.”", "Author": "DavidA51", "ReviewID": "UR98005692", "Content": "The staff at Hotel Kinbe is perfect. Really nice people who speak many languages well, are very friendly and helpful. My room was small but sweet and had everything I needed. The roof terrace is a nice in the morning to read and have coffee or take a glass of wine in the evening. 1/2 block to the beach. The atmosphere is sort of mod-tropical-Italian-chic. A charming and satisfying stay. Thanks Elena and Jan.", "Date": "February 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "4"}, "AuthorLocation": "Snyder, Texas", "Title": "“beware - reservations not honored”", "Author": "Hendrika9", "ReviewID": "UR97623386", "Content": "I was very unhappy with my 'almost' stay at this hotel. We had revervations since October. We got there early morning from Cozumel. They said the room was not ready yet, and offered to hold our lugguge while we went out for the day. We returned about 4PM and they told us they overbooked and did not have a room for us at all! I can't believe that they stored our bags and suddenly the room that was not ready was now not available at all. This is really poor business! After we complained, they offered us a single room with one bed. As mature women who reserved a room with two double beds, we could not accept this. They offered to find another hotel for us only after we said that this was not acceptable. They found a room at a very old, old hotel nearby. It was so very noisy. We tried two rooms there and could not find quiet. We had no choice but to stay at the alternate hotel. I will never trust a reservation at the Kinbe.again.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Location is awesome, but ...”", "Author": "Kletka", "ReviewID": "UR97047074", "Content": "When we arrived to Kinbe, the clerk at the reception desk made us face the fact that in the middle of our stay we would get an upgrade (free of charge) and will have to change the room. It is never fun for me to pack and unpack things, but to do it on vacation seemed totally nightmarish. Still, we decided to be nice and agreed. Here I should warn you: never agree for an upgrade especially if your stay is short, even if they promise to move you to their best room. There is no guarantee that you will get the room you were initially offered (it actually happened to us, although I don't complain as the room they finally placed us to was nice and pretty), but the most important thing - you will be \"roomless\" for about a half of the day. They asked us to move out before 12 PM and put our things next to their reception desk and let us move in after 3 PM. We had no place even to change our clothes after the beach. Not the best situation for people on vacations!!! Our first room was very small but nice. It was overlooking their luscious and very beautiful garden. The only thing which bothered me there was the dampness of the room's air, and as a consequence, of our bedlinen and clothing. You will never have a chance to get your towels and swimsuits dry there. The second room boasted awesome private balcony with lovely view. I liked it very much. But... There was no hot water in the shower. We informed receptionist about the problem and he promised us to take care of that. However, the next day we were forced to take cold shower again. I don't think it is appropriate for the self-respecting hotel to have it's guest to freeze under the cold water. Unfortunately, the problem was never fixed. I cannot complain about the noise. We did not hear anything during the night. The hotel's location is great, it is close to everything. So, as you can see, I have quite mixed impressions of this hotel. I has some advantages and downsides. I would probably recommend this place to others but mainly due to it's location and nice outlook. The service, however, requires significant improvement.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great room, location and service”", "Author": "akataylor", "ReviewID": "UR96659045", "Content": "Stayed in Playa del Carmen with my Girlfriend and travelled with 2 of my best friends, stayed a week in Playa from the 4th til the 11th. Very close to beach, 5th ave strip of shops, nightclub district. Charming hotel with great feel to it and nice big rooms and good facilities (my friends and I stayed in the mini-suite rooms), views of the beach and large balconies too. Very helpful when my girlfriend became sick, organised a doctor for us and even posted our postcards for us because the post office was far away! Always remembered which room we were staying in as we came and left the hotel. It got a little loud at night sometimes, but that's to be expected with our windows open near the main street. Really great stay here, our favourite of our whole Mexican trip. Thanks!", "Date": "February 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gabriola Island, Canada", "Title": "“Great location - close to the main street and close to the beach”", "Author": "bickbea", "ReviewID": "UR95978008", "Content": "We stayed in the new section which is considerable better than the \"garden\" section - which rooms were very small and dark. We had booked and wanted to be on the ground floor as my hasband is handicapped. After much discussion we received a room in the new section for a higher price of course - there is no handicap access to this hotel - three stairs off the street level - we managed although the reception clerk was not very helpful. Other than the reception clerk and the manager, the other staff was very helpful. The room was large and well maintained. The best thing about this hotel was it's location - half block to the beach and half block to the main avenue \"5th\". Security was good at the hotel with 24 hr. staff on.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York, USA", "Title": "“Its all about location”", "Author": "akoti", "ReviewID": "UR95951701", "Content": "This is a small boutique hotel in the middle of all the action. The pretty room is small, so it can be tight, we managed since we were not there to sit in our room. Starbucks is down the block, plenty of street parking, beautiful gym is 2 blocks away that is only $5 day pass with hotel discount (offers yoga 4x per day). Beach is 50 yrds away with 10% hotel discount to the beach club ($20 for 2 chairs and umbrella $45 for 1hr couples massage) which you can pay or just spend that amount for lunch and chairs are free. I would not eat on 5th ave as prices are comparable to NYC for subpar food. Go to 10th ave or side streets for better food and great little bar on the corner of 5th and and a martini bar around the corner toward the beach which is always packed. We did bring ear plugs just incase based on reviews and we did hear some music Sat night, but otherwise it was quiet.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“swiss family robinson type hotel close to the beach”", "Author": "danabulous", "ReviewID": "UR94535197", "Content": "I stayed at hotel Kinbe for four nights out of my five night stay in Playa del Carmen. It was my first time to this part of Mexico and I wanted to do Playa and not Cancun to avoid the huge resorts and tourist traps. PDC is still touristy, but smaller and fun. The hotel is literally 1 block from the beach. It has a nice lobby and open in the middle (motel style) with a jungle type garden. It was beautiful. We were greeted by the owner who spoke perfect english and was very excited to have us there. Our room was on the small side, but personally, I don't spend a lot of time in hotel rooms on holiday. The air conditioning worked and we had big windows open to the jungle garden on the second floor. The bathroom was rustic with spanish tile but updated amenities. There was also a small pool with a giant fountain wall, which was nice after a long day on a hot sandy beach. One night we grab some beers from our room and sat up on the roof deck, you can hear to ocean and the other PDC night sounds. Most people like resorts because they have deals where you sit on their part of the beach. However, the block that Hotel Kinbe is on has a restaurant right down the street on the beach. I think it started with a \"Z\" but it was great. We could sit there all day, order beers, food and without much hassle. They also had umbrellas, which you will need because the sun is intense. It was a great hotel and the price cannot be beat esp. if you're on a budget! Enjoy!", "Date": "January 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great location, nice decor but...”", "Author": "NickMtl", "ReviewID": "UR93885541", "Content": "2 comments about the hotel: -Wireless internet is only available in some areas (eg.: reception). It didn't work in our room. -While the hotel advertises its rates in US$, payment will be made in pesos. Also, during check in, the front desk staff indicated the conversion rate would be 12 pesos = US$1, we ended getting 13 pesos = US$1. The official exchange rate barely changed in the meantime so that was disappointing and made a substantial difference.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“great location trendy look”", "Author": "fradrip", "ReviewID": "UR93434250", "Content": "love this place the best of all in playa. great lobby and very very helpful staff. location was dead smack in the center and i would return in a heart beat", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "", "Title": "“Nice place”", "Author": "Gavontheweb", "ReviewID": "UR93379877", "Content": "Nice hotel, very helpful with all our needs. However I would warn against going to Playa del Carmen if you want something quieter. To be fair we should have read more about the town but we were just passing through and much preferred quiet Tulum down the road.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cannock", "Title": "“Good short stay hotel”", "Author": "AndrewHampton", "ReviewID": "UR92685230", "Content": "I stayed at Kinbe Hotel in April 2010 for 5 days, I was attending my Niece's wedding. My room was on the first floor accessed through a garden and up some stairs (Not ideal for invalid or wheelchair customers) I was a little dubious when I arrived late evening in the pouring rain as it was my first time in Mexico, the receptionist was friendly, efficient and informative and upon reaching my room my initial fears were dismissed. The room was average size, large bed,everything working (inc. efficient wi-fi) and quite comfortable. Bathroom was small but nicely designed with shower only and very clean, the lack of a bath tub was no concern to me. The hotel is approx. 75m from the beach and similar distance to 5th Avenue which is the main shopping street and centre of all activities daytime and night time in Playa Del Carmen. Taxi ranks are very close and the bus station is a 5-10 minute walk down 5th. Avenue. With the beach and nightlife being so close I can understand concerns about noise but I never encountered problems of this nature. I was pleased with my choice for this short stay although I thought the price was high, it was my first experience of a Mexican holiday resort so I have no previous knowledge of hotel prices in this country. I would use Hotel Kinbe again without hesitation but it is not ideal for a lengthy stay in this busy but very pleasant resort.", "Date": "January 12, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Austin, Texas", "Title": "“Good downtown location, close to the beach.”", "Author": "Nate_0978", "ReviewID": "UR90437807", "Content": "If you're looking to stay right off 5th, and don't mind a little late night music from the beach parties, then this is a steal. Our room was nice and clean, the staff were cool, and you can't beat the location. Great find!", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Great Hotel in a Great Location”", "Author": "pinstripesdumbo", "ReviewID": "UR90254728", "Content": "I really liked this hotel. It's off the main street, but not too close to the craziness. It also is right next to the beach, so my boyfriend and I would walk right out of the hotel and be at the beach in two minutes. The staff was super nice and were very accomadting to us. The rooms were smaller than I thought it would be, but there was a huge bed in the room. Plus, we were out on the beach or doing tours all day that we didn't have an issue with it at all. I will say that we could hear the parties from the beach and on 5th avenue at night; however, you should expect the noise if you're staying off the main street. I would stay here again!", "Date": "December 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“Nice hotel, but noisy”", "Author": "I&P-7", "ReviewID": "UR89948319", "Content": "I stayed at Kinbe seven years ago and liked it very much, so I was looking forward to return for two nights. The staff was partially the same and friendly. We stayed at the new part (room 28 Rugiada). Very trendy and nice. Wifi was good as well. One big con is how noisy the new part is. They have a kind of metal layer on the stairs and if you walk on them, it makes a lot of noise. Most people come to party in Playa and will come home late during the night. We woke up because of that and because they started to play music in their room at 4 am. I asked them to be more silent, which had no effect. Then the guard came. That had effect until he left. Very childish. I used earplugs, but that would not help enough. Can't blame Kinbe for their guests, but it was too bad that the people were so selfish. Was glad I did not have to go diving the next morning, as I would have been very tired. I am not sure whether I would stay here again because of the bad isolation. Location is great in Playa. I was quite shocked how much Playa has changed in the last years in a bad way. It is turning/already turned into a new Cancun.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "croydon", "Title": "“Great location, modern design and friendly staff”", "Author": "croydondweller", "ReviewID": "UR89190364", "Content": "Myself and my wife stayed at Kinbe for the last week of a 3-week trip around Mexico, booked on the internet. Playa del Carmen is not as big as it first appears and the hotel is just off 5th Avenue (the main street for shopping and eating) and just minutes from the lovely beach. It's also walking distance from the bus station as long as you don't have too much luggage. Design is a combination of traditional stucco, with modern touches on a clean background, at least the rooms around the swimming pool, but there are also 'garden' rooms overlooking a lush, green, shaded area, which are not quite so modern - make sure you know which you're getting. The modern rooms all have flat screen TVs, aircon, balconies and bathrooms with huge walk-in showers. Swimming pool is on the cool side, but prob perfect in the heat of the summer and the roof terraces offer splendid views over both ocean and town. The hotel is owned by Italians, some of the staff are Italian, some Mexican, but all are very helpful and will advise on restaurants, shopping and help to arrange trips, if you're interested. Most of the hotels in Playa don't offer breakfast, but there is no shortage of places to eat on 5th Avenue. The only negative for us was the nightclubs located a block down from the hotel; a couple of nights the music was really pounding and woke us up during the night, but Playa is a party town, so you can't really complain! Also, the wifi is patchy at best, but you're not there to surf the internet are you? Highly recommended.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Awesome experience!”", "Author": "packan13", "ReviewID": "UR88275325", "Content": "Me and my friend stayed at the Kinbe for one week and it was awesome! They gave us a free upgrade to their best room upon arriving. We had a king size bed, a walk in shower and a balcony overlooking the indoor pool. The room was spotless and the customer service was excellent. Although the hotel is just around the corner from the busy 5th Ave and the beach (and beach clubs) our room was super quiet. I will definitely book this hotel again for my next Playa trip, I highly recommend it to anyone!", "Date": "November 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Cool place in an awesome location”", "Author": "RoaryCat", "ReviewID": "UR85967121", "Content": "less than a half block off of the midway point of 5th Avenue and 500 meters to the beach, the location of Hotel Kinbe could not be better. Very good service, beautiful grounds on the right side of the hotel, Tierra Kaab (lush rain forest like area, where our room was - my wife said it was like a treehouse!) and the left side, Agua Ha had the pool, waterfall and had a more trendy vibe. The room we had (\"Pretty\") was small but we spent very little time there nayway and didn't even think about turning on the TV - why would we?? The room was simply decorated, tile floors, and came with a mini fridge and safe. The bathroom was small but nice - good water pressure and hot water from the shower. Wireless access was spotty but more of the time I was able to get on with my iPad. All of this for only $45 + tax per night! One thing - not an issue for us but maybe for some is that you leave your room key with the front desk every time you leave. I didn't care but some might.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“Mixed Emperience...”", "Author": "travelandunravel", "ReviewID": "UR85772330", "Content": "Our experience at the Kinbe was mixed. In some aspects, it was wonderful-beautiful space, interesting room, very friendly staff. However, our room was quite dark, didn't have enough natural or artificial light and the bathroom shower was made from large pebbles-VERY UNCOMFORTABLE. I loved the hotel roof deck-but didn't know they had one until my third day in. I discovered it on my own. I also wasn't told about the deal with Wicky's beach club-I learned about it after reading reviews here-we hiked down to the Kool Klub on 26th North (FANTASTIC!) I would recommend Kinbe with caution-I did find the hotel EXTREMELY quiet, the staff very friendly, the rooms clean BUT in serious need of a functional makeover.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Don't bother to look any further...pick Kinbe!!!”", "Author": "Dutchgirl1", "ReviewID": "UR82728693", "Content": "Kinbe is a very cute and stylish boutique hotel.The Location couldn't be any better!!!The (beautiful!) beach is a 1 minute walk and so are the shops on 5th avenue.Literally...1 minute!The nightlife is just around the corner, but when you decide to have an early sleep you won't hear the noise at all! The staff is very friendly and the rooms are cosy and super clean! I travel around the world a lot...but really fell in love with Playa del Carmen.Will definitely stay again at Kinbe!", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“cute, clean, friendly and perfect location”", "Author": "rebecca063", "ReviewID": "UR78793001", "Content": "My girlfriend and I went to Playa Del Carmen for a week and decided to stay at Kinbe, as the pictures on line were so trendy and fun. We took a $9 bus ride into playa from the airport and walked to our hotel within 7 min. The hotel is adorable. The rooms are small, with basic needs met (my room had a dbl bed, small expensive mini bar and cute basic bathroom and an adorable small wardrobe) and linens were nice and colourful... over all very cute and artsy. The gardens are tropical and really pretty and pool area small but quaint. The hotel has a cool top deck were you can sun tan or just hang out...nice area to enjoy a cold beer! Staff were incredible, especially 'Limbert' he worked night shifts, so helpful, professional and welcoming! The hotel is located right in the heart of EVERYTHING... (everything is all from 1-10min walking distance ) beach 1 min walk, high and low end restaurants, star bucks, really good ice-cream parlours, low and high end shopping and you can walk on the main strip/streets at all times of the night, as there is security everywhere for tourists!", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Haven in Mexico”", "Author": "Thaproban", "ReviewID": "UR76916242", "Content": "The hotel is very nice and cosy, specially the staff were very caring and friendly. The rooms had real character, comfortable. The food was good and we ate from the hotel most of our meals. Overall it was a great holiday.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fredrikstad, Norway", "Title": "“Fantastic, friendly staff & great location”", "Author": "chris_ax76", "ReviewID": "UR73364880", "Content": "We stayed at Kinbe for the first 6 days of our summer holiday in Mexico in July 2010. After some online research for a mid-range, conveniently located hotel in Playa del Carmen, we decided Kinbe was the best fit for us - and it did not disappoint! Apart from one evening when the water supply to the hotel was temporarily halted (during which the hotel staff were very helpful and informative), the stay went without any problems whatsoever. The rooms are basic, but cosy & clean. Everything you need is on-hand and you only need to ask the super-helpful and friendly staff for anything else. You are located just a 2 minute walk from the lovely beach and less than a minute from the busy 5th Avenue - close enough to be convenient, yet far enough away to feel relaxed. The air conditioning unit in the room was a bit noisy, but completely effective. Take some earplugs if you are a light sleeper (worked just fine for me)! Overall, Kinbe exceeded expectation and we would definitely go back. The Staff were undoubtedly the highlight for us!", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Kinbe! Best boutique hotel in Playa!”", "Author": "AlisonBr", "ReviewID": "UR72159820", "Content": "My husband and I just went to Playa for our 1 year wedding anniversary. We have stayed at several of the boutique hotels in town, and this has been our favorite!!! Kinbe is beautifully maintained, and the rooms are small but comfortable, always clean, and simply yet sophisticatedly decorated. Our friends rented room #6 (with the big patio), which we took advantage of each evening. Our room was on the other side of the hotel facing the pool, and although it was smaller, it had a cute balcony and was very quiet. The staff was exceptionally helpful and friendly (shout out to Victor)! On top of all of its great qualities, it is surprisingly very affordable! Almost forgot, the location is definitely worth mentioning - approx. 1.5 blocks from beach, and 1 block from 5th. Super convenient to both, but not so close to where it is noisy. Over all great value!", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“a tiny oasis”", "Author": "tiny13", "ReviewID": "UR67624187", "Content": "I absolutely loved this hotel. It was clean, stylish, and only steps from the beach. The rooms were a little small but seriously who cares? The staff were friendly and very helpful. I would definately recommend this hotel to everyone.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boise, ID", "Title": "“A fabulous gem. Our favorite hotel”", "Author": "khnelson", "ReviewID": "UR66379337", "Content": "I booked this hotel for just one night on a great last minute deal through expedia, and was not sure what to expect. I only wish we could have stayed longer. The staff is friendly, the location is great, rooms are fantastic, and the beds are soooo comfy! Also, the neighboring restaurant is really good. The ceviche is awesome and hugely portioned, and prices are MUCH better than on 5th ave. There is a rooftop deck where you can lounge at night with a beer. My husband's comment was \"this is my favorite hotel we have ever stayed in anywhere.\"", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Stay at Kinbe”", "Author": "deeboochi", "ReviewID": "UR66206494", "Content": "My friend and I came from Cancun where we had a miserable hotel experience the night before, so when we arrived at Kinbe it was like a dream. The location is amazing. It's right of 5th and about half a block from the sand- where you can lounge on beach chairs at Wickey's for only 100 pesos. The design of the hotel is stunning with a sleek modern lobby and an open indoor pool. The hotel is divided into two sections half being very modern while the other half is like staying in a tree house- VERY COOL. Most importantly, the service was outstanding. Everyone at the hotel was incredibly accommodating and helpful. I always felt safe and didn't even question leaving valuables out of the safe. I think it speaks volumes. I would stay at Kinbe again in a heartbeat.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Feels like a second home.”", "Author": "dskdskdsk", "ReviewID": "UR64051654", "Content": "I've stayed at Hotel Kinbe twice this year, for a total of 3 weeks, and every day was a joy! The staff is hip and interesting, and make every trip past the desk a pleasure in itself. It's a block from the best clubs in Playa, less than a block from the beach, and a few feet from the main strip. And by feet, I am being literal--I didn't wear shoes the whole time I was in Playa. The rooms are thoughtfully designed, and offer the creature comforts you'd expect from boutique hotels elsewhere in the world. The 'Mellow' and 'Garden' suites are small, practical, euro-style rooms, ideal for the young traveler on a budget. Personally, I prefer the detail-oriented Rugiada, mostly for its aesthetic appeal: minimal white rooms, with white sheets, white towels, and accented with a touch of red. The Rugiada rooms also include a balcony overlooking the pool and courtyard--great for loafing and reading a book or drinking a beer. If you're taking \"that special someone\" to Playa, definitely pay the extra for The Rugiada, you will not regret it. I've stayed at 4 other hotels in Playa and this has definitely been my favorite. Highly recommended!", "Date": "May 13, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Milwaukee", "Title": "“Hotel Kinbe, Playa Del Carmen, Riviera Maya”", "Author": "MidwestTravelista", "ReviewID": "UR62764515", "Content": "Hotel Kinbe is a small, but quaint place in Playa Del Carmen. The bathrooms are little tight, so you have to take turns using the facility, but its close proximity to the beach made the difference. Its clean with a cute little garden buffering the interior. It is centrally located to 5th Avenue which has everything you need including restaurants, sports bars and clubs and of course SHOPPING. There is a scuba shop right across the street and a Starbucks kiddie corner to the property. The night life is vibrant with beachfront clubs within walking distance. NOTE: Because of the pedestrian traffic on 5th Avenue your transport van from the airport will not be able to drop you off in front of your hotel, you will have to walk a couple blocks with your luggage. So if you pack heavy, stay at a resort outside of Playa.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Altadena, California", "Title": "“home away from home”", "Author": "jayjay12", "ReviewID": "UR62042884", "Content": "Kinbe is a beautiful hotel located in the heart of Playa del Carmen. My husband and I went back and forth between staying at an all inclusive oceanfront resort or staying on 5th avenue and enjoying the different cuisines and night life that downtown offers. We decided on Kinbe, which is a few steps from the beach and from the shops, restaurants and bars. We got to spend A LOT of time in our room because it rained three days out of the five that we were there and we loved every bit of it. Starbucks is accross the street. The room was comfortable and clean. The pool is beautiful and quiet. And the roof top has lounge chairs and a nice ocean view. Last but not least, the staff is incredible! Especially Andreo and Fernanda. They can get the best deals on tours and know the best restaurants in town. They made us feel at home. Thank you very much guys!", "Date": "April 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great Location”", "Author": "Damber", "ReviewID": "UR61995508", "Content": "This is a nice hotel. We had a room on the third floor which was a little trouble because the stairs are narrow and there is no elevator so it was some work getting our luggage up and down. Also the room we had was quite small but it didn't bother us because we were only staying one night. If you are staying 3 nights or more you may want to get a suite which would have more room. The location is great, very close the beach and 5th ave. Staff was nice and helpful. We were only there one night but would stay here again if we wanted to be in downtown playa.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“a nice getaway, thank you kinbe”", "Author": "theguyintheroom", "ReviewID": "UR60220967", "Content": "we arrived rather late, 9pm on a friday night, but had no problem or hassles with our existing reservation being there ready for us, all was in good order and taken care of by Andreo at the front desk, the room was quite small but had a airy feeling with the tall ceilings and light color paint. very modern fixtures in the bath! the lock/security on the doors seems a little flimsy but a room safe is provided for your valuables. housekeeping did a great job with fresh linens and keeping the sand we tracked into the room swept up. thank you girls. enjoy the chocolates we left for you! one thing that was a minus was the noisy stairs, they are coated with a thin piece of steel and it amplifies every step anyone takes on them, expect this noise if you are on the poolside. the roof deck is very comfortable and a nice sunrise view or a lunch spot. the new wal mart is a few blocks up the road and buying beers, lunch snacks or anything else is made easy with that. safe, central, stylish, great wifi and comfortable beds. a really great place, the association with wicky beach club was nice but got a little loud in the late afternoon so we just moved down closer to the water with our towels and found the sun just as nice, but quieter!", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Provo, Utah", "Title": "“Super chic, super convenient location. Loved it!”", "Author": "shawny_pooh", "ReviewID": "UR59331681", "Content": "We stayed at the Kinbe for 4 nights. We had a room that opened up to the pool area. It was lovely. The decor was minimal but super chic. The bed was comfy and for once in our traveling experiences we spent alot of time in our room. TV was available in english and we spent quite a bit of time enjoying the room and its amentities. The only complaint was that the rooms next to teh pool have a satir well that is lined with metal...it looks super cook, but can be a bit loud. the first night we did have some trouble with noise, but I believe it was mainly due to a huge party happening on avenida 5 (we were there during spring break). Otherwise the rest of our nights we enjoyed wondderful sleep with no problems (even from the stairwell noise) . I wouldn't even consider it an issue, but wanted to give a completely honest review. The hotel was right aross the street from the dive shop we chose, a short walk from the beach and Avenida 5. Truly the best location I could image for a visit to Playa. The staff was great and friendly, even with our frequent comings and goings from the room. In sum, it was a great stay and we will definitely be back to Playa and the Kinbe!", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Simple and chic at a nice price”", "Author": "eurojamie04", "ReviewID": "UR59008394", "Content": "We debated between Kinbe and the minimalist Mexican kitch hotel - Basico - just a block away on Quinta Avenia. But I'm glad we chose Kinbe. We stayed here for 8 days during our visit to Playa. Our room was minimally yet thoughtfully decorated. At about $79 USD a night, we definitely got what we paid for. It was cleaned daily, felt incredibly safe. The 30-something hipster staff was friendly and hospitable. The pool is beautiful and relaxing to sit next to in the afternoons. The laundry service is quick and cheap, and I've never seen my clothes so white. The restaurant next door serves tasty ceviche and 2x1 drinks. There's a Wal-mart less than four blocks away to pick up drinks and snacks, and there's a mini-fridge back in the room to put things in. My favorite nearby beach spot was Fuzion, a restaurant/bar a few blocks away with live Reggae at 5, great food and helpful service. They're a perfect mix - ah hem, fusion - of elegance and beach casual.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "VA", "Title": "“Good location and the bare minimum for the room itself”", "Author": "tmimi", "ReviewID": "UR58886335", "Content": "The hotel is situated right off of 5th Ave and a very close walk to the beach. It has a white front which looks like it's been newly renovated and when you walk though the small hotel it has lush greenery. The room was a bit of a surprise since when you open the door you basically run into the bed. It's the size of a closet. Which is fine since it wasn't too expensive and we weren't planning on staying in our room much anyways. The one thing I do wish they provided was bottled water. You'll have to get some from one of the many mini marts on 5th ave. It's very pretty with a rooftop deck and a waterfall going down one of the sides of the building. It was quiet at night and close enough to everything you'd want to be near.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hawaii", "Title": "“Not cool, Kinbe - give it to me straight”", "Author": "HI_via_NYC", "ReviewID": "UR56631835", "Content": "My wife and I just stayed at Kinbe last night and we were both pretty disappointed with our experience for 2 big reasons. 1. I did not appreciate being nickled-and-dimed: When I booked our room on Kinbe's website they quoted me a price that included tax in USD. I entered all my credit card information online and received a receipt via email for the charge. Upon arriving, however, I learned that entering my credit card information just reserved a room but did not pay for one, and we were asked to pay for the room at that point. That seemed fine to me but this is where Kinbe gets sly and unless you're paying attention you won't even notice. I gave them my credit card to pay for the room and they gave me a total price in pesos since they apparently have to charge my card in pesos (?, whatever - fine). What really pissed me off is that they used an exchange rate that was obviously higher than the day's exchange rate so my credit card bill in USD is actually higher that what was quoted online. Depending on the day's exchange rate, this could be a difference of $2 to $10 USD per day per room. You can pay what they actually quote you online in USD if you have cash, but who wants to carry around hundreds of dollars of cash in Mexico (or anywhere, for that matter) - that's why I booked and paid online! Not cool, Kinbe - you should know better. 2. The room was way overpriced compared to hotels in playa and neighboring areas. For example, my wife and I stayed in two 4-star resorts in Cozumel and Cancun that were cheaper and worlds nicer than our small, modest room at Kinbe. Yes, Kinbe is definitely charming and has character, but for what they're charging compared to other hotels, I'm sorry, I just thought we would get way more. I would absolutely not recommend this hotel unless they were much more honest and up front about their rates (no nickle-and-diming), and unless they dropped their prices by at least 33%.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Great Location-Great Staff”", "Author": "USgovt-traveler", "ReviewID": "UR56602635", "Content": "Kinbe Hotel is small hotel in the middle of Playa del Carmen's tourist area. We arranged for the airport transfer by email with the hotel. The four of us were picked up right outside of the airport by the driver holding a sign with our name. It took less than 40 mins to get to the hotel. Hotel checkin was quick and the hotel stored our bags because our room was not ready when we checked at 12:30pm. We stayed in a Moody room that was clean and included a king bed with a small table and refrig. The bathroom was small but adequate. This room is basic, no frills rooms for those who do not plan on spending a lot of time in the room. The desk staff were great and helped us with directions and booking a tour of Chizen itza for $40. They also gave us an extra pillow on request. The beach is less than a block away and the front desk provides towels and a pass to the Wicky beach club. We spend 2 days sitting in the sun, drinking and eating. If you have a crave for a hamburger this is the recommended place (some people gotta have one). Check out was quick with no problems. This is a great hotel if your looking for just a nice room and no more. There is no lobby area, no hotel bar/restaurant and is not on the beach. BUT with the great location, you can have a variety of fun places to drink a beer, partake in awesome food and shop all day long. We returned to the hotel several times a day to drop off purchases, change clothes or use the bathroom without wasting cab fare. ME-I travel more than 30 days away from home a year for work and spend a lot of time in hotels and airports around the US.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wauwatosa, Wisconsin", "Title": "“Girlfriends love Kinbe!!”", "Author": "dmdevl", "ReviewID": "UR55574029", "Content": "Two friends and I went to Playa for a getaway from our busy, winter lives. We wanted a reasonably priced hotel, comfortable for the three of us and located close to the beach. We got all three in Kinbe! The location of Kinbe is PERFECT!!! A half a block from the action packed 5th Avenue and a half a block from the beach. We were a little worried about the three of us fitting into the Junior Suite when we first walked in, but we put the futon up and staked out places for our bags. We could have had more room if we had been willing to carry bags up the circular stairway to the king bed loft. Because of the loft and the peaked roof, the room has more of a vertical feel than horizontal. It was nice to sit on the balcony and look at the ocean while getting ready. The air worked fine and the king bed was very comfortable. The futon was like a futon. I think maybe it would be better to use a day bed that would actually function as a couch when not in use and be off the floor with a nicer mattress when used as a bed. We liked the grounds of the hotel and the folks at the front desk were very personable. We liked the beach club that the hotel is affiliated with - Wicky's. We would stay there again. Tomorrow.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco CA", "Title": "“A Sea of Tranquility!”", "Author": "4th-dimension", "ReviewID": "UR54374211", "Content": "We were so pleased with the staff, cleanliness, comfortable beds, and atmosphere that when we come back to Playa del Carmen we will definitely be staying at the Kinbe! We stayed in a Garden Suite that has a large patio that overlooked the avenue to the beach. We loved it!", "Date": "January 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bakersfield, California", "Title": "“Great location, lovely rooms, pleasant and helpful staff.”", "Author": "belita58", "ReviewID": "UR52505541", "Content": "The location here is great! We were right off of Avenida Quinta where all the action is, and a block from the beach, which was visible from the lobby and apparently from some third floor rooms. In spite of its close proximity to the bars, shops and restaurants, it was quiet and we had no trouble sleeping. There is a nice low-key cafe next door, tasty and inexpensive, and a super dive shop called Geofish one block down towards the beach, Our teenagers dove for the first time and loved it. The hotel staff were great. We had a late bus out and they let us stash our luggage in the back while we went ziplining.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "uk", "Title": "“Cozy haven just off the main drag\"”", "Author": "davenewton11", "ReviewID": "UR50636628", "Content": "Stayed here recently , stylish clean botique rooms. Had the cheapest room \"Pretty\" very comfortable. This place has an amazing roof terrace for everyone to useand is a stones throw from the beach and 5th avenue. Had trouble finding it just walk up 5th avenue to calle 10 then turn left towards the sea, may be the hotel should put a map on the web site ( suggestion). Had a minor issue checking out the guy didn't seem to know what was going on ( partly due to my poor spanish)", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Haarlem, Netherlands", "Title": "“Great location, service, decent (\"Moody\") room”", "Author": "Haarlem", "ReviewID": "UR49916965", "Content": "Stayed here in Nov09 in a ground floor \"Moody\" room (room #1, behind reception). Very centrally located on Cally 10, just off the main Avenida 5. The bottom floor also ensured no noise was coming through, though with little day light. Room was large and clean. Staff was very friendly. Breakfast options plentiful. Great dive shop Scuba Playa located opposite the hotel.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Perfect Place to stay”", "Author": "28days", "ReviewID": "UR47593478", "Content": "Hotel Kinbe is great. If you're after something a little more tasteful and personal than the massive beachfront resort, this is perfect. We had a great view of the beach and the rooms were lovely. Location is perfect, right in the middle of playa and only 15m to the beach. You are given vouchers for one of the beach front bars so there is no problem finding a sunbed on the sand, and the staff could not be more helpful. Only thing we could fault them on is the value of breakfast. You get a voucher for a restaurant up the road as there is no restaurant on site, and this only covers a basic continental breakfast. We ended up paying an additional 80pesos each morning so we could have the buffet instead. It's definitely not worth paying extra to have breakfast included unless you're happy with cereal and toast. Kinbe is a really beautiful place to stay, and looks a lot more expensive than it is.Definitely excellent value and I would stay there again in Playa.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin", "Title": "“Excellent Hotel & location\"”", "Author": "mexico4ever2009", "ReviewID": "UR46685583", "Content": "The Kinbé is a boutique hotel with the best location ever: one block from the 5th Avenue and even less from the beach. Our room was chic, wide and very bright. We felt sleep every night with the sound of the waterfall in a fantastic king size bed. We loved the rooftop terrace and the lush tropical garden. The staff is amazing very helpful; thanks Alexis and Raul!! They kindly gave us the best tips for restaurants, tours and much more. Thanks to the cleaning ladies, they really make us feel home. Elena, the sales manager, who made our reservation was very kind and clear, thanks to be so patience and intelligent. We are travelers and we recognize a good and professional hotel management; We met once the general manager at the desk and we didn’t have the opportunity To tell her how much we enjoyed our stay, thank you Stefania. We strongly recommend the Kinbe’.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Switezerland", "Title": "“Charming Hotel!!”", "Author": "Cipresso", "ReviewID": "UR46602207", "Content": "My boy friend and I spent a couple of weeks in this small charming hotel very very close to the beach, only 50Mt. We were looking for a relaxing place in the centre of Playa Del Carmen, Hotel Kimbe was absolutely the best compromise we could find. Room are very tidy. Staff is friendly and helpful. They organized for us wonderful daily trips and they help us in all we wanted to have. We are already planning to go there another week, maybe during March next year. We strongly recommended Hotel Kimbe'.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Perfect place to stay if you are not into frills”", "Author": "NewYorkNik", "ReviewID": "UR45841231", "Content": "This hotel was perfect and met it's purpose for my friend and I. The rooms were small but clean, but that is all we really needed, considering we spent all our time on the beach. The beach was about a 2 minute walk away from the hotel. We went to the beach all day and were allowed to use the beach umbrellas and chairs of one of the beach front hotels. The staff was very nice and informative. They were able to answer a lot of our questions regarding places to eat and sights to see.", "Date": "October 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Nice trendy hotel”", "Author": "Haploke", "ReviewID": "UR40090572", "Content": "Nice trendy hotel. Rooms are not as spacious as I would like to have seen, but certainly enough for my needs. On saturday the outdoor nightlife sounds were able to creep into the room. The staff is really incredible and back over backwards to satisfy the needs of the customers. Well done!", "Date": "September 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Madrid", "Title": "“A true Italian rip off in Mexico. A nightmare!!!!”", "Author": "WilitaMadrid", "ReviewID": "UR38322370", "Content": "Looks nice from the outside but when you try to spend a night there you discover a nightmare. Super noisy during night and day!!! in the night due to the night clubs with loud music until 6:00 am; Mornings at 8:00 started the construction of a building next to the hotel!!! We booked an room that was more expensive because it had views to the see. THERE WAS NO WAY TO SEE THE SEA!! Only from a little corner in a corridor outside our room and the sea was far away!! We could not rest for the whole week and we were stuck there because it was high season. The owners of the hotel the worst, very unfriendly and unpolite. They also tried to rip us off with the credit card and the Exchange Rate. My worst experience in a hotel ever.", "Date": "August 21, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“We loved the Kinbe....Perfect Location in Playa”", "Author": "pdcmx09", "ReviewID": "UR33449335", "Content": "My husband and I just got back from Playa del Carmen. We loved the Kinbe. The staff has been wonderful since we emailed them a year ago to book the room. They were extremely nice and helpful once we arrived. We stayed in the Moody room/ partial ocean view and loved it. It was quite small but was just what we were looking for. We were not wanting to stay in a big resort....we went to Playa del Carmen to chill in laid back mode and the Kinbe was the perfect hotel for that. It was in walking distance to every place we wanted to go, just seconds from 5th avenue and a couple minutes walk to the ferry to Cozumel. We are planning another trip to Playa in the near future and plan on staying at the Kinbe again. No complaints about it at all.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "gold coast", "Title": "“yeah nah!”", "Author": "lililuv", "ReviewID": "UR31823948", "Content": "hmmm im V open minded but feel this hotel is over rated. i dont mind carrying my own bags up 2 flights or no tea & coffee,could even cope with the smaller than expected roon (thank goodness for the balcony) BUT the room was very very MUSTY, & theres no way ur swinging anything in the bathroom let alone a cat... great pool,great gardens,great decore. V V average staff.fantastic location! looks good but the reality...", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Perfect location! Would definitely stay here again!”", "Author": "Palma27", "ReviewID": "UR30542451", "Content": "We just returned from a week stay at the Kinbe. We stayed in the Rugiada King room on the top floor. Was the perfect size for the 2 of us. Bathroom was also a good size with a large shower. No complaints about the housekeeping, always cleaned well. No bugs or mosquitos. One night we had a little gecko sleepover and he was gone the next day. Was just a few steps to 5th Ave and to the beach! Staff were all very friendly and helpful. We loved it and would definitely consider staying there again.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Middling hotel - definitely not enough bang for the buck”", "Author": "tylerette", "ReviewID": "UR28525501", "Content": "Stayed at the Kinbe from April 17-21 2009. I chose the Garden room (Kinbe offers 4 types), which was a terrible mistake. I understand that this type of room was meant to mimic the rustic, natural feel of a jungle palapa, but our room had ants, flies, and mosquitos. The downstairs half of the Garden room (the living area) is also very tiny - tinier than expected. After two nights in the Garden room, we told the front desk we needed a new room. Unfortunately, the hotel's only availability was in their most expensive room (Rugiada), but at that point we desperately needed a bug-free room, so we said yes. The Rugiada room was much better - bug free, great, spacious shower, and large room overall. My one point of contention here is that even though the only reason we switched rooms was due to a fault of the hotel's (bug problem), the front desk did not volunteer to comp our remaining two nights at the original Garden room price. The difference was only $20 USD, so yes, it's not a large amount, but I hate to say it - it's the principle of the matter. In any case though, to the hotel's credit, the front desk staff were incredibly polite, efficient, and understanding. Overall, I would not stay at Kinbe again. Even though the location is great (right on 5th, and steps away from Zenzi Bar, which is one of the best beach bars in Playa), the prices are too high for what you are getting. Don't be fooled by the lovely lobby - yes, it's nicely appointed, but that's just the lobby. That's not your room. You are better off paying a bit more and going with Blue Parrot or Mosquito Blue.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "montana", "Title": "“Great location and groovy little hotel!”", "Author": "estrella-bella", "ReviewID": "UR28401699", "Content": "This is a hip little place that doesn't claim a lot of bells and whistles. It is clean, near the beach and all of the action. It is easy to find and feels safe. My only complaint is that they have 2 double beds in some of the rooms but only will book 3 people to a room. I don't know if it is to discourage families or what. You can call toll free from the states and can speak to someone in English. That is a bonus that most boutique hotels in this price range do not offer. The cleaning staff was dressed beautifully and seemed very respectful of your space. I would definitely return.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“A nice hotel at a perfect location, with a friendly staff”", "Author": "my_name_is_FERRY", "ReviewID": "UR27907809", "Content": "We stayed for three nights at the Kinbé hotel when we first arrived at Playa del Carmen. Being such a nice hotel at a perfect location (only 50 meters from the beach and a few steps from 5th ave), we decided to spend our last three nights in Mexico here.( After travelling to Tulum and Cozumel) The staff is very friendly, the rooms are nice and clean.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great hotel, perfect location”", "Author": "SFtravellers09", "ReviewID": "UR27203182", "Content": "The hotel had very friendly and helpful staff. They were accommodating despite our last minute reservations. We stayed in two different rooms, and both were very clean, comfortable, and nicely decorated. The location was great; on a block halfway between the main shopping avenue and the beach. There were numerous great restaurants and bars located within 2 blocks of the hotel. My only caution would be regarding the stairs to our loft bed. They were unevenly spaced, and it made concentration absolutely necessary when climbing and descending.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“A Pleasant Surprise!”", "Author": "donotgrl", "ReviewID": "UR25179954", "Content": "As a business traveler with a branded hotel preference, I was skeptical. Kinbe Hotel lived up to all of it's promises. Fantastic location, close to the beach, tons of restaurants, shopping and the ferry. Although the rooms are small, they are clean and charming. The courtyard is a tropical gem, and the staff is friendly, helpful and knowledgable...no language barrier here! You can tell that everyone takes pride in their hotel and wants to make sure you enjoy your stay. I'm already planning a trip back.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cleveland Ohio", "Title": "“Amazing Place - Space and Service”", "Author": "miss208", "ReviewID": "UR25059124", "Content": "I need to thank all the staff at the Kinbe once again. This was my 4th visit to the beautiful village of Playa....each time I always stay at the Kinbe for me I travel with friends all of which have different financial means - we all stay were we want and can afford. So as a single woman I just love the Kinbe - close to all the best places in town. Around the clock front desk personal available - safe - truly comfortable & clean rooms. I have stayed in 4 different rooms each offering something different.... The garden rooms - are shady and lazy with comfortable sofas - tv's you lose track of time. My most recent favorite is the terrace room with the balcony and the boganivilla. Just a step away from the roof top that has some amazing views of the sea and the town. I have gotten to know many of the staff over the years....they have personally shown me some of the greatest places to eat - shop and sunbath in Playa also setting up all my travel to and from the hotel - never missing a beat and making my trips a true luxury. The rooms are clean and comfortable with all the amenties I could ever want to unwind and rejuvenate. Seeing as I own two restaurants when I do get away - I long for nothing more than to be mindless and carefree knowing I am safe and among people who work towards my enjoyment. My next stay will be in the newly built addition to the hotel which is done supurbly with the village and the garden. And may I say the cleaning staff has remained the same since I have been going - I trust them all completely and never has a thing been out of place when they finish. The Kinbe and it's Rates - Staff and Amenities have made me continue to travel to Playa. It's all Luxe: The Comforts of Home by the Sea", "Date": "February 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mexico", "Title": "“Great location, nice place to stay”", "Author": "Terebv", "ReviewID": "UR25038687", "Content": "We stayed here for 5 days in February 2009 and had a great time. Location is great, just a few steps from the heart of 5th Avenue which is great because you can really experience Playa del Carmen. The beach is just half a block down. Rooms are small but clean and comfortable. Service is good, we had a problem with the security box and they fixed it right away. Somedays it was a little bit noisy at night since there is a Bar just around the corner but if you plan to party at night and can sleep over a little bit of noise you'll do just fine. I would definetly recomend it for young couples and friends.", "Date": "February 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Detroit, Michigan", "Title": "“No Return Stay/No Recommendation Ever”", "Author": "cormac55", "ReviewID": "UR24758713", "Content": "I booked this hotel with some trepidation due to previous reviews. It seemed a \"hate it or love it \" kind of place. Our family was staying nearby and I couldn't book my usual hotel. First impression from the street is a nice, modern, garden style hotel. No problems reserving the \"Moody\" room which is the only style of four types that has two double beds. I asked about upgrading but no other doubles were there. Room was on the ground floor. It was small, dark and I could not sell the small half-table, two chairs and beds for five-dollars combined, at a garage sale. Scruffy, scratched, painted horrible furniture. The mattresses were OK. The bedding was leftover Motel 6 as were the towels. The windows had mis-matched curtains that covered your very basic slide bolt locks. The door lock was a button type that a small child could bounce against and open. The safe was a key type but unfortunately was not bolted securely and pulled away from it's anchors. A small plasma TV. Air conditioning was good. My sibling had it too cold for me and it took me two days to get an extra blanket, which was a bed spread from another room, that I finally got by walking into the housekeeping room. Twice Roger couldn't commit to a blanket. There was a phone from 1980-don't know if it worked. No radio or wake-up alarm device. The bathroom was so small knees got scraped while sitting on the commode. The mirror was suitable for children, adults have to crouch. The shower is tiny and numerous bottles of shampoos and soap cakes from previous guests were left on the only ledge- a small four inch space at the shower curtain that could only be reached by feeling around. Yuck. Now the positives: No apparent bugs. In fact the pest control truck was outside one afternoon. The shower head was A+ and pressure was very good. The TV was just fine. Air conditioner good and not too noisy. The courtyard area was nice, filled with flowering plants and whimsy decorative jugs, shells, \"nature\" art, etc. The maids did a good job of cleaning (what they could reach-see shower info.) and were very, very helpful and pleasant. The day desk manager with the long hair and retainer-sorry-didn't note her name- was very nice, accomodating in her llimited area of responsibiity. Sorry-the male desk manager was not very helpful, reluctantly explaining the beach club information only after we asked pointedly, and couldn't recommend a place for coffee. All in all, knowing this was a low/mid-price range, I think it runs around $150/night (purchased through package from Orbitz), I was disappointed and made the best of it, since I only slept/showered there and am pretty easy going. My luggage has TA tags.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Nice and central”", "Author": "Reiserundt", "ReviewID": "UR24239737", "Content": "We stayed here for 5 nights in late January. Easy reservation by their website. Friendly, helpful and welcoming staff when check in. The hotel is new, and clean. We had room nr 2, it's on the ground floor. I would have preferd a room higher up... It's a garden view, and everyone walk by the window when going to their rooms. The higher up your room are, less guest are passing by your window. That depends on how much you pay. The rooms are small, but light. Almost no daylight. Tiled floor. Good beds. The aircon worked ok, but the ventilation is bad. There is a minibar with expencive stuff...If you place some of the bottles outside the minibar, when making place for your own bottles, you have to pay for it! Be aware. The security feels good, there is safe in the room. And 24 h staff.", "Date": "February 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Good Value for Location In Playa del Carmen”", "Author": "torontojoanne1", "ReviewID": "UR24152388", "Content": "The Kinbe Hotel is a very good, well located hotel, half a block from the beach. It has clean, air conditioned rooms that are good value. The hotel is efficiently run by the manager, Stefania. This hotel is a safe place for independent women travellers to stay. The beautiful, tropical garden adds to the ambience. Joanne --- Toronto, Canada", "Date": "February 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Two star hotel with 4 star price”", "Author": "JimJoy", "ReviewID": "UR23694385", "Content": "I posted some photos of this hotel... \"The real Kinbe Photos\" I would not say this hotel is terrible but i will say it is grossly overpriced and thus a terrible value. Kinbe is a 2 star hotel painted up to impersonate a 4 star boutique hotel. The rooms are very very small, dark and have no air flow (see my posted pictures). The minibar is packed with overpriced useless items, $6 water and $14 tequila for example (see pics). The view from the room was nothing like the website (see pic). Overall, this hotel represents exactly what is making Playa an overprices tourist trap rather than a quaint beach side resort.. Hotel Plaza right next store is half the price with bigger rooms. Recommendation: Avoid", "Date": "January 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Very nice hotel!”", "Author": "spiritus12", "ReviewID": "UR23454897", "Content": "Very agreeable and charming hotel, 50 meters from the beach. Exceptionally friendly staff. Our room was spacious and nice , absolutely no complaints. You get a certain amount of noise from neighboring nights spots, especially Basico, which is great - but then you do not go to Playa for silence... We had a great time.", "Date": "January 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "fauxlatina", "Title": "“not what they advertised”", "Author": "fauxlatina", "ReviewID": "UR22932740", "Content": "The room photos on the website were not even close to the rooms we stayed at - the photos must have been photoshopped or taken with an extremely wide-angled lense. The rooms were tiny (room enough for a bed with no nightstands or other furniture) and uncomfortable. While the staff were nice, it took several calls to get them to check the problems in the bathroom (which they never did) and days to get a new bar of soap.", "Date": "December 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“A Real Disaster”", "Author": "Johnson09", "ReviewID": "UR22532916", "Content": "very expensive as compared to similar hotels no view we had to buy soap and shampoo the A/c was not working properly lots of mosquitos bathrooms were dirty Be careful in giving the management your credit card info!", "Date": "December 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "IRW", "Title": "“A Total Disaster!”", "Author": "IRW", "ReviewID": "UR22168554", "Content": "If you plan to ruin your vacation, this is the best choice. Bathrooms floors are dirty; they copied our credit cards and when we went back home, we noticed several charges (from Mexico) on our credit card. Hotel Konbe was the only place that had our card!! Far from the beach, noisy rooms. Lots of mosquitos in the rooms! Air conditioner wa snot working properly.", "Date": "November 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Iowa City", "Title": "“Overall, Good Experience”", "Author": "lilnestegg", "ReviewID": "UR21762135", "Content": "Hotel Kinbe is a cool hotel, right in the center of Playa Del Carmen. I first booked the 'garden room'- when I arrived, I didn't like it at all- too small, narrow, hot, and smelled quite musty. Very rustic (too rustic) and not impressive for the price. So, I upgraded to their best room, which was very nice. Contemporary, sleek decor. Tiled bath, balcony, desk area... and, just a block from the beach. Probably not a great pick for a family, as it's in the center of activity, so it's very loud, late into the night. But, it's great to wake up and have all the shops and eating venues right around the corner, from local places to Starbucks. The owners of this hotel also own/run a very hip/trendy restaurant just across the street, as well as a wine bar around the corner. Would I stay here again? Maybe- only because there seems to be so many cool places to check out in the area.", "Date": "November 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Billingham uk", "Title": "“small but quaint”", "Author": "broonaler71", "ReviewID": "UR21009947", "Content": "We found this hotel to be great value. We had booked the cheapest type of room - a pretty room. Room 17 - was on the second floor looking over the gardens. The room was very small but had mini bar which was not expensive and a decent shower and a wall mounted plasma tv with great reception. We had booked the small room as we had not planned on being in it that much as doing trips away. The bed was comfy and clean. Despite the close proximity to 5th Ave you could not hear any noise in the room - which was really good. The only problem the hotel had while we were there were a couple of plumbing problems, meaning the water went off for a few hours. Hopefully they have got this sorted. It would not stop us staying there again. The pool is nice and quite deep although we only saw us using it and that was once after a trip to Tulum. We travalled to Tulum on the local collectivos which are about five minute walk away and are really cheap, better than a taxi or ADO bus. Once there its also dead cheap to get in, but watch out for the time share reps who give you the maps on the way in We did take up their offer to tour a resort up the coast the next day with a free breakfast. The tour and pitch lasts 90 mins and if you can stand your ground against sales pressure like we did, we came out with half price tickets to Xel - Ha, saving $80 - result! Doing a trip to Tulum your self is a lot cheaper than an organised trip and don't combine it with a trip to xel-ha, as most advertise, as there is plenty to see and do at both, too much for one day. We also went to Xcaret booked through Alexis at the hotel. We went for the night show but you get there early enough to enjoy the other attractions as well. The staff were always helpful and available, there is a great roof terrace with views of Playa where we enjoyed a few night time beers before moving to 5th avenue. The hotel has no eating facilities so used the starbucks opposite for breakfast except one morning when we went to Sensai on the beachfront which the hotel promotes use of. We had loads of food for a very reasonable price. Its also quite chilled there on a night, some nights showing films on a big screen on the beach, where you can lie on loungers. Ovreall this hotel is conveniently located in the centre of Playa and great value for money", "Date": "October 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El PasoTexas", "Title": "“Great value”", "Author": "Turr", "ReviewID": "UR19855438", "Content": "I had been in Kinbe hotel 4 times over the last 5 years. The property is clean and functional. The staff is great specially Stefania, the manager. It's only 3 minutes away from the beach and famous 5ta. Avenida. I would definately recommned this place.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Loved the Kinbe”", "Author": "cookiebeast", "ReviewID": "UR19757489", "Content": "I saw positive reviews in Expedia and decided to go for this hotel. For the price I paid, I was extremely happy. Room was small but clean, complete with a mini fridge, a plasma TV and full A/C. No bath tub, but the shower had good pressure. Bathroom is pretty funky looking. The hotel is in good location, less than a block from 5th Avenue and one block away from the beach. Note that if you prefer quiet, this is not the place for you. At night, you can hear bars and clubs having loud music. And there's a construction nearby, which is unavoidable because there appears to be construction everywhere nearby the beach. So there's some construction noise in the morning. To sum it up, I enjoyed my stay at Kinbe. Good location, friendly staff, ask the front desks for discounts. They will gladly help you.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Santiago, Chile", "Title": "“Terrible service and low value for money”", "Author": "Dvd1980", "ReviewID": "UR19529283", "Content": "During my stay in Kinbe hotel I had an excursion to Chichen Itza, so I asked the reception to wake me up at 6:45, because I had to be in Plaza Antigua to wait for the bus at 7:50. The next morning I woke up at 7:48 (no one had waken me up) so we dressed extremely quickly and ran to the Plaza. We got there at 8:00 extremely tired and luckily the bus waited for us. I didn't missed the excursion but I forgot to put the tickets, the bathing suit (to swim in the Xenote), the money (to buy the cheapest art craft in the area and buy food or beverages), and the sun cream, luckily I didn't forget the camera. Besides that it was very uncomfortable to be the whole day without having taken a bath or washed the teeth. When we got back to the hotel I asked for the receptionist to talk to the Manager, he told us she was busy at that time (19:00) and that he would call us later. At 21:00 we walked down, tired of waiting and the receptionist told us, that we could talk to her (why didn't he call us??). We explained her the situation, and she said that it wasn't that important, because we could go to Chichen Itza anyway, and that there was nothing she could do to solve this problem (she offer as the only possible option to kill the receptionist). That we should relax, and she complained that I threw the keys in the morning to the reception (I was running to get the bus I said) and that the wake up service was not the obligation of the hotel (The hotel says it has the service in internet). We ask for a discount at least and she reluctanty offer a 10% discount. Then I said that wasn't enough and she told me we were taking advantage of the situation. We wanted to leave the hotel, but she asked us to pay the night we had slept there and the following night (because it was later than 12:00 pm). I think the attitude of the administration has been the worst customer experience in my life so I wouldn't recommend this hotel to anyone. Besides that the rooms are infected with ants, they say it's the tropical weather, but I stayed in other hotels without this problem. Another problem is that I rented an ocean view room and I could only see a tiny strip of sea between the buildings and construction sited, the manager said that it used to have sea view, but they are still offering as an ocean view in the internet. Please, don't stay in this hotel, you can find better place for the same money and much better place for a tiny difference (and with breakfast included).", "Date": "August 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Charming hotel and very friendly staff!”", "Author": "norwegian79", "ReviewID": "UR19122228", "Content": "Me and my girlfriend stayed at the Kinbe Hotel for a week. We were supposed to stay there for just a couple of days, but liked the place so much that we prolonged our stay. If you're tired of annoying resort hotels, we would recommend this charming little hotel located in the middle of Playa Del Carmen. The young people in the staff speak english and are very helpful and friendly. The rooms are quite small, but clean and cosy, and the AC works well. The suites are really something else - amazing - so check them out if you want something special. This hotel is well worth the money - and we will definitely come back. PS! We'd also recommend the massage studio on the other side of the street of the hotel. The people there will give you a really impressive (and cheap) one hour massage. Starbucks is just 50 metres up the street, but don't go there for your morning espresso. Instead - walk around the corner of Starbucks and visit the little french/mexican coffee house. They serve the best espresso ever tasted in Playa Del Carmen! You can see the beach (100 metres) from the entrance of the hotel. Go watch the sunrise early in the morning. Beautiful!", "Date": "August 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cheltenham", "Title": "“Not amazing but OK”", "Author": "passi0n4travel", "ReviewID": "UR18674495", "Content": "We booked this hotel through lastminute.com as we needed a place booked for our first few days in mexico. It was ok, but i don't think I would stay here again. The decor of the hotel grounds is very funky and nice. But our room was very small and smelt of damp. The damp smell was from the aircon..... It was tricky to leave the windows open during the day while the aircon was off to let some fresh air in as the window was right next to the walkway and would have been easy people to climb in. Also there weren't any insect nets over the window so leaving the windows open will let bugs in. The bed was quite small and not really that comfortable. Not much storage. However, on a positive note the room was relatively clean and also quiet at night. The shower was pretty nice. The sink was beautiful but a silly shape so that you can't wash or brush you teeth in it very easily - so pointless really! The staff were a little snooty and not as welcoming as other places I have stayed in Mexico, however when we asked them to call ahead and book us a place in Cozumel they did do this for us. When we left they tried to charge us for things from the minibar that we had not used, they said they would take them off the bill but once our credit card bill arrived the minibar charges were still on there. The hotel was in a good location, very short walk to the beach and the main strip. There is a roof terrace which is nice, would have had lovely views of the ocean.... but there is a big appartment block being built in the way..... the construction of which was very loud at times. The hotel served its purpose as our base for our first few days in Mexico, but I wouldn't stay here again.... there were lots of of other nice looking places to stay in Playa, including Hotel Lunata, where we also stayed a couple of days later after visiting Cozumel for a few days.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Not bad but know what you're getting”", "Author": "Ray_Art", "ReviewID": "UR18346082", "Content": "My girlfriend & myself stayed for 5 nights in July. We have mixed feelings about the hotel possibly because a tropical storm kept us indoors for 2 days. We have to agree that the location is excellent with both the heart of the bar/restaurant/shopping area and the beach being less than 1 minute walk away. We booked the 'Garden room' which was supposedly a good quality 2-storey room for USD120 per night. It was a horrendous room with the bed in the loft - it was dark, dirty with old furniture & as far as I can tell, you could not flush toilet paper down the toilet so it would have been nice & smelly too. We immediately upgraded to the best room at USD 180 per night. This room was very nice (clean, reasonably spacious, good a/c and a decent bathroom although shower water pressure was poor). However, for this room rate we were a little disappointed that the hotel did not serve breakfast or have a bar. However, I guess this is not really a big deal since you're in the heart of Playa.. So not a bad hotel at all - excellent for the location but not particularly good value for money (maybe because it is the 'authors choice' in the Lonely Planet..).", "Date": "July 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Davis, CA", "Title": "“Great hotel, good location, friendly staff”", "Author": "torrentduck", "ReviewID": "UR17229502", "Content": "Our family of four (2 adults/2 kids) just returned from our trip to Playa del Carmen (June 17-24) and I can't say enough good things about our stay at this hotel. There are two sides of this hotel; a sleek, newer, more modern (and very beautiful) side and a more tropical side with lots of lush plants growing in the courtyard. We stayed in one of the rooms on the tropical side. Our room had two beds, one of which was in a loft. If I had to put a negative on anything, it would be that the stairs up to the loft were very narrow so we had to take care going down them and there was no storage in the loft for clothing. Other than that, the room was comfortable, with good air conditioning and a safe. The desk staff were the friendliest I think I have ever experienced. We were in and out of the hotel many times during our stay and each person on the desk remembered us and warmly greeted us each time we came through the lobby (which is also very beautiful). Also, each person spoke English and gave us wonderful advice to help us negotiate our way through town during our first few days there. Hotel is situated one block from the ocean and one block from the busy, and very fun, 5th Av. GREAT find.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Gorgeous Place in the Center of it all”", "Author": "iamkasiaNYC", "ReviewID": "UR16747913", "Content": "We couldn't have been more pleased with this beautiful and classy hotel. We came down for a wedding that was being held at one of the most expensive resorts on the strip. As a result, we stayed here the night preceeding the wedding to save money and also because wedding events were happening in PDC that night. I researched extensively before we booked here, and every positive review I read was true. This place is a classy, posh, charming little gem in literally the BEST location in town. It is literally inbetween the best shopping/pedestrain thouroughway and the beach. If you need a place to stay in town, don't look any further.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Couldn't have been more pleased”", "Author": "LJPG", "ReviewID": "UR16503402", "Content": "This hotel was perfect for our stay in Playa. In my opinion, if you stay at a big resort, your missing out on the best part of playa del carmen. Yes, it may be small, but it is in the most perfect location- right off of fifth avenue. If you are staying in playa, especially on fifth avenue, you won't be spending much time in your hotel anyway, so the kinbe served is purpose well. Also, the beach is a few steps away from the hotel, which was great. You can either bring your own towel or rent out a nice couch like lounge chair at the little beach club they have right there for 5 dollars. It was beautifully decorated and very clean. What an amazing atmosphere. The garden setting was so relaxing! We did not have one problem during our stay. The staff was always very friendly and helpful. I also read a lot of other peoples reviews that said the noise from a nearby club was keeping them up at night, but I definitely didn't have that problem. I'm not sure what they were talking about. Also the beds were really comfortable, I slept like a baby every night. Don't listen to bad reviews about this hotel because it was such a great find! I will be certainly be staying at the Kinbe the next time I am in Playa. I absolutely loved this hotel : )", "Date": "May 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "aurora", "Title": "“Perfect location for beach and local night scene”", "Author": "TifTif", "ReviewID": "UR16451734", "Content": "Kinbe was the PERFECT place to stay for our one night in Playa del Carmen. We chose it because of its location and the price! It was an extremely short distance from the beach and an extremely short distance from the 'Bourbon St.' of the Riviera Maya. Kinbe was cute and clean and had an extremely friendly staff. The room we stayed in was small, but that was what we asked for. The pool was refreshing and it was just a unique cheap clean convenient hotel.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "austin, tx", "Title": "“Couldn't have chosen a more perfect place!”", "Author": "museumtrekker", "ReviewID": "UR15824196", "Content": "We chose Hotel Kinbe for our Honeymoon after a co-worker came back raving about the place. I knew we had made the right choice when, after booking, I e-mailed them to see if they could arrange for champagne in our room upon arrival and they were able to do it for a very good price. They also were able to arrange for transportation for less than a cab ride ( we normally wouldn't hesitate to take the bus but since we were on our honeymoon we thought we'd make everything as stress free as possible). When we got there I just had to step back and smile. The place is beautiful! You are welcomed in an open and airy minimalist designed lobby by their extremely friendly staff ( props to all the staff - they were so kind and helpful). To the right is a atrium of sorts full of lush greenery and flowering hibiscus. To the left is a sleek pool with a copper wall that serves as a water fountain. Both sides are extremely different but both are extremely wonderful. We booked the Moody room on the tropical side. The room was a good size for the two of us with a huge bed, a closet (filled with a great mini bar), a futon chair and a small bistro table and chairs. My only complaint was the hardness of the bed but, having traveled through out Mexico, I have yet to find a soft bed unless for some reason I am staying at an Americanized establishment ( which I try to avoid). If you are looking for the Hilton the Kinbe is not for you. If you are looking for a romantic, charming hotel with a local feel then book right away. The location couldn't be better - less than a block to the beach and 5th Avenue. I could go on and on but I won't , just go and experience it for yourself.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ottawa", "Title": "“stay here!”", "Author": "donde_el_playa", "ReviewID": "UR14290353", "Content": "Great place! We stayed here for two nights and loved it. It's right where you want to be - close to the beach and 5th ave shopping. The staff were really friendly and helpful. I am very happy with the price I paid for the room/location/service that we got. Room and hotel were clean - very pretty design (lots of green inside). Only downfall was that our room was a tad on the small side beceause because everything else was so great that didn't bother us at all. I've been to Playa twice now and this is my favorite place so far.", "Date": "March 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "colorado", "Title": "“We Loved the Kinbe”", "Author": "sunfuzz", "ReviewID": "UR13815524", "Content": "My husband and I stayed at the Kinbe from Feb. 17-22, 2008. I was quite worried about the hotel before we went due to reading negative past reviews. I was very pleasantly surprised. The hotel is sleek, modern, extremely clean - it is so nice! Our room was beautiful with a new plasma tv, balcony, crisp white sheets, lovely bathroom with little soaps & shampoos, plenty of towels, etc. I would like to address three comments that I have read about this hotel that I don't agree with. Firstly, the bed was the best I have slept on in Playa del Carmen. The mattress seemed new, and was an actual mattress; not the typical bedroll that I've experience in the past at other Playa hotels. It was firm, but not hard. I really don't understand what people were complaining about. We have stayed in Playa 6 other times, and usually stay at the Hotel La Tortuga, the number 1 rated hotel on this website, and I can honestly say that the beds are a hundred times better at the Kinbe. Secondly, we found the front desk to be so helpful and friendly. Fabrizio in particular was awesome! Lastly, we thought that the minibar was not a rip-off. For example, I am reading this from our hotel receipt, we had : 1 can of pringles potato chips 1 corona beer, bottle 1 bottle of sprite soda and in American dollars we were charged $6.09. I don't think that is so horrible. But again, I don't understand what people were complaining about. Overall, our stay at the Kinbe was excellent. Playa itself seems to be getting overdeveloped, way too expensive and too full of people especially at this time of year. But it is the top of the high season, so I probably shouldn't complain about that. I would just like to reassure people that they should have no reservations about staying at the Kinbe. It was lovely.", "Date": "February 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "winnipeg", "Title": "“location..location....location”", "Author": "sunpeggers", "ReviewID": "UR13695517", "Content": "We just returned from two weeks at Playa and as always...just loved Playa. We arrived on Sat. Feb the second and discovered that beer was not going to be available until Monday morning, due to Elections on Sunday....Yikes... Not the kind of suprise we hoped for...to start our Vacation.... The mini bar in our room saved the day however.... Our room at the Kinbe was very small....And I mean very small. My wife and I travel very light so with a little planning we made ourselves comfortable. After a run to the store to confim no sevazas were to be had, the staff came to our rescue with loads of those tiny Coronas... There is a new condo going up next to the old alfarro light house.... Unfortunatley an all to common site now in Playa del Carmen. We could find no vacancy right on the beach this year ...so we booked the hotel Kinbe based on it's location. (just half a block off the sand) Just steps from the hotel we had our feet in the cool coral sand.. Ahhh... Playa. The hotel was as described ...Kind of a funky little place with lots of the old Playa charm... On the roof terrace you can watch the stars and obsorbe the ambiance of Mexico....(nice) We found all of the staff to be very friendly and helpful. If your looking for a real taste of the old Playa... Hotel Kinbe is worth a look.", "Date": "February 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Very Lovely, Very Simple”", "Author": "Evalishus", "ReviewID": "UR13502894", "Content": "What a lovely hotel. Very simple with no ammenities really to speak of, but extremely charming. Flat screen TVs (no internet) and lovely modern Zen-ish decor. My stay was very quiet and no real noise from the near-by clubs could be heard at night. The beds are rock-hard, but this is usually the case in Mexico so I never understand why people are so surprised by it. The staff were all surprisingly young (looked to be in their 20's) but VERY professional and polite and spoke very good English. The roof top terrace is a great place to sunbathe, but bring up your drinks and snacks and towels as there isn't really anything up there. The patio furniture is seriously lacking. This is not a 5 star hotel by any stretch but it is a very funky & cool little hotel. It was VERY clean and the staff were very nice. Maybe a little overpriced but you are paying for location after all. I would highly recommend this place to anyone except maybe families (not sure if rooms are big enough).", "Date": "February 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Taylor, Michigan", "Title": "“Great Location....Horrible Beds”", "Author": "sparmelee", "ReviewID": "UR11318879", "Content": "Me & my Boyfriend decided to go to Cozumel and had to check out the beach's in Playa so I found this place a what a deal and great location!!! You have to check out the massage place across the street best place ever and get deals!! The only problem I had with this hotel was the bed the most uncomfualbe I've ever been in my life!! Room was just a room but a great room very well designed!! But the bed was hard....I'm use to a really soft bed and theirs was not, But again it was not home. Great pool next time we go I would stay there again maybe for 1 night by the pool....I hear the rooms are better on that side. If you looking for something by the beach this is your place!! The staff was very nice and help us with all our needs.", "Date": "December 8, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Good memories have no price!”", "Author": "Bulgarian_travels", "ReviewID": "UR10891714", "Content": "It was difficult to rate this hotel since it is so different from the type of accomodation I would normally choose to spend my vacation days in. Most good hotels in the Playa area are the 'closed-resort' type, which I wanted to stay away from in order to get first-hand experience of Mexico. Hotel Kinbe seemed to be the best fit for this requirement of mine - it was located one block from the Playa del Carmen beach and one block from the main street with all the restaurants, shops and bars. Location is probably the hotel's absolutely best feature. The hotel is difficult to describe in words - everything in seemed to be handmade, including steps, bed, bathroom, front desk, lampshades... except for the windows, the AC unit, and the shower curtain(?). It was primitive but for some reason, very charming (and I dont get \"charmed\" very easily, especially by 2 star accomodations). We booked a junior suite, which esentially is a small size room (the 'normal' rooms are very very very small) - the price was something like $40 a night, which is also the cheapest I have ever paid to sleep somewhere. The only thing I was unprepared for and disliked was the very strong musty smell of mold... we had to buy an air freshner spray and spray real hard before entering the room every time to SOMEWHAT choke the smell. The hotel staff is esentially 1 front desk person, polite and with a good command of of English. Nothing to write home about, but no negatives to share either. I am not sure if I will ever choose to stay in Kinbe again, but to me, it still brings good memories for some reason. For travellers on a budget, who know what to expect and are fine with it, it may be a great choice. PS - If you rent a car from Cancun (Playa is a 1hr easy drive from Cancun), you can use it for daily sight-seeing trips from Kinbe. Street parking is usually not a problem. I recommend visiting Xel-Ha, Xcaret (definitely see the show at park close!) and Tulum. We did not have time for Chitzen-Itza.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Nice hotel! Don't expect too much either...”", "Author": "woete", "ReviewID": "UR10858772", "Content": "We booked Kinbe because it was Lonely Planet's author's choice and after checking its website... Based on the website's athmosphere and the rates, we expected a bit more of this \"zen\", \"stylish\", \"spa\" athmosphere in the hotel too. The central garden IS very nice, the shower finishing is very original, the balcony is comfortable! Really not a bad word about the service and the comfort, just it doesn't correspond fully to the athmosphere radiated by its website. Its strongest point: its location so close to the lovely beach (only a minute!) and right in the centre of town! Advice: book via their website (you'll be redirected to ihotelier.com)! The rate we paid was substantially lower than the official rates mentioned on the reception desk in the hotel. We paid 79 USD for a \"Moody\" double room. No breakfasts offered, no internet service.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kendallville, Indiana", "Title": "“Enjoyed the Kinbe - Great Location”", "Author": "carecat21", "ReviewID": "UR10404546", "Content": "After staying at many upscale all-inclusive resorts, my husband and I wanted a change. What we were looking for was a nice place to rest our heads, near the beach and in close proximity to shopping and restaurants. We didn't need anything super luxurious but wanted a place that had a character all it's own. The Kinbe fit the bill perfectly! We stayed in the least expensive room and although the room was small, it was very clean and we even had an ocean view. The rooftop terrace was an excellent place to watch the sunrise and enjoy the ocean breeze. The garden area was beautiful and the waterfall was also very nice. The shopping and restaurants within walking distance are endless and the beach is less than a block away. As long as you do not go expecting the amenities of a 5 star resort, I think you will love the Kinbe!", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Wonderful Stay”", "Author": "Selvig", "ReviewID": "UR8659396", "Content": "We stayed at the Kinbe, after driving around all of Playa del Carmen. The manager was extremely nice and even though they had been closed for Hurricane Dean, they let us stay in the Hotel. The bathrooms are perfect, the rooms are beautiful. We stayed in the junior suite and the days that we spent there were extremely relaxing. Thank you Stefania, you did a phenomenal job at making sure we felt at home, welcome and we had everything we needed. A/C, best water pressure in the Yucatan, quiet so close to the center of Playa but so silent, wonderful staff. Close to the beach and everything you may want in Playa,", "Date": "September 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Definitly Enjoyed the Stay”", "Author": "Odomca27", "ReviewID": "UR8351834", "Content": "My boyfriend and I went because my family went down there for my Aunts wedding. My dad stayed at the Kinbe with us (not in the same room) to save $$$. The rest of my family stayed at all inclusive places and I'm so glad we didn't because we got to eat at all the different restaurants and it was amazing! The hotel was very pretty and clean. I admit that it was more moist but there arn't windows, only shutters which made it feel very laid back and rustic. I noticed looking at websites now that they must have had a huge addition so we stayed in it before the addition. The lot next to the hotel when looked down upon from the roof looked like someones cheap home that was completely destroyed from the hurricane. The roof was gone though it was made of grass and you could see the kids toys and fridge inside. This must be where the addition is. We stayed in a garden room with a loft which was a lot of fun. The air conditioning helped a lot at night but we didn't want a TV since we didn't spend so much time in the room and when we did have x-tra time we were on the beach that is amazingly close. There is a restaurant called 'natural' I think and we went there for breakfast 2 mornings and I completely recommend going there. We also went to 'Acos los tacos' that had the best guac and tacos. Ugh. I want to go back just writing this. It was a decent hotel, I guess the addition are the better rooms now. The staff was great when we were there, the water heated up nicely though the shower floor was large stones that was very uncomfortable to stand on.", "Date": "August 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cork", "Title": "“Hated the Kinbe”", "Author": "Clíona", "ReviewID": "UR8256604", "Content": "My boyfriend and I were in the Yucatan Pen. for the month of July. We stayed in Playa del Carmen for a few nights at the beginning, and then headed down the coast. We saw the Kinbe when we were there and it was highly recommended by Lonely Planet so we booked it for our final 3 nights. I can't describe to you how disappointed we were. It looks great from the outside, with an indoor pool and a jungle of plants on view. But..... The room we stayed in the first night, was dark and very damp, and it didn't have the tv that we were promised. So we had to move for our second night. We were promised an up grade for the inconvenience, but when we went to the desk the following morning the receptionist was struck with a case of amnesia and we were moved to the same style room with an even smaller window but it had a tv. The pipe on the sink wasn't connected so we couldn't use it. I complained and was told it would be fixed when we came back from dinner. When we came home at midnight and I went to brush my teeth and the sink hadn't been touched. Needless to say I was furious and made a complaint and then eventually someone fixed it. The following day we didn't get as much as an apology. This room was as damp as the previous room, so much so all of our clothes were damp and sticky leaving the place, and I have a cold now as a result. On leaving when we paid they acted as if nothing happened and when I started to complain all he did was shove a questionnaire in my face and asked me to fill it in. We all know where that went when we left.....absolutely desperate, do not stay there!!!", "Date": "July 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "TEL AVIV", "Title": "“LOVED IT-DIFFERENT ROOMS”", "Author": "dardas", "ReviewID": "UR8232319", "Content": "we've been to the Kinbe on March, when Playa was very buisy and crowded and we were very happy to find this place. its a beutifull hotel, the stuff was very nice and helpfull and the location is great. you should pay attention to the different kinds of rooms: the size,the facillities, the floor (there is no elevator) and the view. we loved it.", "Date": "July 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“beautiful and comfortable”", "Author": "OttawaClaireBear", "ReviewID": "UR8108083", "Content": "My boyfriend and I had been backpacking for 2 weeks, and were at the end of our trip (and rope) when the cabana we were staying in down the beach turned out to be disgusting. So we decided to \"splurge\" on the Kinbe after reading a review in the Lonely Planet. We spent $58USD a night for their junior room. It was luxurious! The bed was very comfortable. The bathroom was lovely and the shower was warm and had lots of pressure. The mini-bar was much appreciated, and the food and drinks weren't even that expensive. The colours of the bedspread and curtains made it seem very tropical. It wasn't a large room, but it had everything you needed (except for a TV, but with the beach and the nightlife, you really don't need it). We didn't have a balcony directly off our room, but the walkway leading to the rooms have great views of the beach. The pool is SPECTACULAR! That was what impressed us when we first walked in, asking about a room. The pool is in an outdoor courtyard, with lounge chairs, and a waterfall that runs down a 4-storey wall into the pool. The staff is very friendly and helpful, and the security is great. You leave your key at the desk, and there is 24-hour security guard. There is also a lockbox in the room, great for passports and cameras. I really can't say enough good things about this place.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Hotel Kinbe, Playa del Carmen--bad experience”", "Author": "LosAngelesTraveler89", "ReviewID": "UR8106799", "Content": "The photos on their website are accurate--but, they are the public spaces. They look gorgeous. The room I got was another reality. First floor, windows looking out on pathway, to office on one side and laundry area on the other. You can't leave drapes open. If you did, you wouldn't see anything. A/C is of course necessary, so that white noise knocks out all the sounds from outside. But--the room smelled stale and distinctly noninviting. . . I had made the mistake of booking three nights ahead, plus a fourth night after a two-day trip to Cozumel. . . After a night, I asked at least that they cancel the fourth night and let me find another place. When the nice young man at the desk flatly refused to give me any money back, saying it was \"policy\", I asked to speak to someone else. I met a \"fuerte\" Italian woman in the office, who made me a \"deal\": I could cancel at my own risk, and she wouldn't charge me for the room if she re-rented it. . . Well, of course that was no \"deal\", but because it seemed a safe bet I took it. . . I went north many blocks and found an absolutely delightful accommodation--complete with personable owners and staff--at Fiesta Banana, away from all the hubbub and also near beach access. [--]", "Date": "July 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Great find in Playa”", "Author": "danzan", "ReviewID": "UR8105304", "Content": "Kinbe is a great little hotel with a nice range of rooms. We stayed in the garden loft room with a terrific view of the beach. We found the staff wonderful and helpful and overall the hotel was a terrific value for the money. We have scouted just about every hotel in Playa for our wedding and Kinbe was one of the three we recommended (Alhambra and Mosquito beach were the others, and we would skip M. Beach of we could do it over again).", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“great hotel in a perfect location helpful staff”", "Author": "giantsgrl", "ReviewID": "UR8070287", "Content": "this was my second stay at Hotel Kinbe. I was here two years ago and had a pleasant stay and with such a great location didn't hesitate to book here again. I called to make a reservation with Marianna then my booking was confirmed by Andrea. We arrived Sunday July 1st after a longish flight. . I was impressed immediately by the beautiful improvements they had made. The outside of the hotel looked great . Inside the reception area is amazing. The desk is right in the centre as soon as you walk in and we were warmly greeted checked in and shown up to our room which was called \" Garden\" .We loved our room it included a great large deck where we loved to sit out in the morning admiring the ocean view and in the evening relaxing after a day at the beach and having a drink and chatting. Room was great - king size bed a plasma tv to watch, well stocked mini bar and a lovely bathroom. The rooms are kept really nice and clean air conditioning worked great. The staff were really kind and helpful, we got excellent restaurant advice and all our questions were answered well and informative. It is just off the main street and we did not experience any problems felt safe and secure. Our room included a safe as well. We would usually walk to the Playa Tukan beach club which was a pleasant 10 minute walk along the beach. We liked this one as the had comfortable lounge chairs on the beach. On our departure the hotel arranged a shuttle for the airport which arrived right on time. We really enjoyed our stay here at Hotel Kinbe and would not hesitate to stay here again !!", "Date": "July 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“A good average choice”", "Author": "FinnishMexican", "ReviewID": "UR7721317", "Content": "The Kindbé is a very well located hotel, with varying service. Some of the staff are very helpful, while others dont seem to understand that they are there to serve the client. For example, there was a rain storm, which meant that arriving to our room the entire floor was covered in water. At 7 pm we were told that the cleaning staff had left, but they could borrow us a mop to clean the floor ourselves... The hotel is also quite far from Playa Mamitas, which is the place on the beach to be! Prepare to walk about 10 blocks. Price wise the hotel offers good value for money compared to many other Playa del Carmen hotels. There is no restaurant in the hotel, but many in the surroudning area. Anther tip, there is a great little massage place right accross the street which is run by a swedish girl. The hotel doesnt accept American Express either, and this is not published anywhere.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "houston, tx", "Title": "“Perfect as Playa del Carmen”", "Author": "PEDSED", "ReviewID": "UR7672608", "Content": "I stayed in room 5 from 5/13 to 5/19/07. The staff was young and courteous, and they were helpful with tips for local dining and a bicycle rental. I stayed in the room described by the hotel as “Moody”. The room was a bit small, but the king size bed was perfect for 1 to 2 people. The room was immaculate. The air conditioner worked great. I had a flat screen LCD television with at least 50 channels to watch. There was a safe in the room so I always felt that my stuff was secure. There is only one hotel entrance, so I felt secure overall. The shower was the best I’ve ever experienced in the last 3 years of going to Playa (I used to stay at the Blue Beach Hotel, which is being demolished to make room for condos). The pool is clean and was a life saver after being in the Caribbean sun all day. The hotel is literally less than a block away from the beach. Overall, the Kinbe Hotel in a very nice place. It’s perfect for Playa del Carmen meaning that it is pretty and comfortable but not snobby. I can see where the noise could be an issue, as the place is centrally located in the heart of the shopping and restaurant district, but I found that drinking mas cervezas helped me fall asleep in spite of the noise. I will stay at Kinbe again. Paul D. from Houston TX.", "Date": "May 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver Island", "Title": "“Hop skip and a jump to all you need in Playa”", "Author": "whistlz", "ReviewID": "UR7632740", "Content": "Situated in the heart of Playa Del Carmen, the Kinbe hotel is in an ideal location. A hop to the beach, a skip to aviendo 5, and a jump to some of the best restuarants and shops in Playa, make this hotel one of the best to stay at. It is a fair size, but small enough to be cozy, surrounded by beautiful lush trees, and gardens on one side, and a pool on the other. The pool is very clean, and the new renovation has made the entrance quite funky. The rooms were clean, the showerhead made for the best shower in Mexico. The staff all spoke exceptional english, and were very professional. The only difficulty we had was obtaining a room earlier than planned, as we arrived very late to find the security guard, who did not speak enough english to book us a room. We ended up at the Hotel Riviera Caribe Maya, and then moved the following day. A few days later, a couple from Holland were trying to check in after midnight, and having much difficulty, due to the security guard being on duty. They got a bit frustrated at the fellow, asking \"don't you speak english\", and thought I should mention here, that this is Mexico, and it is wonderful when people speak good english, but just imagine, if we could speak Spanish, in their country! A dictionary is always handy. I don't expect staff to speak a language that is foreign to their home! We felt this hotel was very safe, and were pretty casual about leaving electronics and our passports in our room. Will certainly stay at this lovely hotel again. (For those who read reviews about the noise, yes it's true...no matter where you go in Playa, they are building everywhere, so if it isn't your hotel, it's the hotel next door.) It's a beach town, meant for colour, vibrance, fun, and since us touristos keep going, they keep building. (The whole coast is destroyed from Cancun to Tulum...)", "Date": "May 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Houston", "Title": "“Never Again!”", "Author": "yvonneluna", "ReviewID": "UR7581241", "Content": "\"That won't happen to me!\" , I thought when I read the bad reviews. Sure enough, they did. I thought I would be the exception, especially because I had been e-mailing back and forth with Andrea at the hotel. When we get there, they told us we did not have a room because the one we booked had burned down!!! This is when they decide that they would look for another hotel to place us in! I was Livid! The next day when we show up there, they give us our room and literally, it's just a room! We were better off at Riviera del Sol where they placed us the night before. To top it off, we could here music and feel the vibrations from the club next door, Voge, until 4 am! Sure I went to have a good time, but once you are ready to sleep, you want to sleep in peace. This never happened here. I was very disappointed with Kinbe and I would never stay there again. Lastly, every time you leave your room, you had to turn in the keys! Are they trying to see who's not in their room; I don't think that's any of there business! Hope this helps, Yvonne", "Date": "May 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "san antonio", "Title": "“Lied from the start”", "Author": "lotsatravel4me", "ReviewID": "UR7484521", "Content": "CAlled the hotel directly , asked to 2 beds .. they said yes room has 2 beds... got there one is a bed one is a futon... after many excuses we deciede to rent room. Had to climb literally 5 flights of stairs... NO ice machine, NO TV, tolets barely flush so you must put your paper in waste basket. Then 3rd Night they rented our room to someone else after we CONFIRMED our stay with the front dest that morning. They put our belongings in trash bags and put us on the street at 8pm at night! I have never been treated so poorly. Went across the street to hotel calibra rate was only $66 a night and on the beach vs $133. Look its got charm and the pictures look good, but the rooms are very small and do not represent the best value in Playa... Many hotels are there close by so I would not make this my first choice.", "Date": "April 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Playa at Your Own Pace”", "Author": "LaMarianina", "ReviewID": "UR7365617", "Content": "We really enjoyed our stay. The room was spotless. The front desk staff were friendly and gave excellent information. Close to the beach and great night life. Great atmosphere.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nova Scotia", "Title": "“Great Kinbe stay!!”", "Author": "kirbykim", "ReviewID": "UR7291512", "Content": "We absolutely loved our room and our 7 day stay at Kinbe! Like others have already stated, if you are an “all in” type person this is not the place for you. But if you are looking for a great location and love to be in the “middle of the action” this IS the place for you. With Kinbe being located in downtown Playa del Carmen, there were so many great restaurants, stores and shops, night hotspots for the party person in you, and last but not least the beautiful blue Caribbean Sea just one block down the street. But if you are a person who is early to bed, then the noise may be a problem for you. We stayed in room number 13. It has a great balcony with views of both the beach and of part of 5th Ave. The hotel grounds are beautiful, the cleaning staff was fine and the front desk folks were always friendly and went above the call of duty during our stay. Two thumbs up from Kim and Kirby, we will come back to Playa Del Carmen and to the Kinbe Hotel!", "Date": "April 7, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "dallas, texas", "Title": "“Excellent Value”", "Author": "lazybeacher", "ReviewID": "UR6745324", "Content": "Its funny how some people hear noise! We stayed 10 nights at the Kinbe in January and found it to be a very gracious hotel and would stay again. The small amount of noise amounted to a hammer bing once in a while. No loud electric drills, or saws of any kind. We found the natural way of building the new wing to be very refreshing and rather enjoyed watching how it can be done by hand without power tools. Amazing to watch. Our room was one of the small rooms, double bed. Yes it was different from home, but very clean and comfortable. The bath is small, but clever in design and more than functional. The a/c can freeze you out. We had to ask for an extra blanket! We very much enjoyed the roof top view. We could sit all afternoon and enjoy the view of the ocean. For the great price of this hotel, you will not be dissapointed. Location is the best in Playa. 75 feet to Starbucks and Java Joes, which I prefer, and Hagendaz across the street. Then 75 feet in the other direction is the beach. Staff was most helpful and very honest. They would do anything to make your stay enjoyable. We look forward to returning again to Hotel Kinbe. Thank you for a great 50th birthday party that lasted 10 days. Ps. If you are looking for the Hyatt or Marriot stay home. I give Hotel Kinbe a 10.", "Date": "February 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dallas", "Title": "“Awful Hotel”", "Author": "MexicoTravelerDallas", "ReviewID": "UR6552315", "Content": "Booked our stay through there website. Photos are misleading. Arrived there and the room smelled of mildew and workers were renovating our floor . Room was very cramped and dark! This is a place for teens who just need a place to crash.They offered us another room for only one night of our stay and said we would be back in this room after- no exceptions. My wife was extremely unhappy. We asked if they would just cancel our reservation and we would move on. She said sure but we will charge you anyway. It was so bad we left and took our chances. I did end up paying for the stay we never had because the hotel did run the charge. Stay away from this hotel. Customer service is non existent!", "Date": "January 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Great Location with right price”", "Author": "ScubaJennifer", "ReviewID": "UR6363703", "Content": "Perfect location in the heart of Playa. Simple walk to beach, right off of main shopping/restaurant strip (5th Ave) and good dive shop right across the street. Room was small and simple, but quaint, warm property and staff. This is not a place for people looking for the elegant or fancy accommodations. The closet and the bath room are tiny. The stairs to most of the rooms may be tough for people with limited physical ability. There was construction noise all day, but with the building boom in Playa you would be hard pressed to find a quite location. Besides, if peace and quiet is what you are looking for, then you should not be headed to Playa del Carmen anyways. Try Akumal or Tulum for a tranquil Mayan getaway.", "Date": "December 11, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“lovely boutique hotel!”", "Author": "trig456", "ReviewID": "UR6121586", "Content": "this place is absolutely gorgeous and has so much ambiance! a unique boutique hotel, not your average and boring chain... Even the standard rooms are very pretty! there's also a rooftop with a beautiful view and the beach plus the main street is only a few steps away. the owner is very friendly and when i was there she gave us breakfast coupons for a near by Italian coffee place serving delicious croissants and cappuccino!", "Date": "November 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland", "Title": "“My favorite Playa place to stay!”", "Author": "rortenzi", "ReviewID": "UR6090811", "Content": "This is quite simply my favorite place to stay in Playa. The hotel is very, very affordable and you couldn't ask for a better location. We walked to everything and felt like we were right in the perfect place to do so. It's a very cute and cozy place to stay and I always recommend it to friends. I posted some pictures that I took of the views from my room. Such a good experience!", "Date": "November 9, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "FL", "Title": "“Bad Experience”", "Author": "Trav3l", "ReviewID": "UR5926952", "Content": "Pro's of my experience *Cute hotel with tropical feel * Close to beach * Extremely close to 5th st * Walking distance to bus stations * Nice breezy view from the patio on top of hotel * Nicely renovated bathroom Con's of my experince * Constant construction on all sides * Power and Water went out and there was NO effort made by the staff so ended up sleeping on that upstairs patio due to the unbearble heat and couldn't even take a shower to cool off. Booked on Hotels so couldn't cancel, but ended up leaving as soon as possible in the morning. * NO POWER and NO WATER the ENTIRE STAY except the first 2hours (only at the hotel one night) * Tons of tiny stairs with no elevator * EXTREMELY small room ... barely enough room to walk around the bed * When there was power, the ac did not cool very well * No TV, when hotels claims to have them * TERRIBLE Restaurant experience next door - DO NOT EAT THERE Besides the construction, and the lack of electricty and water for the ENTIRE night the hotel is fairly decent and inexpensive with a good location. It would have been less expensive to book direct through the hotel.", "Date": "October 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "1.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Bad timing...bad experience”", "Author": "brunettegirl_7", "ReviewID": "UR5837432", "Content": "This hotel is cute but when we were there, there was construction next door and there was no air conditioning in the room...nor any windows for air circulation and no running water at night! It was the worst night I've ever had as it felt like our room was a stale 120 degrees. In the morning we checked out and booked ourselves at another hotel. The staff understood and I admit that it wasn't their fault the power was out...but I wasn't about to stay and find out if it was just a one night issue. Ask the hotel about the construction before you book your stay. The heat at night was a common compliant among all guests there, not just us, I found out after meeting another girl with the same issue.", "Date": "September 26, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Nice location, good value”", "Author": "TravelingSquirrel", "ReviewID": "UR5578539", "Content": "We stayed at Hotel Kinbe on for one night as a stopover on the way to the airport. The location is excellent, just a few steps from the beach and 5th avenue, which has great restaurants, nightclubs, and shopping. The rooms are very small but comfortable and well decorated. There are no elevators, so expect to carry your luggage up three flights of stairs if you are on the top floor. Staff will help you if needed. The staff is friendly to you if you are friendly to them. They have a selection of books in the back room for guests to borrow, and each room has a safe and a mini-fridge with drinks and snacks for purchase. This hotel is a good value for the price. My only complaint is that the bar next door is loud and lively and you can hear music thumping and people yelling long into the night. It was not loud enough from our room to keep me awake, but if you are a light sleeper I would suggest staying elsewhere.", "Date": "August 8, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "kansas city, mo", "Title": "“Avoid this hotel like the black plague”", "Author": "A TripAdvisor Member", "ReviewID": "UR5406603", "Content": "where do i begin. At hotel kinbe, i got $400 dollars stolen out of the safe in my room along with my cell phone. The hotel employes are the only individuals who have access to the room, however, the owner took no responsibility whatsoever. She would not help at all, and blamed the missing money on myself. She was very rude. Also, workers started hammering nails and working on the hotel every morning at 8:30 and continued throughout the entire day. One morning our hot water went out and we were stuck taking cold showers and another day our electicity was out so we had no a/c. it was 115 degrees outside, so you can imagine how hot it got in the room. There are lots of other hotels in the playa area that would be a much better choice. My advice is to avoid hotel kinbe, try to find a place you can trust. getting all of your vacation money stolen on the second day is not fun...believe me.", "Date": "June 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Groovy hotel”", "Author": "moorefa", "ReviewID": "UR5295477", "Content": "We stayed at this hotel for 7 nights in room #18. I really liked this hotel. Our room was one of the split level ones and looked out onto the courtyard. The stairs inside were a bit rickety and it was a bit dark - could have done with an extra lamp - apart from that it was very nice. The room was very clean and the maid service was always very good. Our room was very quiet - we couldn't hear any noise from the bars on the street. The a/c unit was good and kept the room cool. I liked the bathroom with its strange pebbley shower - might not be good if you are not very nimble on your feet though. The location is perfect, close to bars and restaurants and also a few metres from the beach. You can also walk along the beach to get the ferry to Cozumel. The rooftop terrace was great and you get a great view of the sea. This is a small hotel with plenty of character. The staff are very friendly and helpful. If i stayed there again i would perhaps request #19 as it had a few more windows. This is a good hotel for couples - maybe not so good for young children or older people due to the stairs.", "Date": "June 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "N.Y.", "Title": "“Be Careful It's not Perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR5189008", "Content": "Kinbe' is a good hotel and I can only speak for the room that we stayed in, room #6. Great View of the ocean, great balcony, very close to the street and the \"goings on\". Next door to the hotel is a hotel with an outside bar that plays house/tecno music every evening until about 2am. Needless to say it's very loud and made it difficult to sleep some nights. They did recieve a city noise ordaniance while we were there but it seemed to only curb the noise for a night or two. Also there are two construction sites right next to the hotel. One accross the street and the other on the opposite side of the building. Between the loud music and the construction it was difficult to get a good nights sleep. One particular night, the hotel had recieved many complaints from other guests I was told, was when there were some people working on a front door for the currency exchange that was located on the back side of the same building. Hammering and sawing until about 1am. The hotel only offered an appology and a handshake. I understand that this was not the hotels fault but it was the fault of the people that ran the currency exchange. Nothing was offered, and it seemed like nothing was done to accomodate the fact that my wife and I, and many other guests, were not allowed to sleep for most of the night. Customer service skills were lacking by management during this ordeal. Lastly, our package deal included round trip to and from Cancun airport. They never picked us up to bring us to the hotel when we first got there. We had to take a Van transport (which dropped us off 6 blocks from the hotel) and had to pay $18.00 US, which we were never compensated for. OK the good stuff about the hotel: The rooms were fantastic, very comfortable. No T.V. (your on vacation you don't need T.V.) Very Clean Rooms. Staff was pleasant. Night time desk clerk has the 411 on every thing, allow him to help you will be happy he did. Close to the beach, the pics on the website don't do it justice. Very Close to 5th ave. A/C cranks and does drown out the noise during the evening but doesn't take care of a pounding base amp from the bar next door. Price was right. If you get a chance take advantage of their pacakage deals, they are very easy to work with. I wouldn't stay there again I would try one of the other hotels along the beach next time.", "Date": "May 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Québec", "Title": "“Perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR5037689", "Content": "The place is just perfect! Great location, 2 min of walk of the beach, 30 seconds from the main street where you can walk to find a great restaurant or boutiques. It was the best hotel of the week for us in our trip in Yucatan. If you pay cash there is a 10-15% deal. No Tv, small washroom, and i did not like the floor of the shower as it was tough for the feet but it was so perfect that even if the washroom is so small, this hotel is the best!!!", "Date": "May 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "ocala, fl", "Title": "“Great place for great price”", "Author": "A TripAdvisor Member", "ReviewID": "UR4991131", "Content": "Hotel Kinbe is a small three-story hotel about a half-block from the main pedestrian drag and the beach. It has a small tropical courtyard and a rooftop deck complete with lounge chairs. We stayed during Superbowl weekend in 2006 in a small, one-bed room on the third floor. Yes, we had to bring up our bags, but we didn't have much, so thought nothing of it. And we didn't think the stairs were rickety. Instead we thought they were solid and cool. (The stairs and supports are cut from logs) We never had a problem with noise or hot water, either. The people who ran the place were great. They greeted us every time we left or returned to our room and even helped us when our taxi back to the Cancun airport was delayed. We also intermingled with some of the other guests who were very nice. The only regret about the place was that you can't flush toilet paper down the toilet, but for many small hotels in Playa, you can't do that. Maybe it's a small thing, but it's kind of gross. Although the cleaning service, emptied our trash daily. I thought it was a great place if you want to intermingle more with the local culture.", "Date": "April 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Kinbe Bad”", "Author": "A TripAdvisor Member", "ReviewID": "UR4735153", "Content": "My friend and I reserved a room with double beds, A/C for $60US. When we arrived, we had to lug our bags up 2 floors of rickety steps (no help offered). The room was tiny, no A/C and ONE double bed. When we left- the girl at the desk called the manager/owner (Italian woman) when I was charged $75US. She said that all her standard rooms were single beds and blew me off as far as the cost. I paid of course. I would not recommend this hotel to anyone when there are some GREAT places for less in Playa del Carmen like Casa de las Flores.", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Baltimore", "Title": "“Kinbe is cool...”", "Author": "DosCoronas", "ReviewID": "UR4594696", "Content": "We stayed four nights at the Kinbe in Feb 2006. The staff was very friendly, helpful and responsive. Our two-level room was comfortable, clean and a bargain considering we were only one block from the beach. The rooftop deck was a treat too. We had an in-room safe and a mini-bar fridge. Our room was on the upper floor and the bed was located in a loft with a large window that allowed for nice breezes at night. We only used the AC one night when the breeze died. We had two additional windows downstairs too. Water pressure was good with plenty of hot water. The Kinbe does have drawbacks. Avenida 1 ends at calle 10 so a lot of traffic passes. Avoid the rooms on the street. There is typical city noise when the windows are open, but it's not terrible. PDC is pretty much a 24 hour carnival these days and the Kinbe is located near a lot of restaurants and clubs. There are many steps to climb to the third floor rooms and the roof deck. This is difficult when carrying heavy bags. We didn't have a car, but note that the Kinbe has no off-street parking. I like leaving the key at the desk. I didn't have to worry about dropping it somewhere, especially in the sand. Someone is at the front 24 hours. Overall, no real complaints and a pleasant stay.", "Date": "March 8, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Charleston, SC", "Title": "“Whats that smell?”", "Author": "A TripAdvisor Member", "ReviewID": "UR4474962", "Content": "My father and I came down to Playa del carmen for a couple of days for a meeting. He booked us at Kinbe, thinking it's price is reasonable and just how long would we be in the room. When we arrived at the hotel my first impression was actually great. Nice little quiet hotel. We checked in with the front desk and the girl at the desk showed us to out room. We were provided room #4. In a hurry and our taxi waiting to take us to our final destination we dropped off our luggage. When we entered the room the smell of raw sewage about knocked me off of my feet. We were told by the girl at the desk that the smell would be taken care of. When we went to leave, I locked the door and it could be pushed open with the slightest bump. We notified the girl at the desk and requested that she put us in another room. She declined and said she would have the door fixed. After explaining to her that we were leaving to go to a meeting and that our luggage was unsecured in a room that could not be locked and that we would like to change rooms she still was not helpful. Now I must say that the door lock was fixed upon our arrival back to the hotel but that awful stinch was not. They made it even worst by adding what I believe was viniger and bleach. After one night of staying in this hotel we opted out and took a loss and moved to another hotel. One thing that disturbed me was that when you leave the hotel to go out to the city you have to leave your key at the desk. I would not recomend this hotel to anyone that I know.", "Date": "February 21, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Hong Kong", "Title": "“Why some said Clean but some said Dirty”", "Author": "A TripAdvisor Member", "ReviewID": "UR4467871", "Content": "My hudsband and I just came back from Mexico (2-week trip from 27/1/06 to 13/2/06). In playa de carmen, we stayed in this hotel because of (1) recommended by Lonely Planet (book version Year 2005)(2) recommended by the agent in Cancun Airport showing us a hotel brochure with nice photos. We stayed 2 nights - one night at a standard room (USD 6X) and another night at an executive room (USD 8X). The hotel made such arrangement because standard room for 2nd night is fully booked. I now can explain why some of you said the hotel is tidy and clean but some said it is poor. In the room we stayed frist night, this is with a new split-type air-conditioning unit - the machine is efficent and new. Although both the toilet and bedroom floor is initially wet (make you very uncomfortable when you step in the room), the sleeping environment soon turns acceptable when you set the A/C on. The cleaniness of wall, floor, small table and toilet is also acceptable when considering the price is USD6X, although the room is really very small (the bed is small but still good for Asian People like us) . However, when we changed to that executive room next night, the situation is completely different. The window type A/C (obviously old type), the wall decoration (color defading and nearly falling down), toilet status, etc. are OLD and DIRTY. Also, because of the old A/C, the whole room has a bad smell... And this room costs us even higher - USD8X! When wandering around Playa De Carmen, there is really a lots of hotel to choose with a cheaper price too. So, don't believe solely in the hotel recommendation of Lonely Planet, Year 2005 upto now, there is already lots of changes - said so, because this is true even in other places of Mexico. I won't recommended this hotel. But if you still want, please choose a newer room (the feature is - the room with new split-type A/C shall be better; but be carefully NOT ALL standard room is with newer A/C!) P.S. I saw some guests complaining the room situation at the reception in one day morning too......", "Date": "February 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Ohio, US", "Title": "“Couldn't have been happier”", "Author": "A TripAdvisor Member", "ReviewID": "UR4464107", "Content": "I am very surprised to read the recent reviews on the Hotel Kinbe. We stayed January 25th-February 1st and had such a great experience. I am kind of tired of people saying they weren't expecting a resort style hotel and then expecting a resort style hotel. The reality is for the price it can't be beat. When people complain and suggest another hotel it is always more money. We loved our room, #19, the rooftop deck, the location, the housekeeper and well we loved most things about the hotel. In fact another couple was looking at the hotel as we were headed out one day and we gushed so much about it they decided to stay. I hope they had as great experience as we did. Yes you have to put toilet paper in the garbage but you have to do this everywhere in town. The places that didn't request it seemed to always be clogged and overflowing. That is the sewer system in a mexican town not a U.S. city. Each day our housekeeper came and folded our clothes that were strewn all over the room from late night parties and wrapped up jewelry in safe location! We loved her and left her nice gratuity to say thank you. Yes the Blue Parrot burned down but I've watched a half a town be saved from burning in the USVI because we all picked up a hose. I wish everyone had a great experience like we did. I was a little nervous staying there and although the staff weren't our new best friends we were just so happy with the place. By the way, I can't emphasize how great the location is. Literally 3 doors down from 5th and not even half a block to great part of beach. In front of really expensive places the beach smelled, was filled with boats and rocks. This was our first time to Playa and we are already booking trip for next year. Would I stay at Kinbe again? Yes, I won't only because I don't like to stay or eat in the same place twice but would suggest others give it a chance. By the way, Playa is great but go down to Tulum beaches if you can. We rented a dune buggy for cheap and Tulum is a great break from people and expensive food and drinks. Try Charlies, the best margies we had in Mexico!", "Date": "February 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portland, OR", "Title": "“LOVED our stay at Hotel Kinbe!”", "Author": "888julieanna", "ReviewID": "UR4462718", "Content": "After reading some reviews of Hotel Kinbe and seeing it not favorible, this saddens me. We stayed at the hotel in November of 2004 and it was amazing. At first I was a little scared to have a room with no TV or internet connection, but it turned out to make our experience in Playa that much more enjoyable. We stayed out later, enjoyed dinner on 5th Ave, talked more, went to the beach - which is steps from the room. If you are looking for a hotel like the Hyatt, or Hilton, or any large hotel that you would find in the states, this IS NOT for you. If you want to stay in your hotel room, and eat food from the cafe in the hotel, this IS NOT for you. Live a little, take a chance to step outside of your box! I would recommend this hotel to anyone who isn't afraid to take a step off the beaten path. The rooms were clean, fresh towles and sheets everyday. There was never one notice of mold, or of sewage in our room. Nor did I hear anyone at the hotel complain of it. Remember, the hotel is in the tropics, it's humid... you have to turn on the AC everyday. One reviewer complained of a nearby bar and hotel burning to the ground while they stayed at Hotel Kinbe. Why would that make your stay at this hotel bad? I understand it must have been scary, but really.... The rooms and the hotel were just like the photos on ----. Looking at them brings back very fond memories!", "Date": "February 15, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Horrible service”", "Author": "A TripAdvisor Member", "ReviewID": "UR4413556", "Content": "We stayed here for a little over a week. It started out ok, except for the nasty sewer smell in the rooms, mold on the walls, loud a/c unit (that leaked), and a flood in our room on the third night from a little bit of rain. I actually would have kept my mouth shut if it wasn't for the terrible service (especially the manager), who made it clear to me that she did not care about our comfort or resolving any of our many issues. What's bad is I overheard a number of other customers with that manager, and all the conversations sounded the same as mine. I wasn't expecting the Hilton by any means when I went down there, but just a little bit of customer service would have went a long way. I will never go back to that hotel again, unless it is completely renovated and under new management. On the other hand I have also stayed at the La Tortuga, a little more money but well worth it. They actually care if they have happy customers. La Tortuga also has a nice pool, restaurant, bar, and friendly staff.", "Date": "February 4, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Boise, Idaho", "Title": "“Bad Experience at the Hotel Kinbe!”", "Author": "spiffyniffer", "ReviewID": "UR4396297", "Content": "Recently, four of us stayed at the Kinbe for six nights, and were very dissappointed with the hotel conditions and management. We paid $80.00 per night and expected cleaner rooms at that rate. There was a musty smell in our room, #11 and black mold spots on the bathroom wall, shower curtain and on the built in shelf next to our bed. On our second night there we were awakened by a loud explosion as a car caught fire as well as the beachfront Blue Parrot Hotel Bar and Hotel Costa Del Mar, just across the street from the Kinbe, burned to the ground. We opened our door to glowing sparks and debris which landed on the roof of the Kinbe. My sister let the employees hook a hose up to her sink and we helped get the hose to the roof where small patches of the thatched roof were catching fire. At this point, we felt our safety was threatened, so we packed our bags and headed to another hotel 4 blocks away where the rest of our family was staying. Once our luggage and documents were safely there we headed back to the Kinbe. The air was extremely thick with smoke and burning our eyes, in short uninhabitable. Soon after arriving back at the Kinbe the police told us to evacuate as we sat on the hotel steps. We stayed the night with our family at a cost of $60.00 for all 4 of us( a very gracious rate, thanks to the Hotel La Tortuga). We returned to the Kinbe the next morning and asked them to refund the $60.00 that it cost us to stay elsewhere. To make a long story short after a few days of stalling they refused to pay the extra money that we were out. This seems like a pretty selfish way to make money considering we had stayed behind and helped to keep their hotel from burning down. The manager not only refused the refund, but was very rude stating that we should have talked to her instead of listening to the police, but we had never met her before then, so didn't recognize her in the confusion of a fire. On our third night I finally had to ask for clean glasses in our room since the same extremely filthy ones had been there since we checked in. The view from the roof was the only saving grace of this hotel, but the beachfront local also meant loud techno music until at least 4 a.m. kept us up all night. My sister's room #1, also flooded during our stay, and a foul sewer smell emitted from her bathroom. She was given 5 towels to deal with the water. All of her belongings were soaked. Again no refund, no apology, no new room and terrible customer service. We cannot reccommend the Hotel Kinbe to anyone planning to stay in Playa Del Carmen.", "Date": "January 29, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Hotel”", "Author": "Catty82", "ReviewID": "UR4164979", "Content": "In Brief - Rooms good size, good location off 5th Ave and V near beach, really nice staff, nice decor, rooms slightly damp (maybe due to hurricane?), air con and room safe. I really liked this hotel. The rooms were a nice size and the beds were comfortable. we stayed in an executive room but would have been just as happy with a standard room as the only difference was the size of the bed. The shower was nice and strong and the water hot, the bathroom is also a good size. The hotel is not on the beach but its is a 2 min stroll at the bottom of the street. The air conditioning works really well and gets rid of the slightly damp smell that was in the room when we arrived. all in all I was very happy to sleep off my jet lag in this friendly and welcoming hotel, definitely a good choice!", "Date": "December 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Gaston,SC", "Title": "“Kinbe was a great choice”", "Author": "cop0251", "ReviewID": "UR4155511", "Content": "We had stayed at large resorts in Cancun and Puerto Rico and were looking for something as a quick vacation and not too pricey. We looked at several small hotels and non-AI places to keep looking at the charming Kinbe. We saw the small rooms and have experienced Mexico before, we booked our trip through Travelocity for a grand total of $1045 we were on our way to Playa for 5 nights. We arrived at Kinbe and checked in with Elena she let us look at a couple rooms to see which one we wanted. The first room was the two level room didnt want to climb steps to get to the bed. Then our original room which was not a king bed, then our king bed room which we paid an extra $20 a night for. It was just a king bed, small table and chair, and a bathroom. This was all we expected for our @$60 per night. We were pleased with the hotel completely. This is a great value in a great little town which is growing way too fast. We hope to go back soon, hopefully in May'2006. Thanks to Elena and the staff at Kinbe our stay was great.", "Date": "November 30, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Lexington, KY", "Title": "“Enjoyed our stay”", "Author": "skivob", "ReviewID": "UR4149392", "Content": "We enjoyed our stay at Hotel Kinbe. Although our room, #15, was small, (and the bathroom even smaller!), we found this hotel to be clean, comfortable, with a terrific location. The grounds and common areas were spotless and the staff was pleasant. If you like large, all-inclusive resorts, you will probably not enjoy the Hotel Kinbe, but if you need a clean, simple place to stay, we would recommend the Hotel Kinbe.", "Date": "November 29, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Norway", "Title": "“Too expensive for what it offers”", "Author": "GDX", "ReviewID": "UR4101610", "Content": "For our honey moon we decided to go to Playa del Carmen as I was there several years ago, 1997/98, several times when I was working for one of the famous cruise lines. I used to like the more calm atmosfere found in Playa than the spoiled one of Cancun or West coast of Mexico, Acapulco, etc.. We did a bit of do it yourself so I found the hotel Kimbe through an Italian travel agent that has a dedicated web site about Playa del Carmen, then looked up some reviews on the tripadvisor about this hotel that looked OK so we decided to book it through this travel agent. We knew that hotel Kimbe had small rooms but it was close to the beach on 5ave. so it was enough. Thanks to a review found on tripadvisor we found out that the best room was the junior suite number 6 so we booked that one in particular, the #6 with confirmed e-mail and fax. The trip: After a long trip from Europe we arrived in Miami to catch our connection to Cancun. Here after more than an hour long waiting in a cue for to go through the US Immigration we finally made it to our gate to catch the Mexicana air conection to Cancun. Arrived in Cancun we found our luggage zipper locks broken, cut with pliers, and found inside the luggage a note from the US Miami airport security, that have inspected our luggage during the transfer, because thei scanner could not read it well!?!? we only had shoes and diving goggles inside. Plus all combination locks can be safely opened with a method that airport security should have. The luggage was now permanently damaged and not usable any longer. Mexicana told us that they were not responsible for this as the US security did the inspection. So we had to buy one new luggage for the return trip. \"---\" Playa del Carmen: Once arrived to the hotel Kimbe here we found the surprise, the junior suite #6 was not available beacuse occupied? so they gave us the one above, under the roof. 1st.the aircondition was old and extremely noisy when running. 2nd. the room was dirty and smelly, but after such long trip we decided not to argue anymore and just go to sleep. During the 1st. night we woke up several times during our sleep due to some kind of roaches climibing on our faces, not a nice feeling. The day after once we showed the, promptly killed, roaches to the manager she said, \"OK they are not roaches they are wood insects\", well it does not matter which kind of insect they are when they wake you up in the middle of the night because their legs tickle your neck or face. After a log argument with the manager about the room, that also costed 95USD per day (without breakfast), we managed to move to our original boked junior suite #6, as the people there were living that day. This room was nice and cleaner I have to say, but for 95USD x day it is definitely too much. Still the cleaning lady was not cleaning the bathroom properly, the service was really lousy. The place \"Playa del Carmen\": a shock! prices in general tripled after 7 years, and the Reality Business took over cementing appartments everywere. One could see that the Cancun or Acapulco style had started to take shape and ruin that place. Not anymore a little and quite hideaway. We'll never go back to Playa del Carmen or Mexico. For those that still have to discover it or conveninet because living in the Usa, and look for quite places to relax, we suggest to find small places along the Yucatan coast, south, such as Akumal, or other little villages away from the commercial areas. An all inclusive package it turns out to be much cheaper than just renting a room. I hope I have not been to tragic but we have been travelling a lot in the Caribbean and Mexico areas for both pleasure or business and during this recent trip we saw the changes in that particular area of Mexico. We want to thank again Tripadvisor for the help has given us when travelling around the World.", "Date": "November 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "HOUSTON, TX", "Title": "“Loved this cute Hotel”", "Author": "jessann98", "ReviewID": "UR3746250", "Content": "My fiance and I went last October. We didn't know what to expect, but for 4 nites @ $440.00 per person from Houston, it was fantastic. Staff very friendly and helpful as far as good places to eat and what trips/day excursions to take. We went to Chichen Itza...wow! That was awesome. The hotel is very very close to the beach. I rec. this place to anyone looking to take a vacation and not spend too much $$. Restaurants are as expensive if not more than restaurants here. Playa is a touristy place. you will find a TGI Fridays there. :( I expected 5th avenue (main street) to have vendors at \"Mexico prices\" nope...they wont even bargain with you. Waay over priced souv. items!! That was the only bad thing about playa del carmen.", "Date": "August 8, 2005"}], "HotelInfo": {"Name": "Kinbe Hotel", "HotelURL": "/ShowUserReviews-g150812-d273217-Reviews-Kinbe_Hotel-Playa_del_Carmen_Yucatan_Peninsula.html", "Price": "$87 - $157*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle 10 norte entre 1 y 5 Avenida</span>, <span class=\"locality\"><span property=\"v:locality\">Playa del Carmen</span> <span property=\"v:postal-code\">77710</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "273217", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/31/67/316789ce2f8730cf663b2a7a6d7ccb8b3large.jpg"}}