{"Reviews": [{"Content": "acceptable hotel I stayed at this hotel during the Frankfurt Book Fair. Although it was quite pricey during the time, I had no problems with the hotel. The double room was quite a nice size, and a bigger room than I would expect for Europe. The shower was sort of odd with the half shower door, but you get used to it. The location is nice enough, close to the train station and right by a street car stop. I felt comfortable the whole time I was there. I would say that if a person were to stay there during the summer, it may be hot, due to no A/C, but in October, the temperature is comfortable enough to have the fan. Considering the price of al hotels durnig the book fair, and the exchange rate, this was acceptable, and I could not see myself spending more for that time for a more upscale hotel.", "Date": "Jun 15, 2008", "ReviewID": "UR690061018", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "Bobbie43"}, {"Content": "One of the worst in Frankfurt I just returned from a one-night stay at the Memphis hotel. The hotel was one of the worst value for money hotels in the city. Although centrally located, the hotel is very close to the city's red-light district and is located in a street rich in ethnic shops and restanrants.Rooms are small and not very clean - the garbage bin in the room had chewing gum stuck to its rim, the carpet was stained and the closet was dusty. No heating/cooling system could be found in the room, and the only way to cool down was by using the fan located on the desk.The bathroom was also quite low on hygiene - the towel provided by the hotel was frayed and stained and the shower stall floor was grey- water temperature kept changing from hot to cold and water pressure from the shower was so low that washing one's hair was nearly impossible.The only good thing about the hotel was the breakfast which consisted of a selection of cheeses, cold cuts, cereals, and eggs, but was lacking in water - you had to fill your glass of water from a cooler located at the reception.Overall I think that this hotel should be avoided as it may look like a 4-star but is in reality far from being a 3-star", "Date": "Feb 14, 2008", "ReviewID": "UR941050672", "Ratings": {"Service": "-1", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "Anon58"}, {"Content": "Convenient Location The best thing about this hotel is the location, within walking distance of the main rail station and also ideally placed to get into the centre of town. We went there for the Christmas markets and this was a 10 minute walk away.We had read that it was near the red light district but it is in fact a couple of blocks away. I felt perfectly safe walking back at night.The rooms are clean and appear to be freshly decorated.We asked for a non-smoking room, but clearly there had been smokers in there at some time, as it reeked of stale smoke.We had rooms at the front, and it was still noisy despite the double glazing, so would not advise a trip in summer.The staff are pleasant enough, although not terribly friendly.The breakfast was very good, although very busy on a Saturday morning, and we had to wait for a table, which are quite crammed together.Despite the website advertising breakfast until 11am, this was not the case, and finishes at 10am which is obviously a very busy time.", "Date": "Dec 19, 2007", "ReviewID": "UR421123783", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Happytraveller55019"}, {"Content": "Strange depressing atmosphere.... I had just been to Munich where I stayed in a lovely hotel and was in Frankfurt to work the next day, so this was a one night experience only. I am happy it was really, photographs may look okay but there is a strangely depressing atmosphere in the hotel. The rooms look like they have been refurnished in the last few months but certainly in number 66 some of the guests have not treated them well, mine had torn curtains. The pillows were really huge fat things that hurt your neck so I made something to sleep on using some bedding. The area is full of sex shops and kebab houses but is not too far a walk from the main train station. The lady at breakfast seemed really nice. So there you go, if you need somewhere to stay for 85 Euros a night that is reasonably clean you could do much worse but like me you may feel a bit creeped out by the atmosphere. lee.wilson@gmail.com", "Date": "Dec 14, 2007", "ReviewID": "UR954734743", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "1"}, "Author": "lee_bear"}, {"Content": "Excellent Value I have stayed at the Memphis a couple of times both in single and double rooms. Whilst the single room was quite small, the double room was a reasonable size compared to other hotels in a similar price-range.The rooms are spotlessly clean and reasonably new with mini-bar, cable tv, comfortable beds with nice linen and breakfast included. The staff are very friendly and helpful. The location is greatly for travelling as it is only a ocuple of blocks from the haubtbahnof and S  U Bahs and ten minutes walk to the Old Town or Musums.I will definitely stay there again when I'm in Frankfurt.", "Date": "Nov 6, 2007", "ReviewID": "UR249992505", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Lurls"}, {"Content": "A great budget hotel, ideally located I stayed at the Memphis Hotel for two nights. The hotel is very modern, the rooms were basic, but VERY clean and comfortable. For the money I paid to stay here I was pleasently suprised. My rate included breakfast which is served between 7am - 11am. Typical contintenal style, cereals, selection of breads, meats, fruit and pastries. I found the service in the hotel typically German, i.e. brisk and efficient. The location couldn't have been better, although the road from the main station down to the hotel is a bit grubby, however on the other side of the hotel towards Willy Brandt Platz is fine. The hotel is ideally situated near the trams lines 11 and 12, and U bahn. To be honest I didn't use them much, as you can walk to the old area of Romer, the riverside and the main shopping/eating area of Zeil from the hotel 20 mins max. If you want a place to stay for a couple of nights then this hotel is ideal. I would stay here again.", "Date": "Oct 11, 2007", "ReviewID": "UR430074883", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "richinsta"}, {"Content": "A Good Budget Hotel The Memphis is a good price (especially at weekends when rates are lower).It is close to the main train station, underground and S-Bahn, and some tram routes stop right outside the property (great on rainy days!).The rooms were larger than other hotels in the same price range and the beds were confortable. The rooms were clean. The rate included a continential breakfast - bread, cheese, meats, cereal, fruit, etc.The main shopping street is walking distance (approx. 15 mins) from the hotel. The Sachsenhausen area of town, where many bars and restaurants are located, is about a 鈧?0 cab-ride away.The area is safe at night, and the front desk is manned 24-hrs.The Memphis is an excellent hotel for the budget-conscious traveller.", "Date": "Jun 25, 2007", "ReviewID": "UR718029701", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "Loulabelle44"}, {"Content": "Good Clean Hotel We stayed here our first night in Germany and picked it as it was so close to the train station (about 3 blocks). A big priority for me is the cleanliness of a hotel and the rooms were not only big but very clean. Breakfast was included in the very reasonable rate and the staff were very friendly. I would definately stay here again if I was spending a few days in Frankfurt.", "Date": "Aug 15, 2006", "ReviewID": "UR891092722", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Nancke"}, {"Content": "Satisfactory overall Pleasant small hotel. Key word is small. Close to the main train station, even closer to the U-bahn. On the plus side: clean, quiet, no-smoking rule was enforced in the breakfast room, fresh modern decor, everything in working order. Some negatives: limited breakfast selection, tiny bathroom, room very small, window barely opened. Thank goodness for the plug-in fan. Precious few towels. Staff was competent but seemed a bit withdrawn. Shops in the area were friendly.I would probably stay here again because it is so convenient, affordable, and clean. (Rooms facing the main street may not be so quiet.)", "Date": "Jun 6, 2006", "ReviewID": "UR135184377", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "hwcii"}, {"Content": "Enjoyed our stay We (50 year old couple) stayed at the Memphis Hotel in Frankfurt am Main for 4 nights. We were very satisfied. Very clean, comfortable bed, clean bathroom, quiet, front desk staff pleasant, and a great breakfast included. The breakfast consisted of juice, tea, herbal tea, or coffee, delicious fresh fruit salad, museli, yogurt, fresh rolls etc., meats, cheeses, fish, hard cooked eggs--really wonderful. It is located very close to the Haupbanhoff so it is handy if you are planning day trips by train. The street is a mix of different shops, etc. some ethnic, but we felt safe and it was very easy to walk to all the sights. Reasonably priced.", "Date": "Apr 1, 2006", "ReviewID": "UR552346689", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "bateacher"}, {"Content": "Very average The hotel is plesant. Clean big room, comfortable. Very big bathroom (with squashed flies on the ceiling). Reasonable value for money. I'm struggeling to say much about it because it was all as expected.I liked the location. Very safe feeling, good food and drinks. easy walk to the train and easy travel by car, tram stops directly outside the hotel (you can only street park for 30 minutes during the day. its free to park outside the hotel at night. But spaces are rare untill midnight. I paid 鈧?0 a night to park in the hotel carpark). There is a strong ethnic mix to the area with many turkish, black, oriental and asian homes and shops. There are quite a few 'red lights' on the neighbouring streets and ladies of the night afterdark but you can easily avoid this.I would not stay at Memphis Hotel again. The only reason is - the lady on the desk was very rude when we checked out and couldn't manage words like please or thankyou (or there german equivilents). The rest of the staff were very nice.", "Date": "Aug 19, 2005", "ReviewID": "UR469129174", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "nikzik"}, {"Content": "M茅fiez-vous du bruit !   showReview(21869167, 'full');", "Date": "Nov 15, 2008", "ReviewID": "UR651034359", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "fabriceetvirginie"}, {"Content": "gut f眉r eine Nacht   showReview(19640932, 'full');", "Date": "Aug 18, 2008", "ReviewID": "UR703344726", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "excellent rapport qualite/prix pour une single room   showReview(18542154, 'full');", "Date": "Jul 18, 2008", "ReviewID": "UR331014689", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Durchschnitt zum fairen Preis!   showReview(14165226, 'full');", "Date": "Mar 9, 2008", "ReviewID": "UR751685246", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "miles_and_more57"}, {"Content": "Absolut empfehlenswert   showReview(12881966, 'full');", "Date": "Jan 22, 2008", "ReviewID": "UR587116637", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "gendis"}, {"Content": "Memphis Hotel Frankfurt   showReview(11309188, 'full');", "Date": "Nov 8, 2007", "ReviewID": "UR531784441", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Super zentrale Lage   showReview(11309187, 'full');", "Date": "Nov 1, 2007", "ReviewID": "UR242221196", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "empfehlenswert   showReview(11309186, 'full');", "Date": "Oct 24, 2007", "ReviewID": "UR551089690", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "h么tel recommandable pour le voyageur en transit   showReview(11663600, 'full');", "Date": "Oct 7, 2007", "ReviewID": "UR473281725", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d273505-r16947569-Memphis_Hotel-Frankfurt_Hesse.html", "HotelID": "273505", "Price": "$179"}}