{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aresing", "Title": "“Helpful and friendly”", "Author": "Jill F", "ReviewID": "UR128031959", "Content": "The hotel is central and within easy walking distance to many sights of Barcelona. The rooms are excellent, with comfy beds and enough space. The staff will answer any queries and offer help with anything you may need, recommending cafes and tapas bars or booking a scooter from a scooter hire shop. Although situated in a central position the hotel is very quiet and there is no noise from traffic or groups of tourists going home from a night on the Ramblas. Placa de Catalunya is very close and from there you can pick up the tourist buses which will take you all over the city to all the major tourist sites. Within walking distance is the Passeig de Gracia where you can find many cafes and tapas bars if you want something close to the hotel in the evening. When the sun is shining go down to the beaches and sit in a cafe drinking a beer. Or have a really good fish lunch in one of the restaurants directly on the beach. Another must is the Parc Guell, which is a little bit outside the main tourist area but well worth a visit. The tourist buses from Place de Catalunya will take you there. Don't only go to look at Sagrada Familia but pay the 12 € and go inside. The money goes towards finishing off the building which is absolutely spectacular, worth every penny.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lichfield", "Title": "“Clean, well run hotel with excellent breakfasts”", "Author": "agj750", "ReviewID": "UR127873278", "Content": "This hotel is situated conveniently for buses and Metro links. It is a well run hotel, with helpful, organised staff. The rooms are clean and comfortable, although if you are a light sleeper I would suggest you specify a room at the rear of the hotel when booking. The breakfast is extremely good value and very well presented.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Good location and very pleasant stay”", "Author": "PATRICIA H", "ReviewID": "UR127559389", "Content": "This hotel is conveniently located, a few hundred yards from the Metro at the bottom of Passeig De Gracia. Casa Mila and Batilo are an easy walk, 5/10 min away as is Place de Catalunya and La Ramblas. The hotel and it's staff were very pleasant and I would definitely use the hotel again. We opted to stay room only as breakfast seemed expensive; there are loads of places to get breafast within 5/10 mins of the hotel and we spent less for both of us than it would have cost for one at the hotel. If you are trying to stick to a budget then worth considering eating breakfast elsewhere. Our room was clean and well furnished with everything you could need. Our room was at the front of the building which did incur some raod noise, not a problem for me sleeping but might be for others.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto,Ontario , Canada", "Title": "“Excellent convenient and friendly hotel”", "Author": "oneHappycamper", "ReviewID": "UR126737474", "Content": "This was my 3d at this hotel. It feels like home. Very friendly reception, convenient location and very comfartable. Excellent breakfast to start the day. Close to all public transportation and attraction. the only change I woul suggest is to have friendlier service at breakfast. They are efficient but alays made me uncomfortable.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bonn", "Title": "“Great hotel in potential”", "Author": "Stefan D", "ReviewID": "UR125583878", "Content": "Stayed here three times. Rooms are spacious and staff is friendly. First two times we got a room at the front, third time we arrived around 8 in BCN. When mentioning this at the the front desk the lady turned red and said: \"if I would have know that I would have blocked a better room\" They gave us a room at the back of the hotel, small and a louzy view. Terrible. Rooms in the front are way better. Roomservice is ok, ok food for friendly prices. Especially the house wine is great for a great price!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newton, Massachusetts", "Title": "“Great hotel for service, location and value!”", "Author": "Elizabeth B", "ReviewID": "UR125049686", "Content": "We loved being in this hotel as the staff was most responsive and interested in our experience. We would strongly recommend this hotel. The rooms are well appointed and maintained and comfortable. The hotel offers a small spa, great location and is small and intimate. We will be back here again!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“This hotel enables thieves”", "Author": "Nancy M", "ReviewID": "UR123922342", "Content": "I and my family stayed at this hotel for 4 days. On our last day I checked three bags and received a bag check. When we returned to the hotel a short two hours later, the same bellman brought us two bags and noted that the bell check that he filled out only stated two. The location for the stored bags turned out to be a hallway without video surveillance. When I asked them to call the police they declined. My laptop and electronics were stolen and either they perpetuated the theft or at the very least enabled the situation through utter incompetent handling. After returning to the United States they stated they would file a police report on my behalf and have not done so. Two months have passed and the information I left with them has been distorted. Do not stay at this hotel. They are incompetent and untrustworthy.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aruba", "Title": "“Nice clean Hotel”", "Author": "RR_Aruba", "ReviewID": "UR122585979", "Content": "We stayed before and after our trip to the Mediterrenean. It was a nice clean hotel, in a great safe location. I will for sure stay back at this hotel. Its near all mayor Barcelona attraction, shopping and some monuments, e.o. Bus Turistica, Las Rablas, Paseo de la Gracia, some of Gaudi Masterpieces in walking distance. We stay there with my husband, daugther of 4 and my self. It's a European Standard 4 star hotel, so I knew what I will get when booking. So nothing to complain and we will definitly stay back.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Horrible rooms, only good location”", "Author": "Kate515", "ReviewID": "UR120576685", "Content": "On the first night we got a room on 1st floor where there was a wall directly behind a window. On the second night we ask for change and it got better but overall not worth to stay longer than a sleep and run away. Do not advise for romatic weekend!!!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Delicious breakfast - great location.”", "Author": "Theodora-x", "ReviewID": "UR120456196", "Content": "The hotel is in a great location with Casa Balto, Casa Mia, Plaça de Catalunya and La Rambla all within 5 minute walking distance with good public transport to all other sites. The rooms are a good size and the beds are comfortable. The hotel is clean but the only downside would be the overuse of chlorine/bleach which can be smelled throughout the hotel. Breakfast is delicious which a large variety available. The staff are friendly and very helpful. There is also good free wireless throughout.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“Very good hotel”", "Author": "Rony C", "ReviewID": "UR120322836", "Content": "The hotel is excellent. The location is the best. Very clean. The people on the front desk ALWAYS smiling and helping. All te advises that I got were very helpfull and correct. Just perfect.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "karachi", "Title": "“A PERFECT TEN / A DEDICATION”", "Author": "dariuskakalia", "ReviewID": "UR120102828", "Content": "Friday… September 09, 2011… the Astoria Palace Hotel, Valencia… 5 am… departure time, within forty five minutes….onward to the Acta Atrium Palace, Barcelona…the supremely elegant district of L 'Eixample…<oh that snob and his elitist pretensions…fancy forsaking ‘atmospheric’ havens such as Las Ramblas, El Born and Raval in favour of Madrid’s hoity toity Salamanca Barrio equivalent…>…the sneers…the jeers…my sixth-sense had sent off an immediate alert…<hell, man I owe luxury, comfort and a stellar location to no one but myself…let ‘em titter…it’s my money, my call…no explanations or justifications are due…tough!>…steely determination…620 euros for five nights…double-room…sans breakfast - never mind!....had loved the look and feel of the property on Booking.com…my heart was set…Acta Atrium Palace it had to be for my second visit to Barcelona after 2007….also, to be within walking distance of the sublime Casa Mila- a ‘wave’- seemingly endless, on the fathomless ‘sea’ of eternity… Senor Gaudi at his most creative….what privilege!... L ‘Eixample, nothing but a hub of fashionable stores and upscale restaurants ? … Casa Batllo, Casa Lleo Morera, Casa Amatller, Casa Calvet, Palau del Baro de Quadras, La Sagrada Familia and a thousand other specimens of exceptional architectural merit? … <derision has to have some intelligence to it…some ground in reality…> …sigh! …thank God, for age and maturity, heralding and consolidating in the process an exceedingly high ‘tolerance’ level…. the secret of co-existence! … Sipping coffee in the lobby of the Astoria Palace - boy, what a terrific choice, endorsed by La Superba, Caballe, no one less - moltes gracies Senora, your taste and selection are both impeccable…silently humming O Mio Babbino Caro - a ‘symbolic’ tribute of gratitude to the Bel Canto Goddess, my mind threw up further recollections…it was to be the Hotel Espana, initially…by the time I managed to get my act in order, the price had escalated to a staggering sum of 900 euros for five nights…out of league….there was Valencia to consider along with Zaragoza, Teruel, Madrid and Munich of course…the costing factor had to be tightly controlled….the Acta Atrium Palace seemed to be the best bet in a city where hotel accommodation is known to get phenomenally expensive….a telephone call - what a warm, friendly and welcoming reception, clinched the deal and there was no looking back thereafter…I had mentally visualized the location without the least bit of difficulty and was mighty thrilled about it…away from Las Ramblas...thank God for small mercies…in the heart of classy ‘Eixample…a new ‘world’ altogether... <God, just why am I feeling so damn uncomfortable?>…tugging at my T shirt <it’s that wretched money belt…now I get it>…all those horror stories about Barcelona - the thieves, the pickpockets, the petty crooks, the scam-champs…to be subjected to a ceaseless onslaught of such 'thrilling' disclosures on our TA forum, morning, noon and night….enough to transform a seasoned, confident traveler into a paranoid ninny….acting against my sound and better judgment, I had gotten hold of this ‘safety-apparatus’ from the El Corte Ingles store opposite the magnificent Arts and Sciences complex…. 20 bucks….grrrr! …the right fit, the right colour… a ‘trial’ followed…high- voltage histrionics….yours truly, masquerading as the terrified tourist , endeavouring to conceal the 'treasure' from hunting - eyes; the hysterically spent sales girl, enacting the role of the ever- vigilant pickpocket…verdict:<lost case, let him go, can detect nothing on him!>…Manuel doubled up at the narration, faithfully reproduced from memory….my poor Barna…such an unfair picture…so far removed from reality…all those exaggerated forum posts….really… <Estacion de Norte is just round the corner, Manuel….barely five minutes…aren’t we a bit early for the taxi?>….Manuel, raising his eyebrows in alarm <Estacion de Norte,are you sure?>…fishing out the print-out of my on-line Renfe ticket, I noticed the point of departure perhaps for the first time…<Joaquin Sorolla…. Good Heavens!>….my reassuring Catalan friend < don’t panic…I see a taxi stationed outside the hotel…no need to wait for the one intended…you’ll make it>…. no more tomfoolery….departure it had to be to … with a heavy heart…<God, plz don’t make it so difficult>…plea rejected! …<destined to be miserable..>…weary resignation! … Joaquin Sorolla…finally…the Euromed to Barcelona Sants…a very comfortable three hour journey… reminiscences-bittersweet ; associations - deeply cherished ….flashback to 2007…my first-ever trip to the Catalan city….one which had been nearly ruined thanks to the mean and disdainful attitude of the hotel, I happened to occupy some meters away from the Ramblas…. I had almost vowed never to return…. had loved the city….loved it very dearly, but somehow never felt loved or accepted in return…a one-sided ardour….flashback to 2010….the TA forum...the same story….always an outsider….one to be wary of… till Chris-the-Scotsman happened….he believed in me and my love for Barcelona… my anchor and support-system, when things would turn dreadfully wrong….my very dear and precious friend, who had enriched my life beyond measure, even if it was destined to be for a short while….with his death, a part of me died too…Barcelona it had to be…a mission remained to be completed…. From Barcelona Sants to the taxi stand….a cakewalk….where were those lurking criminals?... ….Barna is safe….exceedingly safe…shame on those who taint the city so mercilessly.....Gran Via de les Corts Catalanes….the Acta Atrium Palace at last ….smaller and more intimately laid out than Valencia’s Astoria Palace….classical elegance meeting sleek modernity….my first impression upon entering the hotel…within the flash of a second my belongings were attended to…it was Sergi…Mercedes Alcaraz - the Reservations Manager switching from Castellano to Catala to English…all within the flash of a second too! … “Buenos dias ; bon dia ; good day” …. “muchas gracias ; moltes gracies ; thank you very much”, set to endearing effect with a dazzler of a smile and eyes which shone and sparkled with sincerity and genuine warmth….a surge of happiness overtook me…<the Catalan components of my Spanish 'family'>...a sense of immediate belonging and identification…a city and property I was going to cherish above all the others visited in 2011…check- in time was 3 pm…it must have been 9.30 in the morning then…Mercedes read me like a book <you look so tired, the train journey from Valencia being such a long one…please give us some time….five families have just vacated and your room should be with you shortly>...relieved….Catalan kindness….darling Mercedes, such an exceptional woman….my respect and regard for her was to grow with each passing day… Sauntering out of the hotel into the fresh September air, the leafy boulevards of L’Eixample wore an air of exquisite autumnal charm...Barna looked imposing…larger than life….to Farggi, for some morning - nourishment…returning to the AAP, I plonked myself on the blissfully comfortable sofa of the tastefully done up lobby and dozed off….fatigue…had not slept a wink, the night before in Valencia....a wake-up call(!)...it was Mercedes, “Senor, your room has been readied”…must have been 10.45…such kind and considerate folks <my land, my people…the sky is the limit>…was touched…a thank-you followed…Mercedes, again…pure Catalan goodness, “Senor, you need rest…we are so happy to provide the room earlier….for us your comfort is of foremost importance”… smiling contentedly, made my way to the elevator and the 4th Floor….the double room awaiting the weary traveler was wonderfully equipped with every amenity under the sun…the queen-size bed complete with foam pillows and accompanying cushions had been so beautifully prepared that I almost felt guilty of ‘sinking-in’! …the air conditioning – mandatory for Spain…faultless…a suitcase rack, writing desk and chair with Plasma TV, a mini bar with all the expected essentials such as mineral water, Coke, bottled fruit juice, Cava, Beer and chips…a wardrobe with an ample supply of hangers - extra pillows and blankets too, added features including a built-in iron and board , a shoehorn, shoeshine and a digitally operated safety deposit box…free internet connectivity- that too eminently functional - a God sent!...the marbled bathroom….near-perfect…the shower would merit an eight out of ten! …the water- pressure could have been more vigorous.... a very generous supply of toiletries- toothpaste with brush, soap, shampoo, cotton swaps, disposable razors, tissues, comb and shower cap… a separate wash basin with mirror opposite the wardrobe….unusual…bathrobes and slippers at hand below….the cream and brown theme-shading, imparting a glow of subtlety to the room….620 euros? ….a steal…thank you, Booking.com! …. Revivified after all this pampering and some much needed sleep it was time to rediscover the city…9.30 pm… my steps went back to all those treasured spots…the Moderniste marvels….ah, Casa Mila - eternally beautiful!...the Barri Gotic…Port Vell…Rambla del Mar…navigating the waters of the Mediterranean with the poise of an Empress, there stood Barcelona before me…perched-unrivalled on her pedestal of glory….a city blessed with ‘everything’…it was a homecoming….the hand of Chris…guiding and guarding me throughout…pre-destined?.... L’Eixample and the Acta Atrium Palace both helped me in no small measure to discover what DE BennyMalaga often writes about- the highly ‘educated’, refined, cultured and sophisticated section of the city…people-elegant in manners, liberal in thought, tolerant in speech and ideology….those in the tourist trade, so receptive to the needs of the traveller….<what elitism, just hear the snoot>… sixth-sense again….tough…don’t have to hold my ‘impressions’ accountable to anyone…. The Atrium Palace….a model four star establishment…made all the more special by those responsible for running the show on a day to day basis- Mercedes, Sergi, Oscar, Maximiliano, David, Gorka and Zen….a wonderful team….Mercedes <you are not a guest Senor, you are one of us>….on teasing her about her tri-lingual abilities <it is my culture, Senor…it teaches me to impart respect>….thanks to her suggestion, I utilized the swimming pool/ sauna/jacuzzi and gymnasium facility located in the basement of the hotel….lovely pool.. would usually have it all to myself…the swim would do me a world of good…never utilized the laundry service but did hear other guests speak of it in complimentary terms….my address in Barcelona for all future visits….my city…my people…my Catalan family…through your eyes and heart, Chris…I know you are reading every word of this….just the way you were there throughout my supplication in Santa Maria del Mar….Slatkin is convinced….so am I …. ‘Timshel’…. ‘Thou Mayest’…The New Testament….a Divine empowerment….we have it in us to make that vital difference….the 'choice' is ours... and this review is a heart-felt dedication to those who have ‘chosen’ and succeeded thereafter in making that 'vital' difference – Gigis_mum, Benny, Ati, Holakjs, Hubie, JoseAntonio and Belsaita.....for my friend, the Scotsman....in loving memoriam....each sentence, each syllable...forever missed...forever remembered.... Zaragoza and the Hotel Goya….the fourth link….any takers? ….shhhh…. ‘Timshel’….bear in mind….always…", "Date": "November 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hard bed!”", "Author": "HK4951", "ReviewID": "UR119826374", "Content": "This was a very pleasant looking hotel but fell down in one vital aspect - the bed was so hard that I could hardly sleep and woke after just two hours with pain in both hips due to the hard mattress. My husband managed to sleep but he said he was not comfortable. When I raised this with the staff on checking out early the next morning for a flight they acknowledged that the hard beds were a problem for quite a few people and offered me a 10% discount. They also told me that they had a soft mattress topper if I had asked for it! How was I to know that the bed was so hard as to be unsleepable before I got in. Why didn't they offer it to me first or best of all why don't they just install comfortable beds? For a 4 star hotel it was absolutely not acceptable. In short, the hotel looks fine and is in a nice area of the city but if you need a comfortable bed to sleep in, go elsewhere.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Welcome guests”", "Author": "CLPRtravel", "ReviewID": "UR119658525", "Content": "From the moment we arrived we felt like welcome guests. Staff were so obliging helping us to get the most suitable room etc. Internet access, storage of cases and use of the small leisure facilities were all included unlike some hotels. Breakfast buffet was fabulous, although weekend staff were over zealous at clearing away during the meal so kept finding things you were about to eat or drink had gone so couldn't relax. Little noisy at night with the traffic at the front as it is on a big main road. However we thoroughly recommend this well run hotel.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Commack, New York", "Title": "“Location, Location”", "Author": "Fredotty", "ReviewID": "UR119433038", "Content": "A great hotel located within easy access of the metro and walking along Passeig de Gracia. All of the staff are very friendly and helpful and made for a memorable visit to Barcelona. Breakfast can be expensive but it is plentiful and varied. Very well priced for the amenities supplied.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Location/Outstanding Staff”", "Author": "tinastravel", "ReviewID": "UR119278712", "Content": "This hotel was recommended in Frommer's. Great location, outstanding staff, excellent room. We arrived at 7am on a Sunday morning and the staff did everything to accommodate us so we could get checked in early.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent position and very nice staff”", "Author": "Jaxton_11", "ReviewID": "UR119073316", "Content": "We spent 5 nights here and it was perfect. Very close to main squares and buses, including airport bus stop, lovely staff and WONDERFUL breakfast - more than we could possibly eat. Recommend you pay the extra to include breakfasts! The pool is TINY, hardly worth going, but apart from that it could not be faulted. We really appreciated the free computers/nternet (and printing, if you ask the staff).", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amelia Island, Florida", "Title": "“Prime Barcelona Location”", "Author": "Eastwind99", "ReviewID": "UR119053099", "Content": "The Atrium Palace was in a perfect central location for our week's stay in Barcelona. Placa Catalunya is two blocks away and the Passeig de Gracia metro stop allows one to use the subway as well as middle distance trains to places like Girona, Figueres, Sitges and Tarragona. Walking is an option to almost every part of the city and metered taxis are widely available. There is much to like about the Atrium Palace itself: * The front desk staff is friendly, attentive, knowledgeable and extremely helpful. No request is too small or mundane. * The all-you-can-eat breakfast buffet @ 12.90 EU is to die for with a broad selection of quality meats, cheeses, fresh fruit, eggs, bread/rolls, pastries, and an array of drinks from coffee, juices, cava, wine, sparking water, etc. The serrano ham is worth the price of admission and you won't find better tomatoes anywhere, period. * Did I mention the location, location, location? * There is free WiFi throughout the hotel and also a business center with two free computers for guests. Nice not be gouged as many other hotels do. I was able to bring a U.S. iPhone and use the WiFi for e-mail, Internet and Skype calls. * The basement has a small pool, Jacuzzi with powerful jets (not always hot enough though) and an exercise room with limited equipment. Since most European hotels don't provide these type facilities, this was a plus in our book. Downsides: * Depending on where your room is (front or back), there is some noise. Many reviews have overblown the noise -- in our opinion -- at the back from school kids and sports activities. If you leave the windows closed, there is really not a major problem sleeping. Remember the primo location in a big city if the traffic noise is a problem. We do like to sleep with the windows open if possible which to be frank was tough some nights when the games would go on late. * The double bed was hard and too thin. Not a surprise in Europe, but not up to the standards of hotels in the US and other countries which are upgrading their in-room experience. * The bath tub looked like it had had some type of friction strips on the bottom at some point but I found it extremely slippery (my wife disagreed) and it is an area for improvement. Bottom Line: I have rated 4 only because my spouse complained about her sleep experience. A fairer rating would be 4.5. Should you choose the Atrium Place, you will not have regrets afterwards and it will make your visit to Barcelona a more pleasant experience.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hyattsville, Maryland", "Title": "“\" Nice hotel in nice area \"”", "Author": "funladez", "ReviewID": "UR118550859", "Content": "We pick this hotel after we read a few reviews, & I am glad. We arrived at the hotel early after a long flight and the hotel let us check in early.The gentleman that check us in sorry i can't remember his name was very helpful & polite.The hotel is modern in a nice area a few blocks to shops & restaurant. The hotel staff was always helpful,professional, polite. The hotel room was very clean, I like the slippers & bathrobes a nice addition. The only thing I didn't care for was the bed. I will stay here again when I come back to Spain.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Good value and location”", "Author": "pasadena4", "ReviewID": "UR118321433", "Content": "We stayed 3 nights at this hotel during July and were very pleased with our stay. The staff was professional and welcoming and spoke perfect English . Our room was immaculate. The marble bath, complimentary bathrobes and slippers, iron/ironing board and an additional sink in the bedroom were pleasant surprises. The hotel is within walking distance of the shopping areas on Passeig de Gracia and a nearby metro stop. It is also close to the Ramblas. Since we took the bus from the airport, we also appreciated the hotel's close proximity to the bus stop in the Plaza. Lastly, we enjoyed the convenient cafe restaurant adjacent to the hotel for its breakfast and lunch buffets.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "La Linea, Spain", "Title": "“nice hotel in excellent location”", "Author": "andy7070", "ReviewID": "UR118018639", "Content": "We arrived at the hotel very late Thursday 1st September and the lady at the front desk was most helpful and very professional and polite. She explained the procedures in the hotel, providing where to go in Barcelona and what to do with a map..The room was very nice and was well air conditioned with temperature control if required. The hotel is very close to the Metro Stations and are very safe to use as is the area to walk around, but like most major cities you still have to be cautious with your wallet and handbag...The Spa and Swimming Pool in the hotel were fantastic as was the Sauna..the Jacuzzi was fantastic also, but we found it a little on the cold side, but do not let that put you off, because all in all the facilities were fantastic...The staff were very polite both day and night and spoke fantastic English. All in all we really enjoyed our stay and would recommend it to other couples..We did not have breakfast at the hotel as we wanted to explore the cities cafes/bars ourselves so cannot comment on the food.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Pampered at the Palace”", "Author": "Jay G", "ReviewID": "UR117806758", "Content": "We spent 6 days in Barcelona and we chose the Acta Atrium Palace for its location and we loved the look of it. We were there for a celebration and i requested a few things to help us celebrate it before we went, they were very helpful and sorted everything out with no problems, price was also very good. Over all the hotel was perfect for us and the staff were very friendly and helpful. We would definetly stay here again next time we are in Barcelona. Hotel is very central and within walking distance to Las Ramblas and Passeig de Gracia (main shopping, restaurants and tourist routes) but i would recommend bringing good walking shoes as you can get distracted a lot and walking further than you planned but all good, we found lots of places not on the main tourist maps. Breakfast was a buffet with everything you can think of (chips for breakfast?) but everything is freshly prepared and the staff are very helpful if there is anything you need. Room is large and very clean, very comfy double bed. mini bar, seats and desk, TV only had 2 english channels though and they were CNN & BBC News but we didnt really have time for watching much tv. Bathroom is nice and spacious with large mirror and shaving mirror, shower is fantastic!! We had a balcony with table and 2 chairs and outside lights for evenings. We looked out on to houses and a school but it was very quite and private. Room was keeped very clean and towels changed everyday if we wanted. Bathrobes and slipers were also provide for the spa, we only used the pool & Jacuzzi though. Pool was small so only really 2 people could swim freely at a time. Jacuzzi could have been warmer though. They only had Pizzas on there room service menu but they were delicious and we had them a couple of nights!! Great as we walked for miles a couple of days and it was good just to put our feet up and eat pizza in the comfort of our room. Mini bar have a small range of things but enough for a quite one in. If you do want to eat out i would recommend O'Pinyeiro Bar Bodega (about 2 min walk from Hotel) food is lovely, i had the cod and veg rossioto all i can say is OMG!! It was D I licious!! We would recommend the Cable Cars/Teleferic de Montjuic/Trams great views of the whole city 360 degrees. All in all it was a great holiday for us both.", "Date": "September 7, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Lacking facilities and constant subway noise.”", "Author": "DoesntFlyJetStar", "ReviewID": "UR117629606", "Content": "The hotel has a business centre with two old computers and old browsers installed. There is no printer, so you have to email them the document if you want it printed, which can take some time as they have \"email problems\". Don't worry if the information is confidential, I'm sure you can trust them... You can't do your own laundry if you want to, and there is no laundromat nearby. If you have a suitcase full of clothes then it is at least a hundred euro or more. The hallway on level three smells. Every five to ten minutes the whole room shakes and the glass rattles due to the subway going through underneath.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Modern Great Hotel - Great Location”", "Author": "MrK2020", "ReviewID": "UR117476441", "Content": "Stayed at the ActaAtrium last year and loved it was a perfect base in Barcelona walking distance to all sites Rooms clean very spacious and extremely spacious Robes and slippers provided!!!!! Heated bathroom mirror - nice touch no misting for after shower shave! The staff welcoming and friendly - We hired a car to travel to Stiges for the day reception couldn't have helped more. Car delivered to reception following day at a good price.... and collected Most definitely recommend this hotel and next time I am in Barcelona I will be staying here.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "The city south of the USA", "Title": "“Fabulous hotel!!!”", "Author": "JoeBl", "ReviewID": "UR116869720", "Content": "Smaller, more personal hotel in a great location with very helpful staff. My beige shorts came out of my suitcase with a horrible stain on it. We left it with Oscar before we went to dinner at the tapas restaurant he suggested. By the time we returned from dinner, it was washed and ironed. Try and get that at another hotel! We stayed in a front facing room with a balcony. Very little traffic noise could be heard. The room itself is compact but very modern and spotlessly clean. They had a cruise rate which we used as well. After the cruise, we returned and had a rear facing room which was much larger. It does overlook a kids' playground so it might be noisier later in the year when the kids return. Yes the mattresses are firm but quite excellent for sleeping as far as I am concerned. Much better than a hotel mattress that sags badly! The buffet breakfast is outstanding and at a good price. Excellent quality food, well-prepared. We ate so much that we did not need to eat lunch. Wifi is free and of good speed. Skype worked well on it. PS. You won't believe this---a Scotsman speaking Spanish as one of the front desk clerks in this Barcelona hotel. <LOL>", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Never again”", "Author": "namrogo", "ReviewID": "UR116855980", "Content": "Check in staff were well-mannered and pleasant. Next day, reception manager Zen described his own staff as \"talking rubbish\" when he said he could change our room. Also told us we could look for another hotel if we didn't like our room. First time any hotel staff have spoken to us like this. Not exactly 4* standard service. Drilling and other maintenance going on on same floor. Walls are paper-thin, guest in next room made endless noise one morning... Pool extremely small, under maintenance. Restaurant very basic. The room: no tea/coffee making facilities, no English channels on TV, bed rock-hard, fairly small. Definitely not 4* standard. Felt unwanted and unfairly treated. Would NEVER stay in another Acta hotel. I have no idea why this hotel is rated 4*.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wilmslow, United Kingdom", "Title": "“What's all the fuss about?”", "Author": "pipman55", "ReviewID": "UR116009659", "Content": "I feel I have to write and offer a fair and balanced view with regard to previous reviewers comments on the 'noisy' children at the rear of the hotel. We stayed in early July and were given a room at the rear of the hotel on the fourth floor, we were slightly trepidatious because we too had read some negative reviews. It is true to say that there is a kindegarten and some sports pitches in the courtyard at the rear of the hotel but we did not find that the children who played there, for only a relatively short period each day, were excessively noisy and in fact as grandparents ourselves we thought it really quite pleasant to hear the sound of young children playing. Also, if the window was closed for air conditioning purposes, you could hardly hear them at all. So, we had a very pleasant 5 day break at the Atrium Palace. The location is good and central and within walking distance to the Ramblas and Playa Catalanya yet its in a relatively quiet area. The reception staff were extremely friendly, helpful and polite and the breakfast in the restaurant each morning was first class. The room we stayed in was very comfortable, and my only 'niggle' was that it would have been nice to have had an English speaking News channel on the television. We loved Barcelona and the hotel and will return to both.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“So-so at the Barcelona Atrium Hotel”", "Author": "Persian_Bride", "ReviewID": "UR115922574", "Content": "We requested a room in the front of the building with a balcony and were promised one when I emailed them ahead of time. The reviews which I read on Trip Advisor warned us of the noisy schoolyard in the back of the hotel. When we arrived, the front desk clerk said they didn't have one available at that moment but we were told that they would have one available within the hour if we'd like to wait maybe in their small coffee shop. We checked back with the front desk clerk about a half-hour later and were told then that they did have one room left but had given it to another guest. Since were were exhausted from our trip, we opted to take our chances with a room in the back of the hotel. Unfortunately, it was just as the review stated! It was so noisy & excessively loud even though the windows were tightly closed! Every morning and afternoon, school kids were out playing in the courtyard and the noise was unbearable. Now we can tolerate some noise, but this was absolutely ridiculously loud! After traveling across the Atlantic on a 9 hour flight, having jet lag and wanting to catch a nap as well as wanting to sleep in the next morning until at least 9 am, who in their right minds want to listen to a lot of kids yelling and screaming? We were very disappointed with the hotel staff not wanting to accomodate us, esp. since we had notified them of our requests before our trip and expected that we'd have a room after being promised one when we arrived. Although the hotel was in a very desirable neighborhood with close proximity to great shopping and restaurants as well as their location being within walking distance to Playa Catalanya and Las Ramblas, I most definitely will plan on staying someplace else on our next trip to Barcelona. Their little cafe was adequate but there's a very limited menu and they're only open in the morning and for a few hours in the afternoon. The breakfast buffet, I must say, was phenomenal and that's held just off the cafe. I must say though, the food was great as was the service. the hotel staff were very friendly and although we did have problems in getting the room we requested, they did give us vouchers for a free breakfast everyday for both my husband and I. I just wish we could have had a better room that was in a less noisy area of the hotel so we didn't feel so tired everyday of our stay! So, if you don't mind kids yelling and screaming in the morning or later afternoon, go for it and stay there.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cumbria", "Title": "“We loved it and so convenient”", "Author": "bookwormCumbria", "ReviewID": "UR115625160", "Content": "we picked this hotel because it had a pool and unfortunately this was the only diappointment as it was so small, however everything else was good. we had a 6th floor room with balcony over the road which was lovely. My husband would sit out there and read in the evening. We found it was only about 5-10 minutes from Las Ramblas and more importantly for us just 3 minutes walk from a fantastic restaurant in a Gaudi building! Casa Calvet was fantastic both for food and atmosphere. The staff in the hotel were very helpful and friendly and we would stay there again.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“4th time at this hotel”", "Author": "mdhub", "ReviewID": "UR115096757", "Content": "Great location. Staff were so helpful, nothing was too much trouble for them. Buffet breakfast was fantastic, great selection. Very close to the station to pick up the train to Montmelo. Will definately be back.", "Date": "July 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Highly Recommend this Hotel”", "Author": "LeslieC_10", "ReviewID": "UR112669383", "Content": "Clean, contemporary, great value, great central location, nice modern bathroom, central but in the upscale area of L'Eixmple. Friendly helpful front desk staff. We loved our sound proof french doors and balcony facing the Gran Via, wide avenue. Breakfast room looked nice though we didn't eat there due to early morning flight. Free use of computer. Exactly what I wanted!", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Lovely hotel well located”", "Author": "dezzib2001", "ReviewID": "UR111803370", "Content": "My wife and I stayed here to celebrate our 25th wedding anniversary. The hotel is centrally located just a couple of minutes walk from the Placa de Catalunya which is the arrival/departure stop for the airport shuttle as well as the main stop for the tourist sightseeing bus. The hotel itself is lovely and the staff attentive and helpful without being at all overbearing. I would certainly use this hotel again. The only complaint I would have is that the beds are a little too hard for my taste!", "Date": "June 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Barcelona trip”", "Author": "Pitufa17", "ReviewID": "UR108394125", "Content": "Loved this hotel, great location, close to main attractions, and easy access to subway stations and bus stops (only 2 blocks away). Never tried the restaurant inside the hotel so I can't recommend it.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Central location, great service and staff, made all the difference - BRAVO!”", "Author": "JP_Toronto", "ReviewID": "UR105856943", "Content": "Location was excellent - not far from LAS RAMBLAS, Palau de la Musica (gorgeous concert hall where we attended a guitar recital), the Opera House, and a longer walk to the spectacular Sagrada Familia, a MUST-SEE in this city. Many superb restaurants in the vicinity including El Tunel D'en Marc Palou on Carrer Bailén, - another gem recommended by the staff. My daughter and I were very comfortable, the room was clean and quiet (despite being on Gran Via, and almost a home away from home!! I really cannot stop talking about the Customer service from the staff at the Reception Desk - they were kind, efficient, multi-lingual and went way beyond the call of duty. Thank you Zen, Mercedes, David, Oscar - we will return and send many friends your way. Jennifer and Sabrina", "Date": "April 27, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "sao paulo", "Title": "“Fantastic!”", "Author": "gomesvm", "ReviewID": "UR105295037", "Content": "I had a wonderful experience by staying 6 nights in this hotel. The personnel was very kind and helpful and the room was clean and comfortable. The location is very appropriate for moving by bus, metro or walking to anywhere. It is two blocks far from the Rambla street but in an elegant area in Eixample. The wireless access was working very well.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Malling, United Kingdom", "Title": "“Lovely hotel, bit noisy, but great location”", "Author": "GHbird", "ReviewID": "UR104776931", "Content": "We stayed here for a 4 day city break in April. We had a great time and were mainly pleased with the hotel. The rooms were clean and well maintained, it had a 'posh' feel to it. Only problem for us was that our room (308) backed onto a school playground, running very noisy football gamesa nd events outside all day long, and then an adult football team played in the evenings. Not great for an afternoon siesta, or a lay-in as they started by 9am each day. The hotel staff were all very friendly and helpful and the man in the cafe/restaurant attached was happy for us to buy tea/coffees and take them up to our room, as there are no tea/coffee facilities in the room. The location is great, it is not on the main 'La Rambla' strip but only about 5 minutes walk away, so you can easily pop there when you want touristy stuff and restaurants, ice creams etc. but you can also get away from the noise in the evening. The hotel is also right next to the metro stop which is very handy for exploring further.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Brilliant, beautiful hotel in excellent location!!!!”", "Author": "Cordy3-11", "ReviewID": "UR103504231", "Content": "Just returned from staying 3 nights at this beautiful hotel. This is our fifth visit to Barcelona and this is definitely the BEST hotel we,ve stayed at.. Check in was swift and every effort was made to make us welcome and inform us of lots of helpful information. Our double rooms were spotless, and we loved the extra touches. The staff were so polite and greeted us in a lovely manner when we came and went. One of the best features of this hotel is its location. Its near enough to the atmostpheric Catalunya Square and Las Ramblas but a good enough distance for peace and quiet. Considering the hotel is located on busy road, we heard no noise in our room at front of building. Can,t say enough, so pleased and have had a gorgeous break. As yearly city visitors to Barcelona we would not hesitate to re-book Actra Atrium Palace. Check out and paying was such a swift and easy transaction, the staff member split our bills and quickly sorted everything out. Excellent rates, location and beautiful rooms, what more could you want?", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oldenzaal, The Netherlands", "Title": "“We will definitely come back!!!”", "Author": "Daniel1989_NL", "ReviewID": "UR102533964", "Content": "Stayed at this hotel for 5 days (in March 2011) with my girlfriend. We had an absolutely wonderfull time there! -Staff: GREAT! very helpfull and friendly -Room: GREAT! nice and clean, plenty of space for the 2 of us. -Location: GREAT! right in the center of Barcelona, surrounded by shops, restaurants, and the metro and bus stop were literallyy 2 minutes away. -Breakfast: GREAT! plenty of choice. Worth every penny. I have to say, the only negative aspect of our time at this hotel was the airconditioning. -Temperature: POOR. The room was heated up WAY to much for this time of year.. Also, the airconditioning did work, but dindt help much. We dindt complain about this, because we dindt spend much time in the room at daytime (shopping, visiting other things) The rest was absolutely brilliant! We will definitely come back to this wonderfull hotel!", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alkmaar, The Netherlands", "Title": "“Great service!”", "Author": "IvorNL", "ReviewID": "UR101290266", "Content": "We were hotel hopping and stayed at this hotel only one day, but would definitely stay there again! Requested a room at the front because they have a balcony.. there's some noise from outside, but it's mostly defeated by double glazing and good isolation. However there's a lot of noise from other rooms (thin walls).. this might be an issue to some.. Design and interior of the room wasn't special (even slightly outdated), but the room was clean, spacy and and sufficient. The best thing about this hotel was the service from the people working there.. they were very friendly, gave a lot of info and always smiled :) The best thing was the day we left, we left the luggage at the hotel while going out.. The guy at reception noticed we had a bag of beers and asked if we would like them to store the bag in the refrigerator.. Priceless! To cut it short, good value for money, clean, good location, slightly noisy and perfect service :)", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perthshire", "Title": "“Perfect location in barcelona”", "Author": "IanPerthshire", "ReviewID": "UR101017357", "Content": "We stayed at this hotel in February 2010 for five nights. This hotel is situated only a few minutes walk from place de catalunya, which is the main tourist in the city centre of Barcelona. The hotel is located in prime location for visiting many of the city's tourist attractions, including the Sagradia Famillia, La Pedrera, La Rambla and the Casa Batllo, many of which can be visited from the hotel by foot. The Camp Nou, is only a 55 minute walk from the hotel or a short bus ride along the avenue Diagonal. The passage de gracia is only 2 minute walk from the hotel, which is home to the Casa Batllo and Gaudi designed La Pedrera. This hotel is perfect for a short stay in Barcelona", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warfield, berks", "Title": "“Just great”", "Author": "janejarvis", "ReviewID": "UR99446987", "Content": "Spent 4 nights here....reception staff were great and really friendly.......house keeping was a little amiss.....when we got to our room the beds were not made up, but reception sorted this out very quickly (as we arrived at 2 pm it was not really a problem!). Later in the stay we were left with no blankets, but again, one visit to reception and it was sorted out very quickly. Overall, I would rate this hotel very highly.....great location...we were at the front of the hotel on a busy road...but the double glazing makes this no issue, and if you are there in the summer, you have the air conditioning.....I didn't find the beds any problem....had read previous reviews....a little hard, but not uncomfortable, and we both slept like babies!! A great hotel, great facilities....breakfast was excellent. Reception staff make this place. If you have an issue, they will sort it out!! I recommend it very highly.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bruxelles", "Title": "“Good hotel for a reasonable price considering it's Barcelona”", "Author": "Rafael1234", "ReviewID": "UR98320600", "Content": "The hotel is modern and excellently located. Rooms are well kept, some might feel a bit narrow in space but well maintained. Unfortunately, to have the view to the beautiful boulevard in front of the hotel, rates are higher. We had settled for a room giving view to the playgroung of a high school (fortunately for us in August the schools are closed). The spa is a bit small but since it's free, no reason to complain. Service was very friendly and helpful to give tips. The negative point is parking. We paid a bundle in parking for 2 days (70€)...", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Drogheda, Ireland", "Title": "“Recommend this hotel”", "Author": "FeWalsh30", "ReviewID": "UR96488509", "Content": "We have just got back from a three day stay in barcelona and i would recommend this hotel and this city to anyone. The city is so easy to naviate around for anyone of any age it is well sign posted and things are easy to find. Loads to see and do and great city to walk around and take in the sites and sounds. The hotel is great and centre to everyone, within walking distance from everything. It is only a few mintues walk from where the airport bus drops you off, so saves a money by not having to get taxis anywhere. The hop on hop off bus leaves from the same square and a great way to see the city if you dont want to walk to much which was great for me as a 7 month pregnant women!! The only problems i had with the hotel was the bed which like others have commented on was rock hard which is great for your back but dont be surprised if you dont get a great night sleep and the fact like most european hotels i've stayed in there is no english stations which was a pain as i need to rest a bit and all i had to watch when i was doing this was CNN and eurosports not very enteraining. I was recommended this hotel to stay in and i would recommend it to anyone else, it is so central, its great when they say everything within walking distance they mean it which more than likely isnt the case when you get there. Like others we had the room that over looked the school but there was no noise once the school closed which was grand as we out exploring the city most of the day.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PAPHOS", "Title": "“Relaxing stay”", "Author": "PaphosThalia", "ReviewID": "UR96058857", "Content": "I stayed with my wife at this nice hotel between 2 - 6 February. The location is ideal for anyone who is looking central location. Metro is very close and within 5 minutes you reach Cataloni platza. All reception staff is very friendly and unprofessional. It is expensive hotel but it is good value for money.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, friendly staff but disappointing spa and noisy corridors.”", "Author": "Murchieson", "ReviewID": "UR94912439", "Content": "Great location, friendly staff but the hotel was a little scuffed and in need of some TLC. We specifically chose this hotel because it had a spa but were disappointed that the jacuzzi was so cold. The room was on the small side and ours looked out over a noisy school playground. The corridors were also very noisy and it sometimes felt like people were actually inside our room!", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, England", "Title": "“Fine Hotel - Good Location - Great Staff”", "Author": "BinThereAteThat", "ReviewID": "UR91891318", "Content": "Stayed here over Christmas - comfortable business hotel located in the Heart of Barca. Worth the 4 Stars, everything worked fine, good breakfast hot & cold buffet. Extra plus - great staff (who helped enormously during a minor emergency; including acting as unpaid translator for a in-room consultation with a Spainish doctor which they arranged....on Boxing Day) Unreservedly recommended.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“This hotel was a nice way to start our 14 day cruise back to Miami.”", "Author": "RBM_1945", "ReviewID": "UR90740070", "Content": "We went early to see Barcelona & the hotel was recommended by Celebrity Cruises. The staff (Yousar & Victor ) at the front desk were very helpful with advice where to eat & things to do in beautiful Barcelona. The buffet breakfast, which was included in our room price, was excellent value.The free WiFi was easy to activate & was a welcome benefit from the hotel. The location was good to get around the city & close to the town square to get on the buses & subway. This hotel was a nice way to start our 14 day cruise back to Miami. We will stay here again, the next time we are in Barcelona.", "Date": "December 26, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“nice hotel”", "Author": "olsenjakob", "ReviewID": "UR89091446", "Content": "Very good rooms, plenty of space, nice layout modern/oriental, good bathroom with amenities. We had a room facing the street with a large balcony, which was very nice. Good cleaning, and central, with shopping and restaurants nearby. Breakfast, and restaurant, below average though.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hampshire, UK", "Title": "“Good hotel”", "Author": "HampshireUK", "ReviewID": "UR81039017", "Content": "I stayed at the Atrium Palace for a week. I was in Barcelona for business. I would rate this as a very good 3 star hotel. My room was very good. Lovely bathroom, balcony, flat screen TV. Bed was too hard for me - poor mattress - which lead to an uncomfortable sleep. There is a very small pool and jacuzzi in the basement. There's a gym too but the room temperature was way too hot for me to use. Anyway there was so much walking to do around Bracelona that I just didnt get out the gym gear. The hotel is on a very busy major road in Barcelona but the windows keep out the noise well so you dont really notice this. The hotel is within walking distance of most things in the centre of Barcelona if you are reasonably fit. Free wi-fi was great. The reception staff are mixed. There was one excellent guy who was born in Scotland who couldn't have been more helpful. Then one day I had the rude female recepetionist that I think others have referred to. Almost made me laugh, she was so outrageously rude! Breakfast is typical of a Spanish hotel. A buffet of mixed food. Beware the taxis in Barcelona - there are a minority of taxi drivers who will do the usual drive round the houses to put up the fare. The worst thing about the taxis is that if you order one from the hotel you will find a surcharge of up to 4.50 Euros added as it was called by phone. This surcharge is shared with the hotel. Rip off. They will also charge you more if you have luggage (why?) and if you are going to the airport and if it is a week-end.... My return jourmey to the airport was charged at 50 Euros!!! A simple and loud protest and a glance at a nearby polieman dropped the charge immediately to 30!! So - get your taxi form the street outside and not via the hotel (great service from the hotel eh?!) and make sure you know how much to expect to pay and the rough journey via a map before your get in. Apart from the taxis evrything else about Barcelona was great - you will have a fab time. I was there to see most of the Merce fectival and am still dancing back in the UK. Enjoy this great city!", "Date": "September 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brighouse, United Kingdom", "Title": "“Where did the stars come from?”", "Author": "JaneB52", "ReviewID": "UR76009516", "Content": "Arrived mid afternoon to be greeted by a surly receptionist. My husband was enraged when she tried to photo copy his credit card (Hotel Policy) be warned dont hand it over! Showed to our closet by a helpful bell boy. I was disgusted with the size, cleanliness of the room. I opened the curtains onto a bank of air conditioning units and lost the plot. Straight back to reception (Miss Surley) and demanded a different room. I did get one but again an inside room, however now on the seventh floor with a little natural light, but they may have well just thrown the bed clothes on the floor as the mattress was just as hard. Breakfast was good, small bar expensive as was evening meal. It beggars the question where did the four stars come from. I have stayed in hostels that were brighter, cleaner and with infinitely nicer staff. The only good thing about this hotel is its location.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Beware the Exchange Rate”", "Author": "wefstag", "ReviewID": "UR73541308", "Content": "The hotel is well located and the staff are generally friendly and helpful, but the room was rather drab and dark. For the price we expected considerably more. But for us the lingering memory will be the way that our bill which was in €uros was converted into £ sterling at an appalling exchange rate without our permission. I've since queried this but was told that I asked to pay in £ sterling. So with the extra we paid the \"value for money\" rating has slumped further.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Brilliant !”", "Author": "Noniem", "ReviewID": "UR72951670", "Content": "Myself & my teenage son stayed at this hotel for 5 nights in July. Lovely hotel on the Gran Via which is a 10 minute walk from the Ramblas. Staff very friendly & helpful. Room spacious, modern & well equipped.Even though we were at the front of the hotel we were never disturbed by traffic or street noises. Free WiFi is a great facility. The spa is lovely, pool is small but very tranquil & plentiful supply of fresh towels & free water makes the experience a very relaxing one. On the downside there are no english speaking TV stations other then BBC world news & CNN & there is no kettle in the room should you wish to have tea/coffee.", "Date": "July 30, 2010"}, {"Ratings": {"Overall": "2.0", "Service": "1"}, "AuthorLocation": "us", "Title": "“very rood female receptionist 4:45 pm july 15,2010”", "Author": "marinee", "ReviewID": "UR71911613", "Content": "Never had worse encounter with a staff member in a hotel.Unfriendly ,unhelpful and rood.Possibly ready to get off work @ 5 PM ? Asked her to call a local (Barcelona) number for me,and she refused,even when I offered to pay for the call. Disappointing.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Acta Atrium is NOT a palace!”", "Author": "NoDoze", "ReviewID": "UR70984142", "Content": "I stayed at the Acta Atrium with my spouse and two young kids. We got a great deal from easytobook.com and read other positive reviews especially about accommodating families with young kids. We informed the hotel when we booked online that we would be staying post cruise and would need two baby cots. Upon our 10am arrival we were told our room would be ready at 1PM--no problem we went to sight see as we already knew how to get around. When we returned at after 1 pm we were sent to a dirty room then a room without baby cots. We were sleepy and had to wait 30 minutes for the cots to arrive--our kids were already sleep when they finally arrived. The next morning we went out around 10 am and returned after 3 pm to a dirty room even after placing the please clean this room sign on the door. The hotels only solution was to switch to a clean room while they cleaned our room then switch back again. Great! The air conditioning was losing the battle to heat the entire two days but we just needed to make it a few more hours. Never again would be book our stay at this hotel and caution you as well.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "west yorkshire", "Title": "“Good location, nicely furnished and above all genuinely 4 star.”", "Author": "lisaWestYorkshire", "ReviewID": "UR70592226", "Content": "My husband and myself stayed here for 4 nights, the reception staff are very nice and nobody bothers you at all. You can come and go as you please and feel you have your own bolt hole to come back to. We did not eat in the restaurant so cannot comment on that but the loction of the hotel is very good, not too central as to be noisy, in fact we were at the rear of the hotel so it was very peaceful. There are no views at the back only over a school which obviously isn't noisy until late, just till about 5pm, time but in a reassuring way. We were lucky enough to be in Barcelona for the world cup semi final and the atmosphere was fantastic and everyone took to the street afterwards to celebrate, wish we had been there for the final! The rooms are a good size, nice bathroom with plenty of shelf space, there are two sinks in the room and good wardrobe space also. The safe is free and there is a flat screen t.v. On the downside not many channels on tv in English, I know you are on holiday but everyone has to rest in between and it's always nice to chill in front of tv when you get in. The other thing is no kettle, we took our own travel kettle so were ok, the mini bar is not drastically overpriced so if you are caught out it is not too expensive. The only room service they seem to do is Pizza but with all those restaurants in Barcelona who needs it! It was our 5th trip to Barcelona and there is still much to see, went to Parc Guell, well worth a visit but it was the only time I was off my guard, being out of the city centre and having just come out of a gift shop passing what I had bought to my husband and not securing my bag for ONE minute I had my purse lifted. I was gutted, not a fortune in it but definitely enough for a meal out etc. they must watch you and wait till you are not concentrating, I am very cautious and have an across the body bag but just one minute of leaving it dangling at my side and my purse was gone, beware folks.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mountain View, California", "Title": "“Nice stay at Atrium Palace”", "Author": "quanmama", "ReviewID": "UR69387851", "Content": "We had a nice 4 nights pre-cruise stay at Atrium Palace from June 4 thru June 8. All the staff were courteous and helpful. Upon arrival, one of the staff gave us detailed instructions on how to get to some of the main attractions. We really appreciated that even though we had done lots of research and already knew how to get around. The hotel was very clean and updated. We liked having the 24 hours access to the business center, and we also was given the password to use WiFi on our iPhone which made it even more convenient for us. Food selections were very good at the breakfast buffet, and the food quality was good. We liked the location of the hotel and it was easy for us to walk from the hotel to subway stations and restaurants nearby. The only complain we had was that the room was a bit on the small side. The 3 of us did feel a bit crammed in there but we managed. We heard some noise from the elementary school kids at the back of the hotel but it did not bother us. Also I like to mention that the front desk staff did not note our nightly rate already included breakfast when we booked. They added the extra breakfast charge on our final bill but it was immediately removed after we showed them our booking email. Make sure you bring a copy of the booking email listing what is covered to avoid confusion. Overall we had a nice stay there and would recommend this hotel to others.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tromso, Norway", "Title": "“Great room and attractive location”", "Author": "MrBelpit", "ReviewID": "UR65148568", "Content": "I stayed for four nigths in this hotel and I loved my large room with a lot of facilites. The view was out on a backyard and nothing to write home about but that wasn't reason for my stay so that was no problem. The staff was friendly and helpful and the free wifi was excellent. I wouldn't hesitate recommending this hotel.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sidcup, Kent", "Title": "“dissapointed!”", "Author": "NAB68", "ReviewID": "UR64538401", "Content": "Yes this location is very good but thats about the only positive thing I can say. This was our honeymoon and we emailed hotel to advise them this. On check-in we reminded them again and was met with blank faces. So we get to the room and of course no champagne, no flowers nothing to make us feel special. Apparantly this was a good room but we had the cleaning cupboard one side, so everytime the staff needed something they banged and crashed about in there. And then outside our window was a courtyard that belonged to a school, so from 8am to 5pm we had screaming kids outside the window. Overall hotel is a good choice for tourist to barcelona but not for a special occasion.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Modern, efficient hotel in fabulous location”", "Author": "Lewy8", "ReviewID": "UR60131998", "Content": "Stayed here for 2 nights prior to a western Mediterranean cruise. The location is excellent. The north end of Las Ramblas was literally 4 blocks away. The front desk staff and bartenders were very friendly and efficient. Rooms vary widely because my room was quite small (typical for European hotels), but our friend's room was huge (They said only one large room per floor, so we chose to be on the same floor instead of separate). The beds were very comfy; the water pressure in the shower was good; and the closet was spacious. In room safe too always makes you feel good too. We used the hot tub and sauna - both were clean and worked well. The only thing we experience some disappointment in was the breakfast. The food selection was good, but the maitre 'd was a real jerk to guests...and not just us. Next time I stay here, I will go out of my way to make him mad, and only because he gets mad so EASY!!! Very disagreeable employee... By the way, Park Guell IS A VISUAL MUST SEE.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great hotel, great location”", "Author": "SKIpal", "ReviewID": "UR55931915", "Content": "We loved this hotel. Close to the main area but in a quiter part. The room was lovely, the bathroom great and the reception staff were helpful. If we are lucky enough to come to Barclona again we will definitely stay here.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "brighton", "Title": "“great location”", "Author": "jasmine05brighton", "ReviewID": "UR54094167", "Content": "nice and clean hotel, was a brilliant location happy with most things apart from the size of the pool it was TINY.. just enough room for 2 people which was very dissapointing!! and dont eat or drink from the mini bar well over priced!!", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Very positive but not too helpful staff”", "Author": "NikolayG", "ReviewID": "UR53463096", "Content": "I came to this hotel for spending a 1 week vacation with my girlfriend. Hotel was chosen for its convenient location and because it has an indoor swimming pool/spa area - nice to have in January. :) We were generally satisfied with the stay. The room was quite pretty and of good size, location is really great for any kind of winter-time activities (i.e. except for sea-bathing), breakfast are really plentiful and very tasty, the hotel has a fair sized indoor swimming pool and a good sauna. Still there were some negative sides as well. WiFi access in the room was mostly not working. The signal strength is quite low and even if you are connected most of the time there's no internet access anyway. Also be aware that with one login/password you can connect only one device at a time. At the same time wired internet access in the \"business centre\" works good and fast. All the hotel staff is extremely positive and willing to help. At the same time most of reception advices about transport, obtaining tickets etc appeared to be incorrect or, in terms of tickets, valid only for spanish citizens. And the maid, though again very positive and polite, didn't replenish some of the bathroom items. Also be aware, that the hotel restaurant and room service has a very limited choice of \"menus\" and pizzas and even so most of the time you can't get even the \"menu\" - only pizzas. Nevertheless the overall impression of the hotel is good and I would stay there again if travelling to Barcelona in wintertime.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "nyc", "Title": "“NOT GREAT AT ALL!!!!!!!!!!!!!”", "Author": "pji", "ReviewID": "UR52360830", "Content": "We chose this hotel for two reasons 1. the location and 2. the indoor pool. The location was good, BUT there are soooo many well located hotels in Barcelona that are less expensive and better valued. The indoor pool was the size of a large bath tub. The hotel indicates an \"excercise room\" which is not functional and not safe. The temperature in the rooms were not temperate and could not be controlled-- TOO HOT! Leaving you to open windows to the very NOISY STREET! The front desk was not helpful and not knowledgeable at all. They could not make restaurant suggestions or even let us know where a train was located. It was like pulling teeth to get them to even look up anything on the internet. We booked our reservation as a family of five, they put us into 2 rooms with only four beds, and then acted as if it was our fault that we needed another bed. The rooms are average size when speaking of European standards. The only thing that places them as a four star is probably the white terry bathrobes that can be used. This hotel's lack of hospitality was embarrassing. It was a very disappointing stay for Christmas week especially since we spend a lot of money at this hotel. I will say that the breakfast buffet (12 Euros each) was lovely and the staff at the hotel's restaurant was also very well trained and friendly. But it is my opinion, that a hotel needs to offer something more than a good breakfast!!!!", "Date": "January 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Portstewart, United Kingdom", "Title": "“location, location,location”", "Author": "hihiromi", "ReviewID": "UR52107892", "Content": "great location, good price, only if it was a 3star hotel. room service food was limited to pizza and sandwiches. no porter to carry heavy bags. swimming pool was ok but had to change in your room. free wi-fi was not working for 4days of our stay- for that, no internet in business centre as well cleaning staff just enter our room without even knocking the door. over charged for minibar drinks. still, good location and nice staffs. wouldn't sty again though.", "Date": "December 29, 2009"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Great Location, Price, Breakfast”", "Author": "harrymart", "ReviewID": "UR49452448", "Content": "We stayed here 3 nights in Ocober, pre-cruise. We booked online and got a great rate that included breakfast. We arrived after an all night flight. Having paid for the previous night, we were checked in and in our room quickly (there was no wait at 8:oo AM). This was a good precaution, because we saw later in the morning that other overnight arrivals were camped out in the lobby, waiting for their rooms to be ready. We had a room in the back, which was quiet, and liked the modern decor. Very clean. Only complaint was that the mattress was hard (but we got used to it) and it is a tricky maneuver stepping in and out of the shower (if you are overweight or have vision problems, you might not like the tight shower configuration, if other rooms have the same design.) The business center had free internet access, which was convenient. We enjoyed the American style breakfast buffet - eggs, cheeses, meats , cereals fruits - a good meal fueling us for touring. The staff was very helpful and provided maps and directions. Central to many attractions and the HOHO bus, on a beautiful boulevard. You won't be disappointed. Note: We cabbed it to the cruise pier. We heard later that this is the best way to go - the cruise line charged alot more for transfers. Cabs are plentiful and the pier is 20 minutes away.", "Date": "November 17, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ireland", "Title": "“Will definitely stay again”", "Author": "Michelle_Tobin", "ReviewID": "UR48816830", "Content": "Stayed in this hotel for 1 week in September. Location is great. Staff were so helpful. Rooms were so clean and spacious. Loved the bathrobes and slippers...great touch. Hotel restarurant is not great , but who cares when there are some lovely restaurants within walking distant. Only a few minutes walk from the main square , shops and nightlife. I have recommended this to many others and hopefully when I visit Barcelona again I will stay here. Enjoy!", "Date": "November 9, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Yorks", "Title": "“Great location, friendly staff let down by paper thin walls...”", "Author": "pyorks", "ReviewID": "UR48178098", "Content": "Location was great, minutes walk from main centre. Staff in particualr on reception were very friendly and helpfull, the breakfasts were fantastic. A modern conversion that is really let down by the paper thin walls! On our first night we were kept awake from 5am with our neighbour being ill in the adjoining bathroom - we could hear everything we could also hear word for word all their conversations! For this reason, Im afraid we couldnt stay at hotel again. The hotel was clean and modern - we had booked originally as it had an indoor pool - unfortunately it was rather smelly of drains in the basement health area! We loved Barcelona - would have been even better with better sound proofing!", "Date": "October 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "sf", "Title": "“Good Value & lovely too”", "Author": "suzeetes", "ReviewID": "UR47875596", "Content": "Finding a jacuzzi to renew some sore feet & being able to swim in the indoor pool meant revitalization for us after a long day of being a \"tourista.\" The English skills of the staff are excellent & they are very helping with even the smallest questions & suggestions. We were pleased at the location & room too.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "maryland", "Title": "“Traveler friendly and helpful”", "Author": "jg12318", "ReviewID": "UR46922973", "Content": "Sleek European style...staff was knowledgeable and friendly.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Dallas, TX", "Title": "“Great location, great staff, nice room...horrible beds”", "Author": "SteveMavsFan", "ReviewID": "UR45752990", "Content": "Stayed at this hotel for 2 nights and the location is great for any visit to Barcelona. Walking distance to many sights and just a few blocks from some major metro stations so you have easy access to anywhere in the city. The staff at the hotel where great, very friendly and helpful. The only exception was with getting tickets to Barcelona football game. They only wanted to help if you used the ticket agent they worked with and of course they got a cut. They next problem I had was the beds...the problem was it the mattress was JUST A BOX SPRING!!!! Had several others with us and all 3 rooms had this. They where rock hard but we slept great so go figure. Over all I liked this hotel but not sure I wold have been ok with the beds if I had not just flown in from the US so was dead tired.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Would stay here again”", "Author": "Lackeen", "ReviewID": "UR43560945", "Content": "The Atrium Palace is a great base for a break in Barcelona. Just a 5 minute walk to Placa Catalunya from where you can explore the city. The area was still quiet at night. Rooms were lovely. We stayed on the top floor with a view over the Gran Via. The staff were very helpful with recommending restaurants and providing us with adaptors! We got good value on this hotel, and with is great location and just being a lovely hotel in general, we would go back here if we are lucky enough to be in Barcelona again.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Loved the Atrium Palace”", "Author": "RichL46", "ReviewID": "UR42902522", "Content": "On a family vacation with our 2 boys, we had 2 stays at the Atrium Palace. After an all-night flight and an early arrival, we took the Aerobus to Placa Catalayuna. A 10 minute walk and we arrived at the Atrium Palace for our initial 3 night stay. To our surprise, our rooms were ready and we were able to use them for a brief rest before beginning to explore Barcelona. We found the rooms to be comfortable and clean. Some may not like the hardness of the beds, but they were fine for us. As we were resting up, there was some noise from the schoolyard in the back of the hotel, but we were able to get some sleep anyway. The free wi-fi in the room was a big plus for our sons. The location is convenient for walking to many of the attractions of Barcelona and the excellent subway system is nearby. The staff was very helpful whenever we had any questions. Check in and Check out went smoothly for both of our stays. If we return to Barcelona, I would not hesitate to book another stay at the Atrium Palace.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Essex, England", "Title": "“Location, Value, Rooms all Superb”", "Author": "marcymarc24", "ReviewID": "UR37406736", "Content": "For what you pay this is a great hotel. The location is 5-10 mins walk from the main bus stops. Getting the open top bus tour (about £20) is he best get around for the city as everything is so spread out. Rooms are clean and staff are all helpful. There is a main road outside but with the air con you can shut out the noise and have a good nights kip.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Greenville, SC", "Title": "“Excellent location, great hotel, will return there”", "Author": "goldenoreos", "ReviewID": "UR36784568", "Content": "We stayed there 6 nights. Hotel staff was great: friendly, helped w/ reservations and recommendations, spoke multiple languages. Rooms were very nice, with plenty of space and were clean. There is a little bit of street noise at night, but not any more than any other big city. We did not use the pool/sauna area, but did get to use their computers to check email/maps every now and again. Location was excellent, just a couple of blocks from Placa de Catalunya where you can catch all kinds of public transportation, and close to Passeig de Gracia and La Rabla - without all the noise. I would definitely go back here and definitely recommend it. Bring your walking shoes and explore this magnificent town!", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "sunsearcher2009", "Title": "“Great location and staff were extremley helpful”", "Author": "sunsearcher2009", "ReviewID": "UR35566125", "Content": "Read some mixed reviews about this hotel, the location is excellent, 2/3 min from metro station, 5 min walk from placa la cataluna and la ramblas. The staff went out of their way to be helpful and could not do enough for us, helped with advise on things to do, how to get their etc. Used the pool, jacuzzi and sauna, they were excellent although the jacuzzi i found a bit cold, they are of course indoor in the basement of the hotel. The rooms are quite roomy and very nicely finished and layed out. Didnt eat in the restaraunt or have breakfast, did have a drink in the bar and again the bar man was very helpful and pleasant. Their is some truth in some of the bad reviews, there is a school at the back and if you like sleeping in in the morning you will find it quite noisy, also the cleaners do make a lot of noise also. One or 2 small cracks in tiles in bathroom and did see one or two very small spiders on floor in room, but it was very warm while we were there, oh and the air conditioning in the room is excellent. Over all i was very pleased with the hotel, we got very good value for money and i would have no hesitations in recommending the hotel to friends or family.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "bangkok", "Title": "“good hotel , great value , well located”", "Author": "ab500", "ReviewID": "UR34192555", "Content": "Great hotel and very well located. The rooms were nice and clean . When we reached the hotel we were very warmly welcomed by the hotel staff. The staff at the hotel can speak very good English and they will guide you regarding the area around the hotel and what all there is you can see in Barcelona. You have acsess to free internet at the business center of the hotel . The cab ride from the airport to the hotel will cost you around 30 to 40 Euros. The hotel is located at the city center near the bus stop and the metro. The hotel is just 5 minute walk to the metro as well as the blue and the red line buses. ( hop in and hop off tours )The blue line will take you to the beach where you can find places to eat and if you are in a mood to try your luck , then you can visit the casino which is also in that area. (I would suggest you to buy a 2 day ticket for these bus tours as they will cost less ) This hotel also located just 10 minute walk form the famous la remaballas area. There a lot of places to eat in and around the area . Over all it Barcelona was a very good experience , and we had a very comfortable stay at the hotel. Warning: Be very careful with your belongings while using the subway as there are a lot of pickpockets. Usually they would enter in a group of 3 to 4 people and while exiting the train they will crowd you and one of them will take out your wallet. As this has happened to me, so please be careful.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Central to all Barcelona - great stay”", "Author": "jmwing", "ReviewID": "UR33270549", "Content": "We stayed at the Acta Atrium Palace 2 nights during our Spain vacation. It is at the bottom end of the Eixample and close to the metro and placa de catalunya and las ramblas. Our room was clean and spacious. The staff was helpful and polite. Our room was in the back and we could hear schoolchildren playing at lunchtime, but they were not there in evenings. Tips: why eat at a hotel restaurant when there are so many other great ones in the city - Two good ones are Tapas 24 and ciudad condal (both tapas, both 5 min walks). Make sure you go to the boqueria market on las ramblas - best thing to do in town.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Amazing”", "Author": "BRCruiser", "ReviewID": "UR33181034", "Content": "The customer service at this hotel was above and beyond. The rooms were spacious and unlike any other hotels for the price in Europe. It was overlooking a school yard but if you are not in your room during the day (and you shouldn't be because you should be sightseeing in Barcelona) you won't hear any kids having a good time. They had free internet and spoke English as well as recommended good restaurants and gave precise instructions on how to get to places just walking. It also had a whirlpool and swimming pool that were perfect for a bit of relaxation in between the sightseeing.", "Date": "June 25, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Atrium in the middle of a historic city”", "Author": "ScorpioAnu", "ReviewID": "UR32090986", "Content": "Acta Atrium was a very comfortable hotel right in the heart of the Cataluniya. The staff was very warm although they spoke little English. Cataluniya square was just 5 minutes walk from where you can start your journey by taking a hop-on hop-off bus. The Ramblas starts at this square where you can stroll down the long 5 mile street full of energy and activities. I didn't had a power adaptor but the hotel staff were kind enough to give us one to charge our cameras. Also the hotel provides free water bottles, which helps in an expensive city. Hotel offered free jacuzzi, use of gym, spa and indoor swimming pool. It was say it was value for money.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ridgewood, New York", "Title": "“High Class, Great Location, Memorable Service”", "Author": "jorgeq82", "ReviewID": "UR31714638", "Content": "Upon returning a 12-day mediterranean cruise onboard Royal Caribbean for our honeymoon, my wife and I booked a one night stay at the Atrium Palace. The hotel was recommended via a cruise line booklet and was quote at a much higher price but fortunately we manage to snatch a great deal through Expedia. $100 for one night. Location is wonderful especially from Plaza Catalunya, where you can easily board a \"Hop On Hop Off Tourist Bus\" to take in a great and quick feel of the beautiful city. The hotel itself along with room and staff were fantastic. High class at a reasonable price. Elegant rooms, wooden floor, hot tub and they provide you with other amenities that any other other hotel would have charged you initially for. As a frequent traveler, I was mostly impressed coming across a hotel that really does offer FREE Internet Wi-Fi access. You see the signs all the time in places but they always charge you a fee subscription to use it. At the Atrium, all you have to do is inform front desk that you're interested in using the internet and they'll supply you with a username and password that you can later use to navigate the web at absolutely no cost. Whether it's on their computer or your laptop. There's a elegant restaurant attached to the hotel that's also very convenient. Beautiful romantic pool and jacuzzi to do away the stress after a long day of touring. My only minor nitpicking of my our experience at the hotel was the the bed was rather hard. Overall, I highly recommend this hotel.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Huntsville", "Title": "“wonderful stay”", "Author": "cas1905", "ReviewID": "UR30317209", "Content": "My daughter and I stayed at the Acta Atrium Palace Hotel 6 days in May. First, the hotel location was excellent. Right in between the new and old sections of the city. 1/2 block from Metro. Very close to Placa Catalunya. Staff professional, courteous, and helpful when asked. Room was modern, updated, and clean. Bathroom had tub and shower and sink. Also, outside in a little alcove was another sink which we found helpful in the morning. Bathrobe and slippers provided. Excellent toiletriees. We had a room with a huge balcony overlooking the Gran Via. It was very nice but sitting out on the patio was a little noisey due to the traffic. Inside of room very soundproof, no traffic noise heard. Breakfast buffett was enjoyable and sufficient--bacon, eggs, potatoes, rolls, croissants, fruit, meats, cheeses, pastries, cereal, coffee, and juices. We did not use the minbar, but the prices were very reasonable. Also forgot to mention the in room safe, which was a plus. DAughters luggage did not arrive in Barcelona with her and the staff was helpful in calling the airline and interpreting for us and the next day, the bag was placed in our room. We did not use the spa area, but it appeared nice and clean. Hotel also had internet services which we did not use. We enjoyed our stay here and would have no problem staying here again. One other thing. Approximately 10 days before we arrived, I received a nice email from the hotel about our reservations and alot of suggested sites to visit which was very helpful.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "toronto", "Title": "“Good value, great location”", "Author": "bruce14", "ReviewID": "UR28832016", "Content": "We stayed for four nights at the start of April. Front facing room on the second floor had significant road noise, manageable with ear plugs, small balcony a nice touch. Good size room, free wireless internet a bonus. Excellent location, easy walk with luggage to/from airport bus, the Ramblas, the shops and restaurants of the Passeig de Gracia. Recommend the hop on/hop off bus for a comprehensive tour of all the city has to offer (we bought the two day pass and covered all three routes)", "Date": "April 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cornwall", "Title": "“Great hotel - fantastic location excellent staff”", "Author": "pra130", "ReviewID": "UR28208691", "Content": "We stayed here for a week at the end of march , lovely hotel spotlessly clean with v helpful staff. Breakfast is expensive but not if you book the inclusive deal in advance. Possible to have a ten course breakfast if you want. Spa facilities are small but very pleasant . The road at the front is very busy but the triple glazing is totally effective and keeps out any noise.Would highly recomend this hotel.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Big Room, Great Location, Free Internet”", "Author": "Chris_n_Christine", "ReviewID": "UR27960538", "Content": "We stayed for three nights at the end of a 3 week tour and this hotel is at the top for recommendations to friends. Our room was really big for european standards, but was in the back near the school, which meant the day always started with loud kids playing outside. That was okay for us since we were up early to sightsee anyhow. The bathroom was also large, and we had a minifridge in the room. From the hotel we were able to walk to La Rambles, the old Roman quarter, and even to Sagrada Familia (though that's a bit far). Hotel is on a tree-lined off shoot of a main road loaded with restaurants. Conceirge was great with recommendations, getting up complimentary umbrellas when it was raining, calling cabs and pointing out things on a map. Added bonus of free computer and internet usage in a business lounge. Has a pool and hot tub in the lowest level (basement) -no windows, darker and small, but relaxing.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Littleton, Co", "Title": "“Great location and great staff”", "Author": "LuanneS", "ReviewID": "UR26267007", "Content": "Our room was great and clean and quiet. Not far from the Les Rambles, The Market, and the trolley stop with a great route to see a large portion of the city. The staff was very helpful and recommended great places for dinner.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ireland", "Title": "“Excellent Choice of Hotel”", "Author": "whales", "ReviewID": "UR25862342", "Content": "Was extremely happy with this hotel from the minute we walked in to the minute we left. its the perfect location - just away from the business of las ramblas, yet just a stones throw away. the hotel is spotless, cosy and has everything you need (including little cafe). The staff at reception are very friendly and help you with anything you need. the bedrooms are spacious, and extremely comfy - they provide you with everything - soaps, shampoos, toothpaste/brush/ shoe shine, shower caps, combs, tissues, razor/shave gel, slippers and fluffy robes. We had a front facing bedroom facing the busy road but heard nothing of traffic at all. The pool and jazuzzi is on floor -1 and is is a haven of relaxation - I went down each morning before heading for breakfast and it was pure heaven. The ambience there is fab with soft coloured lighting to sooth. We did not have breakfast at the hotel, but we ate in the cafe next door a couple of times (just coffe and crossoint). We did have a couple of mixed drinks on our first night which came to 18 Euro for two drinks which we though was a bit steep. This would be our only complaint. Overall I would highly recommend this hotel to couples, families or business travellers - its the height of professionalism and everything you would expect in a hotel. Thanks Atrium for making our break so enjoyable.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "monmouthshire", "Title": "“best location”", "Author": "rachelmMonmouthshire", "ReviewID": "UR25494174", "Content": "we arrived at midnight and checking in was a breeze. we were shown to our room with a smile and nothing was too much trouble. the hotel is fantastic, and the staff were very helpful. the location is fantastic, away from the hustle and bustle but only a 2 minute walk to be right in the centre of barcelona. there are very good restaurants and tapas bars nearby, just ask at the reception desk and they will advise you, even phone through to make your reservation for you. the rooms were very clean and bathrooms were well stocked with anything you may have forgotten. our room was on the front with a balcony overlooking the main road,but the double glazed windows were very effective. i will certainly be staying here again, and would recommend to everyone to just book this hotel and stop trawling through all the reviews as i did.", "Date": "March 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Excellent hotel and location at great price”", "Author": "calebbrewster", "ReviewID": "UR24456136", "Content": "This is a high quality boutique hotel in a gilt-edge classy location at a great price. I wasn't sure from the guide books that this would be a good location, but it is; with excellent metro a block away, regional train station three blocks away, and reasonable plentiful cabs and buses right outside the door. Many top restaurants and shopping also nearby at walking distance. Safe, modern, gilt-edged district of Barcelona, a fascinating historic city. Concierge and staff all friendly, knowledgeable and spoke English.", "Date": "February 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Lovely hotel in excellent location”", "Author": "Aegeandream", "ReviewID": "UR24050889", "Content": "We stayed for four nights in this really lovely hotel. The rooms are very nicely decorated, very comfortable, clean and spacious. We had to change rooms after one night as there was renovation work going on in the building next door (nothing to do with the hotel itself) which woke us up at 7.30am in our original room at the back of the hotel. The staff dealt with it very efficiently and we were moved to a room at the front of the hotel for the rest of our stay. It was still a very nice room but was smaller and less well-equipped than the previous room (no second sink or small table) so if I was going back I would request one of the back rooms so long as the building work next door had finished! There was some traffic noise as well at the front although we were on the 5th floor so it wasn't too bad but earplugs are still a good idea. The hotel itself was one of the quietest internally I've ever stayed in, no noise from staff, lifts etc which was great. There are some lovely touches which really make this hotel a 4 star superior in my opinion, they had the most extensive range of toiletries I've ever seen in a hotel (including razor and toothbrushes), bathrobes and slippers in the room, free water (although no tea/coffee making facilities in the room unfortunately) etc. The free wifi is also great although the \"interactive TV\" was disappointing as you have to pay to use the internet through the tv so bring a laptop! It's in a really excellent location, 5 mins walk from Passeig de Gracia, 10/15 minutes walk to the old city, in a lovely safe area. One tip: we decided to treat ourselves to a taxi to the airport thinking it'd be about €25, it cost €35! The airport bus is only 10 minutes walk away at Catalunya so we'll be taking that next time! We've been to Barcelona a few times and were delighted to find this hotel as we've had mixed experiences with hotels there before. Overall, a great hotel in a fab location!", "Date": "January 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "brighton/broadstairs", "Title": "“Lovely”", "Author": "melaniebeth", "ReviewID": "UR23034434", "Content": "Lots of our friends have stayed at this hotel so due to the good reviews me and my boyfriend thought we would stay here for ym 21st birthday. when we came to check in they said they didnt have our booking but luckily there were rooms avaliable. Our room was lovely nice and spacious with a large clean bathroom, loved the bathrobes and toiletries in the room. We had a large balcony which did over look a school yard but the noise didnt affect us or wake us up so this didnt matter and we enjoyed watching the kids play basketball. The bed was very comfy and we LOVED the swimming pool and jacuzzi we had it to ourselves every day which was fab! The hotel is very nicely decorated and well kept and the staff are very friendly. We didnt eat at the hotel as we thought it was a little pricey but the hotel is located centrally so we walked to restaurants and bars during our stay. I would definatly recommend this hotel to couple and families.", "Date": "December 27, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Westminster, CA USA", "Title": "“OK Hotel, Good Location”", "Author": "Gary06", "ReviewID": "UR22859892", "Content": "We stayed here one night prior to a cruise, this seems to be a popular hotel for the cruise lines. The hotel is nice, clean, in an excellent location in the center of town close to everything. We used the nearby Metro station to get around....the Metro is safe, fast, convenient, and easy for visitors to figure out. Our room was in the back which overlooks a school that had basketball and soccer games going until about 8:00pm but actually this was not a distraction and probably quieter than the front which is on a busy street. The only complant we had was with the bed which was poor (you roll to the center) but otherwise everything else fine. Breakfast was included and the quality was excellent. I think this hotel can be a little pricey for what it is, I might stay here again but would also look around at other sites before coming back.", "Date": "December 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oneonta, New York", "Title": "“A great little hotel in a great location”", "Author": "N_and_R", "ReviewID": "UR22501676", "Content": "We stayed at Apsis Atrium Palace Hotel in Barcelona on two separate nights (one night before our cruise, and one night after the cruise). Our travel agent who booked our cruise also booked this hotel for us. The hotel is located on Gran Via de les Cort Catalanes, about 2 blocks west of Passeig de Gracia. We really liked the location. We stayed in a fairly large room in the front of the hotel with a balcony overlooking the Gran Via on the night before the cruise, and a slightly smaller room facing the back of the hotel (no balcony), with a view of a school on the stay after the cruise. We had the breakfast included on our rate on our first night. We thought the quality and value of the breakfast was excellent. I highly doubt it is possible for someone to grab a quality breakfast for 9 Euro/person anywhere else in Barcelona.", "Date": "December 6, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London, England", "Title": "“OK for a business stay”", "Author": "London Frequent Traveller", "ReviewID": "UR19851636", "Content": "I stayed here for one night attending a conference; the organisers booked the room. The hotel is a rather old-fashioned Spanish establishment in a prestigious location on the Gran Via; my front room had some traffic noise from this busy street, though not very obtrusive by Spanish big city standards. The room was not too large, though adequate for an overnight stay. I suspect that you can find better by reading Trip Advisor reviews!", "Date": "September 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Seattle, Wash.", "Title": "“Quite Disappointed”", "Author": "lworthalot", "ReviewID": "UR19720385", "Content": "Stayed 2 nights before leaving on a cruise vacation. Chose the hotel based on the good reviews on this site. We requested a 2 queen room when we booked about 6 months ago. Upon arrival we were told none were available and were put in a 1 queen room about as big as our closet at home. Bed was the size of a full size..not a queen size. The bathroom floor was granite with 2 tiles broken . The bathroom door would only open about half way before sticking..you had to slide in then close the door. Taking a shower in the bathtub was like showering on a skating rink. Once the tub got wet it was almost impossible to stand up without bracing against the side of the tub. I asked for a rubber mat but only got a strange look for my trouble. Their great restaurant was a joke for dinner though the buffet breakfast was very good. Would not consider staying here again. For the money I expect much more than what we got.", "Date": "September 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york, ny", "Title": "“Great Stay-Terribly Underrated by TripAdvisor Users”", "Author": "bgold7a", "ReviewID": "UR19409041", "Content": "Just spent three nights at Atrium Palce and can not understand the negative reviews. Everything was excellent. Great location, spotless, very helpful staff that checked us in at 7 AM after the over night from JFK. We were a group of 7 and had two rooms, one on 7th floor with balcony/hot tub and one on 6th floor that was a standard double. Note that this hotel gets three starts (out of 3) from Frommer's. I think there is some competitor writing the reviews. For the traveller from Paris to give one star and say that the hotel bar looks like a bodega on a dark side street is just totally false. It is a bright airy place that makes great cappucinos and has excellent bartenders. Breakfast is also excellent, but not cheap.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great Place to Stay”", "Author": "MardiGras46", "ReviewID": "UR19123389", "Content": "Stayed here 2 nights after a cruise. The hotel staff was very helpful and had very good English skills. They handled the luggage very well. The restaurant had a complete breakfast with both American and European style food. The room was very spacious although the bed was not very good, the mattress was extremely hard. The location is excellent and close to many of the main attractions of Barcelona. There are many good restaurants within 15 minutes by walking.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dixon, California", "Title": "“Clean, Quiet and Nice Location”", "Author": "OpusTheCat", "ReviewID": "UR18037856", "Content": "We spent 4 nights at the Atrium Apsis before our Mediterrean cruise and we really liked the property. The location is wonderful. It is a short walk to Placa Catalunya which is central to everything. Our rate for the first two nights was only 122 Euros, which is a great deal for Barcelona. The last two nights it was 170 Euro. This is because the cruise ship booked pre-cruise passengers in this hotel, so I believe it was at capacity for our second two nights. The room was nicely furnished and the bathrooms were excellent. The free business center was great for checking internet email. The only real complaint was the elevators. They were very small and hot, but other than that we thought it was a very nice hotel. We would stay here again if we go back to Barcelona. (Which we loved) You can see our entire trip report with pictures on our sunnytripreports web site.", "Date": "July 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Very bad experience”", "Author": "stechris", "ReviewID": "UR17142166", "Content": "Room : problems with hot tube and lavatory ( water leaks ) , Tv remote was out of batteries , electricity stopped for couple times ( also for elevators ) Services : Personnel entered and called numerous times my room. Sometimes without knocking. They looked well intentioned , but not too educated i think. Hotel bar looks more like a bodega on a dark side of an avenue. Location : the only positive thing : it's really close to the center", "Date": "June 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "planet earth", "Title": "“This hotel 4 stars rating??Not so much... Please read!”", "Author": "lilybelle264", "ReviewID": "UR17006159", "Content": "We've just returned from our trip from Barcelona and booked a travel agents rate since I'm one. Stayed from June 15 to 17- let me start by saying the location is excellent, centrally located. We purchased the breakfast for half price 8 euros and it was a good deal considering what you get. We arrived hotel after our amazing European cruise visiting Italy, France and Malta. We arrived at 8:30 and Rafael at the front desk was really pleasant and friendly. He told us that the room was not ready which I completly understood he told us that the room will be ready by 12pm. We walked around the Ramblas and frankly I think it is way overrated, way to expensive to eat and shop, go else where for shop and eat, Try The Cortes Ingles restaurants on Plaza de Catalunya the prices are good and the quality is excellent. (On Sundays most of all Barcelona shuts down, shops, supermarkets, ect) Well. going back to the hotel, we went back at 12pm and was assigned room 307 on the 3rd floor, the two elevators are small and hot. The room was ok , there where laminated floors that was installed really sloppy, the moldings around the floors where falling off and not well put together. The bathroom door paneling was peeling off the door and also the bathtub was really slippery and also there was rust building around the parimeters of the tub. The pool and jacuzzi were closed for renovations. Dont let the pool fool you its is really small. Also the beds are awful, the springs where stabing me for 2 nights in a row. Ouch!!! They really need to update their beds. I dont think this hotel deserves a 4 star rating to be honest. Oh by the way room 307 was facing the school yard and that did not bother us at all since the windows are double pane. I think that Apsis Atrium Palace tries but dont deliver. I never got the free water or the juices. Will I stayed there again and recommend this to my clients, I probably will for the really cheap price, other wise I will stay elsewhere pay a little more and get what you deserved based on the price paying per night for hotel room.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Lauderdale, Fl", "Title": "“Hotel did not accomodate our requests”", "Author": "kevinc", "ReviewID": "UR16745883", "Content": "We booked our reservation 4 months in advance requesting a room at the FRONT of the hotel (read about the school yard in the back) for our recent post cruise 2 night stay. Upon dis-embarking from our cruise ship, arrived at the hotel we were told our room was not ready as the hotel was sold out the night before, check back at 12 noon. We returned at that time and was told our room was still not ready. So we sat and waited. The bellman eventually came by and said the room was ready and handed us the key. We got into a very hot, small, slow elevator, reached the room realizing we were in the rear of the hotel. Yes, the school kids were playing in the courtyard! The room itself was just okay, with laminate floors? The bathroom was nice with the exception of the towel rack in the tub, poorly placed for someone to bang head against. Very dangerous! It was not the room we had requested but we were very tired and wanted to see the beautiful city outside, time was limited and we waited 4 hours for the room. Spent very liitle time in the room but feel we paid too much for this hotel, (even booking in advance) realized after extensive walking around beautiful Barcelona that many other less expensive, same quality hotels are available in similair or better location (travelers take notice!) We would not stay here again.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Excellent Hotel”", "Author": "MissStress", "ReviewID": "UR15860962", "Content": "Excellent location on the Gran Via. Our room was at the front overlooking the tree-lined street. It was an excellent location. Initially, I wanted to stay at a hotel right on La Rambla. I'm glad we stayed at the Atrium Palace instead. It was close to everything, but away from the crowds at the same time. Much better choice for us. The hotel offered a free business center with 2 computers available for use. The business center also contained a library of books on local topics. Kudo's on the robes, towels and linens. You can always tell a quality hotel by their towels, and these were thick and the size of beach towels. Very nice. The hotel staff were all very nice and helpful. I can usually find something to complain about, but honestly, this place was great. Okay, I have one complaint, 16 euros for breakfast is way too much, so we ate pastry at the many cafes that are everywhere you look. I know... quite a hardship, right?", "Date": "May 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“A Perfect Start to Our Dream Honeymoon!!!”", "Author": "couple_traveler", "ReviewID": "UR15778703", "Content": "We stayed in the Apsis Atrium Palace for 4 nights and 5 days, and it was the perfect start to our honeymoon. We were in Spain taking a cruise from the Barcelona port. The things we liked about this hotel: - gorgeous location - in walking distance to everything -beautiful pool area -romantic setting -clean and comfortable -free room service (yea, breakfast in bed every single day!) - awesome staff, who speak english and are very willing to help show you around - seconds away from local transportation I cannot rave about this hotel more, it was the best choice we made for our time in Spain.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "4"}, "AuthorLocation": "Pacific Northwest", "Title": "“Lovely Hotel with a great Staff”", "Author": "byrdy", "ReviewID": "UR15031528", "Content": "My husband and I stayed here for three nights and loved the hotel. My only complaint was the noisy school children outside in the school yard. The staff could not have been more friendly or helpful. The breakfast was well above average and we looked forward to it each day. The hotel is well located and an easy walk everywhere. In summary, this is a lovely hotel and a very good value. I would definitely stay here again.", "Date": "April 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“A pleasure”", "Author": "alwop", "ReviewID": "UR14846021", "Content": "Everything was just as you would expect from a four-star hotel -- or better! The front-desk staff are very friendly, and I practically had to chase the porter who took up our luggage to give him a tip. The facility looked new and well-maintained (though the elevator ride was a bit bumpy at times). Our room was quite big for a large-city hotel, and everything worked and looked fine. The advertised wireless Internet was fast and reliable. Breakfast was well above average for Spain, with both hot and cold choices, coffee/tea and delicious orange juice and fresh fruit available on the buffet. For our purposes anyway the location couldn't have been better: it's a short walk to Passeig de Gracia, where all the top designers have their shops, and Plaça de España is within walking distance (El Corte Inglès department store is also a a treat). There are plenty of good restaurants in the streets around the hotel. Our best discovery was foc, in Joan de Borbó, just around the corner from the hotel -- perhaps a bit too trendy for some, but with excellent food at extremely reasonable prices. (If you go, save room for the assorted desserts!)", "Date": "April 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Highly recommended!”", "Author": "maverick1234", "ReviewID": "UR14635110", "Content": "My wife and I stayed at the hotel for three nights during our vacation in Barcelona. It was simply one of the best hotels that we've ever stayed in. I loved the charming facade of the hotel and was mentally prepared to find a tired looking room but instead, we found a very modern room with impressive fittings. This hotel is really a gem....not to mention the excellent location (3 minutes walk to La Ramblas and P. de Gracia.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great hotel & city”", "Author": "UtopiaUk", "ReviewID": "UR14519048", "Content": "Really lovely hotel, staff are excellent, the location and facilities - especially the pool and spa are great. For a quieter room request a high floor and at the back of the hotel. Great breakfast. Really amazing city. Always be very vigilant in Barcelona.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, England", "Title": "“As Always Excellent”", "Author": "laurad656", "ReviewID": "UR14125794", "Content": "Stayed here in Nov 2007 and returned again for my birthday last week. This is now my third stay here. Three of us in one room. I have not been the one to stay in the extra bed but my friend who did said it was very comfortable. Rooms at front of hotel overlook the main road and have lovely little balconys so I suggest if you don't want to be woken by the school as I have read in other reviews you ask for a room at the front of the hotel. The hotel staff are very accomodating and friendly. As it was my birthday whilst I was there, my mum contacted the hotel arranged for a bouquet of flowers to be delivered to me. The hotel arranged everything and got a beautiful bouquet from a florist on Las Ramblas, even packaging them up for me with so that I could take them home on the plane, rather than leave them behind. Couldn't have asked for anything more. Flowers were stunning and the housekeeper did an excellent job of sorting a pot/water etc for their journey home. Bottle water is provided free - they even sent a large bottle to our rom at 4am one morning on our return from our night out and did not charge which we were pleasently surprised about. I recommed you book the breakfast in advance for 8euros as this cannot be faulted. Will only ever stay here when visiting Barcelona and I recommend to many people. Excellent hotel, location great and the staff are very helpful - all for a price I feel is good value comared to other hotels in Barcelona.", "Date": "March 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Detroit, MI", "Title": "“Not horrible, but not good”", "Author": "russc727", "ReviewID": "UR13822253", "Content": "We stayed 6 nights in Barcelona, three at this hotel and three at another one nearby. The other hotel's listed price was higher, but the Apsis Atrium ended up being more expensive and it was a much less pleasant stay. First, I booked directly through the hotel's website and requested a room for three (my wife and I were travelling with an 18 year old daughter). We stopped by the hotel 2 nights before we checked in and found out we had a room for two booked, with no room for a cot. They moved us to a larger room at \"no additional cost,\" but an additional 60 euro/night charge for the cot. Upon check in, everything seemed fine. The room was indeed adequate for the three of us. However, there is a school next to the hotel and we were awakened at 7am by hoards of youngsters playing in the schoolyard. It was impossible to sleep beyond 7am. That was ok with me, but not my 18 year old. Also, the walls do not appear to be any impediment to noise. I'm used to hearing my neighbors if they are talking as they leave the room next door. In this hotel I could clearly hear people talking from several rooms away, even from other floor levels. I travel a lot and have never stayed in a hotel with such poor acoustics. The flooring in our room was very cheap linoleum that was warping up in several areas. On the positive side, the location is excellent. Easy access to shopping and reasonable walking distance to several tourist sites. Two blocks to a metro stop. Four blocks to the airport bus at Plaza Catalunya (3 euro into the city, 4 euro back to the airport).. The staff were friendly and helpful. The hotel was very clean. The bathrooms were very nice. At checkout I was charged 25 euros for the few calls we made (I only used the phone three times to make dinner reservations, call a friend and once to check on the hours of Park Guell-probably 9 times total). At the other hotel we used there was no charge for local calls from the room. When it was all added up, I paid more per night for this hotel than the other, \"more expensive\" hotel. Our stay here was not a disaster, but I would not stay again and would definately not recommend it to friends.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Netherlands", "Title": "“Great Suite”", "Author": "FlyingDutchman82", "ReviewID": "UR13461299", "Content": "The Apsis Atrium was a lucky pick as I stayed there during the yearly 3GSM Conference. I stayed in the suite on the topfloor of the hotel. Unfortunately on my own, really should be there on a romantic weekend with my wife. What a great location, with a fantastic view over the city. Stylish interior, great bed, luxurious bathroom with oval bubble bath, separate room with tv and couches, spacious bedroom with great beds and again a tv set. Sliding doors to the stretched balcony with wooden flooring and a Jacuzzi (which due to time of year was not working), deck chairs.", "Date": "February 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "aurora, ohio", "Title": "“Great value”", "Author": "happytraveler000", "ReviewID": "UR13181496", "Content": "The staff was friendly and helpful, cost was reasonable, very clean rooms and an excellent overall value.", "Date": "February 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "liverpool, england", "Title": "“Nice Hotel, Good Location”", "Author": "juejosh", "ReviewID": "UR13147244", "Content": "After reading some of the reviews, I was a bit aprehensive and thought I maybe should have booked another hotel, but we had a great stay! We arrived at about 11:45am so expected to be asked to check in later, but no, the rooms were ready for us and reception was very helpful ensuring that our party was roomed close to each other. Our room was more spacious than the others as we had an accessable room, but all were clean with a lovely bathroom and a wide selection of 'bit and pieces' including toothbrush/paste and razors, which are useful with todays security restrictions, and these were replaced daily. The linen was crisp and clean and the rooms were well tended - they were also very warm - too warm for my husband but great for me! The breakfast offered a huge choice of continental items plus hot buffet and if ordered at the time of booking you get a 50% discount which makes in extremely reasonable for what is on offer - including cava/bucks fizz if you wish it - I didnt but kept thinking about it! The pool area is small, and because of the marble/wood mix can get slippy at times, but that where the complimentry slippers are useful. The pool itself - well, yes it is small, but is beautifully lit with changing lights for a relaxing feel. There is a seperate room with jaccuzzi in - big enough for 4 comfortably, 6 makes it 'intimate'. We were lucky that on our first visit both pool and jaccuzzi were empty, which meant our group had exclusive use, on our second visit only a couple and there baby were swimming so we jaccuzzied then swapped, as did they. There is also a sauna and a small gym. So plenty to occupy if it is busy. The location of the hotel is good, being near Gracia area and placa Catalunya and also the bus stops. The hotel is also good for business users with not only free wi-fi throughout but it has 2 computers on the 1st floor with free internet access too. All in all an excellent stay and when we return to Barcelona (hopefully in the Summer) we will return to this hotel.", "Date": "January 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Perfect location”", "Author": "JACKKLAD", "ReviewID": "UR12027301", "Content": "Stayed for a 3 night break perfect location for this kind of thing and staff were really helpful with hotel and tourist matters. Stayed on the top floor (7) where i think the rooms are much bigger and better and a big balcony to match if you stay in the rear of the hotel (request this when booking if you can) All the usuals you would expect in the rooms and a bit more,tv,mini bar,bath robes,safe.....etc. Had breakfast just the last morning,a buffet breakfast with plenty of it and all you could want,bit expensive but worth it i suppose Brilliant pool,sauna,jacuzzi in the basement and suprised more people havent commented on it,the pictures on the website dont make it look as attractive as what it is......sitting in the jacuzzi after a hard days walking sight seeing......perfect!!,you can even hear the underground trains go by aswell!!", "Date": "December 29, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm", "Title": "“Beware of this hotel...”", "Author": "SophieStockholm", "ReviewID": "UR11055777", "Content": "Booked a double w breakfast at this hotel on the hotel web-page. In the morning the evening after arriving, went to hotel-restaurant where breakfast was served between 7.15-10.30. We arrived in the restaurant at 10.15.The waiter greeted us by looking irritated and looking at his watch. He then informed us after asking for our room-number that breakfast was not included in our rate. When we disagreed, the waiter very briskly told us we had to step up to the front desk to sort things out, with about 10 minutes left of breafkast. He followed us there and consulted another staff-member, who searched for a transcript of our Internet-reservation, without finding it. A third employee in a more senior position was then involved in the \"case\", and quickly found our transcript only to see that breakfast indeed was included. We then went back to the restaurant in order to have breakfastand given there were now only a few minutes left of it, since the time now was betwen 10.20 and 10.25, sat down right next to the buffet. A waiter, not the same as before, then came rushing up to our table and declared that we were not allowed to sit there. He pointed at the far end end of the restaurant, which incidentally was as far away as possible from the buffet. We then felt we had had enough and decided to go to our room and order breakfast . This was probably just before 10.30. What was sent to our room was two small pieces of bread- rolls and one cup of coffe and one cup of tea, butter and marmalade and some dry croissants, far in quality from the buffet served at the restaurant.The two glasses of orange juice on our tray seemed to have been diluted beyond recognition. We then called and asked for some more bread-rolls, some more orange juice for both of us, coffee and tea. We received a new tray with one glass of orange-juice and one coffee. I then called again to ask about the bread-rolls and the tea only to be told that the hotel now had to charge extra for this since it was now after 10.30. I tried to explain the situation, but the woman at the reception was very firm and refused to send us anything free of charge. When we booked the room the information on the hotel web-page stated that either breakfast.buffet or breakfast in the room was included. The breakfast served in your room would be a continental one, but I thought that even as a such the breakfast we got up to our room was a very poor one.The hotel then charged extra for the coffee and the one glass of juice(as promised) when we checked out. Other \"amenities\" at the hotel included a business corner with two computers, but it seemed they had never heard of the fact that mouses need to get cleaned every once in a while in order to work, because one mouse was so full of dirt that it was useless to click with. We stayed in two different rooms, and they both had such thin walls that we could hear our neighbour going to the bathroom, or throwing up, which we had the \"pleasure\"of doing during one night. When somebody flushed it sounded like the ceiling was coming down. The drains in the shower and the sink did not work very good,so after taking a shower the tub was flooded with dirty drainage-water.The water-pressure in the shower was very weak for a four-star hotel. I also found old dental floss on the floor in the bath-room. Our room was extremely hot, and when I called reception about it I was told that they did not have the air-condition on,only heating in the winter. I felt to fed up to then ask why there in that case was a thermostat in the room, and if I lowered it, should not the room then get cooler(I tried that but it did not work,I lovered it to only 10 degrees centigrade, but the room was still as hot as before). We did get to switch rooms because of the heating, and were then asked to bring our bath-robes along to the new room, and also at first to come down to the reception to get the new key, but instants later the reception called us again and told us that they were of course giong to send a porter up with the key and also to help us with the luggage. The hotel also uses a system, where you get four small bottles of water for free, and this is all you will find in the mini-bar when arriving. Everything else that you might want i.e juice,beer,wine,soda you have to order up to you room and pay for , not only pay for what you drink from the mini-bar. We decided we wanted to settle the bill the evening before leaving, since we were leaving early in the morning. When my fiance went down to pay the bill, the receptionist refused to assist him, stating that he could indeed do that in the morning instead. My fiance then really had to argue to get to settle the bill the night before leaving, saying that we wanted to pay now because we were leaving early and wanted to minimize the strees of this. So then after much discussion he did get to pay. The next morning, we went up to the reception to leave our keys and the words of farewell from the receptionist was not\"bye,hope you have enjoyed you stay\" or something of the like, but\"DID YOU PAY???\".", "Date": "November 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Austria - San Francisco, CA", "Title": "“Satisfactory But Not Worth The Rate...”", "Author": "SilverRRCloud", "ReviewID": "UR10917704", "Content": "We were quickly offered #602, spacious, comfortable with a decent view and low noise. Pros: Good location Professional and efficient staff Nicely sized room(s). Included WIFI Iron and board in the room Safe vault in the room Smart welcome kit Free bottled water Cons: Relatively very expensive €200.00 p. night Adequate but very basic breakfast Lack of maintenance: broken fixtures in the bathroom Lack of heating in mid-November!!! (The Front Desk said, they did not turn the heating on???) --- Would neither recommend nor book again myself. Far too expensive for the very mediocre service offered. SC", "Date": "November 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Good hotel, good location”", "Author": "Treabhar", "ReviewID": "UR10833456", "Content": "Stayed here for 3 nights last weekend. Rooms are spotless and spacious with fairly large batchrooms with bath, sink and shower. Water both still and sparkling is free in the minbar. We stayed on the 6th floor where we heard very little noise. There is also a safe in the room. On the basement floor there is a spa, jacuzzi, small gym and small pool. Availed of the pool and jacuzzi which was great after a day of sightseeing and shopping. Hotel staff were helpful and had good English. It had a small bar which we used only a couple of times - the drink is actually quite cheap there. Did not eat anything at the hotel over the weekend, there are plenty of cafes, restaurants and coffee shops around for something to eat. The hotel itself is only a 5 minute walk to placa catalyuna and the top of La Rambla, which is ideal. From the Placa Catalyuna you can get the tourist buses around the city. There are separate routes, blue green and red. Make sure when you are queing that you are gettting the route that you want from the map. These buses go continually so you can get off at your pleasure. Overall a great weekend in a great city. Would go back to this hotel again.", "Date": "November 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Reading", "Title": "“Check your valuables!”", "Author": "DaveReading", "ReviewID": "UR10798971", "Content": "A pleasant hotel in a good location, Stay spoiled by the theft of my wife's handbag which the management refused to take seriously. No compensation offered. Special trip for a birthday treat and the duty manager even failed to tell me that he could not get a reservation for our chosen location until 1 hour before we were leaving for the meal. Did not take breakfast there as there many better and less expensive cafes nearby. Hotel rooms were clean and showers were a delight after a long day walking the streets. Very useful and large book on Barcelona which we used to select restuarants. Interference on BBC World channel so don't expect to stay in touch with sport/news while there. Bar staff good fun and huge digestivo drinks for 5 euros.", "Date": "November 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent location, friendly staff, great value for your $$$”", "Author": "traveller0808", "ReviewID": "UR10091015", "Content": "I recently stayed in the hotel for 7 nights and I want to share my experience with you: Pros: -Convenient location – 25-35 minutes from the Airport (cost about 35-40 Euros), 2 minutes walk to the Passeig de Garcia and the Placa Catalunya Metro Station, 5-10 minute walk to Casa Batllo and 10-15 minute walk to Casa Mila, walking distance to the Gothic Quarter, Las Ramblas, Waterfront, Zara is just around the corner, and walking distance to the numerous great shops on Passeig de Gracia (Gucci, Zegna, Montblanc, LV, Bally, Cartier, Burberry, etc.) and the department store (El Cortes Ingles) in Placa Catalunya -The hotel is on a side street on Passeig de Gracia so it’s pretty quiet at night -Extremely friendly, courteous, and professional English speaking Front desk staff -Upon arrival, they give you maps (with key attractions circled), a card with the hotel address, phone number, and map on it so that you can simply show it to the taxi driver if needed, a tip sheet telling you to be cautious in certain areas at night and give you tips to avoid pickpockets. They offer to take a copy of your passport and stamp it with the hotel stamp. A lot of useful information on that tip sheet. Nice touch!!! -Simple and chic room décor -Safety deposit box and iron -You can set up morning call, view messages, and check bills on your TV -Nice hotel bar and restaurant (reasonably priced Dinner) -24 hour business centre with 2 computers -Free in room wireless Internet -Free water (2 sparkling and 1 regular bottle of water – restock every night) -Nice pool sauna, and Jacuzzi -A board range of bathroom amenities (razor, tooth brush, toothpaste, comb, shampoo, shower gel, soap, travel size packed tissue, shower cap, shoe shine, bathrobes, slippers, make up mirror, hair drier, sewing kit, etc.) Cons: -Late check-in time (my room is not ready until 3:45 p.m.) but you can safely store your luggage with them and visit the Gaudi houses on Passeig de Gracia -I got a room without a view (but who cares, I didn’t go the BCN to stay in the hotel room) -Small fitness centre (only 3 equipments) -No lockers or change room in the Spa/Jacuzzi/Fitness centre. So if I want to work out then swim, I have to go back to the room and change. Although I have to say it’s pretty safe leaving your clothes/sneakers/other belongings on the sofa while showering/changing (in the bathroom) -The lifts are a bit small and slow, but it’s not unusual in Europe for a hotel in an old building -They forgot to restock my mini bar the first night -Only 2 English channels (CNN and Eurosport) -Water pressure a little on the low side -Breakfast too expensive (if you don’t book in advance on their website) -No emergency exit information posted on the back of door -No environmental policy to advise guest to re-use towels (nowadays a lot of hotel post a notice in the bathroom to encourage guests to re-use towels)", "Date": "October 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "York, United Kingdom", "Title": "“Good Value, Great Location”", "Author": "The4wardz", "ReviewID": "UR10080707", "Content": "This is a nice hotel in a good location, not far from the Ramblas, in a slightly quiter area. I agree that the plumbing is rather noisy, but this did not bother us too much. Probably better on the higher floors, we were on the first fllor. The staff were very helpful apart from the mess up with the taxis. We wanted one 6 seater and we got 2 four seaters so we had to pay twice for the journey back to the airport. We should have used the bus as we did when we arrived. Ask for a room at the front. The views are nicer and all the windows are double glazed so no road noise. The rooms are also airconditioned.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Wonderful hotel and location”", "Author": "Wood76", "ReviewID": "UR8548398", "Content": "This was an excellent hotel, with very friendly and knowledgeable staff. It's in a wonderful location, a safe location, surrounded by shops, bars and restaurants and away from the usual tourist areas. It is a 15 min walk to the marina, 20 min to the beach and is just round the corner from some of Gaudi's masterpieces. There is a metro station 2 mins away from the hotel which takes you to most locations. The hotel itself is very modern and clean. The rooms are a little small but certainly aren't lacking in any facilities and we didn't have a problem with noise. The breakfast is excellent and the bar is extremely cheap in comparison to La Ramblas. I would highly recommend this hotel and will be certainly making a return.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great room, location, staff”", "Author": "Jannazg", "ReviewID": "UR8538582", "Content": "This hotel is a great place to stay in Barcelona. It is close to the main streets, Las Ramblas and Passeig de la Gracia, minus the craziness that comes with staying on Las Ramblas. The staff is friendly and the breakfast an excellent value if you book ahead of time. The rooms are spacious, but without views. I would recommend this hotel to anyone.", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Excellent hotel for a short stay”", "Author": "kaipbarrett", "ReviewID": "UR8379408", "Content": "Excellent hotel for a short stay, room was a bit on the small side ( road side ) BUT you dont go to Barca to stay in the room.......The beds are very hard but thats what i like.Excellent location ( 2 blocks to Passeig de gracia and Las Ramblas ).........Air con was spot on, after spending all day walking in temps of 36 + it was a pleasure to walk into a cold room FREE bottled water and FREE in room safe", "Date": "August 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Fantastic”", "Author": "BettyJScotland", "ReviewID": "UR8283995", "Content": "Central location. Clean modern rooms with good bathrooms and balcony. Twin rooms not vast - but ok. Great breakfast.", "Date": "August 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Cheap finishing - poor insulation”", "Author": "MarcLeuven_Belgium", "ReviewID": "UR8120787", "Content": "We stayed in this hotel from 27th December 2007 till 4th January 2008. We were given a spatious room at the front of the building overlooking the Gran Via. The rooms look great at first glance. At closer inspection you wil find that they are very cheaply finished. Sound insulation is below par especially between rooms. We were able to hear and understand the neighbours very clearly. The piping is done in such a bad way that every time a toilet is flushed or a bath tub emptied on one of the upper floors it generates an extremely loud roar which even wakes you up at night. The noise from the street side was acceptable. Our last night the poor plumbing finally gave way and the ceiling came down after the constantly battered piping had given way to yet another flushed toiled and emptied bath tub. We were appropriately moved to another room without further discussion. All in all : cheaply finished hotel, bad insulation, noisy, good location, over-priced. Maybe rather 3 than 4 star. Would not stay there again.", "Date": "July 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Florence, Texas", "Title": "“Bring your ear plugs”", "Author": "TetonCLT", "ReviewID": "UR8117056", "Content": "Nice room decor, clean, OK except for the noise!!! Our room # 307 was in the back area and just above an enclosed SCHOOL PLAYGROUND, which gave us no hope to sleep late. Additionally, this room had bizarre plumbing - every time the upstairs guest flushed or turned on the water, it would drian down through our pipes and toilet making very loud water running noises at any hour! The flooring also let us be aware of every step upstairs or in the hallway. Also the Housekeeping closet was next to the room, adding to the symphony of noise. When I asked to change rooms, I was informed there were none available.... This was by far the noisest hotel I have ever expereienced. The desk staff was polite upon arrival, those that knew English, but the wait staff in the bar and restaurant were chilly and very indifferent. Barcelona is a lovely city and we will choose to stay eleswhere on our next visit.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Excellent Hotel”", "Author": "klean", "ReviewID": "UR8032978", "Content": "One of the most excellent hotels I have ever stayed. Spacious room, very well equipped, polite staff, nice bar, close to Rambla.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Victoria", "Title": "“More Hard Beds”", "Author": "grant_lina", "ReviewID": "UR7998448", "Content": "After a long haul, we we're dying to get some rest late in the afternoon. Unfortunately our bed, as stated in previous postings, was \"rock hard\". We eventually asked for extra blankets and placed them between the matress and the sheet. This seemed to work OK. The next challenge was the noise emanating from the evening soccer/basketball games in the school grounds behind the hotel. As the hotel was fully booked, we couldn't change rooms. That said, the hotel is in a great location, the staff courteous and the other amenities such as the basement pool and spa were great after a day exploring this wonderful city. In my humble opinion, this hotel has the potential to be much better. Replace the matresses, install some double glazing and I'll be back!", "Date": "June 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great location, great price”", "Author": "YorkshireMinsterman", "ReviewID": "UR7938665", "Content": "Excellent all round hotel. Location 10 mins walk from Place Catalunya/Las Ramblas. 25 mins by Taxi (about €27 for 4 people +luggage) from the airport. 10 mins walk from Casa Mila, 5 mins from nearest Metro station which takes you everywhere! Well presented hotel, nice (if small) leisure facilties, but to find anywhere so central with a pool/sauna and jacuzzi is a bonus. Perfect after a hard days treck round the sights. Staff very friendly and helpful. Breakfast very reasonable if you book in advance (€8 per person per day) which we thought was good value and served up until 10.30am for us lazy types! Must also mention restaurant Le Quinze Nits in Place Reial. Very reasonable prices and very good food - worth the queue as it doesn;t open until 8.30 pm on an evening - worth getting there at 8.00pm ish and queuing.", "Date": "June 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york", "Title": "“nice hotel, price good”", "Author": "mrspaper", "ReviewID": "UR7854207", "Content": "we stayed at the Atrium Palace for 2 nights prior to a cruise. It was easy to get to from the airport bus. We decided to take a chance on the bus, since no passengers get on after it leaves the airport and you get off at the last stop. it is a 3 block uphill walk to the hotel from the bus, but not bad at all. It was worth the walk. The staff were very nice and gave us a bottle of champagne for our anniversary. We used the pool and jacuzzi and they were just what we needed while awaiting our room to get ready. the staff brought us down shampoo, etc. breakfast was adequate. Coffee was terrible. make sure you find the business center with the free internet, although one of the 2 computers did not work while we were there. The location of the hotel was great. good walking location to picasso museum, shopping, Las Ramblas, and food. Many ATM;s all over. We ate at a popular Tapas Bar on the same street as the hotel, just 3 blocks toward Las Ramblas. It was good, although not cheap by the time you finish ordering all your mini plates of food. We found this Tapas bar on the internet, highly recommended, and when we asked the hotel staff where to go, they recommended the same place. The beds were not extremely comfortable, but adequate. the room safe was a nice size. we had a view of the courtyard and the kids playing outside from the school, but they did not awaken us. the bathrooms are adorned with all the amenities you need, and got replaced even if they didn't need replacement. \"We did not even need to unpack our toothbrush, etc for the 2 days. We used the tourist bus to jump on and off, which worked out well. (other times we walked) It was fun to be a tourist. while they take you around, you can listen to headphones as they speak about what you see. We went to the aquarium as one of our destinations, and it was a nice one. Of course, don't miss all of Gaudi's buildings and parks. We could have used one more day to get in Montserrat. If you book on the hotel's website, they give you breakfast for 1/2 price, although you could probably do better eating a small breakfast on the street. I have no pics to add to the candid photos that haven't already been shown", "Date": "June 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Great location, bad beds”", "Author": "limxela", "ReviewID": "UR7703783", "Content": "Location: Great location in the center of the city, one block from Passaig de la Gracia. Staff: Friendly staff, pleased to serve you. Shaving kits, extra towels, anything else you need will be in your room immediately. Very clean and thorough room cleaning. Breakfast: Very decent breakfast with great expresso. Great service. Beds: Terrible beds - most (if not all) rooms have two double beds that slide apart on hardwood floor. To be close to my wife, I had to tie the beds together with towels. Very hard mattr essess. Only sheets for cover - no blankets. Pillows synthetic and hard.", "Date": "May 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“Very nice indeed !”", "Author": "Gordy2", "ReviewID": "UR7655822", "Content": "Booked this Hotel after reading reviews on Trip Advisor. We stayed for a night pre-cruise, and arrived about midday. Our room was ready and we were allowed into it right away. We managed to get a deal through Expedia which included buffet breakfast. Only disappointment was they served diluted orange juice and not the real stuff at breakfast. A Hotel of this class should be able to do better. The room was excellent, situated at the side of the hotel (No view whatsoever), but was very clean, modern, and quiet. The staff were excellent and very friendly. No qualms about staying here again.", "Date": "May 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mississauga", "Title": "“Excellent stay”", "Author": "GeoffL", "ReviewID": "UR7625102", "Content": "My wife and I stayed at the Atrium Palace for four nights in early May. As written, the location is indeed excellent for shopping, dining, acess to tours and walking to the Gothic quarter. When taking a cab back to the hotel, use the nearest intersection(Grand Via & passeg de Gracia), as some do not know of the hotel as it is small. Rooms ver clean and well appointed. Air conditioning works quite well. We did not try the restaurant, but the bar service was excellent. We were on the front, with the door closed, most street noise was eliminated. Staff very accomodating. Would definitely stay there again.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "DUBLIN", "Title": "“A Super hotel. Enjoy.”", "Author": "incaman", "ReviewID": "UR7570165", "Content": "This is an excellent hotel offering real value for money. The location is perfect - probably the best in Barcelona. Everything is within walking distance. The staff are very friendly and accomodating. There is a lovely pool and Spa area. Yes it is small but it always seems to be empty. The pool was lovely and warm and perfect for relaxing after a hard days sightseeing. My only criticism would be that the restaurant area is unimpressive to look at although I didnt use the facility so I cant comment on the quality of the food or service. Rooms wre very nice, clean, cable TV and quite large. They can be a bit noisey with a school playground right behind the hotel. Overall, this hotel is a gem and I would definitely be staying there again.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, England", "Title": "“Great Hotel from which to go sightseeing”", "Author": "Adelmo", "ReviewID": "UR7403352", "Content": "We have just returned from a 3 day break in Barcelona, staying at the modern Apsis Atrium Palace Hotel on the Gran Via. We could not fault the Hotel for location, cleanliness, friendly staff and good amenities. It was in an ideal place to either walk to the many tourists sights or catch the blue/red tourist buses that provide an armchair view of the city's attractions. We felt a 2 day bus pass for 23 euros was excellent value and a must if you wanted to see everything. Barcelona is such a vibrant and welcoming city and in our opinion much better than Madrid. There is so much to see and do that when we visit again we shall certainly be staying for much longer.", "Date": "April 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bournemouth,UK", "Title": "“Superb hotel in a great location!”", "Author": "topgeeza", "ReviewID": "UR7253228", "Content": "We stayed for 3 nights at the end of March and used the recommendations on this site as the basis for our choice. The hotel impresses immediately when walking into the grand lobby with it's sweeping stone staircase. The rooms are spacious in their tasteful contemporary design. Double beds are only available in the rooms at the rear of the hotel which overlooks an inner square of school playgrounds. If you like sleeping later than 8.30 in the morning, go for one of the twin bedded rooms at the front of the hotel, over looking Gran Via Les Corts Catalanes as a few hundred children playing can be noisy! ;-). I'd totally recommend this hotel to anyone who wants a quality hotel close to the city centre, near Metro lines and the attractions of Plaça de Catalunya, La Rambla and the Barri Gòtic district.", "Date": "March 30, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Good Vaule for Money..Great Location”", "Author": "LondonDoodle", "ReviewID": "UR7237394", "Content": "We stayed on the fifth floor at the front of the hotel (we requested a room at the front after having read some previous reviews). It worked out around £50 a night per person for that we got a very large twin room with a nice bathroom (bathrobes, slippers etc) and an additional sink area in the bedroom which was handy for friends sharing. Would definately go back to this hotel. Staff were friendly and helpful and the location of the hotel is a real bonus.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Waterford", "Title": "“Handy if you want peaceful”", "Author": "Roykeaneisgod", "ReviewID": "UR7227064", "Content": "This hotel is a very nice,clean and generally quiet. It is 5 mins walk from central square. Ensure you get a room that is not attached to the atrium or you will hear reception noise ( during day only). Lovely pub \"Bobby's Bar\" which is just around the corner and handy for the the last few after the main strip. We had one issue with a non flushing toilet but this was fixed immediately. Would rate higher but because of the atrium noise and the specific toilet have put at average.", "Date": "March 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“good location”", "Author": "kittiebiddy", "ReviewID": "UR7179529", "Content": "We got the bus from the airport to the plaza, only a 5 minute walk to the hotel, come off the bus,head for pas de gracia and turn right when you come to the water fountian, quite easy to find, the airport buses come every few minutes also and only cost 3.90. As you come out of the airport terminal the bus stop is 20 metres to your left. The hotel is in a great location for everything you want, very clean also and friendly staff, only complaints would be our view which was 4 plant pots and a wall, also you do hear everything from adjoining guestrooms, as we were hardly in our room it was'nt a major issue for us. There has been many complaints re beggars and thieves in barcelona, well we had no problems on that score, I've never seen so many police officers in a major city than I did in barca,even seen one hiding behind a tree ready to pounce on a unoffical street trader, (the tourists taking pictures of him gave the game away and the trader bolted). We only seen 2 beggars in the 3 days we were there. Disappointed with la rambla though, too many waiters pestering you for business, none of that on the pas de gracia which is 1 minute from the hotel. Though do watch out for the old man who likes to walk up that street wearing nothing but body paint and a pair of trainers...........sadly I saw him twice!!!!!! One last thing, we went in the middle of march and the weather was great, 20 degrees, great for strolling about town.", "Date": "March 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dordrecht, The Netherlands", "Title": "“Good value for money”", "Author": "TravelWen", "ReviewID": "UR7162396", "Content": "We have just come back from Barcelona on the 10th of March. Followed by the enthusiastic reviews of the tripadvisors we have booked a twin room for 3 nights by Apsis Atrium Palace. This is our second visit to Barcelona. Last time we stayed in the Gallery hotel and we intended to stay at the same hotel again. Since the room price of Gallery hotel is quite high at this moment, we were very happy to book the room at Apsis Atrium Palace. For the general “Traveler rating” I was doubting between 3 and 4. On one hand, I think in Spain general this is an average 4 star hotel, but on the other hand, this is a hotel in Barcelona, consider the excellent location, the very reasonable room price and the helpful personnel, I think Apsis Atrium Palace definitely deserves to have a rating of 4 (above average). Our preference was a twin room, for some misunderstanding firstly we were offered a room on the first floor which was a room with a double bed plus a single bed and had no view at all. Fortunately we could change to a room on the 5th floor. It was very well maintained and perfectly clean. It is very comfortable to have slippers and bathrobes in room. The bathroom amenities are indeed quite extensive. Only we didn’t see the body milk as mentioned in the website. If I knew, I would bring my own. The air conditioning was working very well. The first two nights were nice and quiet. The third night (Friday night) was noisier. But this happens frequently in Spanish hotels. The sound insulation is often an issue. Since last year we always bring the silicone ear plugs with us when traveling, which works perfect. As every traveler agreed, the location of Apsis Atrium Palace is just perfect. Most attractions are in walking distance and all the public transportation stops close by. We bought two T-10 cards which give us 20 times travel within 1 zone by all kind of public transportation (bus, metro etc.) which was very convenient. For example, bus 50 stops almost in front of the hotel and goes to La Sagrada Familia, Plaza d’Espanya and Poble Espanyol. Overall, we had a pleasant stay in Apsis Atrium Palace.", "Date": "March 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Durham, England", "Title": "“Central Location”", "Author": "love_2_travel666", "ReviewID": "UR7147640", "Content": "Went to Barcelona for first time for a few days early March. Found the hotel from searching on google for hotels in City Centre locations. This Hotel says it is a 4* and I believe it is. Exterior is traditional but they have ripped out the interior and made it into a boutique hotel, with lots of wooden floors and panels. The main stairs in reception are still authentic. The reception staff were very helpful and advice on where to eat and what to do was very welcome. The hotel had a special offer if booking for 3 days or more you could have a buffet breakfast for 1/2 price, which for us was €8 per person per day instead of €16. Well worth it, self service for everything from Tea/Coffee to full cooked breakfast. Plenty of choice of fresh fruits and the usual pastries etc. Our room was a good size. We were at the back of the hotel in a double bed, with a sitting/changing area. We overlooked the school which could be noisy at break times and early evening when playing football or basketball tournaments, however we went to Barcelona for the sights not just the hotel. The only draw back, there was no tea/coffee facilities in the room. Mini bar had a good choice at a reasonable cost, however still and sparkling water were free and replaced daily. Safe deposit box in room was also free. Bathroom suited us fine, with good size bathrobes and slippers, and everything you would need for a short break in the way of toiletries, including toothbrushes, and wet shave equipment. We used the hotel pool and jacuzzi everyday, although one day the jacuzzi was out of order as 'someone' had put in some soap!! You need to know in advance if you want to use the sauna so the reception staff can ensure it is hot enough. The hotel recommend on their website to use the aerobus from the airport. €3.90 which was a good choice, it picked up outside the arrivals hall, last stop out of 3 was at Paca Catalunya, 2 blocks from the hotel, the map the hotel provide was very accurate. Barcelona is definitely on our list to re-visit and I will be booking this hotel again.", "Date": "March 12, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "london", "Title": "“room with no view”", "Author": "picky1", "ReviewID": "UR6911047", "Content": "Previous reviews were generally accurate but I must say...... We stayed here for 4 nights from 28/2/2007 and have just returned home tonight. The rooms were clean and there was some decent bedding although the quilt smelt of aftershave which I found a bit too close to the previous occupant. We were given a room on the first floor. This may have been a family room as it had a bed settee. I was disappointed that we had a 'view 'of an air duct / conditioning pipe and a wall close opposite. Why do I always seem to get this so predictable? The hotel was very quiet and I cant believe there was nothing with a better view!! The pool is a very small plastic form type which for the hotel was disappointing as if you were going to build a pool you would build somthing better in your back garden. They missed an opportunity when building the hotel to do something much much better. The pictures on the net appear quite grand but it was not. The pool did have some atmospheric lighting and would change colour when this was switched on around day 3 but felt full with 5 adults and in the summer this would be an issue. When we first arrived the jaccuci was out of service which was disappointing but came into service after a day or so. The sauna was readily switched on when we asked for it to be but the sauna bucket was completely useless with holes in it and water literally flowed through the gaps and I got the floor swamped trying to introduce some water / steam. Breakfasts were okay with lots of fresh fruit. The kitchen appeared very clean and appeared to be subject to regular inspection by the management on a daily basis. The staff were nice and friendly. I would stay here again but if I had the choice would choose a hotel with a better pool and a room with a view. I have to say the biggest down side for me is the fact that the soundinsulation in the rooms was an issue. When someone flushed their toilet it sounded like the contents were rushing down the downpipe which sounded like it was in the wall near my bed. This was very very off putting. Also there was from time to time no doubt about the fact that someone was using their bathroom. I dont know if this had something to do with the fact that our room on the first floor was at the bottom of the hotel ( no pun intended) but avoid first floor if you find this off putting. You can hear the school kids which was not a problem but shame about the lack of a view of any kind. If you have kids try The Mafia restaurant on the walking route to the Ramblas. Nice and child friendly. Also Port Olympic was the best beach we found and there are nice restaurants. Take the tourist bus if you want to avoid a long walk. Everyone warns you about pick pockets in Barcelona. I have never seen so many people on the street ( i live in London) and there are many police about so you should be okay but dont put your bag down or I suspect you will lose it!!", "Date": "March 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wicklow, Ireland", "Title": "“Lovely Hotel - Great Location”", "Author": "tonybyrne81", "ReviewID": "UR6840705", "Content": "My girlfriend and I recently returned from a 3 night stay at the Atrium Palace and overall we enjoyed a pleasant say. The room was nice, quite spacious and clean. Bathrobes and slippers were supplied along with mini bar, extra pillows, iron and ironing board and in room safe. The TV had limited channels 3 of which were English language (BBC World, CNN & Eurosport). The mini bar was well stocked and included 2 free bottles of still and 2 free bottles of sparkling water in the room every day. We did have a few problems getting the in room safe to lock but the staff were very helpful with this and attended to it quickly. The bathroom was again spacious and clean lots of toiletries were supplied although the shampoo wasn’t great. The hotel pool was clean but quite small. Reception staff were great; they were very helpful and dealt with any questions to the best of their ability. The Hotel is in a great location - 5 mins walk to the top of La Rambla. A few things to note: There are a number of schools located directly behind the hotel. Kids start playing there at about eight in the morning and they create quite a bit on noise. So if you aren’t an early riser ask for a room at the front of the hotel. Cleaning staff start around the same time and again they create quite a bit of noise especially if your room is located beside a store room as ours was. I noticed a few comments on trip advisor about empty cans of coke etc. in the mini bar and we had the same experience. Also the mini bar is quite expensive (3.50euro for a can of coke). Overall though our stay was enjoyable and we would recommend the Atrium Palace to friends travelling to Barcelona in the future.", "Date": "February 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect location for stay in Barcelona”", "Author": "cgmail", "ReviewID": "UR6815513", "Content": "We stayed in the Atrium Palace for 3 nights in Feb 2007 and have to say it is a little gem in the centre of Barcelona. We took the train when we arrived at the airport - EUR2.50 per person one way and the train stops at the Passeig de Gracia metro station about 200 metres from the hotel. Check in was smooth and we were able to check in at 1pm when we arrived. In the room, there were lots of handy toiletries - toothbrush, razor, shampoo, shower gel, tissues, lavender hand wipes. We also got bathrobes and slippers in our hotel which you're instructed to wear down to the spa - spa is lovely, small pool, jacuzzi (which was not very hot!) and a sauna which was lovely. Towels were provided in the spa so no need to take any down with you. The rooms were great, extra pillows provided, in room safe, ironing board, limited tv channels but we didnt really watch it too much. Also view from our room was of the basement but we didnt mind, as we didnt spend all that much time in the room. A nice touch was the 2 free bottles of still and 2 free bottles of sparkling water in the room every day. Reception staff were great - we had forgotten to take a charger with us and they let us borrow one for our stay and also on one of our days there, it rained and they loaned us a large umbrella to take out with us for the day. It's so central though - on the Gran Via des Cort Catalanes, 5 mins brisk walk to Plaza Catalunya and a few mins further takes you to the top of Las ramblas. I will definitely be back to the Atrium Palace.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "galway", "Title": "“excellent but may have been a temporarily low price”", "Author": "learnerplates", "ReviewID": "UR6782144", "Content": "Excellent hotel,could not fault it, service was fantastic, very clean, bright and new, trendy too Location about 20mins walk from la ramblas. .but the price may have been an introductory, it may have increased since 3 yrs ago.", "Date": "February 12, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Great Value for money”", "Author": "bkchill", "ReviewID": "UR6781526", "Content": "I stayed there during a weekend. The hotel is nicely located very close to the metro and trainstation of the airport train and the city center. The room was very clean, spacious and although facing the street quiet. You get everything in the room you need, even slippers! The spa has a jaccuzi, a sauna and a pool you are happy to use after a long day of walking around. The breakfast was amazing: champaign, salmon, ham, fruits, eggs, just everything you wish. I will definitely come back once more to this beautiful place. And not to forget, staff was very polite!", "Date": "February 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calabasas, California", "Title": "“Perfect Location”", "Author": "rochelle.alexis", "ReviewID": "UR6745692", "Content": "We really enjoyed this hotel. The minor 'faults' did not ruin our stay in any way at all and we would definitely recommend this hotel to anyone staying in Barcelona. The rooms are a good size and comfortable. Minor 'issues' with the hotel would be the following... 1. our room (on the 3rd floor) overlooked a children's playground. It got loud around 8:30-9AM - depending on what you did the night before, that could be early!! 2. noise in general. We could hear everything in the hallway. Because of the hardwood floors, sometimes we heard, for example, a chair being dragged across the floor from the room above us. 3. Bathroom ammenities... The shampoo and body wash (I thought) were not up to a 4 star standard. Of course they did the trick, but they were not luxurious by any means. Also, there was no lotion! 4. the Whirlpool in the spa was broken while we were there. We did not eat breakfast in the hotel - it seemed a little pricey to us at 16 Euro per person. There are plenty of places to eat around the corner for much cheaper. None of those things disrupted our stay in any way. The location of the hotel makes getting anywhere in Barcelona extremely easy. The directions to the hotel from their website are perfect. The hotel staff was great. They made wonderful food recommendations and were helpful in other ways as well. As mentioned aboved, the room was a good size and comfortable. There was even an extra sink in the room which was convenient for getting ready! I would recommend this hotel to my best friend and my parents, it was the great!", "Date": "February 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "belgium", "Title": "“best value for money”", "Author": "bruno.bemelmans", "ReviewID": "UR6567322", "Content": "(Sorry for my English) We have been here two times and we find this the best value for the price you pay (130 euro in the centre of town, four stars)) - The staff is very friendly and polite - The room we stayed is was big enough for us, two adults and one child (10 years old) - Airco is ok. - Indeed not so many channels on the TV but that is not why you come to Barca. - Last years I booked two splendid communicating rooms for the two of us and our three daugthers. - The pool is indeed small but the water is lovely, the sauna perefct and the jacuzzi worked all the time. There is a change in color in the pool every minute. - The rooms are superbe clean and the girls who cleaned it were very friendly. - The breakfast is great with everything you need (even red wine and 'cava' if you want) - The nearest metro is a 200m walk - The Plaza Catalunya is about 400m. - Taxi from airport to hotel: 20 euro - Very impressive 'buffet' between 13 and 16h: 20 euro - Just one thing to complain: we heard the toilet flush of another room... We will return next year.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gulfport, Florida", "Title": "“Great value”", "Author": "ab0si", "ReviewID": "UR6564374", "Content": "The Atrium Palace is a rather new hotel four blocks from Placa de Catalunya. Easy transportation between the airport and that plaza is avalable by rail and bus (I sugest the bus, it is usually faster, more comfortable and you are less likely to have to fight off pickpockets). Taxi will be about 30 euro from the airport (a bit more on Sundays and in the evening). This is an excellent location with easy access to the metro, buses, the tourists \"circle\" buses. Of course, you can walk to many of Barcelona highlights eaisly from the hotel. Is the location \"ok?\" Well, the Ritz is 100 meters to the east. The reception staff was great. They kept trying to help me and seemed disappointed that I didn't need any special help. The room I was given is simply huge by European standards. Simple, modern decor and that great European rarity: reading lights over the bed bright enough to actually allow one to read in bed. Bedding was two full beds placed together. VERY hard beds (I consider this a good thing; you may not). The bathroom was fully equipped with tub/shower, vanity. toilet and bidet. A full range of \"stuff\" was provided (disposable razor, toothbrush, sewing kit, bathrobes, slippers, etc. et al. Big fluffy towels, lots of hot water and excellent water pressure. Breakfast was served (7:15 to 10:30) is served in the hotel's small bar/restaurant buffet style. A full range of fruit, breads, cereal, cheeses, meats, yogart and eggs are provided. The orange juice is not fresh squeezed. Free computer/internet available 24-hours/day in the business center as well as free wifi throughtout the hotel. There seems to be internet available through the TV and there was an RJ45 hook-up in the room. I didn't try either of these, but simply used WIfI. Small swimming pool, sauna, hot tub and a basic exercise room is open until 11:00 pm. One hint: They take privacy seriously. When you leave the room for the day, hang the \"Make up the room\" on the door. Summary: great room, excellent location, very helpful staff, good price. Hard to beat that.", "Date": "January 8, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Apsis Atrium Palace Barcelona - SUB STANDARD - DO NOT BOOK!”", "Author": "NorthernTraveller125", "ReviewID": "UR6548026", "Content": "We have just returned from the hotel today. 1. Pool is tiny and i mean tiny 2. Fitness suite - 3 machines 1 stepper and, and all in one and a cross trainer - poor quality. Water from air con leaking all over wood floor which makes it DANGEROUS 3. Rooms were not ready still at 4.30pm on day of arrival. 4. Half drunk can of coke in the fridge - shows they do not check the fridges in rooms very often. 5. Maids were hit and miss....some times they left towels, slippers etc other days they did not 6. The maids left their very dirty floor cloths on the desk 7. Jacuzzi Bath did not work for the whole of the stay - they new about it but failed to tell us - apparently it had been broken a while 8. Breakfast discounted if you book in advance - average breakfast. 9 We booked Restaurant for new years eve dinner in advance but when we sat down the Maitre D told us all that was not available - was easier to tell us what was available. In fact he directed us to a nice place around the corner. 10. The english TV channels had NO sound 11. Air conditioning is non existent - cooler to leave doors open and listen to traffic all night. 12. God forbid that you have any emergency issues as the whole hotel was run by receptionists / front office manager (Maria who was not there often either) - Mr Lara was on holiday in the south of spain and although they spoke with him he did not ask to speak to me to apologise of offer to help IMPORTANT Advice also: We booked 2 suites which were nice suites if tvs and jacuzzis worked (3000 euros) - our friends booked a private car through the hotel so that they could have a child seat for their new born baby - the car turned up without a car seat and charged them 85 euros for a 20 euro journey. No kettles in room if you need to boil water for babies We were offered 80 pound discount for all of the above problems - they ruined our holiday and offered us 80 pounds....! We were only offered an apology when we came to check out. This is a 1 star hotel that wants to be a 5 star hotel when it grows up - so far it is far from growing up and has to be the worst run hotel I have ever stayed in (And I have stayed in well over 100 different ones worldwide). Our friend (Who also stayed there) is a travel agent and is going to talk any prospective customers away from this hotel as this is the worst she has stayed in! My advice - DO NOT STAY THERE. Paul PS...I am still waiting for a response to my email.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Great hotel”", "Author": "ordtravel", "ReviewID": "UR6479789", "Content": "We stayed at the Apsis in early October. We had a very enjoyable stay. Our room was clean and roomy for my husband and I. We were on the 3rd floor so we didn't hear much noise from the school behind the hotel. It would have been lovely to stay in one of the terrance rooms. Also, we did not take part in the daily breakfast since we are happy with toast and coffee in the morning. We walked to all the sights in Barcelona from this hotel, Sagrada Familia, the Port, Barcelona Cathedral, Art Museum, ect. But, remember, as \"compact\" as this city is, it is still a lot of walking so bring comfortable shoes! The hotel staff is great with recommendations for restaurants. We dined at Fernandez one night which was great. Also, there's a great restaurant called Ba-ba-Reeba for tapas.", "Date": "December 21, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Absolutely loved the place”", "Author": "Lexusman", "ReviewID": "UR6448553", "Content": "I went back again one month after my last stay and it was even better than the last time which surprised me . The receptionist who checked us in ( David } was just so professional and polite. I / we will definitely be back again", "Date": "December 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "houston", "Title": "“Beware”", "Author": "bcarter456", "ReviewID": "UR6354031", "Content": "The Atrium Palace is a very nice hotel. It has a great location, has beautiful rooms, and a very helpful front desk staff. That being said, one has to be very careful in Barcelona, like a lot of European cities. Barcelona is a city of theives. Don't believe me? Walk the busy city streets and look at the women at the sidewalk cafes. Every single one has their purse on their lap, directly in front of them. The reason is simple. Purse snatching is rampant. Please protect yourself with a money belt and don't don't carry anything valuable in a purse. We didn't think it would happen to us. But my wife had her had firmly on her purse and it was snatched from her in front of a dozen people. To their credit, the local people were very sympathic and offered us tremendous compassion and help in our time of need. I don't mean to demean the city of Barcelona. It's a beautiful place and I would visit it again in a hot second. Back to the Atrium Palace. We went directly back to the hotel after the purse snatching an they were very helpful in getting our credit cards stopped and so on. But, the next morning, the mini-bar guy came into our room while we were sleeping and stole 100 euros from our room! I couldn't believe it. I went immediately to the front desk to report this, but it was his word against ours. First of all, I admit to being an idiot. One should never leave money out in plain view in a hotel room. My mistake, to trust the hotel staff. The lesson here is a) Barelona is beatufiul and a very worthy place to visit, and b) expect to be stolen from at the slightest opporunity.", "Date": "December 9, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Loved it - Excellent Hotel”", "Author": "Bristolblonde", "ReviewID": "UR6342753", "Content": "This hotel was fantastic I booked the hotel as a surprise trip for my partner and we had a wonderful time. The location of the hotel is perfect and the hotel itself is great with the little extra touches which make the stay at the hotel lovely. Staff were fantastic and I would definately stay at this hotel again when returning to Barcelona.", "Date": "December 7, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Not great in Barcelona and Spain standard”", "Author": "dimsum", "ReviewID": "UR6167827", "Content": "If this hotel was in other cities, I might find it very impressive as it was housed in an old building. But after a journey of more than 14 days through out Spain, I found this hotel deserved the grade 'average' only. Location The location was good but not superb. It was relatively close to a metro but not very close. We still had to walk more than five minutes to the metro. Five minutes in Spain autum sun was already very long and even worse when we finished shopping. Room We booked a suite at this hotel as a treat as it was the final leg before our transit back to Madrid. It proved to be a waste of money. If you decided to stay at this hotel, my advice is go for the cheapest room category. Save your money for other purposes or stay at a better hotel. Service No warm welcome or sincere goodbye was offered. No smiling face at the reception. Don't expect five star or small family run hotel service. Facilities The internet service was alright. The indoor pool was the only merit of the hotel.", "Date": "November 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northern Ireland", "Title": "“Friendly staff, good hotel, great location, wonderful city”", "Author": "D&MGR", "ReviewID": "UR6127359", "Content": "We stayed at the Atrium Palace over Hallowe'en and really enjoyed our stay. On the whole a very good experience, a few small downsides: worth a score of 4½ but I'll plump for a 5 as we can't give half points. Positives - great staff , very friendly and helpful eg checked up bus routes and timetables for us. Check in was quick and room was clean and well appointed. Free water from the minibar a bonus. Air conditioning worked well if perhaps a little too enthusiastically at times. Previous reviewers have been mixed about the breakfast - we found it fine, good selection of fruits, breads, meats and cheeses along with cereal. There was a cooked breakfast but we didn't try it so can't comment. Not sure it is worth €16 though - we booked it though the website for half price and at €8 it was more than adequate. We were late back to the hotel one night after a trip down the coast and decided to eat in the hotel - we don't normally do this but I was surprised - good food and very reasonable (including the wine). Location is also quite good - on Barcelona’s main street (we had a room at the back so can’t say if rooms at the front are noisy), 5-10 mins from the Ramblas and convenient for metro/buses. Slight downsides - there was some noise from the schoolyard which others have mentioned (and not just in the morning, but used for 5-a-side football one evening). Wasn't too bad though. Swimming pool is rather small but still at least there is one. Rooms are good and a reasonable size for a city centre hotel - but some of the space was wasted (why two sinks - one in the room itself as well as one in the bathroom when the space could have been used for a second easychair?); and there is no lounge area to speak of in the hotel. But these are minor gripes. On the whole a very positive experience. Oh , and Barcelona is wonderful by the way.", "Date": "November 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ft. Lauderdale, Florida", "Title": "“Not perfect but had a great time”", "Author": "Nontall", "ReviewID": "UR6027331", "Content": "Date: Oct 13, 2006 Reviewer: MSponder, Ft. Lauderdale, Florida My husband and I stayed at the Atrium Palace the night before and the night after our Mediterranean cruise. Hotel staff is wonderful- very accommodating, friendly and helpful in giving directions, recommending restaurants etc. The hotel is in an excellent location and the free internet service is a welcome bonus. While the rooms are clean (and come equipped with a safe) and the bathrooms are spotless, the beds are a little too hard for my liking. I probably would not choose this hotel if my stay were to extend beyond a couple of days because of this. Also make sure you ask for a non-smoking room if that is your preference as we had a smoking room our second night since we did not specify and the hotel was booked so we had no option to get another room. We had to blast the air conditioner and open the windows for a few hours to try to get rid of the smell. The elevators are teeny tiny (4 adults at a time) so if there is a crowd waiting, it could take a while to get to your room unless you choose the stairs. If I ever return to Barcelona I would probably try another hotel just to compare value. Not sure if it was worth US$220 per night but we still had a great vacation!", "Date": "October 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Perfect...”", "Author": "Mojie", "ReviewID": "UR5922347", "Content": "Had a great 3 day stay in Sept 2006. Hotel is small, quiet and modern. Location is convenient, near both Ramblas and Aixample areas, subway stops, and hop on and off tour buses. Staff was very friendly and offered good advise. Room size is fine (for Europe) and quite modern. Book breakfast, if possible -- the buffet spread (again, for Europe) is great!", "Date": "October 6, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NJ", "Title": "“It's OK”", "Author": "katarob", "ReviewID": "UR5785365", "Content": "My son and I stayed at this hotel in July 2006 for 2 nights. The rooms are much smaller that what they look like in the website. The bathroom is very modern and nice. The beds are HARD , but we slept ok as we were so tired both days. The staff at reception is very nice and location is good. However, don't know if I would stay there again. For a couple of nights it was OK, but for longer time, the rooms would feel too tight. The staff at the breakfast room is surly. I wouldn't recommend it. The 2nd day we went to a cafe around the corner and had great breakfast for half the price ( eventhough we had paid \"only\" 8 euros for breakfast at the hotel the 1st day).", "Date": "September 9, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Nice Hotel”", "Author": "Helenlc0", "ReviewID": "UR5722081", "Content": "We stayed at the Atrium Place in May & had a fab time. Check in was speedy, room was fine - nice & clean. We had a standard double which was plenty big enough for us. The only gripe I had was the noise from the school (our room was at the back of the hotel). It wasn't a huge problem as we were out and about most of the time... (Just those early mornings!). The room was cleaned/tidied daily, with fresh towels left if you wanted them. The hotel staff were brilliant - couldn't do enough for us, especially reception. We arrived around 9.30pm (a little later than expected) so the lady on reception offered to book us a table at a nearby restaurant while we got changed etc - Superb. Facilities in the hotel were fine, everything we expected. The swimming pool is a little on the small side - but it was ok for us. The sauna was great especially after a hard day's sightseeing. We didn't actually eat in the hotel so can't really comment on the food side of things. All the public spaces/seating areas were were always clean never noticed anything out of place. Location is good - hotel is very central, close to all the shops. It's fairly easy to find from the airport - as we discovered... We decided to get on the bus (it's a lot cheaper than getting in taxi). Overall, a good quality hotel - would definitely recommend.", "Date": "August 29, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tel Aviv", "Title": "“Big Disappointment”", "Author": "Eyal", "ReviewID": "UR5712570", "Content": "We reserved the hotel 4 months ago for our vacation in Barcelona (family of 2 adults one teen and one child, thus we needed two connected rooms) based on the great reviews we read in the Tripadvisor. We checked in around 12 and were asked to come back around 3 PM. Already when we entered the lobby we were getting the impression that something is not working as it should, the rug was stained, there were crumbs in the elevator and the impression was not very good. When we came back we were offered rooms 610 and 611 in the 6th floor, but when we entered the rooms a very strong smell of smoke hit us combined with dirt on the floor dust on the furniture and hair on the blankets, immediately we asked for cleaner and no smoking rooms, although the hotel was full the receptionist was very kind and moved us after an hour we had to wait to 2 not connected rooms in the 3rd floor (the rooms were much cleaner and smelled from massive use of air freshener so we assumed they re-cleaned them) apologizing and promising that on the following day we will have the non smoking connected rooms. This was sufficient and as promised we were moved on the next day to two connected rooms in the same (3rd) floor. Still I must also add that on the second day when we went to the SPA in the evening (very very small and cold) we noticed and killed cockroach in the swimming pool and I am sure you can still find it under the wooden floor near the oval window To summarize the four nights we stayed there I will say that - The staff is supporting the location is good and the deal for the breakfast is very nice. BUT we can not ignore the poor maintenance level (why they do not clean the elevators more often? Why there are all these black signs that the luggage left on all the walls inside and outside the rooms? Why they do not clean the mini-bars from leftovers of other guests and dirt?). The potential exist but the high expectations could not fulfill.", "Date": "August 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Norwich, England", "Title": "“Honeymoon bliss”", "Author": "monkeymatt", "ReviewID": "UR5606786", "Content": "We stayed at his hotel on our honeymoon, based on cost and location and its 4 star rating - and on the whole, it was a good stay. The place was clean and well maintained, any faults that occurred (in our case the lifts and jacuzzi were, on separate occasions out of order) were swiftly rectified. The restaurant served a good breakfast, although I'm glad we booked for bed & breakfast, I feel the cost of 16Euros per day per person was a little excessive. We chose not to eat in the restaurant beyond breakfast, as it was a little too clinical, almost like a canteen, rather an atmospheric dining experience. The room we had was lovely, air conditioned, cleaned daily and stylishly decorated, containing a double bed (at my request) which was firm and comfortable. Our only minor niggles were, (i) the view from our room - they knew it was our honeymoon, yet we looked out on air conditioning ventilation ducts and the back end of another building, and (ii) they offered no exchange service - meaning one evening when I approached to cash some travellers cheques, they wouldn't, subsequently leaving us short of money for the evening. However, neither of these affected our overall enjoyment. I would recommend this place, for many reasons, maybe not quite value for money, but certainly for location, cleanliness and design.", "Date": "August 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TEL-AVIV ISRAEL", "Title": "“Perfect”", "Author": "OBERMAN", "ReviewID": "UR5514695", "Content": "We have just returned from 6 nights at the Apsis Atrium Palace. Perfect Location, Perfect Hotel, beautifull rooms, we stayed at the front hotel rooms, no noise from the gran via street. Very good breakfast for the value- book in advance from the hotel website so it is only half price -8 euros. The staff is very nice and the free 4 bottles of water per day are a bonus very wellcome - barcelona is hot.", "Date": "July 27, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Buckinghamshire", "Title": "“Perfect Location”", "Author": "Traveller19617", "ReviewID": "UR5431933", "Content": "We stayed at the Apsis Atrium Palace at the end of June 2006. The hotel is in prime location, ten minutes walk from the Ramblas, the same again from the Gothic quarter and 100 metres from the metro. The room was modern and functional with all that you would expect from a four star hotel. A nice touch was the free still and fizzy water from the minibar. We asked for a quiet room and were allocated a room that looked out on to a school playground. Despite contrary views in other reports there was little noticeable noise. The weather was very hot so we were pleased that the air conditioning worked well. I tried the sauna, spa and pool; all were excellent although the pool is more of a plunge pool than a swimming pool! The staff were friendly and very helpful. The only food we had in the hotel was breakfast which was excellent although we found it was better earlier rather than later. If you book directly with the hotel you can pre-book the breakfast half price (8 Euros) which we thought was good value. The only issue we had was that we found the lifts to be hot and steamy. We loved Barcelona and would recommend this hotel to all.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ellicott CIty, Maryland", "Title": "“Liked the Hotel and Staff, Disliked the Beds”", "Author": "A TripAdvisor Member", "ReviewID": "UR5425192", "Content": "We stayed 1 day prior to and 2 days after a cruise at this hotel. Had a room in back the first night and a room in front the next 2 nights. The Hotel is great, the staff was excellent and very helpful. The hotel is located within a few blocks of La Rambla. Just an execllent location for visiting Barcelona. The air conditioning worked too well at times. The room in back was on the 6th floor and we noticed no noise at all from the playground but we did keep the windows closed. The room in front was on the 5th floor and was again quiet due to keeping the windows closed. I enjoyed the free internet service. The only thing I did not like were the beds. They were like sleeping on a concrete floor with a thick piece of cardboard between you and the concrete. Word of warning to Barcelona visitors. It was told to me by the hotel and I did not listen closely enough. Watch out for the pick pockets in the subway. They ruined a great vacation for us by stealing my digital camera right off my belt. Lost 1/2 of my cruise pictures as well as the camera. The police told me they are after cameras and cell phones as well as wallets. So be very careful and hold onto everything in crowded areas.", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“great location, very modern”", "Author": "sammc", "ReviewID": "UR5376197", "Content": "A large group of us stayed here to attend a family wedding and we found it to be of a very good standard. lacks a bit of personaility, but the location is great, especially for shoppers!!! The service was good, rooms small but spotless and very modern. It was a a bit annoying to be telephoned by reception at 12 on the dot on our final day to make sure we were getting out on time .... But overall, I would definitely return to this hotel for a city break.", "Date": "June 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“Atrium Palace was perfect!”", "Author": "FunandSun2", "ReviewID": "UR5358358", "Content": "We stayed at the Atrium Palace for 2 nights preceeding a cruise and really enjoyed the location and atmosphere of the hotel. The rooms were very clean and a little larger than average considering european standards. The bar was great for having a few drinks before heading out for an evening dinner. Would not recommend the breakfast though as 40 euro was steep for what you received. Our room was on the street side of the hotel and there were no noise problems at all. The view from the small balcony was lovely.", "Date": "June 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very clean and modern. Great experience”", "Author": "snshn3", "ReviewID": "UR5315619", "Content": "My review comes in a little late, but I still would like to give in my input. We stayed at this hotel last June and had a great time. The hotel is in a great location, it is very modern and clean. The staff offers excellent service as well. The only thing is that we had a room overlooking a school yard. Luckily we weren't in our room much during the day when the kids were playing outside and became quite noisy. Aside from this, our experience was great. I **LOVED** the free internet they provide; it was nice to keep in touch with family and friends.", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bristol", "Title": "“Second visit to this hotel - will definatly be making a third.....”", "Author": "MaryMacBristol", "ReviewID": "UR5183581", "Content": "My boyfriend and I are repeat customers for this hotel as stayed here a couple of years ago too. Hotel Amenities - Minimalistic Comtemporary Cool. Very clean rooms equiped with sat TV, iron & board, air con, full length mirror, firm but comfy beds, spacious bathroom with power shower. Bathrobe & slippers provided too. Safe in room. Pool is very small however satisfies for a quick dip. Nice jacuzzi & sauna. Fitness room is pretty poorly equiped so better to go out for a run to the beach! We have stayed in rooms at both the back & front of the hotel & I have never found the noise an issue like previous reviewers have (& I generally need to sleep with earplugs as it has to be silent for me!). Naturally, there is some noise at the back of the hotel as there is a primary school playground out the back however the little'uns are only out there playing during the week after 9am anyway so don't see what the issue is with that!? Location - very central & ideally located for sightseeing & shopping - no need for taxis in evenings, etc as within walking distance to cool bars/restaurants. Located just off Passeig Gracia up from Placa Catalunya. Las Ramblas is a 10 min stroll down the road. Eating/Drinking - excellent Tapas Bar nearby is Txapela - this is located on Gracia. Always bustling full of locals. Good pizza @ Veronica's. Anima off C/Carme serves excellent med/asian fusion type food. There are also a number of funky bars around Carme as well as more restaurants. Best bar for Mojitos has to be all time favourite 'Boadas Cocktails' situated just on the corner of the first right hand turn off Las Ramblas- it is very smoky inside but worth it for the experience! Shopping - There's a massive Zara on the corner of Gracia/Cortes Catalanes. Most of the big name desingers can be found further up Gracia (Loewe, Gucci, Chanel, LV, Stella Macartney, etc) Would recommend exploring maze of streets to the left of the Ramblas around the Gothic quarter & near Cathedral as there are some funky little boutiques to be found. Didn't actually eat in hotel as don't see the point when there's so many places to eat out for breakfast, lunch & dinner.. Barcelona is a placed to be explored rather than sitting in your hotel! We did however have a few drinks at the bar after days shopping/before heading out & the service was always excellent & served with a genuine smile.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very satisfied... this hotel is a a very good value.”", "Author": "Sarasota34235", "ReviewID": "UR5182260", "Content": "We were lucky to be guests at the Atrium Palace May 7th through the 11th. Based on a previous review, we requested a \"06\" room on the front of the hotel and we were lucky enough to be in Room 606, a beautiful, large, twin-bedded room overlooking the Gran Via with glass doors that open to reveal the city. With the windows closed, the room was soundproof. Unlike previous reviewers, I never had any noise issues at this hotel. No noise from the beautiful wooden floors and no unwanted noise from the Gran Via. The room was extremely comfortable, well furnished and the air conditioning worked extremenly well. The bathroom was magnificent - modern with beuatiful finishes, Grohe fixtures, a bidet and a separate second sink area as a seaparate part of the main room. The staff was consistently accomodating. I have to offer extreme thanks to Maria at the front desk. She was always extremely helpful, had the information we needed, offered great recommendations of things to do and greeted us with a smile and hello or welcome back. She is very special. We did partake of the breakfast buffet (at the pre-booked 25% discount). It was 12 Euros after the discount. We found it terrific and the restaurant staff worked extremely hard to satisfy the many guests. In summary, I would not hesitate to recommend the Apssis Atrium Palace or stay there again. If you have any questions, please feel free to contact me.", "Date": "May 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Nice Hotel but extremly noisy at back”", "Author": "A TripAdvisor Member", "ReviewID": "UR4595796", "Content": "I am just back from spending 5 days at this hotel and have mixed feelings about it. When we arrived on the Monday, we got a room at the back of the hotel and was very impressed with it, clean, spacious but very hot. The thermostat was at 35! Turned this down and turned on what I thought was the air con but room didnt cool. Opened big windows and didnt think anything of it. NEver heard a whisper the entire day but from 7.30 am the next morning, there was a constant racket from the school at the back until 9.30 pm for the rest of the week. Complained to the desk about the air con not working and was told that it doesnt work in the winter! This was Feb/March and it was 17% C in Barca.. They said to open the windows and I explained that I couldnt because of the noise and was told they would look into it but never heard anything more.. Apart from that, the hotel was lovely, free juice/water and toiletries as advertised and was also given a free bottle of Cava as they found out it was my g/f birtday while we were there (which was a nice touch). Spa/pool very small, deceptivley so compared to pics on website. Perfect location though. Do not pay for breakfast as the hotel charges €16 pp..and you can get brekkie for nothing close by. Overall, would maybe stay here again but only for the location and only if I was promised a quiet room and one with working Air Con...", "Date": "March 9, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "NYC", "Title": "“Centrally located, loved this hotel.”", "Author": "citygal8", "ReviewID": "UR4580770", "Content": "We ( a family of 4) had a wonderful stay at the Apsis Atrium Palace(Barcelona, Spain) in Late Feb. We had 2 rooms on the front of the hotel overlooking the beautiful Boulevard. We booked our room through the hotel's own web site and got the best rates. We booked early and received a discount for staying over 3 nights. By booking thru the hotel yourself, there are no booking fees and you can cancel up to two days before with no penalty. Also, you don't pay anything until you check out. This 4 star hotel was no more expensive than many of the 3 stars I looked at. As per previous posts, the room is a little warm, but when we opened the Balcony doors, we cooled off the room and it was great. The staff was marvelous and attentive. They offered help with directions, luggage, etc. There are 2 (easy to use)computers with free internet access in the second floor business center. There was free water/juice in the mini bar as advertised. Also, there were lots of free toiletries in the room including a toothbrush/paste, razor, and all the usuals, etc. (nice touch) The hotel is clean. This hotel is very centrally located to all Barcelona attractions in a safe area. It's just two blocks to Placa Catalunya (transportation hub)and a few blocks to El Corte Ingles dept store.(has full supermarket in basement)There is also a citibank 2 blocks away.Las Ramblas was a 5 min walk. The hotel is near many of the Gaudi sites. We took the hop on/hop off bus which was a great way to get acclimated to Barcelona and hopped off at the sites that were harder to get to. We didn't have the hotel breakfast, it was pricey, but found lots of inexpensive cafes nearby to eat in. We found a superb restaurant that just opened next door to the hotel \"Patagonia Beef and Wine\" It's an argentinian steak house. The service was as great as the food and freshly made sangria. We ate there 2 out of our 5 nights. It was that good. All in all, Apsis Atrium Hotel is a centrally located, safe, clean hotel with lots of extras. I highly recommend it and will stay there again when I return to Barcelona.", "Date": "March 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Good Hotel, Great Location”", "Author": "pwee", "ReviewID": "UR4521024", "Content": "The Atrium Palace is located on the Grand via de les cort catalanes which is an excellent location for a short city break. You are no more than a few minutes walk to the Las Ramblas, the Passeig de Gracia and the Place de Cataluyna. The Hotel itself is very tidy, the standard rooms are very clean (no tea & coffee) and the staff very good. The Spa area is small. I'm not sure if I would class this hotel as a 4 star, however, it is worth it for the location alone.(Tip - the hotel backs onto a school, if you like to sleep in late, ask for a front facing room. It can get a little noisy with the young kids impersonating Ronaldinho)", "Date": "February 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "ireland", "Title": "“Watch out for thin walls”", "Author": "petermay123", "ReviewID": "UR4410784", "Content": "Have to agree with previous review about the noise from courtyard, room temperature and the thin walls (I must have stayed in a room close to this person on the same weekend as we experienced exactly the same \"noises\" coming from a nearby room). Location excellent, good quality rooms/services, very clean and staff extremely friendly. Would definitely stay there again.", "Date": "February 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "glasgow scotland", "Title": "“great location”", "Author": "mpar44", "ReviewID": "UR4360020", "Content": "The hotel was in a great location, spotlessly clean and everything was as new. The free water from the room bar was a bonus as was the free use of the safe in your room. This hotel was great value for money for a 4 star hotel. I have only two complaints about my stay in the hotel, firstly i didnt recieve the free bottle of cava i requested when booking (no big deal as it only costs £2-£3 for a bottle) and the hotel was slightly too warm. overall it is a 1st class hotel in a good location and i would stay again.", "Date": "January 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great hotel”", "Author": "Joe811", "ReviewID": "UR4347663", "Content": "This hotel is great for many reasons. The staff is very friendly, it's in a great location only two blocks from the square, and the hotel is maintained very well. The only negative is if you need accomodations for a third person..... in the states it's called the couch. I'll definitely stay there again as long as my travel party is two people or less.", "Date": "January 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Palo Alto, California", "Title": "“Very happy weekend at the Apsis Atrium Palace”", "Author": "Shamfeen", "ReviewID": "UR4310798", "Content": "We spent a 3 night weekend in Barcelona staying at the Apsis Atrium Palace on the Gran Via. We have stayed at the Hilton, Grand Hyatts and Marriot hotels in San Francisco numerous times so we know a fine hotel when we see it. This hotel was very nicely finished, the staff very professional and helpful. The room was a good size with everything you would find in a large US hotel including free wireless internet access. The hotel also has a small swimming pool, hot tub, sauna and gym. The location is excellent - we walked pretty much everywhere from the hotel: the hi-end retail stores are nearest, gaudi's house of bones, la ramblas, the old city etc. We will stay here on our next trip.", "Date": "December 29, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "West Sussex", "Title": "“Excellent Hotel”", "Author": "dijon1", "ReviewID": "UR4146187", "Content": "We have recently returned from a 4 night stay in Barcelona. We booked the Atrium Palace based on the reviews we read on Tripadvisor, we always check on here before we book anything! As soon as we arrived we knew we'd made the right choice. The hotel lobby is lovely and the reception staff made you feel instantly welcome. Our room was at the back of the hotel and overlooked the school playground. We did get a bit of noise but certainly not enough to be a nuisance, and to be honest you're not in the room much. It was small but very nice, and clean. The juice and water in the mini bar were free and re-stocked every day. Some of the reviews have said that they experienced noise from the other rooms, we didn't have any problems at all. The pool and sauna were lovely. We came home from a long day of walking and the pool was just what we needed. It is small but very nice. The restaurant is excellent, with great food. We had the buffett lunch a couple of times it was a fixed price, possibly more expensive than you'd pay elsewhere but the food was very good. Some of the reviews have commented that the breakfast is expensive, but you get such a huge choice and you can help yourself to as much as you want. We thought it was worth the money. The location of the hotel couldn't be better, you are near enough to everything to walk rather than taking the Metro and missing so much. I would definitely recommend this hotel to anybody who wants to stay in a nice hotel with friendly staff, with a first class location. Don't look any further than the Atrium Palace!!", "Date": "November 27, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "scotland", "Title": "“highly recommended!!”", "Author": "mujipor", "ReviewID": "UR4127621", "Content": "I just got back from a 3 day trip, i chose this hotel due to the reviews and was recommended by a friend who also stayed there. I found the location excellent! very central and very near to the metro station placia de gria. Also a ten minute walk to la ramblas. The hotel is beautiful, one of the best i have stayed in so far, they have a free internet access room with also a mini library. There is a spa but i never went to see it. I never had breakfast at the hotel but i did have dinner via room service one night! it was excellent food and not too expensive either. There is a wireless keyboard for you to access the internet via the tv (with charge of course) and satellite tv (blockbuster movies) also a charge. I bought the special package for around 24 hours and i received all channels plus music plus internet for around 35 euros, not bad i reckon. There is free juice and water and also i did receive the free slippers (bathrobe and slippers were provided for the spa to use, you could take away the slippers but if youw anted the bathrobe you would need to pay for it) Reception staff were helpful and polite. When we checked in they gave us maps and brochures for the city. There is a lounge area where you can just sit and relax and admire the artwork or there is a flat screen tv for you to watch. Overall i loved this hotel! oh, there was also a digital safe, an iron board, hairdryer and mini bar in room. I stayed for three nights and the room was 99 euros for a double. I highly recommend this hotel, i would stay there again definitely! The only thing i have to say badly of this place is i didnt have a good view (it was just facing another building) however we did have large windows we could open, i found barcelona rather warm this time of year 18c and compared to scotland which is currently 4c it was warm! the hotel was very warm too, we had to have the ac on as well as opening the large windows! and another thing is, sometimes other guests are too noisy, it sounds like they have no respect for other guests since they SLAM the doors!! I had a great time in barcelona and being at this hotel made my stay even more comfortable and relaxed", "Date": "November 19, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "England", "Title": "“Its OK”", "Author": "Englanderin", "ReviewID": "UR4112553", "Content": "The Apsis Atrium Palace is very central and close to many key sights - its possible to take the train from the airport (2.3 euros) and walk from Playa Catlunya (10 minutes walk) to this hotel. The hotel is comfortable. (My room had no view - it just looked out on the central core of the building).The hotel provides free water and juice in rooms - an iron is a bonus. There is also a free safe - a necessity in this city. The hotel's website claims slippers and bodymilk are available - this is not so. The hotel has limited communal areas. Three sofas and an area that serves as a combined bar/restaurant and breakfast room. The indoor 'pool' is too small to swim in. Breakfast is good - the fresh fruit excellent - but the bread frozen rolls reheated. For a little more money - its probably possible to get a five star hotel.", "Date": "November 15, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Greystones, Ireland", "Title": "“recommend the Atrium Palace”", "Author": "A TripAdvisor Member", "ReviewID": "UR4093954", "Content": "We have just returned from a 4 day city break to Barcelona (1st - 5th Nov 2005). We were delighted with the hotel and the city. We had a lovely bedroom & bathroom. No complaints. Rooms were spotless & cleaned every day. There was a safe in the room - very handy. Staff were always courteous and most helpful. On our first night we ate in the hotel for convenience. The food was excellent, while not cheap. It lacked atmosphere, because it was a bit quiet. Because we were celebrating an anniversary - a bottle of bubbly was left in our room. (We did have to show a marriage cert). There is a small swimming pool & gym which we didn't use. But the jacuzzi & particularly the sauna were wonderful after a days sightseeing. Bathrobes & pool slippers are freely available & made the trips to the sauna easy & comfortable. The hotel is very well located for anything that you might want to do or see in Barcelona. It has a small library, with several PC's for free internet access.", "Date": "November 8, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Hotel in a Great Location”", "Author": "Shoechick", "ReviewID": "UR4073200", "Content": "We loved this hotel! We stayed two nights pre-cruise and it was great. Our only complaint was the bed is a little hard. Bathrooms are nice and big, free internet access, free juice and waters in the room and the breakfast deal is great if you book it on line. Highly recommended.", "Date": "October 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "northern ireland", "Title": "“wonderful”", "Author": "brianmcstea", "ReviewID": "UR4033334", "Content": "Wonderful modern hotel, spotless luxury rooms, in central location would stay here again, lovely.", "Date": "October 18, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "new york", "Title": "“great hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3984008", "Content": "stayed at this hotels for 3 nights. great location. can walk to some attractions. nice breakfast. free internet service. would definitely stay again!", "Date": "October 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great value and location”", "Author": "OxoLondon", "ReviewID": "UR3908517", "Content": "I would agree with what the other reviews have said a about this hotel. Great location for shopping, the Ramblas and the old town. Close to Metro stop. Room was very modern and clean, stayed on the top floor at the back of the hotel - which was very quiet. The staff were really helpful and friendly. We had breakfast at the hotel which was fine. The area has loads of good restaurants and tapas bars. I would definitely stay at the hotel again and recommend it to others.", "Date": "September 16, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Great Hotel in the Centre of Barcalona”", "Author": "A TripAdvisor Member", "ReviewID": "UR3880352", "Content": "The Apsis Hotel has an excellent location, near to Place Catalunya and between the old en new city of Barcalona (old = ramblas, going out, small shops , check out the Born area and new= great restaurants, best shops). Rooms were very nice for a european city hotel, don´t expect a very big room and beds, wood on the floor, iron and ironingboard in the room and TV with the latest movies and direct internet access - about 10 EUR a movie / one hour internet). The Spa in the hotel is small but nice, a sauna, jacuzzie and a little pool. Nice to relax after a hard day of shopping. Service was great, personal extremly friendly. We didn´t have breakfast or diner in the hotel, it´s not necessary, we advise to eat in the restaurants nearby, like on the corner. When I go the Barcalona again I don´t have to search a hotel, I know where to go, Apsis Atrium. Ask for the room with a terras (on the back of the hotel)", "Date": "September 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Northern Ireland", "Title": "“Would go back anytime..”", "Author": "JackpotSpend", "ReviewID": "UR3813334", "Content": "We chose this hotel based on the reviews in Tripadvisor. We booked on the internet and had no problems. The staff at reception were friendly and spent time showing us maps and helping us to feel welcome. My usual worries about cleanliness were short lived - this is the cleanest hotel I have ever stayed in and I am not easy to please. We had booked a double room at the back - it was on the first floor which turned out to be a non smoking floor. We had no problem with noise and slept like logs. This is the sort of hotel where you know you've made the right choice as soon as you walk through the front door.", "Date": "August 29, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Coventry, UK", "Title": "“OK, but not perfect.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3809360", "Content": "We recently had a long weekend break in Barcelona, and wanted a modern hotel for our stay. After some online research, we went for the Apsis Atrium. Location wise, it was fantastic, just a short distance from the Passeig de Gracia metro station, but far enough away from the Placa Catalunya and La Rambla hubble and bubble. The room was modern and a reasonable size, although some of the fixtures and fittings were starting to show signs of wear and tear. The room was also not that clean, with ring marks on the surfaces and visible dust in places. There were also no tea making facilities in the room, although water and juice were free from the minibar. Breakfast was also a little pricey at €15 per head. Much better value could be had at one of the cafes up Passeig de Gracia. Overall, a little disappointing.", "Date": "August 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London, England", "Title": "“Very good, but had one flaw”", "Author": "amurray82", "ReviewID": "UR3789358", "Content": "I stayed in this hotel with my boyfriend for 4 nights in August. It was in an excellent location, right near the Placa Catalunya, the shops, restaurants and subway stops. The room was lovely- a fine size considering we weren't in it for long periods of time. The fact that you got free water and juice in the mini bar was a big plus when staying in the sweltering heat of August! The only major flaw was the noise. We stayed in a room in the middle of the hotel, overlooking the playground. This was not a problem, as there were no kids at school when we were there. What was a major problem was the thinness of the walls. Whenever the people in the next room used the toilet, had a shower etc. it felt like they were in the same room as us. One night, people came in very late and made a horrendous amount of noise, banging doors etc., which kept us up for a while. I know this is a problem in hotels, but this seemed exceptionally worse than any other hotel I have stayed in before. But despite this problem, I had a very enjoyable stay. The staff were friendly and very helpful. I emailed them before I arrived, requesting a double rather than a twin room and they sorted this out for us. The hotel was clean, and was a nice size, not too big and not too small. Didn't use the swimming pool or other facilities because too busy sightseeing! I would definitely recommend it, but maybe bring some ear plugs if you are a light sleeper!", "Date": "August 19, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“wonderful hotel”", "Author": "fjal", "ReviewID": "UR3763015", "Content": "Stayed only three days, not nearly long enough! Wonderful small suite - staying with our two children. Very comfortable and clean room, top floor, large balcony with hot tub. Loved views over roof tops, no traffic noise once windows were shut. Great location, very short walk to be right in centre of everything. Hotel staff helpful and friendly. Small swim pool, but we weren't there for that, so that was fine. Great breakfasts. Would recommend to anyone.", "Date": "August 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Excellent Hotel”", "Author": "djr915", "ReviewID": "UR3660294", "Content": "Perfect place to stay for active trips. Great place for a reasonable price. It is convenient to most major tourist activities in the city. The rooms are nice and we recently remodeled. The staff is helpful and friendly.", "Date": "July 12, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Columbus, OH", "Title": "“Enjoyed the Atrium”", "Author": "summercruiser", "ReviewID": "UR3659896", "Content": "We enjoyed our stay at the Atrium, but have a few comments. The hotel is in a great location, near the Ramblas and the staff were very helpful with suggestions for reservations, sightseeing, etc. The buffet breakfast was interesting with many regional offerings and if one reserved online, the cost was only about 7 euros. When we arrived, we were given 2 smoking rooms, although we had requested non-smoking. One room was okay, but the other smelled smoky. We were given another room which was a non-smoking room. The hotel had tried to give us two rooms together and that's why we ended up in smoking. The major problem was that while one room was nicely airconditioned (# 305) the other (211) stayed at about 80. So, if you care, I would suggest you request the rooms that stay cooler. The swimming pool was miniscule. We would return there, although try to get a cooler room.", "Date": "July 12, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Canada", "Title": "“Great hotel/location”", "Author": "thebunter", "ReviewID": "UR3630282", "Content": "Decided on Apsis Atrium Palace after reading reviews on the web. We were not disappointed. Location is perfect and hotel staff were amongst the most helpful one could hope to find while travelling anywhere. Only complaint is the rooms are a little noisy and walls need soundproofed. Would recommend this hotel to anyone and would indeed stay again on our next trip to Barcelona (one of the top cities in the World....it has everything!)", "Date": "July 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Co Antrim", "Title": "“Perfect Hotel, Excellent Location”", "Author": "NCK72", "ReviewID": "UR3629472", "Content": "We stayed at the Atrium Palace during a 3 day visit to Barcelona. The hotel is very clean, nicely decorated, friendly staff. The location is great as it is very central, only 5 minutes walk to Placa Cataluna but far enough away to be out of the hustle and bustle. Very reasonably priced, including drinks in the bar, although we only ordered wine. Will stay here the next time we visit Barcelona.", "Date": "July 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Galway", "Title": "“Great”", "Author": "CSHGalway", "ReviewID": "UR3616335", "Content": "Very Central,Good staff.Try and get a room overlooking the main Street,as the evening sunshine pours in thru your balcony-beautiful!.Bar & Rest area a bit basic but try Sumon & Porquesi Restaraunts close by-top class and very trendy...enjoy the best city in europe.", "Date": "June 28, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Naperville, IL", "Title": "“Perfect for time out”", "Author": "A TripAdvisor Member", "ReviewID": "UR3614902", "Content": "This hotel was wonderful! If Barcelona weren't such a wonderful city, we'd have liked to have spent more time in our room. The requested queen bed room in the back had no view but was very quiet, spacious, attractive, modern and comfortable. The location is ideal for hoofing it to all the attractions or catching the subway or even the bus to the airport, but is quiet later at night. Recommended without hesitation. Mary H, Chicago", "Date": "June 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cape Cod, MA", "Title": "“EXCELLENT !!!”", "Author": "ScottRosenthal", "ReviewID": "UR3548338", "Content": "I am in the hotel industry. I have to HIGHLY PRAISE the staff at the Apsis Atrium Palace. Everyone offered exceptional customer service. The property was beautiful ! Keep up the GREAT WORK !!!", "Date": "June 13, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“lovely stay”", "Author": "joyce_ch", "ReviewID": "UR3542303", "Content": "We splurged and booked one of the suites and thoroughly enjoyed our stay. The online photos don't do justice to the space, especially the lovely rooftop terrace which has two chaise lounges, a table which had floating candles in a lovely bowl, and a hot tub. The decor was modern and had an imaginative use of color. We had two tvs and two minibars, each of which was stocked with the free water and juice each day. Breakfast is a real treat. It is hard to imagine what more they could offer. It is a huge buffet with a bacon/sausage and egg area, a regional ham and sausage and cheese area, and a pastry/yogurt/cereal/ etc area. Great variety and high quality. As one reviewer stated, yes, there really is champagne for breakfast if you are so inclined. The staff was helpful and gracious, and the opportunity for free email is great. Didn't try the spa. Only complaint was advice to visit a rather haughty French restaurant (which we left before ordering) when we had asked for a Spanish regional restaurant. Unrelated to hotel, we would suggest taking the Touristic Bus company which has two routes rather than the long one. We were stuck on the long route for far too long when we could have had more flexibility on the other line. Do stay at this hotel. English spoken well, extremely clean, and lovely.", "Date": "June 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A first class hotel.”", "Author": "DinnyKnow", "ReviewID": "UR3524039", "Content": "My wife and I have just returned from a fantastic week in Barcelona, staying at the Atrium Palace. The location of the hotel is great. Close to everything yet far enough away from the busy Ramblas and Gothic quarter. The staff were excellent and the rooms were kept spotless. In fact the whole hotel was spotless, including the pool and fitness suite. We did not eat in the hotel but the small reataurant seemed airy and relaxed. I would suggest that if you intend staying here request a room at the front which has a small balcony and great veiws. Highly reccomended.", "Date": "June 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "belfast", "Title": "“highly recommended”", "Author": "n1952", "ReviewID": "UR3451416", "Content": "Excellent hotel with some nice touches - free mineral water and fruit juice in the mini bar - a godsend after a days sightseeing. Great location - a few minutes walk from the airport bus. Helpful staff - great advice on where to eat - where to go and where to avoid at night. Spotlessly clean rooms.First class breakfast - with lots of choice. Spent 4 nights at the Atrium palace in late March - will certainly be back. If I had to find a fault it would be the rather noisy plumbing and the size of the pool & fitness area. Truthfully though this is nit picking. I think this hotel is great value.", "Date": "May 9, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Norwalk, CT", "Title": "“Atrium Palace is an excellent choice”", "Author": "AKMCT", "ReviewID": "UR3438485", "Content": "The Atrium Palace was a great find in Barcelona! The hotel is in an excellent location in the Eixample area, within easy walking distance to Las Ramblas, two metro stations and the Placa Catalunya. The rooms are tiny but well appointed with great showers and nice toiletries. We had a room with a balcony overlooking the Gran Via, and it was quite nice to sit outside and read a book for a while after walking around all day. The traffic on the Gran Via is quite noisy, but the room must have extra thick glass, as you could barely hear any outside noise once you closed the sliding door. The staff was superb, and every restaurant they recommended was excellent. We booked our rooms online and were able to take advantage of the $7.50E breakfast price. The buffet is very nice with both hot and cold items as well as cappuccino's etc. on request. There is also free water and juice in the room minibars which are refilled daily. We would definitely stay here again, should we return to Barcelone.", "Date": "May 4, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Petoskey, Michigan", "Title": "“Very pleasant stay in Barcelona!”", "Author": "Nancy M", "ReviewID": "UR3416973", "Content": "We traveled to Spain for a company trade show. All our reservations were handled online. The hotel was very prompt in getting back to us by email if we had a question about our upcoming reservations. There were 18 in our party and we had 9 rooms. It was very clean and quiet. The service at the front desk was very helpful in setting up dinner arrangements and entertainment for our large group. The language barrier was not a problem. There was at least one person at the desk that spoke English every time we needed assistance with something. We were in Barcelona for 3 nights, we spent about 180 euro's a night but this included an excellent breakfast each morning. The rooms varied quite a bit in size and in view. Everything in Barcelona is tight packed. Our particular room was small but adaquite. The bathrooms were very nice and the showers excellent with plentiful hot water and water pressure. Some on the rooms had views of the street and were bigger in size, some looked at the brick wall of the building next door, some overlooked a school yard. We didn't go to Barcelona to spend time in our room so the size and view really wasn't an issue. The air conditioning worked great, for some reason the hall ways and elevators were very warm. The elevators everywhere we went were tiny. This hotel was no exception. We tight packed it into the elevator with just my husband and I and 5 pieces of luggage. These elevators were not built for wide bodied Americans!! The location was excellent for many of the sights. I'd reccommend this hotel for a pleasant but not extravagant stay in Barcelona. The use of the computers in the business center was free, everyone in our group enjoyed that feature. I never made it down to the spa or exercise area's so can't make a comment on them.", "Date": "April 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "staffordshire", "Title": "“atrium palace perfect little holiday hotel”", "Author": "katybStaffordshire", "ReviewID": "UR3393687", "Content": "Booked this hotel after reading reviews on trip advisor. We were not dissapointed.The hotel is of a good standard with clean, spacious rooms. The free juice and water were a bonus as was a book all about Barcelona in the bedrooms.The spa was not any great shakes but it was nice to relax in the jacuzzi after being on your feet all day. Another tip from this website was to book direct with the hotel on their website. we saved quite a bit of money plus got breakfast for half price which was well worth it with bacon, eggs , coffee, juice and a cold selection and the most delicious little cakes. kept us going till about 3pm each day The staff were friendly and happy to give out advice on the city together with maps etc and the hotel was centrally located with 2 metro stations nearby. On the downside the play ground was noisy during the day until about 9pm but who wants to be in the hotel during the day or be in bed before 9pm!! The kids could not be heard with the windows closed anyway.(there were no activities played on a sunday ) All in all this hotel was a real find and I would recommend it to anyone.", "Date": "April 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Merseyside", "Title": "“Lovely, comfortable hotel. Not so good Spa/Gym.”", "Author": "JayAd", "ReviewID": "UR3369616", "Content": "Lovely, comfortable hotel. The rooms to the rear overlook a school in a courtyard, so playtimes can get a bit noisy. Staff were very helpful and friendly. We made use of the indoor pool, as we have young child, and it is rather small. If more than two people are in there it becomes uncomfortable. The jacuzzi was alright for the first five minutes, then the very strong chemicals began to sting our eyes. Not ideal. The gym left a lot to be desired. It contained 3 pieces of equipment, and only two worked. The Sauna was even worse. Hottest temp. it reached was about 65 degrees, because the cleaner kept switching it off!! However, the hotels location was great. We visited for 3 days, and there wasn't enough time to fit everything in. The Bus de Touristic is a great way to see the city. The hotel makes a great base due to it's location and the proximity of the Metro or the Tourist Bus. Quite a distance from the harbour, though. There was also a good choice at breakfast time, everything was lovely - even champagne!! Overall, if you will use the Spa/Leisure facilities then I would look elsewhere. As a base to explore the city, then the hotel cannot be faulted. Rooms were spotlessly clean and well maintained.", "Date": "April 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Surrey, UK", "Title": "“Great apart from the noise”", "Author": "fekker", "ReviewID": "UR3329512", "Content": "This hotel is a nice boutique-style hotel in a great location in the city. Only a few minutes walk from La Rambla, the hotel offers good modern accomodation and pleasant staff. However, don't be fooled by the Spa offering. This is NOT a spa hotel. The Spa features are tiny and, although, good quality, you'll feel that you're in a damp basement rather than a serene tranquil relaxation zone. Our stay was totally ruined by the location of our room which over-looked a square in the centre of the group of buildings - the square was a school playground. The air-conditioning didn't work in our room we had to sleep with the windows open. By 8am it was impossible to sleep and the noise continued all day until around 8pm (the school became a sports pitch at night). The sound of 200 kids screeming really drills into your skull after 2 days. If you do stay at this hotel, don't accept a room adjacent to the playground from hell!", "Date": "April 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "N. Ireland", "Title": "“Great hotel in best location”", "Author": "Jonnyboyok", "ReviewID": "UR3304453", "Content": "This is an excellent hotel that is clean, quiet and comfortable. The rooms are well equipped and the sound proofing first class. The buffet breakfast is top value for money and relatively cheap if booked at the time via the hotel website (half price ) The free juice and bottled water is a nice touch as is the chocolates in the evening. The 24 hour free internet access helped add to that \"nice touch\". Overall the hotel is terrific value for money and ideally suited for those seeking somewhere quiet in a quiet area that is close to all the local ammenities. The only downside, though not everyone will agree, is that the bar and lounge area is very quiet in the evenings and closes at 12 midnight but the bar prices are amongst the cheapest in the whole of Barcelona. Excellent value for money and well worth a visit!!", "Date": "March 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Very good value for money”", "Author": "SixtyDays", "ReviewID": "UR3268812", "Content": "We stayed at the Atrium Palace for 3 nights at the end of February for my girlfriend's birthday. We booked directly with the hotel on their website, and requested a double room at the back on one of the upper floors, and got a room on the 4th floor overlooking the sports area at the back of the hotel. We stayed over a weekend so no problem with the noise either as the kids weren't at school. Basically the courts are used until about 9pm in the evening, but that was not a problem as we'd be out most of the time anyway. The room was clean and large enough for us. The free juice and water was a very nice touch. The best thing however is the location as well as the facilities. We paid 99 euros for a night and for this amount it is generally very difficult to get a central hotel with a swimming pool, jacuzzi and sauna. The swimming pool is small and the gym could be better equipped, but the jacuzzi and sauna were fantastic after a day's walking before going out in the evening. In a nutshell, if you can get a room at the Atrium Palace from their website for a good price I wouldn't hesitate. The location, service and facilities (including free internet access in the office/library) of the hotel were much better than we have experienced in other, more expensive hotels.", "Date": "March 12, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Ireland", "Title": "“Spa under renovatoin at the Atrium Palace”", "Author": "cardigan24", "ReviewID": "UR3256970", "Content": "I have just returned from a weekend celebrating my boyfriend's 30th birthday at the Atrium Palace Hotel in Barcelona and we were very disappointed to learn that the sauna and jacuzzi etc. was closed. We were not told this on checkin but found out on arrival at reception in our robes! I specifially chose this 4 star hotel for it's location and facilities so I really felt we had been let down. Also the heat in the bedrooms (and halls) is unbearable. It is only about 8 degrees outside but there is no need to have full heat on in the hotel, the aircon in the bedroom did nothing but blow out more warm air! Also our Cava was not in our bedroom on arrival but arrived that night - just another little something to let me down. I did a lot of research to find a nice affordable hotel in Barcelona and used this site, unfortunately the hotel let me down and I will not be returning. I asked for a discounted rate (we paid euro 155 per night) because the facilities were not available to us but they refused.", "Date": "March 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great hotel - recommended”", "Author": "Smokey-Smudge", "ReviewID": "UR3232877", "Content": "We stayed here for 2 nights at the beginning of December for my husband's 30th. We booked direct with the hotel, requested a double room at the front on one of the upper floors, and got all of our requests. The room was clean, big enough, with free juice and water, and the hotel is in a fantastic location - it's only 10 minutes walk from where the Ryanair bus from Girona drops you, and a few blocks from the Ramblas. Good tapas bars nearby, which the hotel staff recommended. We had to ask a couple of times for the complimentary Cava for my husband's birthday, but staff were very apologetic and brought it up. We didn't get a chance to use the pool - so much to do in Barcelona in a weekend! I thought the hotel was great value in such a good location and would definitely go back.", "Date": "February 27, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Faro", "Title": "“Loved the Atrium Palace”", "Author": "Algarvebird", "ReviewID": "UR3212286", "Content": "We have just returned from a 4 night stay at the Apsis Atrium Palace and felt that we had to share our views so that everyone can have a great time in Barcelona. The situation of the hotel is perfect and we walked everywhere - Las Ramblas, Latin Quarter, Gaudi Buildings and even the beach. We had asked for a nice room for our wedding anniversary and we were very pleased to be given a room on the 5th floor with views over the Gran Via. The room was very modern and clean, there was no road noise when the windows were closed so we enjoyed a good nights sleep. The staff could not be more helpful and were able to recommend good restaurants (this is essential with about 2000 to choose from). The icing on the cake was the breakfast which we got at a 50% discount. The kitchen is open so you can see the cooking - great sausages and bacon, nice cakes and pastries too. We even took advantage of the champagne that was cooling in the ice bucket. (Well it would have been a shame not to)!!! We will definitely be returning to this lovely hotel soon.", "Date": "February 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Deutschland", "Title": "“Great stay”", "Author": "vossvol", "ReviewID": "UR3099222", "Content": "Stayed in Apsis Atrium in January and enjoyed it very much. Upon arrival we were upgraded to a suite on top floor. So we had two rooms and a wonderful bath with jacuzzi. In addition the suite had a a huge terrace overlooking the town. Service could have been a bit friendlier, especally room service. Pool and SPA area is very small but big enough for a short relax after shopping. If I would stay there again I would definitely take a suite.", "Date": "January 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“great hotel!”", "Author": "cyndtan", "ReviewID": "UR3090754", "Content": "We stayed here in January 2005 and loved it. The rooms are clean, modern and spacious. What a great location too. Free use of the office room with computers, internet access, printers, etc. came in handy. Our friends who were staying at another hotel wished they could switch when they saw our room.", "Date": "January 27, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Leeds", "Title": "“i have found a home from home”", "Author": "A TripAdvisor Member", "ReviewID": "UR3010740", "Content": "I have found a home from home, ibis leeds centre is one of the friendliest hotels i have ever stayed in, you are always greeted with a smile, i have stayed here 4 times now and the team already recognise my face and always say hello mr...... The rooms are great, the hotel has been open since august 2004, and the quality is still the same, brand new! queen size bed with an ensuite power shower........no request is too much here the team are 24 hours and always help no matter what...... Breakfast is great i stay in ibis regularly, but this one is great they do cooked breakfast too! The bar is open with a lovely atmosphere, if im in a quiet mood i can just sit and have my excellent meal bought to my table, or if its a sports night sit and watch my favourite team......... my home from home is always going to be ibis from now on!", "Date": "January 16, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Darien, CT", "Title": "“Awsome!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3010736", "Content": "We just stayed here for 10 nights in January 2005, and loved it. The staff was very friendly, the location was awsome, and the room was very spacious and modern. The wirless internet in the room was deffinatly a plus. The breakfeast buffet had a huge selection, and was very good. The only downside is that the fitness room is very basic, and the pool is quite small. We look forward to going back somday soon.", "Date": "January 16, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“great central hotel”", "Author": "helen", "ReviewID": "UR3002407", "Content": "just returned yesterday the 11 jan we had a great time.hotel was very clean staff were very friendly,the facilities were great, free water and orange jiuce every day from the mini bar in room.the only thing you do not get a kettle in your room if i go again i will take 1 for when you wake in the mornings.breakfast was nice needs beans though.", "Date": "January 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Excellent Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2306207", "Content": "Recently spent a week in this hotel and was extremely pleased! was a little aprehensive after reading earlier reviews however am so glad i did not cancel my booking. The rooms were great, modern and clean. The extra touches such as the free water and soft drinks, bathrobes and slippers made my stay even better. The bathrooms were very nice too, spacious and chic all in marble, with an excellent power shower. Hotel location could not be better. Me and my partner had a balcony room on the 4th floor, balcony rooms are smaller however the size of the room was more than ample. Our room was right at the front of the hotel and our balcony was out on the main road which was extremely busy however once the balcony doors were shut the noise was blocked out! Our air conditioning was excellent, infact one morning i woke up that cold i had to turn it down, very good considering it was the middle of july and about 32 degrees outside! So if there were problems with this as previous reviewers have mentioned it has been rectified! What can i say about the basement floor other that brilliant! the pool, although small was very refreshing and looked great as lights were underneath the pool (these changed colour creating a relaxing and luxurious atmosphere) the jacuzzi was great and as it was open from 7am-midnight i definately recomment that you experience it! Although i did not use the sauna and gym they looked very nice. The hotel staff were extremely friendly and helpful. We did not stay in the hotel restaraunt as i thought it to be a little overpriced so i cannot comment however it looked nice. You are spoilt for choice for restaraunts in barcelona, if you are unsure where to go the hotel provides an excellent book in your room which gives you info on all the restaraunts as well as places of interest. All in all i had an excellent holiday and this hotel was a major factor in this. i would definately stay again!", "Date": "July 18, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“So good we're going back soon”", "Author": "A TripAdvisor Member", "ReviewID": "UR2208968", "Content": "Didn't know where to stay in Barcelona so found this site and went with the recomendations. Stayed here for a long weekend June 2004 to celebrate wifes' birthday. Hotel was outstanding and staff so helpful, even supplied a complementary bottle of fiz. Reception were always willing to give great suggestions for places to eat (if you like fish you are in for a real treat!!!). Shops, including designer names if you want, all within 2-5 minutes walk. Oh! and \"La Rambas\" about 5 mins walk (don't miss it if you like street entertainers). Only draw back was indoor pool, more like a big bath!!! Still, am going back their soon. Hope you enjoy as much as we did.", "Date": "June 21, 2004"}], "HotelInfo": {"Name": "Hotel Acta Atrium Palace", "HotelURL": "/ShowUserReviews-g187497-d275097-Reviews-Hotel_Acta_Atrium_Palace-Barcelona_Catalonia.html", "Price": "$157 - $264*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via de les Corts Catalanes, 656</span>, <span class=\"locality\"><span property=\"v:postal-code\">08010</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "275097", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/42/05/42051e1f6de6fe77fab5d5b8ca3284c91large.jpg"}}