{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "san francisco", "Title": "“Good location”", "Author": "tsc2678", "ReviewID": "UR124788718", "Content": "The hotel is a good value for money.Its close to freeway ,city walk,and Hollywood .the area has lots of stores down street like Macys , Sears,Ralph's CVS, and resturant s If you go to NoHo eat at EATS on magnolia and lakershime .Safe area parking in lot scarce at night", "Date": "February 19, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“liar”", "Author": "Cecilia D", "ReviewID": "UR122108273", "Content": "I travelled w/ my 1 1/2 year old and my husband, I booked for a non -smoking room w/ microwave and fridge. On the morning of my reservation day, I got a call from them saying there was a problem w/ my reservation. I called them back and said everything is \"ok\". We checked in, when I opened the door, I smell cigarette smoke, found 2 ash trays and matches in the room, no non-smoking sign on the door and no microwave. My husband went back to the office and they insisted that it is a non-smoking room. For a non-smoking family, cigarette smoke is very distinct, IT WAS A HORRIBLE STAY. I won't even give this place a 1.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington State", "Title": "“Well furnished, quiet and good value”", "Author": "Dtlusty", "ReviewID": "UR121672820", "Content": "I stayed here one night and found the room very well furnished and in great condition. It was located away from the street (Laurel Canyon) and was quiet at night, a blessing in L.A. There was a fridge and coffee maker in the room. The Wi-Fi worked well and there is also an ethernet connection. Breakfast offered donuts, bagels, coffee and juice and was satisfactory if minimal. The staff were friendly and we had a decent rate. This is a very good hotel, well-maintained in a central location. I would prefer to stay here if I am every in Los Angeles again.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Pleasantly surprised.”", "Author": "Tamrasto217", "ReviewID": "UR120562168", "Content": "We stayed here because it was a quick drive to Universal Studios. The grounds and parking lot were clean, no litter or debris. The office was spotless. There are awards for quality from Super 8 corporate hanging on the wall behind the front desk. Check in was quick and easy. The room was on the first floor, so we heard a little noise from upstairs but they were quiet after 10 PM. The room was quite large (maybe because we were on the corner) and there was plenty of room for suitcases and hanging items. Large enough for my 10 year old to run in circles and do cartwheels, lol. The door was secure with a deadbolt as well as a chain lock. The carpet and bedding looked newer. The beds were quite comfortable, firm with no sagging, clean and the sheets were fresh. No signs of bedbugs on the mattresses or the surrounding area. AC/heater/fan worked well. The refridgerator, microwave and coffee maker (included in the standard room) worked well and were clean. The towels were soft and smelled fresh. Tub/shower combo and toilet in bathroom, seperate vanity outside the bathroom. Hair dryer by vanity. Adequate shampoo, hand soap, body soap, coffee etc. The ice machine worked well and we were actually able to fill our cooler as we left. We have stayed at a few places that actually charged for the ice, so this was a perk. The breakfast was a plentiful supply of fresh doughnuts and bagels with butter available, juice, coffee etc. No cream cheese, and no cereal or milk. But the doughnuts were delicious! As we were leaving to check out, we were able to look in most of the other rooms on the first floor as they were cleaning them and probably airing them out as it was kind of a cool day. All of the rooms we saw were just as updated and clean as the one we had been in. Some of them had a king bed instead of the two queens and there was a garden tub in the room, as opposed to just the tub/shower combo, so that may be something to ask about. Overall, we enjoyed our stay, we would return if in the area, and I would recommend this location for the price range.", "Date": "November 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Penrith Australia", "Title": "“Very enjoyable stay”", "Author": "Margaret B", "ReviewID": "UR117256180", "Content": "We found the room and grounds to be very clean and the staff could not do enough for us. I would definately stay again. I had read bad reviews and was a bit worried but it was all for nothing. Some people seem to complain about anything. I would recommend this place to anyone, nice clean and cheap. Margaret Booth Australia", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "LA", "Title": "“Nice Staff”", "Author": "FastFlo", "ReviewID": "UR116496957", "Content": "I stayed here at the end of a long dirve from Oregon. My goal was to arrive in LA and stop for the night. Having tried another chain Motel, I thought I would give this one a try just for the sake of comparison for future knowledge. it was very close to where I was going but I was tired. The only room available when I called was a smoking room but I took it. The person who took my reservation was very friendly and knowledgable. He also had a nice sense of humor and good manners. The clerk who greeted me when I arrived wasn't Raj, but he was equally friendly and helpful. I was afraid about the room smell, but was pleasantly surprised that the 'aroma' was very mild and unnoticeable within minutes. Even when I left the room for a a quick shopping trip, the smell was barely noticable when I returned. Not bad. There was no elevator but the motel is only 2 stories. For an overnight, not a problem. Adequate parking available near the room and out of the sun. No pool. Adequate ice machines and many near-by places to purchase dinner and/or snacks. Refrigerator in the room. Large room. Large bathroom. Large dressing room. Large bed. Nice sheets. More than adequate AC. HBO and the good cable channels. Continental breakfast included. Close to freeways and many San Fernando Valley attractions. I liked it. Very clean and quiet. This is only the second time I have stayed at a Motel for the night while driving since I was a kid. Clean and quiet really mean a lot to me. I would actually stay here again if necessary and will also give other Super 8 motels a chance if I am too tired to drive on or haven't made reservations elsewhere. I felt comfortable and secure for the night.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Newbury", "Title": "“Very Pleasant”", "Author": "TRAVELLER343Newbury", "ReviewID": "UR114595831", "Content": "My wife and I styaed at this Super 8 on the 31st May for two nights.We found the room very comfortable,I had booked this after changing from staying at Torrance thinking it would be closer to Universal Studios which we wished to visit. Indeed this was the case, and found in the hotel information regarding trips around the area.The manager Mr Patel was kind enough to telephone the bus company to arrange a pick up time for the tour of Universal Studios. The hotel itself was,as I have said very comfortable and the breakfast was more than sufficient with cereal, orange juice ,coffee and all manner of bagels, danish pastries and cakes (fresh this morning from baker) and more than enough to start the day. This is ideal if you do not wish to drive and would like to visit Universal Studios which take my advise and do visit. Just down the road we visited Sizzlers and ate two Rib Eye steaks that just melted in the mouth,salad bar,grilled onions a Heineken and Merlot total bill $55.35 and at todays rate works out at Â£34.59 what a bargain.All in all a very pleasant location and well worth vsiting this motel", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Vallejo, California", "Title": "“American Express card really?”", "Author": "showmediscount", "ReviewID": "UR112741970", "Content": "So please thoroughly make sure you understand what u get into. First off I can't tell you what the room look like because I never check in. My bank card VISA wasn't a major credit card so, then the rude clerk want 200 cash deposit from me because my bank card was liability he said. The hotel for those on a budget is not conveniently locate near any public transportation get ready for a cab if u aren't driving. This has been by far the worse experience i every encounter I cancel my trip and caught the next thing smoking out North Hollywood.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Orem, Utah", "Title": "“Blood on my sheets”", "Author": "Ricardo_Utah", "ReviewID": "UR90645879", "Content": "I checked in my hotel room on Dec. 24th, 2010 (when I wrote this review) My fiance and I cut costs for this stay. We are pre-med students in Utah, and simply don't have the money for anything better. However, we were satisfied by the appearance and location. before we slept in our bed, we pulled back the sheets. We noticed a massive stain on the 'new' sheets that appeared to be blood. I pulled the sheet back, just to discover another blood stain on the pad below the first sheet. We immediately asked the front desk to either have the sheets replaced or have a new room. The office brought us one sheet and had us replace the sheet ourselves. We needed an additional sheet once we realized that there was hair on the bed from a previous tenant. They were hesitant to bring us a new one, but eventually brought it to our door. We attempted to complain to the corporate office, but they were closed. Unfortunately, we realized that the front office would be no help since they only brought us a sheet to take care of the problem. We attempted to book another room at another hotel, but we couldn't find an availability that would accept our reservation at this time and on Christmas. I WOULD NOT RECOMMEND STAYING AT SUPER 8 NORTH HOLLYWOOD, CALIFORNIA. (CA)", "Date": "December 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Evanston, IL", "Title": "“Very Nice, but I can see some of the points others have made...”", "Author": "Cubdukat", "ReviewID": "UR77285238", "Content": "My only real problems with this place were that it's fairly far from most everything else in North Hollywood, and the public transit options are practically nonexistent after midnight. The other one is something a couple others mentioned in their reviews--the strong antiseptic odor in the lobby is pretty strong. Other than that, I had a very good experience. I got the room with the jacuzzi, and it worked very well. The bed was one of the best I've slept on, and the front desk was quite friendly. All in all, I definitely see myself coming back here again. It'll just be with a rental car...", "Date": "August 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Sacramento, California", "Title": "“Adequate, but I'll spend more for something nicer next time.”", "Author": "rwreyes", "ReviewID": "UR68830461", "Content": "This hotel is about what you would expect a Super 8 Motel to be: a bed in a room. The rooms looked pretty clean, but one of ours strongly smelled of urine. I asked the manager for another room, and he said they were full. He was very nice about it, but we were stuck with the urine room. The location is a little sketchy, but all the hotel doors face inward. We were a little worried about our cars, so we made sure to get a spot in front of our room. The walls are really thin, and there were some really loud guests next to us, so I didn't sleep well the first night. If you're looking for a cheap room, you'll find it here. Just remember that you're only getting what you pay for.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Houston, TX", "Title": "“Not Good - Save Your Money for Anything Better”", "Author": "TheAnswer", "ReviewID": "UR54547935", "Content": "The first few Super 8s I've stayed in since \"stepping up\" from Motel 6 have been pleasant experiences. But as of late, it's been getting worse and worse. Oh my good Lord. This latest stint has truly hit rock bottom. First of all the location is... wow, how should I put it... dangerous, seedy, abhorrent! The non-smoking room reeked of cigarette. Odor aside, however, the room amenities weren't bad. Beds were clean and comfy. Bathrooms were spacious, but basic. The problems were with everything else. The neighbors across the way were anything but neighborly. Yelling and constant door-slamming made it very difficult to fall asleep. The next day the outside hallway was littered with cigarette butts. The guys at the main office swear there is no access code required for the \"free wifi\", but both of my devices prompt me for the access code. They never did resolve the problem. Breakfast was pathetic. Cold pastries (beware diabetics). Bagels but no toaster or cream cheese. That's it. No cereal, egg, waffle, or fruit. The worst thing about it... at $75 per night, this hotel cost more than the room I got at the very nice Hard Rock Hotel in Las Vegas! Shame on you Super 8!", "Date": "January 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“WHAT A DUMP AVOID my last review must have been an anomoly”", "Author": "SecretAgentReview", "ReviewID": "UR51341188", "Content": "2nd property visit. Last property visit. I checked in to a king room second floor. Check in is unnecessarily slow and inefficient, same questions asked repeatedly. It stunk of deodorizer but i pressed on. I was wearing white socks and when i finally sat on bed they were black on teh sole. I was stunned. I took a washcloth and ran in across 6 inches of the rug, did this is 2 places. came up dark grey. WHen i was in anther hotel the next day I noticed in my laundry, a t shirt smelled heavly of the same deodorizer which means its used on the bed as well. YUCH. Bed poorly made so sheet did not stay tucket at top. Free breakfast is a diabetic sugar coma of dipped glazed cheap donuts. Dont call it continental, its coffee and donuts . they couldnt pay me to stay here Bette Davis said ot best \"What a dump\"", "Date": "December 16, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "MSP", "Title": "“Stay away from this motel -- I got cheated by them”", "Author": "MSPjetsetter", "ReviewID": "UR49136797", "Content": "I made a reservation at this motel for a weekend day stay. However, I canceled the reservation later on, well before the cancellation deadline. I was shocked when I looked at my credit card statement and found out that the motel went on to charge my credit card for the one night stay. Needless to say, I called up the motel and complained about it. They had the nerves to tell me that they charges had gone through and there is nothing they can do for me anymore. There wasn't any point for me to argue with them anymore and I decided to dispute the credit card charge with my credit card company. I am a leisure traveler and I have stayed anywhere from a motel in Paris, Texas to a Hilton Suites in Paris, France at a rate of 24 lodgings per year. Usually I never have any problem, but the management's service at this motel is by far the worst I've experienced. Take it from me, AVOID this motel at all cost.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great value, don't let the neighborhood scare you”", "Author": "Dylan1967", "ReviewID": "UR48061944", "Content": "If you've read the other reviews on this site you've already been warned about the neighborhood, but don't let that scare you away. I wouldn't call it dangerous and I never felt unsafe staying here, just be cautious if you're planning to walk around at night. But then, this is true of any neighborhood. This one LOOKS worse than it actually is. We booked here for two nights during a trip to SoCal planning to spend time at the beach and check out Griffith Observatory. We booked for value ($70 a night, or so) and sacrificed proximity to the beaches; with traffic it took often an hour and a half to drive to the coast. If you're in SoCal for the beaches, I would recommend booking a hotel closer to the coast and thereby saving yourself some gas money. It was a bit of false economy on our part to skimp on the hotel yet spend all that time commuting to the coast. Nevertheless, the room was very clean. It was spacious (for a budget motel), with a large tv and a hairdryer. The microwave and small fridge came in very handy because on the first night we ventured out for some Thai food and were able to store and reheat our leftovers for the next day's lunch. Our king size bed was very comfortable and everything seemed clean and in working order. The complimentary pastries and coffee in the morning were a nice treat, but make sure to get there early; they go fast! The front desk person never seemed to go out of his way to be particularly friendly, but the check-in/check-out process was always quick and efficient, which was my primary concern. One tip: If I were you I wouldn't park in the rear of the hotel nor get a rear-facing room. The junk yard / truck repair lot back there is rather unsightly and ominous-looking. I didn't experience an incident that made me worry for our safety or the integrity of my vehicle either time I stayed there, but be cautious and alert nonetheless.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Tuesday is Trash day”", "Author": "sromo522", "ReviewID": "UR47480035", "Content": "I arrived Monday noonish decided to get some rest. I sprung for a jacuzzi suite, the suite had that smell described earlier I opened the window no screen being i was on the ground floor the window didn't stay open long. My view from the one window was a stucco wall. A hour of so later there was so much noise coming from next to my room. Room number 113 is next to the rubbish containers a person spent about 2 hours going thru the bags looking for cans banging the lids every now and again for good measure. Neighborhood is grime.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“decent room but BAD service”", "Author": "Lab4games", "ReviewID": "UR35785402", "Content": "stayed here for 1 night and during check in, the front desk guy was very rude and unfriendly. no smiles, throw the credit card on table, sulking face. rooms are ok but had an overwhelming sanitizer smell. yucks! we used coupon for $50. so it is ok value for such a room.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "greester0101", "Title": "“serve the purpose”", "Author": "greester0101", "ReviewID": "UR29626324", "Content": "i stay thie super 8 in n hollywood for couple of nights,Niace place in a little different neighbourhood,rooms are clean and comfertable, but front desk is little just to the point,mind your own buisness type,", "Date": "May 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Good budget hotel”", "Author": "maynard7", "ReviewID": "UR26081161", "Content": "Nice room. Low-rent neighborhood, but I wouldn't call it dangerous. Bed was OK. Microwave oven and mini-fridge in room. Fairly quiet. Free internet terminal in the lobby. Friendly staff. Would stay again when traveling on a budget in the LA area.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "India", "Title": "“I loved this place for over night stay.”", "Author": "Mitesh.Sura", "ReviewID": "UR23214232", "Content": "If you are looking for just to stay than this is very nice and neat place to stay. It was quite and management was good too. It was very close to hollywood studios, the community was little scary at night. Overall it was gr8 with the price we got it.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Hollywood, CA", "Title": "“Bring A Hidden Camera!”", "Author": "Tim_in_Hollywood", "ReviewID": "UR16623171", "Content": "We stayed at the motel for nearly a week. On day one, my wife called to the front desk to ask for a ironing board and iron. They said they would \"bring it right up.\" After waiting for 45 minutes, she called again. They said that they were waiting for her to come get it...despite their offer to deliver. She then went down to get it, but they didn't even have an ironing board for her to pick up! On day three, we left at 11:20am. When we returned at 5:30pm, it had not been touched by the cleaning service. When I called to inquire why, I was told that I must have had the \"Do Not Disturb\" on the door. Wrong! They simply did not bother to clean it. No offer to correct it either, than to tell me I could come to the desk to get a couple towels. On day four, we talked to the guy that was often at the front desk when we left at around 10:00am, so that they would be certain to clean our room. When we returned late that evening, it had been \"cleaned,\" but it was obvious that they had gone through our drawers. I had left a couple computer cables (nothing expensive...I'm not crazy) in a drawer with a couple extra towels we had received from one of the cleaning ladies. The computer cables were on the floor and the towels were gone! It wouldn't surprise me a bit if it was the manager/owner (who lives in a couple of the rooms of the motel) was the one that ransacked our room. We're not sure if any of our personal items were taken? Rest assured that we would NOT steal any of their small, paper-thin towels. The floor was also filthy. We couldn't possibly let our infant crawl around at all. Within an hour, my brand-new, never worn before white socks looked like I had just run across an asphalt parking lot with them. (see the picture) We won't be staying here again. With only a minimum amount of effort, this motel could be a decent place to stay. However, the complete lack of concern and poor attitude by management, the filthy floors, and the invasion of privacy searching through our possessions cause us to never plan a return visit.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Francisco Area", "Title": "“Nice little motel in a convenient location but funky neighborhood”", "Author": "Cineworker", "ReviewID": "UR6822573", "Content": "This Super 8 Motel property has been recently fixed up and is in nice condition. The prices can't be beat in this area. It's very easy to get to and from and convenient to many valley areas. Just a few blocks from the 170 and 5 freeways. The immediate neighborhood is not very good, however as it's in a mixed light industrial area and not someplace you'd want to stroll around. The managers are a little taciturn but helpful if asked. Internet access is by wire only. No wifi. Park early if you want to be near your room. A larger uncovered lot is in the rear of the property. Be aware that the walls are paper thin and you can be at the mercy of the noise next door. Upstairs is quieter than downstairs. I plan on staying here when in the area on business.", "Date": "February 21, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely hotel I would stay here again”", "Author": "A TripAdvisor Member", "ReviewID": "UR4896213", "Content": "Love is great, clean, the staff is very helpfull and friendly. its great value for the money that you paid. I stay 4 nights and all was confortable. have fridge and microwave and also they have rooms with jacuzzi, the next time i going to hollywood or surrender areas I will go back to this hotel.", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Questionable area but all around awesome hotel!”", "Author": "musicloverforever", "ReviewID": "UR3713167", "Content": "Having read the other reviews of this hotel before we left I was afraid of what we might be getting ourselves into. The area is shady. We tried to hurry in the parking lot. It is very well lit, but three women shouldn't be out in the wee hours anywhere really. The parking lot curves around the building, if we had had to park back there I would have been worried. However, for all three nights we parked right in front, there is plenty of room. The service here was just great, we spoke to two different receptionists and both were very helpful. The room was very big, the ceilings were high, the vanity was outside the big bathroom and there was a separate open closet area. The room and bathroom were extremely clean and we are picky travelers. The water pressure left a little to be desired, but it was fine. They serve Winchell's donuts in the morning which happened to hit the spot for the three of us tired of hitting fast food for three weeks. If you do reserve a room here, try to get one on the second floor, there is a locked stairwell that leads to the second floor. However, there is no elevator so you'll have to lug everything up. If you're on the ground floor, no worries either. Don't be scared of this hotel, it's a great value. We had a great experience!", "Date": "July 28, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "sacramento, CA", "Title": "“Awesome!”", "Author": "jsimmons", "ReviewID": "UR2875366", "Content": "You should know that I am a travel agent and have stayed in many hotels. I travel frequently, but this was my first time at a Super 8. I will definately recommend this hotel to any of my clients who are down in the area. This hotel is easy to find and within minutes of the airport and all freeways. The hotel lobby is beautiful with a lovely fireplace, couches, coffee and juice. Customer service is very friendly. We were fortunate to get the last room. We had room #224 with two beds. The rooms were gorgeous! For a motel...this is way more than what you pay for! Fresh light yellow paint, cream crown molding, a granite vanity! The room smelled fresh and clean. Furniture, color and patterns all looked terrific. The bathroom was a great size, shower was very relaxing. Room came with a hair dryer, shampoo and soap. Our room had a 27\" tv with HBO and cable. They also provided a list of all nearby restaurants their numbers as well as local tourist information and all airline, rental car, and store numbers. I was very impressed. There is plenty of parking with security camera's for your safety and vending machines for juice or snack. There are plenty of places to eat within walking distance and a 7-eleven on almost every corner. Check out was a breeze, the front staff are very friendly. They provide a complimentary breakfast as well. I noticed some rooms on the lower level had jacuzzi's in the middle of the room with a king bed. If we didn't have 3 adults, we may have tried to get one of those. They looked romantic, and fun! I usually try to stay away from North Hollywood when I come to Southern California, but this place was so nice I think I'll just keep coming back. You won't be disappointed. Make your reservations in advance, they fill up quickly. Thanks SUPER 8!!!", "Date": "December 10, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "San Jose, CA", "Title": "“Great motel. Bad location.”", "Author": "billds", "ReviewID": "UR2517639", "Content": "This motel has a lot of good things going for it. It's a clean property with clean rooms and a friendly and helpful staff. The free broadband internet service was drop dead easy to use. The shower head delivered wonderful water volume unlike those miserable water saver types at some places, AND it was installed high enough on the wall that tall people like myself don't have to hunch down to get under it - much appreciated. On the down side, the bed sheets were almost like plastic. I've never felt linens like that before. I suspect they were selected for their durability. The bathroom is roomy - large enough for wheelchair access. Oddly, the commode was positioned in this large bathroom so that only adults with long arms can reach the bathroom tissue on the opposite wall without getting up. Pastries were available in the office in the morning, but they obviously get them from one of the many local Mexican businesses because although they were attractive looking, they had a taste that only someone raised south of the border would appreciate. The worst thing though was the poor neighborhood. It's an area in decline - run down and seedy looking (which may explain the multitude of not so hidden security cameras). It made us feel uncomfortable. The Super 8, North Hollywood is a super value. Clean rooms at bargain prices. It's a shame really, because if it weren't for the location, we would give this motel high marks. Bottom Line Would we stay there again? No.", "Date": "September 7, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Quite pleased and surprised”", "Author": "PennsylvaniaBee", "ReviewID": "UR2308123", "Content": "I was pleased and surprised at this hotel. You would need a car, but it's only a short drive to downtown Hollywood. The place is sparkling clean and the rooms like brand new. Not the best neighborhood, but nothing dangerous. The staff was friendly, and the rates were excellent.", "Date": "July 19, 2004"}], "HotelInfo": {"Name": "Super 8 North Hollywood", "HotelURL": "/ShowUserReviews-g32655-d275366-Reviews-Super_8_North_Hollywood-Los_Angeles_California.html", "Price": "$63 - $80*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">07541 Laurel Canyon Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91605</span></span> </span></span></address>", "HotelID": "275366", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/05/6c/056ca001a0015d56b2629534a83e05084large.jpg"}}