{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“ideal location”", "Author": "loubylou113", "ReviewID": "UR127401775", "Content": "had a three night stay at this hotel on our first trip to Berlin.The hotels location was ideal,most of the attractions were within twenty minute walk or if needed the metro station was only minutes away.We found the staff to be polite and helpful,we had booked a comfort room which should have had tea/coffee making facilities available but on arrival there there was nothing in the room,when we asked at reception this was soon rectified.The room was clean and comfortable and ideal if you just want somewhere to rest after a busy day sightseeing.we didnt have breakfast as like many others have commented its not a reasonable price.There are plenty of eating places nearby and we had lovely meals at the italian restaurant next door to the hotel and the indian restaurant about ten minutes walk away,both were reasonably priced and staff were pleasant.We found the area around the hotel ideal as prices for things were slightly cheaper than on the main tourist area.We would love to come back to Berlin as we had a great time,I would definately pick this hotel again as its location is great and because we booked it through laterooms it was a really good price.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Craiova, Romania", "Title": "“not the best experience...”", "Author": "Andreea O", "ReviewID": "UR126435081", "Content": "First off all I want to say that I am sure this is a great hotel but our experience was awful... The biggest problem is that when we checked in they gave us a key to a room and when we entered that room, there was somebody already there...imagine how embarrassing was that!! we didn't know how to get out of there sooner! at the reception...they gave us a very stupid explication and after quite a while we got another room near the sauna and the restaurant, which I am pretty sure it was a single room, because when we came in, the cleaning lady came and put another blanket on the bed...all night long you could hear this noise, like a motor which kept me awake and let's not talk about the pillows. Too bad for the bed, who was pretty great... The room was very small, and so was the bathroom sink, I kept on wetting my clothes while washing my face... For the mistake about the room we received a voucher for one drink at the hotel restaurant if we buy something to eat...one...not even two....and only if we eat there...the TV in not a plasma, it's an old TV...and you could hear it in the bathroom..... We had a fridge...wasn't quite working and the electric kettle was full of some kind of rust... As a good part, it is near a lot of Berlin's attractions and has a super market near and the internet was ok. Overall...it wasn't the best hotel that we could have chosen...and honestly the one thing that upset me the most was the attitude of the staff...", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good location and good value for money!”", "Author": "arcinicola", "ReviewID": "UR126355849", "Content": "We booked a lastminute room in this hotel for a night. We found the location very good, being close to many restaurants and bars. The price seems also very reasonable. On the bad sides: breakfast is very expensive, wifi and TV are not free of charge.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“An excellent hotel”", "Author": "victoriageras", "ReviewID": "UR122565893", "Content": "We stayed there for the New Years Eve. H2o hotel moved us there,due to overbooking on their hotel. It is an excellent location,just five minutes from Alexander platz Uban metro station. The room are beautiful,spacious for a couple and has everyday cleaning. While the hotel staff was trying to be helpful (apart from two certain employees that were awful), only two out of ten where perfect. The problem was that they didn't speak English quite well. But overall i would definitively stay again there,on my next visit.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great stay”", "Author": "DMC73_10", "ReviewID": "UR121548054", "Content": "On our trip to the Berlin Christmas markets we wanted somewhere central with decent facilities and this place fits the bill. VERY quiet and peaceful about 3/4 mile from Unter den Linden and close to rail links. Staff were very helpful - there had been a bit of confusion over which Ramada we were booked into and so we were given a complementary room upgrade which was a welcome surprise - very well appointed, multi-channel TV etc. Easy to access if travelling from Schonefeld airport, get off the train at Friedrichstrasse station and turn left for 500 metres. Nice bar for snacks etc and a truly monumental breakfast. Would definitely recommend and stay again.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“mature couple from dublin”", "Author": "martin h", "ReviewID": "UR121168745", "Content": "The Ramada Hotel berlin is a very centrally situated near all Transport links to all major sights and transport links to the Airports .The hotel is very clean the room we were in was a bit small but ok for a short stay the rooms are very well soundproofed there is a very busy road outside the hotel but you cant hear a sound in the room.The breakfast is a buffett type of breakfast it is \" Amazing \" the selection is fantastic nobody could fault it the serving staff are very attentive the only fault we could see was the breakfast room is a bit small it was very crowded when we were there late Nov 2011 over all a brilliant hotel well worth a visit", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“OK Hotel - Handy location”", "Author": "DRL01", "ReviewID": "UR120710578", "Content": "In a great location for exploring Berlin. Room small - small old style TV (no flat screen) dated decor. Nice enough bathroom. Bed quite comfortable, but the pillows are terrible. They seem OK until you place your head on them and they seem to all but disappear. Duvet on the bed was barely large enough to cover the bed itself. Breakfast was OK but at 15 euro, it was expensive. Staff polite but not overly friendly. Generally good value for money, but we booked many months in advance as we were travelling to Europe from Australia and thus got a cheap rate.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, Scotland, United Kingdom", "Title": "“Very comfortable stay in Berlin City Centre”", "Author": "scotgirlxxx", "ReviewID": "UR120546242", "Content": "This time, we didnt want the ultra cheap option for an overnight stay in Berlin and opted for a bed-only hotel near Alexanderplatz, the Ramada Hotel in Karl Liebknecht Strasse 32. Very friendly staff, the hotel room was VERY quiet which we like. All the rooms have air conditioning, and the beds are very comfortable! We will go there again!!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“First time in Berlin”", "Author": "hmp_paddington", "ReviewID": "UR118427692", "Content": "I recently spent a few weeks in Berlin. This hotel is excellent value, great location, close to public transport or pleasant walk to many attractions. Reception staff really nice and helpful. Very good breakfast included in price. Prefered this hotel to more expensive one closer to the city centre. Higly recommended.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“Hotel building jointly shared with H10”", "Author": "Bader54", "ReviewID": "UR116838216", "Content": "Reasonably convenient to the centre of the city ,the Spree river and Hackischer market area.Rooms comfortable and clean bur don't expect any majestic views of the city given its location and post war block building mania.Have stayed in Berlin many times and would much prefer the Radisson Blu or Crown Plaza for their convenience.Taxis to Brandenbourg/Charlottenbourg are relatively cheap particularly if shared with others.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Excellent”", "Author": "MP-Copenhagen", "ReviewID": "UR116815549", "Content": "I stayed there for 3 days with a friend from Copenhagen and was very satisfied with the stay. The hotel does not look particularly idyllic from the outside, but residence was perfect. Good location in relation to both U-Bahn and the more central Berlin. Lovely comfy room with \"schön\" double bed and high-end bathroom. Friendly service both at the counter and the buffet breakfast. Cosy hotel bar with football shown both on film size projector and TV, still we did not spent much time there. Many nice details: free snacks, wellcome screen at the TV, sweets and water at the desk ... And - we could store our suitcases at the hotel the last day after check out until we had to leave in the evening to the airport. I can only recommend the hotel to both couples, singles and all who want to live close to city life in Berlin.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bonn, Germany", "Title": "“Great Location! Easy Access!”", "Author": "judy12345678", "ReviewID": "UR116456593", "Content": "Let me start with the positive aspects: The number one reason for staying at the Ramada is the central location. It's located three bus stops (bus 245) from the central station. The underground station that connects you to the rest of Berlin is only meters away. The rooms are comfortable, clean and quiet - yes quiet even though the hotel is on a busy street. The air-conditioning works well and the windows block noise from the street. Lots of variety at the breakfast buffet. The hotel has a good bar and restaurant. The menu is not extensive but the prices were moderate and the food was good. The only real negative was that we had to worry about whether or not we would get a table to ourselves at breakfast although breakfast is served from 6:30 till 10:30. The dining area was always crowded and the personnel did not always clean up after their guests quickly enough to accommodate others who were just coming to eat. It was only at breakfast that you felt you were sharing the hotel with others! All in all we liked staying in the hotel because of the location. The rooms were a bit small, but were comfortably furnished and had a ridiculous number of lamps to provide lighting in every corner, if desired. Our daughter had a coffee-maker and a mini-bar in her room, which I made use of.", "Date": "August 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Decidedly average”", "Author": "chris036", "ReviewID": "UR109453782", "Content": "Booked this one on the back of positive reviews but have to admit to being a little disappointed. Positives include welcoming staff, outstanding breakfast options, tea & coffee in room, quieter location and free internet kiosk in lobby. My disappointment came when I used the bed, which was firm and cheap. Having no free wifi included in the room was a surprise, and the location, although quiet, is too far out of the way for convenience. There is a metro station close by, but you'll nearly always need to change trains at least once, and during winter months takes up too much time. The area outside the hotel was also a bit of a building site at the time of staying and not a pleasant area to walk - naturally this has nothing to do with the hotel, just an advisory. An average stay for me, but not one I'll return to.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Average Hotel”", "Author": "CraigSLondon", "ReviewID": "UR108166382", "Content": "located a bit off the beaten track especially in winter. service not the best i have had from ramada hotels , but then again that is the service level average around berlin . thought that service might have been better considering the travel trade fair ITB event was on and a lot of us from the travel industry where staying there.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Teignmouth, United Kingdom", "Title": "“A Good Choice”", "Author": "CSPET", "ReviewID": "UR98764548", "Content": "I stayed in this hotel for four nights, it is reasonably well located, close to tram stops and a short walk to the center of Berlin. You might choose something slightly closer to the center if you were looking to explore the whole city though. The breakfast is excellent, with a lot of variety, fresh fruit, cereal, eggs, bacon, yogurt, meats breads etc etc. The staff, were pleasant, well presented and were very professional. The rooms are slight let down, they akin to something like an Ibis (in the UK), they look a little dated and are fairly basic in presentation. I'm not sure if the bathrooms were renovated separately but they are very good. It is almost like you're in a different hotel when you are in the bathroom when you compare it with the bedrooms! There is wireless available but it is not free. There is wired access in the room but in my room it was so painfully slow that it couldn't even maintain a Skype conversation. My colleague traveling with me said his connection was fine, so I may have just been unlucky. The fitness center is below par, no weights or treadmill just a cross trainer and recline bike along with a sauna. All in all it is a decent no frills hotel which I would recommend.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Budapest, Hungary", "Title": "“need to be rennovate”", "Author": "dennis37139", "ReviewID": "UR95890399", "Content": "old stile, with old small room still old 15\" TV and not wi-fi avaiable (for free) Free cable internet in the room breackfast ok", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“No frills hotel. Great location.”", "Author": "Swissmex", "ReviewID": "UR90527087", "Content": "This hotel is perfect if you are looking for location, but have a look around as there are other options in the vicinity, which can be of better price. What I paid, even through one of those discount websites, was nothing fantastic. The rooms are ok, nothing special, but comfortable indeed. There is no charm whatsoever, but if you are looking for a good place to sleep, well located, this is fine.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Stayed here for 2 nights, good central...”", "Author": "Big_Pebbles", "ReviewID": "UR82107355", "Content": "Stayed here for 2 nights, good central location but expensive for what you get especially compared to their sister hotels. Room was available early which was good. Room wasn't large although did have a safe and mini bar. Requested a room change as booked a double and given a twin. €248 for both nights, room only. Didn't bother with breakfast, bakery across the street and numerous restaurants if you turn right and left at first or second set of traffic lights. Lifts to all floor. Bar on ground floor although not cheap. Reception staff reasonably helpful. Nice wet room in room. We were main road side though. Would find a different hotel if to stay in Berlin again as nothing special for the amount paid.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brighton", "Title": "“Great stay”", "Author": "brighton_chloe", "ReviewID": "UR52629041", "Content": "This hotel met our needs perfectly. The location is so convenient, walkable to many of the places you may want to visit, such as the Reichstag/Brandenburg Gate, U-Bahn stops 2mins away, plenty of tram/bus options too. Room was very clean, warm, stylish bathroom, quiet at night too. Breakfast was expensive so we popped to the supermarket next door, which has a bakery, for croissants etc. Staff were polite and helpful. We got a good deal on the price so was excellent value and overall an excellent stay.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Clean, modern, hotel with very good breakfast”", "Author": "DougToronto", "ReviewID": "UR51580593", "Content": "The Ramada Mitte Berlin is located fairly close to so many historical sites plus it is on the U-Bahn (subway) route plus is very close to the German train system at Friedrichstrasse near Unter den Linden. I always stay here while in Berlin. The rates are reasonable and the rooms are always very clean and are modern. The buffet breakfast is very good and the staff are always quite friendly and helpful. It is an excellent moderate-priced hotel. For those interested in WW2 history, so much can be visited within walking or U-Bahn distances.", "Date": "December 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“nice modern hotel”", "Author": "jovertigo", "ReviewID": "UR49011587", "Content": "Nice little hotel with a great price/value ratio. the rooms are modern, seems that the hotel is quiet new! nice bathroom, small but beautiful room. friendly service, location is okay.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ghent, Belgium", "Title": "“Good hotel with excellent transportation facilities nearby.”", "Author": "Fred09", "ReviewID": "UR23295997", "Content": "Ramada Hotel Mitte is a basic, but decent hotel. Rooms are not that big and rather dull. You won't find extras as a minibar or internet access, but the rooms are tidy and housekeeping is fine. The breakfast buffet was included in our rooms rate, but we judged it to be above average and service was friendly. The hotel is not located in the nicest street of Berlin, but thanks to the underground and tram stations just outside the hotel door, connection to the city is great. Unter den Linden for example takes not more than 2 minutes in the \"U-Bahn' and you have a train every 5 minutes. If you're planning on visiting the (great!) city, this is a good place to stay. If you want to camp in your hotel room, look for something more luxurious. To summarize, we would recommend this hotel as one worth its price, in the three to four stars rated segment.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "shanghai", "Title": "“Best Location”", "Author": "shouxf", "ReviewID": "UR18501299", "Content": "Best location. A U-barn6 station nearby , only 15 meters, directly reach the center of Berlin, Pergamon museum and Check Point Charlie. Internet access is available through T-mobile WI-FI network. It will take 10 min by taxi from the central station (Haufbahnhauf) to this hotel, and one hour by U-bahn and bus from this hotel to Tegel airport.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Good location, clean and comfortable”", "Author": "NYNY2000", "ReviewID": "UR15967704", "Content": "This hotel is a very short walk to the U-bahn (underground). There is a supermarket next door. If you like to walk it's fairly close to the cafes, shops and art galleries in Mitte. The hotel was very clean and the staff were helpful, though they rarely smiled and seemed a bit unapproachable, but if you can get passed that they can be helpful. The room was nice and comfortable though not a luxury hotel (no robe, shower not bath, very small TV not flat screen, decorations were tasteful but nothing to remember, and the room was a little small though not cramped.) Room had minibar, hairdryer, temperature control, nice big leather chair, desk, and comfortable (but not amazing) bed, and it was quiet. For the price and location it's a decent choice. It was also very clean!", "Date": "May 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Excellent hotel”", "Author": "Mike_Devon", "ReviewID": "UR10016124", "Content": "Excellent hotel within easy walking distance of the sity centre. Friendly efficient staff. Only drawback is that the bar and restaurant are overpriced - plenty of bars etc within a short walking distance and cheaper.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Modern comfort in Berlin”", "Author": "JohnGrease", "ReviewID": "UR8085403", "Content": "The Berlin Ramada Inn Mitte is a modern hotel with spacious rooms and helpful staff. The only problem was in regards to the air conditioning - it was humid and uncomfortable, but since the temperature wasn't high, the gentleman at the desk informed me that it was off. We had to open the windows to get some kind of circulation. Still, a good place to stay - near the U-Bahn (about 150m away from Zinnowitzer Strasse) and bus and tram stops. Worth a try.", "Date": "July 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pennsylvania", "Title": "“Quality through and through”", "Author": "HandballYaz", "ReviewID": "UR6789371", "Content": "Sorry for the delay in writing this. We stayed there in Jan 2006 for 4 nights. The hotel is located maybe 100m from an S-bahn station which is very convenient for getting around town. There are a few bars and at least 1 restaurant within a 15 minute walk; in fact, there was a really great lounge that we went to that never seemed to close and we could walk home afterwards. There was also a below ground south american themed bar which, even at 3 am on a Wednesday, was going strong. The staff were friendly and spoke fluent English. The hotel itself is modern with clean rooms. Our double room (1 double bed) was bigger than the ususal European double room, was nicely appointed with furniture. We could easily open our suitcase on the floor. The bathroom was also very clean with the added convenience of having a speaker connected to the TV right next to the shower. There were plenty of fresh towels and soaps. The hotel also had a somewhat pricey bar which was nice for pre-dinner drinks. So, a fine, clean hotel in a good location. I'd stay there again.", "Date": "February 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "scotland", "Title": "“fantastic hotel”", "Author": "beach10", "ReviewID": "UR6719894", "Content": "stayed for 3 nights and on arrival got upgraded to superior room without even asking. Hotel is comfortable, clean and modern. very central in east berlin , you can walk to many sites or use the trams which pass by or the u bahn just up the street. Lots of bars, restaurants and shops in this area. would definately stay here again.", "Date": "January 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Germany", "Title": "“Loved the Attentiveness of Staff”", "Author": "jetjam", "ReviewID": "UR6457154", "Content": "We stayed at this hotel on Thanksgiving weekend. We currently live in Germany but hasn't visited Berlin, so we just jumped at the cheapest deal we could get for that weekend. Although we had some other choices for the hotel, since I'm pretty much familiar with this hotel chain, we chose Ramada Hotel Berlin Mitte. I found the hotel to be very modern...not quite to my liking though. But don't think I wasn't satisfied!! I was very satisfied. The rooms are full of amenities, loved the walk-in shower closet. And of course, the safe. I particularly loved the attentiveness of the staff towards my child. If you're a parent and you see that the staff pay extra attention to your child, you'll overlook any not-so-good things. The breakfast they serve is fresh, so, no reason to leave with an empty stomach. :) The location is also very convenient since it's along Friedrichstrasse. You'll find a lot of tourist spots if you just walk along the stretch of the street going towards Unter Den Linden. Checkpoint Charlie is also along this street.", "Date": "December 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Great location and great bathrooms!”", "Author": "Nicf78", "ReviewID": "UR5834127", "Content": "Stayed at this hotel for a long weekend and was impressed by the modern rooms and convenient location. The rooms are not huge but have all the amenities you should need whilst the bathrooms are extremely modern with fantastic walk in/wet room showers. Breakfast was included in our deal and we found it to have a wide selection of choices, very attentive staff and conveniently be open until 10.30am. Perfect if you are a late riser like me! The U-Bahn is within 100m of the hotel and connects straight into central berlin in a matter of minutes. If you prefer to walk it takes only 10-15 mins to reach the Unter den Linden along a road which has loads of great bars and restaurants to try out. All in all a great hotel which I would definitely visit again.", "Date": "September 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Napoli", "Title": "“Ramada Hotel Berlin Mitte : a hotel where I would go again”", "Author": "GSNA", "ReviewID": "UR5708673", "Content": "I stayed at Ramada Mitte for 3 days, since august 6th, 2006. Nice Hotel and nice room, not very far from all Berlin attractions. Very well served by tram and U-bahn. Public transport in Berlin is great. If you go around a lot buy a day ticket. Room very clean and quiet. Only problem can be the small wardrobe, but I was alone and it was fine for me. Quiet residential area. Payed 70,00 euros per night, double room/single use. No breakfast. I think they charge 15,00. Just opposite the hotel there is a backery where you can have breakfast for 3,00 euros. Many other chances around. The hotel has a good restaurant and air conditioning in every room, VERY important if you are in Berlin during a hot summer. I chose this hotel after looking around a lot and I would go there again. No doubt.", "Date": "August 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Very Good Hotel”", "Author": "SaraRH", "ReviewID": "UR4100819", "Content": "Great hotel and great value for money: € 70 for a twin room, without breakfast. By the way: don't pay € 15 for the hotel one: there's plenty of nice cafe and bakery around that serve very good (and much cheaper) breakfast. Good location: close to the underground, there are many good restaurants and lounge bar where you can go in the evening. If I come back to Berlin, I'd definitely use this hotel again.", "Date": "November 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Accrington, United Kingdom", "Title": "“Fantastic!”", "Author": "gillyblue25", "ReviewID": "UR3639118", "Content": "We stayed in the Ramada Hotel in July 2004 and its a fantastic hotel! Very modern and comfortable with excellent facilities and very helpful staff. I think the hotel must have gone through a recent re-furb as everything was of very high and modern standard. Our room was very comfortable stocked with a reasonable minibar. The bathroom was great - glass wash basin and \"wet room\" shower. Breakfast was amazing, if you're like me and a lover of food, you can't complain about the choice on offer. Far better than other continental hotels that only offer cold meats and bread! Here you can have anything you like! And as much as you wish! The location was great too, in the Mitte area, where there are pleanty of funky bars and restaurants. Check out the Spar food market next door to the hotel, where we bought cheap bottles of beer and wine and stored them in our minibar fridge!!!!! Can't wait to go back to this hotel - I recommend it highly!", "Date": "July 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, UK", "Title": "“Great stay!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2617889", "Content": "We stayed at the Ramada prior to running the Berlin marathon last month and the hotel was excellent. The rooms weren't huge but were very modern and clean and the staff were great. We definitely recommend it, the best bit was we only paid about £50 per night (between us for a double room) through Priceline. And the breakfast (€15 each) was excellent too.", "Date": "October 4, 2004"}], "HotelInfo": {"Name": "Ramada Hotel Berlin-Mitte", "HotelURL": "/ShowUserReviews-g187323-d275412-Reviews-Ramada_Hotel_Berlin_Mitte-Berlin.html", "Price": "$93 - $211*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Chausseestrasse 118-120</span>, <span class=\"locality\"><span property=\"v:postal-code\">10115</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "275412", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/37/09/71/eingang-hausfront-hotel.jpg"}}