{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Asuncion, Paraguay", "Title": "“inlovewithit... :-) perfec location for highend shopping plus great little charming rest. around”", "Author": "DejandoHuellas", "ReviewID": "UR127326092", "Content": "Inlovewithit :-) perfect location for brand shopping (that means great for the ladies. , bad for husband's & bf's. ) hotel staff , great. Room recently renovate and very clean.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waunakee", "Title": "“Excellent location and staff!”", "Author": "Lori M", "ReviewID": "UR126928383", "Content": "We stayed for six nights in the junior suite on the top floor. It was lovely. Our balcony was so nice. We loved the location and all of the staff were very sweet. Breakfast was good, but not great (included). We would definitely recommend this hotel!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Wonderful Little Corner of Rome”", "Author": "Mattsaab", "ReviewID": "UR124205937", "Content": "This charming little collection of non-luxury rooms was surprisingly wonderful, quiet at night and ideally situated as a fantastic bse in Rome. You stay at La Lumiere when you want to save money but still be in the best part of Rome. The staff was freindly, helpful and easy going. The corner room was spacious, clean and charming. The view of the rooftops was loud in the day and quiet at night. Breakfast is served on a sun porch atop this pension and is nothing spectacular, but just fine to start the day. If I wanted to save money and not regret the whole time I wasn't someplace else, I would stay here again--and would. Rome is a musical place and La Lumiere is part of the opera.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Fabulous!”", "Author": "susanpradja", "ReviewID": "UR119638886", "Content": "I quite surprised to read many bad reviews about this hotel. For me, this hotel even deserve at least top 20% best hotel in Rome. I always choose a hotel in the heart of the city and close to the metro (since I don't want to waste money on taxi). This hotel is located very close to the Piazza di Spagna metro stop and the Spanish steps, which always crowded with tourists and make you feel safe. This hotel is surrounding with high-end shops like Tods in the right side and Furla in front of it. I love every alley in this area. The hotel is cute and beautiful, the pictures in the website really describe it. We came quite late at night, but we got a very smooth checked in. The staff was friendly and gave us information about all interesting places to visit in Rome. The room is fabulous. The bathroom is very clean and has a jacuzzi!!! It's really nice to have a hot-jacuzzi after a long day walk around the city. The breakfast is okay, nothing's really special but I love the terrace on top of the building overlooks the city. This hotel is highly recommended.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Excellent location, wonderful staff ... but”", "Author": "ylw_fr", "ReviewID": "UR118944191", "Content": "The location couldn't be better, nor the staff kinder or more helpful, but \"the devil is in the details\". Although the bed was comfortable, the reading lights were next to useless - at least for our \"old\" eyes. Whereas the room was more than adequate as a \"bedroom\", it was far too small for us to meet with our friends (also staying in the hotel) to chat. There is no place that could accommodate four people to just \"hang out\" for a while. The fifth floor room where breakfast is served might perhaps be made available; or maybe the roof-top terrace could be a fitted out with a few chairs, at least during pleasant weather. The internet connection was very poor. In five days I had only two connections, despite the willing help of the charming Mauro at the reception desk. The soap was not replenished for several days, admittedly a detail. On the other hand, towels were changed daily, despite the \"environmental cost\". (We find it quite acceptable to be asked to leave towels on the floor when we want them replaced - and otherwise to use them for more than one day.) The location and the staff made up for a lot of these small inconveniences; yet some, at least, could be corrected without a great deal of effort.", "Date": "October 4, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Woodinville, Washington", "Title": "“DO NOT STAY AT THIS HOTEL”", "Author": "Kathy A", "ReviewID": "UR117155408", "Content": "UNSAFE!!!! This hotel locks the door whenever the one person at the front desk has to leave for any reason. Imagine how we felt when we found ourselves locked inside the hotel and then told that they had to lock the door whenever the desk was unattended. UNFAIR !!!!!! This hotel DOES NOT HONOR it's WRITTEN cancellation policy and charged us for 2 nights when the policy was clearly stated that one night's cancellation would be charged.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Location, Location, Location”", "Author": "stir-gently", "ReviewID": "UR116851720", "Content": "Hotel la Lumiere is a small hotel tucked around the corner from the Via Condotti, a few blocks along from the Spanish steps. The location couldn't be better for walking in Rome, taking in the sites and the scenes. Although the rooms are small, they are comfortable and decorated in an Italianate style. Breakfast is help-yourself continental style in the conservatory on the roof. The staff are friendly and helpful and speak English. We have stayed there twice and would not hesitate to return.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Saint Julian's, Malta", "Title": "“Great location at a super price for Rome”", "Author": "foodie978", "ReviewID": "UR116252209", "Content": "This hotel is situated right in the heart of the action, it is surrounded by all the best shops, the famous Spanish Steps and is within walking distance to all the main sights and restaurants, bars etc ... we got a great deal from booking.com circa €120 per night inc breakfast which is fantastic for Rome especially considering its location ... The hotel itself is really cute, cosy and typical Rome classic style hotel. I would definitely recommend it to anyone who is in Rome to shop or enjoy the food and the sights.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location ... and not much else”", "Author": "ASR2009", "ReviewID": "UR115281643", "Content": "Fantastic location, next to the Spanish steps and high-end shops. Easy access to the major sites. Several little restaurants and cafes in the area give the area a quaint charm. The hotel however is very basic - no porters to carry up the luggage, no room service, no restaurants ... A basic breakfast is served and that's about it. The room's small but kept spotless by a single all-purpose lady (hats off to her).", "Date": "July 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Garden City, New York", "Title": "“A wonderful hotel in a perfect location”", "Author": "lyanna501", "ReviewID": "UR84378135", "Content": "The Lumiere di Piazza di Spagna was a small hotel with lots of charm. The hotel is situated near the Spanish Steps and is in walking distance of many great restaurants, shopping and activities. The hotel served a wonderful European style breakfast in a sunlit roof top dining room. The staff was wonderful and connected us with a wonderful guide to take us to the Colleseum, Forum and St. Peter's Basilica.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“La Lumiere, little hidden treasure!”", "Author": "travelchild39", "ReviewID": "UR64963949", "Content": "I recently stayed at La Lumiere during a business/leisure trip to Rome. I was so very pleased with La Lumiere.. after seeing few pleasant reveiws on trip advisor I was initially hesitant, but this hotel turned out to be one of the best hotels that I exerienced during my 3 week sojourn through Europe. Lu Lumiere set a wonderful tone and high standard in all important travel areas. Location, Staff, Room Comfort, Staff and Cost 1)Location.. the hotel is literally a stone's through to The Piazza di Spagna, wonderful shops of all sorts from Gucci and Prada to local neighborhood shops where you can have a great gelato or buy local wines and othe goods. 2) The staff was amazing especially Letizia. They staff was always pleasant and extremely helpful. Within a day of booking my hotel they sent me a welcome email and began corresponding regularly with me regarding my trip and potential needs. They arranged a driver from the airport who although my flight was nearly 4 hours late.. was patiently there waiting with a personalized name placard when I arrived. When I saw the Coliseum I gasped! It was so amazing to actually see it and the driver who recognized my response pulled off and offered to take a picture with me in front. I will always treasure this first picture which began my experience in Rome! I left my translator book in the car and the driver returned 2 hours later to return it to me! The hotel itself provided me with excellent point to point directions to my business site locations and to every other venue that I desired to explore.. all of which were in walking distance of the hotel. If you are up for it, there is no venue that you cannot either walk or easily train to. The rooms are in the traditional Itlaian style and very welll kept. The rooms are clean and the breakfast area is very lovely atop the buiding. My linens were comfortable and crispy. The Jacuzzi shower was a plus at the end of the long day.. and the room was spacious enough and very relaxing. I believe the room was worth every euro and would stay there again, especially in the room with the small terrace, which was great for relaxing after a long day in Rome. The LaLumiere Hotel is a little hidden treasure. I am so happy to have found it. I think you too will be pleased.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Knoxville, TN USA", "Title": "“Location is excellent, Hotel comfortable but worn”", "Author": "TangoDuo", "ReviewID": "UR50899110", "Content": "Can't beat this location for general an overall Roman visit. Many things are within walking distance and the subway is nearby. Hotel was also very good at getting us a taxi that was safe and fair. After cutting the meter off, one taxi tried to demand more than as was appropriate and the hotel owner had a few words with him on our behalf and we paid less that what he demanded. Staff recommendations and directions were on very accurate and it was easy to communicate with everyone at the front desk. The entire staff were friendly. The beds were very comfortable but the baths were a bit cramped but serviceable. Breakfast in the hotel was very good and on three occasions, the staff even fixed us a free box of snacks when a morning trip started before the breakfast area was open. Only issue was that that the rooms were dusty and needed a little better attention to detail in the cleaning.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Whittier. CA", "Title": "“Pass On This Hotel”", "Author": "Judy_1Whittier_CA", "ReviewID": "UR31244838", "Content": "There are much nicer hotels in this area for the same money. This property is extremely over priced for what it is. Be warned that if you do stay here - the beds are extremely uncomfortable. If they are full, you will find they have no extra pillows (2 per room total) no extra sheets - ours didn't get changed for the first 4 nights we were there. The refrigerator and TV in the room did not work. The breakfast is pitiful and only provided from 8-10:00 AM - you WILL be scolded if you show up late! We had the same dead fly on our bathroom floor for 5 nights. The day front desk staff is very nice and helpful, but the night staff is down right rude. The air conditioning does not get the room cool. It was basically a huge disappointment. I heard other guests at the front desk with the same complaints we had.", "Date": "May 31, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "NYC", "Title": "“it was adequate”", "Author": "arravale", "ReviewID": "UR20511942", "Content": "The hotel is located in a great area and because of being located on a pedestrian street it was QUIET. Which is rare in Rome. While the carpet thru-out the common halls could use a refurbish the rooms were spotless and the beds amazingly comfortable. Breakfast was adequate.... one thing that we would have liked is a lounge/bar-but this hotel does not have one The staff were pleasant enuf- the terrace featured on their website was closed and it looked like u needed to tackle what looked like fire escape stairs to get to it If u are looking for a good restaurant in the hood-check out Gusto", "Date": "September 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sunfish Lake, MN", "Title": "“Marginally OK for Rome”", "Author": "MacWilder", "ReviewID": "UR10138288", "Content": "Only 10 rooms in this conveniently located hotel: four each on the third and fourth floor and two on the fifth floor (Remember that in Europe the main floor is the Lobby, with the first floor one flight up.) Room 502 does offer a balcony. Its main (and perhaps only) favorable attribute is its location on the very upscale shopping street of Via del Condotti, only a few blocks from the Spanish Stairs and the Rome Metro. For internet fans, note that the real name of its self-proclaimed \"data port\" is \"telephone jack.\" The only internet available is dialup, and of course, to use even that, you'd have to subscribe to a service like worldwidedialup.com. (The hotel itself uses high speed internet, but it has chosen to not make this available to its customers). Don't expect to change large bills at the reception desk. This is not available. And do not expect help with manhandling your luggage into the tiny elevator, that too is not available. Breakfast is available, however. It consists of a choice of three cereals, some rolls, yogurt (sometimes banana was the only flavor available), and two or three other items including canned pineapple slices. The breakfast is serviceable, if not particularly enticing. The breakfast area was small, and a television set was usually blaring in that area. Do not expect to use the rooftop terrace pictured on it's website, as it is inaccessible in October, at least. Be forewarned. A new, upscale store is being constructed in the front part of the building, and the construction noise can begin at 7:00AM. Normally, one would avoid such a place. But we are talking about overcrowded, overpriced Rome. It could well be that, given the City's lousy hotel options, this is a pretty good choice.", "Date": "October 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Shoppers Paradise!”", "Author": "LuvSunshine23", "ReviewID": "UR8548752", "Content": "Great hotel for the value. Rooms are a good size, clean and nice. Its a small hotel with a TINY elevator that does not come to you if someone on another floor forgot to shut the door. I would not recommend for elderly or disabled because there is a chance you will have to use the stairs. The location is GREAT--especially if you like to SHOP! Tod's, Burberry, Gucci, LV, MaxMara, Ferragamo etc are all at your doorstep! We also walked to the major sites from here-- probably about a 20 min walk, not bad.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great Location”", "Author": "f13", "ReviewID": "UR8511914", "Content": "I stayed at La Lumiere di Piazza di Spagna for six nights (August 19-25) during my last leg of the trip. I was a little apprehensive because it was not highly ranked on the TA Forum. However, it was more than I expected. The staff was extremely helpful. The room was spacious enough for the two of us. The only thing was that the bathroom shower/jacuzzi was not a bit tight to get in. Also, there was leakage of water while taking a shower from the shower window so the floor would get wet. The bathroom definately needed a repair. However, the location was EXCELLENT and our view from the room was fantastic as we could see the Spanish Steps from our window. We had Furla on our left and Weitzman Stewart in front of us. It was great. We walked everywhere and the Spagna Metro was literally about a 3 minute walk. Could not have asked for a better location.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“3 out of 5”", "Author": "Tr0phyWife", "ReviewID": "UR8044668", "Content": "Excellent location a stone's throw from the Spanish Steps so really easy to get to all the famous sights and landmarks. The hotel was compact, the room (Junior Suite) was quite small but big enough for the two of us. The private terrace that accompanies it was lovely and if you lean over the edge you can see the Spanish Steps. My only gripe, and why I'm giving only 3 out of 5, was the service. As in there really wasn't any at all. I found the staff to be quite cold and not proactive at all. Note: there is no ironing facility in the hotel you have to have your clothes sent elsewhere. And if you fancy a glass of vino on your private terrace, borrow fruit juice glasses from the unlocked breakfast room as the hotel has no wine glasses.", "Date": "July 3, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "grossepointe", "Title": "“Great hotel and staff”", "Author": "gaf1950", "ReviewID": "UR7435049", "Content": "This small hotel is located within a couple of blocks of the Spanish Steps. As a result of the central location we were able to walk to all of the historic sites. This property is very well maintained and comfortable. The front desk staff were outstanding. They were very friendly and we appreciated the help they provided with scheduling day trips and dinner reservations. For a great meal try Ristorante Mario or Ristorante \"34\".", "Date": "April 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reston, VA", "Title": "“Great hotel with exceptional staff”", "Author": "brinsley22", "ReviewID": "UR6555391", "Content": "My boyfriend and I stayed here for 6 nights at Christmas and it was wonderful. The rooms are nice and we had a nice balcony. The breakfast room is beautiful and the food was good. The staff is exceptional. They really helped us out booking restaurants for Christmas Eve and Christmas dinner, all their suggestions were perfect. I had good response emailing them prior to our visit and we were able to reserve a car from the airport and our first nights (Christmas eve) dinner. This is a great location near the Spanish Steps and Spanga metro stop, although we walked to almost everything. The surrounding streets can get busy in the early evening but I couldn't hear any noise at night.", "Date": "January 5, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Connecticut", "Title": "“Outstanding location and concierge!”", "Author": "blessedtravelers", "ReviewID": "UR5907925", "Content": "My husband and I just returned from spending 5 days in Roma at this very nice hotel. The room was very pleasant, although the bathroom was somewhat small. The breakfasts were certainly adequate, but the much touted rooftop was closed. Most important to us, however, was the fine service rendered by the concierges at every opportunity. All our dinner reservations were happily made for us (including one for a future stop in Venice), and taxis telephoned, directions given, and Candy even went out of her way to purchase stamps and mail my postcards after working hours, returning every centime of change to me the next morning. The location could not be beat (we walked to virtually every single destination - forum, coliseum, Vatican, Borghese museum, etc.) and the assistance of the staff was impeccable. We would certainly stay here again and recommend it to travelers who don't have specific needs. As my husband is 65 and I am 64, we found no problems at all. Linda Dwyer, USA", "Date": "October 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cameron park, CA USA", "Title": "“Very nice location, staff and facilities”", "Author": "NRC1", "ReviewID": "UR5769271", "Content": "After a disappointing attempt at another hotel, my daughter called this hotel from her Frommer's. From the first call... the staff was very helpful and luckily had a room for us - on the spur of the moment. We hopped into a cab and had a fantastic time in Rome after what started out to be a problem. The front desk staff were so helpful with taxis, directions and anything we needed. The location is right down from the Spanish Steps,. off the Via Condotti and close to the Corso. Thumbs up !! Thank you !!", "Date": "September 4, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Venice", "Title": "“A Fabulous Small Hotel”", "Author": "Worryfree", "ReviewID": "UR5488646", "Content": "Perfectly situated on the corner of the trendy Via Condoti and Belsiana. Designer shops gallore and great restaurants. Very convenient to the ancient city sights and near the Metro. Very helpful, friendly staff. Comfortable room. Rooms are in the 3rd to 5th floors--the higher, the better to avoid street noise. Nice breakfast room. We will stay here again!", "Date": "July 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Warren, MI, USA", "Title": "“Great experience”", "Author": "swez1", "ReviewID": "UR5187359", "Content": "The location of this hotel is incredible. Great shopping all around and many of the sights are within a ten minute walk. The room was clean and the staff were very helpful and friendly. Even the continental breakfast was much better than at most hotels in the states. Overall a very nice hotel.", "Date": "May 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4020758", "Content": "This is a great boutique hotel w/out all the fuss. It's v. close to the Spanish Steps and all the fabulous stores. Our double was rather small but v. clean. All the rooms have hardwood floors. The breakfast was good but nothing outstanding. Oh and bring ear plugs if you want to keep your windows open at night. I would stay here again because of the location and the cleanliness. Oh and check out Gusto's for lunch or dinner. I had the best prosciutto e buffalo mozzarella there.", "Date": "October 13, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "NYC, NY", "Title": "“Pricey, Cozy, Enjoyable”", "Author": "A TripAdvisor Member", "ReviewID": "UR3692609", "Content": "You're paying a premium for this location, but what a location! If you're a city dweller, like this New Yorker, you won't find the street noise to be any worse than normal. The rooms are small by American standards but quite nice. There was a safe in our room and we used it to protect our valuables with no problems. We found the staff to be friendly and helpful, and it was great to be able to walk just about everywhere. The rooftop terrace for breakfast was a nice touch.", "Date": "July 22, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Germany", "Title": "“This Hotel is UNSECURE!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2173750", "Content": "We stayed two nights in this hotel. One the evening of the second day we went back to our room to get a sweater to go to dinner. I unlocked the door and went to my suitcase only to realize someone had gone through ALL of my baggage and replaced it all (sloppily refolded). It appears they tried on my wife's clothing! They even went as far as to unwrap gifts and rewrap them! I called my brother(also staying in the hotel) and told him to check his things. His watch was stolen. This was no 'break in', the person who went through our things had access to our room. When we told the owner(on the phone) she said she would come by in the morning to talk to us. After a long discussion as to what the hotel was going to do to rectify the matter, her husband said they were not responsible, called the police to have us escorted out of the hotel! DO NOT STAY AT THIS HOTEL!", "Date": "June 9, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2124434", "Content": "This hotel is in a perfect location; however, the downside to this location is the street noise one has to deal with from Via Condotti. But I guess you have to take the good with the bad. The rooms were very tastefully decorated; however, the bathrooms were extremely small. The shower was so tiny that an above average size person would not be able to close the door. Most of the staff was nice with the exception of one older guy who got drunk every night he worked. He cussed my husband out for us needing to send a fax back to the U.S. We tried to complain about it but were told that there's no direct manager for the hotel as it's managed by a management company. Yeah right!! That said, all in all it was an enjoyable stay, and we'd probably stay there again.", "Date": "May 27, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Portland", "Title": "“Good Location, but.....”", "Author": "PortlandSunseeker", "ReviewID": "UR1511713", "Content": "By far the best quality of this hotel is it location. Most attractions are within walking distance and a subway stop which links you to the airport and other sites is only a 2-3 minute stroll. The rooms are decorated nicely and are clean. However, the bathrooms are little small. There really is not a lot of personal attention at this property. Basically you check in and then you are on your own. Our room was very cold one night. We were told the heat in the hotel isn't turned on until the following week. Street noise is fairly prominent, but expected for the hotels prime location. Morning breakfast is served on a nice outdoor/indoor terrace with a partial view of the Spanish Steps. The food, however, was quite average. The only other real problem I had with this hotel is that at checkout I was forced to pay for my room in cash or be charged a 5% surcharge for using a credit card. I thought this was a very low class maneuver for a supposed 4-star establishment. Overall, I think there is hope for this hotel given its location and fairly well-appointed rooms, but some personnel and policy changes are needed to make guests feel more at home.", "Date": "December 10, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“Wonderful stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR1401451", "Content": "My husband and I stayed at La Lumiere in March of 2003. Not only did we find the hotel beautifully decorated and very clean, but found the staff to be especially helpful with directions, suggestions and arrangements for departure to the airport. It's location is absoulutley perfect for ease of access to many different areas of Rome for sightseeing but also for night time dining and strolls. We did hear some street noise as a low hum (like white noise) but when we're in Italy we consider it part of the experience. Nonetheless we were able to sleep there for three nights so well so that each day we walked the whole of Rome and never took a taxi, bus or metro anywhere we went. We would highly recommend it!", "Date": "October 22, 2003"}], "HotelInfo": {"Name": "La Lumiere di Piazza di Spagna", "HotelURL": "/ShowUserReviews-g187791-d275769-Reviews-La_Lumiere_di_Piazza_di_Spagna-Rome_Lazio.html", "Price": "$171 - $341*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">via Belsiana, 72</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "275769", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/91/6d/916db3be547a5457fb63bdf2038c0c7d14large.jpg"}}