{"Reviews": [{"Content": "Rural idyll on the outskirts of Florence On arriving at I Parigi we were warmly welcomed and helped with useful information. Tickets for the Uffizi were booked for us, we were sold a pack of bus tickets to get us in and out of Florence on the frequent buses from the bottom of the lane.We were given good recommendations for restaurants within walking distance (la Bianchina has good food and is really friendly) . The setting is beautiful and the views of rural Tuscany wonderful after a day spent looking at frescos and climbing towers. The rooms are clean and comfortable including a kettle and sachets of tea and coffee. There is a common room with internet access and lots of info on Tuscany. The breakfast loggia in the garden is very pleasant, and the breakfast excellent.  We found that it took us 10 minutes to walk down the hill and 15 minutes back up, We had a torch so that drivers could see us. In a car the best thing if arriving from the autostrada is to drive past, turn just down the road near the entrance to the monastery and come back to the lane.The gardens are lovely and we relaxed by the swimming pool, but, at the end of September, only stayed in the water for a short time.", "Date": "Sep 29, 2008", "ReviewID": "UR748587810", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Margaret_&_Andrew"}, {"Content": "Fabulous Little Gem!!!! We stayed at I Parigi from Thurs 26th June to Mon 30th June, it was absoloutely amazing! Gorgeous surroundings, views were magical! The pool was lovely and the breakfast was more than enough, eggs, cereals and lots of juices, teas, coffees to choose from, the breakfast area was in the gardens where the view was amazing! Taxi would come and pick u up within 10 mins, you have to ring them 10/15 min before you are going out, cost to get into the city was around 15 euros before midnight and around 20 after, not bad really. Our room was cleaned everyday and were given clean towels, would most definately go back! XX (-:", "Date": "Jul 1, 2008", "ReviewID": "UR285272607", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "misbibs"}, {"Content": "Idyllic (Not Central) Location       Room - Bed", "Date": "Oct 17, 2007", "ReviewID": "UR841065955", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "5", "Location": "2"}, "Author": "TTwo"}, {"Content": "An excellent antidote to the bustle of Florence! I highly recommend I Parigi for anyone who is visiting Florence and the surrounding countryside and wants to fit a little down time into the schedule. A 5-10 minute drive from the Porta Romana of Florence, I Parigi is a refuge from the noise and crowds of the city. Set on a hill, it provides a fabulous view of olive trees, cypresses, and the types of buildings you go to Tuscany to see. Like another reviewer said, you arrive wondering if it can live up to the photos, and it does that and more.The proprietors are friendly and helpful (but not the warm, fuzzy type -- if you want to be welcomed into someone's home and treated like family, this is not the place for you.) Unlike most of the places in a similar price range, they have a pool (!) and offer internet access for 3 euros an hour. Our only problem was finding the place. We were misled by a small road sign that we thought indicated we should turn at a place where we shouldn't have turned. According to one of the proprieters, that sign says 1 km at the bottom, but that part must have been overgrown with roadside brush. :-) Anyway, about 40 minutes of circling through small communities and a couple phone calls to I Parigi, we finally arrived and were very glad we had. If I returned here, I would make sure I had more time to stay on the grounds and enjoy!", "Date": "Sep 26, 2007", "ReviewID": "UR692776546", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "MadNil"}, {"Content": "A charming little gem Thank you Marco and staff at I Parigi for a wonderful stay! Although tricky to find - it is well worth the extra few minutes of driving . We spent a week at the hotel - it wasn't our intention to stay in Florence so long, however we loved the hotel so decided to keep it as a base to tour the back roads of Tuscany as well as relax after several frenetic days in Florence. The rooms are immaculate and the setting is beautiful. It was nice to come home to the quiet gardens and the smell of rose, lavender, and rosemary. Marco is a gracious host - most helpful with directions and information. We spent three weeks in Italy, and stayed in hotels that were much more expensive, but found none that matched the charm of I Parigi. Every guest that we spoke to at breakfast were, like us, congratulating themselves at finding such a lovely hotel.Thank you again Marco- we look forward to visiting again!", "Date": "Jun 16, 2007", "ReviewID": "UR622431885", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "sueycat"}, {"Content": "Incredible bed and breakfast This has got to be the best place to stay if you're visiting Florence. It is set on a hill overlooking the city on a peaceful country hill, yet you are a short walk from a bus stop that goes right into the centre of town.The bb is run by the charming and helpful Marco, who brims with advice and runs a shuttle service into the city every morning at 9h15.There is internet access, a lovely pool area, beautiful gardens dotted with cyprus and a lovely breakfast and lounge area.The rooms are pretty and romantic.", "Date": "May 13, 2007", "ReviewID": "UR400863316", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "5"}, "Author": "Lucy_Lake"}, {"Content": "fabulous b i LOVE I parigi and cant wait to return! its so beautiful and affordable and special. its a little bit outside of Florence, which is a little inconvenient but there's a bus that runs rather frequently. its also the kind of place you want to have a little down time to ENJOY and relax in. i wish i had more down time while i was there, but i was very busy seeing everything in Florence. if its your first visit to florence, id suggest doing what i did - start out in a more central location in the actual city and then move to I Parigi. again, its totally worth the slight hassle of having to take the bus into town, but you wont necessarily run back to your hotel room midday during a day of touring. still, its now one of my favorite places. i cant wait to go back. its just really unique and lovely and authentic! Im sure when the weather is nice (it was a little rainy and cold and i still loved it) its unbelievable!", "Date": "Nov 28, 2006", "ReviewID": "UR636594637", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "italylisa"}, {"Content": "Wonderful Florence Suburb Hotel Quality hotel (BB) with very nice brother-owners who will assist you in any way they can. Upon the suggestion of our friends who happened to live down the road, I stayed there with my two boys and had a wonderful time. We had a very large room with lots of space to spread out. The grounds were beautiful and the breakfasts were plentiful. Florence is only a 20 minute bus ride from the bus stop just down the road. I would definitely recommend I Parigi to anyone who does not want to stay in the city of Florence but just on the outskirts.", "Date": "Jul 22, 2006", "ReviewID": "UR551492636", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Steiny"}, {"Content": "Florence with kids - this is the place We stayed here for two nights with two small kids, and had great time. It's more a BB than a hotel, and the rooms are nice, but not luxurious in any way. But the place is so nice. The garden and pool area has excellent views over the valley, and the atmosphere is quiet and relaxed. The breakfast in the garden is nice. We stayed in the apartment, with a small kitchen, which allowed us to cook dinner and eat on our private terrasse. It's a 15 min. drive to Florence, but I would never go anywhere else with kids. The owners make a decent red wine by the way...", "Date": "Jul 1, 2006", "ReviewID": "UR523147218", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "Il_Tempo_Gigante"}, {"Content": "Great place to stay We spent only one night at the Parigi and we found this place excellent.The room was spacious and very comfortable with a clean bathroom.The panorama from our room was breathtaking.The area was amazing out of the noise of the city.Buffet breakfast was ok.Very easy to reach driving from Venice.We recommend this place to everyone.", "Date": "Feb 10, 2006", "ReviewID": "UR608208504", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Porcodue"}, {"Content": "I Parigi is marvellous We spent 4 nights at I Parigi. Whilst the weather was poor, so we couldn't take advantage of the pool or outdoor areas, the accommodation was great. There are about 10 rooms set in a rustic (but enormous) stone house overlooking the hills of Florence. The rooms are comfortably furnished -- very clean but by no means glamorous -- and the staff are very accommodating and helpful. Both the owners speak English well which aided us understanding their advice on activities in Florence. The views from the grounds and some of the rooms are just spectacular -- picture postcard like. Whilst it is a fair distance out of Florence (about 20 minutes drive), we found it worked well for us -- we caught the complimentatry 9.15 shuttle every morning and then the bus back of an afternoon which stopped at the bottom of a (very steep!!) hill. The buses run every 30 mins or so and we never had trouble getting one. The tickets are 1 Euro. At night, if we didn't feel like going back into Florence for dinner, we went to the little restaurants in the surrounding villages which were good too. Contrary to one of the entries on this site re breakfast, we found it fantastic -- good croiasants and bread, cereals, fruit juices, nice jams etc. The coffee (Americano or espresso) was excellent. One tip -- spend the 20 Euro on a taxi from Florence when you arrive and depart -- catching the public bus with luggage and then carting it up that hill is just too much. In summary, I would highly recommend this venue -- of our 6 weeks in Europe in many hotels, I think this was the best place we stayed in.", "Date": "Nov 14, 2005", "ReviewID": "UR516418837", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "heaven in Florence AAAHHH! What a nice escape from the Hustle and Bustle of Florence!! Gorgeous Atmosphere and accomodations. We Can't wait to return!!", "Date": "Oct 10, 2005", "ReviewID": "UR472985364", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "What a Wonderful Place!! WOW! What a gorgeous place to stay for our honeymoon! I believe this was a house from the 15th century that the family has converted into a bed and breakfast very recently. Because of that, the rooms are large, new, and very modern. We received a nice big bed, a small table with two chairs, satellite tv, plus more. What a view of the Tuscan countryside. Breakfast was in the back where they had fresh warm croissants and bread, cereal, a variety of juices, teas, and coffee. We had breakfast while enjoying the view of the garden with large trees and flowers scattered throughout. The staff is extremely friendly. Marco is so very helpful and so gracious. He provided us with loads of information and tries to help us in any way possible. On our last day there, he drove us to the train station himself when the taxi failed to show. When we come back to Tuscany, this is where we will come.", "Date": "Sep 26, 2005", "ReviewID": "UR179670890", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wonderful I Parigi is one of those places that you hope to be as good as the pictures... it was better! Our room [#8] was very spacious, wonderfully decorated, and air conditioned [not to be taken for granted in Italy]. The location is very convenient for quick trips into Florence. Marco [one of the proprietors] even offered a daily free shuttle into the Pitti Palace area. The pool, which is much more beautiful than the pictures, was a much deserved place of relaxation and tranquility after the mob scene in Florence during the summer. Breakfast [included if you ask for it] is not very good at all, however, so plan on finding a good place for coffee and food elsewhere.", "Date": "Jul 25, 2005", "ReviewID": "UR270833344", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "rosegarden2"}, {"Content": "A Tuscan Gem We just got back from two weeks in Italy and spent two nights at I Parigi. It was a magnificent property with glorious vistas, and a wonderful alternative to staying in the expensive centre of Florence. It was close enough to Florence to make it convenient yet far enough away to feel we were experiencing the Tuscan countryside as well. Our family of four was very comfortable in the spacious accomodations. We had an apartment on the main level with a deck area. The breakfast was good, we enjoyed warm croissants and had the best cafe americano of our trip while there. The staff was very accomodating in every way. Marco and the staff even prepared excellent pasta dishes at a very reasonable cost which made it worth staying on the property if we wanted a light meal. The turn from the main road is very sharp and the road is very narrow so be prepared. The bus is a great way to get to Florence but walking up that hill at the end of a visit to the centre would be brutal. If you choose to drive in there are limited tourist parking spaces close by but you can park at the train station. Be prepared to pay however. It cost us 19 Euro for about 6 hours.I Parigi is a wonderful hidden treasure.", "Date": "Aug 19, 2004", "ReviewID": "UR678993522", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Perfect I Parigi We just returned from our honeymoon in Northern Italy and in a phenomenal two-week trip that included Cinque Terre, Tuscany, and Venice, I Parigi was undoubtedly the highlight. It is just a perfect, peaceful, magical place. The views are glorious, the pool area is a beautiful spot for a siesta, it's easy to get into Florence (about 15-min drive), and the hosts are gracious and helpful yet very unobtrusive. Book the panorama room so you can enjoy the private terrace and deck - the perfect place to relax with a book and a bottle of wine, or to look at the stars.", "Date": "Aug 1, 2004", "ReviewID": "UR497074335", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "rambleonrose"}, {"Content": "Best place ever!!!! Thsi place is so wonderful. It is truly a testament to the beauty of Tuscany. It is so close to Florence, yet away enough to have a wonderful and peaceful time. The pool area was gorgeous and the staff was very helpful, you just have to ask! I think they don't want to bug people too much, so keep their distance to offer privacy. The rooms were clean and the bathrooms were better than anywhere we've seen. The walk down the hill can be a tough one in the early morning if you're tired, and we don't suggest walking back up it after a day of sightseeing!The place was so charming and quiet, and the smells of lavender and jasmine were everywhere.Breakfast was nothing special. I would not pay for it, it was just cereal and pre packaged muffins and things.The views are better than the pictures could ever tell.We highly high highly suggest a stay here. It might as well be a 4 star hotel.", "Date": "Jul 12, 2004", "ReviewID": "UR289484828", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Delightful I Parigi I Parigi, Via Luigiana 12, Florence 50125. In April of 2004 we stayed for two nights in I Parigi, located on a beautiful hill overlooking Florence from the South (near the Certosa exit of the Auto Strada--very easy to find). We had the Panorama Room, which meant we had a table and chairs placed so we could look over the turreted walls to see Florence in the distance. The room was spacious, with satellite TV (170 channels) which my husband enjoyed surfing--he even found chanels from former Soviet Republics. Very little English TV, however, but more German than we expected. The grounds were beautiful; the car park spacious. Once one drove up the one-lane narrow stone wall bordered lane, one escaped the very busy road and reached wonderful peace and quiet. The bus to Florence runs from this road--a ten minute walk down a steep hill. We didn't want to take the car out once we got settled because of the narrow lane and busy road, and the owners were very helpful about giving us a marked map, explaining how the bus route worked, and selling us tickets (which one must buy prior to boarding the bus). The only thing we could have used was a listing of local restaurants and shops in the informational binder in our room--we were uncertain where to eat locally, and that very busy road, also lined with high stone walls, didn't encourage much exploration on foot. After we left, we discovered we could have walked to a small town with restaurants and shops (Galluzzo) had we only known. (I'm sure we could have asked and would have received a gracious answer, but we are shy people who hate to bother our hosts). The breakfast room was lovely, as was an airy sitting room with many informational materials in several languages. There were beautiful flowering plants in all public areas and blooming wisteria on the outside wall. In the summer there is a swimming pool. We had a phone with inexpensive service in our room--very helpful for confirming our plane reservations.", "Date": "May 6, 2004", "ReviewID": "UR433832468", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "zoldiegoldie"}, {"Content": "Countryside feel while still being in the vicinity of Florence! * Little villa/castle like atmosphere at fair price * Breakfast included: continental style * Friendly staff * Family-run; speaks English * Makes their own wine and olive oil (for sale) * Minutes to Florence * You need a car to get to it... or prepare to walk up a steep, narrow hill * Great views * Comfortable beds * Daily service * We rented the apartment from 12-26 to 1-1-03 for euro 110... and used the kitchen a lot * 掳Village below掳 has great food to cook in own kitchen!", "Date": "Dec 31, 2003", "ReviewID": "UR142450410", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "TravelGal2Anywhere"}, {"Content": "Un posto incantevole   showReview(17647191, 'full');", "Date": "Jul 8, 2008", "ReviewID": "UR551850514", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Trystero"}, {"Content": "Le site de l'h么tel est...   showReview(11372030, 'full');", "Date": "Apr 1, 2007", "ReviewID": "UR929242968", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottima struttura, accogliente e...   showReview(11372032, 'full');", "Date": "Feb 7, 2007", "ReviewID": "UR415458897", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Wunderbare Lage am s眉dlichen...   showReview(11372034, 'full');", "Date": "Jul 25, 2006", "ReviewID": "UR494581145", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Chambre splendide et...   showReview(11372036, 'full');", "Date": "May 13, 2006", "ReviewID": "UR890113629", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Une r茅sidence magnifique et...   showReview(11372040, 'full');", "Date": "Apr 3, 2006", "ReviewID": "UR866071794", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Acc猫s tr猫s facile 脿 partir de...   showReview(11372038, 'full');", "Date": "Mar 29, 2006", "ReviewID": "UR285246931", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Les chambres sont tr猫s belles...   showReview(11372042, 'full');", "Date": "Mar 17, 2006", "ReviewID": "UR176599463", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Un posto splendido specie per...   showReview(11372044, 'full');", "Date": "Feb 25, 2006", "ReviewID": "UR344898922", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d275931-r20470802-I_Parigi-Florence_Tuscany.html", "HotelID": "275931", "Price": "$124"}}