{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burgos ES/London UK/ Prague CZ", "Title": "“Simply excellent!”", "Author": "Libor79", "ReviewID": "UR130767738", "Content": "Hotel Abba is located very close to the Intercambiador Avenida de America (cca 3 mins walk) in relative centre of Madrid. The Intercambiador is one of the main arrival and departure point of long and medium distance buses that serve Spain as well as a crossing of several metro lines. The hotel is particularly useful for a quick access to the Barajas Airport, which is about 15-20 mins bus ride (bus number 200 serving all terminals, currently Euro 1.50 for single) or taxi with driving time of around 10 mins (around Euro 15-20, depending on terminal). In front of the hotel runs a very busy multiple lane road, which can be busy and noisy, however the windows manage to filter out most of the noise. The reception and the bar area is very elegant, the staff is extremely helpful and polite. The rooms are pristine clean, usually have a little entrance area that is separated from the bedroom by a door. The bedroom is beautifully decorated, quite sizeable, the bed is very comfortable and big. The minibar offers basic selection of drinks, however the TV is not a flat screen. I also used the room service and ordered food (tasty large pizza for Euro 13). The bathroom has luxury feel (in my case it also had a window) and includes a complementary shaving kit, tooth brush and paste and a comb. The air-condition was working great, but it could be a little quieter. The room seems to be well isolated from noise in the corridor and other bedrooms. I didn't opt for the breakfast in hotel which seems to be very expensive (around Euro 16). There are several little bars and cafes around where you can breakfast for less than 5 Euros. Wifi is free, but limited to 60 mins a day and is only available in the hotel lobby and bar area. Pre-paid wifi is available in rooms. I did a very last minute and emergency booking of my room (less than 2 hours before my arrival) and probably because it was the night of a very important football game in Madrid, the price was Euro 175 for what it looked like 'Executive' room!!! Checking the official website now, the price is Euro 75 for standard room, Euro 95 for 'Executive room' and Euro 165 for Suite, which I consider a great deal! I am happy to recommend this hotel as it offers great services, good prices and very useful location.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helotes, Texas", "Title": "“Convenient to airport and close to metro”", "Author": "anniedosamiga", "ReviewID": "UR129949354", "Content": "After a tiring flight we were delighted to put our feet up at the Abba Madrid Hotel. The staff made us feel at home and settled us into a very comfortable, clean and quiet room. Parking on site is available. Free internet in lobby. Breakfast is extra. Friends had dinner at hotel dining room and raved about the food. The metro entrance is right out hotel front door. Would stay here again when traveling to Madrid. There is an excellent restaurant across the street La Tagliatella.", "Date": "May 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Good For Business Trips”", "Author": "Chemist_ahmed", "ReviewID": "UR129480149", "Content": "Good For Business Trips Room is very simple, Breakfast is very good and full of Fruits", "Date": "May 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Good Choice”", "Author": "redsonning", "ReviewID": "UR126485363", "Content": "This hotel is essentially designed as a business hotel, but is also a perfectly good place to stay if you a looking for mid range reasonably priced accommodation for a visit to Madrid. The rooms are a very good size, although quite simply furnished. The bathrooms are excellent, as is the quantity of complimentary toiletries. Everything is very clean and generally in good condition. As with many of the Madrid hotels breakfast is an extra cost (16 Euros). Those who travel widely will not find the breakfast exciting, but for a Madrid hotel it is in fact OK. If you find it too expensive then there are various places outside where you will save a few Euros. I recommend trying the breakfast at the hotel on at least one day, so that you can understand whether searching around outside is really worth the hassle. As far as the cost of the hotel room is concerned, for the casual visitor make sure you search the usual internet sites rather than go directly to the hotel - this way you will find the most attractive price which makes the hotel seem like very good value. Regarding the location, it is about 25-30 minutes to make your way into the centre of town using the Metro. The hotel is also on the right side of town for the airport. WiFi access is free in the lobby and bar area, which for most people will be sufficient. The staff were all very pleasant, with some being particularly helpful. So taking all into account the Abba Madrid hotel is a good place to stay.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "beautiful northern Spain", "Title": "“Pluses and minuses”", "Author": "tres_pozos", "ReviewID": "UR124950731", "Content": "Pluses: - Right by Cartegena and only 5 mins from Avenida de Americas metro stations - Very close to excellent road links to get in and out of city (M30, etc) - Very reasonably priced overnight parking (14 euros for 24 hours) - Huge beds, decent sized bathroom with lots of free toiletry items - Check out usual sites for cheap deals - we got Sat night for 65 euros Minuses: - Horribly overheated and couldn't get air conditioning to work in bedroom - Extortionately priced breakfast and drinks. Go to the patisserie/cafe by Avenida de Americas metro station for brekkie instead! - WiFi at 6.20 euros for 1 hour - they're taking the p*ss!!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Torrent, Spain", "Title": "“Good base for city touring”", "Author": "Edmund B", "ReviewID": "UR122151958", "Content": "Although located on one of Madrid's most heavy used main roads you will hear nothing of the traffic in this modern and very well kept hotel. The rooms are spacious, the bathrooms almost luxurious and equipped with everything a traveller needs. The location of the hotel is excellent if you are traveling by car since it has an underground garage at a price almost a bargain in Madrid. There are two Metro stations - one directly at the hotel (Station Cartagena) and another two blocks away (Station Avenida de America). The last one saves you one transfer if you want to go to the city center by Metro. The breakfast seems to be quite good from what we hear. We have not tried it since we found it too pricy at 16 Euro per person and other cafes and restaurants with good breakfast are only short walks away.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“good value for money - even though not central”", "Author": "Melanie124", "ReviewID": "UR121808187", "Content": "just right if you are on a budget, but want a nice 4 star place - convenient. We stayed as we didn't want to be in the central amongst the noise and buzz, but we wanted to get in and out on the metro so it was just right. The metro is fast and easy and within an easy walk.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Alicante, Spain", "Title": "“Good sevice and a decent breakfast!”", "Author": "sandarab", "ReviewID": "UR120342108", "Content": "We stayed here as part of a fairly large group. The reception staff were very helpful and made our arrival very quick and easy. They also recommended an excellent restaurant nearbye which came with a shuttle service! The hotel restaurant serves a good selection of meals and the nearest I have encountered to a ´full English breakfast´ in Spain. Overall a good venue for ease of use and comfort at a reasonable price.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "L0ndon", "Title": "“Ticks most of the boxes”", "Author": "acerL0ndon", "ReviewID": "UR119971791", "Content": "Just returned from a lomg weekend at this hotel. It is not central but a No 1 bus from hotel to centre is about 10 /15 mins depending on the Madrid traffic, buy a metrocard for 9.30 euros for 10 trips anywhere in Madrid on bus or metro...the metro Cartegena is only 30 metres away. It is on a major road so try for a rear facing room, but the views from the upper non smoking front facing are interesting and the traffic noise level is reasonable. Lots of local places to eat, with local prices compared to city centre. The hotel is well appointed, breakfast is excellent but get an inclusive deal otherwise it costs 20 euro. The staff are excellent, friendly, helpful and courteous, we had a problem with bathroom plumbing that was resolved within 20 minutes after arrival, prompt and efficient. Rooms are of a good size, beds comfortable and room service/housekeeping is very good with good quality bathroom essentials provided and quality towelling. We wonder sometimes what other reviewers expect, we travel a lot, we are discerning and this hotel ticks most of the boxes for a capital city for about100 euros a night with breakfast. A real bonus was the late checkout at 14.00hrs. Madrid is a must see capital city.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Marathon, Florida", "Title": "“Just Ok”", "Author": "believesailing", "ReviewID": "UR119630840", "Content": "First Hotel of Cosmos Tour. Out of way location from El Centro but easy Metro stop. Breakfast was okay, beds were comfy. Internet was free in the lobby, but they charge for it in the rooms.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Muscat Governorate, Oman", "Title": "“Good Value & Good Location”", "Author": "walkabout59", "ReviewID": "UR98874598", "Content": "I stayed at the Abba Madrid for 2 weeks during a recent business trip to Spain. My overall impressions were very positive. The hotel is well located with a Metro station (Cartagena) just 50 metres from the front door. The Avenida de America Metro station is also close by. Hotel rooms were fairly plain but reasonably spacious and comfortable and included a TV, minibar and a safe. Bathroom was above average with a good assortment of complimentary items plus a decent sized bathtub. The room service menu is quite limited though and delivery was not especially speedy. I found the restaurant menu also to be rather limited and only dined in once. Not a problem from my perspective though as there are plenty of restaurants within walking distance. Breakfast on the other hand was excellent - one of the best I've come across in a European hotel. Fresh fruit and juices and plenty of bakery items and hot and cold dishes to choose from. All of the hotel staff I dealt with were friendly and helpful. I found the best rate for the Abba Madrid through myhotelguru.com, a site I use often and highly recommend. Overall I was very satisfied with the hotel and would certainly be happy to stay again on my next trip to Madrid.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ventura, California, USA", "Title": "“Loved this hotel”", "Author": "CaptDrakes", "ReviewID": "UR87173240", "Content": "I can't say enough about this place. Great clean rooms, nice bathroom and showers. The staff were helpful and friendly. The restaurant had a small menu but the food was great. Location was a few miles from Plaza del Sol, about a $6-9 euro taxi fare, but the hotel was right next to the subway opening.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nantwich", "Title": "“Ideal stop over hotel”", "Author": "schrick", "ReviewID": "UR83896765", "Content": "We only stayed one night but it was clean good beds, service was good staff friendly went out of their way to help us with our plans. Very easy to get to from airport 2 euros by metro next door to drop off station. Could of stayed longer would go back.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "United States", "Title": "“Not very impressed”", "Author": "Knight85", "ReviewID": "UR68090178", "Content": "The hotel is clean and well designed. I have no complaints with the size of the rooms and the overall ambience. I found the staff to be generally rude and not helpful. I was in the hotel for 23 nights and instead of trusting me with multiple pre-paid internet cards that last for 24 hours, they wanted me to come down every day and get a new one. This was just annoying. When I tried to ask for their help to order some food one day in Spanish the front desk was not helpful until I had to get curt and had to ask for the manager. I would not recommend staying here if you are expecting any service whatsoever. They make you feel like you are doing them a favor by staying at their hotel and not like you are bringing business to the hotel.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brookline, MA", "Title": "“Good business hotel; location so-so for tourists”", "Author": "msandman", "ReviewID": "UR65074807", "Content": "The Abba Madrid is a modern, comfortable 4-star about 2/3rds of the way from Madrid Barrajas Airport to the center of the city, so it's well located for business. It's not ideal for tourists, but not too bad if you ride the very efficient and inexpensive Metro. The hotel is about 100 yards/meters from the Cartegena Line 7 Metro stop and a 20 minute Metro ride to the center, although you'll need to change at either the Avenida Americas or Canal station. Buy a ten-trip ticket for 9 euros; you can hand it to a companion so he/she can use it with you to go throgh the turnstile. The standard rooms are large enough, with a king or 2 twin beds and a desk. There's WiFi in the room available for 10 euros for 24 hours, which is not unreasonable. WifFi also works in the lobby. But it would be nicer if it was free. The room furnishing is a step above basic but not luxurious. The room I had on the 11th floor cost 115 euros in May 2010 including breakfast and taxes. (That was a group rate) The rom was quiet and the bathroom was modern, clean and functional. The only thing missing was a box of Kleenex. The included breakfast is complete -- egs, fruit, cheese, meat & cereal choices. It was struggle to get a cup of coffee from the freiendly but busy wait staff and the distinctly less friendly manager didn't seem think it was his duty to get you anything at all. I didn't have lunch or dinner in the restaurant, but there was a good if slightly expensive bar menu and the service was fast, friendly and accomodating. The staff at the front desk were helpful. When you buy WiFi access, you get a little scratch card with a user name and password. You can use the login info in any hotel that uses the same WiFi provider as long as you log on within the same 24-hour period. It also works if you want to connect your iPhone etc. to WiFi to make a Skype or Vonage call. But remeber to log out of one device before you try to log on with the other -- logout instructions are on the scratch card. The business center was bare minium -- a desk in the lobby with a couple of computer terminals.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "scully607", "Title": "“Don't Understand the Hype”", "Author": "scully607", "ReviewID": "UR42990582", "Content": "This is a decent enough hotel and it certainly suffices, but it is nothing special and for its cleanliness and relatively inexpensive price tag, it suffers a complete lack in character. It is more like a Holiday Inn than a Hilton or Marriott, even though the star rating suggests otherwise. The staff are friendly enough but don't go out of their way to assist. The location is slightly out of the buzz of it all but directly on top of a subway stop, so it's easy enough to get from here to somewhere else. It is quiet, which is very nice in Madrid and not all that easy to find from what I hear.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "spain", "Title": "“more than acceptable”", "Author": "HowerdMarks", "ReviewID": "UR29702372", "Content": "I stayed at the abba madrid for one night last week on a stopover, just by chance as it was the first hotel i saw when i decided to stay the night in madrid, and now whenever i have to stay in madrid i'll stay there, price for late april not bad, quick and profesional service at reception, lovely room, spacious and clean with all the bathroom compliments you could need. satalite tv, mini bar, and a comfy bed. Didnt have dinner there but restaurant looks fantastic, Bar sevice fine and breakfast excellant, buffet style with loads of choice, freshly squezed orange juice, the works. Over all i definatly recomend this hotel to all.", "Date": "May 10, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Blackpool", "Title": "“First Class!”", "Author": "BelleBlackpoolBelle", "ReviewID": "UR19063199", "Content": "This was the first night of a Cosmos Package, I wish I could have stayed longer! As a single traveller I often get the tiny room near the aircon unit, this was a modern ,spacious room. It was airy, well equipped and beautifully furnished. The view across Madrid was stunning! The hotel entrance was 50m from the Cartagena Metro station, less than 10mins from the city centre stations and 20mins ,by road , from the airport. The dinner was a set meal so I cant comment on the restaurant, but the buffet breakfast was varied and plentiful, with something to suit everyone!", "Date": "August 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Contemporary Hotel, Lovely & Comfortable”", "Author": "travelsnob18", "ReviewID": "UR17018235", "Content": "We stayed here at the end of our 2 week long trip through Spain. It was a wonderful suprise to have such comfortable beds and well-appointed bathrooms. I highly recommend this hotel to travelers whether on business or leisure trips. The only downside was the location... though situated in a nice neighborhood, it is necessary to take the underground (located nearby) or a taxi to the more traveled tourist site-seeing areas and shopping. However, we did both and had no problems getting around. The hotel is also located fairly close to the airport. A good choice if you have an early morning flight or a late arrival.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham, England", "Title": "“Very good stay”", "Author": "Andy_the_Birder", "ReviewID": "UR13898776", "Content": "Six blokes from Nottingham UK stayed here for two nights. (aged from mid thirties to early sevenies) Good rooms, good helpful staff, and a very good breakfast. Close to the Metro (Cartagena) Allthough if you walk to Diego de Leon 10' away it is easier to get to the centre. When in Madrid, graze on the tapas, order a cana (small beer) and you'll usually get a free tapa. Also try the Cidra (Cider) bars. Andy Lane Nottingham UK", "Date": "February 27, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Excellent Hotel”", "Author": "twanny1976", "ReviewID": "UR11070006", "Content": "The location is about 15min cab ride from the airport. We took the metro to go to the centre and it takes about 30min to get to Sol and you have to change once. We used the Av America station. The hotel is modern, very clean and the staff were helpful. The rooms are big by European city standards, no problem with noise, the beds are comfortable, the bathroom was spacious, clean and a lot of complimentary toiletries. We had a non smoking room on the non smoking floor. The room also has a safe and english tv. Perfect. Really enjoyed our stay here and would definitely stay at this hotel when we go back to Madrid. Its not recommended for those who want to stay in a central hotel but perfect for those who want a 4 star, clean hotel with good connections.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Merseyside, England", "Title": "“Nice hotel”", "Author": "SfromL", "ReviewID": "UR10042314", "Content": "The rooms are clean and spacious, the staff are polite, and helpful, and the breakfast was very good with plenty of choice. The hotel is close to public transport, but it is a bit of a walk if you want to go anywhere under your own steam - though we did find a nice tapas bar 'canas y tapas' not too far away.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alava", "Title": "“Not sure the best option in Madrid”", "Author": "burgeluarra", "ReviewID": "UR8711250", "Content": "I cannot understand why a four star hotel lik this one, focused on businness people and with high priced room do not offer free wifi. Hotel is well situated in downtown Madrid, with easy car connection with main road surrounding the city and with the airport. Public transportation metro and bus- is near the hotel. Breakfast is excellent. Not many animations on site, but Madrid offers a lot of things to do in the evening. Although hotel is in general ok, room price is higher than this kind of hotel should cost in Madrid.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Good Stay”", "Author": "masnas", "ReviewID": "UR6843974", "Content": "We stayed here for two nights in January. It was our fourth visit because of the location and service. Excellent food in the restaurant and great service.", "Date": "February 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Gulfport, Florida", "Title": "“Very nice hotel”", "Author": "ab0si", "ReviewID": "UR6574082", "Content": "The Abba is a bit away from most places a tourist is likely to visit in Madrid. However, there is a metro station 1/2 block away. It does take two transfers to get to Sol. The hotel itself is very nice. Large rooms, fully equiped in minimalist style. Good service (same day laundry, for example) and a friendly, helpful staff. High speed Internet is available. The buffet breakfast was excellent with a wide selection of meats, cheese, fruit, cereal, and breads along with eggs and juice. Woudl I recommend this hotel? If you don't mind taking a taxi or the metro to get to \"the action,\" then this is a good choice. If you want to just walk ouside the hotel and be \"there\" then I suggest you look for another hotel. The hotel seems to be popular with tour groups -- take that as a positive or a negative as you see fit.", "Date": "January 11, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Povoa de Varzim, Portugal", "Title": "“Quite close to Paradise!”", "Author": "Maria149", "ReviewID": "UR5010228", "Content": "After a terrific experience in Barcelona, arriving to this hotel was like entering Heaven! Everything was nice and clean. The people at the reception was excellent, efficient and kind, helpfull. In a word superb! The hotel is very weel located as there are two metro stations two and five minutes away from the hotel. The rooms are excellent, very well decorated and provided. Minibar is not extremely expensive as in the majority of hotels. No noise is heard inside the rooms as they are very well acustricly isolated. And above all, extremelly nice staff! Congratulations to this hotel management!", "Date": "April 26, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Short, but nice stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR1648261", "Content": "Only stayed two nights while on buisness. Service was excellent and staff very friendly, including reception, bar and resteraunt. Room very nice, although small by US standards, but again, this is not the US. Will book again when buisness takes me to Madrid.", "Date": "February 13, 2004"}], "HotelInfo": {"Name": "Abba Madrid Hotel", "HotelURL": "/ShowUserReviews-g187514-d277270-Reviews-Abba_Madrid_Hotel-Madrid.html", "Price": "$79 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida de America 32</span>, <span class=\"locality\"><span property=\"v:postal-code\">28028</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "277270", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4b/b3/4bb34a831f6bc586b728078b53e868a66large.jpg"}}