{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location”", "Author": "kingyjj", "ReviewID": "UR131597937", "Content": "I was a bit worried about staying at this hotel after reading some of the reviews. The best things about this hotel is the location and the staff. It is about 1 min walk from 2 metro stations and there are several other metro stations within walking distance. The staff were very friendly and helpful giving us easy directions to get to where we wanted to go. We stayed as a family of 2 adults and 2 children and we all enjoyed our stay. Breakfast was great. Beds not the most comfortable and a bit noisy from room next door but the location and staff make it worth staying here. We really enjoyed our stay in Madrid and if we were to go again we would definately stay at the High Tech Cliper again.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami Springs, Florida", "Title": "“Not good stay away from it”", "Author": "Sergio T", "ReviewID": "UR127149015", "Content": "We stayed in this place for three nights to find out that was a third world hotel, yet very convenient for being in a central location but if you are used to the minimum standards of lodging this woould not be close to a two star hotel. First no air conditioning and when staff was asked they replied is a law.....BS.. We have to keep the windows open at night ans as you are less than one block away from Gran Via the noise will keep you from a decent sleep not to mention drunkard fighting on the street in the middle of the night...breakfast and staff re pretty decent except for lying about the room climate issue, they later said that was a problem with the steaming system, the climate room control don't work so don't waste ur very valuable leisure time in this place", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kent, UK", "Title": "“Make sure you find the right hotel”", "Author": "thetunnery", "ReviewID": "UR120900145", "Content": "We stayed here for two nights over a weekend. Our first problem was finding the right hotel. There are at least 3 hotels from this group in close proximity and they have similar names. I wonder looking at some of the reviews on this site whether some people have reviewed one of the other hotels. We definitely stayed in this one. We were with my 19 year old nephew. I had booked an ordinary double room for us and an economy one for him. I couldn't tell the difference! If anything, he had more room It was ideally located for the centre of Madrid which was great. The rooms weren't big. No English TV, not even CNN. Free wifi. Buffet breakfast was €7 per person and was adequate If you want to find a handy hotel in Madrid for a couple of nights, it fits the bill", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "King's Lynn, United Kingdom", "Title": "“Perfect location”", "Author": "twosisters2737", "ReviewID": "UR119171027", "Content": "I stayed here with 3 other girl friends. We had a Quadruple room. We stayed for 3 nights. The staff were very friendly and helpful. The hotel is a little tired but perfectly clean. We had a room right near the lift but we didnt hear the lift at all. The room was clean and adequate. We had a double (2 singles pushed together) and a bunk-type bed. The top bunk wasnt so easy to access, getting down looked pretty difficult, the ladder wasnt the safest thing I've seen. Aside from that all was good. The beds and pillows however were quite uncomfortable, I will add. The location is perfect! Just off Gran Via. Restaurants and shops everywhere. We walked most places. I would definitely stay in this hotel again, the price was very good for the location and its not the worst hotel to stay in either. I'd class it as slightly better than a budget hotel.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Spain", "Title": "“Overpriced, yet Grubby”", "Author": "Rebrites", "ReviewID": "UR93793224", "Content": "There are tons of OK places to stay in Madrid, and especially in the Gran Via neighborhood. But we were stranded by a late airplane, and without internet access... So we took a stab at a place touted by the Corte Ingles travel agency at Chamartin. Big Mistake. For our 80 Euros we were treated rudely by desk staff in a shabby lobby, twice locked out of our room by a dysfunctional key system, shocked by a faulty lightswitch, and kept awake by a lumpy, thin mattress and the clearly-heard conversations of the people in the rooms on either side. The rugs were threadbare, the corners grimy, and someone had recently had a serious haircut in the bathroom. Disgusting.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "porto", "Title": "“it is not what it seems”", "Author": "dianam_11", "ReviewID": "UR91517938", "Content": "The hall was a mess, and it seems a 1* ugly hotel. The lift wasn´t working. The room, a double with one bed, was so small; i could barely walk in there.The pictures don´t represent the reality of the room. There were construction works on the street, a terrible noise. It is, in fact, in the center of Madrid. It was very hard to find. I had to ask for informations in others hotel high tech and they gave me wrongs informations.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Great place to stay”", "Author": "foodwriter007", "ReviewID": "UR74925928", "Content": "This was my first trip to Madrid and I could not of asked for more. This hotel room was clean, comfortable and COOL! The location was perfect, you were walking distance to everything, I even walked to the prato, el rasto, la latina, plaza del sol (which is only 3 blocks away), Plaza Mayor, Botin, etc. safe and very friendly staff, loved them all.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New York", "Title": "“Not recommended”", "Author": "DanNewYork", "ReviewID": "UR66024695", "Content": "Positives: room with double bed was spacious for one person (but would be cramped for two). Free wifi. Big bathroom. The location is good if you want to be in the most crowded touristic zone, but I would not go back there. I prefer to be in a quieter neighborhood. Negatives: as other reviewers have noted - cold, rude desk staff that spend their time with eyes glued to the computer screen. If I could give one piece of advice to hotel managers, block internet access on the reception desk computer! Second, the hotel in general has a tatty, ragged appearance. Third, some adverts are not accurate. They claim a laptop in every room. There was none in mine, and in my friend's room the laptop had a stuck keyboard as if someone had spilled something on it. I got the feeling the management was trying to maintain a gloss of \"high tech\" but ignored the basics like cleaning the hall carpet. In my opinion, it was not worth the price.", "Date": "June 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Madrid hotel”", "Author": "naturedog", "ReviewID": "UR49178101", "Content": "I was a bit shocked at first at how tiny my room was, and the view out the window was into an alley of sorts, so not at all attractive. Yet people were quite nice, room was ultimately comfortable enough. The location was quite central, tho I realized my first night that I was pretty central to the hookers and tattoo shops as well. I appreciated the free wifi in my room, tho I had to request a new password each day which didn't make sense. Thought it great they offered free bikes to guests tho mine had a flat and I quickly gave up on it deciding that I could walk to where I was going almost as quickly. Things are super expensive in Madrid and that's something you just have to get used to.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Barcellona", "Title": "“To much expensive for that quality”", "Author": "juliancarax55", "ReviewID": "UR37771578", "Content": "Just the location was so good. All the other things, room, staff, service, were to much expensive for that quality. For the same price you can find better.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“great holiday, one to remember, good to chill out!”", "Author": "holidayz_advise", "ReviewID": "UR32250386", "Content": "we went to spain straight after our disneyland paris holiday. as soon as we arrived in spain, or ags got stolen with our camera, hotel tikets and pasports so of course we were devastated. i do remember when we got there, the hotel staff were very helpfull and pleasant. the rooms were clean but small, i have to say hey were big enough for our family of five though we had to get two rooms. there is one pool and a gym next to it. the good thing is that there are plenty of shops near it. prepare to wake up to a delightful breakfast with anything you could want, there is a mini bar in the hotel room and the other hotel guests were mainly english. if you are planning to go there i say you should watc your bags and enjoy your time. if you have kids, i reccomend th aquapollis water park which is very fun and near to the hotel.", "Date": "June 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location - fun City”", "Author": "artigat1", "ReviewID": "UR24399597", "Content": "We actually found this hotel on hostelbookers.com. It was a decent price and had some good reviews, so we booked it. Was really expecting a hostel, but this hotel is far from that. The room was clean and very comfortable. It does have a weird glass partition into the bathroom. There were 4 guys travelling and we found it strange that you could see each other in the shower and stuff. Just had to not look in that direction. There was a free safe and PC in the room which was very good and unexpected. We had asked for 4 single beds, but on arrival there was a double bed and a bunk bed, which was fine in the end. Drink enough Spanish red wine and you don't care where you sleep. The location was amazing. Right on the main shopping street and within a few minutes walk of all the bars and restaurants you could hope for. I'd totally recommend it and we will be staying there on our next visit I'm sure.", "Date": "February 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Do not stay here!”", "Author": "mspiegs", "ReviewID": "UR23333008", "Content": "This hotel is nowhere near what it is on their website. We had a family of five. Parents, husband and wife, and one other. We needed a room that could accommodate all of us. We booked a two floor suite that on the website showed a king size bed upstairs along with two single beds, and a pull out couch downstairs that slept two. Upon arrival, we found that there was not a couch downstairs, only a single bed. This destroyed our plan and caused for some very awkward sleeping arrangements. The hotel is supposed to be 'high tech.' This could not be any further from the truth. They do a great job of making everything look high tech, but it is quite the opposite. They do provide you with a computer in the room. However, this computer is completely worthless as it takes approximately 40 minutes just to turn it on. They did provide free wireless internet...good thing we actually brought a laptop. The room was an absolute mess. All of the walls were dirty and/or destroyed. The stairs in the room was extremely steep and this likely caused people to struggle while taking luggage up and down, thus causing holes to appear in the walls. We also had some minor graffiti on one of the walls in our bedroom. The location of the hotel is really great, however, the street that it is on is terrible. We had to navigate through unruly groups of youngsters on numerous evenings just to get to the hotel door. It seems that the street the hotel is on is a bit of a hang out for local kids and there is a gentleman's club across from the hotel, which also attracts some unsavory people. The beds were extremely uncomfortable. In fact, my wife was very disturbed when she found that her sheets were riddled with rips and tears. The final night that we were there the entire room smelled like cigarette smoke, and none of us are smokers. The one good thing about the hotel was the staff. They were all very friendly and very accommodating. They gave us great recommendations on food and made our stay as enjoyable as they could. While this area of Madrid is definitely the hot spot, there are plenty of hotels around and the High Tech Cliper should be off of your list as potential suitors. There is simply no redeeming qualities about this hotel. If you chose to stay there you will immediately regret it and wish that you had booked your stay at one the many top notch hotels virtually next door to this one at comparable prices.", "Date": "January 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Extremely small rooms but otherwise okay”", "Author": "SEGMN", "ReviewID": "UR17062985", "Content": "I stayed at this hotel for two nights while traveling throughout Spain in May. The hotel was clean and the staff was friendly. However, the rooms were incredibly small! There was a double bed and fold-down bunk beds and after folded down, the four of us didn't have room for our suitcases. We actually had to put two of them in the bathroom! The breakfast buffet was very good, there was a lot of variety. The service was also very good, the front desk staff was helpful.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“**AVOID!!**”", "Author": "applehead1212", "ReviewID": "UR16820326", "Content": "Worst place i have ever stayed in! The staff were awful, the area is completelty unsafe with prositutes as soon as you walk outside, small and dirty rooms and awful security...they let anyone in with no I.D!! We stayed for 2 nights and on both nights, 2 guests had had money and belongings stolen!!! AVOID!!!!!!", "Date": "June 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chingford, London, England", "Title": "“So so rude!”", "Author": "Englandmark", "ReviewID": "UR13373821", "Content": "We arrived as a group of 11 guys from England celebrating my 30th birthday. So as you can imagine we were a little worse for wear when we turned up at the hotel. But saying that we were not in anyway rude loud or aggressive. The reception staff looked at us like something they'd scraped off their shoes, the moment we walked through the door. I tried to communicate in Spanish to the best of my ability but this was sneered upon. Every time we walked in to the hotel we said \"hola\" or \"buenos dias\" in an attempt to be polite but we did not even get an answer. Very rude and unhelpful staff to say the least. Apart from that the hotel is in prime location for the shopping on Gran Via. There is a cash point next door to the hotel entrance and two cafes opposite. The only problem with location is the fact that there are a lot of \"ladies of the night\" that operate in the area. If you can avoid them (or walk very quickly before they catch you) then you won't have any problems. The rooms are small but considering the location and price, you can't really go wrong. All that would put me off returning is knowing that my money would be paying the rude staff and that is not a good thought.", "Date": "February 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "New Forest", "Title": "“Avoid this hotel”", "Author": "Forest54", "ReviewID": "UR10366944", "Content": "Due to a problem at our booked hotel the High Tech Cliper was substituted on our arrival in Madrid. The location is not too bad and the rooms were clean, but the staff were very unhelpful and uncommunicative. The main doors are often closed for security reasons and entry is achieved by pressing a buzzer: the person on duty at the reception desk then buzzes you in. Unfortunately they allow entry with no checks whatsoever, allowing anyone to buzz in and go up to the rooms totally unchallenged. (We had a visitor during our stay who came into the hotel to see us on several occasions with different staff on duty and not even an 'Hola' from the staff, let alone a check on room being visited etc!). The room was OK but shabby in places, and the whole hotel is rather dark and dingy.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Illinois", "Title": "“Bad Location...”", "Author": "coqui14", "ReviewID": "UR10007785", "Content": "As I was looking for a a mid-price hotel in Madrid, I came out to the High Tech Cliper Hotel. I check the website that looks pretty good and give us a picture of a relatively modern hotel. I also review some of the comments and basically most of the complain were about small rooms, not uncommon in Europe. Wow!, big surprise when I found the hotel is located in a small street near Gran Via, with an adult entertaining club in front of the hotel. Because of the location and the narrow road, seems that locals like to use the area as urinal. As soon as you leave the hotel, the place really smells. The street is dirty and the area very unsafe. Two strees away many prostitutes are outside looking for clients. We book a Superior room with welcome drink and fruit platter using a major website. Of course we did not get our superior room and the accomodations were not what we requested. The staff were very unfriendly and let me quote her answer, \"well Sir, you got what you ask, is just a matter of interpretation\". The hotel is old, need major improvements, rooms are very small, and the High Tech is just a name, because is very \"low tech\". Parking is not next door, is couple of block away in a public parking (25.6 euros/night). I have to say, the breakfast was good for the price.... I would not recommend this hotel to anyone.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "2"}, "AuthorLocation": "Sheffield", "Title": "“Bad rooms and extremely unhelpful staff”", "Author": "AJackson0", "ReviewID": "UR8515159", "Content": "I booked this hotel for 4 days on the strength of the photos on their Internet site and the location. Big mistake. The location is very near the centre of Madrid but the surrounding area is quite seedy. We didn’t arrive at the hotel until1300H but our room was not ready until after 1600H. Then to make matters worse the room was not the type we had booked! When I reported this, the staff were very unhelpful and said they would not sort out another room until the following day. The then took another 2 hours to assign us other rooms. Both the temporary rooms we were given were shabby. Paintwork was dirty and bit of the décor were falling off. Power sockets were hanging off the wall. The hotel seems very poor value for money and is in desperate need of renovation.", "Date": "August 27, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "nottingham", "Title": "“very poor”", "Author": "NottinghamLouise", "ReviewID": "UR8126160", "Content": "This has to be the worst \"hotel\" I have ever been in! My two children, husband and I stayed there in June for three nights. Overcharge for what could only be described as a prison cell! Staff very rude and sending us to the wrong places when we asked for directions. The only nice thing about this place was i left my cell phone in the room when leaving and a kind member of staff handed it up. I would have been lost without it, it means so much to me..numbers, pics etc.. So whatever you do dont stay there.. but thank you INA for my phone........", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago Suburbs, Illinois", "Title": "“Great Location & Helpful Staff”", "Author": "MannK", "ReviewID": "UR7686592", "Content": "My family of 3 stayed at this hotel for 8 nights at the end of March. We were in a family room, 1 queen size bed and 2 bunks. The beds were very comfortable. I would have been nervous if someone had needed to sleep on the top bunk though, as there was no railing. Our room faced the street so I was happy to find out that the windows blocked virtually all of the street noise. The room was small by American standards, but we only used the room to sleep, so the size was not a big deal. When we were at the hotel during the day, we found that the lounge area in the lower level of the hotel was very comfortable. There was at least one laptop available for internet access for hotel guests and a large TV. We did not attempt to use the safe, so I cannot speak to that issue. The room did have a mini fridge that we stocked with our own pop and juice. The bathroom was very nice - clean and modern. Regarding phone calls, I needed to make 2 emergency calls to the US. One lasted over 30 minutes so I was extremely worried what the eventual cost would be. I was \"pleasantly\" surprised at checkout to find that it only cost about 38 Euros. I was expecting far worse! I do have to agree that the walls are paper thin. Like clockwork, after 11pm the family in the room next to ours would return and the shouting and laughter would begin. Luckily, things would settle down within about 30 minutes. The location of this hotel is great. Right off Gran Via, within walking distance of many major sights (Puerta del Sol, Plaza Mayor, the Royal Palace, Cathedral del Alumenda, Plaza de Espana),close to the Metro and the Madridvision bus stop, lots of shopping and restaurants. There is an ATM machine just a few steps down the street. Finally, the staff was extremely helpful to us. Everyone at the front desk had a good command of the English language. We had an issue late one night with Orbitz regarding a tour we were supposed to take the next morning. The night clerk was very accomodating to our needs and even left us a message the next morning that the fax we were expecting never arrived. The average nightly rate was 139 Euros. We would recommend this hotel to our friends, with a caveat regarding the thin walls.", "Date": "May 24, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Great place!”", "Author": "Hannah28", "ReviewID": "UR7564709", "Content": "Great location right in the centre, staff were friendly and very helpful, room was on the small size but clean and tidy. Great value for money and the breakfast catered for all tastes. Overall very impressive and I would return.", "Date": "May 8, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago", "Title": "“Ultra thin walls”", "Author": "jimpchicago", "ReviewID": "UR7282217", "Content": "Overall this hotel was a \"poor\" value for our 10 day stay in Madrid. Our room was clean but a little too small even for European standards. The hotel staff was for the most part helpful. A couple, in fact were extremely helpful and friendly. We tended to wait for these staff members to come on duty to ask for help. Each room had a safe, but the funny thing was the safes were not bolted down. I was having problems with my safe and actually had to carry it down to the front desk to prove it did not work to one of the hotel staff members who kept trying to tell me that the problem was with the user, not the safe. The biggest problem, however, were the \"extremely\" thin walls between rooms. Madrid is a 24 hour city with people coming and going all hours of the night, especially on the weekends. And we heard everyone of them...sometimes even the conversations that were going on at the front desk four floors below us. For those needing a cheap place to stay before catching an early morning flight (we had a huge family of 30 kids and adults one evening that fell into this category), this hotel is probably a great value. If you are planning on spending more than a day or two, consider another hotel, maybe one in a quieter part of town. Also, regardless of the hotel, if they promote family rooms it doesn't mean you will be on a floor with families. It only means the rooms sleep more than two people which could mean you will be sleeping next to a group of teenagers or young mom's from Ireland who like to laugh and talk for hours. By the way, I hope the mom from Ireland's baby is feeling better. Suggestions for the hotel: 1) Warn people ahead of their visits about the thin walls, 2) bolt down the safes, 3) include a list a list of locations (e.g. drug stores, grocery stores, churches, etc.) that are in walking distance of the hotel in your room's FAQs and 4) turn the coffee pot on between the hours of 2-10 pm when you say free coffee is available in the lobby for guests.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Cool little place”", "Author": "VesperGirl", "ReviewID": "UR6698809", "Content": "I stayed here for about 4 days... it's pretty convinient to everything. lots of places to eat around and shops. the room was usual 'european' size... small, but not cramped. free internet downstairs and free tea/coffee during the day. the staff is very helpful and the hotel itself is very clean. i would definitely stay there again.", "Date": "January 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Naples, Italy", "Title": "“Phone calls rip off”", "Author": "TheRealityCheck", "ReviewID": "UR6647603", "Content": "High Tech Cliper Gran Via hotel has a good location. This is really all the good that there is to it. The rooms are small and run down. The whole hotel has not seen a restoration in a long while. the entrance looks tatty with a dirty carpet. I made two phone calls. One of two minutes to a pay line which was supposedly 1 Euro per minute and they charged me 20 Euro for two minutes... Another call to a Spanish mobile which should not cost tops 0.23 Euro/min was charged at 1.5 Euro/min for a total of 34 Euro. So they ripped me off some 50 Euros for two phone calls basically. They do not publish the phone tariff from the room and the personnel is basically unable to answer the question of how much is a phone call. Bottom line watch your bill or better don't come to this hotel. There are so many others in this area... One more thing the inside rooms face a internal courtyard which feel like being in prison", "Date": "January 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leicester, UK", "Title": "“Recommended”", "Author": "MarkOfLeicester", "ReviewID": "UR6595924", "Content": "This hotel is pretty good. We booked two adjoining rooms, one for me, my wife and two kids, the other for my in-laws. The two rooms were the same size but our room had bunk beds for the kids which made the room rather small. If you have kids I suggest you get a suite but one wasn't available when we booked. The rooms were very clean and reasonably quiet. Service was excellent. Everyone who worked at the hotel was lovely and really did their best for the guests. They were also very honest as when I left my credit card at the front desk the receptionist phoned my mobile to let me know not to worry! Breakfasts were very good and well worth the money and you can have free tea or coffee all day til 9pm and there are two computers on the internet for free. They have a secure room where you can leave luggage and this was very useful as our flight wasn't until the evening. A couple of gripes about the service though are that they were pretty hopeless at email communication, though excellent when rung and English speaking, and that they couldn't arrange us to be picked up by taxi from the airport, so we got ripped off. Go for it, I doubt you'll be disappointed and the hotel is so central.", "Date": "January 14, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bury", "Title": "“Huge room, great location!”", "Author": "bpbbabe99", "ReviewID": "UR6161236", "Content": "There was 4 of us staying in this hotel and to our surprise, they gave us a mini apartment style room! Had a ground floor with a lovely marble style bathroom, computer with free internet access, then a spiral staircase leading to a double bed and 2 singles, sofa, mini bar, gym cycling bike and another marble bathroom. Air conditioning wasn't brilliant but wasn't too noisy when the windows were open. The location was fabulous, just off the gran via and across the road from H&M, ace! And lots of space for 4 people with the 2 floors. Would definitely recommend!! Lovely and modern design too!", "Date": "November 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, UK", "Title": "“Good things come in small packages”", "Author": "TheLonelyWanderer", "ReviewID": "UR6087228", "Content": "We booked a last minute deal online for a city break in Madrid. The location of this hotel is fantastic, literally off a side street of Gran Via (main shopping street) but surprisingly quiet. The metro system & sightseeing bus stop is only 2 mins walk if that and there are plenty of places to eat surrounding the hotel. The staff were friendly and helpful, their english a godsend compared to the rest of the city! The hotel has limited facilities but we weren't expecting luxury as it was so cheap. Our room was compact but had all the basics. We had 3 adults in a family room. The beds were very comfy & you could hear people if they were being noisy but not enough to disturb your sleep. The room was spotless & the maids visited daily. Can't imagine the air con would be very good in the height of summer. There isn't a huge amount of storage space (3 women with 3 small suitcases was a squeeze) but otherwise the room was great. Could've murdered a decent brew though!", "Date": "November 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Modern rooms, free internet, top location”", "Author": "pamilya", "ReviewID": "UR5708235", "Content": "stayed at the hotel as a family of four with young children... perfect location to explore madrid, walking distance to Plaza Mayor and other sites, plenty of places to eat around (try the Museo the Hamon for great value) and as the other reviewers mentioned handy to the Metro Station (we used Gran Via)... it is also appears to be right in the middle of the shopping district with specialty shops along Gran Via and El Corte Ingles on the other side ... found the rooms to be modern, clean and good size (compared to others we stayed in around Europe), the family room had a queen bed and two bunk beds for the kids.. bathroom was quite modern and sparkling clean as well. Reception staff were friendly and helpful ... they also provide a free map of Madrid on check-in to help you get started. Free internet access as well in the common area with a couple of PC's as a good value add. It was also reasonably priced so I'd rate it as pretty good experience during our stay.", "Date": "August 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cascais, Portugal", "Title": "“Very Good for Cheap Price!”", "Author": "GPCOSTA", "ReviewID": "UR5631732", "Content": "Very good hotel, located in CENTRAL place in madrid (Gran Via). Rooms very clean, good and helpfull staff at reception. Every room equipped with COMPUTER with internet always connected for FREE (no extra charge). Besides this you have more computers with internet in the -1 floor. Bathroom very clean with shower. The door of the bathroom is not GLASS, its WOOD. What is glass is the door of the shower. Many restaurants nearby, cinemas, theathers, shops, etc. I took my car and it was not easy to find a place for parking, but i could always park at an underground parking place behind the hotel (25Euro/24hrs). When i go again to madrid, i will stay again in this hotel. For me it should be 4 stars, and not 3! Regards", "Date": "August 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, New York", "Title": "“Good Location, Modern Hotel”", "Author": "bostonredsox912", "ReviewID": "UR5523569", "Content": "This was a very small, yet modern hotel which was very close to the Gran Via. The room was very spacious, with 2 floors. The computer in the room was a nice touch, and the bathrooms were very clean and updated. There was also an exercise bike on the bottom floor of our room, which was very cool. This is a great hotel for a family due to the spacious rooms, but also for the business client who needs the use of a computer. Very Nice!", "Date": "July 28, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "UK", "Title": "“Satisfactory, but”", "Author": "stennypics", "ReviewID": "UR4989406", "Content": "Stayed during early April for three nights. Hotel staff were friendly and helpful and recommended an excellent restaurant serving delicious paella dishes at a reasonable price. Breakfast in the hotel is now 8 euros and is excellent. Accommodation is basic but very clean and suited our needs. Free internet access downstairs adjacent to the dining room was handy. Sometimes we had to wait for 10 mins but there were complimentary coffee and daily newspapers available (one in English). Major downside was the lack of air conditioning available until May. Had to sleep with the window wide open on the one hot day we experienced or we would have fried ! Therefore, the street noise became an extra factor ! First time we have prayed for cool weather on holiday. Apart from that major consideration it seemed reasonable value for the price paid.", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Great location and service”", "Author": "A TripAdvisor Member", "ReviewID": "UR4731846", "Content": "My husband and I stayed here for three nights and had an above average experience. The room was comfortable and the bathroom was spacious. We requested a non smoking room but were assigned a smoking room. The hotel staff corrected immediately and the new room was fine. The double bed was two twins pushed together, not uncommon in Europe; however, this had separate sheets - not one double sheet, so it was more obvious. The breakfast was 7 euros and was one of the best we had in Europe - eggs, fruit, cheese, cereal, meat, etc. Very large. Front desk was helpful and friendly. Free internet (two computers) was a plus. Great location. We walked to Prado and Thyssen museum, as well as to many other sites. Right off Grand Via. Very clean as well.", "Date": "March 25, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Merseyside", "Title": "“Great location”", "Author": "SarahxDx", "ReviewID": "UR4596039", "Content": "Location was brilliant, good location for shopping although there were not many eateries and bars in the immediate vicinity. When we arrived I was a bit put off by the smell in the entrance hall... typical spanish bad drains smell! The rooms were clean and modern, I would say on a par with a travel lodge room. We had a triple room for 3 adults, however this was rather cramped but ample for 3 girls! We didnt try the breakfast but heard good reviews about it. All in all I would recommend the hotel for the money but not if you are looking for pure luxury. A good base for exploring Madrid.", "Date": "March 9, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Nice hotel”", "Author": "galonthemove", "ReviewID": "UR4496600", "Content": "This hotel is in a very good location. It took us about 20 minutes to walk to Plaza Mayor and Puerta de Sol. If you like watches and scarves, there's a cute store on the corner on Chinchilla and Gran Via called Carmen Carmena. Very affordable. Also, across the street, Palazzo has very good ice cream, try the limon. The Metro is close by, and the neighborhood is veyr lively. The only complaints I have about the hotel are, no public phone, you have to go across the street, the desk staff never seemed to have any change, I tried all three shifts, and the hot food on the breakfast buffet was cold.The location alone would make me consider staying here again.", "Date": "February 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Very clean, great location, breakfast good too”", "Author": "tapas-eater", "ReviewID": "UR4055562", "Content": "Stayed on sight-seeing trip for three nights with young family. Bunk beds were a hit! Room very clean, good bathroom - only shower, minibar was reasonably priced if you are desparate! Breakfast was 7euros, half price for kids - good value, plenty on and all fresh. Bang in the middle of town, near metros and shops. Room walls are thin and you can definitely hear next door easily! And therefore noise can be a problem but if it's too much go to reception - big guy on reception (over night) sorted noisy neighbours within minutes for us one night. For midrange it's a good one & if you've walked all day and had a few drinks with your dinner, you'll sleep anywhere!", "Date": "October 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool", "Title": "“Good value hotel, would recommend”", "Author": "Bumblebee685", "ReviewID": "UR3744953", "Content": "Stayed at the High Tech Cliper with group of friends for a long weekend. The hotel is very well situated, easy walking distance to bars, cafe's, restaurants and shops and metro. Buffet style breakfast was good quality and had a very wide selection. The noise in the room from adjacent rooms was not too bad and wouldn't put me off staying again. Overall good value for money, would recommend.", "Date": "August 8, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“What do people expect for the £, euro or $”", "Author": "A TripAdvisor Member", "ReviewID": "UR3514183", "Content": "Stayed here in deepest mid winter. It gets very cold in Madrid in Feb/March. Found the hotel and booked it, then read some of the reviews. I was expecting the worst. However, I found the staff to be very helpful, the breakfasts fantastic and it's location the cat's whiskers. It's slap bang in between two metro stations, no more than 5 mins walk. No need to get a taxi from the airport as the metro takes you to easy walking distance of the hotel within 30 mins at a snip of what the taxi costs (i know I tried it in 2002). Centrally located near a lot of bars and restaurants. The only problem, no bar for a nightcap!!", "Date": "May 31, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "stoke on trent (uk)", "Title": "“cracking breakfast”", "Author": "tunner", "ReviewID": "UR3459933", "Content": "just returned from the high tech clipper after a 3 night stay. staff very helpfull, breakfast was great hot & cold to suit everyone & as much as you liked, the room & bathroom facilities were also fine, all you need for a short break clean, tidy & comfortable. the only draw back being thickness of walls, no sound proofing at all you could literally hear a pin drop. use of ear plugs recommended other than that spot on. 5 mins walk to centre & 1 min walk to metro.", "Date": "May 11, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "san francisco, ca", "Title": "“If you like a no frills, dormitory atmosphere, stay at the Cliper”", "Author": "ct&ja", "ReviewID": "UR3352179", "Content": "My first clue was when the cab driver had no clue as to where the High Tech Cliper Hotel was. When we finally arrived, I went up the stairs to the lobby and asked the receptionist if there was a bell person, or at least a cart , upon which I could load my luggage and carry it to my room. The answer to both was No. No bell person, no cart. So, up the stairs I had to lug my suitcases to the lobby. I was told this was a 4 Star Hotel, by the travel agent at AAA. Ha, ha, my room reminded me of my 1975 college dorm room. Not only was it the size of a cracker jack box, but it was furnished most sparingly. Bed, nightstand, dresser, No frills. If this room were a discount price, I would have expected what I got, but that was not the case. The desk girl, was very nice and sympathetic, but an upgrade was not possible as the place was packed with students on spring break. Not exactly what I had in mind. The good news was the buffet breakfast was very good, but make no mistake, even though it's included in the cost of your room, you pay for it.", "Date": "April 12, 2005"}], "HotelInfo": {"Name": "Hotel High Tech Cliper", "HotelURL": "/ShowUserReviews-g187514-d277272-Reviews-Hotel_High_Tech_Cliper-Madrid.html", "Price": "$93 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Chinchilla, 6</span> | <span class=\"extended-address\">Esq. Gran Via 29</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "277272", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/8a/37/bb/double-room-with-free.jpg"}}