{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Review from Very Picky travellers”", "Author": "docjt", "ReviewID": "UR128147144", "Content": "Wonderful. The staff at this place really feel like a 5 star resort. You can see they are genuinely helpful and ready to make your stay very comfortable. The resort itself is very updated, comfortable, beautiful and clean bathrooms and the restaurant and spa is first class. My wife and I stay at 5 star hotels everytime we travel and this was our best vacation. They have golf carts to drive you around the resort and mercedes cars complimentary for you to drive. They provide bottled water and tons of extras complimentary. We will definitely come back here. Jack T.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greenwich, Ct", "Title": "“Escape to Serenity”", "Author": "lucindaw", "ReviewID": "UR127660678", "Content": "My friend and I went to Calistoga Ranch for a stay a while ago but the memories still linger which is why I am prompted to write this review. It was my third or fourth stay there. We decided at the last minute to have a romantic night away from the Bay area with our dogs. I called the Ranch and found a great deal on a two bedroom suite.(One of us snores which is an expensive problem when traveling!) We drove up to Calistoga with our two small dogs and arrived at the lovely property to be cordially greeted by the staff and taken immediately to our incredible series of rooms! The two bedroom suite consisted of two bedrooms, two bathrooms, an outside living room, a kitchen(fully functioning) and an inside living room. My friend, who is a sucessful author, expressed a desire to return and stay for a week while writing his next novel. We had scheduled massages in the calming spa and this was the only low point of our visit. Both of us felt the skill level of our therapist was not up to par which was disappointing. We had dinner in the dining room with some friends and it was delicious! I love the dining room as it has a magical view of the gentle mountainside and the staff are very personable. The Ranch is very pet friendly and provides your dogs with treats and bowls for food and water. Dogs are permitted in most areas of the Ranch with the exception of the dining areas. Best Rooms: Spring for a suite if you can afford it as the regular rooms feel cramped to me. All the rooms are nicely furbished and have lovely bathrooms but the suites have nice outdoor areas as well as separate living rooms. Best time to go: I would say the best time to enjoy this resort is in warmer weather as one cant make use of the outdoor areas in winter. Despite the cold temperature when we visited, however, we had a great time.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“A perfect getaway”", "Author": "extrapagespassport", "ReviewID": "UR127613523", "Content": "We spent four nights here in April and could not have been more delighted with the property and the staff. Gloria and Gregory did a wonderful job helping us plan winery visits -don't miss Schramsberg but also the tiny winery, Zathila down the road, was a true find that we would never have known about. Bikes are definitely a good way to tour; we did a very nice guided tour but it's not necessary. Just grab a bike and helmut and the map from the hotel and go. We stayed in a one bedroom with living room and loved the setup of the two separate spaces divided by a deck, though families might not. In general, we were great fans of the architectural style - elegant, tasteful, rustic. The outdoor space - both the very private and romantic shower as well as the deck with fireplace - was great; next time we'll try to spend more time on the property just enjoying the chance to relax. The property is big with good hiking trails and we loved the temporary help - the adorable babydoll sheep who are keeping the weeds down in the small onsite vineyard. My husband and I also both enjoyed the spa; my massage was ok but I had the best facial ever from Susan. With so many phenomenal restaurants in the area, we would be inclined to go out for meals. While the distance from the East Coast makes weekend trips to Calistoga impossible for us, we will certainly be back.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cleveland", "Title": "“nice place”", "Author": "cleeeeeeeeevelander", "ReviewID": "UR127569409", "Content": "i enjoyed....fireplaces in room were nice touch. well located.nice pool ans hot tub.very quiet.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gibraltar", "Title": "“Walk down memory lane”", "Author": "Pillarofhercules", "ReviewID": "UR127035473", "Content": "I stayed at Calistoga a number of years back on a honeymoon trip down the west coast of the US. We have literally just been talking about our best ever trips and hotel stays and i thought it only appropriate to come and jot my thoughts down on this property. This is a very special place. We've been privileged to stay in some beautiful places over the years but we often come back to this trip, and to this hotel as one of the highlights (along with the post ranch inn furhter down the coast at big sur). The rooms are great and the feeling of being detached and not centralized withing a building or complex was just great. Loved the pool and the whole outdoor space, including the openness of the gym area. The setting for breakfast was fantastic, and I can honestly say that I had of the best massage treatments of my life at the spa which was also beautiful. This is one of those places that you would feel completely and totally comfortable in recommending to anyone visiting the area. I would go as far as to say that it was worth extending a planned trip 'off piste' to visit. Anyway, great memories, great place. highly recommended", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Lovely!”", "Author": "mshtx", "ReviewID": "UR124731005", "Content": "A splurge - The Calistoga Ranch is expensive but is worth it. The rooms are excellent - living area and bedrooom divided by an outdoor hot tub and deck. We were celebrating my husband's birthday and they delivered champagne and strawberries. Outdoor shower is great. All the right touches. We had one minor complaint while there and the manager, upon seeing our review on this, called us, corrected the issue and emailed us as well. It was handled so professionally. They really do want you to enjoy everything here and make sure that you do. Concierge set up a day of winery visits on Spring Mountain Road and they were all favorites of ours after visiting. Definitely take advantage of her advice and assistance. Go and ENJOY!! In a quieter section of Napa Valley and that is an advantage too. We hiked the area and loved the views.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Juno Beach, Florida", "Title": "“Romantic!”", "Author": "Victoriaangel1", "ReviewID": "UR124040617", "Content": "This place is gorgeous and romantic. Peace and privacy galore. Would love to go back again. the best place to stay in Napa.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Port Saint Lucie, Florida", "Title": "“Unbelievable property in the heart of wine country”", "Author": "mjpino", "ReviewID": "UR122710689", "Content": "We spent the last week of our honeymoon at this beautiful property. The minute you arrive at the ranch, you realize that this is going to be an experience like no other. They hand you a glass of champagne to sip by the pool before bringing you to your amazing private bungalow. Our room had one bedroom, 1 1/2 bathrooms, an indoor/outdoor fireplace, hot tub, outdoor shower and separate living room; needless to say, it was awesome! The concierge made dinner reservations for us at all of the local hot spots and a few boutique wineries, which were all incredible. They have cars on site that you can reserve for the day, bikes that you can take for a ride through the vineyards and a beautiful pool to relax by. This was such a wonderful end to our unbelievable California honeymoon and we can't wait to return.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Fabulous wine country property”", "Author": "Anomina", "ReviewID": "UR122544389", "Content": "We spent New Year's Eve at the Calistoga Ranch and thought it was fabulous. The rooms are amazing with both indoor and outdoor accomodations. The space all feels remarkably private and everything is just right -- not excessive but perfectly luxurious in every way. Greg on the concierge team did a terrific job of helping us set up wine visits and also helped with other terrific suggestions for drives, dining, etc. The property is magical with great hiking paths and a terrific spa. We really thought this property was well conceived and very well run. One small call out: We had a great dinner at Auberge which is about 15 minutes away in Rutherfold and were a bit taken aback at the taxi rate to travel there and back (approximately $100 total). The meal was fantastic but the lack of a shuttle to a sister location combined with the expensive taxis (which I think are typical for the area) was surprising to us. Overall, however, the experience was perfect and we certainly enjoyed the meal -- we would recommend dining at any of the places that are recommended in the area as long as you are prepared for these types of fees for the convenience of not driving.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Relax & Restore in Decedant Luxury”", "Author": "traveldiva1932", "ReviewID": "UR121735232", "Content": "They have thought of everything in this very private escape from the real world. The natural beauty is only enhanced by glorious accomodations. Instead of fighting with the surroundings, the rooms blend in and offer a hidden escape to relax and rejuvinate. The beds are incredibly comfortable and the outdoor shower is not to be missed. It's romantic, great for girls weekends (what I went for) and a special celebration all in one. You could not find a reason to go that this place wouldn't be perfect for. The location is outstanding, we used a fabulous Mercedes SUV available there to combine everyone in one car and when we wanted, took the bikes out. There is not a better place you could find in Napa to experience the beauty of the area and get away from the crowds. I crave going back to regain the peace I found there - it's truly a magical place.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Calistoga Ranch - Napa Valley Perfection!”", "Author": "RLG79", "ReviewID": "UR121533760", "Content": "My husband and I recently stayed at Calistoga Ranch for our anniversary and it was beyond amazing. The resort exudes luxury from the moment you arrive and the privacy and beauty of the property immediately give you the relaxation you're seeking. Our \"room\" was more like a private house. Our living room was in one small house with a fireplace that opened to the outside deck which also housed our own private jacuzzi and our bedroom was in a separate house with a luxurious bathroom and outdoor shower with a beautiful oak tree growing through the deck in front of you. It's clear they have gone above and beyond to build around the nature within the property ultimately elevating the uniqueness of the resort. The property is expansive, but not over crowded providing the privacy one seeks at a five star resort. The restaurant is exceptional and the service across the board outstanding. From the moment we arrived the staff attended to our every need and went out of their way to make our anniversary weekend special and romantic, including leaving champagne and chocolate in our room upon our arrival, gifts from the spa, and congratulations at every turn. Additionally, as I am pregnant they were always accommodating me with special, complimentary non-alcoholic cocktails and sparkling pear juice without me even having to ask! They even included baby products in the gift they provided at the spa. On that note, it should be mentioned that the spa was fantastic as well. We have traveled a lot and are quite picky when it comes to resorts and can honestly say Calistoga Ranch exceeded all of our expectations. As recent San Francisco transplants we will definitely be going back as it has quickly become our favorite weekend get away place!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "santa barbara", "Title": "“Amazing”", "Author": "1995sb21", "ReviewID": "UR121469837", "Content": "Beautiful setting, pure luxury, a must. After checking in we had no desire to leave the property. Took nice hikes, had great food, slept wonderfully, fantastic service, absolutely no complaints. Will definitely go back again and again.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A great retreat in the Valley!”", "Author": "regrace1", "ReviewID": "UR121321394", "Content": "This is one of my favor places to stay in Calistoga, at arrival we find out you can't not use a car to get to your room, golf carts only or you walk so this make the place very relax. Our \"room\" it was just like a little house in the forest, out door hot tub, patio, fireplace in a separate building and the bed was in another area with a beautiful bathroom with the best OUT DOOR shower!!! Imagine this in California...just great!! Good food, very nice spa and service! Also they have fancy cars for you to drive at not extra cost!! Great experience!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“This is well worth every penny,”", "Author": "Sue D", "ReviewID": "UR120917134", "Content": "All I need to say is that our experience at the Calistoga was above and beyond our expectations!!!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Impeccable.”", "Author": "abqtarheel", "ReviewID": "UR120555608", "Content": "Just close your eyes when you get the bill, and your entire experience will be flawless! I spent a weekend here with friends, and we all had a wonderful time. The indoor/outdoor rooms are really delightful, and I felt the setting was very private -- it is like the ultimate luxury camp-out in the woods. I had an unbelievably amazing treatment at the spa, and the lovely setting of the fitness area (also indoor/outdoor) inspired me to enjoy my usual workout even more. The concierges helped us with several arrangements, even including advice on a great picnic spot one day when our intended destination turned out to be too crowded.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Super expensive... but premium luxury & WOW!”", "Author": "HappilyMarriedTravel", "ReviewID": "UR120515656", "Content": "Calistoga Ranch IS expensive. But, if you enjoy private, classy, luxury, exclusive etc... this is your place to stay in the wine region of Calistoga (near to St Helena, Napa Valley). My husband and I stayed in what we think was the highest Hillside Deluxe Villa and it was secluded and special. We arrived on a Friday to be told of a complimentary 2 hours of wine & cheese tasting. Nice. Then, afterwards we went to dinner at the Lakehouse Restaurant & ordered a steak each for dinner... that wasn't even on the menu... WOW....yummo! You are transported around Calistoga Ranch via Golf buggies... you just call & they come get you. This is simply a fantastic place to stay!!! One of the nicest hotels I have had the privilege to stay at. If you have a luxury budget and want exclusivity & tranquility... definitely, definitely stay here!!!! (NOT for budget conscious.)", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marin County, CA", "Title": "“Fun stay, even in the rain...”", "Author": "NSIInnerloop2", "ReviewID": "UR119902248", "Content": "We booked just a single night here as a local getaway from San Francisco, and had a great time. It was definitely one of the priciest weekend escapes we've had, but we enjoyed it nonetheless. The property is great and very tranquil. It was raining quite a bit all weekend while we were there, but we still had a great time. The room is peaceful and private. We loved the on-deck hot tub. It was certainly strange to have rain \"inside\" your accomodation but if anything it just made it more fun and memorable. On a whim, based on reading other reviews here about the concierge getting French Laundry reservations, we figured what the hell and asked him to see what he could do on short (~48 hours) notice. And, voila, he managed to score us a table for lunch. It was great and unexpected. Loved the spa. Loved the common areas. Enjoyed simply walking around the property looking at the variety of rooms and lovely views. I'd like to go back sometime and maybe do a 2-night stay, relax a bit more and soak up a bit more of the wondering laid back atmosphere. Oh yeah, big fan of the free stocked mini-bar- why don't more hotels do this? I'm sure my satisfaction exceeds the cost to the hotel to stock it!", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Superior Stay”", "Author": "smitty5125", "ReviewID": "UR119765840", "Content": "If you don't mind spending a bit more, you should make a couple of days available to be pampered at this amazing location. The food, spa, and accommodations are 5 Star. And you get free access to the resorts fleet of Mercedes Benz. We drove a GL 550 one day and a convertible the next. Included in our 2 night package, my wife and I received a 90 minute massage and a 4 course dinner. The spa massage was the best we have ever experienced. Just think of being on a hot water bed during your massage. The dinner was top notch. Note also you have the opportunity to experience hiking right on the resort. We only had time for the easier 3/4 mile trail, with views directly over several wineries in Napa Valley. The staff, food, accommodations, service, and scenery were the best. Neither my wife nor I wanted to leave. It was by far the best vacation we've had so far, which includes Jamaica, Cancun, Jackson Hole, Boise, Northern Minnesota, and a few more.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woodside, California", "Title": "“Amazing Experience”", "Author": "ccallander", "ReviewID": "UR119725663", "Content": "Napa Valley presents more than their fair share of unbelievable food, properties and service. Calistoga Ranch is my newest experience among this area's elite properties - Auberge du Soleil, Meadowood Resort, Solage. All are so different and so superior in their own right, but CR blew me away. The size, layout, decor and amenities offered in each room was simply heaven. The property offers privacy and nature unrivaled by any other. Only hotel guests or resident owners can use the facilities and this makes a unique experience. Quiet, peaceful, private and beautiful this place boasts the best of it all. Service, food, attention to detail....all of it puts it on the \"must go visit\" list for anyone who wants a taste of how the other half lives. Truly decadent, romantic and ultimately relaxing. The spa, restaurant, pool and rooms are all among the best I have ever experienced. \"Wow\" is the one word that kept coming to mind.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glen Rock, NJ", "Title": "“This is the place to enjoy Napa and get away from it all”", "Author": "gothamfoodie", "ReviewID": "UR119500254", "Content": "My husband and I stayed here for a week in August. We are still glowing from our experience. The service is incredible, the rooms are luxurious and stylish, the spa is fantastic, the pool and fitness area are downright dreamy. Everything everywhere is immaculate. There is amazing attention to detail here. We are fussy travelers and this place met our expectations (this place is far from cheap, so we were hoping it would deliver, and it did). And you can't beat getting to borrow their fleet of Mercedes every day! We ditched our SFO rental car and rode in style from Calistoga to Yountville. We both came away thinking that when we return to Napa, we will stay here. You cannot go wrong.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Alexandria, VA", "Title": "“Relaxing Experience”", "Author": "DruryS", "ReviewID": "UR119358804", "Content": "I stayed four days during Christmas holiday. The hotel has a warm atmosphere that makes me relax. I enjoyed taking shower outdoor at night while watching the stars. The spa was superb. Loved the free mercedez loan. The whole experience was really worth what I've paid for.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, Michigan", "Title": "“Outstanding!!!”", "Author": "skiqueen48009", "ReviewID": "UR119288484", "Content": "Absolutely beautiful. Could not imagine a better stay. The accommodations, grounds, staff and spa facilities were all five star.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“Luxurious Wine Country getaway”", "Author": "rogerad", "ReviewID": "UR119133614", "Content": "This is my favorite property while visiting Napa - Wine country. I've stayed at Auberge du Soleil, Solage and Carneros Inn, and I prefer the Ranch. The property is ultra luxurious. Once inside your unit (we had a two-bedroom with kitchen) you feel as if you're leaving in a large tree house. The young staff is extremely attentive and knowledgeable. This is a very romantic spot. Yes, it's expensive but worth it. The spa is decadent.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“The highs, the lows”", "Author": "SevenContinents07", "ReviewID": "UR118892665", "Content": "The public spaces (restaurant, lobby, pool, and especially the spa) are absolutely lovely. The service is wonderful - unobtrusive and yet both friendly and first rate. They go out of their way to make you happy. Everything is perfect except for one thing, and it is a doozy. Calistoga Ranch makes this big deal about how every suite is a complex of two buildings, with a deck and a fireplace and a hot tub for your romantic enjoyment. What they don't mention is that both the hot tub AND the bedroom hover over the road. Not near the road - on the road. Why spend $1200 a night for a suite with a hot tub where you have to wear your bathing suit to swim AND have to keep your voice down (way down) in your room? It was like cuddling in the back seat of a car parked on the main street of town. If you get what I mean...", "Date": "October 3, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sylvania, Ohio", "Title": "“the lap of luxury”", "Author": "canesmiami1", "ReviewID": "UR118161473", "Content": "My wife, brother & I spent 3 nights this past July at the Calistoga Ranch. 5 star luxurious is a great description to start. From the moment we entered the ranch until our departure, everything was fantastic. Friendly staff, with a welcome glass of wine upon arrival. Stayed in the estate lodge & were blown away by the accomdations. Up high in the canyon above the Lakehouse restaurant, the accomodations were fabulous. Separate living quarters for living, dining, and bedrooms, all connected by decks with outdoor furniture, fireplaces, hot tubs, and trees growing in between. Lovely bedrooms with huge outdoor showers & every amenity you could think of. Great pool area with exceptional cocktails. Ate 1 dinner & 3 breakfasts at the Lakehouse & all were good. As part of our stay we had the exclusive use of the 550 Mercedes convertible, and they also have a fleet of Mercedes for anyone to use on a first come/first serve basis. Easy drive to Bouchon, Au Berge, French Laundry. Wonderful boutique wineries right near by. If you go to the Frank Family winery just down the road, you get of of a kind wines to try if you let them know you are staying at the ranch(one the winery owners has a son working there) All in all, one of the best places we have ever stayed. Can't wait to do it again!!!!", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Wow is all I can say”", "Author": "tamstrat", "ReviewID": "UR118045471", "Content": "Hubby and I like to go to the Napa area at least once a year, we had never stayed at the Calistoga Ranch. It is pricey....hold your breath when booking, but absolutely worth the stay. We arrived and the reception and concierge were excepetional in their friendliness and willing to accomodate us. Our accomodations was lovely. A deck with a double sided fire place, jacuzzi and out door shower was lovely. The cabin was a little closer to neighboring cabins than what we had anticipated, but no problem. Hubby and I ate one night at the Lakehouse Restaurant and it wa lovely and very quiet. The only negative was the last night we were there, there were some \"rowdies\" or \"yahoos\" AKA drunks (I don't know if it was from a wedding party or what) raising hell down the street from us, yelling, making noise later at night, in total fairness, the hotel went down and called them out and told them to cool it.....did not make us think negative of the resort, they can't be held responsible for people who can't maintain, the resort did the best they could to handle it. The congierge, I believe his name was Jeffrey, went out of his way to accomodate us on restaurnt reservations, taxi ride, etc. The valets were also amazingly nice and friendly. My husband and I so enjoyed sitting out on our outdoor deck with the doublesided fireplace on, listening to great \"70[s music, in the hot tub with a bottle of wine, it was amazing. The outdoor shower was awesome as well. I would move in permanently if I could. This is an awesome place if you are willing to drop some cash for an awesome resort experience. Thank you, God willing, we will return!!!!!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City", "Title": "“Excellent Stay”", "Author": "rdkflk", "ReviewID": "UR117697240", "Content": "My favorite part of the Calistoga Ranch were the plantings and landscaping. Absolutely beautiful. The Oleander trees at the pool are so beautiful. The pool reminded me of Villa St. Michele outside Florence. Rooms were nice but not over the top. Our lodge was lovely but they do seem on top of each other. Did not feel a breach in privacy just our view was straight into another building and coming from NY would have preferred a view into the woods? Will ask next time if this is an option. We went with our two boys ages 6 and 11. They lived in the hot tub on the porch. The outside shower was great as well. Products in the bathroom were loved by all. The separate rooms were great and allowed us a lot of options between sleeping area and areas where people needed to work or watch TV. Unfortunately cell service was very bad at the room so that caused some issues in terms of trying to get some work done. We had dinner one night at the Lakehouse which was good but I think in the future we will opt to go off campus as there are so many options. The little town of Calistoga is charming and worth a trip. The Spa at the Ranch was exceptional. We had a fabulous masseuse who was really one of the best and facilities were lovely and unique. One of the best massages I have ever had.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Koh Samui, Thailand", "Title": "“Great stay but didnâ€™t quite meet expectations”", "Author": "Fleetcat", "ReviewID": "UR116969862", "Content": "We arrived at 2pm but our room was not destined to be ready until the check in time of 4pm. We sat in the pool bar which was OK and had a Thai beef salad for lunch â€“ huge â€“ one for two more than adequate but not much beef. I think however the attitude of reception set the tone â€“ i.e. come up at 4pm and your room will be ready vs. we will come and let you know. If they had come at ten to four we would have been delighted and felt we had a win â€“ they didnâ€™t. We hoped for two days of peace and a rural idyll prior to embarking on some serious wine country drinking. When I saw our room I was initially a tad disappointed as it didnâ€™t appear as nice as the photos. I took a photo and it looked exactly like the internet â€“ this place is photogenic! Looking at the cabins on the website I hadnâ€™t appreciated that they are basically all side by side in a row. I had a sense of far more privacy and seclusion. Not the case â€“ buggies going by all day and audio insight into our next door neighboursâ€™ showering experience. The Lakeview restaurant is good. Lovely clean food without fuss and our preference of small portions. Other good things. Deer at night sneaking around nibbling foliage, free minibar, decent coffee, good room service and perfect dappled shade over your outside living area (in Oak Creek lodge anyway). We decided that we liked Calistoga Ranch but it is very expensive for what it is. NB I wrote the above a few days ago. Since we have stayed at Bardessono in Yountville and the Post Ranch Inn in Big Sur - $500 and $300 dollars a night cheaper respectively and both blew us away - it is possible!.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Most amazing girls get away”", "Author": "Emily H", "ReviewID": "UR116575391", "Content": "I recently had a weekend girls getaway here I can not say enough good things about our stay. From the moment we arrived we were treated like queens. The staff was so attentive and friendly and our room was immaculate! From breakfast at the lake house to lounging at the peaceful pool (we named the \"fountain of youth\" ) every slow passing hour was pure enjoyment. I will be returning soon only with more friends and family to share the experience.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, Tx.", "Title": "“Calistoga Ranch is the BEST ! ! !”", "Author": "BayouCityTraveler", "ReviewID": "UR116139378", "Content": "This was our first stay at Calistoga Ranch but not the first stay on an Auberge property. There was a expected level of service and comfort but what was given after we arrived on the property far exceeded what we expected. You are at the Northern end of the valley but you are closer than you think to the other towns. You do give up your vehicle to the valet whenever you are on the property, but have no fear, there are golf cart shuttles with the absolute best bellmen (thank you Shane) that will take you wherever you need to go \"in a blink of an eye\". The grounds are very safe and well kept with fountains in front of some lodges and are just a pleasure to stroll around. The front desk staff are very welcoming and pleasant and Greg is one of the best Guest Relations Coordinators around. Breakfast and service in the Lakehouse was very good with a nice selection of items. Dinner was a preset menu. Since the Lakehouse is only for registered guests, it seems as if you have the entire dining space to yourself. Beautiful canyon and lake views. We even saw deer that evening. The Bay Forest Spa Lodge was TERRIFIC ! ! Some members were concerned that the spa was visible by others but I did not find that to be a problem. Maybe it was the placement of our lodge. Since the open area is raised and there is very little traffic in front of your lodge to begin with, you should have a fair amount of privacy. Note that it is located in the front rather than the back of the lodge. Take that into consideration \"party people\". The other lodges do not overlook your outdoor area at all. A large outdoor living area with fireplace sets the tone. The bedroom and bathroom were equally as wonderful. The mindset of indoor and outdoor is nonexistent sometimes. Speaking of outdoor, the outside shower is a MUST ! ! ! One of the highlights of the stay. A huge bathroom that also blurred the line between indoor and outdoor. If I had one thing to say it would be the consistency of the bath towels. Not what I expected considering my surroundings. A great sound system and comfortable furnishings are a welcome retreat after a day of tastings, however, I could see how in the cooler tempertures the floor plan would not benefit some, but you are a part of nature first here. Overall, this is a wonderful property with a great staff that will have us returning to the ranch.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Wanted to love it....but....”", "Author": "brooke103", "ReviewID": "UR116115461", "Content": "My husband and I just returned from our 2 night stay at Calistoga Ranch celebrating his 40th birthday in Napa. I read all of the reviews and wanted to stay someplace extra-special for this momentous occasion. To give you an idea, the 2 days prior to arriving we were in Monterey staying at the Lodge at Pebble Beach and I gave my husband a round of golf at the famous course. I wanted this to be a weekend to remember! Let me start by saying that I was really, really, really excited about staying at Calistoga Ranch. The pictures of the website were amazing and we had heard nothing but great things about it. I wanted to come back and rate it 5 stars and rave on and on about how perfect our weekend was. Unfortunately I spent the last hour there on-line looking at where we would stay in Napa the next time. Let me start with the positives, as I did rate this a 3 because there were some really great things about the place. First of all, it is a beautiful property and is very peaceful and serene. We stayed in the very top room which was extremely secluded and special. We never heard a peep from anyone up there, which we absolutely loved. The outdoor shower was the highlight - I could have showered for hours out there in the crisp morning air. We loved the breakfast....the banana walnut pancakes were heaven on earth. They did a fabulous job of accommodating us when we were in a rush one morning and Shelly got us in and out quickly. She was fantastic both mornings we ate there - very helpful and great attitude. Lastly I appreciated that they noted my husband's birthday and had a nice card in the room greeting us upon arrival. Unfortunately we felt that we paid too much for what we got overall. For $910 a night, we expected great service like we have received at countless other resorts in that price range. Had we paid $400/night, I think we would have been more lenient. First of all, I got an e-mail from the concierge a couple weeks before with a \"pre-arrival\" form to fill out with any requests I might have for our trip. I did request a dinner reservation at their restaurant on the night of our arrival, and also assistance with setting up a driver for our day touring the wineries. I submitted the form and never heard a peep. I ended up calling the restaurant myself and making the reservation. I also searched the internet and found my own driving service, as well as wineries to visit based on reviews. (To give Calistoga Ranch some credit, I did tell someone about this once we were there and we received a complimentary bottle of wine in our room with an apology note.) However, I was still disappointed that I ended up doing all of the work myself. After our arrival, I got an \"in room\" pedicure from the spa. Apparently they do not provide this service at the spa itself, and recently started offering it in the rooms since they had so many requests for it. I've never heard of a high-end spa that doesn't offer pedicures! The very nice girl came to give me my pedicure, and although she was as sweet as can be, the pedicure was one of the worst I've had. Notably, she soaked my feet in cold water. She did not use a basecoat and applied the very dark nail polish straight onto my bare toenails. I don't even want to know how yellow my toenails will be after that! She did not use anything to exfoliate except for a light lotion that had some exfoliating beads in it. The toenail polish was too thick so the finished result was bumpy and uneven. Then I got the bill and it was $105 for a pedicure!! I've never paid that much, even at nice spas where you frankly get so much more. So for $105 I will have to get it redone at home, as my feet still have dry skin and the nail polish doesn't look good. So I decided to let that one go and just enjoy our wonderful stay at the beautiful resort. My husband and I headed to dinner at the Lakehouse. I find it funny that they advertise it as having a view of the \"lake\"....which in my book was a very small pond. Still, it was peaceful and pleasant, and we were looking forward to a fantastic meal. We were presented menus for a four-course fixed-price meal, and that appeared to be the only option. We chose our courses and were waiting for our 2nd course when we heard the table next to us talking about items that we never saw on our menu. Some of them sounded good! So I called one of the servers over to ask if there was a menu that was not presented to us. He promptly told us that it is a menu of \"bar food\" and something that they let the kids order off of. We believed him and finished out our meal. The next day we saw this supposed menu of \"bar food\" and realized it was a regular dinner menu with steak and duck and other items. Although we enjoyed our dinner, we felt deceived that we were only given the one (very expensive) option. The next day we had an incredible day touring wineries, and we returned to the resort to change clothes while our driver waited for us to take us to dinner. They took us up via golf cart to our room, which as we mentioned was at the very top of the resort and quite a hike. We asked the young man to come back in 15 minutes to pick us up, as we would be heading back down to meet our driver. After 15 minutes we started walking, figuring we'd meet him shortly on his way up and hop on for a ride. We got almost all the way to the bottom, at which point my feet were KILLING me in heels, and he drove past us with some other guests. He saw us and said out loud, \"Oh no!\" realizing that he had forgotten to return to get us. I was not a happy camper. A few other comments on the layout of the resort in general....and it's somewhat repetitive to what other reviewers have said. It does seem a bit strange seeing high-end villas set up like row houses. My husband and I paid a little extra to be up at the top and have a little more privacy, but we both commented how happy we were that we did that as the rooms at the bottom of the resort seem to have no privacy. Also, I was a bit surprised at how small the rooms were for the basic 600 sq ft room. I realize now that the 600 sq ft is including the outdoor deck and outdoor shower as \"living space\" which leaves you with a very small master bedroom and bathroom. We expected more for $910 a night. Like I said, I really wanted to love this place. I wanted it to be special for my husband's birthday. The room we had at the Lodge at Pebble Beach was the same price and was far superior with a wood-burning fireplace and a private outdoor jacuzzi. For the money, we will definitely look elsewhere in Napa next time.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "San Francisco", "Title": "“No lasting impressions!”", "Author": "Irreverent", "ReviewID": "UR116089754", "Content": "I had fond memories of this resort from a previous stay at least 5 years back. Fast forward to July 2011. My brother and sister in law were coming to CA for a 2 week holiday \"up the coast\" from LA. Having not seen them in many years, I offered to treat them to 3 nights at The Ranch as a culmination of their trip. We planned a Mon, Tues, Wed to avoid the weekend. I requested the 2-bedroom Estate Lodge ($3995/night) for the trip. Unfortunately, they couldn't accommodate us on the opening night so we settled for a hillside lodge for me ($910/night) and a 1-bedroom creek lodge for them ($1410/night) for Monday with a move to the Estate Lodge on Tues/Wed. We were psyched for the experience! About 3 weeks prior to arrival I received an email from the concierge requesting whether we were interested in arranging a private tour of wineries not open to the public. About a week later I replied that we were indeed interested, but received no reply. Several days prior to our arrival I emailed the concierge again on the same issue. Radio silence. So before we even arrived I told my brother they were at 4 stars (not 5) due to this oversight. I assumed they would rebound to 5 stars. I was wrong. Picture perfect drive up from the city with an intervening lunch at Bouchon, arriving at the Ranch at 2:00. Neither room was ready upon check in and the concierge was overwhelmed on the phone, so I never got to bring up the lack of response issue directly or with the front desk staff. I did request a call from the manager -- a business associate's parents were acquainted was an additional reason. I never received a call from the manager during the entire stay. I requested the SF Chronicle as my morning paper. I got it the first day in the hillside lodge, but it never followed me to the Estate Lodge. I had to request it both mornings at the Lakehouse for breakfast (only to have a driver bring it up). The perfunctory welcome card in my 1st room was addressed to a different person. Mr \"So & So.\" Oooops. We had a simple late (9:00) dinner at the Lakehouse the first night. Perfect. The next day we got into the Estate Lodge around 4:00. It's at the VERY top of the property which may not be advantageous. Much of the welcome breeze by the pool when it's hot is absent in the upper reaches of the resort and there is no overhead fan (they should add this) in the outdoor common area of the Lodge. Also, this is where the delivery trucks park in the mornings and you get a direct view of the service dock of the restaurant upon leaving the Lodge. Ugh. Once in The Lodge you have privacy and it consists of a kitchen/dining, living, guest & master living units. Unfortunately, if you are relegated to the \"guest\" room as I was, you forfeit the great outdoor shower that was standard in my 1st night \"entry level\" accommodation. I love their simple, but heavy shaded pool area. The oleander have been trained into trees, always in bloom and serving as shade trees. The setting is mostly adults only during the early week even in high season. Low key indeed, but it took exactly 1 hour for a server to approach me during my 2nd full day at the pool. I was nursing the bottle of water I brought from the room all that time. The bell/valet staff were super friendly & efficient. A high point of the experience. But, not without fault. The Estate Lodge comes with access to a complimentary Mercedes and my relatives opted for the E550 convertible for 2 days of wandering throughout the valley while I stayed at the pool. Despite a request to clean the windshield of bugs and/or replace depleted wiper fluid (empty light on), we were always presented with a bug riddled window car. Note to valet: Clean the windshield! BTW. Securing the premier unit on the property does not secure you any additional amenities. No basket, no bubbles, no chocolate, no fresh flowers. You get the same 4 green apples in a bowl, the same complimentary bottle of Calistoga Ranch chardonnay, the same welcome note (addressed to the right person this time). At approximately $13,000 for a 3 night stay, was it worth it? No. Would you go again? Probably not despite the beauty and allure of the place.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Glasgow", "Title": "“Always longing to come back - Never wanting to leave!”", "Author": "Asta72", "ReviewID": "UR115693005", "Content": "Rating: A shining 5! Again! This was our 3rd time here and we have had nothing but perfection, and wonderful times, during each of our stays!!! The location is gorgeous, the rooms special, beautiful and blissfully private and quiet, the layout cool/practical and the staff extremely helpful and nice. CanÂ´t fault it. For those of you hesitating in between the \"other\" Auberge resort and this one i can only say one thing, i would pick Calistoga every time. ItÂ´s just a fresher, more fun and more up-to-date take on luxury! Location: Secluded and beautifully set in beween \"mountains\" in Calistoga right off the Silverado trail which is gorgeous. Try to avoid the Highway at all times! Room: We had room 103 this time which is a one bedroom spa creek lodge. ItÂ´s located near the reception so only a short walk from the pool, but a bit of a hike from the restaurant. CanÂ´t have it all i guess...But they have a lot of speedy buggies so one never has to wait! The way that they have placed all of their accomodations makes that you pretty much canÂ´t go wrong. ItÂ´s a very private resort and considering that everyone has their own little lodge itÂ´s also very quiet. The bed is extrememly comfortable!! Large bathroom with his and her sides and a lovely outdoor shower. The only thing in the room thatÂ´s not great is the fact that thereÂ´s very little storage room for clothes and bags. We also had an outdoor jacuzzi and a separate livingroom area. Another great feature is the fireplace that you can enjoy from both in and outside. Was really perfect to sit next to eat while we had our breakfast outdoors and it was still a bit nippy outside. Another charming thing is all the animals you see from your cabin. Deer, racoons and a huge range of birds! Staff: So very friendly and serviceminded. They are a delight to deal with all of them! Always smiling and always helpful! They are quite a young crowd so the energy is great! Service: See staff above. Can not think of a thing to complain about. Which is rare hahaha But i would like to mention that i even like their turn-down service as they provide such nice and quirky gifts every night. Loved the jelly-beans, massage oil and lavender! Internet: This was the only thing i was not impressed about. It was very spotty depending on where on the property you are. If i, for instance, had not brought my own wireless router i would not have been able to go online at all! BUT i was told that they are in the process to install access points in all the rooms soon so that should be a glitch of the past. Once online it was fast. ThereÂ´s also no annoying/complicated log-in process which is always smooth + free which is should be everywhere in this day and age! Laundry service: Very good. They even laundered my husbands shirt on the Sunday when thereÂ´s normally no laundry service and even managed to deliver it 2 hours before agreed upon! Food: Very good and expensive, especially the breakfast. ThereÂ´s only one \"proper\" restaurant. But you can order in-room dining at the pool which is always a nice touch. ThereÂ´s also a restaurant at the pool with lighter, and very fresh, items. There is also a picnic that one can order that has a very nice selection and itÂ´s a charming idea! Amenitites/Minibar/Entertainment: Great amenities for the bathtub! Minibar sufficently stocked. That said, all that is in there upon check-in is also free, great stuff!!! Their movie selection is rather large and you can choose to watch a movie either in the livingroom or the bedroom. Comfort... Giftshop: DonÂ´t expect to get your Pringles and fashion-mag fix there...But hey thatÂ´s why thereÂ´s a CVS and such not too far away hahah. BUT they do have some very nice and luxurious organic skincare. Plus the usual bikinis and such Spa: Expensive, but very very, very good. We have had several treatments there during our 2nd and 3rd stay stay and were in heaven each time! If you get the chance do the Healing Waters, please do as itÂ´s a very special experience... Doug is btw an excellent massage therapist. Very giving, and very firm touch! Pool: I must confess that itÂ´s not very exciting or large. But you have lovely mountain and forest views from it. Wish there was more shade available once in the water The pool loungers are plentiful and comfortable. Service is as always very pleasant. I especially found Brie charming and super service minded! Gym: There is one, but didnÂ´t use it so canÂ´t comment. Things to see/do: Eat! Drink! Relax! Need i say more...? Joking aside, there are some serious restaurants here, but make sure to book some of them (French Laundry for example) waaaaay ahead.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“total luxury in the nature”", "Author": "veronica2001", "ReviewID": "UR115401849", "Content": "Calistoga Ranch is a unique hotel. I personally don't like ranch style, but this one very different and calm. It makes you feel you live in the forest, it is serene, beautiful, excellent service. They take you anywhere you want with golf carts, anytime. If you don't want to walk not a problem. The restaurant is outdooe and indoor, complete beauty and one of akind scenery and nature. It is expensive, but all worth it. The spa is a complete relaxing place all in the nature as well, worth to try. All rooms have shower outside but complete privacy of course. It is alovely experience overall.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Calistoga Ranch is a First Class Resort All the Way - - A Truly Stellar Experience”", "Author": "CliffLIL", "ReviewID": "UR115063240", "Content": "My wife and I recently spent our wedding anniversary (week) at Calistoga Ranch (\"CR\"). It was our first visit to the resort and our first trip back to Napa Valley in approximately 16 years. We live substantially all year in the Scottsdale-Paradise Valley sector of Phoenix, AZ and three months each year in our summer vacation home in Southampton, NY. Because of where we reside, we spend much of our day-to-day lives at world class resorts and spa properties. Over the years, we have travelled fairly extensively throughout the U.S. , the Carribean and Europe (usually at five-star resorts and at luxury boutique properties). Accordingly, our expectations for CR were quite high. We're very pleased to convey that our experience at CR matched, and in many respects exceeded, our highest expectations. For starters, the property is absolutely beautiful - - a serene and stunning amalgam of rustic, natural, elegant and luxurious facilities and accomodations thoughtfully positioned (terraced) in a wooded, pine-fragranced hillside with a small lake and a running creek. The professional staff is exceptionally gracious, volunteering and knowledgeable. We accepted many (breakfast, lunch and dinner) dining suggestions and vineyard tour recommendations from the concierge staff; and there wasn't a single disappointment among them. We stayed (resided) in one of the beautiful private oak creek spa lodges. The rooms are very spacious, comfortable, airy, contemporary and well-appointed . The \"indoor-outdoor\" concept is rather unique, as is the private nature of the entire resort/spa property - - there is absolutely no auto \"thru traffic\" allowed, and the restaurant, spa, fitness center and pool facilities are not accessible to non-guests. This adds to the experience of being a pampered member of an exclusive club - - a home-type atmosphere. Unfortunately, I have certain chronic medical conditions which restrict my ability to indulge in certain cuisine. Fortunately, this was a non-issue during our stay - - the Lakehouse chefs prepared for me numerous \"off-the-menu\" dishes real-time upon my request. The food was beautifully presented and delicious, including the many creative and flavorful appetizers, entres and desserts that my wife was able to enjoy without restriction (I viewed them from afar and enjoyed them vicariously). As part of a cross-sell promotion with local (Napa) Mercedes Benz dealerships, CR maintains on-site and offers its guests for daily use, at no charge on a first-come/first-serve basis, several current model sedans, sports coupes, convertibles and SUVs. We took advantage of this almost every day. This was quite a nice added perquisite. When (not if) we return to Napa Valley (and we're already reviewing our 2012 calendar), we will definitely return to CR. We'd mention the room number (which we'll most certainly request for our return stay), but we do not want to give the readers of this review the opportunity to make the room potentially unavailable when we return :-)) Overall, our experience was romantic, celebratory, relaxing and first class all the way. It was everything we hoped for and needed in terms of suspending the often arduous routine of daily life. It was difficult to leave (notwithstanding how fortunate we are to call Paradise Valley, AZ and Southampton, NY \"home\") We are certain to return to CR and recommend this splendid resort most highly to anyone seeking a truly memorable, stellar vacation experience. Thank you CR. We'll visit you again soon. Cliff & Lillian", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Michigan", "Title": "“Incredible stay in a beautiful environment”", "Author": "docscott17", "ReviewID": "UR114677679", "Content": "We stayed recently in the estate lodge which was amazing and perfect for 2 couples. Although pricey, the place was imaculate with a gorgeous oudoor living room as well as seperate master suites, kitchen/dining room, and an indoor living room. The place was secluding and set into nature. We had the use of the resort's Mercedes S400 during our stay. Snacks and drinks in the lodge were included. In addition, the management sent champagne and dessert for our friend's birthday. Spa, Lighthouse restaurant and pool area were great. Although located in northern Napa valley, it was an easy drive to restaurants and wineries. Highly recommended...one of the best places I've been to.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Removed, cozy, quiet, and relaxing”", "Author": "jmainelli", "ReviewID": "UR107554284", "Content": "Loved our room at Calistoga Ranch. It's like a little house! We did not use our outdoor living room as it was January and a little chilly, but I still love the concept. We used the hot tub every night though. And the outdoor shower was nice even in January because the steam makes it warm enough to be outside. The spa here is unbelievable. We have stayed at Auberge du Soleil as well (their sister property) and these two places have some of the nicest spas I've ever been to. The restaurant was kind of boring. It was fun to not leave the property one night though. They pick you up and drive you there in a golf cart so it's just very easy. My husband's favorite part of this place was the Mercedes you can check out as loaners. I have to admit - even I thought this was pretty cool! Location was nice for us because we've stayed in Sonoma and more central Napa before so we explored another neck of the woods!", "Date": "May 9, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Calistoga Ranch is one of my favorite places - can't wait to return!”", "Author": "bunnymoon", "ReviewID": "UR102232760", "Content": "From the glasses of wine at check-in, to the bottle of bubbles to welcome us to our room and mark our anniversary, this was an elegant experience that was also relaxed and easy to enjoy. Loved the hillside lodge, the views, the hot tub, and was surprised to see that I used the outdoor shower often. We stayed in one night by the fire, and enjoyed a well-done turndown service. The staff was excellent. I enjoyed the private setting. Views were great, and the hiking trails should not be missed! Great location to other wineries and restaurants- if you can force yourself to leave the property! Highly recommend it!", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Yes, it's expensive - And yes, it's worth every single penny.”", "Author": "MrPhotoID", "ReviewID": "UR100656916", "Content": "My wife and I just returned from a six night stay at the Calistoga Range. The short version - Go. It is - simply - incredible. Hereâ€™s the longer version: The Property: Entire setting is amazing. In the woods/valley, the entire place feels, smells, sounds like retreat should. The pine trees smell amazing and the creek is everything it should be this time of the year. The entire property north of the main lodge is car free. You can either walk or catch a ride with the myriad of attended golf carts. The lack of cars makes the entire venue very relaxed and quiet. All resorts should do this. We rented a Bay Forrest Lodge. It had one bedroom and another 'living' room connected by a covered porch. The wall between the porch and the living room had a double sided gas fireplace. Very nice. One thing to know about the Bay Forrest Lodges (without the outdoor hot tub (spa), is that the road leading up to the 'top' of the property runs behind these particular units. There is a tall fence, but if you are very noise sensitive, you may hear an occasional truck going up the road 'behind' you. IMO, it's not a deal breaker for those units as you might hear 3 trucks in an entire day. The units that this pertains to are 110-120 and are all considered Bay Forrest Lodges. If you want the most serene experience, spring for the Oak Creek Lodges w/ Spa. They are on the other side of the property and have only foot traffic and an occasional golf-cart cruising by. That is the only minor nit in an otherwise epic experience. The Food: We ate breakfast every day at the Lakehouse (on property). The banana/pecan pancakes were so good, we had them every single morning. The dinner there looked very good - and is traditional four course fair - but my wife wasn't feeling like a multi-course meal when we arrived. No trouble, they were happy to make up a hybrid chicken salad for her. We ended up eating at several restaurants off the property, so I canâ€™t comment beyond breakfast. The Spa: Best spa setting, service, treatments we have ever experienced. The spa, like the lodging, is not inexpensive. Like the lodging, itâ€™s worth it. Outdoor showers rule. The Service: Every single person that we interacted with at the Calistoga Ranch (and Spa) exhibited not only very 4 star service, but did so with such genuine enthusiasm, that it really made you feel like a very welcomed guest in someoneâ€™s home. They were extraordinarily kind to my wife, who is several months pregnant with our first child. The Team there really is the icing on a magnificent cake. Weâ€™re still talking about â€˜the peopleâ€™ we met on-property. Extras: Calistoga Ranch has worked out an arrangement with Mercedes to provide a fleet of cars & SUV for their guests to use. Since we were on-property from Sunday through Saturday, we were able to take great advantage of this very nice extra-perk. Would I go again â€“ in a heartbeat. BTW, Iâ€™ve been to the other 4.5 star rated properties (via Trip Advisor) in Calistoga and they just arenâ€™t in the same league. The only place I can compare to Calistoga Ranch for overall beauty, service, and experience is the Four Seasons on the Big Island of Hawaii. Kudos Calistoga Ranch, weâ€™ll be back ï�Š", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“This place really delivers.”", "Author": "rdking1998", "ReviewID": "UR100186219", "Content": "We just returned from an amazing three days at Calistoga Ranch. We stayed in a one-bedroom Bay Forest lodge, so we had an indoor/outdoor fireplace and hot tub. We also got a lot of use from the outdoor shower, despite the cooler temperatures in the evening. The place is incredible, and the staff is top notch. The restaurant and room service are both excellent. I also had the best message of my life at the spa, which is sublime. We'd go back in a heart beat.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“most dog friendly place we've stayed at”", "Author": "susienoodle", "ReviewID": "UR91718277", "Content": "it's a wonderful, relaxing, luxurious resort. Besides the deck with fireplace, I loved the dog accommodations, beds, bowls, treats, and such a warm, welcoming atmosphere for both me and the pups. Can't wait to return.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“True Elegance”", "Author": "findsandra", "ReviewID": "UR90702352", "Content": "It was 6 women and we needed a getaway weekend. From the time we stepped out of our cars, till the time we returned to them (two days later) ....it was the most Amazing and Awesome experience EVER!! The reception representatives met you with true Crystal Glasses of White or Red wine, and proceeded to brag on their extravagant accommodations. We did not leave the property because it provided everything we could have possibly wanted. From the spa, to the wine cave, to the bar, to the restaurant, to our cabin with a Hot tub...we wanted for nothing. The pictures of the lodges on the Calistoga Ranch website are true to their looks, but even more beautiful by sight. All of it was elegant, from the cheese and wine welcome platter, to the in-lodge dining breakfast the next morning, to the sunset dinner at the restaurant by the fireplace. While it was expensiveâ€¦it was worth every dime. We loved it tremendously. Be careful whom you book with. Calistoga Ranch tried to change our reservation at the last minute even when it was Pre-paid. We had booked through Leading Hotels of the World who guarantees their reservations. They were able to contact the resort to get our original booking honored.", "Date": "December 26, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Westchester County New York", "Title": "“Words Fail”", "Author": "Armonk", "ReviewID": "UR87092220", "Content": "Words Fail to capture the beauty of this property. I don't even think pictures could do it. It was spectacular. The staff was also uniformly friendly, accommodating, unpretentious and eager to assist. Five stars for them too. I will mention a couple of things that potential visitors should keep in mind. First, the property is spread over perhaps a quarter mile of a hillside. Second, all of the buildings are unconnected. So a guest must go outside to access the restaurant, the fitness center, etc. The staff will come with golf carts to transport you and you may prefer to walk. But in the colder weather that is something visitors should be aware of.Third, even the individual units the sleeping and sitting area are not connected and you have to go outside to go from one to the other. This may matter at night or in inclement weather. Fourth, the fitness center is open-air which again will matter on colder or inclement days. I was sad to leave after three days and would definitely return. It is like having a romance with a supermodel - you can't believe how beautiful she is but she has her idiosyncracies and demands that drive you crazy and you know sooner or later it is going to end but until it does you are glad just to have the time while it lasts.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Beautiful but very, very hard to justify the price”", "Author": "mommythek", "ReviewID": "UR85621172", "Content": "We were very much looking forward to our first trip to Napa, for our 20th wedding anniversary. After looking over the various travel information sources (web, magazines, friends, etc.) we thought this sounded perfect. The concierge was very helpful in setting us up with tours, restaurants, etc., but that was about as far as it went in terms of superior service. The website and videographers have done a beautiful job of selling it. In theory, private cabana/homes featuring indoor/outdoor space (hot tub, outdoor shower, indoor/outdoor fireplace, etc.) should be a wonderful thing--but it wasn't enough. The facility itself is more spartan than one would expect. The Lakehouse restaurant was almost empty and yet the service was terribly slow....the on-site facilities were stark and primitive. I know it's not a \"resort,\" per se, but considering the price (approximately a mortgage payment per night) I expected a little more.....something.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "SC", "Title": "“Truly an amazing resort”", "Author": "OBmomma", "ReviewID": "UR82916370", "Content": "What a great property to stay at !!! The rooms were beautiful and we loved having the outdoor living spaces ( the outside shower and the hot tub on our deck, which we used everyday !) The fireplace was open sided , so as you sipped wine in the hot tub under the stars you could have the fireplace on for even more ambiance. The staff was one of the best staffs we have ever encountered ( and we have stayed at many different luxury hotels across the world) Every single person was pleasant and eager to please, everyone took extra time to help you ( getting me an ice bag to keep my wine cool as we drove back to San Francisco to the spa attendants who brought me a complimentary glass of champagne because I had a stressful ballooning landing earlier in the day) . We liked using the property's selection of mercedes available instead of always using our rental car. I can not say enough about the concierge Gregory Haas, he was the BEST !!! He was able to arrange things for us prior to the trip ( french laundry reservations, winery tours and tastings) and also while we were there: from a meeting with the artist Lowell Herrero after I saw one of his paintings at a tasting room, an impromptu decision on our part to want to do an olive oil tasting ( which was scrumptious), and a cooking demonstration at the culinary institute of america . I really recommend everything about this property, it is awesome and I can not wait to visit again !!!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Might well be the best place my wife and...”", "Author": "TheRichens2", "ReviewID": "UR82803113", "Content": "Might well be the best place my wife and I have ever stayed. Sensational service, stunning rooms, beautiful surroundings, great food. It was so hard to leave. Thanks to everyone there who made the start if our honeymoon so memorable. Just wish it wasn't so eye-wateringly expensive so we could come back every year.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ann Arbor, MI", "Title": "“Beautiful Resort, a tad overpriced”", "Author": "Rinkman", "ReviewID": "UR79169285", "Content": "As all the reviews have said the place is beautiful. The lodges are well thought out and the furnishings to me were gorgeous. The outside shower I still miss today! Based on my headline what could they have done better....Really not a lot. Maybe include a breakfast and include the wet bar after the first day. The Lakehouse restaurant was good, the service was outstanding. I wanted to go there to experience it.....I'm glad I did. But for the price, I'll rent a bike, drive my own car, eat at Cyrus, if I desire, and stay at a few other properties that are half the price, yet provide similar lodging experiences.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Royal Wedding”", "Author": "higgins08", "ReviewID": "UR78058433", "Content": "Recently attended my son's wedding at Calistoga Ranch. What a wonderful experience for all of us. From the ceremony conducted on the beautiful grounds to the wedding dinner in the wine cave, it was spectacular! If you are considering being married at the ranch, don't hesitate. Your wedding will be remembered by all attending along with a lifetime of memories for each of you.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“We've already booked our next stay”", "Author": "BriggsCass", "ReviewID": "UR70200970", "Content": "The Calistoga Ranch is expensive, but we loved it so much, we've already booked our second stay. You are in the middle of nature, surrounded by peace and quiet, yet surrounded by unpretentious luxury. It's close to everything wine country has to offer, and yet feels off the beaten track. Our \"room\" felt immense, and was actually two buildings separated by a deck (that had an oak tree growing through the middle of it!). Our deck had a hot tub, which we did not use. Because I have ridiculously sensitive hearing, we asked maintenance to disconnect the heat pump so that we could sleep with the window open and not hear the pump (which is right by the bedroom window). They were really nice about doing that for us. It was lovely to sleep with the windows open -- it felt like we were sleeping outside, being rocked to sleep by the gentle breezes. Sitting out on the deck, listening to the wind move through the trees and gazing up at the stars, was heaven. I'm sure the restaurant was great, but we didn't set foot in it, choosing instead to eat all our meals out on our deck. The two-sided fireplace was lovely to cozy up to, both inside the living room, and outside on the deck. The living room had a wet bar and powder room, and felt elegant and spacious, yet also welcoming and cozy at the same time How do they manage that? I don't know, but it was wonderful. The bed was incredibly comfortable -- down duvets and pillows, and fluffy comfiness all around. Although we travel a lot, I don't tend to sleep well in hotels, but I slept incredibly well here. The bathroom is spacious, and the outdoor shower feels private. If it is too chilly in the morning to shower outside, you can use the shower in the bathtub that separates the two sink areas. Their service was excellent -- really excellent. Everyone was extremely helpful, and went out of their way for us in the most welcoming and genuine way. We had a few small special requests to make (like the spa pump), and felt a little hesitant, not wanting to put anyone out (for instance, we requested an item off the restaurant menu to be delivered to us, instead of ordering completely off the room service menu, which is different). Everyone was incredibly kind, helping us with our requests and truly making us feel like it was no trouble at all. (I hope it really wasn't any trouble.) Sometimes in a fancy hotel, the service is good, but it feels...too fancy or formal. At CR, we felt like we were welcome guests in the home of an incredibly gracious, accommodating host. My husband and I are very lucky to be able to treat ourselves to some very nice hotels from time to time, and but we've noticed that a famous hotel name or a hefty price tag don't always guarantee comfortable beds or sometimes even basic service. The Calistoga Ranch is not just a famous name -- their reputation is well-deserved. Their establishment excels in all the categories that really matter to us, most particularly creature comforts, beauty of the location, and their truly exceptional, friendly service. We visited the property this spring, and will be back later this summer. We're sure we'll be back again and again. It's a really special place, and we feel lucky to be able to visit it.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely Setting for Pure Relaxation and Experiencing the Valley”", "Author": "bullet78", "ReviewID": "UR68767190", "Content": "We had been wanting to go here for a long time and finally did so. Our high expectations were met and we cannot wait to return someday and stay longer than the 3 days we just did. The Ranch is built into the side of a gently sloping hill and is very beautiful and peaceful. You get the sense you are really able to enjoy the outdoors but it comes with an amazing room and great service to boot. The service at the Ranch is top notch. The staff at the poolside bar and restaurant are very friendly as was everybody else we met. The concierge was very helpful with our wine tastings and dinner reservations. There were nice added touches throughout, such as jelly beans left on the bed one night, or a surprise bottle of champagne and a piece of cake that came complimentary as we were celebrating an anniversary. The room was terrific. We had a one bedroom oak creek spa lodge. The bedroom and living area are separated by a large deck with a hot tub. The deck was perfect for enjoying the early morning sunshine or for lounging in front of the indoor/outdoor fireplace late at night after a great meal. We also loved the bathroom and in particular the outdoor shower. One suggestion for them on the room would be to have some more selections in the mini bar. What is in there when you arrive is complimentary which is great, but some liquor would have been a nice touch. To their credit they are very efficient with room service requests for things that aren't already in the fridge. The pool area is pretty nice, not amazing. It's a smaller pool and the ranch does seem to be popular for families with babies and small children so keep that in mind. You will probably hear kids having a good time enjoying the pool if you go. The pool does get great sun all day long and is a very nice setting, as you views of the surrounding hills and nearby vines. The spa is on the small to medium side but very peaceful just like the rest of the place. They have a couple of heated pools and a steam room that we didn't use. The food at the lakehouse restaurant was quite good. It's a lovely setting as well, set up on top of the hill with gorgeous views of a lake and the tree-covered hillside. If you dine as the sun is going down you may see the resident deer that make the place home, including a little one if you're there soon. Like the rest of the ranch the restaurant has an indoor/outdoor atmosphere, but they do have heat lamps setup for when it gets chilly. As for the food, we are lovers of great food and they had some awesome dishes on the menu. The best was an egg yolk pasta with mushrooms and braised rabbit. Frankly amazing. Some other recommendations for your time in Napa: one of the wineries we visited was Swanson, which we really enjoyed. It's a smaller place where we had a more one on one tasting with a woman that has worked there for many years in a really cool room. You have to experience it. We also love Shramsberg, the sparking wine maker. They have a great tour that we've done a couple of times now. And do try to dine at Auberge one night, the most fantastic view we saw all weekend was from their terrace. Though we were here for a short while we were both very sad to leave. This is just an amazing and beautiful place and I can't wait for our return trip. Calistoga Ranch whatever you are doing please don't stop, keep it exactly the same.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Wonderful Honeymoon”", "Author": "Sarahybarey", "ReviewID": "UR63499102", "Content": "This place is just amazing. I came with my husband for a short honeymoon and the experience was perfect. We stayed at an Oak Creek Spa Room and it was incredible. The room was so clean and the staff was amazingly helpful and willing to help with everything. The concierge, Gloria was superb. She helped us get into the French Laundry and organized an amazing wine tour. The food at the ranch was amazing and the room service was tasty and prompt. The spa was pricey but worth every penny. To sum everything up it was an amazing honeymoon experience and I would recommend this hotel for those looking for a special weekend. My only word of caution is that the ground and rooms are so wonderful you won't want to leave. We stayed on the resort property for the majority of our stay and I cried tears when I left. For those looking foir rustic romance I cannot recommend the Calistoga Ranch enough.", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Left Coast", "Title": "“Special Occasion”", "Author": "dougboy", "ReviewID": "UR63355137", "Content": "We spent four nights at the Ranch celebrating our 25th wedding anniversary. The hotel is described elsewhere and we agree with all the complimentary reviews. The concierge staff arranged a daily itinerary which ran from ballooning to the French Laundry. Wow, I hope we can do it again in another 25 years. ;-)", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“A Unique and Wonderful Place!”", "Author": "Intoowin", "ReviewID": "UR60607608", "Content": "A unique and wonderful place! The Calistoga Ranch is understated, serene, and exceptionally welcoming. It is situated in a breathtaking and private canyon and it provided instant relaxation the minute we stepped foot on the property. We were greeted with champagne and the attention to service and detail continued throughout our stay. This is by far the finest accommodations weâ€™ve experienced in the Napa Valley and as far as my husband and I are concerned, the only place to stay when visiting the wine country! Every detail is thorough and gracious without ever being intrusive. The spa was lovely and the masseurs were very experienced. The stylish and spacious suites incorporate the beauty of the outdoors and are exceptionally comfortable with every amenity. The Lake House Restaurant and lounge offer some of the finest cuisine weâ€™ve experienced in the Napa Valley. Steve the bartender was certainly a highlight with his easy-going personality and unpretentious knowledge of fine wine and spirits. The Calistoga Ranch does not miss a beatâ€¦ Our experience from beginning to end was as picture perfect as the setting!", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mountain View, CA", "Title": "“Truly amazing”", "Author": "mountainview29", "ReviewID": "UR54921379", "Content": "I have to say that it's very hard for me to give a \"5\" in anything but Calistoga Ranch takes the cake in terms of the best service, luxury facilities, food, spa, and ambiance. We stayed in a spa lodge and everything from the indoor/outdoor fireplace to the turndown service to the yummy snacks (free of charge) in the fridge was delightful. Be prepared to spend a lot for this place and come with some small bills- a mistake I made when I needed to tip our driver. Who was expecting a driver to your room? Another thing to be aware of- this location is tucked away and sometimes hard to find. Give yourself a little time to get there. But go- it's worthwhile!", "Date": "February 1, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Houston, TX", "Title": "“Great New Years stay!”", "Author": "crisdav", "ReviewID": "UR52414775", "Content": "We just stayed 2 days at the Ranch and had a wonderful time! And we also celebrated the new years with them and had dinner at the lakehouse and was not disappointed! This is our 2nd trip to the ranch and like the time before we had a hard time leaving! We really enjoy staying there and have a hard time leaving. It is like camping with luxury all rolled into to one! They are always willing to accomodate and leave you some thing at turn down service each night. Do not miss staying here!!", "Date": "January 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Mateo Ca", "Title": "“Nature meets decadence !”", "Author": "Jamesharris", "ReviewID": "UR45596406", "Content": "A perfect enviroment to embelish nature,admire flawless landscape, rejouvanate at the wonderful spa,indulge in innovative local cuisine,and be pampered if you wish by the amazing staff ! We had a wonderful experience!", "Date": "October 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Gone to the dark side”", "Author": "NY-traveller100", "ReviewID": "UR38314361", "Content": "Must be suffering from the recession. Used to be a terrific exclusive property for adults seeking privacy and quiet. Now the pool and common areas are full of day trippers, local afternoon guests, and loud obnoxious Brits. Worst of all are the crying babies at the pool and babies swimming in diapers in the pool. Gross! Might as well go to Atlantis in the Bahamas. A joke for the money.", "Date": "August 21, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "switzerland", "Title": "“Excellent”", "Author": "jacqueline41", "ReviewID": "UR38263618", "Content": "We loved the Calistoga ranch. It's a beautiful place in a beautiful setting. Perfect Napa getaway!!", "Date": "August 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Valencia CA", "Title": "“Starry Nights”", "Author": "quela_ann", "ReviewID": "UR35332981", "Content": "We had an amazing time at Calistoga Ranch. The service was outstanding, the hot tub was nice and very private. I wake up earlier than my fiance, so one morning I went on one of the hiking trails that are on the property, it was really easy and had an awesome view from the top. The only downside was the spa, it could use a little updating...", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "toronto", "Title": "“Seamless service - a perfect get-a-way!”", "Author": "TorontoMango", "ReviewID": "UR34440134", "Content": "Our experience at the Calistoga ranch was great. It was more money than we'd ever spent on a hotel - but our stay was so luxurious - we felt like it was well worth it! Every staff member there - from the valet, to the concierge, to the cleaning staff were all really professional and provided the best service. They always went out of their way to make your requests happen - they never say no! When we wanted reservations at exclusive restaurants in Yountvile - they made it happen every time! During our stay there was a \"Mercedes Benz\" program - where you could rent (without charge or fuel charge) top of the line Mercedes Benz cars! We drove the s550 and the CLK convertible all around the Napa Valley! There seemed to be one available - most likely because most of the people that stay at the Calistoga ranch have a car that is much more elite! But that being said - we really felt like we were treated like VIPs even though we pulled up in our rental car! What a great way to unwind from a busy month preparing for our wedding - the ranch was peaceful, serene, and a real get-a-way. Sinking into the hot tub on our private terrace, gazing at the indoor/outdoor fireplace, doing yoga looking out onto a mountain range vista - it's like something out of a magazine - but it really happened! Splurge someday and stay at the Calistoga Ranch.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Terrific in every way.”", "Author": "Jlwm0560", "ReviewID": "UR34176054", "Content": "This hidden gem of a place is great for sleeping in late, relaxing by the pool, and enjoying fine wine on your private deck underneath the stars. The accomodations are simple but luxurious, and the design blends nicely with the natural area. It was so restful and peaceful there we didn't want to leave. Lunch by the pool was perfect: light, delicious, and healthy. Dinner at the Lakehouse was exquiste, and pre-dinner drinks at the bar were fun. While this place is top notch, the atmosphere is down to earth and friendly!", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Above all else”", "Author": "Loveit78", "ReviewID": "UR32159999", "Content": "You can't really describe this place accurately enough for those who have not stayed here. To say it is the nicest place you will ever stay just doesn't even begin to describe how amazing this place is. My boyfriend and I went there for a wine tasting trip and it was just amazing. The staff, the rooms everything is just incredible. We wanted to cry when we left it was so great we never wanted to leave. It was his first stay and my second and it was fantastic. Amazing rooms, great location and top notch staff. The minibar (no charge) is stocked with well over $200 worth of goodies and this place is just awesome. We stayed in a bay forest lodge and just loved it. The room layout is amazing and we loved that our room was was separated from the living room by a great deck with a fireplace. This is true luxury at it's finest. I would not recommend the restaurant but the room service was good. We had massages and they were amazing the spa is beautiful and relaxing. This place is so quiet, secure and awesome we never even locked our room, there wasn't a need to (by the way I'm from L.A. and live in Vegas so I'm not from one of those places where people don't lock their doors). Hands down the most relaxing vacation I have ever had and I hope to return very soon. 5 stars is not enough for this place. It is very expensive but I thought worth every penny so that is why I rated value high. I'm not delusional about the fact that most people would not be able to afford this but if you can it is well worth the splurge.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Great Barrington", "Title": "“This is THE place to unwind”", "Author": "Rt7Grill", "ReviewID": "UR27591891", "Content": "In my many years of travel & staying at 4 & 5 star hotels, I've never had better service! The staff at Calistoga Ranch is ready & able to make your stay about fulfilling fantasies... it was my wife's 40th birthday & we arrived to our amazing room with a chocolate cake waiting for us & happy birthday wishes. My 4 year old son & I wanted to go for a bike ride & they scoured the property & within minutes found a trailer to hitch onto the bike so we could go for a nice long bike ride (water, oranges, maps, etc. constantly are being offered). We had free use of a Mercedes 550 sedan for the day - unheard of! - just because I asked about the cars they had up front. These are just the minor details but being whisked around on golf carts all over the property & having items (movies, shampoo, room service, news paper) also delivered in moments - truly unbelievable service. The rooms (we had a hot tub on a deck connecting the 2 rooms, they are all private \"suites\") were lovely with great proprietary bath products, natural wood, fantastic sheets, pillows, etc,.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Clemente, California", "Title": "“Great hotel.”", "Author": "N6812T", "ReviewID": "UR23606703", "Content": "We have stayed at Calistoga Ranch a couple of times now. The property is gorgeous. The staff is unobtrusive. The spa is wonderful. The food is average, go elsewhere. There are too many great options in the valley. We will return every year that we can afford it.", "Date": "January 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Heavenly...”", "Author": "dancingnancy", "ReviewID": "UR23214434", "Content": "Yes, heavenly. Even in the cold rain of December. Even though scores of shingled units are packed into this cozy out-of-the way valley, just off the Silverado Trail, it maintains a sense of seclusion and privacy. Even though the front desk and pool are a half mile in one direction and the dining room and spa are a half mile in the other, the service is efficient and cheerful, as youâ€™re zipped from one end to the other in a fleet of golf carts. That is, if you can tear yourself away from your own room. The concept here is to blur the line between indoors and out. The construction and landscaping is impressive. Itâ€™s engaging to see how trees were spared by simply jogging decks and buildings around them. We enjoyed a dinner and two breakfasts at the Lakehouse. My massage and mudbath were also fabulous, if incredibly pricey. The spa, as a whole, was lovely and a wonderful retreat. Our room had only an outdoor shower (and huge indoor tub). I was a little dubious, but the showerhead was gigantic, and even in the pouring winter rain, or maybe because of it, it was blissful. Bath amenities were wonderful and plentiful. Lots of towels, beautiful bed linens. Wireless internet everywhere. An engaging and uplifting place to spend some time. That said, it would be nice if a network of walking paths connected the various guest areas. Walking along a blacktop road, dodging golf carts is at odds with the rest of the experience. There are two hiking trails, however, which we were not intrepid enough to try in the downpour.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Pure Bliss”", "Author": "Canuck14", "ReviewID": "UR22510348", "Content": "My wife and I spent three magnificent days at Calistoga in early December. If one is looking for discreet and elegant, this place is it. Calistoga is tucked away in a small side valley in Napa. The suites are gorgeous, comfortable and provide a serene and pampered escape that you'll never forget. Althought the mornings were cool, I enjoyed the private outdoor shower and during the sunny afternoons, we had the pool to ourselves. The Lakehouse restaurant was sublime, serving exquisitely prepared meals. Paired with a great wine list and attentive but not obtrusive service, Lakehouse got tops marks from us. The highlight of a world class resort ultimately comes from your interaction with the staff and how they handle the small details. On our second night, we were told the restaurant would be closed for the staff Christmas party. No big deal to us, Napa has many great restaurants to explore. Yet the resort thought of it to prepare a \"Goodie Basket\" as they called it. Well some basket. It included amazing gourmet turkey club sandwiches, a mixed green salad, cheese tray and an excellent bottle of chilled chardonnay. After that nice touch I just had to light up one of my fine Cubans (yes I'm a Canadian and we have no issues with Castro!) and sat outside on our patio, fired up the outdoor fire place and gazed the the millions of stars twinkling overhead. Calistoga Ranch is first class.", "Date": "December 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarasota, FL", "Title": "“Amazing!!”", "Author": "Shannum", "ReviewID": "UR22352479", "Content": "I really do not have the words to describe what an amazing place Calistoga Ranch is! The lodges are so nice and relaxing (we were on the porch with the fire on every single night), you barely know anyone else is around and the service was on point (we especially loved the cold waters waiting for us in the car every time the valet brought it up). We got there the day after our wedding and were relaxed within minutes. The room was more than spacious and clean. The spa was relaxing and nice even just to sit on their porch and enjoy life. The location is perfect â€“ far enough away to be secluded but close enough to shops, wineries and restaurants for when you need them. We are already saving money to go back for an anniversary in the future!", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manhattan Beach", "Title": "“Amazing”", "Author": "travelerkl", "ReviewID": "UR20374589", "Content": "I highly recommend Calistoga Ranch for a romantic, upscale getaway. The resort offers superb service, amazing rooms and lovely grounds. The food in the restaurant was terrific. Note that there's a set dinner menu each night which offers unique selections, so for those picky eaters, I would ask the waiter for the room service menu. The outdoor spa is lovely. The treatment rooms are private, but the common areas such as the jacuzzi and sitting area are out in the open and on a nice day, it's very refreshing. The ranch is tucked in the valley so it does get very hot in the summer (when we were there it was 105). Be sure to bring a swim suit as the pool is a nice place to relax and soak in the peace and tranquility of Calistoga.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Somewhere", "Title": "“Loved It”", "Author": "Blank10", "ReviewID": "UR18618157", "Content": "This place is fantastic. You'll definitely drop some serious dollars here but you get what you pay for. Top notch service, exclusive setting, great food and a great location.", "Date": "August 4, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect Place to Get Away from It All”", "Author": "blunistgirl", "ReviewID": "UR17597825", "Content": "My husband and I only stayed one night, but wished we could stay all week! I have the pleasure of staying at many luxury resorts throughout the country due to business, and this was easily one of the best resorts I've stayed at. It is definitely more enjoyable for couples as a romantic getaway. I agree the separate living room/kitchen from the bedroom building is weird, but we embraced our \"outdoor living room.\" Loved that the mini-bar was stocked with a number of great treats, including a bottle of wine, beer, soft drinks, juices, organic granola bars, chocolate to pair with red wines, water, etc....and ALL COMPLIMENTARY. I've never come across this, and it was a great touch. Everything you might need is in your room. The deck is truly perfect for your outdoor living space, and the hot tub was a fantastic way to really wind down. I loved waking up in the morning, finding myself in the middle of what seemed to be the middle of the wilderness, and enjoying coffee and the paper on the loungers without going anyway. Cream, Splenda....just how I like it...and I never make coffee in my room, but this made me want to. The outdoor shower was fantastic, but there is an indoor shower and huge bathroom w/tub as well if that is what you prefer. Loved that they had a variety of complimentary activities and hiking trails that you can take advantage of. Wish they offered yoga or pilates each morning...not the morning we were there, but oh well. The pool was nice, not huge, but had a nice little pool bar and attendants as well. The only thing that was lacking is the service considering the price of rooms. Front desk was friendly, but although we arrived at 3pm, we had to wait about 10 minutes for our room. Valet was also lacking in service for a luxury hotel. We tested them about 3 times. Had to go to the Fairmont a few nights later for a meeting and thought...THIS is what a luxury hotel's valet service is supposed to be like. They need to work on that. They also offer a good variety of unique spaces to host special dinners and events if that is something you might be looking for. All in all...Can't wait to go back.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wash DC", "Title": "“Exceptional Resort! Top Notch!”", "Author": "faxdoctor", "ReviewID": "UR17034703", "Content": "This place is incredible! The setting is literally in the woods and nature abounds. They have taken a lot of effort to keep things in the original natural state. We stayed in unit 129 and had ample privacy. The hot tub in the deck was excellent and clean. The room was very well appointed and house keeping came twice a day. Yes the layout was a little \"Different\" with the two seperate rooms but it really was not that big of an issue. It did have some benefit as well (One of us could stay up late and watch TV without annoying the other one that wanted to get some sleep). The food at the Lakehouse restaurant is excellent and the entire staff is A+ . Everyone went out of their way to make our time there the best it could be. Plus if you tell the local Wineries you are staying at the Ranch you get some extra special treatment from the wine people as well!", "Date": "June 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "silicon valley", "Title": "“Our room lacked privacy. Not what we expected.”", "Author": "clc0501", "ReviewID": "UR16772146", "Content": "We just stayed there last week (June 2008). The grounds, service, food and amenities were outstanding. Service was seamless and everyone makes you feel comfortable and special. The rooms, in my opinion are not that special. We paid $1100 per night, which is nearly double what we normally pay but it was a special anniversary. The rooms are actually portables, because they are not allowed to build on the land. It used to be a campground. The bedroom and living room are separate units (you walk though your patio to get from one to the other which is not a huge deal in warm weather but I would imagine it to be inconvenient in cold or wet weather!). They are very nicely appointed, but still, they are portables. At first we just thought that the architecture was odd, but then we realized why. My biggest complaint was lack of privacy in our unit. It's very rustic - we had a nice outdoor shower on one side of our patio and a jacuzzi on the other, but could hear other guests talking just one the other side of the fence, and had golf carts buzzing by our bedroom window - all day and evening. It was room 111 which is in between the two access roads (no cars allowed but plenty of cart traffic and some foot traffic). I would consider staying again if I were in a secluded room, but I don't think I'd pay that kind of money for it. There are other places in Napa that are just as nice, offering privacy and views in the premium price range.", "Date": "June 8, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington DC", "Title": "“Incredible experience”", "Author": "LLTS", "ReviewID": "UR13218889", "Content": "This place is top notch. Superior service, food, rooms, spa. We did not want to leave to visit any of the wineries. We spent 4 days and 3 nights at the ranch and it was an unforgettable experience.", "Date": "February 2, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "monterey,ca.", "Title": "“Understated elegance in the mountains!”", "Author": "montsalasmark", "ReviewID": "UR12991863", "Content": "What an incredble experience! Not just a beautiful property, but the staff truly made our stay unforgettable. Upon checking in, I was given a bone-shaped name tag for my dog saying \"I'm a guest of the Calistoga Ranch\" with the phone number on it too. Such a small thing but something I'll never forget. The Lake Lodge was elegant; the bed one of the most comfortable I've ever slept on. Dinner in the Lakehouse restaurant a not to be missed experience. Expertly served by Renee and Daniel, the food rivaled anything in Europe; just delicious. A must stay for couples looking for that one special romantic place. Kudos to the Calistoga Ranch! you know how to make it happen.", "Date": "January 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "boston, ma", "Title": "“Quiet, relaxed elegance”", "Author": "kippergirl", "ReviewID": "UR12968683", "Content": "This is a wonderful property with some of the very best service we have ever experienced at a hotel (and we've stayed at wonderful places). The setting is very remote so that you feel you are completely away from it all. There are 2 areas on the property where rooms are located -- one is close to the entrance/pool/exercise area. The other is close to the restaurant/spa area. We were in the restaurant/spa area and we would highly recommend staying there as you can walk to dinner or a yoga class at the spa. It's quite a trek from one area to the next so most people use the golf cart service that is provided. The service was extremely quick -- with never more than a 3 to 5 minute wait. The restaurant is absolutely terrific and well-priced for the quality and service. We ate there two (out of 4) nights because the food and setting was so good. We would also recommend contacting the concierge to set up wine tastings before your trip. Gloria set up some wonderful itineraries for us to some wineries that are far off the beaten track and that are only available by appointment. Overall, a great place with no negatives.", "Date": "January 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Worth every $”", "Author": "SodaSanFran", "ReviewID": "UR12334918", "Content": "Had a wonderful New Year's Eve at the Calistoga Ranch! The manager event sent bubbly & cupcakes to all the rooms, a nice touch. VERY pet friendly - which is why I initially chose this hotel for our special evening. The staff was very helpful & courteous. Pure luxury & highly recommended!", "Date": "January 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Great, but...”", "Author": "pcc_travel", "ReviewID": "UR11555011", "Content": "- No cell service for AT&T except in a small patch outside the restaurant. - Free Internet (wired and wireless) - Free non alcoholic beverages in the room - Rooms very very small - Staff very helpful - Small property so you dont run into other guests that much.", "Date": "December 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Cozy Deluxe”", "Author": "RLA", "ReviewID": "UR10768930", "Content": "We stayed at Calistoga Ranch in the prime autumn time when the foliage was brilliant, there was just enough crisp in the air to require a sweater, and during the grape crush when you can smell a faint grape scent circulating in the air around certain parts of the valley. This is such a romantic and cozy time to come to this region. Calistoga Ranch seems to be perfectly located in Napa Valley; easy drives to literally dozens of wineries (both Napa and Sonoma). At the Ranch, everything is new and modern, but maintains a rustic, \"outdoorsy\" charm. There is no shortage of wood burning fireplaces, both outdoors and indoors, with ample sitting space which makes for perfect wine-sipping, book-reading, or time spent just catching up with friends in a really great setting. The property is very spread out, which means calling the golf cart butlers pretty much every time you need to go anywhere... they are usually there in a matter of a couple minutes to take you anywhere you need to go on the property. Located at the base of the property near the lobby, the hotel pool and hot tub is quite stunning and there appears to be enough lounge chairs for everyone (all very nice quality). The fitness facility is half indoors and half outdoors (overlooking the hotel pool) and is really impressive - everything you could want. They have a wide variety of cardio machines, each with their own personal TV, and ample weight lifting machines as well. All equipment is new and state-of-the art; again, *very* impressive fitness facilities. Located on top of the hill of the property (take a golf cart if you're tired!) is the hotel spa. We unfortunately didn't have time to check out the services, but we heard from friends that everything about it was fantastic. For our accommodations, we had one of the least expensive \"lodge rooms\" (all are separate structures); room 136, which was about $750 or so per night (yes, a definite splurge). Our room had a nice large front porch with outdoor fireplace and outdoor furniture which was a really great touch (they hang your morning paper on the door to your porch each morning). Our actual lodge interior was divided in two main spaces: half for the beautiful large bathroom with his and hers sinks and a nice closet and half for the bedroom. This division of space seemed a bit odd as the bedroom was pretty tiny and cramped (but still very nice and well appointed). The bed was great; fantastic linens -- we slept quite well. One of the best things about our lodge (and every lodge, we believe) is the huge outdoor 'rain forest' shower. It's completely private and there are towel hooks and a place for the *amazing* Calistoga bath products...this shower experience is truly one of the best things about each lodge, especially when it's a little cold out. If you're not into it, never fear as there is a regular shower and bath inside each lodge, as well. Room 136 is especially nice if you're attending a wedding at Calistoga as the reception Wine Cave and the main hotel restaurant are literally 20 feet from your doorstep. All in all, a very nice lodge, but the living/sleeping quarters were definitely cramped. The only meals we ate at Calistoga were breakfasts and they were a solid 9 out of 10. Service at the restaurant was great and the ambiance and view overlooking the valley of Calistoga was beautiful. NB: order up a plate of \"well done crispy bacon\" and you won't regret it. Service, in general, at Calistoga was a solid 9 out of 10. They lost half a point in two areas: a) again, because the property is so vast (and steep), you'll need to rely on the golf cart drivers to take you from here to there...they are usually timely, but about a third of our calls for a ride took several minutes which was a little frustrating (perhaps they were understaffed?) and b) the friends we were traveling with had a frustrating check-in process...their room wasn't ready when we arrived (the hotel check-in time is technically 4:00...however, because the rest of the wedding party's rooms were ready, this was also frustrating and it would have been nice if the hotel offered them a complimentary glass of wine or something to ease the blow after a 6 hour flight and 2 hour drive). The Ranch did have a very high standard of service in all other areas and one to make special note of would be the concierge staff. Greg, in particular, helped line us up with a wonderful wine tour of Quintessa, Opus and Clos du Val chauffeured by \"Gia,\" with a stop at the Oakville Grocery Store and it was a very memorable day (NB: Ask Greg to mention another winery called \"Constant;\" it's also one of his favorites and sounds spectacular). All in all, we are very happy with our choice to stay at Calistoga Ranch for this trip to Napa. The other super luxe resort in this region would be Calistoga's sister property, the famous Auberge du Soleil, about 20 minutes from Calistoga, which is also supposed to be fabulous [NB: For those not wanting to spend quite so much, I'd highly recommend checking out The Villagio Inn & Spa 10 minutes away in Yountville, where I have also stayed -- beautiful property at a much lower price point].", "Date": "November 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island, N.Y.", "Title": "“Expensive but well worth it”", "Author": "sandan93", "ReviewID": "UR10089566", "Content": "Stayed at Ranch 10/5-10/8. The setting was absolutely gorgeous, They have new construction going on but do all they can to hide it from view and being there over weekend no work was going on. The rooms are wonderful. We stayed in the Oak Creek lodge units with separate bedroom unit w/ bath and outdoor shower ( great seeing steam rise up early in morning) Living room with 1/2 bath and indoor outdoor fireplace was set set up great. Personal hot tub was just right after a night of great food and wine. The Lakehouse restaurant has terrific service wonderful food and a beautiful setting. The valet staff were the most attentive and courteous we have ever encountered, traveling around grounds is done by cart, they were available at a moments notice and even have blankets for those chilly night rides. Room service arrived hot as if you were eating in a restaurant and was delicious (How often does that happen?)We have traveled to many first class destinations and stayed in some of the best hotels in the world, but staying here is definitely near the top of our list. If you can afford it, stay at least for a couple of nights. Also, their proximity to Calistoga and St. Helena is only minutes away. We will surely be staying here again next time we are in the valley.", "Date": "October 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great stay”", "Author": "sfjimmy27", "ReviewID": "UR10015258", "Content": "Very unique setting and property. Restaurant was fantastic and the rooms were very comfortable and very tastefully appointed. The outdoor living room with fireplace was fantastic for a romantic fall stay. It was very quiet and the outdoor work-out facility/pool was great. Not sure what it would be like at capacity because it wasn't very large. Staff fantastic. Looking for something out of the ordinary, this is great find.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Well worth the $$$”", "Author": "LAtravelfan", "ReviewID": "UR8591430", "Content": "Calistoga is an amazing place and well worth the price. Our room was outstanding...bright and fresh with a ridiculously cozy & comfortable bed. Our room was so private. we just looked out into endless trees and landscape.. you didn't even notice any other rooms around you. waking up in the morning and looking out into the beautiful Calistoga hills from our bed was a treat! The outdoor shower is the same way....you could just look up staring at the trees forever. The Lakehouse restaurant is one of the best meals I have ever had...with a very romantic outdoors location. we lingered there for 3 hours just enjoying the moment. Overall lodge staff is attentive without being overbearing...every time we called for a golf cart ride they arrived within less than a minute and were always SO friendly. well-appointed workout room is fabulous. they also have biking and running trail maps for you in the room so the first morning I ran along some beautiful wineries. And the concierge staff was immensely helpful, pikcing out some amazing restaurants that perfectly matched our style (and budget!) I really can't think of a single thing wrong with Calistoga. it was SO relaxing, private and luxurious. I'm already dreaming of going back in the fall/winter as I can imagine it is even more amazing in the fall weather!", "Date": "August 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "florida", "Title": "“wow”", "Author": "hartdot", "ReviewID": "UR8515915", "Content": "It is the best of calif and napa. It is such a pleasant property..quiet/nature all around you but the best conveniences one could want//// The rooms are wonderfully appointed, the food great.. the pool and work-out area out there in nature...the ambience of the resort is amazing", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Best days of my life”", "Author": "Always4travel", "ReviewID": "UR8490216", "Content": "This resort was as close to heaven as you can get. The property is gorgeous and left natural enough to be really special. The Bay Lodge we stayed in was awesome. The outdoor shower was so much fun that we got up early just to enjoy the steam rising since the air was still cool. The wireless internet access on the deck area was free and super for sending e-mails home to make everyone jealous. We were not planning to bring our dog but circumstances were such that she came. She was treated like royalty with a special bed, bowls and collar tag waiting when we got to the room. The service was impeccable and we wanted for nothing. We were not sure what to expect but decided to try CR. We will be back!!", "Date": "August 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "denver, co", "Title": "“Quaint Location, Nice for a Special Occasion, but construction going on”", "Author": "judyf", "ReviewID": "UR8443330", "Content": "We stayed for 2 nights (Sun, Mon, Tues) for our anniversary and booked the 'starry night package' which includes a dinner for two, massage for two and stay in the deluxe lodge room. This is close to a 5 star resort with only few problems to correct. However, their main problem cannot be easily corrected as they are under major construction to add more private owned 'rooms.' I would suggest that they find time in the fall & winter to work longer shifts than during high season of summer. We were in room 124 which was far enough away from the construction but we were located next to a bridge which you could hear the golf carts traveling over (even at 10:30 at night.) The Pros - very friendly staff, always had our car started, top down with cold bottles of water inside, and/or air conditioning running. The restaruant 4 course meal with the package was one of the finest we have ever had. Again the staff was very good and the restaraunt was quiet that evening. We also received a dessert from the chief with 'Happy Anniversary' spelled out in choclate on the plate . The grounds were impecable with bikes to use for free, hiking paths and bocci ball. The rooms with the connecting deck and outdoor furniture was very unique. The beds and towels were fluffy and the outdoor shower was incredible. The decor and audio systems were very nice. The indoor/outdoor fireplace and private hot tub on the deck was also very nice and used often. Our room was ready when we arrived at 4:00 (although we heard other people's rooms were not) - an hour after arrival we received a complimentary bottle of champagne and dessert for our anniversary. All room service was quick and accurate and food is great. Fridge was stocked daily with complementary beverages and bottle of wine. Room service very good. Cons - the outdoor furnture cushions were very stained/dirt. There were many young kids in the pool all day when we were at the pool - for $1300/night I don't want high pitched screams and splashing. The service at the pool (on Monday afternoon) lacked severly, young kids serving - very disapointing. I was very annoyed when the waiter at the pool was pushing us to finish our food and sign the bill by 5:30 when the pool service is open until 6:00. We had to go to the bar 2/3 times to get our drinks. Much traffic on the main path through the resort to the restaurant during the day. Some servers to the room didn't speak much english. Next to the bed there was a breakfast order menu of which we filled out every evening and hung by the door. At check out we find out that we are charged for the breakfast - and there were no prices listed on the order menu!! We figured breakfast was included in the $1300/night fee. I told the front staff repeatedly that you cannot offer breakfast service/any menu showing no prices and make customers pay - but they didn't do anything. All other dinner and beverage menus in the rooms showed prices. All in all one of the top resorts we have been to - we have been to Broadmoor, Peter Island, Ritz-Carlton... We really like the Calistoga area and will return to the area but not the Calistoga Ranch until construction is finished or they offer very reduced rates. We were one of the lucky ones that weren't directly affected.", "Date": "August 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, CA", "Title": "“Beautiful, unique, luxurious”", "Author": "hoteljunkies", "ReviewID": "UR7605160", "Content": "We stayed just one night. Smiles aplenty by the staff. Very friendly and willing to help. Did I mention smiles? Overall I enjoyed the stay. I loved the decor of the units, but thought the separation of the living room from the bedroom was unnecessary. It was nice to have a complimentary honor bar (non-alcoholic items were free). I loved the outdoor shower - very romantic. The restaurant served excellent food. The spa massage therapists were awesome - very knowledgeable and caring to your needs. The restaurant and spa are supposedly for resort guests only, which keeps the priority for the guests. What I didn't like was how our deck faced the front of the units, and not in the back like I had imagined. Also, the bedroom windows were large but also faced the front. That lack of privacy was a little disappointing. It kind of defeated the purpose for me and for why I paid the high rates. Another problem for me, which wasn't major, was that I didn't know that the resort was pet-friendly until I got there. I have allergies to certain animals. Although our room did not appear to have any animal hair or odor, many pet owners did not keep the animals on a leash and think that everyone is ok with that. I have kids, but I still don't like when people don't control their children. Why should pets be any different. Not everyone is comfortable with animals, especially when allergies are involved. I would stay there again, but only if I got a substantially reduced rate.", "Date": "May 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Annapolis, MD", "Title": "“Nice but construction and noise ruin even the nicest room experiences”", "Author": "ChrisGAnnapolis", "ReviewID": "UR7551872", "Content": "We were very disappointed with this, our second visit to Calistoga Ranch. We booked the most expensive accomodations at the resort for two evenings and were placed in the Creek room closest to the bridge to the active construction area. We were livid to wake to the beeps of backing construction equipment, the rumble of large trucks across the bridge and, worst of all, a bulldozer left idling unattended outside our bedroom window, still on the \"guest\" side of the bridge. Needless to say this was completely unacceptable and would never happen at another resort of Calistoga's quality and price range, Post Ranch Inn for example. To the resort's credit, they gave us an extra 30 minutes on our massages and moved us to the Estate Lodge for the second of our two nights, which we appreciated, but the point of coming to Calistoga is to relax and not have to be bothered with the outside world for a day or two. Unfortunately, on this visit, I still found myself having to resort to very direct conversations with senior people at the resort before a very obvious problem was resolved that should never have occurred in the first place. We were disappointed on our first visit to the resort with the noise and traffic outside our room on the high side of the road and so we booked at the creek side (at a higher price), only to find ourselves closer to the lodge construction. We won't return, if ever, until construction is complete. Bottom line is the resort needs to seriously reexamine its approach to noise and traffic, including truck traffic past the lodges to the restaurant. Until then, you can do much better pretty much anywhere for $1000 per night.", "Date": "May 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Palo Alto, California", "Title": "“Mixed impression”", "Author": "northerncalifornia71", "ReviewID": "UR7487185", "Content": "We just returned from a three night stay at Calistoga Ranch. Bottom line: this is a nice enough property, but for $1100. per night we expected much, much more. Pros: The design of the room was basically pleasing, with finishes in slate and wood that are very complementary to the canyon. The outdoor shower in particular was a real treat...very relaxing. I agree with another posting that the furniture is rather standard, with the one exception being the very comfortable bed. The spa is excellent, with a nice open-air layout and well-placed soaking pools and lounge chairs. I had a massage and facial, and the facial was outstanding. Sharon has excellent skills and is highly knowledgeable about organic products. The Lakehouse restaurant is very good. Nice design and decor, friendly staff. Menu somewhat limited for a vegetarian, but our meal was excellently prepared and presented. Excellent valet service...our car was pulled up quickly with our advance call and valets always helpful. Cons: The layout of the property is reminiscent of a condominium complex, with \"units\" closely spaced and a non-high-end/homogenous look and feel. Not offensive, but not especially pleasing....strange choices, given all the design options available today. This could be relatively unnoticeable if the property was committed to outstanding service and attention to detail, but the staff has not trained at high enough standards to overcome the limitations in layout and design. We had specifically asked for a room with a nice view, and ended up with a view of the golf cart path up the center of the property. Not only was this less than pleasing, but we could easily hear the constant flow of cart traffic as well as continual conversations among the housekeeping and room service staff. Really disruptive if you would like to hear the birds or just enjoy some quiet. We asked to move immediately upon arrival and were told it was not possible due to high occupancy. No affirmation was given of our original request for a view, and in fact we were emphatically reminded that our confirmation indicated a Forest room vs. a Creek room and that basically we should have known that a Forest room doesn't have a comparable view. Disappointing reaction from the staff, to say the least. And no follow up on the subject on subsequent nights; no offer to move toward the end of the weekend. Any gesture from management would have been appreciated. Again, this is an $1100. per night experience. The living room furniture was downright uncomfortable. We like to end the day with a glass of wine and a chat, maybe a little reading, and we found ourselves shifting constantly due to the uncomfortable sofa and chair. Towels were very rough...noticeably so. I am surprised that this still stands out in my mind! Room service breakfast was high quality but inferior in service/delivery. On two of the three mornings we ordered meals, we had to call back for corrections that were not minor. Staff should have better training in response time and English language. The hot water kettle in our bar did not function correctly, and no replacement was given after three separate requests during our stay. Also, we repeatedly asked for extra ginger ale in our minibar, but none ever materialized. The housekeeper arrived once while we were there to restock the minibar, but the dispatcher had not taken the time to distinguish between our specific request and a basic restocking request. Furthermore, the housekeeper told us we could only have one can of ginger ale at a time. More training is obviously needed in this area. Service at the pool area is very spotty, nonexistent as the day progresses past mid afternoon. Dirt was tracked into our living room on several occasions...looked like coffee grounds, and immediately noticeable upon our return to the room in the afternoons. Lastly, and in our opinion likely indicative of the overall management philosophy, there was no action on behalf of the management or staff that made us feel especially acknowledged or welcomed. Everyone was basically friendly, but we left feeling like a more thoughtful reception and experience can be had at your standard Ritz or Four Seasons, not to mention similarly priced Northern California properties like the Post Ranch Inn in Big Sur. We had given some personal details during the reservation process that easily could have been acted upon to make our experience better than average. And the overall service could have been so much better. Disappointing", "Date": "May 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Fabulous Meal”", "Author": "Cinderella_Dearest", "ReviewID": "UR7472530", "Content": "I had an incredible dinner at The Lake House at Calistoga Ranch. The service was outstanding. My waitress, Hilary was attentive, charming, professional and made sure I had everything I wanted promptly in ther most gracious manner. The food was great, both in taste and presentation; the dining room and its views are beautfiul, and I can't recommend this place for dinner enough !", "Date": "April 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Oasis in Wine Country”", "Author": "besita74", "ReviewID": "UR7236782", "Content": "I have visited the property before but did not stay there. I thought it was going to be nice but I didn't realize how much I would love it!! The cottage was very large and modern, and the balcony with a whirlpool was perfect for enjoying the fireplace and sitting outside in the tranquil setting. The outdoor shower - how cool is that? HEAVEN. The service was phenomenal as well. Everyone was courteous and relaxing. The restaurant experience was lovely as well- delicious (not 5 star but good). If you go you will not want to leave! Trust me, I want to buy there.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Overpromises, Underdelivers - save your money”", "Author": "mrfrancophile", "ReviewID": "UR7155263", "Content": "I more than hate to dis a place that others love, but I have to inject some realism here about Calistoga Ranch. My wife and I love travel. We love Inns and we love B&B's and we love Hotels. We've stayed in cheapo hotels that we've loved and we've stayed in luxury hotels that we've loved. The key, I believe, to loving a restaurant or hotel or shop is value. We can love a $2 taco at El Metate like we love the $18 foie gras at Gary Danko...but if El Metate's tacos were $18 or Gary Danko's foie appetizer were $50 we'd say \"What the...?\" This was our problem with Calistoga Ranch. Value for the money. At $200/night, our stay would have been fabulous. At their prices, it was an outrage. It all started off well enough...(wavy blur as we experience a flashback). On their web site, the rooms sounded amazing. The private \"spa\" lodges offer 1200 sq. ft. of space, indoor-outdoor fireplaces off the living room, a private deck w/a hot tub and a bedroom w/a huge bath and an outdoor shower. Wow! Sounds amazing, huh? We thought so. Perhaps even enough so to warrant the $800+ per-night rate. This was our anniversary and we were excited to go there. We'd been planning it for a while and I had even spoken with the sommelier at their restaurant, The Lakehouse, days in advance to request that they bring two glasses of champagne to the table right after we were seated at our dinner there, the night we arrived. This was just a little surprise gesture for my wife. When we arrived, the property looked amazing. You cross a pretty wooden bridge and drive up to their lodge-like office, built of natural wood and stone, with a lovely outdoor lounge area with a roaring wood fire, drinks, and newspapers available. The property is valet-only, so we had to leave our car and be driven in a golf cart to our room...which we declined since our room was perhaps 100 feet from the office door. The valet staff were responsive, pleasant, and helpful and one gentleman brought our bags to the room and showed us around our lodge. Walking in the gate to our lodge, you enter the deck, with a trellis overhead and dividing the indoor living room space to the left and the bedroom space to the right. The deck was spacious and looked out over trees - very peaceful. The hot tub was over by the right edge of the deck, right outside the door to the bedroom. Sounds romantic, huh? Well, the hot tub was private, in that only we had keys to our room, but it looked out over three other lodges and right below the open railing next to the hot tub was the Ranch's Bocce Court. Private? Are we going to get naked and frolick in our \"private\" tub while other guests wave from their lodges or toss the bocce balls below us and wink knowingly? I don't think so. Large room.......check Private deck.......well, there's a deck, but it's not private Private hot tub...well, there's a tub, but it's definitely not private What next? Oh yeah, the fireplace. There was an indoor-outdoor fireplace, but it was both completely behind glass on both sides and was strictly a gas fireplace. Don't get me wrong. I'm not against gas fireplaces. They're great at the Lodge at Sonoma for $179/night or Santa Fe's Inn of the Anasazi at $250/night, but for $800/night, I'd expect a real, wood-burning fireplace. Gas just doesn't say \"top-of-the-line\". The furniture in the rooms was simple and pleasant, but more Marriott than Auberge. The floors in the bedroom creaked and squeaked - something you'd expect in a 100 year-old B&B but not in a newly-built lodge that charges more than any other hotel in wine country. The heating system blew so loudly that we had trouble sleeping at night - a contrast with the Hotel Andalucia in Santa Barbara where we stayed a few weeks later (for about a quarter the price) and where the HVAC system was so quiet we had to check to make sure that it was on. The DVD player in the bedroom, which my wife tried to use for her yoga DVD, rattled like an idling Harley motorcycle and failed to deliver an image to the screen...something they might have checked out before we checked in. The food, both at their restaurant and in the room (for breakfast), was excellent. Kudos to their kitchen. But when we did go to their restaurant for dinner...the champagne that I had requested from the sommelier for when we sat down was conspicuously absent. I didn't want to remind them at the time because the gesture was all about having thought of it ahead of time, not at the moment. No big deal. But at the end of the meal, after having ordered glasses of white, red and dessert wines, they brought the Champagne. Arrunnnhhh? What was up with that? Who has Champagne at the end of the meal? And was this the champagne I had requested or some oddly-timed gesture of the house? We checked our detailed bill upon checkout and...yep, they charged us for the champagne that didn't come when we had requested it and did come after we were done with the meal. On the bright side, they didn't argue when we asked that they take it off the bill when we explained that it didn't come when requested - we were just sad that in such an expensive and highly-rated hotel that the gaff should have happened in the first place. My wife tried their spa and felt that it did deliver on its pricey promise...even to the point of being extraordinary. Since you can go there without staying at the hotel, perhaps that's the ticket. Net net...this is an attractive hotel that would be a \"perfect\" getaway in wine country for $300/night. At $800/night, it's a ripoff. There are dozens of places with real fireplaces and lovely views at half the price. Save your money and get yourself a dinner at the French Laundry.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buckinghamshire", "Title": "“Fantastic place to chill after a busy holiday”", "Author": "nunwin", "ReviewID": "UR6838997", "Content": "The Calistoga ranch is wonderful and certainly the best hotel I have stayed in, in the USA. Whilst normally travelling on holiday to the Far East rather than the USA we normally stay in the Banyan Tree or Four Seasons type resorts. The calistoga ranch certainly matches the levels of service offered at these top hotels. The rooms are fantastic and certainly large enough to relax comfortably in. The lounges in each room have your own fire place which is great to come back and chill out next too whilst watching a dvd with and drinking a glass of wine. The restaurant is excellent as is the great wine list however if staying more than a few nights the menu choices could be a bit limiting although if asked i am sure the chef would cook whatever you wanted. However there is also a great choice of restaurants in the local village of Calistoga to choice from. The spa is superb with a great selection of treatments. This is a top class chill out hotel and we will be hopefully be back again one day.", "Date": "February 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Poorly planned expensive resort”", "Author": "sjrbt", "ReviewID": "UR6806380", "Content": "This resort has all the potential for a world class resort and none of it is even close to being realized. The planning of the resort is perplexing--they look like army barracks on the outside with a $700+ per night price tag. The resort is definately off the beaten path---if you want to be away from it ALL--you'll love it here. The separate bedroom/living area is also poorly planned. The rooms are private bungalow type rooms---the bedroom and bath building are separated by a semi-covered patio from the living room area. In rain or cold--it is ridiculous to go back and forth. The resort is a tangled web of paths around the resort which most of the time require a golf cart to get around (especially if the weather is not agreeable). The golf carts take forever to get to you. The staff is a bit snotty--especially the staff at the restaurant--we didn't even eat there because they were so unwelcoming. I apologize for not remembering names, however, a female conceige was horrible. A male conceirge, on the other hand, was fabulous and possibly the nicest one we've ever dealt with. He was the only bright spot in the staff. Room service was slow and the food was marginal. The workout area was outside--while nice if it's 70 degrees out but unbearable in the cold or heat. We were there in the rain and the wood floor of the workout area was drenched (it does have a ceiling and 3 walls (the 4th wall is totally open). I thought we'd kill ourselves walking on the slippery floor. I do not recommend this resort---your money would be better spent elsewhere. Everything appears luxurious, however, it has so many problems you'll be sick over what you spent here.", "Date": "February 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Gorgeous luxurious accomodation if you can spend the $$$”", "Author": "aitravel", "ReviewID": "UR6636024", "Content": "We stayed here when we were getting married. Service is impeccable! The hotel is set in a great natural setting. To say the accomodations are great would be an understatement. The outdoor shower is amazing; closet space is perfect; the bed, the sheets, and the pillows were nothing short of luxurious. The deck was perfect for lounging outside at night with a glass of wine, looking up at the stars and hearing the crickets chirp. The living room is in a separate area from the bedroom and had its own bar area and its own powder room. The spa treatments were wonderful! Perfect getaway if money is no matter.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nature At Its Best”", "Author": "Breckdaddy", "ReviewID": "UR6563208", "Content": "We recently spent 2 nights and 3 days at the Calistoga Ranch and it wasn't enough! We would have loved to stay longer! My wife and I are frequent travelers and as much as we don't like to admit it...we're total hotel snobs. We use tripadvisor all the time when making reservations and this site didn't let us down again. We've stayed at another Auberge resort (Palmetto Bluff--also amazing!) and we were very excited. We pulled up to the property and we loved the fact that it was very removed from one of the main roads. We arrived with an extra guest and could no longer stay in one of the deluxe rooms--the staff was very accomodating and found a one bedroom suite so that we could all stay comfortably. The room wasn't ready, but our pre-arranged driver for wine tasting was--so off we went! When we finished our tasting tour with Bob from Prestige Limo--we were escorted to our lodge with a glass of complimentary wine in one hand and the most delicious hot chocolate in the other. We arrived at our lodge, which was made up of two separate cottages, at night. Both cottages were beautiful with a shared deck and an indoor/outdoor fireplace. The den cottage had a pull -out sofa (which was extremely comfortable for a pull-out), bar with complimentary everything except the hard liquor and beer, and a half bath. The other cottage had a king-size bed that was uber-comfortable and a great, huge bathroom (plus outdoor rain shower that was awesome!). We were even more excited the next morning when we woke up and really took in the surroundings. You really feel as though you are one with nature. It's beautiful and invigorating. We ate at The Lakehouse restaurant. It is is on the small side, but the food was good and they were extremely accomodating (especially for my wife who has a ton of serious food allergies.) We used the gym--which was a nice size and had a beautiful view of the Calistoga winery and pool (half of it is outside). A nice touch is that they have complimentary water, Gatorade, fresth fruit and Powerbars. We also took advantage of the amazing spa. My sister and wife received oatmeal and brown sugar scrubs with massages--and couldn't say enough about their experience and the environment. We didn't have enough time to take advantage of all that is offered at Calistoga...but there are guided hikes, yoga, and more offered on most days. Very cool! We did get to take part in a wine tasting hosted by one of the members of Calistoga Ranch--and it was great! It was nice to be able to meet other hotel guests and members. Highly recommend it if there is one offered during your stay. We had a few little glitches...but the Director of Operations contacted us personally and took care of things quickly! We hope to return to Calistoga Ranch again and are jealous of anyone going soon! P.S. No matter the weather make sure you shower in the outside Rain shower!!", "Date": "January 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aurora, CO", "Title": "“Privacy, luxury and peaceful tranquility at Calistoga Ranch”", "Author": "want2getaway", "ReviewID": "UR6150315", "Content": "Just returned from 3 nights at the Calistoga Ranch and it was heaven! The 1,100 sq ft lodges were amazing, simple yet elegant making you feel more like you were home than at a resort. The amentities were exceptional including an indoor/outdoor fireplace, large deck, an outdoor shower garden. and one of the most comfortable beds ever. The service was outstanding from check-in to check-out., the perfect mix of catering to your every whim yet leaving you alone. The food was excellent. The spa was wonderful, with the outdoor fireplaces and whirpool area. The treatments were top notch. Having stayed in several high end hotels (Ritz Carlton, Four Seasons) the Calistoga Ranch exceeded my expectations and then some. This is the place to go to relax and get away (leave the kids at home!). The property is so quiet, peaceful and relaxing that you will not want to leave. We had planned on several days of touring the wineries in Napa, but only left the Ranch once. It was that special. You won't be disappointed.", "Date": "November 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meadow Vista, California", "Title": "“Beautiful Propery - Awsome Service”", "Author": "ariemay", "ReviewID": "UR6087017", "Content": "This exclusive getaway made for a perfect, perfect weekend in the Napa Valley. The \"room\" was wonderful - actually two rooms which I loved. The double sided fireplace was a nice touch. I found the simple yet elegant decor very soothing. Very spa. A bed this comfortable is hard to leave! The outside shower is enchanting! And not having to pay $4 for water or soda out of the (very cold!) mini-bar is super. The on-site spa is delightful: loved the coupleâ€™s room! The service was superb - start to finish. We checked in very late (Midnight) - when we called in to tell them, they asked if we would like to have a sandwich waiting. The staff are all professional and friendly -very classy yet approachable. The security was excellent: every guest is accounted for with the staff at all times! When you check out your car is brought around and ice cold bottles of water are put in your cup holders for the trip home. Regarding the kids - it's Napa - get a babysitter! (or go to Disney)", "Date": "November 8, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Texas", "Title": "“Great Place to Stay”", "Author": "winewoman63", "ReviewID": "UR5553285", "Content": "Calistoga Ranch was fabulous! We just got back from four nights there and it was not enough! This is our favorite new place. Service was excellent, food was outstanding and they were child and pet friendly. Wonderful place to stay and relax, go hiking, swim, great workout facility. I can't say enough good things about this place. We will definately be back!!!!!", "Date": "August 3, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“Paradise at Calistoga Ranch!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5459817", "Content": "My husband and I spent two glorious nights at Calistoga Ranch to celebrate our 10th anniversary. We loved everything about it. The lodges are beautiful - well designed, well-maintained and spotlessly clean. Each \"room\" is actually a free-standing lodge with two buildings separated by a spacious deck. The concept behind the resort's design is \"indoor-outdoor living.\" Our lodge had a living room, fireplace, wet bar and half bath in one building, and the master suite with large bathroom (two counters, each with its own sink) and closet in the second building. The fireplace in the living area is double sided, one side facing into the living room and one facing the deck. There are comfy chairs and ottomans on the deck for lounging. The bed has a feather bed and a down comforter, with lots of pillows. The absolute best feature is the outdoor shower, located on a separate, private deck off the master bathroom (though here is also an indoor shower and tub if you prefer). The service was exemplary. Shortly after we arrived, we received a note from the manager wishing us a happy anniversary, along with a bottle of champagne and a chocolate cake! In addition, whenever we called for any type of service, our needs we met within minutes. For example, my husband called the front desk late the first night and told them he had left his prescription medicine in our car, which had been parked by the valet (valet parking is included). Not five muinutes later, his medicine was delivered to our door. There are shuttles (golf carts) buzzing along the roads constantly, so you can always catch a ride to wherever you want to go on the resort. Towels are changed twice daily. Turndown service on the first night included a box of locally handmade chocolates, and a bottle of massage oil the second night. My husband and I both had massages at the Bathhouse spa - although I choked a bit on the prices at first, I have to admit it was an hour of pure bliss. The massage therapists did an excellent job. There are warm and cool pools to soak in before or after the treatment, and the changing room/showers have everything you could possibly need afterwards, from toothpaste and deodorant to combs and hairdryers. We had breakfast and dinner at the Lakehouse restaurant on-site, with excellent food and service both times. The restaurant has a nice deck with a view over a small lake. Lunch is served at the bar by the pool, and was also very tasty. The poolside service was great - one afternoon it was very hot and the staff offered us cold towels in buckets of ice to cool down. If you are ready for a splurge, this is the place to do it. This is the ultimate romantic getaway!", "Date": "July 12, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Coral Gables, Florida", "Title": "“Calistoga Ranch -- Well Worth It”", "Author": "A TripAdvisor Member", "ReviewID": "UR5447852", "Content": "We stayed at Calistoga Ranch in late June of 2006 for four nights. The overall trip was truly memorable. Upon arrival we were upgraded from a deluxe lodge to a forest lodge. I believe that the Ranch has many more of the forest lodges than the deluxe lodges and that may have been a reason why we were upgraded. The forest lodge is compromised of two rooms: (1) the bedroom and bathroom -- with a king size bed, a large bathroom with double sinks, a shower/tub and an outside shower; (2) the second room is a living room with a sofa, two chairs, a bar, another bathroom and a fireplace. I believe the two units combined are somewhere around 1100 square feet. The fireplace is indoor/outdoor. The two rooms are connected by an outdoor living space with two chairs, a table and access to the fire place. It was a really unbelievable space that created a feeling of relaxation. The service was excellent. We recieved a complimentary bottle of wine (Calistoga Ranch Chardonnay) the first night. On the second night we received a bottle of Vueve Clequot Champagne. On the third night we received a cheese tasting plate. In addition to this, all of the non-alcoholic beverages in the mini-fridge are complimentary as well as all of the snacks. The staff at Calistoga Ranch was great; overall they appeared extremely young -- they were all personable and accomodating. The pool was extremely nice; not a huge pool, but extremely relaxing -- a bar is located above the pool area; the service in the pool area was again great. The resort was 95% full the four nights we stayed there according to numerous staff members, but it certaintly did not feel that way. Because of the way that Calistoga Ranch was developed -- with individual lodges, you really never run into other guests unless you go to the pool, restuarant or spa. I thought it was extremely well designed that way and never felt crowded. We went to the restaurant the Lakehouse for dinner. The food was very good and the wine list was interesting. The service at the restaurant was very good. I thought the overall experience there was above average, but probably not on par with some of the unbelievable restuarants in the Napa/Sonoma area. If you are expecting French Laundry this does not compare, but it shouldn't. For what it is though, a really great resort restaurant. The spa was relaxing. My wife and I had a treatment there. The spa was somewhat small, but I did not feel crowded. I do not have spa treatments regularly, so I am probably not the best person to judge the spa. Overall I thought that the treatment was relaxing and reasonably priced. Although Calistoga Ranch is expensive, for the many hotels and resorts in the area, I believe for what you get it is reasonably priced. The experience was the most relaxing I have ever had on vacation and I can't imagine better service. It is a much different experience than your run of the mill hotel; it really creates a feeling of being at an up-scale summer camp. You have the opportunity to hike right outside your front door and there is unbelievable foilage everywhere you look. In addition its location is excellent -- not in a busy area -- off of the Silverado Trail near St. Helena. Easy access to Napa and to Sonoma. I travel a lot for work and stay at many nice hotels and resorts throughout the country and abroad (i.e. Ritz Carlton, Four Seasons, Mandarin Oriental). Calistoga Ranch not only matched but exceeded in many respects the quality and service that you should expect at these establishments. Highly recommended.", "Date": "July 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "New York, New York", "Title": "“Very Relaxing”", "Author": "beachbug", "ReviewID": "UR5383126", "Content": "Just returned from a three night stay and overall I was extremely impressed. We had one glitch, which I will note below, but otherwise my experience there was superb. Resort and Rooms: I stayed in a deluxe lodge and I think I really lucked out in terms of location. The size of the indoor living space was a little small, but the large bathroom and outdoor living space more than made up for this. It is so beautiful there that you will want to spend most of your time outdoors anyway. The resort itself does an amazing job of making the most of its natural location and the outdoor fireplace and shower were a very nice touch. My lodge was located near the restaurant and spa which was great, because we could just walk to these places. Pool area was another highlight of the resort. It was the perfect size. I never felt like I was at a mega resort although the weekend I was at the Ranch there happened to be a wedding and it became apparent that the pool area may have been understaffed. Otherwise the pool service was terrific and the lounge chairs were very comfortable. Restaurant: I only had dinner once at the restaurant and breakfast there once. The staff was very attentive, even bringing us free champagne when they heard it was my birthday. The portions at dinner are small but I found them to be quite filling. I am not a big eater and I can see where someone with a more hearty appetite might come away unsatiated. Breakfast was especially good and we also loved room service. Our deck was so nice that half the time we didn't want to go anywhere else to eat. Spa: I had the \"Traditional\" at the spa and overall I enjoyed it. The person I went with had the same and we both felt that the spa was above-average, although maybe not exceptional. I loved the indoor/outdoor treatment rooms and the view from the relaxation area, but I could see where the space is not that large and if it was fully booked it could become uncomfortable. Overall I would recommend a treatment there, just because if you are spending this much money to stay some place you might as well try the spa. It will enhance the experience. Service: Service was exceptional. Everyone goes out of their way to please you, except we had one glitch when we checked out. For the entire duration of our stay the men who escorted us to our lodge on the golf carts would always pull up the hill in front of our lodge and drop us at the stairs. They did this when they checked us in with our luggage and every time thereafter. On the morning of checkout they refused to pick us up on top of the hill and the individual at the front desk told me that the five other individuals that had been shuttling us back in forth the entire time were not supposed to bring the golf cart all of the way up and that they would not pick us up there. This may not be a problem for most people, but I was travelling with a senior citizen and we ended up having to carry most of our own luggage down the hill, because not only had they refused to pick us up at the top of the hill, but they seemed to forget that we were checking out even though we told them multiple times. I am not someone who expects staff to cater to her every whim, but at these prices I also would not have expected them to refuse to do something they had been doing along. I have to say I found the attitude of the individual at the desk that morning to be just not fitting with the rest of the staff at the resort, but I think that person may just have been an outlier. The morale of this story is if you are travelling with an older individual or someone who may have some type of physical disability you may want to double check the location of your lodge and both the number of hills and stairs to where they will drop you in a golf cart. Other than that the trip was terrific and I really loved the Ranch. It is the perfect place if you want to totally get away and enjoy the vineyards or even just nature.", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“Dynamite Joint!”", "Author": "stevieNewYork", "ReviewID": "UR4740342", "Content": "Fantastic place, beautifully appointed, friendly, hard working and caring staff. The restaurant which the staff really pushed was worth the pushing food was dynamite. I took my wife there for her birthday we both can't wait to return.", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Collierville, TN", "Title": "“Loved the Ranch”", "Author": "A TripAdvisor Member", "ReviewID": "UR4599170", "Content": "My husband and I went for our anniversary, it was a fantastic choice. The service was wonderful, we couldn't have been happier! It was hard to make ourselves leave the property because it was so relaxing and enjoyable. Overall it was the best hotel we've stayed in. We will def. return", "Date": "March 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Loved the ranch!”", "Author": "oneLmichele1111", "ReviewID": "UR4107646", "Content": "My husband and I were looking to go to Napa and relax. Well, we did just that. The service was excellent, they could not do enough. The surroundings were peaceful and private.My husband loved the outside shower. The suite was spacious,the bed very comfortable. Mellow feel in the living room. Nice touch with the complimentary minibar and wine. great stereo system. Concierge was very helpful! It was very hot- 100-110 everyday but the staff would always cool the car down before we got in, ice cold bottled water was waiting for us in the car, nice touch. At the pool, cold towels were served as well as their iced tea-lemonade concoction. Comfortable lounge chairs! The restaurant was located in a tranquil setting- watch out for mosquitos(time of year)... The food was great. Try the tasting menu. I had a facial which was one of the best I ever had. My husband enjoyed plunging in the mineral springs water hot tub. Very laid back understated class. I highly recommend if you want pure relaxation!", "Date": "November 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Very relaxing, beautiful resort”", "Author": "A TripAdvisor Member", "ReviewID": "UR4074789", "Content": "This was our first visit to Napa, and our first visit to Calistoga Ranch. Both were wonderful. Trekking around the valley all day can be tiring and the Calistoga Ranch is a fantastic oasis to return to. We had a great time. The suites are luxurious, comfortable and private. We had an Oak Creek suite which was very private. My sense is that some are considerably more private than others. The beds are super comfortable and we enjoyed three nights of blissful sleep. The setting itself in the valley is amazing. The hills surrounding the resort give a feeling of isolation and remoteness from the outside world. The hotel has a hiking trail above the valley that is a MUST do! We were the only couple we saw using the trail in the 3 days we visited and we were so happy that we did it. Please try it, you will note be disappointed. The views are spectacular. Service was good and the restaurant was excellent, although we found the wine list to be surprisingly light and very expensive. There are restaurants with much deeper wine lists in the area. They need to work on this point. The other problem we had, is that there is no area to relax other than your room. There is no lounge area to get a coffee or snack. You have to go to the small bar area at the restaurant. Not ideal... All in all a superb resort. Well managed, well run and very quiet and private.", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Redwood City, CA", "Title": "“Very nice relaxing stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3837011", "Content": "My husband & I received a spa lodge gift certificate and used it for our anniversary. I was very impressed with the property. They certainly took care to make the rooms as private as possible by the enclosures around the private decks and the foliage. I agree with everyone that it will seem much more secluded once the foliage matures, but I never felt exposed while on my deck or in the hot tub. The suites were enormous â€“ I have never stayed in such an expansive room before! We did not take full advantage of the living room area, but it was nice it was there. Since the weather was gorgeous when we were there we spent most of our time on the deck or away from the room altogether. I wish it had been a little cooler so we could have used the outdoor fireplace â€“ maybe another time! We used the spa for massages & it was very nice. The spa was not quite as big as I would have expected though. The waiting area was a little small and there were not enough chairs for my husband and I to sit in before our massages â€“ we had to stand and wait around which was a little disappointing. The changing room was not large either â€“ there were several of us all trying to get into our lockers at once and we were on top of one another. We ate at the Lakehouse restaurant which was delicious. I was happy to have a good restaurant on the property so we didnâ€™t have to drive anywhere. There were a lot of extra touches that I appreciated: When I booked our room I had mentioned it was our anniversary so they brought a bottle of champagne and dessert to our room; fruit and free drinks in the fridge were great â€“ a nice relief not to pay $3.50/bottle and there were cold bottles of water in the car upon our departure. It is pricey to stay here â€“ we were happy most of our stay was paid for. I would definitely stay here again though. It is tailored to outdoor living so I would not want to stay here when it was cold or especially when it was raining.", "Date": "September 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“Quiet, Peaceful Getaway”", "Author": "A TripAdvisor Member", "ReviewID": "UR3810182", "Content": "We chose the Calistoga Ranch for a Business Meeting and beginning of a two night getaway. For a Business Meeting it's wonderful if you have one of the rooms with a separte living room, our guest did. This resort is just over a year old. Once you arrive, you are driven by golf cart to your room. We stayed in the Sage Lake Lodge. The vines are just starting to cover the buildings, but the property is still beautiful. The room has a very unique beauiful bathroom, his and her sides with a shower and large soaking tub in the middle. Floors are slate. Counters are marble. There is also a private outside shower which is wonderful, and a sunbathing lounge chair in the same area. As you approach your room there is a very nice deck with an outdoor gas fireplace and reading chairs. There is also a small table with two chairs on the walkway to the room. When you open all the blinds in your room, you have a beautiful view of oak trees. The bedroom is a little small but very comfortable. The restaurant was just a few feet from our room and we had a very good breakfast there. It looks like a creek may run right in front of our room, but during the summer everything is dry.", "Date": "August 27, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "5"}, "AuthorLocation": "norwood", "Title": "“Superb Hide Away - poor room service”", "Author": "happa00", "ReviewID": "UR3760027", "Content": "The entree is great and if you go for a creek lodge you will get the quiet surrounding that you expect. However due to the success of the owners lodges (time share model) they built 6 more of this big suite houses and i guess when they are finished it could drift into a high end campground flair, if the hotel management is not watching the expansion carefully. After this last 6 suite expansion they definatly should stop to prevent the downgrade of style and hideaway charme. Here is a advise for those who like to stay at the suite and just relax. DO NOT TRY ROOMSERVICE FOR DINNER. Even you get a complimentory estate chardonnay, they forgot to bring new glasses for a new ordered high price wine ( hey, we are in the wine country, and i guess they should know all about tasting ). Also the food ( fish super small, low taste, high price ) is not worth mentioning. So i recommend to go the extra mile for the estate restaurant ( reservation recommended) and get excellant food and service there. Also for the ones who have a light sleep the AC is quite loud and can just be switched to auto or on/off. However, the place is so beautiful we actually stayed a night longer than planed, as we found complete relexation.", "Date": "August 13, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Hermosa Beach, CA", "Title": "“Decadent”", "Author": "wiki", "ReviewID": "UR3758060", "Content": "It's an incredibly luxurious retreat. Rooms are beautiful. Grounds are beautiful. It's a very tranquil setting.", "Date": "August 12, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "minneapolis", "Title": "“Casual Elegance”", "Author": "sophie11", "ReviewID": "UR3617925", "Content": "We really enjoyed our stay at Calistoga Ranch. Although it was a bit of a splurge, it was a great get away. The spa was beautiful. We stayed in a one bedroom lodge with a living room. The outdoor shower and deck with the fireplace were the best. The room was very well appointed and quiet. As it is quite roomy and the living room is separate from the bedroom, I don't think this is a set up for kids. We were shuttled to our room via golf cart, or took the short walk and it was never a problem. The car was always waiting with water and the service was very friendly. The outdoor pool is serene -- very relaxing. If you are looking for manicured, formal lodging, this isn't the place. The setting is much more natural and I can imagine in a few years when the landscaping grows in how beautiful it will be. The restaurant had a great dinner - again a bit pricey, but the food and setting was beautiful -- complete with deer roaming in the valley right off of the deck while we were eating. For a special treat, we'd stay there again in a heartbeat.", "Date": "June 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“has come into it's own...”", "Author": "rkr727", "ReviewID": "UR3344543", "Content": "We stayed here last year shortly after it's opening and found many deficiencies in service. We returned just recently for three days and found that staff has hit a comfortable rhythm. We upgraded to the oak/creekside and it made a big difference from the hillside studio we had last year. The separate living space and bedroom lent a comfortable separation of space. The room was private and beautifully appointed. The beds are like big cocoons, with comfortable linens and fluffy duvets. We spent one afternoon on the deck with the fireplace nicely heating the area, just reading while sipping wine and listening to the creek rushing by. The food in the restaurant is very good; the room service was on the money; the spa services are absolutely superb; and the space is beautiful and tranquil. It has a great indoor/outdoor gym. As far as I know it's the only high end property in the napa valley that allows you to bring your furry family member, and we met several there. Everyone was quite accommodating to our little dog. The staff are sweet and eager to please even under circumstances where the overprivileged and overindulged ugly american guest makes their acquaintance. We would highly recommend this hotel. (forget the credit card limit)", "Date": "April 8, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New Jersey", "Title": "“Loved the architecture”", "Author": "mosum", "ReviewID": "UR3233198", "Content": "We spent a day at the Calistoga Ranch. It was a wonderful getaway for a couple. We found our unit actually quiet and away from the construction. The spa treatment was superior to most. The food, service and level of care was superior to almost all the 4 star hotels, but not quiet up to the level of a 5 star hotel. I would go again.", "Date": "February 27, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "south florida", "Title": "“Wonderful place to stay, \"kind of zen rustic\"!”", "Author": "champagne gal", "ReviewID": "UR2605632", "Content": "I just returned from a fabulous trip to Napa. Being a woman and traveling by myself I was a little apprehensive to go on this trip. This is proved to be a great trip. I stayed at the new Caligosta Ranch resort, beautiful rooms. I did feel like I was in a zen like atmosphere with the rooms being built up against a mountainside. Everything was done with perfection in mind, luxurious linens on the bed, indoor and outdoor showers. The staff couldn't have been nicer in arranging dinner reservations at area restaurants but my best dinner was on the property at the resorts outstanding restaurant. Everything was well presented by the waiter with a description of how the each dish was prepared. Excellent all around!", "Date": "September 28, 2004"}], "HotelInfo": {"Name": "Calistoga Ranch, An Auberge Resort", "HotelURL": "/ShowUserReviews-g32143-d278021-Reviews-Calistoga_Ranch_An_Auberge_Resort-Calistoga_Napa_Valley_California.html", "Price": "$525 - $825*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">580 Lommel Rd</span>, <span class=\"locality\"><span property=\"v:locality\">Calistoga</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">95415</span></span> </span></span></address>", "HotelID": "278021", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/81/6e/816e0280ecd7c80604265a0666f7b7755large.jpg"}}