{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“LOVELY VENICE”", "Author": "PADDYMSCOTLAND", "ReviewID": "UR128158087", "Content": "We have recently returned from Venice. This was our first trip and we weren't disappointed. We were only here for 2 days but may be 3 might have been a bit better. It was the beginning of April and the weather was warm. We stayed at the Duodo Palace Hotel, which we was a lovely hotel. We the breakfast was lovely and the rooms were very suptuous, The staff were always curteous and polite. Our only small quibble would be there was not complimentary tray in the room for tea/coffee etc. We had our own kettle and stuff as we took a flask of coffee with us on our walks to save having to always find a cafe we would stop at any of the endless amazing views. The hotel was very central too. Would highly recommend it.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nebraska", "Title": "“Overlooking a Venitian Canal”", "Author": "traveler10131", "ReviewID": "UR127777509", "Content": "Our first visit to Venice and we arrived at the hotel door by water taxi. Great staff. We spoke no Italian but it was no problem. Wonderful room overlooking a canal. Nice breakfast. Very clean. I have arthritis and the elevator was necessary and great. Some say it was hard to find but using the water taxi solves that problem. Close to the Venetian Opera House.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel”", "Author": "daveb36", "ReviewID": "UR127536082", "Content": "Just got back from 2 night stay at duodo for a joint silver wedding celebration staff were very nice rooms very clean and comfortable and decorated in true venetion style. Would recommend the water taxi transfer to arrive in style and think it would be hard to find otherwise. great location for all sights but its very easy to get lost in venice so buy a good map would stay here again", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Outstanding Venice hotel”", "Author": "Leinsterman", "ReviewID": "UR127376316", "Content": "I've just spent 4 nights at the Duodo Palace Hotel. It's a very central hotel, with a canal running alongside - the water taxi drew up to the door. A very enjoyable stay, the staff were all friendly, helpful and efficient. I have some Italian, enough to cover the basics, but anyway the staff all spoke fluent English. Breakfast was included in the room price and was a buffet of fruit, cold meat, cheese, rolls, croissants, yoghourt, tea or coffee and champagne for those who wanted it!. The room was spacious and spotlessly clean, as was the en-suite bathroom and the bed was very comfortable. Despite being so central, the surroundings were very quiet. Staff were helpful with local knowledge. Very good value and a thoroughly enjoyable experience.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Linlithgow, United Kingdom", "Title": "“Excellent location , helpful staff”", "Author": "Borgcruiser", "ReviewID": "UR127118616", "Content": "Just returned from a 2 night weekend in Venice booked through British Airways. Duodo Palace Hotel is located in an excellent location easy access from the Alilunga stops at Rialto and San Marco. I was allocated room #204 , no issues with the cleanliness, bathroom was spotless and very modern.Bed linen was changed daily . Only downside to this room is it feels like a corridor , 2 single beds in line with a chair between. Small wardrobe and in room safe. Doubt this room would be suitable for two people, rather cramped. Excellent Continental breakfast. Extremly pleasant hotel and bar staff. Michael the bar man was very attentive, Thanks for that Michael.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good, but not great”", "Author": "EriClaud54", "ReviewID": "UR127045001", "Content": "I felt the staff at the hotel to be helpful, but a little on the snooty side. I just couldn't help but think they were looking down their noses at us. Besides that, the room was spacious and very clean. The location was excellent with only a short walk to most of the main sites. The hotel was very quiet at night, so we had no trouble sleeping after our long days.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Duodo Palace Hotel - excellent”", "Author": "Ruth A", "ReviewID": "UR126590633", "Content": "We, my son and I, stayed at the Duodo Palace Hotel on March 10-14 2012. We stayed at many hotels in Europe, but never got so kindly and hearty treatment from the crew who was always ready to help us with EVERY topic. We're still astonish of the amazing experience of the staying at this amazing hotel. And besides, the location is excellent - 1 minute to the opera house (La Fenice), and a few minutes to San Marco piaza - the central square in Venice. Sorry if I forgot something... Our grade is 100% !!!!!!!!! Ciao Duodo Palace Hotel See you again :-) Ruthie and Tal Aviv, Israel", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“a hiddon gem”", "Author": "karl-sugden", "ReviewID": "UR126397951", "Content": "iv just come back from a 3 day trip in venice and stayed at the wonderfull duodo palace hotel i was greeted with a smile witch is always nice and there made me feel very welcome i was in room 604 ok it did not have a view but the room was very nice and just prefect for me the bathroom was all so very lovely done out and had a lovely shower witch i like the hotel is in a great location and close to all main attractions shops and restaurants i can recommend a couple of lovely restaurants for dining out as i am very fussy and like upmarket placers one is called osteria san marco but you must book as its very busy and the food is wonderfull trust me food is my passion the 2nd is called a beccafico the hotel will tell you were it is but try and go its excellent food and once again you need to book back to the reviews on the hotel all the staff were very helpfull and breakfast in the hotel was nice i would recommend this hotel and i will be definatly staying hear again in the near future i want to thank all the staff for a lovely stay at the duodo palace thanks once again and keep up the good work karl", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Very welcoming hotel”", "Author": "CrocksWestSussex", "ReviewID": "UR126082071", "Content": "The hotel is ideally placed - easy walk to San Marco and St Angelo water bus stops. The staff are so friendly and welcoming. Breakfast is a good choice and comments about it not being so, are picky! Our room (#206) had a canal view and was clean and comfortably. Only had a small issue on one morning - the bathroom for room 205 protrudes into the corner of the room and on our first morning we were woken by a lady with a voice to kill at 100 paces, singing loudly in the bath! Thankfully they obviously left on our first day and were replaced by nice quiet people! The drinks in the bar are very generous measures - trebles at least! All in all - would heartily recommend this hotel.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“A Decent Functional Hotel”", "Author": "YNWYM", "ReviewID": "UR125248366", "Content": "We booked a double room which was a decent size with ensuite bathroom. Both were clean, tidy and in good repair. The staff were friendly and helpful. The location of the hotel is excellent. Very close to La Fenice Opera House and half way between St. Mark's Square and The Rialto Bridge and an easy walk to both.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cannock", "Title": "“A convenient & comfortable hotel”", "Author": "WizardsRUs2", "ReviewID": "UR124969246", "Content": "We liked this hotel very much. The rooms were most spacious and our room had an elaboratly painted ceiling. You didnt get a very friendly atmosphere in the breakfast room. The waiter almost made us feel uncomfortable as he didnt even say grazi or prago like everyone else in Italy. There wasnt much of a selection of food either, simply cornflakes, bowls of fruit and toast or croisants. The coffee took the fur off the back of your tongue too. But for a convenient place to stay, a short walk past the antique shops to either St Marks Square or the Rialto Bridge made it the place to stay as it was away from the hustle and bustle of the centre of Venice therefore in the height of summer you would be assured of a peaceful stay which you wouldnt get in the centre.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Staffs", "Title": "“Reviews are spot on but.....”", "Author": "Jan6794", "ReviewID": "UR124596500", "Content": "This hotel is everything you would expect from these reviews. A litle gem. However dont fall for the free trip to Murano. I wish I had read those reviews before our visit. Yes, you feel really special being whisked off from the hotel in your own water taxi, a private guide to a 5 minute glass blow in the factory then the hard sell begins. You are then left outside to catch the waterbus home. The hotel must be party to this rip off.... beware, leaves a bad taste in the mouth.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“xmas holiday 2011”", "Author": "davidm M", "ReviewID": "UR124176091", "Content": "Arrived at the hotel late January 2012, and while the outside looked very average, the entrance foyer and bar/type areas very well presented and comfortable. Staff were friendly and helpful, and readily provided advise on directions and tours and made bookings for us. We paid extra for a canal room, and the room was exceptional in size, comfort and cleaniness. Our room included breakfast, everything except aussie eggs, but plently of meats, cheeses, buns, toast, cereals. and even champaign. Very handly to all the main tourist spots, plenty of places to eat, one minute walk to the teatro de finice etc.. Would recommend staying here, and will definately stay here again when next in Venice.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Wonderful hotel with friendly helpful staff”", "Author": "ang196", "ReviewID": "UR123991656", "Content": "I loved everything about this hotel, from the beautiful entrance, the frescoed room, the staff etc etc We were treated like very special guests when we arrived by the wonderful Francesco, in fact all the staff were friendly, helpful and very pleasant all the time. The included breakfast was very good, cereals, meats, cheeses and wonderful hot tea and coffee. My other half had the bacon and eggs one morning, extra charge for it, and he said it was excellent, I believe it was about 7 euros. The hotel arranged a free trip to Murano, where we were under no pressure to buy, and we even asked then to arrange our Gondola trip for us, as we trusted them to make a good decision on our behalf. We were upgraded to a superior room, #206, which was beautiful. It had fabric covered walls and a frescoed ceiling, and a view of the small canal outside. We even had tea making facilities ready and waiting for us in the room, which was just what we needed. We just used to ask for refills of supplies, and fresh milk when we passed reception, and were always given a decent supply with a smile. We had cocktails in the bar every night, 5 euros each, strong and worth the price. We even had a pizza one evening in the bar and it was as good as ones we had in decent restaurants in Venice, I believe they were 10 euros each. Overall the Duodo Palace is a beautiful, traditional hotel with helpful, cheerful staff who will help you in any way they can.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great little Hotel”", "Author": "Scratch81", "ReviewID": "UR123828102", "Content": "This hotel exceeded our expectations. The 4 stars are well deserved, with nice rooms, very polite always smiling staff, and very reasonable drinks prices at the bar (in comparison to the rest of venice). The location is spot on for central venice, close to the main Square. The teatro de fenice is literally on the doorstep, and the hotel has a waterfront entrance for that grand welcome to venice We were in venice for wifes birthday, and we were pleasantly surprised with a round of dirnks on the house to celebrate. We would definitely recommend this hotel to everyone for a stay in venice. Thanks Duodo Palace", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Great location in Venice”", "Author": "Victoria C", "ReviewID": "UR123797294", "Content": "We stayed here for 3 nights in Jan 2012. Very friendly & helpful staff. Good breakfast. Standard room adequate, I say this because nothing like the pictures. We did look at a canal side room but really didn't feel we got anything extra ( for extra 70e) as had to stand on tiptoes to look out the window down into canal, which when the tide was out was a bit smelly. We had a standard room, small but well designed layout except for it was very dark. The heating was controlled by the front desk & they seemed to have difficulty in setting it to our requested temperature. It was -5c outside so difficult to leave the windows open. Hair dryer useless and lighting not designed for reading, could do with some good bedside lights. No tea making facilities in the room but will provide tea tray free of charge(2.50E for delivery to your room, unless you take it up yourself).", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great value great location”", "Author": "weberkshire", "ReviewID": "UR123678326", "Content": "Stayed here early jan after a ski trip in the Dolomites and had a fantastic time. Staff were very helpful with recommendations and rooms were nice and clean. Only qualm was that we paid for a deluxe room and the other half of our party paid standard and their room was probably better than ours. Overall very pleased.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellcent service, always there to help and so friendly.”", "Author": "Dgreen830", "ReviewID": "UR123391798", "Content": "What a start to the year, went for 3 days in january 2012. The greatest hotel I have stayed in. Clean, staff always there to help you. It was our 2nd anniversary and they upgraded our room and had a bottle of champagne waiting for us. Breakfast was fantastic, anything we asked for they were always there to help. They arranged a free trip To murano for us and it's a place worth visiting, seeing all the glass chandeliers was fantastic. We would recommend the Duodo hotel to everyone, the staff are fantastic. Thank you to all staff at the Duodo palace for making our first time in Venice so special, we will definitely be returning soon . Dave and Angela from Manchester.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Excellent return trip to Duodo Palace”", "Author": "Joanne E", "ReviewID": "UR123306484", "Content": "Re-booked this place for 4 nights for a romantic winter break after a great stay here a couple of years ago. Paid only around Â£70 per night for a double last time, around Â£80 this time (search your websites). This time we were up on the 4th floor in a slightly smaller but really characterful room with beams on the sloping ceiling and views over the rooftops, looking out towards the tower of the Frari. Loved it. Arrived on the evening of Thursday 5th Jan and said we'd stayed once already. Five mins later we were brought up a bottle of Prosecco in an ice bucket as a welcome back gift. Duodo's rooms are lovely - really nice, plush, Venetian decor (love the padded walls!), with a fridge and TV. Cosy beds. Staff are really pleasant, buffet breakfast is good, everybody staying here seems very happy. Rooms are cleaned every day but always while you're out - no noise from the (also lovely) cleaners. The following day (with the Befana Regatta and all the festivites) was one of the best days I've ever had. Whether it's this good in the summer months I couldn't say. Highly recommend.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Valrico, Florida", "Title": "“best”", "Author": "crystal t", "ReviewID": "UR123176456", "Content": "I agree that the hotel was a bit difficult to find. This was our 2nd time staying there. The hotel staff is very friendly and helpful. the bartender/waiter even let us borrow his bottle opener. The rooms are very nice and most importantly clean. This hotel is well worth the price.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Delightful”", "Author": "Stuart L", "ReviewID": "UR122939427", "Content": "The Duodo Palace is tricky to find - especially after a good glug of wine around the maze which is town. We got lost every niight upon our return. That aside, the hotel is beautiful, classy, comfortable and the service is old fashioned and courteous. The decor is dated but in this old converted palace it remains elegant. A complimentary bottle of good Prosecco in an ice bucket was delivered to our room on the first night which was a lovely touch. Breakfast is fresh with lots of choice and typical Italian quality. I cannot think of anything negative to see about the Duodo Palace and we had a great deal and a great time. If I knew I could stay in a place like this in any city then I would happily do so. 10/10", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, England, United Kingdom", "Title": "“Gorgeous hotel with great location”", "Author": "Catherine A", "ReviewID": "UR122782458", "Content": "I am long overdue in writing this review but felt I should as we had such a wonderful time staying here. We stayed 4 nights, and found the hotel to be of beautiful Venetian style, with excellent staff. Rooms are a fair size with large bathroom (or at least ours was). The location is perfect for exploring, with the main sites just minutes away. A memory of this hotel I will never forget is our gondola ride - ask at reception and concierge can arrange one to pick you up from the hotel, and for a reasonable price! Lovely atmosphere in this hotel I would definitely stay here again without hesitation and recommend ot to anyone!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pre xmas break”", "Author": "cantwards", "ReviewID": "UR122782314", "Content": "We booked the duodo palace having read the reviews on trip advisor. They were really accurate and helpful. Although a little difficult to find initially once there found it is in an amazing central location. Upon arrival the staff were very welcoming and escorted us to our room. The reception staff were able to reccommend restaurants etc - nothing was too much trouble. The room was good - very venetian in style and very comfortable. The breakfast included was good, the bar staff in the evening were very courteous and helpful. The cocktails amazing value at only five euros. All in all we had a superb three night break in Venice and this was due in no small part to the fantastic hotel with its great location. We highly reccommend this hotel and would happily return", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel, great location”", "Author": "Janey87", "ReviewID": "UR122557400", "Content": "This hotel was rated quite highly on tripadvisor and it definetly didnt disappoint, the room was a decent size, the staff were friendly, they had porters to take the bags to the room and help you off the boats at the water entrance. The breakfast was continental but you had the option each morning to order a hot breakfast, there was plenty of juices and options, we came down at 10.25 (breakfast finishes at 10.30) and they still fit us in and did not rush us, we would defintely stay in the this hotel again, highly recommend!!!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salzburg, Austria", "Title": "“Lovely historic place with friendly service right in the centre of Venice”", "Author": "julia1976", "ReviewID": "UR122187541", "Content": "Admittedly, we had a hard time finding the hotel - but when we arrived, we were greeted with perfect hospitality and in fluent German (it's not something we expect, but lots of people will appreciate). The desk service was very friendly and gave decent advice on restaurants in the area. We liked our room a lot - a friendly big room with very high walls, no view, but the feeling of being in a palazzo veneziano did make up for it. The bathroom wasn't huge, but big enoug for a bath tube which we didn't use this time, but noticed positively for further visits. Breakfast service was very friendly and very good - we even enjoyed prosecco for my bf's birthday. The waiters/waitresses were friendly and professional, the service quick - no complaints. We've spent many journeys in Venice on a budget and this was defininitely the best and most luxurious (first week of December 2011)", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leafy Hertfordshire", "Title": "“Nothing was too much trouble”", "Author": "Italomaniac", "ReviewID": "UR121636858", "Content": "From the moment we arrived, the staff did everything they could to make our stay as delightful as possible. We nipped out for dinner on our first night to find a bottle of chilled Prosecco waiting for us, in the room, on our return. our room was spacious, warm, and we even had a painted fresco on the ceiling. When the staff realized we were British, without so much as a murmur from us, a kettle appeared in the room, together with tea bags, etc. etc. The location is wonderful, very central. However, if you're not familiar with Venice, you might like to ask hotel staff for the short cuts to Accademia, and Rialto. You are no more than 7 minutes from both. And about 5 to St Mark's square. So, it is a perfect position for getting around Venice, and a perfect place to stay.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“An excellent base”", "Author": "Christopher F", "ReviewID": "UR121622229", "Content": "My wife and I stayed 5 nights here. Although it is only about 10 mins easy walk (with wheelie suit cases) from the S Marco water bus stop the hotel would be difficult to find without detailed directions. I sent the manager a photocopy of a street map and asked him to mark the hotel and route from the water bus landing. He did and sent it back to me; so no problem. The hotel's situation is quite central with the San Marco Piazza, the Rialto and the Accademia all within very easy reach (we are in our 70s). Our bedroom was delightful - spacious and well equipped with an excellent bathroom. The dining room for the generous buffet breakfast was a nice place to be with very friendly and polite staff. The front desk staff were friendly and helpful. There are small restaurants and trattorias close by suppers. We have no adverse criticisms and will certainly return. We booked through Trailfinders who obtained a very reasonably priced package with British Airways flights. By the way, at Marco Polo Airport it is only a 10 min under-cover walk from Arrivals to the water bus and then about 50 mins to S Marco; a very enjoyable and stress-free way to arrive.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent Hotel”", "Author": "Maria R", "ReviewID": "UR121446251", "Content": "Very elegant Hotel, only about 6-7 minute walk to main shopping areas and St Marks Square. The breakfast was very nice. This Hotel is located right next to a canal. This was our last stop before returning home and it was a nice hotel to finish off our trip. The staff were very helpful. Ladies take your own hairdryer - the hotel one not the best. Would highly recommend this hotel for value for money, it was heaps cheaper and better than the one we stayed in Rome.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Excellent place to stay”", "Author": "NAHR1234", "ReviewID": "UR121291494", "Content": "Very good hotel in a superbly central, yet quiet location. Very attentive staff, but please turn the heating down!", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“A wonderful small hotel!”", "Author": "chOntario", "ReviewID": "UR120852703", "Content": "We had booked this hotel for two nights prior to a cruise departure based on the reviews on this website and we weren't disappointed! Pulling up to the door in a water taxi and being escorted up the steps to the check in desk was an amazing experience. The staff were extremely polite and our room on the second floor was quite nice. Beautiful, and spotless large windows with a king size bed and a beautiful bathroom. The ceiling in the room was a work of art! Our favourite part was the breakfast which was included in the room price. Fresh fruit cup, warm croissants that melt in your mouth, and the best coffee we have ever had in our life. All this and free internet service. We found all the staff extremely helpful and one of their better recommendations was the restaurant \"Rossa's\" (a favourite of Johnny Depp's while filming a recent movie) which is a three minute walk from the hotel. Everything is extremely close with a walk to St. Mark's Square being only about seven or eight minutes. I highly recommend this hotel.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Beautiful Hotel”", "Author": "noodles1691", "ReviewID": "UR120741972", "Content": "We stayed here for 2 nights and could not have asked for anything more - beautiful hotel, polite and helpful staff, delicious breakfast, cheap cocktails, hot water - was absolutely perfect for our getaway. I think we were lucky in getting one of the slightly larger rooms as we felt it was more than comfortable. Yes the prices for the breakfast extras was a little over the top - but you don't HAVE to have eggs! The rest of the breakfast was delicious and the bar serving delicious ham and cheese toasties for only â‚¬4 was very handy! Overall, a fantastic stay - would definitely go back.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“EXELLENT”", "Author": "Ellieee22", "ReviewID": "UR120693425", "Content": "I had a very lovely stay in this hotel. Room wasn't very big but every other thing was perfect: good services and facilities in the hotel, a very good breakfast with quality and typical products, very professional staff, stilish and elegant forniture,large bathroom. enter in this hotel is like living a dream :) the only disavantage I noticed is that the double bed is made adding 2 single bed and this can be less confortable than having a real double bed.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlisle", "Title": "“Nothing but praise”", "Author": "Discriminat0r", "ReviewID": "UR120277948", "Content": "We had a large, lovely room on the first floor overlooking the canal. Maybe in summer it might be a little sniffy but in October with the occasional gondola (and musical accompaniment) going by it was magical. Staff were efficient and always pleasant. Great central position. Good breakfasts. Venice food expensive and ghastly but the Restaurant al Theatre around the corner (next to the Opera House) was good.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“Friendly good location”", "Author": "jooleye", "ReviewID": "UR120219149", "Content": "I have just returned from reunion trip to Venice we all stayed at the hotel , I had a wonderful visit and because I was with friends able to view at least four rooms. all different but consistently good most had baths and shower attachments though mine had a shower. Breakfast was good with awide continental selection. People say Venice is expensive but the hotel offers cocktails for 5 euro a lot cheaper than London and it was nice to return to the hotel and have a few drinks when your feet start to ache - be prepared to walk a lot!!! If you have booked a transfer to the airport please check your route to the pick up point we spotted a few frantic people lost and worried also the hotel marked the map slightly wrong and we were early and saves enough to check with hotels near the pier. This was for cresta which do not answer the phone and collect from as all unmarked pier near the hotel regina! Many might be alittle stressed by this and use either the public transport or book a taxi from the hotel.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Zug, Switzerland", "Title": "“Don't even think of staying here!”", "Author": "GranZorro", "ReviewID": "UR120113233", "Content": "After staying recently at this place, it is beyond me how they could have obtained their alleged 4-star official rating. The only four star element I could discern is the rip off pricing (about which later). The room was a disaster - very small, musty, confined. The bathroom was old fashioned. There is not enough closet space even for a few nights stay. Antique TV set. The physical facilities are trumped, however, by the demeanor of the front desk staff (a heavy set gentleman who lets his frustrations out on his guests). An example? Coming back from a heavy days sightseeing, his greeting was not \"Hello, how are you?\", but a curt \"Check out tomorrow is at 11 AM\". Even if you don't pay the outrageous rack rates of around 300 Euros (that's almost 420 US!) by getting a deal, avoid this place. Do what many savy travellers advise - stay at a nice, modern place in Mestre on the mainland for around 90-100 Euros and take the 15-20 minute bus ride into the main island of Venice.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“lovely boutique hotel, in a fantastic location”", "Author": "matthewgough", "ReviewID": "UR119466877", "Content": "We're just back from three days staying here, and I can't recommend this hotel strongly enough. The location is excellent, being off a quiet side canal means it's very peaceful at night, yet it's a 10 second walk to the Phoenix Theatre and square, and 10 minutes from St. Mark's Square. The rooms are small, it's true, but they are beautiful: high ceilings, silk damask wall coverings, marble bathrooms. Furniture is slightly practical, but very functional, and the turn-down service is good. Breakfast is served in two lovely rooms on the ground floor - standard continental buffet - with helpful staff always keeping the coffee and tea topped up. We opted for the 'water taxi transfer' from the airport as advertised on their website. It's a little more expensive than just getting the vaporetto or a private water taxi, but MUCH more convenient and speedy. They do all the lugging of bags too, so if you're worried about heavy suitcases this is the best way to do it. Definitely worth the extra money. We'll certainly be going back to Venice, and will very likely be staying here again.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Norton, Massachusetts", "Title": "“Beautiful Approach”", "Author": "Jim V", "ReviewID": "UR119255306", "Content": "This is a great out of the crowd boutique Hotel. Arriving by water taxi allows you to exit the bost and enter directly into Hotel. This is great. The staff was excellent, friendly and helpful. Old building that has been upgraded very nicely. Full bar. we had paid for a room upgrade, and by viewing their on line pictures, we expected a little nicer. But this did not dampen our stay. It is out of the way, so a little difficult to find on first attempt. This also added to the fun of staying there. we highly recommend this hotel. Enjoy!!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Cute Boutique Hotel”", "Author": "georgina18", "ReviewID": "UR119251119", "Content": "Fairly convenient to St Marks Square but would have been hard to find lugging suitcases etc., room small but only staying one night. Staff helpful", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5"}, "AuthorLocation": "Bethesda, Maryland", "Title": "“Our third stay since 2006, woud return again”", "Author": "bhmmhm", "ReviewID": "UR119158911", "Content": "Our ninth time together in Venice (we were each here before we married in 1953), our third at the Duodo. A fine value in contrast to outstanding 5 star Venetian hotels we had also enjoyed. Our room overlooking the canal was ready for us by noon (after an early morning arrival off a cruise), and Frederico was particularly helpful as before. Returning from Venetian ventures is like coming homre again. (If Duodo would upgrade from the plastic motel-like glassware in rhe bathroom?)", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice hotel”", "Author": "loubnasuccar", "ReviewID": "UR119152303", "Content": "We stayed there for only one night, the hotel was a bit hard to find but it is within 5 minutes from st mark's square. i only have one complaint, the breakfast was really poor compared to the other 4 stars hotels during our trip to italy", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good Central Location”", "Author": "Normski99", "ReviewID": "UR118496159", "Content": "We stayed for just one night before sailing out of Venice. This hotel is very central and just a short walk from St Mark's Square. Our room was enormous and had a balcony over the canal, so we could watch the gondolas go by. Although we arrived early, our room was ready. We found it fairly easy to get our bearings and were well placed to visit a good deal of Venice on foot. We had the breakfast and it didn't disappoint. The only criticism was that although the bathroom was a good size, there was no shower - the bath had a shower hose, but there was nowhere to hang it. If you can rustle up the cash (110 euros), get a water taxi from the airport - it's such a fantastic way to arrive!", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Goiania, GO", "Title": "“Loved this hotel!”", "Author": "Juliana B", "ReviewID": "UR118459780", "Content": "I stayed in this hotel for 3 nights in this month. I don't think it's necessary to get a water taxi to reach it, unless your suitcase is too heavy or if you have too much luggage, because there is a small bridge in the way, with some steps. From the airport, you pay 7 euros for the Vaporetto and, when you arrive in Venice, it's very easy to reach the hotel if you 've got a map in your hands (print it in a big size before the trip). Note: you don't need to pass through Piazza San Marco, there is a street in front of the station that you must take. Although it's much more fast and chic to get there by taxi, the price is high (150 euros), I think it's better to keep 100 euros for a gondola tour! The location is excelent, near Fenice Theatre and Antico Martini restaurant, near to everything. My room was very good, didn't seem to be old or decadent. The view wasn't nice, but it didn't make any difference for me. The bathroom was beautiful, with its rosso verona marble. I would love it if there was a shower... I don't like baths, but that's difficult in Europe... I also missed better lighting to do my make-up (but this is a failing in most hotels I've stayed). The staff was friendly, helped us with tips, making reservations... The breakfast was average, if you want squeezed orange juice or eggs, you must pay separately. At night, we liked to stay in the beautiful bar to have a drink. I would definitely return to this hotel, it is so charming, with the view of the canal... perfect for a couple, so romantic! So Venetian!", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Torquay", "Title": "“Fantastic hotel”", "Author": "Emmmm", "ReviewID": "UR118428745", "Content": "The Duodo Palace was a great place to stay with a stunning interior. It was bang in the centre of Venice, but far enough off the main streets that it was quiet - even tho we were there at carnevale time!", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Great Location, Quiet, Friendly and Charming”", "Author": "NYCAnne", "ReviewID": "UR118366101", "Content": "I recently stayed in the 450 year old Duodo Palace Hotel, located near Piazza San Marco (St. Mark's Square) for five days and enjoyed a beautiful room bathed in red and gold brocade. I found the staff to be professional, accommodating, and friendly. While my room did not have much of a view it was lovely and comfortable with good quality bedding. The first morning when I awoke to the Venitian hand painted fresco on the ceiling directly above me I knew I was somewhere special. Thoroughly enjoyed my stay and would highly recommend this hotel to fellow travelers.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Auckand", "Title": "“we loved i and would return however.....”", "Author": "AndyAuckand", "ReviewID": "UR117716114", "Content": "Stayed in this lovely hotel for 5 nights and after one night in standard room requested upgrade as the room was so small. Very hard to find hotel initialy and with baggage we definately recommend water taxi to and from front door. We were not able to get wifi in our room and used one of the little downstairs lobbies which was ok. The hotel charged for wifi which is unusual these days. They did not charge us however due to the problems we had. Breakfast was ok but we thought charging 4 euros for a boiled egg escessive! Overall though, we loved this hotel and would return. We learned to live with its little quirks and the beautiful building, location & friendly staff more than made up for the complaints which were, on the whole minor.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Highland Park, Illinois", "Title": "“Great hotel”", "Author": "Saul552", "ReviewID": "UR117706661", "Content": "We had a triple on the top floor and the view was great. Our room was comfortable and clean. The location was good too.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bristol", "Title": "“We stayed here for 3 nights on our honeymoon - was good”", "Author": "Tamsin F", "ReviewID": "UR117694253", "Content": "Duodo palace hotel was pretty easy to find from San Marco vaporetto stop. Entrance into hotel was lovely (either from the small canal next to it or the main entrance on the street). The staff from the start were very helpful and friendly and conversed with us in italian and english which we enjoyed. Our room was on the top floor and was beautiful with spectular view across Venice. The look was antique which we liked and the bathroom was fine too. However the air conditioning (even though it was on maximum) was really not that great so we didn't sleep that well on any of the nights. To be fair though it was 38% which even the staff said was unusually high for Venice. We enjoyed the breakfast in the hotel and also had some martini's in the bar which were excellent. We would recommend this hotel to others, our one thing was really the problem with the air conditioning, other than that we really enjoyed it!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great stay and service”", "Author": "velazquinho", "ReviewID": "UR117600115", "Content": "This hotel is very clean, nice and with great service. Rooms are large enough and what you would expect from Venice. Getting here by boat adds to the experience. I would highly recommend it.", "Date": "September 2, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York, NY", "Title": "“Ok hotel”", "Author": "Like2Travel12", "ReviewID": "UR117045552", "Content": "We recently stayed at the Duodo Palace Hotel. The location was decent, however I would say that the room was a bit average, even below average. Although it was clean (which is important), the room needed to be updated. It was very dark, and needed some renovating, just felt kind of outdated. However, the hotel staff was very helpful and polite. Would choose a different hotel next time.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "rothherham", "Title": "“Lovely hotel”", "Author": "RothherhamStu", "ReviewID": "UR117035761", "Content": "Lovely hotel and Venice is very nice but so over expecive to eat and drink they have a captive audience they don't gave to serve nice food a one in a life time experience I think", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lismore Australia", "Title": "“The best of Venice”", "Author": "HB00763", "ReviewID": "UR116982225", "Content": "We stayed here for 4 nights in June 11. We had a fabulous room on the 5th floor (503) that was spacious and comfortable with views across the rooftops of Venice. The hotel is quite hard to find so be sure of your directions otherwise catch a water taxi (70euro) which will drop you at the front door. It might seem expensive but it is worth it ( and saves you wandering Venice aimlessly dragging bags like we did) plus you get a tour of the canals at the same time. The room we had was very large with a sitting area and a large bathroom and windows you could open for some fresh air. The hotel and rooms are very quiet and close to everything you need in Venice. The hotel has free internet and the staff were always friendly and the front counter staff particularly obliging. This hotel was a real highlight on our holiday and once we actually found it were more than pleased with our choice.", "Date": "August 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Superb”", "Author": "Copter30", "ReviewID": "UR116842730", "Content": "Our second stay: fresco ceilings in a superior room, great location quiet but near to everything, peaceful oasis after day of Venice! Nice breakfasts, excellent staff. Excellent beds. We will be back..", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "westmidlands", "Title": "“Well situated”", "Author": "river21", "ReviewID": "UR116473756", "Content": "Stayed here for three nights. The hotel is ideally situated about 10 minute amble from St Marks Square. The staff are all very helpful and will arrange trips etc. We did an evening trip around the canals in a water taxi for 100euros but was worth it and lasted an hour. The one room we had was on the small side but having said that it was very clean and comfortable. A water taxi direct to the airport cost 100euro but this compares favourably with the regular waterbus. We would definitely stay here again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "andycoon", "Title": "“It was...just ok.”", "Author": "knvna", "ReviewID": "UR116091894", "Content": "This hotel was fine. I have no major complaints but I would not stay here again. It says it is centrally located which is partially true. It is in the middle of the island, but it very difficult to find and any excursions you may want to take will be located on or nearer to the Grand Canal- a twisty turny walk about 10 minutes away. My major complaint and something I did not take into consideration pre-vacation is this: The hotel is located on a very small canal. Very few rooms would have a view of this. If you are in a room without a view your options for sitting somewhere and relaxing and enjoying a peaceful Venice night are very limited here. There is no restaurant with a view, no outside patio, no roof terrace. There is just your cavernous room or the hotel lobby to sit and hang out in which ends up being very boring or awkward. No place to sit and enjoy the night air and talk with others.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Hard to Find, But Gorgeous!”", "Author": "GeorgeM2", "ReviewID": "UR115948678", "Content": "Small little hotel and tucked away in the streets of Venice and close to San Marco Square. Staff very friendlya nd helpful and common areas beautiful. The rooms are gorgeous with fresco's in each. Breakfast could be better, as it seemed all the eggs etc were A La Carte and additional.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wonderful place for a golden wedding celebration”", "Author": "davidjgower", "ReviewID": "UR115886277", "Content": "We got a very good deal through a travel agent friend but we would have enjoyed this anyway. Staff were attentive, rooms were comfortable, canal in May not malodorous at all, breakfast good, location superb, Venice wonderful.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice place, convenient location, good value”", "Author": "Dacarlq", "ReviewID": "UR115733351", "Content": "My family of five stayed in two rooms for one night and were very pleased. Charming hotel. Rooms are modest, but overall experience was positive.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely Hotel”", "Author": "theEdwards_10", "ReviewID": "UR115548478", "Content": "Very nice stay , lovely hotel and very good and polite staff- apart of beeing waken up by the maid chatting loud in the corridors .... lovely rooms and veru clean, breakfast is ok, not much of a variaty ...but very nice coffee . Our room was quite small but we had a great sleep overall . The location is great , just a short walk from everything but sill quieter than the very central ones. Lovely.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“A Warm Welcome Awaits at this Very Special Hotel”", "Author": "Fynn03", "ReviewID": "UR115542971", "Content": "I can honestly say this is the most wonderfully unique hotel I have ever had the pleasure of staying in, from walking through the quaint courtyard to the front door or arriving via water taxi from the canal, the warm welcome that awaits you from the reception staff was wonderful, and nothing could have prepared us for the quality and starndard of our room, with luxuary decor, furnishings and sumptuous bathroom (room 602) and our daughters room similarly indiviual furnishings with the addition of an original fresco dating back hundreds of years. The breakfast staff were warm and welcoming each morning as they served us tea or coffee, and the continental breakfast buffet choice couldn't be faulty for choice or quality. Our party consisted of 4 adults and our baby grandson, and although Venice is not the most pram friendly city we didn't experience any major problems in moving about the city from this very centrally located hotel. I wouldn't hesitate in recommending the Duodo Palace to anyone and would certainly like to return.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "helsinki", "Title": "“Excellent holiday and excellent hotel in Venice”", "Author": "er65", "ReviewID": "UR115310121", "Content": "We had a nice time at this hotel which is very close to San Marco Square but in a very quiet area. We can recommend this hotel to everybody travelling to Venice. Room we stayed was very big and had nice roof paintings.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Wonderful hotel (centrally located, but away from the hustle & bustle)”", "Author": "Nicks1234", "ReviewID": "UR114799624", "Content": "We loved the central location, but fortunately the hotel is also located in a very quiet area and is VERY relaxing to come back to after a long day of walking (great air conditioning). The building is beautiful, and the rooms are very nice sized (we splurged this time and had a balcony overlooking the roof tops and the canal...gorgeous!). The morning breakfast buffet (included in our rate) was a very nice way to start the day with pastries, bread, meats, cheeses, yogurt, cereal, coffee, etc. (and for a relatively small extra charge you can order hot food, eggs, etc.). Even though it was expensive, we took the private water taxi (arranged by the hotel ahead of time, and docking directly at their lobby) on both our arrival at the train station (recommended unless you know your way around Venice...hotel can be hard to find on foot the first time) and on departure on the way to the airport (was so amazing to step in the boat directly from the lobby, and get a grand tour of Venice on our way out (which we videoed to show all our jealous friends)....getting to the airport only took 20 minutes, and they drop you next to the terminal!). The only negative about the hotel (and it was more of an annoyance than a real problem) was the shower. The bathroom/en suite was very nice, all marble and large, but the shower/tub had no shower door, no partial door (European style), nor even a shower curtain. Given that the tub was so narrow (impossible to sit comfortably, and difficult at times even to turn around while standing), and that the shower head was typical old-style Italian handheld model, it made taking a shower an adventure (and put water ALL OVER the floor). It wasn't a major issue, but taking a shower was not terribly relaxing or a way to unwind after a long day. I know this is quite common in some places in Europe (I have been to Europe dozens of times, and fortunately this design feature is slowly disappearing), but a partial door would have made the issue go away. Some of the other reviews seemed to have problems that we never experienced. We would definitely recommend this hotel (and stay there again next time in Venice).", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "ny", "Title": "“A perfect place to stay”", "Author": "ruthNy", "ReviewID": "UR114687036", "Content": "We stayed at the Duodo Palace in Venice twice on our 25 day trip---3 days at the beginning and 2 days at the end. The room we were in # 607 was perfect---large with Venetian frunishings & best of all, a balcony overlooking the canal where we watched many gondolas pass by below. From 5pm to 6:30 pm many gondolas also provided singers. It was an amazing experience! When we left after 3 days, we requested the same room for our return stay. On our return, we were greeted by name. Room #607 was available & within 5 minutes of settling in, we received a complimentary bottle of procecco and 2 flutes. We enjoyed it on \"our\" balcony! The staff at the hotel was wonderful---they were always available and able to direct us wherever we wanted to go. Duodo Palace is about a 10 minute walk from San Marco Piazza & along the way are many shops with prices that are better than the shops closer to the Piazza. Take the private water taxi from the airport---it is well worth the money if you have more luggage than a light carry-on. We booked through www.Veneziataxi.com.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“great location, not the best room”", "Author": "Darlene51", "ReviewID": "UR114265885", "Content": "We stayed here for 3 days. Great location close to St. Mark's Square. Canal access made it convenient to take a water taxi to the train station on a rainy day. Staff was polite, but not overly friendly. We had an odd room on the fifth floor. We had a skylight in the ceiling for which you had to climb on the bed to open and close the blind. There was a pole in front of bathroom door and there was a very small shower, no tub. Unfortunately the elevator only went to the fourth floor. From the brochures, it appeared that other rooms may have been nicer. We found other guests in the hotel to be very friendly.", "Date": "June 18, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Jose, California", "Title": "“HIGHLY RECOMMENDED HOTEL”", "Author": "Skicrazed", "ReviewID": "UR114048356", "Content": "This is a very fine hotel - truly deserving of its 4-star rating. The hotel is very well appointed with classical furniture while everything looks new or remodeled on the inside. the staff and service are excellent - first rate. extremely polite and helpful. We had a lovely room on the 4th floor, overlooking the rooftops of Venice and a glorious view of the Cathedral of San Marco, lit up at night. The only caveat - beware of their restaurant recommendation. Like other Venetian hotels, they are 'encouraged' to steer guests to A Beccafico, rated #3 on Trip Advisor. A mistake - I've already dissed that restaurant on another review. We would definitely return there.", "Date": "June 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful hotel in an excellent location”", "Author": "drkane", "ReviewID": "UR113897323", "Content": "Very nice hotel, incredibly located in the very centre of Venice. This does mean it can be difficult to find food and drink nearby for reasonable prices. We had one of the smaller rooms in the hotel but it was still big enough, and well provisioned. The breakfast is excellent, and the bar serves reasonably priced cocktails (for Venice anyway!) for a lovely end to the evening.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Lovely Stay”", "Author": "koko123456", "ReviewID": "UR112230711", "Content": "Stayed for 3 nights in May and had a great time. The hotel is in a great location, very central to all the sights and shopping - we utilized the concierge service to arrange transportation from the airport directly to the hotel, I would highly recommend this service for any first timers in Venice as finding the hotel on the winding streets of Venice with your luggage in tow could be a bit difficult (also its a beautiful way to first see the city - via a private water taxi). We had a canal view room and it was wonderful. The staff was great and very helpful - I would guess that they are more accustomed to guests staying for a night or two, as they only had restaurant recommendations for 2-3 places. The wi-fi is free, but only seems to work in the lobby area which is a bit of a drag. Overall, it was a lovely stay and we would definitely stay there again.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“i never write reviews............... but..... FABULOUS.....................................”", "Author": "italia32", "ReviewID": "UR112135472", "Content": "I in general, would never write (or read for that matter) a review...... but, i had to extend my experience with fellow travellers...... We happened to be sent to this Hotel.. being Duodo Palace..Venezia..... What was mean't to be only a couple of days stay, managed to be weeks.... We experienced professional and loving staff.... From Sandro, Francesco and Claudio greeting us with kindness and no effort spared whenever we needed anything... nothing to much to ask for... if they could do it... it would be done immediately....then to the hilarious and entertaining Nico and Raffaela, greeting us every morning.... Our coffee delivered with charm and again, whatever we needed, there before you... I had such an amazing time staying here that i highly recommend anybody travelling to Venice to please consider Duodo Palace as the Hotel itself is beautiful the staff are just AMAZING..... Thank you for making our stay that even more enjoyable..... Melisa and Victoria...... Australia", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hobart, Australia", "Title": "“We are saving straight away to take our family there.”", "Author": "londontorome160511", "ReviewID": "UR111691357", "Content": "We were greated by very friendly staff who made us feel immediately welcome, the rooms were very clean and roomy. The Hotel is quiet and the setting is a bit like a fairy tale with the Gondalas passing by the front door. We visited 8 cities in 3 different countries and for us this City and the Hotel stood out, thanks to all for making our stay such a happy one.", "Date": "June 5, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "UK", "Title": "“Good location but a dungeon for a room”", "Author": "chocolatecarol", "ReviewID": "UR110977366", "Content": "Expensive room and we weren't willing to pay for an upgrade since we were only staying the night. Our view was out onto a flat roof and the back of the building. It wouldn't have been so bad had they bothered to clear away all the cigarette ends outside. The bed was comfortable though and we got a good sleep as the room was so dark. Probably not worth staying here unless you are willing to upgrade to a room with a view.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Istanbul", "Title": "“Great place to stay near San Marco”", "Author": "Pinarcan", "ReviewID": "UR110771029", "Content": "We picked this hotel based on reviews here. Its amazing location makes it a bargain. Very good service and staff. Don't expect the rooms to be luxurius but everything is very authentic. Breakfast not so rich. Good value for this tiny hotel!", "Date": "May 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pasadena, ma", "Title": "“Amazing Time and Wonderful Staff”", "Author": "Bulilrod", "ReviewID": "UR110770253", "Content": "My wife and stayed there during the Easter Weekend and had a wonderful time. Everyone was very professional and very helpful. They had great restaurant recommendations, were accommodating to our poor Italian skills, and made every effort to make our stay comfortable. The location was an easy walk to great shopping and the square. Next time we're in Venice we'll be back.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Simply Sublime!”", "Author": "Peachey2", "ReviewID": "UR109908705", "Content": "Just back from a wonderful week end at this hotel. Staff were all so helpful and friendly. It was my husband's birthday while we were there, and they brought up a chilled bottle of Prosecco, without us even having to ask! They also organised a gondela trip with the only female gondelier in Venice, departing from their doorstep. Location perfect. In the heart of things, yet very peaceful. Can't wait to go back!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Louth, Lincs, England", "Title": "“Fabulous. Perfect Location, very helpful staff, drinks reasonably priced.”", "Author": "Berry001", "ReviewID": "UR108645285", "Content": "Stayed for 3 nights in May 2011 as a party of 8 people. Fantastic being dropped off by water taxi right by the door. Would recommend that for getting there from airport rather than vaporettas. Felt like royalty arriving. We were getting married in Venice and the staff were so helpful and obliging, and seemed to be that way to all guests. Helpful with directions, recommendations etc. Drinks in the hotel were very reasonably priced compared with outside restaurants etc. No cover or service charge for a start. Rooms were great, very clean and well serviced, breakfast was good though only cold buffet, but plenty, and fresh. All in all a great trip, would definitely stay here again.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, England", "Title": "“Hidden Gem”", "Author": "Sam55Essex Posted by an OctopusTravel traveler", "ReviewID": "UR108349174", "Content": "Lovely hotel, however very tricky to find as the 'street' is not on any maps as it's tiny - it's easy to find once you get to Teatro La Fenice. Rooms were lovely and very clean if a little small. The only thing that wa missing was there was no Tea/Coffee making facility in the room which we missed. Only other thing was that although there were lots of TV channels, we could only watch CNN or BBC World News. Although we weren't there to watch TV, it is nice to be able to wind down watching TV when you have finished your busy day sightseeing. Staff at reception were very friendly - shame the same can't be said for the 'older' man who works in the breakfast room - very grumpy and very rude - does not like it if you and your partner ask for different drinks! (We did-every day!! It became quite amusing in the end! - For British visitors, he reminded us of Graham the counsellor on Jeremy Kyle Show!) Breakfast was plentiful with lots of choice for continental breakfast or option to pay for cooked breakfast - we were happy with the lovely fresh croissants. The hotel is gorgeous and very quiet at night which is great and only a stones throw from St Marks Square and all the action. Highly recommended. The Hotel backs straight onto a canal which was lovely. We did the obligatory Gondola ride which was so romantic and had to be done even though it was expensive at 80 Euros (for 45 minutes). We would recommend getting a ticket for the Waterbuses - they are frequent and easy and if you get one to cover your trip, it makes life so much easier (we got a 3 day one when we got to Piazzale Roma from the airport)", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire England", "Title": "“Brilliant Hotel”", "Author": "HampshireEngland89", "ReviewID": "UR108183241", "Content": "We had a wonderful stay in this hotel, friendly helpful staff, beautifully decorated rooms, location could not be better, would definately recommend and, if returning to Venice in future, this would be our preferred hotel of choice.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“Good Enough For What You Get In Venice”", "Author": "RuthyGlasgow Posted by an OctopusTravel traveler", "ReviewID": "UR107615744", "Content": "Now that we are home after spending 5 days/nights in beautiful Venice and feel we know this city quite well, if I was to return I would not stay in the San Marco area. It is so very near the main attractions (which was why I choose it) but more expensive and wld advise anyone going, to stay in a more outlying area which wld be much cheaper and still within easy walking distance to St Marco, also the restaurants and trattorias wld be cheaper. I wld recommend the Castello area where you cld follow the main water side walkway to get to St Marco or the S Polo area near the Rialto bridge. The Duodo Hotel standard room that I booked and was shown to was very small and the window opened up to another wall 4/5ft away with no canal in sight so we opted to upgrade for another 80 euros per night to a bigger room with 2 windows looking down into a canal (room 100) which was much better. Francesco at Reception was the most helpfull of staff there on whom we relied upon, thank goodness he was there as helped us to decide what to do and where to go. He recommended the islands of Burano and Torcello which were beautifull and so glad we went. Thankyou Duodo for a good base and lovely time but just bit expensive.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“A great place to stay”", "Author": "JohnFox53", "ReviewID": "UR104448931", "Content": "I travelled in a group of 10 ladies and found the Hotel Duodo Palace to be a perfect hotel to enjoy the sights of Venice. We were picked up at the airport by a water taxi and arrived in style at the water entrance of the hotel. The hotel staff were fantastic and nothing was too much trouble for them. They recommended two excellent restaurants for supper meals and both of these proved to be outstanding. The bar in the hotel was good value for drinks and the free \" nibbles\" provided were a great extra. The breakfast was plentiful and there was always more tea or coffee available.The rooms varied in size but all were very clean and had all the facilities needed. The location was spot on and we were able to walk to all the attractions with ease. I would definately recommend this hotel to anybody visiting Venice.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Truly Wonderful Experience”", "Author": "LiverpoolTraveller", "ReviewID": "UR103771145", "Content": "I cannot recommend this lovely hotel highly enough. It was perfectly located for all the major attractions. Lots of lovely restaurants in close proximity. It was our 30th Wedding Anniversary and we had been upgraded on a arrival to a great room which had a lovely fresco on the ceiling,a balcony which overlooked the canal. On a few afternoons when we came back for a quick seista we watched the gondoliers move down below us while in a following gondola there was a man playing an accordian whilst another sang...it just doesn't get any better We were also left a bottle of Prosecco on ice on our first evening which we were to tired to drink after travelling, the staff very kindly arranged to have this brought to our room the following evening. The hotel had organised a free trip by speed boat from the door of the hotel [this was a once in a life time experience, stepping from the reception of your hotel into a boat] to the glass factory on Murano. The breakfast was continental and was plentiful, the staff who served could not have been more helpful. The staff also on the reception did everything they could to make our stay a truly wonderful and memorable experience....I and my husband will most definately be returning next year", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "staffordshire", "Title": "“faultless hotel”", "Author": "kathysam", "ReviewID": "UR103634468", "Content": "this is a simply fantastic hotel. I cannot think of a single downside to it. Was a bit tricky to find in the first instance, but on arrival, this is forgotten. hotel is luxurious, rooms spotless with daily bedding / towel change. We were upgraded to a room with canal view and gondolas were passing regularly, some with the most fantastic singers aboard. staff cannot do enough to help you. Breakfast is plentiful and delicious. drinks from the bar here include delicious cocktails and are very reasonable compared to the rest of venice. Hotel is situated about 5 mins walk from st marks square, palace, basilica, vaporetto etc but is far enough away for you to get a restful nights sleep. would definitely stay again with no hesitation", "Date": "April 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“What a little gem!”", "Author": "KimNeoh", "ReviewID": "UR103601046", "Content": "We were a little lost in trying to get to the hotel - Venice has so many small passages that is pretty confusing. The hotel's plain facade belies its interior - it was gorgeous inside! A small but well decorated lobby , nice Italian furnishings to the rooms. The room really cant fit 2 mid-large suitcases. The bathroom was equally luxurious with nice modern fittings. The hotel is 5-7 min walk to the San Marco pier, and probably 5-10 mins to Rialto Bridge for food, shopping and entertainment. All in all, a little gem of a hotel!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Very nice stay in the heart of Venice”", "Author": "DaSurpha", "ReviewID": "UR103045639", "Content": "I stayed here for two nights with my girlfriend, and it was a very pleasant experience. I got offered a really good rate when I booked my flight tickets so it was a bargain as well! The hotel is very centrally located just next to the opera house, the room was very nice with a decent sized bathroom (with a tub). It was probably the quietest hotel room I've ever stayed in, slept like a baby! The lobby bar serves drinks and wine at a good price, dozens of restaurants in the area just a few minutes walk away.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great locations”", "Author": "ddtowe", "ReviewID": "UR102814519", "Content": "Great hotel in a great location. 5 minutes walk from all the main locations; St Marks Square, Rialto Bridge, Galleria Del' Accadamia. Friendly helpful staff. In a quiet location so no noisy nights! Perfect spot to explore venice from and retreat to once your walked out!", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windham, New Hampshire", "Title": "“FABULOUS!!!”", "Author": "PRC_59", "ReviewID": "UR100061072", "Content": "It is the perfect location - about 10 minute walk from all the major sites. It is nestled in a secluded section on the canal. Our bedroom was huge! We had a king size bed, a sitting area and in the entrance another couch and closet. The best part was being on the canal and seeing all the gondolas go by with people enjoying the beauty of Venice. We toasted them from our window every night before we joined them! The hotel is next to La Fenia de le Theater which is a landmark that everyone knows so we could always find our way home. The hotel personnel were extremely friendly and very helpful. We took a 2 hour private tour with Velma to see historic Veniza - it was well worth the money. She showed us several places that the Venician people like to eat. It was a delightful experience !", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Excellent Place to stay in Vencice - Good value, great service, great location”", "Author": "woodenshoe58", "ReviewID": "UR99935948", "Content": "Stayed at the hotel based on recommendation from a travel agent. Booked early enough to get substantial discount from the rack rates, especially at the beginning of Carnivale. We stayed for 3 nights. Front desk...Outstanding! Very helpful and English was fairly good. Came with a free continental breakfast that included coffee, juices, variety of buns, meats, jams, cheese, cereal, etc. You only pay extra if you wish to have ham & eggs, etc. Hotel has WIFI. We were at the back of the hotel and was NOT noisy at all. Our room was the deluxe and exceeded expectations. If we go back, sorry make that when we go back, we will stay there again.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“All the great comments about this hotel really are true”", "Author": "steveyh1", "ReviewID": "UR98438769", "Content": "Stayed here w/c 21 Feb and all the fantastic comments on this site really are true. From the moment we entered we were welcomed in a professional but friendly and natural manner. The reception staff really are excellent. Our room (605) was plush and elegant. No great view but I wouldn't pay for a canal view as it is only a tiny back canal anyway. The girl at breakfast was also friendly and helpful. The chamber maids wee also extremeley professional. The breakfast was good with achoice of cereal, fruit, ham, croissants etc. The location was perfect, right between St Marks and The Rialto bridge so that you can keep nipping back to the hotel if you want for a break. Only a 5 min walk from St Marks boat stop even with heavy suitcases - study a map before you go and when you get near there's a small sign on a wall. Even the bar/snack prices are very reasonable - cheaper than most places in the city. Some hotels just seem to get it right and this is definitely one of them. Well done to whoever owns this hotel, it was a pleasure to be there.", "Date": "February 28, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Rotherham", "Title": "“Dont hesitate just book it\"”", "Author": "thiswilldofine", "ReviewID": "UR97487669", "Content": "Just returned after three day stay Thursday to Sunday with my wife as a 30th Wedding Anniversary treat.Great room 403 Junior Suite on the 4th floor with lovely rooms.Everyone of the staff were very pleasent and helpful..particular thanks to John in the bar for our early evening drinks.Faultless and great location.Only one tip is the small tables in St Marks and around the waterfront are used as \"raised walkways\" when the tide rises and water floods in to the Square.We got caught out returning to the hotel one evening and ignored the walkways and tried to walk across the square as the water appeared to be about 2/3 centimetres deep...we then found ourselves wading in about 6 inches of water and shoes/jeans bottoms saturated..our fault but if first time in Venice just beware.You will love Venice and need 2 days to see the main sites.The Basillica is unbeliveable inside.Water bus from the airport is easy and a greet way to get to San Marco square(about 7 minutes walk to the Duodo Place..yes it is hard to find at first..judt head for the theatre and then ask...a small yellow sign on the corner wall shows the hotel name and directions.If you want some peace and quite the hotel is so quite at night you have to stay to understand..having no cars in town does help.Thanks to Travel Rpublic for a great package deal and service.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Ideal Location,Wonderful Hotel”", "Author": "kim160290", "ReviewID": "UR97421479", "Content": "Recently visited duodo palace and had a wonderful stay. Was extremely close to saint marks square, literally five minutes away and so was able to go back and forth when we got tired. Water bus station is also very close which transports to every place in Venice and was extremely useful. Found a lovely pizzeria right next to the hotel which was reasonably priced. Room was upgraded as the hotel was informed that it was my 21st birthday. Room was very big with a canal view, bathroom was huge with a bath and a shower, including hairdryer and toiletries included. Room had a safe and a minibar. Was at first disappointed to see that at breakfast you had to pay extra for eggs and bacon but really enjoyed the breakfast that was provided including meats, cheese, croissants, toast, cereal and yoghurt and found no need to pay extra. Staff were very friendly and helpful, and once we checked out there was a safe storage area to leave our bags until we had to get our flight. They also provide a map of Venice to all guests. The hotel is right next to teatro la fenice, and in easy reach of a number of key sights. Would definitely recommend.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derby", "Title": "“Excellent stay”", "Author": "JudeHayDerby", "ReviewID": "UR97341987", "Content": "I had booked a trip to Venice with Co-op travel as a surprise for my partner. We were very impressed with the hotel and the stay was excellent. Location is central only 5 mins walk to St Marks Square (bring a map as its like a maze getting about on the island!). Staff were friendly, efficient and helpful, service was very good. We had breakfast included which was lovely, usual continental options but always fresh and plenty of it. Room (suite) was very nice, original fresco to ceiling, luxurious and lovely and clean. We would recommend this hotel if you are looking for good quality comfortable stay in central Venice. No gripes whatsoever!", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Awesome. Worth double what it cost.”", "Author": "Golfing_Robinsons", "ReviewID": "UR96113322", "Content": "Ideal position, halfway between St Marks Square and Rialto Bridge. First class accomodation, with friendly helpful staff who \"go the extra mile\". We had a junior suite which was beautifully decorated. Only downside is no tea/coffee facilities in room. Even though that is usually a particular bug-bear, the Duodo is so lovely I will forgive them. Would definitely stay again.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huddersfield", "Title": "“Perfect location, helpful and friendly staff, what a find!”", "Author": "Elodmester", "ReviewID": "UR95942022", "Content": "Stayed at the Duodo Palace for 3 nights (22nd Jan - 25th Jan 2011.) The Duodo Palace is a mere 5 minute walk from St Marks Square and the ideal location to investigate Venice from. The staff were incredibly helpful and polite. Check in was hassle free and our bags were taken to our room for us. Rooms are spacious, clean and well presented. We stayed in room 502 on the top loor and had a lovely view over the rooftops. Do ask for a hairdryer from reception as they are more powerful. Do be aware that there are no coffee making facilities in the rooms. Breakfast was great. It consisted of tea, coffee and fruit juices to drink. To eat there was a selection of meats, cheese, rolls, bread, croissants, muffins, cereals, fresh fruits and fruit salad. On of the staff recmmended we eat at the Beccafico in Campo St Stefano as we were celebrating our engagement during our trip. Sooooooo glad we ate here. It is listed as the number 1 restaurant in Venice, on Tripadviser. We had the most fantastic meal here. The waiter was fantastic (well worth the 12% service charge.) If you go and you like seafood and shellfish you havee to have the mixed starter. It consists of 14 different starters and is â‚¬40 for two. Our meal came to â‚¬140 which equated to Â£119. This included a bottle of champagne and 3 courses each. Will definitely be back to Venice, the Duodo Palace and the Beccafico Restaurant.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington England", "Title": "“Duodo - What a gem”", "Author": "jandaveandco Posted by an OctopusTravel traveler", "ReviewID": "UR95699663", "Content": "My sister-in-law and I stayed at the Duodo Palace for two nights 30/11 - 2/12. After reading the reviews on Trip Advisor we were very excited to be staying here. I found directions from a previous reviewer and they were brilliant, we found the hotel very easily and it was only a few minutes walk from San Marco. The check-in was easy and the hotel staff very friendly. Our twin room was lovely, very comfortable beds, plenty of wardrobe space and the bathroom was gorgeous! The view from our room was of the rooftops, but also the campanile at San Marco.the only downside we can think of would be the lack of comfortable seating when we returned to the hotel at night, this would have been great so we could have enjoyed a more leisurely drink. Oh and if you need the radiators turned up you need to contact reception as it's controlled from there!But that said the location was perfect, being only a few minutes walk from the Square, but also all the quaint little shops to browse in. The Vaparetto stop was easy to find, but we actually didn't find the need to use the vaparettos as everywhere was very accessible by foot. All in all we had a brilliant time. The breakfast was lovely, and everything you need to set you up for the day.The hotel staff were very helpful ,especially on the morning we were leaving, as it was high-tide and everywhere was flooded! They gave us directions to avoid the worst of the floods so we could catch the bus back to the airport!I would definitely stay here again and wouldn't hesitate to recommend it to others, and what can you say about Venice - BEAUTIFUL.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester UK", "Title": "“Nice hotel in a perfect location.”", "Author": "LesDouglas Posted by an OctopusTravel traveler", "ReviewID": "UR95377020", "Content": "Stayed in a standard room which was fine, breakfast very good for continental type. About 5 mins walk from St Marks Square so location fine. Be careful of Service and Cover charges in restaurants,makes things overly as oppossed to just expensive. Recommend also Piccolo Martini restaurant on way to St Marks Square, quite reasonable.", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brasilia", "Title": "“Friendly place and a good location!”", "Author": "CrisBrasilia", "ReviewID": "UR93588252", "Content": "Very friendly and helpful staff. They took time to help us and answered all the question we had. We stayed in a magnificent room and the breakfast was excellent too. Very friendly place and a good location. We would definitely recommend Duodo Palace Hotel to others visiting Venice; great atmosphere! You have to stay there if you are going to visit this city!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Loughborough, United Kingdom", "Title": "“Fantastic hotel”", "Author": "eagle86", "ReviewID": "UR90623271", "Content": "We had a wonderful stay at The Duodo Palace. As soon as we entered the reception area we knew the holiday had begun as the hotel definately, upon entering, had the wow factor. The reception staff were very helpful with advice of where best to eat, water bus times and even arranging free transport to Murano. Our room 107 was large and beautifully decorated in a rich Venetian style with a glorious canal view! There is no restaurant in the hotel, only snacks are available this however is not a problem as when you are in Venice you want to get out and about and the hotel being only a 5 min walk from St Mark's Square means there are lots of good restaurants about. The bar in the hotel offers a wide range of drinks and does great cocktails for extremely reasonable prices relative to the rest of Venice. One tip when going to Venice is before going in restaurants check what the cover charge and service charges are as these can be pricey. A good, relatively cheap restaurant close to the hotel is Piccolo Martini.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "derby", "Title": "“fantastic hotel, great location”", "Author": "cpmderby Posted by an OctopusTravel traveler", "ReviewID": "UR90534968", "Content": "what a great place to stay.upgraded to a deluxe room and worth every penny.located near all places of interest and lots of restaurants.December is a good time to visit as the crowds have all gone and the christmas atmosphere is superb,nightlife is quiet", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "colchester", "Title": "“third stay there: says it all”", "Author": "lixobart Posted by an OctopusTravel traveler", "ReviewID": "UR90527720", "Content": "exceptional location. Well run, peaceful. Worth paying for room upgrade. We've been 3 times now and last year had just basic room which was small and a little disappointing: this year had junior suite which was comfortable to be in. Will return.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“Excellent hotel”", "Author": "PGRBrussels", "ReviewID": "UR89622058", "Content": "The Hotel is very well located in a quiet street just 10 minutes from Piazza San Marco and the Rialto Bridge and next to the Felice Theatre. So access is easy when arriving by vaporetta to San Marco or even private water taxi right outside the hotel. The Duodo Palace is a smart hotel, with a very nice lobby and excellent front desk staff. The rooms are well equipped with nice bathrooms and very clean. Even the breakfast was pretty good - which in Italian hotels is often not the case - and worth taking. Overall a great hotel and I thoroughly recommend it.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tarpon Springs, Florida", "Title": "“From the DUODO PALACE HOTEL you can experience the sights, sounds and gourmet of Venice from this beautifully maintained”", "Author": "toniksales", "ReviewID": "UR88108502", "Content": "Highly recommended! The DUODO PALACE Hotel is a wonderful place to stay while enjoying the City and its fine restaurants. From the first greeting of the Staff to the final Good Bye the atmosphere is simply delightful. The rooms are well furnished to blend with the frescos on the ceilings and to the proportions of the rooms (very spacious). The Staff are well informed and gracious. The location cannot be beat: its charming canal entry allows easy access to water taxies and Gondolas and the street door allows walks through the streets to uncover restaurants and shops off the beaten track. It is an easy walk to the Plaza San Marco and around the corner from the Theater district. We will definitely return and have already recommended the DUODO PLACE to friends that like to enjoy more than the typical tourist hotel. Rates are very reasonable and the Breakfast Buffet is substantial with a variety of items to suit different tastes.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NY, NY", "Title": "“a great base”", "Author": "apples99", "ReviewID": "UR87407961", "Content": "My husband and I flew into Venice, and we stayed at Duodo Palace. The hotel does the job, the room is fairly large compared to European standards and puts out a decent spread for breakfast. The bathroom is nice, but for some reason, there is no conditioner. The hotel is above average and you are not going to Venice to sit your hotel room. Our biggest concern was how to get to the hotel from the Airport - whether we should be a private taxi or take the Alilaguna. If you are healthy and you can walk, by all means, do take Alilaguna. The directions they give on the website, is good and armed with a map, and some sense of direction, you will be in front of the hotel. We had no issues.. we made it to the hotel in one piece with our luggage in tow. We were stressed when we left, but take my word, private taxis are not worth it.. especially if they ask you for more since the hotel is not right off the main canal. All in all, the staff is very friendly and helpful, and its in a quiet little \"square\" and you cannot go wrong.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Decent location and rooms”", "Author": "Nikkileee", "ReviewID": "UR86354555", "Content": "Staff were very friendly and mostly helpful, although we found the porter at times could be more helpful than the actual front desk staff. Rooms were beautiful and spacious, including the bathroom. Location was wonderful, however be wary that this hotel is located in the most expensive areas of Venice for food/wine. As we were leaving before breakfast on our final day, staff packed us a small bag of goodies to take with us to the airport, which was wonderfully kind.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tucson, AZ", "Title": "“Heavenly, romantic, classic in the heart of Venice”", "Author": "dtbram", "ReviewID": "UR84847272", "Content": "After our first long flight and first trip to Europe, we had several crises. First, we almost missed our flight in Madrid due to a boarding pass error. Then, although arrangements had been made with our financial institutions, we were unable to obtain euros or use a charge card. The fear of being in foreign countries where we had no money was extreme. Thanks to Sandro at Duodo Palace he assisted us in correcting the situation and assuaging our fears. He was patient with us as he explained directions, recommended a fantastic restaurant a favorite of the locals (A Beccafico), and helped with our transportation. Throughout our 16-day travels through Italy, Croatia, Greece, and Spain, there was none as kind and helpful as Sandro, a maestro in coat and tails. Our room, while condensed, was well appointed with lovely windows where we could hear gondoliers singing. Breakfast (included) was wonderful. It started my love of prosciutto, cheese, bread and fruit. Our only glitch was that when it came time for the water taxi to pick us up, it had rained the night before and was high tide. The water taxi was unable to get under the bridges. We had to move our own luggage to the Grand Canal. We do look forward to be returning to Venice, attending the theater (La Fenice is close by), staying at Duodo Palace, and be taken care of by Sandro.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Absolutely wonderful”", "Author": "lena1979", "ReviewID": "UR83444631", "Content": "My husband and I stayed here earlier this year and it was wonderful. I only realised on our most recent trip I'd forgot to add the review and really have to recommend it because it was amazing. The decor is beautiful, the location is good and easy to find if you take advice from on here. The staff are so friendly, polite and helpful (well all but one who was grumpy and had a very rude go at me for not giving him my keys when I ran out for two minutes to fetch a wedding bouquet on the day we renewed our vows! But I won't let him ruin my opinion of everyone else!). The bar and its cocktails are very nice too. I definitely hope to stay here again one day", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norfolk, VA", "Title": "“Perfect ending to our vacation”", "Author": "VATravlnPair", "ReviewID": "UR82872504", "Content": "Venice was one of our favorite cities and we just loved our hotel. Hotel Duodo Palace is perfectly located on a quiet canal near San Marco Square and other sites. The rooms were very nice (we loved the Venetian architecture and design) and bathrooms were large (only downside is that there is a tub with shower attachment, not a shower stall). Service is impeccable. In advance of our trip, we emailed the concierge several times to ask about tours and restaurants. Claudio always responded quickly and coordinated everything for us â€“ set up dinner reservations at Beccafico and arranging a private water taxi tour of Venice that left from the hotel (it was one of the highlights of our trip). We would definitely stay here again when returning to Venice, and recommend it to anyone.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Andover, Massachusetts", "Title": "“Excellent hotel”", "Author": "talento7", "ReviewID": "UR82675484", "Content": "This hotel has a great venetian style and the rooms were spacious. The breakfast room lovely and well stocked. The staff couldn't have been more helpful and pleasant. A little difficult to find but well worth it.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Friendly Staff, Average Rooms, Overall Good Stay”", "Author": "kitschy", "ReviewID": "UR79759999", "Content": "Duodo Palace is a perfectly fine hotel with an excellent staff -- it is, as others have said, hard to find, which makes it possibly not the best location for a first time visitor to Venice (as we were). Staff is lovely and extremely helpful. Rooms are average, nothing special but fine for European standards. Free WiFi. Excellent breakfast. It was hot while we were there and the A/C is controlled by the front desk - however, every time we made the request to lower temperature, the staff complied.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Well Worth The Cost”", "Author": "Graley", "ReviewID": "UR78924142", "Content": "We arrived at the Hotel by Water Taxi from the Airport. Albeit it was a bit pricey (120 Euros), it was well worth it, especially when you see countless lost people trailing through the streets with maps in hand trying to find their Hotel. From the minute we arrived the staff at the Reception were first class. They provided maps of the area and suggested areas to go to. The room that we had was on the second floor and overlooked the canal. It was a very spacious room with a high ceiling which was adorned with a fresco. No issues with the room whatsoever. It had excellent air conditioning and was always spotlessly clean. We advised the Hotel prior to arrival that we were celebrating our anniversary when we were there and they gave us a complimentary bottle of Proseco. The continental breafast that was provided is more than adequate, but did get a bit repetative after 7 days. However, I think the majority of people staying at the hotel were only there for a couple of days. What about Venice itself ? There can be no doubt that it is a beautiful city, but boy oh boy is it expensive! Whatever you would take as spending money normally for a week - double it for Venice. Average price of a beer - 8 Euros! That being said the cheapest place we found to have a beer and a glass of wine/cocktail - the Duodo Palace Hotel. Would I stay there again - yes. Would I recommend it to others - yes.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Exemplary service.”", "Author": "travelbrat", "ReviewID": "UR75064689", "Content": "We reserved and paid in full for a room at the Ruzzini Palace with 1800Hotels.com only to learn when we arrived at the hotel that the reservation had been cancelled by 1800Hotel's wholesaler. The Ruzzini Palace was sold out but the GM, Sebastini, quickly accomodated us at The Duodo Palace, an even nicer hotel that is closer to St. Marks AND he provided us a water taxi at no charge to take us from the Ruzzini to the Duodo. Our room was lovely and looked just like the pictures on their website - www.duodopalacehotel.com. The bed was comfortable and the A/C worked well. The bathroom was large and had a soaking tub along with the standard amenities and there were bathrobes and slippers for guests. There were lots of choices on the breakfast buffet including warm, fresh croissants. The location is good as it is close to both the Rialto Bridge and St. Marks Square. I would highly recommend this hotel and plan to stay here again.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Right near Piazza San Marco yet quiet, tucked away and not over priced”", "Author": "weetbix75", "ReviewID": "UR74541129", "Content": "We stayed 1 night at the Duodo Palace. The hotel is located around a 5 minute walk from Piazza San Marco but is tucked down a quiet alley which makes its location a quiet one but can also prove hard to locate (suggest printing out a map prior to arriving in Venice!). The room was spacious for European standards, though the ceiling was quite low. The bathroom was also quite sizable. Staff were pleasant enough and offered a standard level of customer service. Given the location and the fact we were in town on the night of one of Venice's largest festivals, the price was good - however the price did not include breakfast, we were offered this at an additional 15 euro per person.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Quiet but within easy walking distance to San Marco”", "Author": "leedap", "ReviewID": "UR72320002", "Content": "We recommend that you take a water taxi to the front door of the hotel. The staff was friendly and helpful with our many questions about directions to restaurants and sites. The top floor room was quaint but adequate. The bathroom was updated and very modern. The only difficulty was with getting the air conditioning to American standards. The breakfast buffet was wonderful. We enjoyed the assortment of fruits, juices, breads, baked goods and cereals. The hot chocolate was yummy. We would definitely return to the Duodo Palace again.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“wonderful!”", "Author": "obryan144", "ReviewID": "UR71812433", "Content": "My husband and I stayed at the Duodo Palace Hotel in July 2010. We loved it. The hotel was clean, service was great, and rooms were beautiful. I would highly recommend the hotel to friends, family, and anyone planning to stay in Venice. We had an early flight on our day of departure, and the hotel staff even prepared a complimentary bag of food for us to take with us bc we would not be able to take advantage of the hotel breakfast.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Midwest, USA", "Title": "“Great hotel - once you find it”", "Author": "James E", "ReviewID": "UR71118257", "Content": "Nice clean hotel, excellent service, rooms were clean, but dark - even the lighting was dim due to the size of light bulbs - staff was very courteous, breakfasts were very good should publish GPS coordiates for the hotel location -- took 90 minutes after getting off the boat at St Marks to find the hotel -- they can also put a better map on their web site -- left by water taxi to airport and skipped all the transportation hazzle, recommend doing the same when arriving", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Beautiful place to stay and great service”", "Author": "BradnMarianne", "ReviewID": "UR70472274", "Content": "On the main island in close proximity to Piazzo San Marco. Rooms are beautiful and the service first class. Concierge is very helpful and polished. Great bathroom in a boutique style hotel.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vinings, Georgia", "Title": "“Friendly staff, great hotel.”", "Author": "Dougt1957", "ReviewID": "UR67939780", "Content": "We stayed here post cruise and loved it. Arrived around 10am, and was greeted by a very charming gentleman. As our room was not quite ready we were offered a free trip to Murano for a tour of the glass factory. When we got back our luggage had been placed in the room. Room was very nice. Some others had complained it was hard to find but we had no problem as we had printed a google map. Very close to St. Mark's square. A small square is close with nice places to eat. The staff guided us to our meeting point for our departure taxi by drawing it out on one of their brochure maps, and even packed us a breakfast bag because we had to leave before the restauraunt was open.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Great location on a secluded part of the canal but within walking distance of all the main attractions in Venice.”", "Author": "Longhorn3", "ReviewID": "UR64202080", "Content": "Impeccible service with very friendly staff. Room was decorated nicely and very clean. Had a window that overlooked the private canal, very romantic would definitely stay again.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Not disappointed yet again”", "Author": "sombochris", "ReviewID": "UR64062810", "Content": "This is the third or forth time at this hotel. The hotel is well located near to St Marks Square. The entrance is marble and brass and feels very plush. The receptionists are always helpful and suffer my Italian without complaint. The rooms are very opulent and feel very grand. Breakfast is good by italian standards. I have recommended this to others who have been equally impressed", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Middletown, New Jersey", "Title": "“Quiet gem near St. Mark's Square on a back canal”", "Author": "drswaim", "ReviewID": "UR63793020", "Content": "Our \"basic\" room on the top floor was quite lovely with a great view over the tiled roofs of Venice. The hotel is a gem and has been beautifully renovated and maintained. The breakfast was plentiful and varied, with cereals, yogurt, fruit, cold cuts, cheese and various breads. The coffee and tea were excellent. The location was amazing - just a few zig zags to St. Mark's yet far enough away to be serene. The room had an old TV but it worked just fine and there were plenty of outlets to recharge our camera batteries and iPod. Internet was not free, a sore point for us. We booked through an internet booking site and got a great rate for such a central hotel - remember, it's Venice and expensive. You can book an expensive gondola ride right from the hotel - or just wait until one goes by and snap a great photo! Get a good map and you'll have no trouble finding this gem of a hotel.", "Date": "May 10, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Romantic and Wonderful”", "Author": "Colleen61", "ReviewID": "UR63069678", "Content": "My husband and I stayed at the wonderful hotel while on our 20th wedding anniversary trip. It honestly was one of the best experiences I've ever had. Please do scroll down to earlier reviews to get directions to the hotel (it is tucked away behind St. Marco's plaza and not on a major street). It is quite simply charming, friendly and elegant. Our room was large and well decorated; the bathroom was modern and the hotel was spotless. I can't say enough about the friendly and efficient staff who work there. They have a solution for any problem, and are not condescending or rude, even if you are having difficulties, as I was with the hotel's internet one evening. Happy hour was a nice respite/stop after a day of sight seeing. The lounge area and breakfast rooms are intimate and elegant. Breakfast included fruits, cheese, meats, delicious croissants and coffee. I hope I am lucky to be able to stay at this wonderful hotel again some time.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Sussex, England", "Title": "“Lovely Hotel, Beautiful City!”", "Author": "m0nkiki", "ReviewID": "UR63047633", "Content": "Upon landing in Venice my fiance and I decided we would take the Vaparetto directly to San Marco Square. We purchased the tickets at one of the airport ticket machines for 13 euros each. The vaperettos arrive hourly and although they can take a while to get to the final stop ( San Marco Square) it was particulalry easy. After a short while of suitcase lugging my fiance and I finally arrived at this hidden, little hotel much to our relief. Although it's location is somewhat secluded, we found it to be central to all the main sights and attractions, while maintaining a quiet ambience to retire to at the end of the day. After arriving we were warmly greeted by friendly staff, showing us to our small but comfortable room. The room was spotlessly clean, and although we did not have a frescoed ceiling this did not make a difference to our stay at all. Breakfast was of a continental style and we happily tucked into croissants, toast, cereals, youghts, fresh fruit and coffee everyday ( the coffee is particulalry recommendable) all of which we enjoyed. We later booked a Gondola trip through the Hotel, which we found to be really good value. We shared our boat with another couple which worked out at 25 euros per person for a 45 minute ride. Other Gondoliers were charging higher prices, so this is definately recommended. We also enjoyed a glass of Prosecco in the hotel bar which we felt was great value at only 3 euros a glass. The city overall is expensive and my fiance and I did at times feel ripped off at some of the restaurants. We would recommend checking some of the cheaper restaurants on trip advisor first the Omnibus Restaurant close to the Rialto Bridge was great for pizza and good value too! Many of the eaterys will happily charge you cover charges, 12 % service charge and make you pay 6 euros extra for a plate of chips, so be warned! Overall a charming hotel in a wonderful city, do not hesitate over booking!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "torfaen", "Title": "“excellent hotel,well situated”", "Author": "manofgwent", "ReviewID": "UR61917970", "Content": "Smart, exceptionally clean hotel next to all tourist hot-spots. Outstandingly helpful and polite staff, even when dealing with an extremely rude \"gentleman\" who was having a tantrum one day at reception. Breakfasts were very good, but bedroom we had was very small and cramped and not at all as advertised, even in the information provided in the hotel itself. The hotels own leaflets say that ALL rooms have this or that feature which is untrue. The room was not in keeping with the rest of this excellent hotel. For its position and quality, this hotel is superb value and a great place to stay.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Quite and elegant hotel close to the Piazza San Marco”", "Author": "furryc", "ReviewID": "UR61796259", "Content": "Just returned from a four night stay at the Duodo Palace and would highly recommend it for a stay in Venice. Well worth a stylish arrival by water taxi to climb up in to the hotel entrance and be both assisted and greeted by such charming and friendly staff. The hotel is elegant and centrally located in the San Marco area but tucked away in a quiet location so a peaceful night's sleep is guaranteed. The rooms are clean and relatively spaceous, breakfast was continental and very good quality food and all the staff are very friendly and helpful; especially charming and informative is Francesco the Concierge. The hotel is close to the Fenice theatre which is well worth a look around and I would also recommend booking a walking tour and boat trip prior to your departure from home as we found this a good way to orientate yourself and to further decide exactly which venues and areas were worth further investigation. Wouldn't hesitate to stay at this hotel again should we return to Venice.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterhead, United Kingdom", "Title": "“Fantastico!”", "Author": "Craigewan", "ReviewID": "UR59942709", "Content": "A fantastic hotel in a great area, literally 200 yards from the world famous Fenice Opera House. Very central for all the sights - San Marco, Rialto Bridge etc., etc. From the very moment we alighted from our water taxi (must do) into the hotel we were made most welcome. All the concierge staff were very helpful with information, booking trips and restaurants. Rooms were spotlessly clean and very quiet even if we were on occasion awakened by the dawn chorus of the peeling of bells which can be heard throughout Venice. Breakfast was excellent with a selection of cereals, fruit juices, hams, salami, cheese, fresh criossants, toast etc., etc. Although we did not use the hotel bar (we were out all the time) it was reasonably priced. All in all a very pleasant stay in Venice and a memorable stay at the Duodo Palce.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "south derbyshire", "Title": "“Three lovely days in a super hotel in a beautiful city.”", "Author": "LindaCSwadlincote", "ReviewID": "UR59685899", "Content": "Just got back from a super break with my mom (75yrs young,) so wanted to be central to all the sight of the San Marcs area. I was so impressed with my self for picking this hotel from all the reviews I had read about others. Could'nt believe my luck. Beautifully clean and comfortable, our room and bathroom were immaculate. All the staff were so polite and friendly. Lovely continental breakfast,( yummy hot croissants and honey.) Found the hotel with no problems due to great directions from another guest on trip advisor. No 5 bus from the airport to Plaza Roma, No1 vaporetto (water bus) to first stop at San Marcs.Then walk up Calle Valleresso, by the Monaco Hotel. The street ends at a T junction, turn left then immediately right to continue up Frezzaria.This street has a sharp left turn, just follow it and you will come to a bridge. Go over it and Calle Minelli is next on the right. The hotel has signs here. Bought our bus and water bus ticket on line for the three days beforehand. Just took the paper work to the desk at the airport to get the tickets. These are scanned at the machines every time you get on the water busses, as often as you want during your stay. Wonderful !!!!!!!!!!!", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“A lovely hotel hidden away”", "Author": "Hack_10", "ReviewID": "UR59484371", "Content": "We enjoyed our stay very much thanks to the wonderful location, about half a minute from La Fenice, the exceptional quiet (with only a passing gondola to break the stillness), and the friendly staff. Francesco the concierge was particularly helpful. All warmly recommended.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Beautiful Hotel in Beautiful Venice”", "Author": "CadUk", "ReviewID": "UR58788321", "Content": "We had forward planned the route to the hotel and fortunately found it very well. On entering it was very impressive with lovely dÃ©cor and style. The staff were very helpful, they provided a map and marked places to visit across the whole of Venice as well as places to eat. We were shown to our beautiful room with a high slating ceiling, wooden beams and luscious red dÃ©cor (very Venetian) We had a view across the many roof tops and you could look down and see the canal entrance to the hotel. The en suite bathroom was very spacious with a lovely marble sink area and good shower. Our first evening exploring Marks Square and the surrounding alleys caused us much confusion on getting back to the hotel. Yes we got lost a number of times but it was all part of the experience of Venice â€˜Get Lostâ€™! Breakfast at the hotel was great; there was plenty to choose from alongside a great cappuccino or coffee. The breakfast area is fairly small with about ten tables of two. There was one occasion we had to come back to get a table over the 4 days we were there but it was literally a five minute wait. We would definately reccommend the superior suites at the Duodo Palace and would return. The places we would recommend in Venice are: The Basilica - just beautiful! The Dogeâ€™s Palace â€“ It is like a step back in time, fantastically stunning painted ceilings, rooms and art works. The history is also very interesting. Rialto Bridge - and local markets Gondola Ride â€“ We passed many men trying to sell us a gondola ride but really didnâ€™t feel the trueness of it, a bit like a group of lads trying to make an easy buck. We happened to come across a gentleman on the 3rd day that was slightly older with his boat stationed on a small canal. He seemed very genuine and friendly all dressed in his attire. It was a lovely experience which took us on a tour of the many famous buildings and the Grand Canal. It cost us 80 euros for about 45 minutes which I think is the average cost. Carpaccioâ€™s Restaurant â€“ Beautiful, fresh food, good wine and friendly service. We went here for our anniversary meal. Places we wouldnâ€™t recommend: Harryâ€™s Bar â€“ The worst made Belliniâ€™s I have ever seen and value for money doesnâ€™t come close. Disappointing atmosphere as well â€“ sorry!", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Villa Clara , Cote D'Azur, France", "Title": "“Be Careful of Wotif Mystery booking at this hotel”", "Author": "TheTravellingPococks", "ReviewID": "UR53043634", "Content": "Having visited Venice 4 times previously, we were very excited about staying in a 4 star hotel. We have used wotif extensively and have NEVER been treated as an inferiour booking, however all was to change at Duodo Palace. Our 2 rooms while being next to each other (which was fantastic for keeping an eye on our teenagers) were absolutely tiny, no beautiful ceiling as promised, no chair or desk, just the bed and the shower scalded all 4 of us! A VERY dissapointing 3 night stay, be very careful of the mystery booking in Venice, these are the rooms they can not normally sell.(The staff would normally stay here I think) In hindsight we got what we paid for.", "Date": "January 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Magical Venice”", "Author": "kilcoy", "ReviewID": "UR52415582", "Content": "Beautiful hotel, no criticisms at all. Would definitely stay here again - now that we know how to find it!", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brighton, UK", "Title": "“Delightful centrally located hotel, courteous service and nice rooms.”", "Author": "arty_fish Posted by an OctopusTravel traveler", "ReviewID": "UR51495434", "Content": "Stayed at this hotel for 2 nights, in a standard room. Service was delightful and courteous. Room service efficient and prices of cocktails reasonable. Decor of rooms sumptuous in an old world way with fabric hung walls. Marble bathroom was spotless. Didn't have breakfast in hotel preferring to have capuccino and panini out. Conveniently located near to Piazza San Marco and Academia and Teatro La Fenice literally round the corner. Didn't see any sign of the gym/swiming pool facilities but we weren't there for that. Would certainly recommend for its location and courteous service and standard of rooms, plus excellent price obtained via Octopus Travel.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great once we found it!”", "Author": "catb80", "ReviewID": "UR51167108", "Content": "We arrived at low tide, so we were unable to water taxi to the front door (or at least that's what we were told by the driver). Instead, we got to drag our luggage through San Marco Square. The hotel is tucked in a corner off some side street about 5 mins from the square. A few locals we asked couldn't even help us with the address. The hallways were pretty plain and sterile, but we were pleased when we arrived in a beautiful room with a bottle of Champagne waiting for us! Smaller bathrooms than what we'd experienced in Florence or Rome, but overall very nice accommodations. The front desk staff was very helpful in arranging transportation to the airport, etc.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sturminster Newton, United Kingdom", "Title": "“Comfortable and quiet hotel, well-located for all the main sights”", "Author": "DorsetDweller", "ReviewID": "UR50170030", "Content": "Hidden away in a tangle of backstreets, and on a small canal, this hotel is very quiet, yet in a great location for walking to all the main tourist attractions. The staff are friendly and helpful. Our room was comfortable, fairly large, and delightfully decorated with restored frescoes painted on the ceiling. All definitely 4-star except perhaps for the breakfast which could have offered more variety. The only difficulty is finding the hotel in the first place! Fortunately we'd read other people's reviews so knew to head for the Theatre Fenice and then ask for directions - which worked but we got lost a few times. If you can possibly find/download a map with Calle Minelli on it before you travel, then I'd strongly recommend that!", "Date": "November 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "France", "Title": "“Great location and very comfortable”", "Author": "acn0202", "ReviewID": "UR49875755", "Content": "We stayed at the Duodo Palace on a \"3 nights for 2 \" package and were given a lovely large room on the top floor - view over the rooftops and glimpse of adjacent canal; very peaceful.Room was very clean and bathrooms well stocked (but only simple hairdrier attached to wall, useless) . A little cold for November, we had to ask for heating to be turned up. Good breakfast very fresh rolls etc don't expect more in Italy. Fresh squeezed juice/eggs for a supplement if you want it. Very helpful concierge who twice booked us tickets for evening opera (highly recommend) 3 Tenors and Love Duets. First evening dinner close by Vino Vino recommended by hotel - quite good and not too expensive. Hairdressing salon next door. Not difficult to find hotel as v close to Opera House and a short walk to St Marks and vaporetto. No internet in rooms but free use of computer in lobby adjacent to bar. Hotel has its own canal side dock so arrive in style by water taxi!!", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Romantic and charming stay”", "Author": "mrsjames0376", "ReviewID": "UR47867631", "Content": "My husband and I visited the Duodo Palace earlier this month and it was inredible. True, true, the rooms were small and it was difficult to find, but that is true of all hotels in Venice. True of many hotels in Europe really. So don't let that put you off this beautiful palace. Our room was nice and well-furnished. The hotel was amazing and the staff could not have been more friendly. I just wish I had stayed for more than two nights, and that I could have afforded one of the deluxe rooms or suites. We will definitely be saving up our pennies to return on our next visit to Italy. Highly recommended. Venice is expensive, but just be smart and avoid eating and drinking near tourist attaractions. You'll get more value for money and a better experience if you follow the locals. Just like anywhere else in Italy. I wish I'd known in advance that you can book your boat bus tickets online to save money. So try to do that if you can.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great Location & a beautiful room”", "Author": "Bilbo1london", "ReviewID": "UR47534045", "Content": "The hotel was ideally located near St Mark's Square. The staff were very friendly and helpful, giving us a map and telling us the best places to go. The room was clean and had a great mini bar which was not too expensive compared to the rest of venice. The cocktails in the bar were great. Breakfast was a little disappointing, with dry rolls and a small selection of continental items. If you are going to Venice make sure you wear flat shoes and beware of the rain! Once it rains Venice starts to flood and you are bound to get wet.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Overrated”", "Author": "valambhiajn", "ReviewID": "UR45477606", "Content": "As much as I have read the rest of the reviews, I have to say that overrall, this Hotel is overhyped for what it really claims to be. The rooms are clean, but small and dimly lit. Mosquitoes are absolutely everywhere in the room and trying to sleep at night was a nightmare, even with Pest repellents. I'm sorry to have to burst the bubble but if I had to stay in Venice again, then I would recommend La Commedia or Hotel Monaco.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Conveniently situated for all Venice's attractions”", "Author": "sp1953", "ReviewID": "UR42891390", "Content": "This hotel is situated about 3 minutes walk from the Venice Opera House on the Calle Minnelli - warning it's not marked on most maps. Takes about 10 minutes from St Mark's Square. Rooms comfortable but those superior rooms on the top floor are dark. Breakfast is fresh and plentiful. Special mention of the reception staff who are incredibly helpful.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“Great location”", "Author": "Travelpony", "ReviewID": "UR42812544", "Content": "We stayed here for 2 nights. Great hotel, only a 5 minute walk from the St Mark's Square vaporetto stop. Great sized rooms and bathroom - complimentary toilettries, hairdrier, bath and shower, air con, tv. Slightly faded elegance but very clean and comfortable. When booking, ask for a room overlooking the canal - gondola's go by all day and in the afternoon/early evening, they sing and play the accordian which is lovely and to adds a great atmostphere. Receptionists all speak very good english and are very helpful and there's a nice bar too. Breakfast had a good choice of the usual continential breads, cheeses, meats, fruits etc. Only a 10 minute walk from St Mark's Square and from the Rialto Bridge so great location - the opera house is just round the corner too. Really nice local restaurants.", "Date": "September 19, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Portland, OR", "Title": "“Clean and quiet but not 4 star”", "Author": "ToandFromPDX", "ReviewID": "UR42012656", "Content": "After some confusion and multiple uncomfortable encounters with the staff, they allowed us (2 adults, 3 children) to stay in 2 rooms. After that everything was fine but the experience kind of ruined the stay. Rooms were small but nicely renovated and clean. Hotel is located off the beaten path but still close to St Marcus and a small square with some nice rstaurants. The lobby is small compared to other hotels we encounterd in Venice so don't expect to hang out there at all. The hotel has no restaurant which I expected in a 4 star hotel.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Leicestershire", "Title": "“A lovely honeymoon”", "Author": "CMBrad", "ReviewID": "UR39860631", "Content": "We went here for a low cost honeymoon and was recommended by the travel agent. We had a great time as the staff were polite and professional and it was very clean. The hotel was close to all the sights although we had trouble finding it from St marks Square when we first got there but it was very late at night. We would recoment paying for a water taxi if you don't want to be walking far with your cases. Venice is a lovely place and would love to go back one day.", "Date": "September 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sheffield", "Title": "“Nice Hotel and Great Location”", "Author": "GARYDOT", "ReviewID": "UR38737648", "Content": "A great place to stay for it's near most of the best places of interest, about 5mins walk to St. Marks Square and just a little more to the Realto Bridge. To get to the Hotel at first can be a nightmare, a Water Taxi is the best option but a little pricey so if your on a budget find directions form Alilaguna Water Bus which you can get with a few minutes walk from the airport and takes you to St Marks for just 13Euro's each. The Hotel is an old Venetian Palace with its strange lay out of rooms going off in different directions up and down stairs, our room was not one the the best, it didn't have the ornate period ceiling like most of the others and was quite small but had a lovely marble bathroom. It was always kept clean and the staff were very helpfull. All in all we had a great stay as Venice is such a very special place to visit with all its history. I hope this review will help you in your decision. cheers GARYDOT (Sheffield)", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Excellent Hotel - Would stay there again, no doubts!”", "Author": "dmackay41", "ReviewID": "UR36330330", "Content": "We picked this Hotel after looking at numerous hotels on this site. We arrived by water taxi, which is the best way to go. After a very fast check-in and a complimentary map of the area, we were assisted to the rooms with our luggage....and then we went to explore. Hotel itself is lovely and clean. The staff are very friendly, efficient and a great command of the English language. Rooms were very quiet and best nights sleep I had for ages abroad. Breakfast was included and was fresh, tasty and plentiful. As I said, I would stay here when I return to Venice. Don`t look elsewhere.....", "Date": "July 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Gorebridge, Midlothian", "Title": "“Perfect hotel in a fantastic location”", "Author": "CarrieG15", "ReviewID": "UR35550374", "Content": "We've just returned from 3 nights in Venice staying at the Duodo Palace Hotel. What a lovely Hotel, and in such a great location. Staff were very friendly and the hotel was lovely and clean. Venice has got to be without a doubt the best city we've ever visited. We got married at the Town Hall while we were there, which was totally romantic. Only downside is the ridiculous prices - but as it's somewhere you tend to only go for a few days, you've just got to put it to the back of your mind and enjoy!!! Gondola's are very pricey, but it's one of those things that you've just got to do!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ireland", "Title": "“stay here”", "Author": "almg", "ReviewID": "UR29690275", "Content": "Just got back from two great days in Venice. Highly recommend this hotel, location, staff, rooms, breakfast all excellent. I would urge everyone to buy travel passes on line before you go from Venice Connected, our 48 hour unlimited travel cost 21euros each. You collect them from the airport and take no 5 bus to Piazzale Roma then line 1 or 2 vaporetto to San Marco.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bedfordshire", "Title": "“Lovely Hotel”", "Author": "AlisonBedfordshire", "ReviewID": "UR28062895", "Content": "Me and my Boyfriend stayed at this hotel after reading the good reviews, well all information was right the Hotel was lovely ,staff very friendly and very good location. would stay here again without a doubt.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Milano", "Title": "“Nice unexpected pearl”", "Author": "diego_cla", "ReviewID": "UR25849280", "Content": "We've stayed at Duodo Palace one night for a romantic weekend in Venice. Booked as it was one of the cheapest in the S.Marco's zone, we were expecting a cheap rough hotel. Despite our expectations, the hotel was great, clean, with good rooms. The service was nice and the staff very nice. The breakfast, expected to be poor reading the other reviews, was nice and complete for a continental standard. Plus: location is great! 5min walk from S. Marco and still in a very quiet zone, facing La Fenice Opera House. From 4th floor the view is amazing, most landmarks can be spotted. We recomend the hotel!", "Date": "March 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Location, Lovely Hotel”", "Author": "lmul", "ReviewID": "UR24496529", "Content": "We stayed here for a long weekend at the start of Feb and really enjoyed our stay. The hotel was lovely and true to the photos. We booked a standard double, but our room looked a little bigger then the other traveler photos (room 208). The bathrooms are new, large and clean. Shower is a lil annoying for the tall (not me) as it is a bath attachment and the hook is not that high but the power is very good and there was always lots of very hot water. They have shower caps and shampoo etc and even had travel tooth brushes. In the room there was a minibar and TV and the bed was very comfortable. Our room had a very high cealing which was beautifully painted. We found no problems with noise and were never disturbed by housekeeping even when we forgot to put out the sign. The breakfast was a good continental - bread, pastries, cheese and meats, fruit and yogurt, juice and coffee. There was no one in the bar area in the evenings that we saw while there but it was Feb. and not busy. However we did get back after dinner one night and felt like a drink and the person manning reception was happy to serve us once we charged to the room. The location of the hotel is excellent. 5 mins to St. Marks square and to the Vallaresso water bus stop near St. Marks. For directions when coming from the airport w got the bus to Plaza Roma (2.50 euro) then vaporetto to Vallaresso (1st stop marked as St. Marks) This was a lovely trip up the grand canal, then we walked over the lil bridge to our left and walked up calla valaresso (by Monoco hotel) This street ends at a T junction, but turn left and then immediately right to continue up Frezzaria. This street has a sharp left turn but just follow it and you will come to a bridge. Go over the bridge and you will see Calle Minelli as the next right turn (the hotel has signs here) The hotel is just down on the left. Took us 5 mins and was no trouble (though as with everywhere in Venice try packing light and wearing comfortable footwear as there is lots of walking) At 300 euro for the room for 3 nights I thought it couldnâ€™t be beat, Would definitely recommend and return myself", "Date": "February 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“great location, great service, great hotel”", "Author": "bealeys", "ReviewID": "UR23792210", "Content": "We booked this hotel for a romantic treat on our fifth wedding anniversary and were not dissappointed. The location is great - literally a couple of minutes from St Marks and about 10 from Rialto Bridge. It was so easy to get around from there. We chose to get a water taxi direct to the door as we arrived late at night which was a bit of a splurge at 65â‚¬, but we are glad we did as although it's only a few minutes from the Vaparetto, there are lots of little streets to navigate through, which is fine in the day but we just wanted to get to the hotel at that time of night. The hotel will book one for you if you like, but we decided to get one when we arrived next to the vaparetto in P Del Roma On arriving at the hotel, We were greeted by very helpful and friendly staff - in fact all the staff we came across could not have been nicer. I had also emailed them previously before we arrived to ask a few things and they were so helpful, we couldnt fault them The rooms were spotless and although you dont get much of a view the hotel is charming with lots of character and tradition, yet with modern ameneties We had read some iffy reviews of the breakfast but we were happy with it - you wont find a fry up, but a generous continental spread which filled us up for our day of walking around Venice Our return flight wasnt till late evening and the hotel is happy for you to leave your luggage to collect later at no cost so you can make the most of the day. We had a great time in Venice and the hotel certainly lived up to our expectations and more - we would definately recommend and go back again if we get the chance", "Date": "January 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Lovely Hotel”", "Author": "ollocks", "ReviewID": "UR21635959", "Content": "Just had a great two days in Venice staying in the Duodo Palace Hotel. We found the hotel perfect for our needs, the room was large and well furnished overlooking the canal the bathroom large and more than adequate. Overall the hotel was extremely clean and very well maintained, the staff were all extremely friendly and helpful and I would not hesitate to stay there again and would recommend to anybody.", "Date": "November 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great location, Charming rooms”", "Author": "khabster", "ReviewID": "UR20472931", "Content": "The hotel was in a great location- 5 minute walk from St. Mark's Square. The rooms were very charming, with Italian decadence. High ceilings, colorful decor. The staff was very sweet. They even brought us a bottle of champagne for our honeymoon. The only problem was that it was hard to find- this is the case with all things in Venice, though. All the streets are small and so the maps aren't very helpful. The best way to reach the hotel is to take the public vaparetto to St Mark's stop and then walk about 5 minutes. It's 6 Euros per person, which sure beats the price of a water taxi.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Brilliant Hotel”", "Author": "cjm2279", "ReviewID": "UR19778273", "Content": "This hotel was great, the location was very central. I emailed the hotel to ask for a map as I had read it was hard to find, but I had no problems. It was about a 5 -10 minute walk from St Marks Square. The hotel will probably reccomend a water taxi (Ok if you want to spend 100 euro), but its just as easy to walk too. The rooms are quite small, and dark, but clean and tidy. The staff were lovely and helpful, and the breakfast was average.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South East Queensland", "Title": "“Venice is wonderful and so is the Duodo Palace”", "Author": "TRP1812", "ReviewID": "UR17899526", "Content": "Stayed for 3 nights with my wife (double room) my daughter and sister in law (twin room) and would rate this probably the best hotel for ambience and friendly professional service I have ever stayed at. The rooms were luxuriously furnished and finished, and for hotel rooms quite spacious, we had a great view over tiled rooftops. The reception area also very tastefully decorated, I almost expected to see Audrey Hepburn sweep through on her way to her room. We had 2 different concierges during our stay who looked the part and were very helpful and professional. They both directed us to some great eating places in the area. The continental breakfast was fresh and tasty and the waitress service was spot on. Not sure of cost my sister in law paid - always a bonus! The position is great for exploring the lanes around San Marco and Rialto - you can get nicely lost, but not too lost! One tip if you can afford it, catch a water taxi from the airport or station, the difference between being delivered to the canal front door against dragging suitcases through the back lanes of Venice is well worth it, as is the ride into Venice against a Vaporetto", "Date": "July 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worldwide", "Title": "“It was just as we hoped it would be”", "Author": "BrianandElla", "ReviewID": "UR17360180", "Content": "We travel ALOT all over the world and are quite demanding of the places we stay in and this little gem was all it advertized itself to be. We had no info about it save various website info & pics, as well as others' reviews. We were not disappointed. 5-10 mins. walk to S. Marco, quiet, ultra-clean, everything in working order, modern, beautifully designed. A great spot for romantics :-) We'd easily go back again.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stourbridge,England", "Title": "“wonderful place”", "Author": "binky_7", "ReviewID": "UR16959574", "Content": "Arrived on a water taxi direct to the hotel, and shown to our room 307 which had a balcony and there were compliementary wine and fruit awaiting us. All the staff were very nice and helpful and during the day it was lovely to sit on the balcony and watch the gondielers go past singing etc. The breakfast was fine and normal for europe hotels. Would definately stay there again. Very close to St Marks Square and the rialto bridge.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marietta, GA", "Title": "“Little gem of a place”", "Author": "MariettaGA", "ReviewID": "UR16435952", "Content": "We were traveling with two other couples and were ending our cruise in Venice. This hotel seemed to be a good option for us. Small, located not too far (five min walk to St Mark's) and the staff was responsive to our requests. Whole hotel is non-smoking. We took a water taxi (120 euros) to the hotel and the staff was ready and waiting for us. Our rooms were not ready yet so we went out to begin exploring Venice. When we came back our bags were in our rooms. Our room was very very small and had a step down to the actually room and two steps up to the bathroom. If I was to stay here again, I would be very specific about the room. Others in our party had a flight of stairs to climb and the third couple had to have a room with no stairs. Once that was all worked out it was fine. The room was very clean with plenty of hot water. No face clothes so if you need that bring it. Lots of airconditioning too. The concierge was excellent! Ask and they took care of it. There was a computer for internet use by the guests and it was pretty good speed too. Breakfast was not included but available for 15 euros. It was OK; a typical continental cold breakfast. BUT nothing is cheap in Venice. I would consider staying there again. The hotel was located off a tiny street very near the Fenice Opera House.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ohio", "Title": "“Lovely Hotel, No View From Room if You Want That”", "Author": "shimmer", "ReviewID": "UR16169023", "Content": "The hotel exceeded our expectations for european hotels. The location is great for getting to all the Venice attractions. The only weird thing we found was that the front desk keeps your room key every time you leave the buidling - this was a little odd - like always knowing where you are. But otherwise, the room was lovely, except that the window looked out at a brick wall.", "Date": "May 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“A conveninet place to stay..”", "Author": "Travelbuff-Ind", "ReviewID": "UR15560267", "Content": "As a part of our trip to Italy we stayed in Duodo during our 2 day stay in Venice. The place is wonderfully well located within a short walking distance from all major attractions. Reaching it can be a little bit of a trouble because of the small lanes but its not too bad if you follow the map that is provided on the website. The place is exactly as shown on the website so that is fair. Though I liked the place and loved Venice, a few things left us wishing for more. We had taken 2 rooms for 4 adults and one of the room provided was really tiny. It hardly had place to move and as per the front office no other rooms were available. Suggest you ask them for the big sized room while making the booking. The staff was ok. The front office could have been friendlier. However, the conceirge was helpful and was of great assistance and the person who helped us with the bags to the room also deserves a mention for cheerful service. The breakfast is something that Duodo management should look into. The food was just about ok and when we wanted to place an order for eggs, the staff told us that she cannot make it since she was the only person available to serve. This is when we were willing to pay extra for eggs. I feel the winner for Duodo is its location and lovely interiors and I would really like to stay there again.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spotsylvania, VA", "Title": "“Great Hotel Great Location”", "Author": "bullislander", "ReviewID": "UR14899054", "Content": "After reading reviews of this hotel I had some misgivings especially about being able to find it. I now have no misgivings at all. We took the Aliliguana from the airport and got off at San Marco. Took about 10 minutes total to find the hotel due to me doubting my map reading skills. If I went with my gut feeling it would have taken less than 5 minutes. Room was clean, modern, and good size. Staff was very helpful. Best part was location, location, location. We would without a doubt stay there again.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Riverside, CA", "Title": "“Great place”", "Author": "bbono001", "ReviewID": "UR14845510", "Content": "Stayed in the Duodo Palace Mar '08 and was really hard to find but turned out to be a great hotel. The room was ok but had really low ceilings. Other than that...the hotel was nice; front desk was helpful and seemed to have 4 star ammenities. It's really close to the Piazza San Marco and Ponte Rialto.", "Date": "April 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "SOMERSET", "Title": "“Perfect location”", "Author": "JULIESOMERSET", "ReviewID": "UR14314501", "Content": "Wonderful little hotel in a perfect location 2 mins from St marks -and the grand canal - incredibly difficult to find, especially if you arrive at night as we did. However the lack of public rooms i.e there is no restaurant or bar to speak of -lets it down and I would have to call it a 3 star not a 4 - it is a real shame that there is nowhere to have a night cap after a hard day and catch up with fellow guests -also the worst hairdryers ever - ladies pack your own! Staff friendly, welcoming and helpful.", "Date": "March 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Excellent Hotel”", "Author": "Holfans", "ReviewID": "UR14116600", "Content": "We have just returned after a four day break in Venice. We took the water bus to San Marco and it was then a simple 10 minute walk to the hotel. The hotel was beautifully decorated and spotlessly clean. The staff were helpful, polite and welcomimg. The continental breakfast was plentiful. Our room had a balcony which overlooked the canal. All the sights were within easy walking or waterbus reach. Overall a wonderful introduction to Venice.", "Date": "March 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wolverhampton", "Title": "“A Beautiful Hotel”", "Author": "WolverhamptonMissy", "ReviewID": "UR13904120", "Content": "My husband and myself have just returned from a weekend in Venice and it was wonderful. We stayed at the Duodo Palace and we had a beautiful room with a balcony and views over the canal. The room was very spacious and decorated in a traditional venetian style. The staff at reception and the bar area were attentive and nothing was too much trouble. We had read some reviews that said the breakfast was not good but we can honestly say it was one of the nicest continental breakfasts we have had with plenty of variety. There was an additional menu for cooked items but these were expensive. The hotel is positioned in a perfect place for the main sightseeing i.e. St Marks Square and The Rialto Bridge but always ask for a map from reception because it takes a little getting used to because the streets look the same. We had a private water taxi from the airport straight to the hotel which was really lovely but they are expensive 100 euros one way. The restaurants were all pretty good and all the meals we had were very nice but they can work out expensive especially if drinking alcohol as well. If we decide to go back to Venice we will definitely stay at the Duodo Palace again it was impossible to fault it in any way and we really enjoyed it. We hope this review has been helpful.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Ontario,California", "Title": "“Not happy with Duodo Palace”", "Author": "cinderella10195", "ReviewID": "UR12154319", "Content": "We booked a one night stay at the Duodo Palace after our Cruise returned to Venice. We had to pay alot (130 euro ) for the water taxi to get us their from the port because it is down a canal that is hard to get to. The front desk were not friendly. Our room faced the back of the hotel with no view. Upon checkout in the morning we were told we owed 40 euro for the Contienental breakfast that was listed as free on the menu in the room. We tried to argue the point that breakfast we ordered was on the free colum on the menu but to no avail they did not back down and we paid it so we could make our flight home. Would not recommend this hotel. unfriendly staff!!", "Date": "December 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Venice", "Title": "“Amazingly central”", "Author": "Jane78Venice", "ReviewID": "UR11239534", "Content": "We landed in San Palo airport @ 9pm & arrived at Duodo Place Hotel around 10.30 pm. Our room was really nice & being on the top floor (room 403) we had great views of the city. I would recommend this hotel due to it being so central, competitively priced & they were most pleasant & accommodating. While we had to check out at noon they minded our bags until we were ready to collect them to fly home later that evening. The mini bar can be quite expensive however so is the rest of Venice. I would return to this hotel again. A tip on finding the hotel when you get off the Valporetto Bus Boat. Go straight down the street passing Harry's Bar, keep going straight down the winding streets until you get to the Theatre Square (Fenice Theatre)...the hotel is on your right down an alley way (10 minute walk).", "Date": "December 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Decatur, Georgia", "Title": "“Good location and nice facility”", "Author": "ChewableFood", "ReviewID": "UR11073569", "Content": "The hotel is between and a little west of St. Marks and the Rialto. An easy 8 minute walk to each. I had their cheapest room which was tiny but the bed was comfy and the bathroom appeared recently refurbished with new fixtures and tile (There is a detailed floor plan in the hallway showing the fire exit routes allowing easy comparison between your little room and the rooms of the folks who forked it out). The lobby is elegant and the concierges were helpful on multiple occasions regarding restaurant selection and travel planing. One drawback: Orbitz said breakfast was included but the hotel said it was not. This seems to be a repeating problem between them an Orbitz because the concierge showed me a letter from his boss stating that the front desk should inform Orbitz customers that breakfast is not included. The breakfast hiccup aside, the hotel is very nice, well situated and I recommend it.", "Date": "November 26, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Hong Kong", "Title": "“Great Location, OK rooms”", "Author": "SMathew", "ReviewID": "UR10906914", "Content": "The Duodo Palace is very close to San Marco. If you arrive with big luggage it's a bit of a walk from the pier (check out duodopalacehotel for directions - there's a map) The room was a decent size, but filled with unnecessary furniture. We would rather have had one more suitcase stand than the armchair! The bathroom was of good size, the shower cubicle was tiny. There was a safe, and the beds were ok. The location was really the best part of this hotel. Walking distance to many sights and also lot of reasonable restaurants nearby. Our room didn't include breakfast (on arrival we were told 50euro pp!!) We had breakfast at a little cafe on Frezzeria every morning. They serve the best cappucino and sandwiches (worked out to 11euro for 2 of us!)...look out for the naughty calendars on the wall!", "Date": "November 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Location”", "Author": "jaycam", "ReviewID": "UR10520700", "Content": "We were married in Ravello Italy and spent 7 nights in Positano and 5 nights in Florence and then 4 nights in Venice for our honeymoon. We stayed at the Duodo Palace. It was easy to get to by water taxi. The room was small but very clean. The shower a bit small. The location was perfect once we understood our way around it was easy to navigate. At night I would hang out my window and listen to the music of the gondolas going by, It was very romantic. The staff left a little to be desiredâ€¦ They did give us help when prompt but made us feel like we were more of a bother. They always said hello/bonn giorno or goodbye/arrivederci. But it was somewhat robotic. They werenâ€™t very warm but then most of the people in Venice came across that way. The personality of the people in Southern Italy is much different than those of Northern Italy. Iâ€™m not sure if we were just spoiled by the warm friendly people on the Amalfi coast and expected more in Venice.", "Date": "November 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Bed bugs”", "Author": "da_ken_min", "ReviewID": "UR10458340", "Content": "We stayed in Room 308 in October 2007. Very good location but the mdf furnishings left a little to be desired. I took a spare pillow down from the top of the wardrobe at about midnight, and was aware of being bitten through the night. I remember thinking it was strange that I couldn't hear any mosquitos. By five I turned on the lights as I couldn't take it any more. I was covered in bites, from my head down. My eyes were half closed due to swelling. We still couldn't see or hear any mosquitos, and further inspection revealed several bed bugs on the pillow and the sheets. I presume they came from the pillow. We had to leave the hotel, which was pre-booked and paid for. The most disappointing thing about the experience was that the hotel refused to apologise and even refused to refund the unspent nights. Poor.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, CA", "Title": "“Perfect hotel, excellent location!”", "Author": "BayAreaBruin", "ReviewID": "UR10003254", "Content": "There are hundreds of places to stay in Venice so finding the right one could be difficult if you've never been there before. The Duodo Palace listed on various websites show being anywhere from 2-stars to 4-stars. I can tell you right now that there is no question that it is a 4-star establishment. Location is the best as it sits between one of the side canals and the street-side. It is literally 5 minutes to San Marco square. And the walk over to the square you pass by many shops, cafes, and restaurants. In fact, just 50 steps from the hotel are 3 very good restaurants with outdoor seating. If you do stay here, ask for a room with windows that open up to the canal. Gondolas go by periodically throughout the day. Have some wine, sit on the window sill, and watch them go by! My 3-yr old loved couldn't get enough of them! As far as the staff goes, they were very friendly and recommended some great restaurants bearing in mind that we had a 3-yr old and a 7-mo old. So service was great. Some other reviews said that the front desk was not very helpful. Nothing could be further from the truth. Both day staff and night staff were very amicable and helpful. Very professional and not stuffy. Overall, I would stay at this hotel again and would recommend it to everyone else, and will be doing so. From Venice, we moved onto Florence and Rome, and the Duodo Palace was by far the best hotel we stayed at in Italy.", "Date": "September 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“This Hotel Made My Vacation Perfect”", "Author": "Solomon88", "ReviewID": "UR8739005", "Content": "We arrived at the Duodo Palace after a pleasant train ride from Rome. As we arrived, we noticed how posh and proper the lobby was, including perfectly-attired staff. We wondered if this place would be too stuffy for us. Pleasantly, it was perfect in every way. Our room was substantial, and the bath was remarkable. The view from all three windows was postcard-perfect. The beds were comfortable, which were greatly appreciated after many long walks through the alleys of Venice. But while the building made our stay comfortable, the staff made our vacation perfect. Never in our travels has any staff made us feel so welcome, so comfortable. Francesco became a friend in a foreign place, and we entrusted our stay to him. From restaurant recommendations, which matched us perfectly, to sights to see, we felt we had our own personal guide in Venice. I have recommended this hotel to two friends already, and plan to do so for anyone else I care for who is visiting Italy.", "Date": "September 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice Hotel”", "Author": "mj_nj", "ReviewID": "UR8735618", "Content": "We had 3 nights in Florence, very clean hotel, friendly staff to happy to help you if you need it. The room was very small. You have to watch your head all the time when you are standing up. Having a shower was just impossible. You couldnâ€™t have one without sitting down. I wouldnt stay at this hotel again.", "Date": "September 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“Good and Bad for Duodo Palace”", "Author": "sharongail", "ReviewID": "UR8472129", "Content": "We stayed three nights at the Duodo Palace in August. We wrote ahead telling them it was our 25th anniversary and that we requested especially nice, (although we had only standard) rooms. Indeed, we were given nice rooms. Ours had a decorative Venetian ceiling and our kids was very pretty as well. We specifically said \"no annex rooms\". We did have an elevator, unlike the last review I read. Our rooms were on the 3rd floor...303 and 304 I think. No views at all, but nice rooms. Only problem was that we had requested no smoking and our room smelled horribly of smoke. They offered us other rooms but they were so inferior that we had them spray and stayed there. (a mistake, because the smell never left!) The location was great, it was near St. Mark's Square but very quiet. DO take the water taxi as you will NEVER find it and no one seems to know where it is. We didn't heed that advice and walked an hour to find it. Breakfast was simple but very good. Nice breakfast area. The front desk staff was not very friendly; rather, they were all pretty stiff and formal. They would answer questions but didn't bend over backwards to help at all. I am sure there are other hotels that are equally nice with friendly service as well. We did enjoy the quietness of the rooms. All in all, it was a nice place, elegant Venetian atmosphere. A few problems and lack of better service might prevent us from staying there again. If our room had not smelled of smoke, we would have probably been alot happier.", "Date": "August 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Olympia, WA", "Title": "“Somewhat Dissapointed”", "Author": "teacher34", "ReviewID": "UR8399346", "Content": "We just arrived back home in Washington from Venice yesterday evening. We stayed approximatley three nights after spending four nights in Rome first during this week long trip. I must say I was dissapointed in this hotel after our luxury hotel in Rome. First of all I can not stress enough what other reviewers have said. Take a water taxi to this hotel. It was very difficult to find. People were not familiar with the location and we ended up taking over an hour to find it!! It is very confusing for a first timer. Also, we got off at the Rialto Bridge and should have gotten off at St. Mark's. Our room was on the third floor. Where our room was located is no elevator. There is an elevator to the other side rooms. As you walk in the main door the rooms to the right have access to an elevator, rooms to the left do not. We went up three flights of stairs. If you have trouble walking, climbing stairs, be aware of this. Also, I read the internet was free. It was 5Euro when we were there, so maybe a new things. I have posted a few pictyures of our room. I would say our room was nothing to write home about. Also, there were these little gnats flying around, another couple had those also. Breakafst was OK, nothing special. The location was great. The restuarant right around the corner became our favorite. Read weather before you go as it was really raining there our last night with thunder and lighting!", "Date": "August 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hotel was ok”", "Author": "donnakaa", "ReviewID": "UR8278801", "Content": "I took the advice of others on this site and got a water taxi from the airport directly to the hotel. If you stay at this hotel I can't recommend this enough. Yes it cost a bit ,but the the ride was better then a gondola ride and it saved such a big headach. On the return we took the ferry, but wish we had taken the taxi again. The ferry is slow and takes forever. The hotel itself is fine, nothing really special about it. If I had to do it again, I would stay even closer to Saint Marcs. We got lost plenty of times and this was our second time in Venice (first time was with a tour group). We stayed in a juinor suite, but it was much smaller then I thought it would be, even for Venice, so don't waste your money and we had no canal view.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Penhook, VA", "Title": "“Great location and value”", "Author": "VAViajero", "ReviewID": "UR8212129", "Content": "My wife and I stayed at the Duodo Palace two years ago and on our return found that it was as good as ever. Very conveniently located with a friendly and helpful staff. They got us tickets to an event called â€œMusic in the Palaceâ€�, an abbreviated form of an opera (in this case â€œLa Traviata) held in an elegant private palace. The performers were superb as was the four piece orchestra. The opera is in three acts â€“ each one performed in a different room. There were only the principals (no chorus) and the audience is scattered around the room, with the cast moving among the audience, making us feel a part of the performance â€“ a very intimate experience and highly recommended, even if you are not an opera buff. We requested and got our former room â€“ very spacious and elegantly decorated, with a view of the small canal in front where we arrived at the front door in our water taxi. The hotel has no restaurant but there are several very good ones within easy walking distance. Breakfast is quite good â€“ the usual Continental affair with ham, salami and cheese to provide some protein. Eggs and other items are available on request (but a bit pricey). We highly recommend the hotel and would certainly return if/when we return to Venice. (Word of caution: July is not a good time to be there â€“ very hot and humid and packed with swarms of visitors.) BTW, TripAdvisor lists the hotel as having two stars, but the hotel claims four stars. Somewhat confusing. I would give it three and a half stars.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“a wonderful slice of venice”", "Author": "equipmentmanager", "ReviewID": "UR7958837", "Content": "Centrally located, the Duodo Palace makes you feel like a Doge. After an interminable plane trip, arriving at the door of the hotel via water taxi was like a dream come true. Our rooms were spacious for my husband and I and our three teens, and looking at the original frescos on the ceiling transports you to another time. Breakfast was very adequate and very convenient. Staff was extremely helpful, especially when my daughter became ill. The location was ideal, and I can't wait to stay there again.", "Date": "June 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worthing", "Title": "“Great hotel and location”", "Author": "Bazza51", "ReviewID": "UR7804151", "Content": "You won't find a better hotel for a break in Venice. Private landing stage for our water taxi, very pleasant english speaking concierge, breakfast fine, pastries, cereal,juice, croissants etc. Room lovely, all decorative and fabric wallpaper , huge bathroom. Everywhere spotless and nothing too much trouble. Fantastic location 5 mins walk to Rialto, St Marks and Accademia Free internet so could keep in touch with the kids on msm!! Strongly recommended.", "Date": "June 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "surrey", "Title": "“Excellent Venetian hideaway”", "Author": "pgwill", "ReviewID": "UR7774774", "Content": "We booked two weeks before travelling and our choice of hotels was limited. The Duodo Palace certainly looked great on the website and we were surprised that the online rate was reasonable (for Venice!). If you are going to Venice and intend to walk around all the little streets and alleys you need a good map. You will then have no trouble finding the hotel, and in fact their website has good instructions as well. We arrived before checkin time but were welcomed extremely graciously and shown to our room which was on the 4th floor and had a view over the roofs to the Campanile and to the Salute dome. The room was large by European city standards and the bathroom clean and well supplied. The decor was very Venetian - red and gold wall hangings and a comfy large bed.As the temperature in summer is hot (30 degrees C in May) air con is very welcome. Breakfast was certainly adequate to start the day and all the staff were polite, attentive and oh so beautifully dressed. There are plenty of good restaurants around, we ate in various sestieres of the city at recommendations in the guide book which might be far afield for some folk but we liked the stroll home afterwards, and often stopped at the cafe next to the Rialto hotel overlooking the bridge and canal for a little libation on the way back. Would stay there again in a heartbeat.", "Date": "June 5, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "West Yorkshire", "Title": "“Perfect location for San Marco”", "Author": "FlipperWestYorkshire", "ReviewID": "UR7590976", "Content": "The Doudo Palace is a 600-year old Venetian Palazzo which has been thoroughly and tastefully restored within the last five years. It is situated in a very quiet spot with direct access from a canal, which made our arrival a dream. The water taxi from the airport was worth the extra cost. The trip along the Grand Canal under the Rialto Bridge was breathtaking, and we were in the hotel within an hour of stepping off the plane. The hotel staff are friendly and efficient, and the room was beautiful. The bathroom was superb and it was not possible to fault this hotel in any way. The inclusive breakfast has limited choice but was more than adequate for us, and the coffee was excellent. It is possible to pay extra for cooked items but we never felt that this was necessary. There is no hotel restaurant for evening meals but the surrounding streets have a wide choice of styles and prices to suit all tastes, so this is not an issue. Directions to the hotel are signposted from the network of streets so it is comparatively easy but arrival at night, on foot, with suitcases, for the first time may well be a frustrating business. The water taxis make the whole experience far more relaxing. To round off the perfect break in Venice, returning to the airport by water taxi is recommended. The location is very central for Piazza San Marco [5min] and the Rialto Bridge [5-10min] and it is a wonderful place from which to discover Venice.", "Date": "May 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Superb”", "Author": "Niamhy69", "ReviewID": "UR7285033", "Content": "A superb little hotel at a great price. Hard to find but everything is at first in Venice. Once you arrive, greeted by very friendly staff, luxurious rooms with a nice breakfast. Would recommend to anyone looking for a great hotel on a budget in Venice. Would definitely go back again. Niamhy, London", "Date": "April 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel, excellent location, Friendly staff, Highly recommended.”", "Author": "ThevisitorLondon", "ReviewID": "UR7209121", "Content": "I stayed here in early February just before the carnival began with my girlfriend on arrival, fiancee on departure! Was a very nice hotel, in an excellent location with very friendly staff. Breakfast was basic but absolutely fine, they will cook eggs etc for you but I did not try that. Overall I would definitely stay here again, and highly recommend it to others looking for a nice mid range central hotel in Venice. I can highly recommend a small bar/restaurant called Osteria Enoteca San Marco on Frezzeria, which is on the way to San Marco square, for a drink or light meal. I cannot recommend La Teatro restaurant near the hotel, avoid!!!", "Date": "March 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Midlands, UK", "Title": "“Fantastic Hotel”", "Author": "JulesEastMidlands", "ReviewID": "UR6916517", "Content": "What a fantastic hotel! I took my husband for a surprise birthday present and considering it was all planned in secrecy, it couldnt have been better! I booked through my local travel agent but was worried about arranging transport from the airport. I found the email address and emailed the concierge (Michele). He replied almost immediately and arranged for us to be collected from the airport in a top of the range Merc who delivered us to a private launch which then took us to the hotel. They couldn't have done anything better! The hotel is in a fantastic position just off St Marks Square. It doesnt look much from the outside, but we had a fantastic room with a balcony and it was great to look out over the canal. All the staff were exceptionally friendly and helpful. I can only give this a 10/10 rating (or maybe a 12/10!) It was fantastic. Will definitely be staying at this hotel again. The only down side to the hotel is they dont have tea and coffee making facilities, which would have been nice, but it was just another excuse to pay Â£5 for a coffee in St Marks and watch the world go by", "Date": "March 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great Hotel, Highly Recommended”", "Author": "The_photographer", "ReviewID": "UR6800420", "Content": "We have spend 3 days February 2006 in this hotel. The hotel is very easy to find from St Marko square. From Rialto is a bit complicated. The Hotel itself is a true 4 star hotel, everything is new and very stylish, the hotel manager is extremely polite. The rooms we stayed (105 & 106) were very very nice, spacious, clean and warm. The breakfast was ok but they surprised us when we left at 7 oclock in the morning they had prepared for us a bag with the breakfast we would otherwise loose (because of of early departure). What a great service. Bravo guys. I have nothing to write but excellent review on this hotel. The only thing that bothered me was a strange smell in the room, not from the canals. More like hospital smell, probably from something they use for cleaning or some plastic. Opening the window for a while did solve this. Anyway, one of the greatest hotels i have used in my trips. Highly recommended.", "Date": "February 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“Great Location”", "Author": "robbie&kylie", "ReviewID": "UR6648133", "Content": "Great location near San Marco Square; good restaurants nearby, can recommend the Rosa Rosa Pizzeria ! Hotel breakfast was average, supplements required for anything cooked; reception staff very helpful; we had an inner courtyard room, if you can afford it worth the upgrade for some natural light and canal view. Thought Venice was a fab place, very romantic.", "Date": "January 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Shame about the breakfast!!!!”", "Author": "checkouttheworld", "ReviewID": "UR6641475", "Content": "I've stayed in this htl w/ a friend last year for 4 days. The location is great and the room was superb! Very big, very clean and overlooking 1 canal. The staff was very friendly and helpful. Although, the restaurants they've recommended us were extremely expensive (even for Venice standards - you can easily find nice and cheaper places if you \"shop around\"-). However, the only downfall was the breakfast! Terrible in quality and variety. The bread and mini croissants were hard and stale, only butter and jam (orange only) were available and the drinks were coffee/milk or a terrible orange juice. Can't actually remember if they had any cereals available but they had no cheese, meats, yogurts, fruit, cakes/biscuits or any of the other items you would expect from a buffet breakfast in a 4 * SF category hotel. The htl has \"A La Carte Menu\" for breakfast, with several options to choose from, but 1 fried/scrambled egg will cost you EUR 5.00/GBP 3.30!!! In resume, everything is great but you are much better off going out for a nice breakfast!", "Date": "January 22, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, England", "Title": "“Modern hotel, Venetian style in central location”", "Author": "tonyj01", "ReviewID": "UR6623193", "Content": "This modern hotel is decorated in a Venetian style, as can be seen on the hotel's website. The location, near La Fenice, whilst not in a famous spot, is very central, being less than 10 minutes walk, and equidistant to San Marco, Accademia Bridge and Rialto. Another very pleasing aspect ot the location is being able to arrive by water taxi directly into the hotel lobby, just step off the boat. Gondoliers ply their route by the hotel, you hear their shouts of \"Ayeee\" from open windows, and their hooped shirts glide past the small breakfast room. Don't expect much of the breakfast, think of the hotel as a small city centre hotel, as in London or Paris and you will get the style. At the time of out stay there was complimentary internet access on a PC in the lobby area, occasionally a small queue. Our family's three rooms on the 5th floor were high in the eaves - plenty of space and featured a view of the campanile of San Marco from our bathroom.", "Date": "January 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Just perfect”", "Author": "dublintraveller", "ReviewID": "UR6232960", "Content": "I have been to Venice several times, and although the city is amazing, the hotels can be overpriced and disappointing. Not so the Duodo Palace, however. I was travelling alone on my most recent visit (November 17-19), and found this to be a perfect place to stay. The reservations staff were prompt and efficient in confirming my reservation prior to my arrival, and the front of house team were welcoming and helpful. The hotel has a little bar where you can have a drink in the evening in safe and comfortable surroundings - useful when travelling alone. And, for the very reasonable price paid, my room was more than acceptable, with a full bathroom rather than just a shower. There are more luxurious rooms to choose from, some with canal views and balconies, and I intend to try one of these on my next visit. The hotel can be a little difficult to find, especially if arriving at night, but you can take a water taxi from the airport right to the door of the hotel. This place is a gem.", "Date": "November 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Georgia USA", "Title": "“Lovely palace hotel”", "Author": "pecg", "ReviewID": "UR5947525", "Content": "A lovely small hotel in Venice. Beautiful lobby and accessible to water taxis. Staff at the front desk and bar were helpful. Difficult to find from the train station. Would advise travelers to get directions before leaving for Venice. Take a water taxis and not the water shuttle. Would return to this hotel and recommend.", "Date": "October 13, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "brisbane", "Title": "“Great time at the Duodo”", "Author": "timbo1terror", "ReviewID": "UR5906493", "Content": "Ah venice, what a place! The Duodo was in a quiet spot within a 10 minute stroll to San Marco and other attractions such as shops etc. Some words of advice though... If you arrive late in the evening I would diffinately take the option of a private water taxi rather than the vaporetto (water bus) option. We took the bus as it was 20euro compared to 60 but it took ages and dropped us off at San Marco from where we had to navigate over bridges and through dark streets until we finally found the Duodo tucked away in it's own niche. Not the best or least stressed introduction to one of the most beautiful cities in the world. Once the stress was out of the way the hotel and its staff were very nice. Our room was small yet immaculate with excellent aircon, a large bathroom and cable TV. The breakfast was tasty enough but consisted of the usual italian breakfast fare. Coffee and croissants etc. We found that the hotel in the piazza just around the corner and next to the opera house was really good and not too expensive. We took a private taxi on our way out of venice. On reflection the only negative was the lack of direction offered in terms of geting there and the fact that the room was rather small.", "Date": "October 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“I loved this place”", "Author": "LILynn", "ReviewID": "UR5877206", "Content": "This hotel is wonderful - our room was beauttiful and romantic (too bad I was with my mom!!!) The location was great. We had a small balcony that overlooked the canal. You could stand on the balcony and watch and listen to the gondoliers pass by. I loved Venice and I would stay here again in a minute.", "Date": "September 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Duodo Palace, Venice”", "Author": "Anne69", "ReviewID": "UR5496272", "Content": "Fabulous hotel. Superb position. Room beautiful. Could not have wished for a better place to spend 3 days in Venice. Room 306 is recommended.", "Date": "July 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Derby", "Title": "“Great location and price!”", "Author": "WoodlarkWanderers", "ReviewID": "UR5442507", "Content": "We stayed here as part of an 'extended honeymoon' as we got married just before Christmas 05. We found Venice to be everything and more that you could want as part of your honeymoon. The hotel itself lived up to the pictures on the website, the rooms were decorated to a high standard, were very clean and well stocked with many of the little extra's you tend only to get in hotels of higher ratings. Although the hotel was very quiet during our stay we did not get a room with a decorated ceiling or canal view, in fact we were next to the lift! We did find some of the staff to be a little unfriendly; we were horrified to hear the breakfast waiter telling a couple off for sitting at a table for four when there were only two of them! Although there was a breakfast menu on the table the waiter didnâ€™t make any effort or indicate that you could actually have anything from it, we were left with the breakfast buffet which I felt was a little sparse. The bar had strange unexplained hours and when we tried to get two coffee's one afternoon we were charged 20 euros!", "Date": "July 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Carisbrooke Isle of Wight", "Title": "“Amazing Holiday”", "Author": "Billy's_girl", "ReviewID": "UR5351662", "Content": "We traveled to Venice on the Orient Express and when we arrived were taken in a motorboat to the Duodo Palace, it looks exactly as it does on the website. We were greeted by a courteous, helpful receptionist, our baggage taken to our room (which was the pink one on the home page) The room was sumptuous and the painted ceiling was beautiful and, as others have said the bathroom huge! We found our way around fairly easily after the first night and found the central location a huge bonus. The breakfasts were always good and the service prompt and polite. There are several nearby restaurants that we enjoyed. We both totally recommend this hotel and Venice to anyone!!", "Date": "June 15, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "liverpool, england", "Title": "“Ripe for Romance!”", "Author": "Ipgard", "ReviewID": "UR5348607", "Content": "My wife and I stayed here for our honeymoon and were very impressed with every aspect of the hotel. Room overlooked the canal where singing gondoliers passed by frequently during the daytime. What a delight! Hotel staff were extremely helpful and courteous. Breakfast was in a very pleasant room next to the canal with a sufficient range of the usual fare in enough quantity to set you up for the day. The hotel was very clean and our room was tidied, cleaned and restocked by the time we got back after lunch. The hotel is a five minute walk fron St Mark's square and the Rialto Bridge, but manages to be extremely quiet of an evening. I would recommend this hotel to anyone.", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "washington dc", "Title": "“Enjoyed our stay, great staff & pretty Hotel”", "Author": "b4wego", "ReviewID": "UR5204616", "Content": "The staff was very agreeable and accomdating, room was small, but the bathroom was large and modern, the view was a courtyard. The pictures of the bedroom (on the web site) was a bit misleading, ours was very plain. The breakfast was more than adequate, and the staff was informative. The resturant in Fenice Square (Antic Martini) was excellent. The location is near everything and yet off the beaten path. We had three wonderful days in Venice and will return again & again.", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Loved our stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4997022", "Content": "We just returned from our trip to Italy which started our with a 3 night stay at the Duodo Palace Hotel. It was wonderful. The room was beautiful with a great view. The staff was extremely nice and helpful. I will definately choose to stay here again.", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Hinckley Leicestershire", "Title": "“Worst hotel we have stayed in.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4995763", "Content": "Obviously the hotel had overbooked and when we arrived we were placed in what can only be described as a cell. The room didnt appear to be part of the hotel and was about 100 yards away. We entered the room direct from an alley way. We were kept awake all night with the noise of people walking down the alley and dragging cases along the cobbles. On the second night we had the pleasure of what appeared to be a business above our room dragging furniture around. Despite various complaints to the staff we didnt get anywhere. This was supposed to be a special weekend for my 35th birthday arranged by my wife who was extremely upset that she had booked a 4 star hotel especially for the occasion and had researched the hotel following the excellent reviews on websites such as trip advisor. How wrong could you be. As the hotel was mainly full of older couples we can only assume that they had decided to keep the younger guests outside. Needless to say we do not recommend the hotel.", "Date": "April 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Nothing but praise for this hotel!”", "Author": "SteveDLasVegas_NV", "ReviewID": "UR4993836", "Content": "Listen up Americans. I've have stayed in many hotels and B&B's throughout the world and the Duodo Palace in Venice was great. Perfect location away from the crowds but centrally located. Rooms were clean and well appointed. Free intenet access and good breakfast. Stayed in junior suite with lots of space and modern conveniences. Staff was very friendly and all spoke english. Would stay there again and this was my second trip to Venice.", "Date": "April 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“great hotel great location”", "Author": "denholsa", "ReviewID": "UR4626361", "Content": "Just returned from 3 nights at the Duodo Palace and couldn't fault a thing. Our room 103 didn't overlook the canal but we didn't expect it to for the price (about Â£80 a night) when you consider you can easily spend that on a meal and wine at a reasonable restaurant in venice you realise what a good deal that is. The bedrooms were spotless and typically venetian with gold fabric walls and furnishings- the bathroom large and spotless. The location of the hotel is great 10min walk to Rialto,St Marks or accademia but still very quiet. The break fast is continentla in style, venetians don't eat breakast- you can buy eggs and bacon but they are a bit pricey, the breakfast included is fine so I wouldn't bother-I particularly liked the panettone- currant bread spread with butter. The hotel staff were really helpful and not snooty (which they can be in some places in venice- the unmissable cafe Florian in Piazza St Marco, for instance). We ate at Gallileo just round the corner from the hotel on or first night and the food was excellent- if you like cheese we'd highly reccomend the ravioli gallileo- they have the typical four course meal but we didn't have all of them , a pasta and a main course is fine. It was a little pricey at 90 euros all in with a half bottle of wine but the quality and quantity of the seafood was worth it(tuna and seabass). We ate at a touristy place by Rialto in front of the rialto hotel as its so scenic by night and paid just a bit less but we only had pizzas but two fab starters, highly reccomend the melon and parma ham or the beef carpaccio here, you get loads - the pizzas were nice too and the wine not too bad price. We ate round the corner from the hotel at the teatro- the food was ok and seemed reasonably priced but when you add a 12.5% service charge and cover charge it added over Â£20 onto the bill. We wanted to eat at Da rafaelle on cala ostreghe but we picked the night it was closed ! that is something you need to watch as it seems to be a district thing in Venice- we also got caught out by trying to visit Peggy Guggenheim Art gallery on a Tuesday- don't it's closed. We only had 3 days so by the time we were back at the room couldn't be bothered to venture far but I'd try Dosodoro or SantaPolo/Croce as the restaurants there looked better value. We also walked down to Zattere which looks over Giudecca- there was a great view and some reasonable restaurants there too. As first time visitors (but not the last !)to Venice we did all the must dos- some tips........ get a ticket for the Palazzo Ducale- its fab and don't miss the Doges Apartments- if you think Versaille is opulent you need to see this- the same ticket at 11 euros covers you for the museum in St Marcs Square (the museo correr which is really good and is at the top of the square-the ticket also covers you for palazzo mocenigo)- if you go in the cafe in museo correr (and do nothing else from the cafe del arte you get the best and cheapest) view of St Marcos square and the coffee is reasonably priced. Also in the basement of the pallazo ducale( doge palace) there is a cafe where you can have a sandwich and watch the gondolas pass by through a window which is not far off water level- the only place we found to do this. Like all places in venice if you stand up the cost of what you have (food or drinks)is a third less than sitting down but hours on your feet means you soon give up on that one. Final tip get a number 1 waterbus service from St marco to Piazza del a roma early on in your trip- takes about 40 mins and you get lovely views of the Grand canal we walked all the way back from Piazza del Roma by crossing over the bridge (there is a great sandwich shop here) through the streets down to Rialto and then onwards- shopping is a lot cheaper here and you do get to see how the venetians live. I've seen a lot of postings re getting to this hotel it really isn't bad at all- you get the vaporetto Aliguna from the airport buy your ticket in the airport at the ATVO/Alilaguna desk at 10 euros- stay on until St Marco (Valleresso)you can't miss it-takes about 1 hour 20mins.Walk straight up calle valeresso which becomes calle frezzaria and then turn left onto calle barcoli continue toward la fenice toward campo san fantin. Failing all that ask for la fenice (opera house)stand in the square near el teatro restaurant you'll see a tiny burgundy and gold sign for the hotel which is just down a side street. Personally finding it's not half as bad as we thought-the maps in the AA spiral guide to venice werereally good and we used them continously. On reflection we wish we had booked a private water taxi it is costly at about 80 euros but it would have been a really nice way to arrive at the hotels own landing stage. If you are on a budget don't worry the vaporetto is great and I can't ever remember a more fascinating way to get from the airport- it also lets you get your bearings and gives you confidence on the waterbus. Overall a great and beautiful city-like stepping back in time............enjoy - we did !", "Date": "March 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "london, UK", "Title": "“Loved it”", "Author": "julianwalker", "ReviewID": "UR4448478", "Content": "I stayed at this Hotel last weekend with my wife for her birthday. I have to say that I was a little worried but it was great. We arrived late and the hotel staff were so kind and accomadating. Over the 3 days they couldnt do enough to help, the breakfast was nice and everyone was polite. They recommended an amazing restauant and we had a lovely time. I would highly recommend this hotel and we also got a free bottle of wine for my wifes birthday.", "Date": "February 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“We loved the Duodo!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4446727", "Content": "This is a lovely hotel in a great location just a short walk from St Mark's square and the Rialto bridge. The room we had was quite large with beautiful decor and views over the rooftops of Venice. Staff were very friendly and helpful. Good breakfast with plenty of choice. It is quite difficult to find this hotel but the best option is to go to the Fenice Opera House and look towards the top left hand side of the square where there is a small plaque on the wall directing you down a lane to the hotel. This was our first visit to Venice and we would certainly return to this hotel.", "Date": "February 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Delightful Duodo”", "Author": "A TripAdvisor Member", "ReviewID": "UR4393892", "Content": "Stayed here for 2 nights in Sep 2005 with my husband and 12 yo daughter. A very elelgant hotel with georgeous rooms and fittings. Rooms are also large for Europe. The staff were extremely helpful and attentive and the breakfast was very good. The hotel is situated on a canal and is only a short walk from the Piazza. Added bonus, complimentary internet access in the foyer. We also got terribly lost trying to find this hotel - the lane it is on is not on the standard Venezia tourist map! I recommend that you catch a vaporetto to San Marco, then go to the tourist office and get detailed directions. Overall, if you want somewhere stylish, comfortable and reasonably priced (for Europe) - Duodo Palace fits the bill!", "Date": "January 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "York", "Title": "“Lovely Hotel and brillant location”", "Author": "traveller6", "ReviewID": "UR4367742", "Content": "We stayed in this hotel back in July 2005. It took us ages to find the hotel (make sure you take a decent map as none of the locals knew where the street it is on was) but when we did we were very impressed. The hotel is beautiful inside, typical venetian decor, and is in an amazing location just a walk away from St Mark Square. The staff were very friendly and the breakfast lovely. I would definitely recommend this hotel and would stay here again if I returned to Venice.", "Date": "January 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Manchester, UK", "Title": "“Perfect Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4218483", "Content": "Our first trip to Venice, and we are definitely going back!! And when we do, we want to stay in this hotel again. In fact, we've been put off staying anywhere else for fear of not getting the same luxury and service. The hotel is lovely, and the rooms are beautiful and very clean. There is a very relaxed atmosphere, but the staff are always to hand and more than willing to help. They recommended a restaurant to us, which again was excellent, and we will definitely visit again next time we come to Venice. They also advised us of what to look out for and to avoid. The view from our room wasn't great, but hey, we didn't go to look out of the window.", "Date": "December 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Chester", "Title": "“Great Hotel in a great Location..”", "Author": "A TripAdvisor Member", "ReviewID": "UR4159479", "Content": "We have just returned from our first trip to Venice and can certainly recommend this hotel. It is in a great location, less than 5 minutes walk to St Marks Square, with shops and bars just around the corner. Rooms are maintained to a high standard, very clean and the level of service excellent. Breakfast is simple, crossaints, toast, fruit, youghurts and cereal, with free tea or coffee. There is a free internet service provided in reception, and rooms have TV and a mini bar. We booked this hotel through Octopuss travel and paid Â£145 for 2 nights, our room did not have a view of the canal, but for price we paid I did not expect it too. Venice was superb, and I would certainly stay in this hotel again.", "Date": "December 3, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Seaford, DE", "Title": "“a nice place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4143900", "Content": "on our first trip to venice on our honeymoon we were sort of let down by the size of our room compared to our hotel in rome. We were on the first floor and our view was an alleyway. Breakfast was so-so but the location was very central but is hard to find. If you can find la fenice you can get there pretty easily The staff did recommend a wonderful restaurant called galileo, we ate there many nights in a row. make sure to get a reservation or you may not be seated", "Date": "November 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Gainesville, FL", "Title": "“Wonderful hotel & staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR3811592", "Content": "My two daughters and I were very impressed with this hotel. Our room overlooked the canal and we enjoyed watching the gondolas pass under our window. The staff was very helpful, the location was wonderful and the free internet access in the lobby was a godsend for us to contact hubby back in the states and let him know we were well and having a great time. Would gladly stay here again and highly recommend this hotel.", "Date": "August 28, 2005"}], "HotelInfo": {"Name": "Duodo Palace Hotel", "HotelURL": "/ShowUserReviews-g187870-d278272-Reviews-Duodo_Palace_Hotel-Venice_Veneto.html", "Price": "$178 - $422*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Minelli San Marco 1887</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "278272", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/49/0f/490fd6c51f070a0dcb5d0998fcfebd496large.jpg"}}