{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arkansas City, Kansas", "Title": "“The Yellow Rose”", "Author": "rthirst", "ReviewID": "UR140280558", "Content": "The location is great. The landscape is very nice. Everything is clean and nice. The food was good enough. The only real complaint I have about that is the dining room is very tiny. You may have to wait for you and your family to eat. It is very crowded. You can go outside to eat under the gazebos which are very nice. But there are smokers. I would like to see the smokers have a designated place to smoke. There are two gazebos and there were smokers in both of them. I liked our room. It was very clean. We had a refrigerator, and a microwave. We were given microwave popcorn upon check in which I thought was a nice touch. The one thing I didn't like about our room was the rooms open up from the outside. So if I wanted the curtain open to let the light in people could walk by and look right in our room. I will complain about the sheets. The sheets on our bed was ready for the trash. The sheets were rough, like little balls on them. Every morning when we woke up the fitted sheet had worked itself off the mattress. I do like a higher count sheet that is smooth and cool to the touch. Also elastic in good enough shape so the sheet stays on the bed. If that is not a problem for you then the bed will not be a problem. Other then that it was a great stay. The staff are very friendly.", "Date": "September 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“\"Your Hotel search is over\"”", "Author": "MikeSalaty", "ReviewID": "UR140150063", "Content": "What a fantastic hotel! This place is everything you have been reading about. We stayed here the week of Labor day. After staying here, I wouldn't even consider another hotel in the future. Just book this place! Spend your search effort and time on the shows to watch. Comfortable pillowtop beds, frig and microwave in room, 40\" tv with over 60 cable channels. Very clean room with attention to detail. The A/C unit can be adjusted by degree so you will know the tempurature in the room. Nice quite area only 5-10 minutes from the main area of town. Pool looks nice, but didn't use it. Fantastic breakfast with eggs, biskets and gravy, waffles, 4 cold cereals, oatmeal packets, donuts, white or wheat toast, bagels etc. The staff couldn't be more friendly and helpful. I lost my comb, no problem they will give you a free one at the desk, no need to buy one. Just a nice touch. A welcome kit and leaving packet. Are you kidding me! And all at a reasonable price. I would have to be picky to find flaws in the place. Like the shower head is about 6' up. If your taller you might have to duck down a little to wash your hair. See what I mean, picky. I have spent much more on hotels and havn't been nearly as happy. I booked this place because of all the great reviews on Trip Advisor. We are not wrong. I havn't been this happy with a hotel property in quite a while. Like I said, just book this place.", "Date": "September 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Sioux City, Nebraska", "Title": "“Excellent Place To Stay!!”", "Author": "Mike P", "ReviewID": "UR140122163", "Content": "My wife,daughter,mother& I stayed for 5 days the first week of Sept. We all enjoyed our stay immensely. The rooms were very clean as well as the entire hotel. The beds were extremely comfortable & all the amenities were great! Location is good as it is not on the busy highway so it's nice & quiet but yet close enough to the places you want to go. Breakfast was very good & all the staff we met were extremely friendly & accommodating. Only complaint was the door to the rooms were really hard to open & close but I suspect it was probably due to the extreme heat & humidity. Overall it is a great place to stay & we would definitely stay again & recommend anyone else to stay their as well. Thanks again to the friendly staff for making our stay so enjoyable!!!!", "Date": "September 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Port Richey, Florida", "Title": "“Good Times”", "Author": "greco30", "ReviewID": "UR140078580", "Content": "I never had a better time anywhere I have gone on vacation. The owner and workers were friendly as if we were family. The rooms are clean and beautiful and include a microwave oven and a refridgerator and wi-fi. It is about one mile off the main strip. If you plan a trip to Branson you will enhance your vacation experience by staying at the Yellow Rose Inn. Tony New Port Richey, Fl.", "Date": "September 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "M", "Title": "“Great Place To Stay!”", "Author": "D R", "ReviewID": "UR139929513", "Content": "My husband and I stayed around two weeks the latter part of Aug to early Sep 2012. We enjoyed this stay very much. The hotel is clean and our room was very nice. Appeared lots of renovations had been done. Breakfast was very good. Location is great! It is not on the busy Hwy 76, but so close and easy to get to places of interest! Our view was so nice. The service was very good; nice, friendly, and helpful people to deal with. We enjoyed it and would love to stay there again.", "Date": "September 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Plainsboro, New Jersey", "Title": "“Slept like a baby!”", "Author": "rescue2823", "ReviewID": "UR139836673", "Content": "This place is great. The reviews on here speak the truth. They staff was very accommodating to our situation. The beds are soft and clean. The fridge and microwave was an added suprise. Do not let the price scare you away you will not be upset", "Date": "September 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sallisaw, Oklahoma", "Title": "“Clean, well kept, affordable, and quiet hotel worth repeat stays”", "Author": "Tripcg", "ReviewID": "UR139684098", "Content": "Booked this based on reviews. Does not disappoint. If you want a clean and well maintained place to stay in Branson, I highly recommend. If you are looking for a five star hotel, keep looking. This is not luxury. But don't let that fool you. Did I mention clean? My number one priority. Also a very comfortable bed, good water pressure, plenty of towels, solid wi-fi, big TV, nice pool, friendly employees... Frankly, I would stay here again. We like to come to Branson to shop annually and will likely stay here again as long as the rates stay reasonable. I certainly recommend this hotel. The only reason the room did not get a 5 was that there is no closet. Picky reason, I know, and an issue that would not prevent me from staying again gladly! But I just couldn't give a five. Now I feel guilty because I really do like this place. My favorite in Branson so far.", "Date": "September 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great spot.”", "Author": "Terryryan", "ReviewID": "UR139616696", "Content": "Very conveniently located. Efficient staff, CLEAN, nice room. We had a single king, poolside. Room was a little on the small side, but absolutely nothing wrong with it at all. We would definitely stay here again. Everything was perfectly in place, and had all the amenities. Nice looking pool(we have yet to get in it.). Very satisfied. Would highly recommend this to anyone.", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benton, Missouri", "Title": "“Nice and quiet”", "Author": "61tammyh", "ReviewID": "UR139488115", "Content": "This is the second time my son and I stayed at this hotel. It is one of the cleanest hotels we've stayed at and the staff is great! The price is awesome and the area is quiet and away from the main hub traffic. The pool area is clean and has lots of gathering spots around it. Definitely recommend to anyone.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Choctaw, Oklahoma", "Title": "“Awesome! Nice and quiet!”", "Author": "hopkinsh1978", "ReviewID": "UR139440446", "Content": "My family and I stayed here over the Labor day weekend, loved it!! Nice, clean, and quiet! Cheaper than other hotels and twice as nice! Extremely convenient! The beds were extemely comfortable, slept like a rock... We will be staying here from now on!", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "st joseph mo", "Title": "“a hidden jewel”", "Author": "guynstjo", "ReviewID": "UR139422284", "Content": "this was our second time to stay here and we are coming back over the thanksgiving weekend.the rooms are very-very clean and the front desk staff are all so kind and helpful on how to find places.the morning breakfast is good and hot--good variety--nice girls with a good morning welcome.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska, United States", "Title": "“Military Viet Nam vets get together”", "Author": "Mark D", "ReviewID": "UR139409818", "Content": "We had a room with 2 queen beds, everything was great. All the staff was pleasant and helpful, rooms and pool were clean. We stayed there the year before and it all was the same. I'm sure we will all vote to stay there next year again. Very nice place to stay, and will stay there again on our next trip.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Union City, TN", "Title": "“Quiet and Clean”", "Author": "n2scrapping", "ReviewID": "UR139314038", "Content": "Nice quiet place off the strip. Easy access to all shows and restaurants. Room was clean, nice carpet and our suite had a nice couch. Bathroom little small. Good variety on free breakfast. This property is well maintained but the greatest feature is the staff! They are simply the best. They went out of their way to help us get great bargains on shows and to choose shows that appealed to us. Tickets were delivered to our hotel which made it super easy. Nice welcome gift and a departure gift. The breakfast was a nice variety including the every popular waffle irons. The eating area is crowded but there are two outdoor gazebos for overflow. The staff in the breakfast area was helpful and very friendly. All of the staff especially the front desk made a terrific impression on us.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "midwest", "Title": "“Not what I expected”", "Author": "worldtraveler10057", "ReviewID": "UR139313364", "Content": "After reading the reviews I expected much more than we received. We stayed in a king suite and the only thing that separated this room from others was the fact it had a love seat. The bathroom was about 4ft by 6ft including the stool and shower. The sheets felt worn and breakfast was not what I expected either. There were no healthy choices for breakfast expect tropical fruit. After the first day I did not eat it. The door to the room opened directly to the outside and cool air escaped and let in warm air every time the door opened. We were also awakened by people locking and unlocking their cars. There must be better places to stay in Branson.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texarkana, Texas", "Title": "“A Great Stay”", "Author": "Becky R", "ReviewID": "UR139211277", "Content": "What a surprise! We stay in Branson several times a year but had never seen the Yellow Rose. Decided to try it after reading the reviews here on Trip Advisor and am so glad we did. Room was spotless and looked new. Fridge and microwave - spotless (and appreciated). The front desk clerks were very welcoming (loved the gift bags and departing gift). We will definitely make this our Branson place to stay.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harrison, Arkansas", "Title": "“Dont miss this place!”", "Author": "paris694", "ReviewID": "UR139025492", "Content": "If you want a quiet, clean, comfortable place to stay this is it. The free breakfast is wonderful and they are expanding the eating area during the off-season. There are several nice touches such as the gift bag when you check-in and large fluffy beach towels for use at the sparkling clean pool. There are even water toys for the kids! The fact that the owner truly cares about this property is very evident in so many ways they are hard to list! We have stayed here twice and will continue to return. The staff is the best we have ever seen, not only in friendliness...but in their professionalism. Just not enough room here to sing the praises of the Branson Yellow Rose! :)", "Date": "August 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Butler, Missouri", "Title": "“Gets Consistently High Marks”", "Author": "Gay B", "ReviewID": "UR138711519", "Content": "All is consistently good at The Yellow Rose. The staff is hospitable, the rooms are very clean and the breakfast is good. The pool is clean and clear. The hotel is maintained well. All expectations exceeded!", "Date": "August 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Great Motel!”", "Author": "kdmac48", "ReviewID": "UR138700923", "Content": "This motel was EXTREMELY clean and comfortable. The rooms very tastefully decorated and beds very comfortable. The staff was very friendly and helpful! Breakfast was great, although the biscuits were terrible and many people didn't like them, the gravy was FABULOUS! Overall, our stay was wonderful and well worth the price.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Family vacation”", "Author": "Jeff Z", "ReviewID": "UR138608721", "Content": "Overall a great place to stay at a very reasonable price. Nice comfortable beds. Friendly and helpful staff with getting you tickets for shows and attractions. The complimentary hot breakfast is a bonus! Eggs, waffles, biscuits and gravy, donuts, bagels, cereal. Big money saver for a family and the lady that runs the dining area is super awesome and friendly! Pool area was nice too. Tables with big umbrellas plus a couple of gazebos with shade for relaxing.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Great Place to Stay”", "Author": "OklahomaMissy", "ReviewID": "UR138596397", "Content": "I've been going to Branson for almost 30 years, and this is my first time to stay at the Yellow Rose....actually didn't even know it was there. I decided since I've been using Trip Advisor to check out what it had to say about the hotels there and I found this gem! A gentlemen named Keith checked us in, he was very considerate and friendly. The place had very comfortable beds, room was immaculate, and we slept very well as it was very quiet. Will definitely choose this place again.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "lacygne kansas", "Title": "“three day stay”", "Author": "archie i", "ReviewID": "UR138368126", "Content": "my stay was pleasant great beds and service was good. They were very helpfull in getting tickets to local shows. The pool was very good but a little to cool for me. vending machine worked and ice machine was good.", "Date": "August 25, 2012"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Topeka, Kansas", "Title": "“Already Impressed”", "Author": "firewifeks", "ReviewID": "UR138272044", "Content": "I have just booked a King Suite for our 5th anniversary at the end of Sept. based on the reviews, and am already impressed. I called the hotel directly to book and the gentleman I spoke with could not have been more helpful, well-spoken and gracious. I am really looking forward to getting to stay here and enjoying our first trip to Branson.", "Date": "August 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "KC", "Title": "“Will return”", "Author": "2caclown", "ReviewID": "UR138051040", "Content": "Enjoyed our stay at the Yellow Rose. Quiet, great beds, enjoyed every bite of breakfast. We made reservations for 3 nites using coupons from MO Visitors Center. Due to a family emergency we had to leave a day early. Lady behind desk was compassionate and we had no hassles. She gave us a complete refund for the third nite and wished us well with our travels. We will recommend this to friends and will return another time.", "Date": "August 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Impressed”", "Author": "hpeachee", "ReviewID": "UR138028311", "Content": "We stayed at Yellow Rose this past Thursday night as an added night to our original vacation plans at another resort. We chose Yellow Rose based on the reviews off of Tripadvisor and we were not disappointed! The rooms are small but very clean and the beds were super comfy! The continental breakfast was typical but the employees were very friendly and helpful. We will definitely stay again soon!", "Date": "August 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“very nice staff and very reasonable rates”", "Author": "Rosemarie D", "ReviewID": "UR137926920", "Content": "This is our 2nd time here. It was even nicer than the 1st time in July 2009. We went at the end of July this year for 4 days. Good location. Staff friendly, room clean, nice clean pool, very nice breakfasts, gift bag on arrival and thank you gift at departure were very nice incentives. Will definitely come back here again!", "Date": "August 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Missouri, United States", "Title": "“Would stay again!”", "Author": "Mailgirl618", "ReviewID": "UR137838080", "Content": "We stayed here because it was rated #1 on TripAdvisor. While not a fancy hotel, it was very clean and neat. You could tell it had been updated recently. The grounds were clean and the building freshly painted. The staff was very friendly. The pool and the surrounding area were well taken care of. The carpet in the room looked new. I had no problem walking barefoot on it. The beds were soft and the comforters also looked new. It had a fridge, microwave, and a large flat screen t.v. The bathroom was very clean, even in the corners(it always amazes me how hotels very rarely clean the corners). The only complaint(very minor) I had about the room was the ironing board is located in the bathroom. This hotel is located a little ways from the 76 strip, which might be a problem for people wanting to walk places. I didn't mind because it meant no road noise. They did provide a complementary breakfast, not the best I've had, but again no complaints because it was free. The eating area was small, but again very clean and neat. I would recommend this hotel!", "Date": "August 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford, Arkansas", "Title": "“Very clean and friendly staff!”", "Author": "Missy M", "ReviewID": "UR137785559", "Content": "My husband and I stayed here for a couple of nights for our anniversary and were very pleased! The staff were friendly and even gave us a gift bag on arrival and chocolates when we left! The room was very clean and the bed was comfortable. Overall, this was a very nice place to stay...especially for the price! We will be staying here again!", "Date": "August 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bethel, Ohio, United States", "Title": "“Great place for being cheap!”", "Author": "Sara M", "ReviewID": "UR137673096", "Content": "So clean! Friendly staff! Nice pool. Great rooms with comfy beds! This place was perfect. The breakfast was great! Gravy and biscuits with scrambled eggs. Even their milk was chilled and delish! :) Not far from main strip at all. Also, the performers from the show, legend of kungfu run up the road right by the inn, pretty cool.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "High Ridge, MO", "Title": "“Very nice!”", "Author": "Dale S", "ReviewID": "UR137614280", "Content": "We (My Mom and Aunt and Uncle) stayed August 13 and 14, 2012, at the Yellow Rose Inn and suites. The rooms were quite nice and very clean. The staff was friendly and very proud that they had just reached #1 status on trip advisor. I was impressed by their desire to remain #1. I believe the staff takes great care to ensure that every guest has a wonderful stay as we did. The area is very quiet, and while its location is not on 'the strip', distances to area attractions are not great. I recommend staying here! Our only thought: really no meat line on the morning buffet (scrambled eggs were great!). Dale S, High Ridge, MO.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa", "Title": "“Absolutely Wonderful!!!”", "Author": "Susan G", "ReviewID": "UR137276042", "Content": "It is a wonderful and very CLEAN hotel! The rooms were very nice and the staff is A++++. The breakfast buffet was really good and it is run by a mom and daughter team. They were really nice people. This is the best place to stay in Branson for the money. Also, the location was great. You felt you were hidden away from all the noise but yet you were so close to everything. I highly recommend this place!!!", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bald Knob, Arkansas", "Title": "“Mini vacation”", "Author": "alanna r", "ReviewID": "UR137171837", "Content": "We have stayed at several motels in Branson and have never been happy. We really liked this hotel. It was so clean and nice! The beds were so comfortable that is very important to me! Everything about this place is great! Thank you very much and I will recommend it to everyone.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Keller, Texas", "Title": "“Great Experience!”", "Author": "terryg56065", "ReviewID": "UR137123441", "Content": "Stayed at the Yellow Rose and had a great experience. Very clean and accommodating. Rooms were very nice and very, very clean. Customer service was great. Thank you Yellow Rose for making my stay in Branson wonderful!", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mayfield, Kentucky", "Title": "“Nice quite location”", "Author": "Eddie F", "ReviewID": "UR137001487", "Content": "If you want a nice quite, off the main drag motel with friendly down home folks and an excellent breakfast, this is the place. There are a few turns and twist to get there, but it is well worth it. The rooms are very clean, the bed was soft, the people are friendly and the free full breakfast (not just a donut and a cup of coffee) was great. We will stay there again when we go back to Branson.", "Date": "August 12, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Central Lake, Michigan, United States", "Title": "“Recent Stay”", "Author": "Pat T", "ReviewID": "UR137000728", "Content": "Our 3 night stay at the Yellow Rose this past week was indeed a pleasure, starting with the friendly staff, goody bag, quiet & convenient location, very clean king room, and excellent breakfast as part of room cost. We wanted to use the pool but never could due to too many people in it when we were there, the only drawback. Would recommend the Yellow Rose to anyone. Visiting Branson.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Alabama, United States", "Title": "“Great place to stay!!”", "Author": "Joan S", "ReviewID": "UR136726861", "Content": "We enjoyed everything about the Yellow Rose Inn, everyone was so welcoming and accomadating during our stay!! The staff was so nice, even when my mother got sick, they were all right there to help!! The rooms were extra clean, and roomy with everything you needed even to an ironing board!! The breakfast bar was wonderful, which even saved you money since you didn't have to go out to eat, and they had about anything you could want for breakfast!!! The rates were very reasonable, and being right off the main strip, it was so quiet, you slept like a baby!! Very good place to stay.", "Date": "August 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Altamonte Springs, Florida", "Title": "“A Very Pleasent and Enjoyable Stay”", "Author": "EagleFl", "ReviewID": "UR136687823", "Content": "We enjoyed everything at Yellow Rose during our stay en route to Kansas City. Considering the staff and all the amenities the Yellow Rose offered it had the feel of a Mom 'n Pop business. It's located in an area away from the main drag which was appreciated. The staff was quite friendly and we received a package of popcorn, shampoo etc. when we checked in. The room was very clean and had very comfortable beds and included a microwave and a small frig. An enjoyable breakfast was included in the package and offered waffles, eggs, biscuit/gravy, excellent coffee and fresh baked donuts. We received a gift of chocolates and a card asking that we share our experience in TripAdvisor!", "Date": "August 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baldwin City, Kansas", "Title": "“Mini vacation w/daughter and her family”", "Author": "larry t", "ReviewID": "UR136483731", "Content": "Had a terrific time in Branson. What makes it so good was the care we received at the Yellow Rose. Had no problem finding it. Grounds clean, all the help were nice and helpful. Rooms were fresh and colorful. Had problems in the past finding a place to stay that wasn't run down after checking in. This place was a gem of a find. Plenty of choices at the breakfast and staff was very helpful. We hadn't left yet and was telling friends back home at Lawrence, ks area that this was the place to stay.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice place to spend the night”", "Author": "MOfunthanworking", "ReviewID": "UR136467248", "Content": "My wife and I stayed a couple of weeks ago. The room was very clean. The bed was awesome. It had a flat screen tv (maybe around 40 inch), fridge and microwave. The microwave did have a bad smell, but we think it from being shut up after being cleaned. Not a big deal. The pool was nice other than the kids splashing around without parents. We were staying during the week so we caught another mid day swim when we were the only ones. I liked the location. Easy to get to from a couple of directions if you have a gps. The easiest way to get in is to turn at Sonic on hwy 165. I'd recommend it for $65 a night in a reg king room. As others have mentioned you get a goody bag (popcorn and sample soaps) when you check in and a small box of chocolates at check out. All employees were very friendly. The breakfast was okay other than the waffles. They were awesome. The lady working made waffles both mornings for my wife and took our plates when we were done eating. We were the only ones in to eat the first morning as we were there not long after 630. Not sure if the weekend would be different as there weren't too many staying during the week.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas city missouri", "Title": "“Hidden Gem - Lots of Perks - GREAT Price”", "Author": "spdblondie", "ReviewID": "UR136425724", "Content": "I listened to the Trip Advisor group and as usual, they delivered! This place was GREAT! Clean, nice layout, wonderful customer service as well. I already knew the breakfast area was small, and it is, but they say they are enlarging it in the future - which will make this place 100% perfect. The two ladies working breakfast were super busy, but friendly. The grounds are spotless, the rooms seem noise proof (except for those that walk past your window talking). We never heard running water from another unit, no creaking floors, no loud parties overhead! I have stayed ALL over the world, and this bed was by far the most comfortable bed I have ever slept in. I wanted to sneak it out with me! So relaxing you won't want to get out of bed, if you like pillow top mattresses. We loved the goody bag when we arrived (extra toiletries & coupons). The small box of chocolates upon checkout was a nice added touch as well. The place is a bit hard to find, even with our GPS. We will be back! Thank you for your hospitality!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ozark, Missouri", "Title": "“Branson Vacation”", "Author": "Lenny C", "ReviewID": "UR136378372", "Content": "My wife and I stayed 3 nights in a king suite and we loved it. The room was very nice and comfortable. All of the employees were very kind and helpful. We will definetly be staying there again very soon. Thanks to all for a very enjoyable stay!!!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Our family loved this hotel, we will be back!”", "Author": "Trwheatley", "ReviewID": "UR136293950", "Content": "We brought family with us, this is the first time we stayed here. We loved it here. It was clean and staff was great. We will definitely come back here to stay. The breakfast was good, the area was clean and staff was very helpful. The breakfast area needs to be larger. The gazebos were also nice.", "Date": "August 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Magnolia, Arkansas", "Title": "“Super clean rooms!”", "Author": "Carol L", "ReviewID": "UR136251775", "Content": "We just returned from a 4 day stay in Branson last week. I choose this hotel because of the reviews I'd read on Trip Advisor. I wasn't disappointed. The rooms were very clean, smelled clean and beds very comfortable. Never heard anyone in the rooms on either side of us. I was really excited to find an affordable hotel and get these qualities for the price. The one minor thing was that there weren't more healthier choices for breakfast. I would have loved to see some yogurt and fresh fruit. It looked as it the fruit came from a can. However, those are just my personal breakfast choices. Would not keep me from staying there again! Got a welcome bag upon arrival and chocolates when we left, which were very nice. I would recommend this hotel to anyone headed to Branson. We will stay there again!", "Date": "August 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winfield, Missouri", "Title": "“Great value for a great place to stay”", "Author": "jensmith23", "ReviewID": "UR136250893", "Content": "Took a chance and tried a non chain hotel and was very pleased!! All of the staff from the front desk to the breakfast dining room were all very friendly! Rooms were very clean and updated. Bed was very comfortable. Pool was great, landscaping very nice. Breakfast was good, waffles made to order, biscuits and gravy, Krispy Kreme donuts, my only suggestion would be maybe some fresh fruit or yogurt for anyone who wants a light breakfast. Definately would recommend this hotel and plan on going back in a few monthes!!", "Date": "August 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Roeselare, Belgium", "Title": "“Goodie bag is a nice touch!”", "Author": "W-Flemish-Traveler", "ReviewID": "UR136162375", "Content": "Immediately at check-in we received a goodie bag with some products and tasty popcorn to use in the microwave in the room. The room was spacious and nicely decorated. The breakfast in the morning was tasty and the ladies serving were very friendly. We enjoyed our stay.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Mo", "Title": "“Don't let the low price fool you - it is a NICE budget hotel!”", "Author": "golfgal65", "ReviewID": "UR136058366", "Content": "I was concern when I booked cause the price was so low...and that normally means the quality will be, too. NOT the case at the Yellow Rose!! This is a budget hotel not upscale, but you can tell that someone really cares about this place. The outdoor hallways are swept clean, the parking lot is clean, the room was super CLEAN, the hotel staff are very nice. We had a large flat screen TV in our room and new bed covering with throw pillows. I would highly recommend this hotel to anyone looking for budget accomidations in Branson.", "Date": "August 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clarkesville, Georgia", "Title": "“Clean, quiet, great price!”", "Author": "rfindley", "ReviewID": "UR135938262", "Content": "We tried this hotel on a recent trip to Branson due to the great reviews on TripAdvisor. We normally go for pricier hotels so that we have a better chance of getting a clean, quiet room. So, given the low price at this hotel, I admit I had my doubts about how good the stay would be... but I'm happy to report that it was a really great experience! The interior of the rooms was great... clean look and smell, clean bathroom, *very* comfortable beds, surprisingly nice bed cover and pillows. And very quiet! We had a room full of teens next door, but didn't hear them at all during our 3-night stay. The loudest sound was the arrival of a tour bus every morning, but that wasn't bad at all. If we are ever in Branson again, we will *definitely* stay here again! My only negative (just personal taste, though) was the free breakfast. I give them credit for good variety of continental and hot breakfast items, and especially that it is included in the already low room price. But it just didn't do much for me. The scrambled eggs were kind of like Jello (too much filler??). Biscuits and gravy were okay, but could be more flavorful. After the first morning, we ate breakfast elsewhere. I do want to give credit to the gal that services the breakfast area though... she was working very hard to keep the place flowing smoothly.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Clair", "Title": "“Best Hotel I've Found”", "Author": "Becky D", "ReviewID": "UR135933288", "Content": "We stayed here on a recommendation and are SO glad we did. We will stay here on all our future Branson visits. The Yellow Rose was the cleanest most friendly hotel I've ever been to and I'm an extremely picky guest! The staff was so friendly and you're greeted with a welcome bag when you check in and a box of chocolates when you check out. The breakfast was nice as well. The eating area was crowded so we just took our food back to our rooms on the trays provided. I'm so glad we found this hotel!! A huge thank you to the staff for working so hard to provide a clean, comfortable stay!!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Our new favorite place to stay in Branson!”", "Author": "zarkstl", "ReviewID": "UR135891290", "Content": "We just completed a 4 day stay at the Yellow Rose and loved it. The entire hotel was very clean and well run. All of the staff was wonderful and went out of their way to make our stay a great experience. The beds were really amazing.......probably the nicest in any hotel we have stayed in. The pool was sparkling clean and just the right temperature. The staff did a fantastic job cleaning our room every day. They also had really nice beach towels at the front desk that you could get for the pool. I found the free breakfast to be very good and thought the girls did a great job considering how busy it was. We also loved the location which was off the busy strip but had easy access to everything. The 40\" flat panel tvs in all rooms were also nice. I think the Yellow Rose is a bargain for what you pay and it will be our hotel of choice when we return to Branson for our next visit!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“A nice place to stay”", "Author": "1966Airstream", "ReviewID": "UR135825426", "Content": "We were very pleased with our stay at the Yellow Rose Inn in Branson, MO. The room was clean and nicely maintained and the rates were reasonable. The staff was very courteous during check in and called the room a few minutes later to be sure we were pleased and to see if there was anything we needed. The hot breakfast served each morning was very good and they seemed to always have plenty on hand. The only negative comment that I have is that the wifi didn't seem to reach my room with enough strength to use. I don't know if it was the hotel's wifi or my wireless device that was the problem, but I could only use the wifi if I walked closer to the office.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Clean but breakfast was a joke”", "Author": "Justanopinion123", "ReviewID": "UR135728210", "Content": "The room was clean however not enough pillows. The problem for us was that on the internet the breakfast area looks awesome. It's advertised to start at 630. We get there to eat at 630 got our plates and got eggs, biscuits and gravy. The eggs were literally sitting in water when we put them on our plate. Went to eat and EVERYTHING we got was COLD. When we said something to the girls they said sorry we got here late and there's a microwave. No thanks. The food is literally warmed in crock pots and was not good. Really disappointing. Will not recommend and will not stay again.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benton, Arkansas", "Title": "“Excellent value”", "Author": "MTapp", "ReviewID": "UR135646726", "Content": "I was very impressed with this inn especially for the price. The rooms and the entire property were very clean and the staff warm and welcoming. The ladies who ran the breakfast were a delight and my children looked forward to breakast every morning. Our requests for small things such as exta towels or a midday change of sheets were quickly and enthusiastically handled. Even though this was a family trip, I had to work a little bit while we were there. I was especially impressed that the wifi connection was quite reliable, fast and easy to connect to. There was even a desk where I could work. My kids loved the large flat screen TV and took full advantage of the pool. The on-site laundry room came in handy with a small child. A little pricey at $1.50 per wash or dry, but the machines were in good working order and the laundry room was super clean. I even had a mishap with a vending machine and maintence was on it within minutes. I always felt that our business and presences was very much appreciated. All the excellent reviews are true! You won't be sorry to book a room here. The Yellow Rose will be our place to stay the next time we visit Branson!", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "texas", "Title": "“Nice Place to Stay”", "Author": "sharintexas", "ReviewID": "UR135643178", "Content": "My family and I spent 2 nights at the Yellow Rose Inn and Suites while we were in Branson. Our rooms were clean, in fact the bathroom almost sparkled! The staff was pleasant and very knowledgeable about the area. The area was quiet, but the main tourist area was very accessible. The breakfast was good with plenty of choices and attentive staff. Would stay there again and recommend it highly.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "lawrence, kansas", "Title": "“Best value we have found in Branson!”", "Author": "charrell", "ReviewID": "UR135539999", "Content": "I can't say enough about this hotel. When we arrived we loved the service at the desk! Then we went into our room and it was clean but smelled of smoke. It is a non-smoking hotel so we called the front desk. Within 5 minutes the manager arrived, validated our complaint, and gave us the key to another room just on the other side of the building. He was very apologetic. The pool was so clean, also! The girls loved it. The bathroom is tiny - so don't expect a lot of room in there. The bed was super comfy and loved the blankets and pillows! The TV is much larger than our's at home and the cable selection was very vast. We will stay here every time we visit Branson. Thanks so much!", "Date": "July 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Duncan, Oklahoma", "Title": "“Clean and comfy with plenty of extra touches.”", "Author": "TravelinMomma580", "ReviewID": "UR135513581", "Content": "We had spent two nights at another hotel in Branson before deciding to give this place a try for our third and final night. This place is off the strip, down a nice, tree lined road, but still very close to all of the attractions. Check in was a breeze. The clerk was very pleasant and friendly, she quickly got us checked in and informed us of the information we needed to know about parking, the pool, breakfast, etc. We enjoyed our welcome bag, which contained samples of various items, such as shampoo and conditioner, deodorant, and popcorn... a nice little extra touch. Our room was extremely clean, the shower shined, and the smell was pleasant and refreshing. The beds were very comfortable, and included more pillows than one might expect to find on a motel bed, making for a great night of sleep. There was a refrigerator and a microwave in the room, we used both and they both worked fine. The tv was nice. We didn't hear any noise from other rooms, but we did hear an occasional stomp of a kid walking by outside, as we were on the pool floor (no biggie, I'm a mom). The pool and pool area was nice and clean, with plenty of room to sit or swim; and instead of regular pool towels, beach towels were available for checkout at the front desk. Breakfast included fruit, donuts, eggs, biscuits and gravy, a bread selection, cereal, waffles (which the staff offered to make for us), and beverages. We enjoyed our breakfast, and were pleased with the service, such as the help that we received clearing our table. Check out was easy, again, the staff was very friendly, and we enjoyed our box of chocolates that we received upon check out... another nice little extra touch. All in all, we had a great stay at the Yellow Rose, and we will likely stay here the next time we visit Branson.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arkansas, United States", "Title": "“Excellent stay”", "Author": "Teresa O", "ReviewID": "UR135496613", "Content": "Always look to fellow reviewers in deciding on a hotel. Was supicious of the low price so was constantly looking for something to be wrong. Was very pleased to be able to say that our stay was excellent. Very clean room and pool area. Even though room was right by the pool, after pool closing time it was very quiet. Breakfast had a great selection of items and everyone was very friendly. Would definitely stay again.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oak Grove, Missouri", "Title": "“SHH - BEST KEPT SECRET IN BRANSON”", "Author": "cjjohnson4", "ReviewID": "UR135490272", "Content": "I almost hate to let this secret out. If you have never stayed at the Branson Yellow Rose, one stay and you will keep coming back. It is not a luxury hotel but always VERY CLEAN, QUIET AND COMFORTABLE. Off the strip it is still conveniently located. Newer beds which are Very Comfortable. Nice pool close to rooms. Very reasonably priced. Best deal in Branson.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cozy, quiet and very friendly. Starting your day with these folks will put a smile on your face .”", "Author": "Toledobenders", "ReviewID": "UR135389624", "Content": "Read many reviews before settling on the Yellow Rose. good choice, will stay here again. Everyone very friendly and the room was super comfy. We liked being off the strip. Atmosphere here felt like \"family \". Great value .", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "campbell hill", "Title": "“Branson Yellow Rose Inn & Suites”", "Author": "ctl2", "ReviewID": "UR135387723", "Content": "Attractively decortated and comfortable room. Super clean! Well kept pool and grounds. Lots of ammenities. Large assortment of very tasty breakfast items. Every staff member was extremely friendly, helpful, and made us feel at home.", "Date": "July 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "western PA", "Title": "“Nice for the price”", "Author": "Commodore1", "ReviewID": "UR135383489", "Content": "This owner apparently cares and takes pride in their property. We stayed one night - June 26th, 2012. I was not disappointed in the reviews. Bed was comfy, room was clean and A/C worked well. Room was a tiny bit small, but we weren't in the room that much. Enjoyed the pool area, and the flowers. We found the location to be ideal as its close enough, but tucked back in a residential area so its very quiet. Appreciated the little gift bags on welcome and exit. My chief complaint ( and that morning I was STEAMING MAD) would be the kitchen staff for breakfast. Although they were pleasant, they were extremely disorganized and arrived at work late. If you advertise opening at 6 am, then you should be ready to open at 6 am..not just arriving!! We literally had to stand at the door and wait on them to open it after watching a woman arrive at 6am. When we were finally let in..we were told we could at least get coffee ( nope..it wasnt done yet). I was told it had recently changed from 6:30 am. Sorry..no excuse ! They were worrying about doing things that could wait until last ( not prioritizing well)..and didnt turn on the gravy which clearly takes a long time to warm up when there is so much in the warmer. Its not sausage gravy ( no sausage)..its country gravy. My donut was stale...hard as a rock. By the time we left the room was full of people ALL waiting on something to eat! I think the breakfast area would be fine if it was organized better in layout and the staff were more organized. Sorry..but i think your Mom /daughter duo are hoodwinking you. They are friendly, but that is all I can find nice to say. We would come back, but just not plan on having any breakfast there. Before you spend a lot of money enlarging..you should try reorganizing the room..staff included.", "Date": "July 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Grove, Oklahoma", "Title": "“Love this hotel & will b back!!”", "Author": "loveitorleaveit_76", "ReviewID": "UR135368503", "Content": "The room was really clean & beds were very comfortable. Nice big flat screen tv. Friendly staff. Even called to make sure room was ok. Nice quiet location off strip, was a little hard to find tho. Breakfast was great.! Excellent price. Will return.", "Date": "July 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful experience!”", "Author": "Jwkajohnson", "ReviewID": "UR135325450", "Content": "Very friendly staff, clean rooms, and off the beaten path but very accessible to everything. We was able to do everything we wanted because it was located in a central location. Thanks for the wonderful stay.", "Date": "July 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "McPherson, Kansas", "Title": "“Awesome place to stay!”", "Author": "bishop35", "ReviewID": "UR135258067", "Content": "We just returned from Branson and stayed three nights at the Branson Yellow Rose Inn and Suites. The location is great, away from all of the traffic and crowds. Everything looked very clean and new. The beds were very comfortable and actually missed the bed after I got home. Great shower, beautiful flat screen TV, small refrigerator, microwave, etc. We were always greeted with a smile and the welcome and departing gifts were very thoughtful. The breakfast area is small and I know that they are in the process of fixing that problem. The food was good but not fantastic. For the price and value I didnt expect the breakfast to be anything more than what it was. They had a great variety and we only waited a short time to get in. We will be returning to Branson in August and plan on staying here again.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Would definitely stay again”", "Author": "Sarie98", "ReviewID": "UR135203659", "Content": "Right off the strip but not on top of it. Room was very, very clean. Bed was super comfy and the pillows too. Flat screen TV was very nice. Pool was nice size and clean. I really can't say anything negative about this place...besides maybe some meat at the FREE breakfast (sausage or bacon please!). I would definitely stay here again if we decide to visit Branson again!", "Date": "July 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Altus, Oklahoma, United States", "Title": "“Had a great time!”", "Author": "Ricky B", "ReviewID": "UR135154446", "Content": "Very friendly staff and clean motel. The front desk helped us find good deals with our stay in Branson. We were pleased with our stay.", "Date": "July 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“These people treat people like royalty!”", "Author": "Xlucky7mx", "ReviewID": "UR135112978", "Content": "I went out to eat and Leasure 2 times a day in my 4 day stay in Branson this time and the only time I was treated like anybody cared about me and my family personally was when I was at the motel especially at breakfast time the rest of the time I was away from the motel all of the other people working at the restaurants resorts and showes took for granted that they have an unlimited supply of customers bringing them in money. Not at the yellow rise inn. It does not have the best view and is not on the strip but when we go to Branson we will stay no where else!", "Date": "July 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kelly, Louisiana, United States", "Title": "“Family Vacation”", "Author": "Tracey R", "ReviewID": "UR135024331", "Content": "First time to stay in this hotel. Very clean. Rooms were very quiet with no noise. Only complaint was the breakfast area was very small and crowded. We stayed four nights and only ate breakfast there one time. Food was good. Just need a bigger area to accommodate guests. Would stay here again though.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“LIVED UP TO IT'S REVIEWS”", "Author": "trapper-jj", "ReviewID": "UR135022974", "Content": "Can't say enough about the Yellow Rose even though room appeared a little dated. We have never seen a room so clean, even the bathroom. When we checked in we couldn't have felt more welcome. We even received a \"welcome bag\" (which was a nice surprise). The entire staff were all very pleasant, didn't see one person without a smile on their face. Loved the refrigerator in the room, which helped out because we had meds that needed to be kept cool. The microwave was nice to have in the room and the large TV had a great picture. Loved how the motel is situated and tucked away off the main drag, where it is quiet, but not too far away from anything. Didn't take long to get to the shopping or a place to eat. Breakfast was crowded sometimes, but good and I see that they are going to expand the area during the off season. We would not hesitate to stay here again. Thanks for making our stay very relaxing.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cheap and cheerful!”", "Author": "Djknightga", "ReviewID": "UR135020389", "Content": "Great value. Typical motel but very well maintained and clean. All the amenities one could need. Would stay here again. The staff is very helpful and the breakfast is great!", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballwin, Missouri", "Title": "“Great Place to stay”", "Author": "Linda K", "ReviewID": "UR134997656", "Content": "This is a nice place to stay. The rooms are clean and bright. Love the fridge and microwave and the new TV. The air conditioning was not very good in our room but when we got back to our room they had replaced the unit. Thats service! We had two rooms overlooking the pool and the grandchildren enjoyed the pool. The breakfast was very good with plenty to choose from. The staff was friendly and helpful. We would defintely recommend this to anyone coming to Branson.", "Date": "July 21, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Celina, Ohio", "Title": "“Fantastic”", "Author": "Samantha M", "ReviewID": "UR134984588", "Content": "It was well worth the stay the beds were comfy and the employees where all very friendly! The rooms were very clean. Definitely will stay here again!", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Great Stay”", "Author": "ArkansasRev", "ReviewID": "UR134976102", "Content": "Very comfortable and well maintained. All the staff were extremely helpful and friendly. We would definitely stay there again.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benton City, MO", "Title": "“Great place to stay”", "Author": "Jason B", "ReviewID": "UR134947232", "Content": "Motel is in a very quiet setting, nice rooms, and loved the mircrowave and fridge in the room. The motel staff was very friendly, and helpful. Will stay here again when in Brason. One small complaint is that is was 100+ degrees the four days we were there, and the pool was only open from 10am to 10pm. When you get back for a show at 9:30 or 10pm and it is still 90 degrees it would have been nice to use the pool. Overall this was a great place to stay.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NORTH MISSISSIPPI", "Title": "“Great stay at a great price.”", "Author": "KANDKEVANS", "ReviewID": "UR134870709", "Content": "For the money, you can't beat this hotel. Clean and comfortable. Great beds and a flat screen TV. It's off the main strip which is a good thing. Free breakfast is good and plentiful. The pool is a good size and sparkling clean. I highly recommend the Yellow Rose!", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spartanburg, South Carolina", "Title": "“Great hotel and great location”", "Author": "Marybeth128", "ReviewID": "UR134809625", "Content": "This was our first trip to Branson and we found this hotel on Trip Advisor. We compared the reviews with other hotels in the area and settled on the Yellow Rose. We made the right decision! We were able to check in early. The front desk staff were friendly, helpful with our questions and gave us a welcome gift bag.The room was clean and well appointed. I appreciated having a refrigerator and microwave as we did use them during our stay. It was quiet and the surrounding area beautiful. I liked the fact that we were close to the main drag yet far enough away as not to be right in the middle of all of the traffic.There was a good selection for breakfast, but not for those who need healthier choices. The breakfast room is small, but there is an outdoor area to use during busier times. We will definitely be back to the Yellow Rose and will highly recomend it to friends and family!", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hinton, West Virginia", "Title": "“RAT RACE BREAKFAST...”", "Author": "Tarusbull", "ReviewID": "UR134665713", "Content": "Wow, stayed here for 4 days and the breakfast room was a\" riot in motion\". To small for the size of the number of hotel guests staying there, bossy employees working there don't help, they make it worse. I don't have the answer, but, be careful when going there for food! The pool wasn't maintained as should have been and the water was unfit for swimning, so, the health dept. shut it down and we couldn't use it. They tested the water and did their best to shock it back to safe conditions, but, we gave up on it after 1630. The location is very nice, alittle hard to find at first, but, the setting around the hotel, makes up for the weaken other amenities. The bathroom was small, but, had the proper equipment,so, that's all that matters. Also, the cost was very resonable. The staff was very friendly and always smiling, except the breakfast room workers and I guess under those conditions, I would not have been to friendly either? would drive me to drinking! The pool and dining room reduced my rating down to a 3, I could have easily given a 4 without those problems.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wasaga Beach, Canada", "Title": "“A wonderful quiet place to stay!”", "Author": "BarbLH", "ReviewID": "UR134654532", "Content": "This was our first stay at the Yellow Rose, but it won't be our last. The front desk staff was friendly, checked us in early, and arranged for show tickets to be delivered to the hotel. The room was great, clean and everything was working properly. It was nice to have the sink outside the toilet/tub room. As others have mentioned, the breakfast area was small, but there was a lot of choices available, along with friendly staff. The location was about 2 miles from the 'strip' area, so it was perfect. We'll be recommending the Yellow Rose to anyone else visiting Branson.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Council Grove, Kansas", "Title": "“Friendly staff!!”", "Author": "Becky J", "ReviewID": "UR134528889", "Content": "Loved the location of the hotel. Off the beaten path! Beautiful setting. The front desk staff is more than awesome!! So friendly and helpful. Got a welcome gift at check in and a going away gift when we returned our key cards!! Our room was very clean. But....it was not quiet. It was right by the stairs so we heard everyone stomping up and down them all hours of the day and night. Plus the maids supplies were right behind our room. Very noisey!! Im sure if you got a room in a diffferent location it would be much quieter. The pool was very nice and clean. Shower temperature did fluctuate and the toilet ran for awhile after flushing, but no big deal. We will stay here again,,,just in a different part of the hotel. Beds were very comfortable too!!", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ottawa, Kansas", "Title": "“A very nice family friendly place.”", "Author": "FamilyTraveler66067", "ReviewID": "UR134527369", "Content": "Clean and well maintained. friendly and helpful staff. Good hot continental breakfast (although the room is small and can get congested), there is nice outside dining available. A little off of the beaten path but easy to get to. Beacause it is a little bit off of the \"strip\" it is quiet and peaceful. Easy access from the back way via Fall River Road.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Olathe, Kansas, United States", "Title": "“Well managed by people who care”", "Author": "Kenton H", "ReviewID": "UR134465886", "Content": "We were very impressed with the management and care give to the details at this hotel. It is a great value.", "Date": "July 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice motel”", "Author": "fsark", "ReviewID": "UR134431408", "Content": "Everything about this motel was very nice. The only complaint was the breakfast and breakfast area. It wasn't very good, and the area was very cramped. Other than that, great experience.", "Date": "July 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas", "Title": "“Great Value!”", "Author": "CBKansas", "ReviewID": "UR134327587", "Content": "Great Value for what you get. Beds were super comfortable! Water pressure not that great and went from warm to cool to hot, but really expect that with such a busy tourist town like Branson. Pool was great just the right size for our child to enjoy. Breakfast was great just be prepared for it to be crowed, way to crowded. They really need to add on more space to seat, it is really cramped outside and inside. While you are trying to get your food you spend a lot of time trying to get through the busy mess of people. Room was clean just need to remember to check under bed skirt when they clean found random trash under it :( But overall great. would stay again in a heart beat. LOVE they are off the main road but not to far :)", "Date": "July 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Nice place- Great price!”", "Author": "Tikiboo100", "ReviewID": "UR134300805", "Content": "Our family stayed at this property last weekend and loved it! Although it was a bit hard to find at first, our vacation was great! It kind of looks like a Motel 6 from the outside; however, the rooms are very nicely decorated with very comfortable beds. I would highly recommend this property to people looking for a nice, affordable property with Free Breakfast! It is not too far from the strip either! All the staff were accomodating and genuinely nice. This hotel gets 2 thumbs up!", "Date": "July 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mangham, Louisiana", "Title": "“Great little hotel”", "Author": "AmiD911", "ReviewID": "UR134241692", "Content": "Stayed at the Yellow Rose the week of July 2nd. The room was very clean and comfortable (great beds!) and the front desk staff was friendly and helpful. We requested a pool side room, which turned out to be kind of noisy each evening, but that was to be expected. What surprised us, was that it was cleared out and quiet every night by 10 - never had a problem with noise at night. The pool was also a great place to watch fireworks from on the 4th. Close to the strip, but not right on it. Our stay was perfect, we'll definitely be back!", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Excellent”", "Author": "omadave64", "ReviewID": "UR134228088", "Content": "Off the beaten path, but nor that far. Excellent service by hotel staff. Clean, neat well maintained. The pool is also fantastic.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Claremore, Oklahoma, United States", "Title": "“For the money, it was perfect.”", "Author": "Jeff-Susan H", "ReviewID": "UR134152682", "Content": "Off the strip but not too far that its a long drive back each night. The interiors have been updated and our unit was very clean. New furniture, beds (very comfy), flat panel tv's, fridge and micro, etc. Staff was friendly, Pool was fine as well. Cant comment on the complimentary breakfast as we never get up that early. This is an old school hotel, outside corridors, stairs, (new elevator available), but its well kept. We were a bit worried but #2 on the list of all hotels?? It was a perfect fit for the price paid. Its not the Hilton, those are $200 plus rooms, but its not the \"2 for $30\" never been updated '70's hotel on the original strip. Overall, very happy.", "Date": "July 11, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southwest Missouri", "Title": "“One of My Favorites”", "Author": "Rye A", "ReviewID": "UR134064895", "Content": "I've stayed in many hotels in Branson, and this was one of my favorites. The staff was VERY friendly and the entire property was charming and well-maintained. Plus, you'll be hard pressed to find a better price.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City, KS", "Title": "“Pleasantly surprised!”", "Author": "MollyMKansasCity_KS", "ReviewID": "UR134058849", "Content": "Staff was very friendly, the mother/daughter team at breakfast gave excellent service and were fun to be around. Rooms very clean. Beds very comfy. Great value! We would definitely stay again!", "Date": "July 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Horrible Stay, won't be listening to these reviews again!”", "Author": "tristin f", "ReviewID": "UR134046641", "Content": "My husband and I read all these glowing reviews for the hotel, so since our normal one was booked over the weekend we decided we'd give it a try, It had great reviews so we thought it would be a great place to stay. Boy were we wrong! The only thing I can say that was good about our stay was the bed, it was very comfy. Let's start with the negative, the floor in the bathroom was full of hair when we checked in so I had to clean that up, which was kinda gross, there was a skunk smell in the room, we smelled it everyday, air freshener didn't help it, there must have been a skunk that lived outside the room somewhere. The wifi was just horrible, we couldn't get it to connect at all, I even called the front desk and they couldn't help nor move us to another room. The room furnishings weren't good either aside from the bed, their was a loan old chair in the room that had to be 20 plus years old, there was a desk chair that would have been comfy I suppose had it not been so worn down, just not good. Now let's talk about the pool, it was horrible, very very dirty, it needed a major scrub down, somebody needed to get the net in it and get the dead bugs out and other things floating in the water out. The water was beyond murky, so it defiantly wasn't something we could enjoy. This was our worst trip to branson in a long long time, we'll never stay here again and I'd recommend thinking strongly about it before you decide to book it. I called the front desk numerous times and nothing was done.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "enid", "Title": "“Awesome Stay!!!”", "Author": "mcbethie", "ReviewID": "UR133884744", "Content": "Stayed At the Yellow Rose after sister recommended it. Normally stay at Comfort Inns, but this little hide away was perfect. Close to all the attractions but off the busy noisey HWY 76.. Pillowtop Mattresses, just like comfort of home. Clean room, very inviting and large nice tv. AC worked great in the July heat. Couldn't have wanted for anything else. Nice laundry room with 2 washers and 2 dryers and pool. Didn't have time for pool, but it looked inviting. Breakfast good, but somewhat cramped for space. My pick for Branson for a super comfy, quiet, and clean stay that lets you keep a little extra cash to do more....Even got a box of Chocolates when we checked out!!!", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Parker, Colorado, USA", "Title": "“Great experience!”", "Author": "Karen K", "ReviewID": "UR133878987", "Content": "We liked the Yellow Rose as it was a little out of the way, but still close to all shows, etc. There were good alternate routes to the downtown & show venues. Breakfast room was great and well organized. The guest laundry area was also clean and neat. We would definitely stay there again", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Winterset, Iowa", "Title": "“Nice, inexpensive motel”", "Author": "slssls250", "ReviewID": "UR133856277", "Content": "Stayed here over 4th of July week. Nice motel, away from the main drag. Traffic in Branson is crazy anyway & it was terribly hot that week. We had a room on ground level, right next to the pool. Had to pay $10 extra for this room, but was worth it. The kids loved the pool. Not a really big pool, but very well kept. Our room was a non smoking 2 Queen room. All rooms have a fridge & micro, which is a nice extra & a nice big flat screen tv with lots of channels. The room was very clean, even though this is an older motel. Looks like renovations were done not that long ago. The only complaint about the room would be the bathroom. The sink is outside the toilet/shower area, so therefore the toilet/shower area is very, very small. We tried the free breakfast on the first 2 days, but decided to go somewhere else for breakfast the rest of our stay. The breakfast area is way too small & crowded. Could have went outside to the gazebo but that is where people went to smoke(yuck!) The food they had at the breakfast could be a little better. There was no fresh fruit(just a banana would have been nice) & there was not yogurt, etc. The waffles were rubbery, but my husband said the biscuits & gravy were good. One more issue. We had a nonsmoking room, but every morning & some afternoons, people would sit outiside by the pool(outside of gate) & smoke. The smoke would come through the vents in the air conditioning & stink up our room. Not the motels fault though. If we come back to Branson in the future, would definatelty have no problem staying here again, especially of the price stays low.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "St Louis, MO", "Title": "“Not sure why highly rated”", "Author": "KgageStLouis", "ReviewID": "UR133856112", "Content": "We stayed here this weekend. The location is off the beaten track and not within walking distance of any Branson attractions. The outside of the building looked very old. The room was poorly decorated (ugly bedspread) but was very clean...new tile floor and tub surround in the bathroom area. The breakfast area was too crowded...not enough room for everyone to eat or stand in line. The food choices were scrambled eggs and all starches - donuts, cereal, waffles. No fresh fruit, no yogurt, no breakfast meat, etc.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful place to stay!!!”", "Author": "Janeaxle", "ReviewID": "UR133727138", "Content": "We love this hotel. This was our second time to stay and was wonderful both times. Very clean and the beds were so comfortable. I would love to know what kind of beds and pillows they have because its the most comfortable bed we have ever slept on. When we got there they gave us a little bag of goodies. My son loved that they put popcorn in there. It had a few personal items in it also. They are a very friendly staff. Its also very quiet at night and there are short cuts on yellow route and all the way to silver dollar city just a couple blocks from hotel. Its in a great location. Bottom line, its a great place to stay and we will definitely go back again.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nevada, Missouri", "Title": "“motel review”", "Author": "Maynard B", "ReviewID": "UR133716207", "Content": "Almost a 5 star. This is a newer motel in a quiet area away from noise and traffic yet near the center of the strip with quick access to 76 and the bypass routes. Everything was very clean and neet, the bed was one of the best we have ever found in a motel, and room had everything needed. There was a light bulb missing but one call and service person had it replaced within 5 minutes. The hot breakfast was excellent however there was not enough seating and there was awaiting line to get in.", "Date": "July 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Humboldt, Tennessee, United States", "Title": "“Great experience!”", "Author": "Sheila W", "ReviewID": "UR133715573", "Content": "My husband, 10 year-old daughter and I stayed here in June in a 2 double-bed room. It is an older hotel but has been completely remodeled. It had real comforters, not the old quilted kind. It was so clean!!!!!! They gave us a welcome package and when we checked out they gave us a small box of chocolate candies. The pool was sparkling clean! The breakfast was great and the price even greater!!!", "Date": "July 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greensboro", "Title": "“Not a typical \"motel\"”", "Author": "ns07", "ReviewID": "UR133705165", "Content": "This place is a great value! We had a group of 4 and stayed for around $65. The rooms were really clean, had all the amenities you could need (iron, ironing board, fridge, microwave, large flat panel TV, etc.) The service was great. When we checked in we were given a \"goodie bag\", which included pop corn, candy, pantene shampoo & conditioner, etc. Again, this isn't much and nothing to get excited about, but for only $65 a night for 4 people, this definitely isn't your motel 6. Really impressed. Again room was clean, A/C worked fine. It was a pleasant stay, and close to everything in Branson. The only reason I don't give it 5 stars is because the breakfast is lackluster. There's Krispy Kreme doughnuts, and then typical continental breakfast foods (generic bagels, english muffins, etc.) There were 2 staff members that prepared waffles for people. Again, this is really awesome for something of this price....however, it is typical motel continental breakfast fare. Would have preferred either a discount in price of stay without breakfast option, or paid a little more for a better breakfast. During check out, they gave us a small box of Russel Stover. Again, nothing too exciting, but a nice touch for something at this price. Highly recommend that anyone stay here. Best value and quality is great!", "Date": "July 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tustin", "Title": "“Clean room at a best value!”", "Author": "DebbieKTustin", "ReviewID": "UR133619172", "Content": "I would have rate this hotel 5 stars except for the bed sheets. Everything else is wonderful! It probably deserves a 4.5 stars. We stayed for 2 nights on 6/24 and 6/25 in a King suite. We were given a welcome package contains shampoo, conditioner, toothpaste, popcorn, and mouthwash. It was a really pleasant gift. Our room has a microwafe, fridge, and sofa. It is a large room and comfy. One of our light bulbsburned out and we called front desk and the guy brought and replaced it right away. We didn't use the pool since our limited time at Branson. The breakfast was awesome. The girls, mother and daughter, who works there is very friendly. They offer to make fresh waffles for everyone. They have biscuits, gravy, eggs, fruit, bagels, toasts, muffin, juice, coffee, cereal, milk, etc. The room is clean, the surroundings are clean, including the trash can outside. My husband was surprised that the hotel is maintained well and clean. It is really pleasant place to stay here. The only caveat is the bed sheet. I don't know what it is, I think our bed is King but the sheet does not fit the bed. Maybe they use a queen size but it looked like a king size. I don't know because of the pillow top or that the sheet has shrunk or what. The sheet didn't fit the mattress. It kept coming off the mattress. I found that its was not comfortable. We came to our room late nightly and didn't feel like to ask and complain. The sheet is also not smooth and silky. I like my sheet taut and smooth. The next day, the maid didn't fit the sheet taut and adjust it either. She kind of just threw the bed cover over it without readjusting the sheets underneath it. Again, I came back late to the hotel and didn't want to make a fuss. It didn't bother my husband much but it bothered me. On the way out, checking out, we were given a small box of Russel Stovers candy. It was a nice gesture. We will probably come back to this hotel next time and I hope they fix the sheet situation.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“No complaints for this Branson gem!”", "Author": "TheresiaMO", "ReviewID": "UR133605724", "Content": "We booked 2 rooms for 3 nights total with AAA discount. Both were by the pool side which was very convenient as we wanted to go swimming in the afternoon and evenings. We received a welcome gift on arrival and chocolates at check out. The room was typical motel size, and the beds were very comfortable. The rooms were exceptionally clean! Each room has a fridge and microwave. Continental breakfast was bagels/breads, eggs, biscuits and gravy, and waffles that the staff would make for you. They offered cut up tropical fruit, and we'd rather have had bananas, apples or oranges, but that is a minor issue. Location is easy access to the strip, and hotel was nice and quiet! All in all a very nice family motel that I highly recommend.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vilonia, Arkansas", "Title": "“Yellow Rose”", "Author": "Karen V", "ReviewID": "UR133546084", "Content": "We thought this an excellent hotel. We have stayed in many others in Branson & this one is the best. It is very clean, the bed is comfortable, the air conditioning is cool & quiet, & the tv is big! They have a nice clean pool. They provide you with large beach towels & have several balls & noodles to play in the water with. The breakfast is very good with a large selection of food & very friendly ladies to assist you. The desk staff is very friendly & helpful, as well. We will certainly stay here again when we are in town & plan to recommend it to others.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wellsville, Kansas, United States", "Title": "“vacation time”", "Author": "Ellen G", "ReviewID": "UR133543628", "Content": "Can't say enough good things about this hotel. The rooms were very clean and nicely decorated and the staff was so friendly and helpful. They give you a nice welcome bag on arrival and a small box of chocolates upon checkout. The breakfast was very good with plenty of variety. If you want a nice place to stay at a very reasonable price then this is the place to stay, you won't be disappointed! We will stay at this hotel every time we visit Branson. Thanks so much to all the staff for making our stay a nice one.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Glencoe, Ok.", "Title": "“Great hotel!!”", "Author": "Jennifer M", "ReviewID": "UR133489669", "Content": "At check-in the person on duty was very nice. He helped me with getting money saving coupons and when I was finished and leaving he ran out and gave me a goody bag. Went to room and it was very nice. One flaw is it could use a coat of paint. The bed was super comfy. Pillow top with fluffy pillows and extra snuggle pillows. The room was quiet even though the motel was full. Slept great!!! Didn't want to get up the next morning just wanted to stay in the super soft bed. Breakfast area was very small and had to go out to gazebo when it was hot. The breakfast although was delicious and the lady working the area was very nice in making us a waffle. The pool area was fun for my family. It was clean and they had play toys for the kids. Wish there were towels at the pool area though. I was told after I was already in the pool that we would have to get them at the front desk. The whole experience was great and I would most definitely be back. We have always stayed at another hotel in Branson but decided based on reviews and price through Priceline that I would try this hotel. Glad I did it was a great hotel!!!", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas", "Title": "“Branson Yellow Rose Inn and Suites”", "Author": "luv2travelKansas", "ReviewID": "UR133438260", "Content": "This was a very nice and clean hotel. We would stay here again. The people are so friendly and go out of their way to help you with all your needs. The breakfast had a huge amount of things to pick from. The location was great. We weren't on the strip but everything we wanted to do was easily accessible. The pool was nice and warm. We would highly recommend staying here.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Clean, comfortable and great customer service!”", "Author": "dannifer", "ReviewID": "UR133257961", "Content": "This was a very nice hotel for the price. The room was clean and the beds were very comfortable! It had a huge flat screen tv. I love the location that is close to everything but still out of the way enough to be secluded. They give very good directions also - just follow the signs. We didn't try the pool but it looked very nice. There was also a beautiful gazebo by it to sit and relax. The breakfast wasn't that great even for the typical hotel but when the rooms are clean and comfortable I can overlook that part. The only issue we had was a billing mistake that the young guy made who took my reservation. He got the date wrong by one night so when we arrived they had already billed us for the night before when we didn't show up and then didn't have our reservation for that night. However, the ladies at the desk handled it perfectly! They got us the exact room we had wanted and took off the charge for the other night. They apologized and I really think it was just a mistake made by a new employee. Since they handled it so well I would have no problem staying there again! I appreciated their professional and friendly attitude! When good customer service seems dead these days, it was a really nice surprise to be treated so well!", "Date": "July 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“We will stay here again!”", "Author": "BetsyLee11", "ReviewID": "UR133213575", "Content": "My husband, kids,and I just got home from our trip to Branson and we were so happy we chose to stay here. We were a bit skeptical about the hotel due to the low costs...we figured it was too good to be true, but went ahead and reserved our room due to the high rating on Tripadvisor. What a GREAT place to stay! So well kept, clean and the staff was so nice and helpful. The pool is bigger than we thought it'd be and we loved how comfortable the beds were. The only negatives were the small dining area for breakfast, but it didn't really matter because everything else this hotel has to offer made up for that. It's the little attention to details that really make an impression and you can tell the staff here strives to be as hospitable as they can. The little welcome goodie bag and chocolates when you leave added to our experience! Great value for this great place to stay and we really look forward to returning in the future.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "KansasCIty", "Title": "“Great place to stay.”", "Author": "HowitzerWife", "ReviewID": "UR133203983", "Content": "We stayed two nights at a GREAT price! Staff was helpful in directing us a different route to the Yellow Rose than our GPS directed us (too avoid the large hill). The location is a few stop lights from \"the strip\". We were greated with a goodie bag and treated to a box of chocolates when we left. The room was clean and the pillow top mattres was soft, the a/c worked really well and the 40' t.v. was nice.Our room was next to the stairs we could hear the foot steps of heavy footed guest and children going/running up and down.There is an elevator to accommodate guest to the 2nd and 3rd floors as well. The breakfast had wonderful choices and the staff was very helpful and even offered to make us a waffle. However the eating area was cramped during breakfast rush.(There is an eating area outside as well.) I'd suggest shortening the bar area to make more room for the tables. There is a pool that we didn't use but the kids there seemed to be enjoying it! We enjoyed our stay Yellow Rose Inn and would stay choose Yellow Rose on our next trip.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Nice Place”", "Author": "OKfam4", "ReviewID": "UR133199360", "Content": "My family of 4 stayed 4 nights overlooking the pool. Check in was fast and impressive. The room was clean, nice and updated with a fridge, microwave and flat screen tv. Beds were soft pillow top just like I prefer. Breakfast was good with friendly service just like the other reviews state. My children enjoyed the pool along with several pool toys belonging to the facility. The A/C unit kept up during the 100+ degree days too! Please accept my criticism as constructive not to detour anyone from staying in the hotel. We enjoyed our stay and would definately stay here again when visiting Branson for a couple of days but I must be honest. My cons: The door (Room 230) hangs up where you have to jerk to open and slam to close (wouldn't be good with a sleeping baby); The toilet handle had to be held down a long time to flush; the water temp in the shower never stayed constant, it fluctuated temp every 30 seconds or so; The maidservice did a good job cleaning every day but didn't make our beds...they pulled the sheet and comforter to the top and set the pillows. I found myself pulling back the bedding to stretch the fitted sheet every night. I even left a $4 tip every day; And last, at check in, we were told the pool closes at 10:00pm but we found that guests used the pool until 11:00. We only had one night where there was a noise problem and that was Saturday night. Again, I want to make clear that these inconveniences were minor where we didn't even complan to the front desk (plus I didn't want anyone working in our room). They were all items I can live with for sixty some bucks a night. If we were at the Hilton, this would not have been acceptable. This one is hard for me to rate. I gave it a 4 compared to other hotels in Branson. I give it a 3 (average) compared to other non-Branson hotels. It's better than Angel Inn, Amazinn Suites, Honeysuckle and even the Radisson.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Joplin, Missouri, United States", "Title": "“Away from it all”", "Author": "Scott W", "ReviewID": "UR133197861", "Content": "Really enjoyed this hotel. Off the main roads, but still close to everything. Our room was very quite and the pool looked nice (to many people in it to go swimming. Overall an excellent hotel for the price", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seminole, Oklahoma, United States", "Title": "“More than just a great bargain!”", "Author": "Tabby R", "ReviewID": "UR133188987", "Content": "Our room was clean, classy, and bed was extremely comfortable. Our free breakfast was probably the best I've had in a real long time, and staff was friendly and helpful. Kudos goes to the management for employees that actually want to be there and show they appreciate your business. Hotel is off the main strip, so it was a quieter area that was just close enough to everything we wanted to do. Not only do I want to stay there again, but I will be recommending this hotel to my family and other friends!", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Great Value for the Money”", "Author": "ChanceMom", "ReviewID": "UR133165443", "Content": "Very clean facility! The staff are all very personable and helpful. The only downfall is the breakfast. The food was good, but a bit overwhelming with carbohydrates! Didn't stop us from eating though! We got a small gift bag when registering and a box of chocolates when leaving! Will definitly be back.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "florida", "Title": "“Excellent stay, great price for the quality!”", "Author": "gordluck", "ReviewID": "UR133137786", "Content": "Wonderful staff, and a very nice room, we were given a gift bag checking in and a small box of chocolates checking out. These folks really appreciate your business.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Arcadia, CA", "Title": "“Great bargain and wonderful staff”", "Author": "SteveLicata", "ReviewID": "UR133133978", "Content": "We stayed here based on previous TripAdvisor ratings and even then were surprised at how pleasant was our 4-night stay. The very clean, well-maintained rooms are well-appointed, with extra cushions, pillows, big flat screen TV and other comforts way beyond what you might expect in the this price range ($60-$85/nt). The hotel is located in a very quiet secluded, woodsy area just a few minutes from \"The Strip\". The included breakfast has everything - waffles, cereal, eggs, -- all served with the help of a very pleasant and attentive staff. In short, this place shows that they really appreciate your business.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pineville, Louisiana", "Title": "“Yellow Rose - Wonderful Experience!”", "Author": "TJ S", "ReviewID": "UR133130025", "Content": "My wife and I stayed at the Yellow Rose for 3 nights, and it was a wonderful stay. A \"gift bag\" and check in, and a parting gift of chocolates - what a pleasant surprise! Clean and fresh rooms, wonderful, friendly staff. Breakfast great each morning - the \"Waffle Queen\" did great. Helpful with tickets for shows - made it a breeze, and saved us money too! So nice to have an elevator to upper floor - many such places don't! When we visit Branson again, and we will, we are definitely staying at the Yellow Rose!", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pollok", "Title": "“Great Vacation Experience”", "Author": "Ann F", "ReviewID": "UR133123017", "Content": "After much research for hotel/motels in the Branson area, my husband and I chose the Yellow Rose Inn. Cleanliness was the most important factor in our decision and I am glad to say we were not disappointed with our choice. The hotel was easy to find and was located off the main strip which made it very quiet. As others mentioned, we also had problems with the sheet coming off the mattress at night. The ladies that prepared breakfast were very friendly and the dining area was very clean. Everything about \"The Yellow Rose Inn\" had a very welcoming, homelike atmosphere. The only thing that would make this hotel better would be to vary the breakfast choices. I took my own pillow and much to my dismay discovered on our way home that I had left it. When I arrived home I had a call that it had been turned in to the office. The front desk offered to ship it to me. Great experience for us and I will be happy to recommend this hotel to others and I will certainly stay again.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Des Plaines, Illinois", "Title": "“Branson Visit - June 25-29, 2012”", "Author": "Howard S", "ReviewID": "UR133109388", "Content": "Basically excellent! Only problem was mix-up with priceline.com that changed 4 nights to 3. Hotel corrected that instantly. Excellent room with two queen beds. Only problem was that my short (4' 7\") mom could not easily get into the bed. They went out the next day and bought a step so she would no longer have a problem. Excellent location just off hwy 165 1 mile south of hwy 76. Excellent value and enjoyed the daily breakfast service. Extremely friendly staff. Certainly will stay here the next time I am in Branson too.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Poplar Bluff, MO", "Title": "“Wonderful Hotel & Great Value”", "Author": "christnme", "ReviewID": "UR133076070", "Content": "Decided to try this hotel after reading other reviews. A little off the beaten path, watch for signs. I was thrilled to find a coupon in travelbuddy for $59.00 a night, which they honored. The front desk was very nice and even gave us a gift bag full of goodies such as popcorn, shampoo, conditioner and more. Got to the room as was very pleased. The beds are amazingly soft pillowtops, the bedding very nice, new carpet, large flat screen t.v., nice size shower and most important...VERY CLEAN!! Breakfast had two very nice ladies attending to your needs....nice touch. It was a good cont. breakfast with eggs, waffels, donuts, biscuits, gravy, fruit, bagels, toast, oatmeal, cerel and a few other items. This hotel is outdoor cooridors (I usually like indoor), but I was able to overlook due to the value!!! There is an outdoor pool, but we didn't try it out. Very nice hotel for the price!! Keep up the good work Yellow Rose Inn and I will continue to give you my business!!", "Date": "June 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Very clean and friendly”", "Author": "Kenneth N", "ReviewID": "UR133071205", "Content": "My wife and I spent 2 nights and found it pleasant. A problem with our reservation was handled as best as it could be. We reserved the room over the internet asking for a roll-in shower and when we got there it wasn't available the first night. I suggest if you need a room with special features you call the hotel just to be sure it is available. I found the king size mattress to soft for my liking but the wife slept well, also like most hotels the sheets never seem to fit properly and the corners would come off at night. On the bright side the staff was great and did their very best to make things right. The rooms are very clean and quiet, we never heard our neighbors. They have a very nice pool that families really love and serve a good breakfast.", "Date": "June 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Oh my God!!!”", "Author": "Guillermhotell", "ReviewID": "UR133008448", "Content": "(sorry for my english) I haved stayed in a several motels in USA. Im a tourist. Ok, when i arrived to Yellow Rose Inn, i almost shocked. Yes, but for very good impresion. The staff very gently. Good people arround. Good neighborhood. So safe. Mi room, so beautifull. So clean. Guest Laundry awesome. I think, i need to pay a couple of twenties most, because relation price-cost is very good. Congratulations! When i back to the city. This location will be mi first choice.", "Date": "June 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paragould, Arkansas", "Title": "“You WON'T be disappointed!”", "Author": "Julie W", "ReviewID": "UR133007524", "Content": "Our family of four (children ages 11 & 14) just spent 6 nights at The Yellow Rose. My husband travels frequently on business and usually has hotel points, so we typically vacation at Marriott or Hilton hotels. After reading so many great TripAdvisor reviews, we decided to give The Yellow Rose a try so that we could work more shows into the budget. We were NOT disappointed! :-) Here's the scoop: This is a motel and not a hotel (doors open to the outside.) It isn't our usual, but I actually enjoyed the change. We upgraded (for a very small fee) to a pool view room, which was also really nice. However, I can see that there would also be convenience perks to being on the parking lot side if you'd be coming and going frequently. The rooms are nicely decorated with comfee beds and nice bedding. The 40 inch flat screen tv, free internet, roomy new fridge, and microwave are just a few of the many convenience items located in the rooms We were equally as pleased with the staff during our stay. Our room was continually well-maintained and cleaning staff always spoke and smiled each time we met them in passing. The front desk staff was also very pleasant and helpful at any time we asked questions. NOW for my favorites. . . the SWEET SWEET ladies who do breakfast can't be beat. They literally make you feel like you're walking into their personal kitchen. . . and that they're thankful you're there. One of them is the \"waffle maker\" (OMGosh- the BEST waffles EVER) and the other can often be found inspecting the scrambled eggs and making sure the tables meet inspection. ;-) This was continually a GREAT way to start off each day of our vacation. And did I mention that the breakfast was complimentary? :) :) :) All in all, this was a GREAT value! Each and every staff member seems to appreciate and take pride in their role as a \"vacation enrichment expert.\" ;-) We have been to Branson 6 or 7 times in the last 14 years and I think we've found our Home Away From Home here at the Yellow Rose Inn. I just hate that we didn't find it sooner and save some serious cash!", "Date": "June 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Olathe Kansas", "Title": "“Would go back”", "Author": "msamylynn96", "ReviewID": "UR133006212", "Content": "We just stayed for 5 nights at the Yellow Rose. We were very pleased with our stay. The staff and cleaning crew were very friendly. The beds were very comfortable. We seemed to have some ill-fitting sheets that didn't seem quite the right size for the pillow top mattress, and they came off once during the night. I think another reviewer also posted of this issue, so not sure if all of the rooms are like this or not. The room was very clean. We reserved a poolside room and it was directly by the pool, which was very convenient. As a frequent visitor to Branson, we loved the location. It was off the busy strip, but close to everything. We had no problem finding the place. I do wish that breakfast included bacon or sausage so there would be a few lower carb options. and the breakfast area needs to be a bit bigger. Also, the deck/gazebo area should be made non-smoking. There seemed to be a lot of smokers standing out in the corridors and on the gazebo. Despite the minor suggestions, the place was absolutely perfect for the price and we would go back without hesitation.", "Date": "June 28, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lynchburg, Virginia", "Title": "“Great value”", "Author": "VADeels", "ReviewID": "UR133005258", "Content": "I put my faith in trip advisor and booked a room because it was such a great price. My husband and I agreed that we had stayed in hotels for twice the money that were not near as nice. Our bed was comfortable and the room was very clean. Front desk staff was helpful in getting us tickets to a show and recommending places to eat. If I were in Branson again, I would definitely stay at the Yellow Rose.", "Date": "June 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ozark, Missouri", "Title": "“What an awesome place!”", "Author": "YFerguson", "ReviewID": "UR132855857", "Content": "First of all, we were very impressed with the friendliness of the check in staff. We were greeted with a smiling face and given a neat little \"goodie\" bag with some nice essentials! Once we entered our room we were very impressed with the cleanliness. The beds were very comfortable and the TV was better than average. The motel was booked for the night, yet it was very quiet. Once we got home and three days later I realized that I had left my iPad in the dresser drawer in our room. I panicked thinking it would never be recovered. I called the motel desk immediately and explained my dilemma thinking it was too late. She took my information and said she would check to see if anyone had turned it in. I was called less than 15 minutes later and told that someone had turned it in to the manager and they had it for safe keeping. I was THRILLED! Most places would not have done that and housekeeping would have most likely kept it for themselves. That was not the case at Yellow Rose Inn and Suites! I would recommend this place to everyone and we are looking forward to our next weekend away in Branson! We will be back!!", "Date": "June 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Unexpected surprise”", "Author": "bw316", "ReviewID": "UR132784869", "Content": "We booked this hotel because it was cheap and had a pool for our 2 kids. This hotel exceeded any expectations I had, from the newly remodeled rooms, to the beautiful flowers around the gazebos. Hot breakfast was actually good, and I looked forward to eating breakfast there. The pool was always clean, and they provided toys for the kids as well. 42 inch tv, multiple wi-fi connections, new mini fridge was a nice touch. And the staff was friendly and put us poolfront as a nice touch. I will stay there again the next time I am in Branson", "Date": "June 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“\"EXCELLENT\"”", "Author": "JMC85", "ReviewID": "UR132738434", "Content": "I have just returned from my trip to Branson. My choice of hotel could not have been better. The beds are so comfortable, the flat screen tv was a nice touch. Everybody from the front desk staff, to the breakfast ladies were extremely pleasant and helpful. The only downside I can think of would be not having a hot tub. It would be nice to be able to soak your tired body after a long day out exploring Branson. My sister, my mom and myself did the zipline at Shepards Hill. We all enjoyed it very much. My mom is 75 and she wants to do it again. Please dont hesitate to stay here, you will be glad you did,.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisiana", "Title": "“Great Place to Stay!”", "Author": "Kinstersmom", "ReviewID": "UR132662006", "Content": "This is a great place to stay! We really enjoyed our stay here, the staff is very friendly and helpful, the rooms are nice, the beds are comfy, the pool was fun and we love the cleaning lady on the 3rd floor. The Sonic at the end of the street was awesome too! :) A+ from me.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Topeka, Kansas", "Title": "“What a delightful discovery!”", "Author": "Rob H", "ReviewID": "UR132549320", "Content": "My family and I have stayed at the Yellow Rose Inn four times in the past two years and it is without a doubt the finest motel we have every visited. The staff - all the staff - were wonderful, from the fellow at the front desk to the restaurant staff to the maids who took care of our room. The management there must set a great \"tone at the top\" to achieve this kind of attitudinal consistency. The extra touches - such as pool toys for the kids -- set it further apart. It is by far the best value in Branson and we look forward to future stays there.", "Date": "June 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Joplin", "Title": "“Clean Room, Nice People, Good Price, Free Breakfast!”", "Author": "Diana M", "ReviewID": "UR132463667", "Content": "This hotel was very nice, clean, smelled great. The people at the check in counter were very friendly and helpful, gave us a nice gift bag, breakfast was nice, with excellent help, personally made us waffles every day. Very good experience and will be going back to this hotel in future.", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stillwater, Oklahoma", "Title": "“Great stay!”", "Author": "scase", "ReviewID": "UR132453187", "Content": "We had a great stay here! The air conditioner works great! The beds were comfy and the room clean! For an older remodeled motel, I don't think you could get much better! Great bargain for what you get!!! :)", "Date": "June 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Clean and very quiet!”", "Author": "Sarah S", "ReviewID": "UR132412480", "Content": "At first I wasn't sure about staying at this hotel especially since it has outdoor corridors. However after reading reviews on Trip Advisor I decided to take a chance. Everyone was right, the rooms were very clean and beds very comfortable. This hotel is off the beaten path and the only thing I did not like was the location of the room because it faced a neighborhood and I wanted to look at the Ozarks. Price is very reasonable and I highly recommend it!!!!", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Extremely clean, quiet, great price and helpful staff!”", "Author": "Patty M", "ReviewID": "UR132407805", "Content": "My husband and I went to Branson for our 43rd wedding anniversary. Thanks to a co-worker telling me about the Yellow Rose, I called them the night before we would be there. Lucky for us they had a room for 3 nights on the weekend and it was the best stay we have ever had in our 43 years. It was so clean. I never sleep with all the noise you hear in motels and hotels, \"this one is so quiet I could not believe it\". We had a room on the 3rd floor in the back away from the pool, ice and elevator, best time we've ever had. The staff is so helpful. When we checked in they offered to help us get discount tickets to the sites we came to see. Best prices ever, no hassle and the tickets were delivered to our motel. Very clean, pillow top beds and so comfortable. Big Tv, Frig and Microwave. Great breakfast and helpful staff. The motel is off the strip but close to all the roads to all the sites. It is nestled in the trees and so peaceful. I hope they always have room for us, it's the only place I want to stay when we go to Branson from now on. I will definitely recommend this one. Patty M.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Augusta, Kansas, United States", "Title": "“Best stay in Branson”", "Author": "Cathy S", "ReviewID": "UR132397090", "Content": "After 2 nites in Missouri we stayed here it was my favorite.The room decor was so inviting we were tired when we arrived.The beds were so comfy plenty of pillows.I like to take baths the tub was nice and large.Just a wonderful goodnights stay this will be my choice each time in Branson.Was so peaceful had a very good feel to this hotel.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belleville", "Title": "“Clean and friendly”", "Author": "Barb C", "ReviewID": "UR132278056", "Content": "My husband and I stayed at the Yellow Rose for a couple of nights because I read good reviews. The staff was so friendly and allowed us to check in early. The room was very clean and nicely decorated. The rates were so reasonable, and even included breakfast. Our family likes to spend time every year in Branson, and when we are all together we stay at Thousand Hills so that we can stay together, however, when my husband and I come alone, we will stay at the Yellow Rose. I also have told the rest of my family about this inn. It was a great find!", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sand Springs, OK", "Title": "“Excellent with changes”", "Author": "Sharon R", "ReviewID": "UR132228218", "Content": "My husband and I had booked a king room. When we got there they put us in the back on the 3rd floor which overlooked a parking lot. I was very disapointed after reading such good reviews. I went back to the desk and asked for another room in the front. I was treated very graciously and after paying $22.00 more dollars (a total of $69 a night) was given a room in the front by the pool. It was well worth the extra money. You could see hills and sunset and it was beautiful. The room was very clean and nice. Room was a little small with the smallest bathroom I have ever seen but looked newly updated with large screen TV. Breakfast was good but very crowded and the 2nd day my husband & I elected to fix a tray and go back to our room. Overall as long as you can get a room in the front of the hotel your stay will be very enjoyable. Pool area is nice and plenty of chairs and nice scenery that overlooks hills. Room was very quiet - you could not hear a thing through the walls. Great!", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hot Springs, Arkansas", "Title": "“Best place to stay for the money”", "Author": "Deidra M", "ReviewID": "UR132164566", "Content": "My family (2 teenagers, husband, and myself) booked a room through Priceline. We have visited Branson often and each time chose a different place to stay. Last year we stayed at a hotel that we all really liked, and intended to stay at again, but this year it was closed due to the tornado from March. So I checked reviews before booking the Yellow Rose. When we arrived for check-in, the hotel room was booked as a King suite instead of the Double Queen. I had my confirmation print out with me showing the booking as a Double. This was not the hotel's fault, but rather Priceline's. The hotel clerk told me that they used to have Booking.com handle online reservations, but now Priceline is handling Booking.com as well. I believe this is where the mix up occurred. Anyway, the clerk made a few adjustments, told me it wasn't the end of the world, and found us a Double Queen. (Keep in mind, the hotel was full of booked doubles.) He called housekeeping to make sure the room we were getting was ready and clean. We had to wait a few minutes, but the room was excellent. In fact, this was the cleanest hotel we have ever stayed in. Housekeeping does a fantastic job. There is breakfast every morning; eggs, donuts, bagels, biscuits and gravy, cereal, and they will cook a massive waffle if you would like. The breakfast room is smallish, but there are two gazebos outside furnished for taking your breakfast outside. We never had a problem finding a place to eat. The staff is very friendly, helpful, and accommodating. There is free wifi, great for my kids' iPod touches and my iPad. There is a small pool outside, the only frown I could find. It isn't heated, so on cooler days/nights my kids wouldn't swim. We normally stay where there is both an indoor and outdoor pool. Yet, despite that, we would stay again. The hotel is away from the main strip, but very accessible to all the roads and main routes. We could quickly get to where we were going (both ends of town). Very quiet area and nice place to take a morning walk/run without a lot of traffic. The beds were comfortable, decor modern, flat screen tv, and one thing we noticed right away was the lack of noise! In most hotels we have stayed in, we could hear noises from other rooms, such as tv or talking.", "Date": "June 17, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Affordable”", "Author": "Lesley J", "ReviewID": "UR132125469", "Content": "My family enjoyed our stay at the Yellow Rose. The kids loved the pool and took full advantage of it daily.One of the staff even gave them fresh warm towels after they where done swimming.I saw the cleaning crew working hard every day and we where pleased with the service.What I liked most was despite the fact that the cleaning crew and ladies in the breakfast area where very busy,they where alway friendly and made me and my family feel welcomed .Keep up the good work!", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Missouri, United States", "Title": "“Enjoyed our Stay”", "Author": "Rob K", "ReviewID": "UR132106186", "Content": "The Yellow Rose has very comfortable beds, a fridge, a microwave, and a 40 inch flat screen tv in each room. We enjoyed our stay alot. The staff was very friendly as well.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great place to stay”", "Author": "Elaine C", "ReviewID": "UR132023979", "Content": "Yellow Rose is an awesome deal for the price. The rooms were very clean, decor was up to date, and the rooms were big. But by far the best part about the place were the people. Everyone there was extremely nice and always willing to help. We were always greeted with a smile! We will stay here every time we go to Branson. It's away from the main strip but close enough where you can get to anywhere in less than 10 minutes.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pryor, Oklahoma", "Title": "“june 9,2012”", "Author": "ok56", "ReviewID": "UR131839305", "Content": "I enjoyed may stay at the Yellow Rose the staff was very helpful and very friendly. The room was very clean and comfortable a very nice Hotel to stay at. I will stay here again. The breakfast was good and feeling the staff was very helpful with your needs.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hannibal, Missouri", "Title": "“Branson Family Trip”", "Author": "Jenny C", "ReviewID": "UR131792363", "Content": "This hotel is the deal of the century!!! It was well priced and the rooms, pool, and breakfast area were extremely clean. The breakfast was wonderful and offered a variety of foods to choose from. The staff were tremendously helpful and kind! The location was perfect, very close to the attractions but not directly on the strip which made it much easier to get around town. I will return to Branson Yellow Rose Inn the next time I stay in Branson.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "mo", "Title": "“WILL STAY HERE AGAIN!!!”", "Author": "lvtotravelmo", "ReviewID": "UR131704992", "Content": "Stayed two nights. Nice room, frig, microwave, coffee pot. The bed was quite comfortable. Best of all....the room was very, very clean. Breakfast was good. The ladies worked very hard to ensure there was plenty of food, kept the area clean. Front desk ladies, Nancy and Mari very accommodating. Great rates. This hotel is a couple of miles from main strip but well worth staying here. Quite, clean, etc.", "Date": "June 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Charles, Missouri", "Title": "“As Advertised”", "Author": "Tim G", "ReviewID": "UR131704435", "Content": "Stayed for 2 nights, after reading reviews, we were expecting something special and the Yelloow Rose delivered. Check-in was quick and courteous. Welcome package was as nice as we got from Wyndham Resorts as owners. Room was clean and clean smelling. Large TV was great and internet was simple and easy to use,fridge and microwave made it extra nice. We were near pool - a litle concerned about noise - but that wasn't an issue and the pool closed promptly at 10PM to ensure that. Check-out was as good as check-in. We usually come to Branson twice a year, we now have a new favorite place to stay.", "Date": "June 10, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Value": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Very impressive!”", "Author": "fotefote", "ReviewID": "UR131691182", "Content": "What a great value! I've never had such a nice experience at a hotel in this price range. Rooms are cute, pillowtop beds are very comfortable, and they add a few nice touches like giving us a bag of microwave popcorn when we arrived and a little box of chocolates when we left. We had everything we needed in the room--nice TV, little refrigerator, microwave, hair dryer, coffee maker with tea and coffee, iron and ironing board. I highly recommend this hotel!", "Date": "June 10, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Topeka, Kansas", "Title": "“Very Pleasant and quiet stay”", "Author": "Jim W", "ReviewID": "UR131606238", "Content": "Yellow Rose does live up to its reviews. Very soft king size pillowtop bed, nice tv, refrig/microwave, coffeemaker, hair dryer and last but not least was an ironing board w/iron. Very courteous staff and all the folks that we met while staying there were wonderful. My advice is to stay here, saving your money for the awesome shows in Branson.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olathe, Kansas", "Title": "“I will come back”", "Author": "christie s", "ReviewID": "UR131577421", "Content": "Yellow Rose was a very nice hotel. Everyone treated us excellent. We truly enjoyed coming down every morning for the yummy breakfast. We liked eating outside in the gazebo area. The only thing I would say about that is..... it rained a couple nights and in the morning the chairs were wet and we had to eat inside ( not a big deal because the inside is very charming as well ) Maybe if the gazebo had some sort of better covering so that when it did rain the inside didnt get wet. Other than that I wouldnt change a thing. My family and I will be back for sure !!!! Thank you to all the staff at Yellow Rose Inn.", "Date": "June 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Smith, Arkansas, United States", "Title": "“Best place to stay... Quiet and off the strip..”", "Author": "Robert S", "ReviewID": "UR131562944", "Content": "We have finally found a place we will be staying at whenever we are in Branson, MO.. And yes very quiet and the beds are just as good as the Hilton...", "Date": "June 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yukon, OK", "Title": "“Quiet, off the strip!”", "Author": "Carl M", "ReviewID": "UR131428638", "Content": "Quiet, clean motel off the Branson strip with excellent breakfast. Both front desk staff and breakfast staff were very friendly and helpful with any needs you asked for. Room was cleaned quickly while we were gone. Room smelled clean - no 'old motel smell'! Somewhat more difficult to find motel as it's off the beaten path of Branson, but well worth the search, resulting in a good night's sleep.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Davenport, Iowa", "Title": "“cjohnson”", "Author": "c j", "ReviewID": "UR131357358", "Content": "awesome Everyone was very freindly, room was very nice & clean,was very helpful in getting show ticket for us. Only 5 minutes away from the main strip.Would definitely choose to stay here on our next trip to Branson !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Friendly but funny smell”", "Author": "Redhawks94", "ReviewID": "UR131336449", "Content": "Our room had a strong smell when you first walked in. Not sure if it was their cleaning supplies or just an old room. The air conditioner smelled like dirty feet. The staff was very friendly. The give you a goody bag at check in and a sweet treat at check out. Breakfast is good and i like the location - just off the strip and a little hidden.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Just okay”", "Author": "RAutry", "ReviewID": "UR131288526", "Content": "Stayed 3 nights in late May (27-29). Decided to \"take a chance\" based upon very favorable reviews on this site. Stay in a King Suite was okay. Room had been remodeled and was clean and relatively comfortable. Bathroom was tiny and functional only because the door opened outward. Counter tops were old style laminate and appliances (sink & toilet) seemed undersized. Service was excellent - the microwave popcorn coming in and box of chocolates going out were nice touches. Desk attendant was most helpful in getting our three day show schedule finalized and show tickets delivered to our room. Breakfast was okay but a little hectic. Lots of diners in a very confined space and others waiting to be seated. Hot food choices (waffles and eggs) were nice touches - my waffle was prepared by an attendant and delivered to my table almost as soon as I was seated. Overall experience was fine - it was just a little below that of some newer Marriot & Hilton facilities we stayed in during this same trip. That shouldn't be surprising given the relative cost of the per night lodging costs ($80 vs $120). Would I make a return visit? Yes. Would my wife make a return visit? Maybe, with a little gentle persuasion.", "Date": "June 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awesome!”", "Author": "trishcu", "ReviewID": "UR131263136", "Content": "The beds are worth the stay! It was like sleeping on a cloud! The staff was excellent! Overall the best hotel I've stayed in!", "Date": "June 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia PA", "Title": "“Very good property, great value”", "Author": "bill1766", "ReviewID": "UR131215778", "Content": "I stayed at the Yellow Rose with my wife on a vacation trip to Branson. We had originally booked at a name-brand hotel, but decided to try the Yellow Rose because it was half the price. Good move. This is a sizable motel-type place that has been thoroughly renovated. Our room was big enough, comfortable and well-equipped, including a refrigerator and microwave. The housekeeping was outstanding, one of the cleanest places I've stayed. The rooms must be nearly soundproof -- we enjoyed peace and quiet the whole time we were there. Nice little extras: a surprise welcome bag that included toiletries and even popcorn for the microwave. The daily free breakfast was substantial: scrambled eggs, mixed fruit, hot and cold cereal, made-to-order waffles, juice, bagels and English muffins, and of course coffee and tea. Helpful attendants on duty. There's a well-kept eating area, but you can also take your food outside and eat on an attractive patio. At checkout, they gave us a little box of Russell Stover chocolates. Nice touch. The staff were very friendly and helpful, including arranging discounted show tickets. The only disappointment was the swimming pool -- it was well maintained and the water was crystal-clear, but the pool was too small for anything more than cooling off. Certainly not suitable for lap swimmers. Although it takes a little map-reading (or GPS help) to find the inn, it's actually not more than five minutes from the heart of the main drag, Route 76 (Country Music Boulevard) where the majority of the shows and restaurants are located. Overall, we were very pleased. A wonderful bargain inn, staffed by really nice folks.", "Date": "June 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jonesville, Louisiana", "Title": "“loved our stay at the Yellow Rose”", "Author": "Liz M", "ReviewID": "UR131110891", "Content": "I definitely recommend The yellow Rose to everyone,we love our stay there,we had 2 queen pillow top beds,coffee pot,tv,microwave,hair dryer,iron and board...ever a shower despencer in tub with shower gel ,they also had beach towels for swimming pool.rooms was very clean,carpet look like new....matching comforter set on both beds...breakfast was very good and great service....very pleased with our stay,If we ever get to come back to Branson....the yellow rose is the place for me and my family", "Date": "June 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benton, Arkansas", "Title": "“great place to stay!”", "Author": "SUSAN R", "ReviewID": "UR131106733", "Content": "We came to Branson not knowing where we were going to spend two nights.Looking in a guide from the welcome center we saw:The Yellow Rose! Non smoking,no pets allowed and new pillow topped beds! We arrived and found all that to be true and more!Excellent service from Cat.Great hot breakfast ,served by wonderfull mother and daughter team,waffle cooked perfectly!Off the beaten path(quiet)but just minutes off the strip.All this for 50.00!per nite,you can't beat it! One thing:when you get time if you coverbreakfast gazebo you\"ll have more room for the breakfast crowd! Thanks again!", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "central illinois", "Title": "“Yellow Rose Inn & Suites -- Branson”", "Author": "baswan", "ReviewID": "UR131011849", "Content": "Great Motel!!!! -- great staff -- everyone was friendly and very helpful. Breakfast was good and the staff in there exceptional as well. Nice quiet rooms, comfortable beds. Bathroom was a bit small but other than that great, great, great. Very affordable. Great location. Would definitely stay there again and recommend to anyone.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas", "Title": "“Loved it!”", "Author": "thatmommygirl4", "ReviewID": "UR130978709", "Content": "Clean and awesome rates. Staff was very friendly. I wished I could have brought the bed home with me ;) LOVED the breakfast and the mother/daughter breakfast staff was super nice. We didn't get a chance to try the pool but will next time. We will definitely be back!", "Date": "May 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Port Huron, Michigan", "Title": "“Great place, great location”", "Author": "kshope", "ReviewID": "UR130967818", "Content": "We wish every room we stayed at was as nice and especially as clean as those at the Yellow Rose. The room was very comfortable, the king size pillow top bed was the great, there was large flat screen tv, refrigerator and microwave, coffee pot, wi-fi; everything we needed. Also a full breakfast every day with homemade waffles,biscuits and gravy, and scrambled eggs. The only thing I missed was fresh fruit, especially bananas, there was a canned fruit salad. The location was excellent, off the main road and nestled in among time shares and condos, but just minutes from everything. We were too busy to use the outdoor covered seating areas for relaxing, but would have enjoyed them. The staff was friendly and helpful, and even arranged tickets for us to pick up right there. Would definitely recommend this gem, a great value for the money.", "Date": "May 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "India", "Title": "“Nice, clean & in budget hotel.. !!”", "Author": "rashmin_cby", "ReviewID": "UR130958486", "Content": "Pros: Nice, clean, quite, within budge Cons: Little far inside fron highway 76", "Date": "May 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Honolulu", "Title": "“Stay here”", "Author": "Kimo-Sabey1", "ReviewID": "UR130936371", "Content": "Great internet coupon and breakfast included with room.", "Date": "May 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent little Gem.”", "Author": "rosevilleca", "ReviewID": "UR130901210", "Content": "This lodging is excellent. The location is just off the main Branson strip (maybe 2 miles) but far enough away, and nestled into the side of a hill for quiet, and I mean quiet sleeping. Exterior noise is non-existant, and there seems to be a lot of sound insulation between rooms. I never heard my neighbors. The pool is nice, breakfast is really decent, with hot waffles and scrambled eggs every morning, and an assortment of sweet rolls, etc. Where this place really shines is in the service and cleanliness. This is the cleanest hotel/motel/suites I have ever stayed in. It's that clean. The manager is meticulous and holds her staff to a super high standard. There are two nice outdoor gazebo like eating areas, besides the breakfast area. I really loved this place. The air conditioner worked really well, too. :) I am not affiliated with the Yellow Rose Inn. My family stayed here for a trip to Branson.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Louis", "Title": "“Quiet Rooms and an Excellent Value!”", "Author": "MadScrapperMom", "ReviewID": "UR130870140", "Content": "Wow, what a gem!!! The Yellow Rose is an EXCELLENT value. The room was exceptionally clean and packed with amenities like a mini fridge, microwave, hair dryer, iron and ironing board. The beds were pillow top and very comfortable. Towels were thick and plentiful. The room was very quiet and once inside our room we didn't hear noise from the neighboring rooms. The mother/daughter team that operates the daily breakfast were so friendly and accommodating and made the effort to speak to our special needs daughter every morning. Professional and hard working staff. We were very pleased with our stay and plan to be return visitors. Thank you for a pleasant stay!", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Conway, Arkansas", "Title": "“Great!”", "Author": "Vince35", "ReviewID": "UR130760642", "Content": "Clean and no complaints. The rates were wonderful. We will be staying here again! For sure!", "Date": "May 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Quiet stay, good service”", "Author": "Rogueangel1212", "ReviewID": "UR130686570", "Content": "Only real gripe about the place is that the power went out in our unit 3 times during our 2 day stay while my wife was blow drying her hair. Staff was prompt to flip the breaker back on, but after the second time all I could think was,\"really?\" Also they said it would be fixed and never was. Otherwise staff was helpful and courteous. Room had a \"dressed up\" motel feel, and was average for a so called \"suite\". For the price I have stayed at better hotels (although it was a holiday weekend). The room was very clean, and breakfast is served 6:30-9:30 (Should be until 10:30, who wants to get up before 8-9 on vacation?). The place didn't quite meet my expectations being newly remodeled, but it wasn't a bad place to stay. I would consider staying here again.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Van Buren, Arkansas, United States", "Title": "“maybe not such a hidden gem!”", "Author": "bdnewt007", "ReviewID": "UR130679684", "Content": "let me start by saying I don't like to leave negative reviews, I read all kinds of reviews before booking a week and a half in advance at the yellow rose inn. I was so excited to find a motel as one person put it a hidden \"gem\" in branson, my wife booked a room with kat for the 26th on the bottom floor, when wife arrived she spoke to a man named jake and he said that he had no record of it being on the bottom floor so he put them on top floor at the back of the motel, now we are 45 years old so no biggie for us to go to top floor, but my mother is 68 and a few months back had a heart attack. so for her it was a big deal hence the reason for booking in advance! my wife spoke to a woman in house cleaning and she was super nice and told my wife that the room upstairs was nicer then downstairs because of new remodeling. room was nice, beds were nice, so i really want to be fair in writing this review. motel is older and has usual problems for an older motel. air conditioning froze up and also toilet would act like it did not want to flush. my wife went back and spoke to jake upon checkout and told him that she thought the reason that they stuck them on the back of motel was because of a coupon for $49 dollars a night. he admitted that it was the truth that the computer was the culprit that it would automaticly put you in back, so dont use a coupon just pay regular price if you want a front room. I mean this place no ill will, its just that alot of people that go to branson on vacation are older with health problems and my family was a little dissapointed with the service.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Longview TX", "Title": "“WOW”", "Author": "ChastainsLongviewTX", "ReviewID": "UR130631926", "Content": "This motel had the friendliest staff and was super clean. The pillow top mattresses were so comfortable. The homemade to order waffles for breakfast were delicious as well all the other items to choose from ...had to try something different each morning. They also helped get great seats at shows for a discounted price ...we will definetly stay there again. There are also beautiful out door gazebos to enjoy.", "Date": "May 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“EXCELLENT”", "Author": "Beverly A", "ReviewID": "UR130574559", "Content": "The Yellow Rose is the most wonderful experience . The staff was superb and very informative. I was honored to stay at the Yellow Rose and I would recommend to anyone. The rooms were very clean and smelt wonderful. The breakfast was great. Thank you for our stay and will return . Sincerely Beverly Adams", "Date": "May 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Yellow Rose is the Best”", "Author": "Larry C", "ReviewID": "UR130478424", "Content": "We had the great experience of staying at the Yellow Rose while we were in Branson. Great clean rooms, Very pleasant staff, and just the nicest group of people anywhere. They had a wonderful breakfast spread and the Mother/Daughter team were marvelous with good food especially the Buiscuits and Gravey. The hotel is off the beaten path but only minutes from the entertainment theatres Branson has to offer. We will be returning next year for our next anniversary. You will enjoy.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tahlequah, Oklahoma", "Title": "“Exceeded My Expectations for the Price!”", "Author": "Tiffani M", "ReviewID": "UR130367363", "Content": "My husband and I just celebrated our 4 year wedding anniversary and we wanted to get out of town for the weekend. We decided to go to Branson and do some shopping and just spend time together. We are on a tight budget, so in order to make our trip happen I needed to find an inexpensive hotel that would also be a pleasant place to stay after we were through exploring the town. I researched several hotels and read many many reviews over just about every hotel in Branson. I stumbled across The Yellow Rose Inn and Suites and started reading reviews about it. They were all very positive reviews and the price was amazing! I searched for the Yellow Rose on other review sites as well to see if all of the reviews matched up and 99% of the reviews I read were all positive. I looked at photos of the rooms and they looked very nice for the price as well. I was convinced that this was the place to try and I am glad we did! The hotel is located just far enough away from the strip that it is relaxing and quiet but still very convenient. The beds were super comfy and the TV was a good size. The rooms are not very big but they are plenty big enough to relax in. When we checked in the lady at the desk was very friendly and gave us popcorn for later. They have a complimentary breakfast like none other that I have ever seen at a one star hotel. Waffles, eggs, cereals, donuts etc. I was so tired the first morning that I did not feel like going to get breakfast so my husband went to grab a donut or something and they gave him a tray to bring food back to me in the room. When we checked out two days later we recieved a small box of chocolates to thank us for staying there. I know these things aren't a huge expense or big deal but it is the thought behind it that matters to me. We paid a very inexpensive price fo our King room therefore was not expecting the kind of service we got. It well exceeded my expectations and we are planning another trip to Branson in a month and this is definitely where I will book our rooms. I was very pleased.", "Date": "May 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stromsburg, NE", "Title": "“Great weekend”", "Author": "Shirley L", "ReviewID": "UR130366921", "Content": "My daughter and I stayed here for our Birthday weekend and couldn't of been happier with our stay. All of the staff was very friendly and we enjoyed the SPECIAL treats we were given when we checked in we received popcorn and when we checked out a box of chocolates both a nice surprise! Our room was clean and had great housekeeping service.Nice varitey of food items offered at breakfast. Looking forward to our next stay. Thanks, Shirley and Stacey", "Date": "May 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awesome stay at this hotel.”", "Author": "apttoleave", "ReviewID": "UR130271780", "Content": "It had everything a more expensive hotel would have for less. I got my nice bedding, free WiFi, free breakfast and flat screen for much less than it would have been somewhere else. Nice off the main road location was very peaceful. Nice outdoor pool. Very friendly staff and very clean.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrensburg, Missouri", "Title": "“Friendly and clean place to stay.”", "Author": "Connie P", "ReviewID": "UR130071316", "Content": "We had a little trouble finding this hotel, due to the fact I had not mapquested it. I had a map of Branson but the street the motel was on was not listed. Growing frustrated I called the motel, and a very nice man gave me instructions from the parking lot I was calling from and said if I had any trouble to call back. The motel sits off Branson's 76 Strip in a very quiet and tree-lined area called the Falls. I was very tired from the drive and went in and the receptionist was very friendly, smiling and found me a room where I would have no steps to climb. She explained to me the offerings they had for breakfast and said to call if I needed anything. The next morning we went to the dining area and it had several guests eating. The two servers were mother and daughter and very nice, friendly and attentive. Our room was spotless and picture perfect when we opened the door. The breakfast was great, with scrambled eggs, waffles, bagels, cereal, biscuits and gravy etc. All very fresh and clean. The a.m. desk clerk greeted me with a smile and a smll box of chocolates. My only complaint would be that the air conditioner didn't put out enough air, but that may just be me. Cleanest and friendliest place I have stayed. Being off the Strip was great too. No noise of traffic. They have two outside gazebos and a small pool also. The gazebos had flowers all over and were quite pretty. The price was very reasonable and I would definitely stay there again.", "Date": "May 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hcleghorn@cox.net", "Title": "“Great Stay”", "Author": "atpawhc", "ReviewID": "UR130064880", "Content": "Stayed here May 2 to May 9 for the best stay we have had in 4 visits in Branson.Very nice stay,great staff and beds. Thanks to all of the staff for making our vacation great. Thanks, Harry and Vivian", "Date": "May 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pekin, Illinois, United States", "Title": "“Amazing accommodations-”", "Author": "Debbie E", "ReviewID": "UR130047151", "Content": "Travelled to Branson with two elderly moms--the hotel was spotless. The staff was helpful and courteous. The hot breakfast was great-waffles, biscuits/gravy, scrambled eggs, and other breakfast foods. We opted for the king room and the bed was very comfortable. The room was great with a loveseat and refrigerator and microwave. It was just like being home. For $70 a night for the king room-it was an awesome deal. It was a short distance from the main drag but just enough in the hills to be enjoyed. Loved it.", "Date": "May 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kansas", "Title": "“Excellent Choice”", "Author": "TravelersKansas", "ReviewID": "UR129997140", "Content": "You can't go wrong by staying at the Yellow Rose in Branson. VERY reasonably priced. Extremely clean and well-maintained. Good breakfast with a mom and daughter team taking care of your dining needs. Comfy beds, clean pool.", "Date": "May 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Arkansas", "Title": "“Very good for the price paid”", "Author": "theplayer19", "ReviewID": "UR129940218", "Content": "This is a nice place with a nice staff. The grounds and room were neat and clean. The pillow top bed was comfortable. The breakfast was good for the price. Overall for the price paid this was a very good deal. It is off the strip but not hard to find. There is a large billboard sign telling you were to turn. I would stay here again.", "Date": "May 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cedar Hill, Missouri", "Title": "“priced reasonable”", "Author": "barbara m", "ReviewID": "UR129850825", "Content": "This smaller motel has a great breakfast with lots of varieties of food. Everyone is very friendly. They have a large out door pool. It is a clean reasonable priced hotel off the main drag of Branson. We have stayed there many times. There is a sitting area for outside and a place to sit out by your room with an overhang. Looking for reasonable price and not too pricey this is it. the rooms are on ground level.", "Date": "May 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beebe, Arkansas", "Title": "“Great price and Great hotel”", "Author": "theresa j", "ReviewID": "UR129811899", "Content": "The Yellow Rose is the best hotel I have stayed in at Branson. Every trip I make We stay at a different hotel but from now on I will stay at the Yellow Rose. We requested a room near the pool and we could sit in the room and watch the kids from our window. We did not hear any noise from the rooms next to us. The room colors were light and very calming. Breakfast was great and had many choices instead of just donuts. The staff were extremely friendly and helpful. Upon check in we were given popcorn and check out we were given a box of chocolate. The towels were big and thick instead of the thin ones most hotels have. I am already planning my next trip and will definitely be staying at the Yellow Rose", "Date": "May 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ellington, Missouri", "Title": "“Great and at an excellent price”", "Author": "TMoose1957", "ReviewID": "UR129792556", "Content": "The check in was smooth and the desk clerk was very helpful and efficient. The rooms were extremely clean and quiet. The price for the quality of the room was just unbelievable, it was such a wonderful bargain. The lady that took care of the breakfast was so helpful and friendly, the whole experience was very positive and when we go back to Branson, we will be staying here.", "Date": "May 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Yellow Rose Gem”", "Author": "Bert S", "ReviewID": "UR129673745", "Content": "Great place to stay and so quiet. Friendly, efficient personnel. Would not change a thing. Very clean and we were quiet satisfied! Schoutens - Tulsa OK", "Date": "May 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Only place to stay!”", "Author": "Aaron B", "ReviewID": "UR129621756", "Content": "Just got back from a three night stay. Yellow Rose Inn had none of the typical motel feeling for me, it was more like home. Check in was quick and painless. Our suite was on the ground level with conveniently close parking available. The room was IMMACULATELY clean. I had no problems feeling comfortable immediately. The bed was amazing. The mini fridge and microwave were a huge plus since we like to bring a few things along. The complimentary breakfast was definitely leaps and bounds above the norm. The room was so quiet we completely slept through a storm that rolled through in the middle of one of our nights. I would highly recommend a stay here! Hard working people who absolutely understand the meaning of the hospitality industry and providing value and service to their customers.", "Date": "May 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kaiser, Missouri", "Title": "“Nice Stay-Excellent Price”", "Author": "Linda H", "ReviewID": "UR129581985", "Content": "It is a nice motel that was clean and very friendly, they also had great waffles that were made for you in the breakfast area. The rooms were quiet and the walls were not paper thin--could not hear the neighboring rooms.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrensburg, Missouri", "Title": "“Branson's Best Kept Secret!”", "Author": "pwif43", "ReviewID": "UR129579611", "Content": "Husband and I just spent the weekend in Branson, and have FINALLY found a hotel that we WILL be staying at every time we visit! The Branson Yellow Rose Inn and Suites is one of Branson's best kept secrets! There was a little snafu in our check-in, but was immediately corrected. Everything was smooth sailing from there. The staff was great, the rooms were very very clean, slept like a baby!!!! Breakfast was great! Upon our check out, we were given a small box of Russell Stover's Candy! :-) Would most definitely recommend this place!", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Butler, Missouri", "Title": "“Very Nice!!!”", "Author": "Gay B", "ReviewID": "UR129485566", "Content": "My husband and I are very particular with regard to hotels. This Inn is quite a \"find\"! It was extremely clean, updated and quiet. Exactly what we needed for our weekend getaway. It is close to the Branson strip, yet far enough away that we did not have the noise or traffic. The breakfast was very good too. The staff was friendly and accomodating. Highly recommend!!!", "Date": "May 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, IA", "Title": "“The best hotel I've ever stayed in!”", "Author": "Cham515", "ReviewID": "UR129360680", "Content": "My sister and I stayed at the Yellow Rose this last weekend, and had the best experience!I have stayed at many, many hotels in my life, and this is by far the best I have ever stayed in! The rooms were so clean, the bed was phenomenal, flat screen TV, fridge, and microwave. I could have just moved in for good! I was so leary because of the price, but read the reviews and thought I would give it a try, So glad I did. The grounds were just lovely, and the staff was so nice. And the kicker, we got a box of chocolates for each of us when we checked out! We joked that we could fit the mattresses on the top of the car when we left, didn't want to get out of the beds. I go down about once a year to visit family, and even if the family has room for me, I will probably decline and stay there instead. Close enough to attractions, but far enough away to be nice and quiet! Thank you for a great experience!", "Date": "May 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Des Moines", "Title": "“Great place to stay”", "Author": "Linda M", "ReviewID": "UR129355080", "Content": "I've just returned from a 3 night stay at the Branson, Mo. Yellow Rose Inn. It was very enjoyable. All personnel were so very friendly and accommodating. The room was clean and well maintained. The location was quiet but close to everything. Main roads were easy to find to get to entertainment, dining and shopping. I would definitely recommend this hotel.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Clean, quiet, comfortable place to stay.”", "Author": "Tmc1947", "ReviewID": "UR129206926", "Content": "My wife and I just returned from a three night stay at this hotel starting on April 28th. We enjoyed our stay very much. On arrival, we were able to upgrade our room to a King Suite. The room was fairly spacious and although the bathroom was a bit small it was adequate. The room was clean and well maintained each day. The bed was very comfortable and it was nice having the loveseat, fridge and microwave. There were also another chair and a nice office chair to go with the desk in the room. I thought a particular nice touch was a multiplug strip on the desk for plugging computer, phone chargers, etc. More hotels should include these in their rooms. The breakfast room was nice and there were two gazebos for outdoor eating and viewing. The breakfast was nice and the ladies working there very helpful. Although the hotel is off the main strip, it is easy to get to and near one of the main traffic routes. For us, being a little isolated was alright as it made the hotel very quiet and restful. All in all, it was a nice trip and we look forward to staying here again.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Forks", "Title": "“Loved it! WIll stay again.”", "Author": "Lynn_Dixi", "ReviewID": "UR129060711", "Content": "We went for just a short getaway and stayed at the Yellow Rose. It's tucked away off the main roads, but still just minutes from theaters/attractions. Very quiet and peaceful and safe. Rooms were clean and neat and recently updated. Comfy pillow top mattresses, fridge/microwave in the rooms. Delightful little breakfast area and the attendants were friendly and helpful. They served a full breakfast with fruit, juices, coffee, cereals, pastries, waffles, scrambled eggs, biscuits/gravy. What more could you need to start the day?", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springdale", "Title": "“Great weekend”", "Author": "Marilyn H", "ReviewID": "UR129044858", "Content": "Just wanted to write my first review for Branson Yellow Rose Inn and Suites. We were thrilled to find a beautiful room that look as if it been remodeled with new bedding, paint and updated TV, microwave and refreg. The king size pillow-top bed was so comfortable it was like being home in my own bed. The location is not far from the 76 strip. To top it off when we went for breakfast the next morning we found so much waiting for us...biscuits, gravy, eggs, waffles, bagles, cereals to name a few of the items. We were greeted by two ladies who seated us and offered to make waffles for us. They made us feel so special but we noticed that this kind treatment was given to each person arriving. The breakfast area was nice and clean. We have been going to Branson for many years but we have now found our home away from home.", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Claremore", "Title": "“Made a Fun Trip Even Better!”", "Author": "Charles S", "ReviewID": "UR129038089", "Content": "My wife and I both enjoyed our stay a great deal! The room was very clean, very quiet and the pillow top bed was nice and comfortable. The staff was outstanding! I have never experienced a more friendly, helpful group of people in any previous trip to other places. They have a nice breakfast to start the day. Thank you, Irene and Erica! Mary Alice and Jake were on the desk and they were very helpful. The maids, Diann and Michelle were nice and helpful and very friendly. They do an outstanding job on the rooms! I am a people person and these are some great people to brighten your traveling experience. I just don't know what more we could have asked for! AND the price was right!", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Broken Arrow,OK", "Title": "“Friendly”", "Author": "Keri99", "ReviewID": "UR128361400", "Content": "This hotel is by far the friendliest place we have ever stayed in Branson, and that is saying alot since Branson is overall a very friendly community! The room was very clean and had everything it promised. Bed was very soft. The mother and daughter who run the breakfast area were just as nice and cheerful as could be. We are planning on coming back later in the summer and will for sure stay here again.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shawnee", "Title": "“Hotel Experience”", "Author": "madge82", "ReviewID": "UR128254800", "Content": "This is the third time I have stayed in this motel. It is simply the cleanest, nicest, motel ever. I have stayed in othercountries as well as other cities. I have never found one better or more professional than this Yellow Rose. The management as well as the clerks, housekeeping etc was super. They are consistent with everything. The rooms are extra clean. The breakfast is nice and servers excellent. I will return in May to this motel.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "crown point", "Title": "“unreal clean and great service”", "Author": "jim t", "ReviewID": "UR128148216", "Content": "WE have stayed in branson plenty of times and always paid big money. We have stayed in motels from coast to coast ,We must tell you that we found yellow rose the cleanest and most friendly. you can not find this anywhere, unbeleivable rates.do not miss a stay there if your wanting to go to branson.make sure you have the breakfast food very good and the service was second to none. JIM and SANDY THOMAS from crown point indiana", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Iowa", "Title": "“Wow! What a great place!”", "Author": "tessiebear", "ReviewID": "UR128145031", "Content": "VERY clean room, quiet, and bed was wonderful..great night's rest. Stayed 3 nights. Will definitely stay here again. Lady at breakfast was very helpful, making guests waffles and keeping room clean and items stocked. You won't be disappointed, room rates are another plus.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Michigan", "Title": "“Just a stop to look around”", "Author": "cj725", "ReviewID": "UR128086494", "Content": "We wanted to get a look at Branson so we found the Yellow Rose for $55 It was clean. Difficult to get an internet connection from where we were in the building.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "grand rapids", "Title": "“Great Hotel Friendly Staff”", "Author": "ydbgrandrapids", "ReviewID": "UR127635627", "Content": "We stayed the first week of April. The people at the front desk were really helpful and went out of their way to help us find good places to eat and shows.They were like good friends. The ladies in the breakfast area were also really friendly. The rooms were large and very clean. Rates went down when we were here and they were nice enough to give us the lower rate. TV was great. Nice quiet location. We would stay again for sure.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Favorite Branson Lodging”", "Author": "kbake00y", "ReviewID": "UR127563287", "Content": "My wife and I have stayed twice in the past month at this Inn. It is one of the best places we have stayed on any of our trips, The staff is always friendly and helpful. The rooms are quiet and nicely decorated.The breakfast is more than ample and you can always find something to your liking. Thank you for a wonderful place to stay to relieve the stress of the world. WE WILL BE BACK very soon. Kevan and Debra Baker", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hot Springs, Arkansas", "Title": "“Fantastic deal in Branson!!”", "Author": "Mindyelaine43", "ReviewID": "UR127441697", "Content": "We found this place on tripadvisor and we were very impressed with the cleanliness and great value! The rooms are very clean and comfortable. The breakfast is very nice, although the coffee could be better. The staff are friendly and helpful. The rooms are outside entry but they do have a nice security system and it is in a quiet neighborhood away from the main strip. It's a little hidden but well worth finding", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Central Arkansas", "Title": "“Very enjoyable visit!”", "Author": "Tonya3004", "ReviewID": "UR127092879", "Content": "My husband & I really enjoyed our stay at this inn. The inn was very very clean. We were amazed at how quite it was there. The pillow top bed was wonderful and very comfortable. We slept great. The room was decorated very cheerfully. The tv in the room was high def. with HBO. At breakfast we had no problem getting waited on. The lady assisting with breakfast cooked waffles for us and was very nice to us. The breakfast consisted of scrambled eggs, biscuits and gravy, chilled fruit, donuts, cereal, toast, selection of jelly, juice and coffee. The price was awesome! The innkeeper will also get your show tickets for you if needed, with advance notice. The only negative I can think of was the coffee maker in the room only made about 1 1/2 cups of coffee and the inn was a little difficult to find. Overall, we really liked this place and we will definitely go back.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Still Geat”", "Author": "nexttime2", "ReviewID": "UR126964330", "Content": "I visited Branson last year and stayed at the Yellow Rose. It appeared to have been recently updated and was great. I stayed there again this year and was pleased to see that it was still being operated at the same high level. I have stayed at various hotels in Branson over the years and have found that for many, the level of quality goes up and down over time. I am very pleased to see that that is not the case with the Yellow Rose.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“ok--could be better....”", "Author": "annevt30", "ReviewID": "UR126690102", "Content": "Thank goodness we received a discounted rate otherwise this hotel is too overpriced for being #2 on trip advisor! Very disappointed; I expected more  Decided to stay here since the reviews were so positive. Unfortunately, our 3 night visit was ok…. We’ve stayed at better hotels in Branson for the price & this one was really average! The only thing we enjoyed was the breakfast lady who always smiled, made excellent waffles & kept the breakfast area clean. Otherwise, you are better off staying at another hotel. First, this hotel is hard to get to….lack of signs coming from the strip & we missed our right turn every time! It’s in the back or in between some timeshares & hard to get to at night. Too far from the strip & shows! Second, the room was small- even though it had 2 queen beds. The “up-dated” room may have had new carpet & bedspreads but the mattress was uncomfortable. Bathroom is tiny! The shower was terrible & old. You had to lift up the spout & half the water wasn’t coming out of the showerhead. The water kept switching from cold to hot every 2 seconds; you can hear the ‘hissing’ noise from the shower! Our “mountain view” room in the back of the hotel faced an open parking lot directly across from a maintenance shop. So much for keeping your windows open! The hotel itself was very quiet but you could still hear people from the other rooms. The frig & microwave was a plus although the 1-cup coffee maker really needs to be replaced! It only makes a ½ cup of coffee & only 2 packs per room. The breakfast was all prepackaged! No fresh juice or fresh fruit (only watered down & canned); no yogurt or any healthy choices available. The highlight was asking the front desk for a tube of toothpaste since we forgotten ours; they didn’t have any!! No shower cap & a tiny bottle of shampoo. The amenities that you take for granted at any other hotel were not at this one! Cheap! Overall, the hotel was ok…but our 4 days in Branson were fun despite the rain. I would not stay at this place again. For a family ( babies to teens) you are better off staying at the Grand Country water park (grandcountry.com). This one is even better than castle rock! You can walk to the buffets, play games & eat pizza at the Fun Spot and watch a pretty good show (grand jubilee) even if you don’t like country music. Avoid the traffic and take the Yellow/blue/red routes.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Mountain Home, Arkansas", "Title": "“Fantastic beds, clean room with all amenities, Excellent breakfast!”", "Author": "KarenN777", "ReviewID": "UR126643609", "Content": "Great little place for a great price ($49 a night with the special they had going)! We will be going back soon. I am a germaphobe. This was the best room I've ever rented, and I have traveled plenty. I didn't have to disinfect anything but the doorknobs and the toilet, (which actually looked clean already, but I have this thing.) Bed was super comfy (Slept better than at home, I want one). TV was huge, frig, HBO, internet, lots of towels. Irene in the continental breakfast room was a real go-getter. Everything you could want in a free continental breakfast. LOVED IT! Didn't want to leave! Kari and Bruno offer many thanks to the lovely Manager and the friendly staff! And we had a blast at the karaoke/live music bar under Dick Clark's American Bandstand Restaurant that opens at 5 or 6 pm and starts karaoke right away, every day, and up until the band starts at 11P on band nights. Very reasonably priced drinks and lots of fun!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Muscatine, Iowa", "Title": "“Clean room, nice beds”", "Author": "HawkeyeTourist", "ReviewID": "UR126521714", "Content": "Room was clean, the pillow top beds were very comfortable, staff was very helpful in obtaining tickets for attractions. Nice tv and good breakfast. Bathroom a little on the small side. It was in a good location for us. Flat parking lot was nice in this hilly town. Tough to beat the price. Looks like they are adding an elevator.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olathe, Kansas, United States", "Title": "“Great secluded place”", "Author": "Heidi B", "ReviewID": "UR126239652", "Content": "This was a great place to stay in Branson. It was off the main strip which was nice and quiet. The people are friendly and service was great. There was a fridge, microwave , hair dryer, Huge flat screen tv, and desk...great perks. Breakfast was very good, lots of variety.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Broken Arrow, Oklahoma", "Title": "“Great Place Great Price”", "Author": "Me0727", "ReviewID": "UR126047452", "Content": "We had a great visit to Branson and loved the yellow rose. It was very very clean, great staff and it was a great price. You can tell that they did some recent remoding new bedding dressers and a huge flat screen t.v. We even found a coupon in the Travel Buddy and it was like $54.00 a night. Inculdes a hot breakfast with biscuits and gravy or they will make you a waffel donuts cereal etc. The breakfast area was a little small but we got a seat pretty fast and it was all fine. The only other negative thing I have to say is we stayed on the 3rd floor and there was not an elevator so it was a little hard to get all of our luggage and we bring a cooler up all the stairs but again all the good out weighs the bad and we will defently stay here again. As a matter of fact we have a reservation coming up in June. Give the Yellow Rose and try and I bet you will want to stay there again.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri, United States", "Title": "“Excellent service, above and beyond, Very reasonable rate, Friendly people, Very clean, Excellent breakfast better than”", "Author": "Jerretta S", "ReviewID": "UR125963484", "Content": "Very friendly, clean they went above and beyond, The breakfast was fantastic, way better than continental. Very clean brand new rooms. Completely remodeled. very affordable. And excellent staff.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "camdenton", "Title": "“would stay again”", "Author": "Bob K", "ReviewID": "UR125947049", "Content": "The hotel was very clean and the beds were comfortable. The large flat screen TV was very nice. The staff was very helpful and courteous.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Olathe, Kansas", "Title": "“Relaxing hotel with yummy breakfast”", "Author": "Bigjayhawkfan", "ReviewID": "UR122487093", "Content": "For a budget hotel this place is amazing! Great food for breakfast and nice staff working here. The beds were pretty comfy (shocking for a budget hotel). We didn't notice any noises outside our room from loud guests (which is a HUGE problem at most Branson hotels regretfully). Pool is only outdoors, which limits this place to only working for my family to the summers. Nice that this hotel is off the beaten path, but easy access to many places. Will stay here again for sure.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moorhead, IA", "Title": "“Wonderful place to vacation at. Will come back next year.”", "Author": "vada61", "ReviewID": "UR121716160", "Content": "We got back yesterday from our trip to Branson. Myself, my boyfriend and his mother and aunt. We enjoyed this hotel very much. The room decor was very pretty and clean. The beds were most comfortable. The breakfast that was provided was very tasty and their was enough food to feed an army. They served scrambled eggs, fruit, biscuits and gravy, juices, coffee, cereal, doughnuts, bagels and waffles. The women staffing the kitchen area even made my waffle for me and they stayed to chat with us. The only downfall is that the dining area is a little small when the rush showed up, but from what I understand is that this is under new management and they are going to be doing a lot of upgrading for the next year. Maybe next time we come back you might have cranberry juice on the menu(hint-hint)..lol Thank you very much for an enjoyable stay we we will definately be back. Janet, Bruce, Marlys and Sharon", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Great place to stay”", "Author": "Winnipeg_gal_11", "ReviewID": "UR121568785", "Content": "We stayed for 4 nights late November and I have to say that I had not a single complaint. The king size bed was heavenly, the room was spotless and staff was wonderful. We had the continental breakfast each day and the dining room and staff was just great. Just one suggestion - change the brand of the canned breakfast fruit (some other brands are more tasty!) We will definately stay there again next visit.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good Exerience”", "Author": "nexttime2", "ReviewID": "UR121568763", "Content": "My wife and I sepnt two nights at the Yellow Rose and were very pleased with all aspects of the stay. It appears to have been updated very recently and is in great shape. The room was clean and looked very nice. The beds were really great. The front desk folks were very efficient and friendly.The location is a little off the beaten path, which turned out to be a benifit. Getting into and out of the parking lot was much easier than at a hotel on the strip. The free breakfast was good and more than competitive with other hotels. The rates were very reasonable. We will definately stay here on our next trip to Branson.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great Hotel!”", "Author": "djoyce05", "ReviewID": "UR121475446", "Content": "I come to Branson all the time. I found a new place to stay. I had no problems at all with this hotel. The only thing was the rowdy kids next door. But that was out of their hands. I have told all my friends about this place and hope everybody will give them a chance!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gowen, MI", "Title": "“A great place to stay!”", "Author": "JimGowen_MI", "ReviewID": "UR121438507", "Content": "Everything about the Yellow Rose Inn is positive---from the friendly staff and the great breakfast, to the clean and comfortable room-all for a reasonable price. It is off the main strip so traffic and noise is no problem. It is easily accessible by the Yellow Route but not visible from Hwy 165 so watch for the sign. We will stay there again when we visit Branson.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rogers, Arkansas", "Title": "“Very Good - for a motel”", "Author": "ldepp", "ReviewID": "UR121423506", "Content": "Our party of eight stayed 3 nights in early December. Quiet location about a mile from Hwy 76. Friendly people. Very clean and comfortable rooms. The beds (Denver Mattress) were excellent and all of us slept well. Not a fan of the decor - ours was pink/purple with a pepto-bismol pink bathroom. The TV channels were strange - 2 channels for each station. One station was non-HD and the other HD. Some HD channels did not receive the signal very well and had frequent skips in the video/audio. Hot breakfast was very good. A young lady made all the waffles to order. Value is excellent. However this is a MOTEL so expect the usual motel noise with people passing by your room.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "O'Fallon, Missouri", "Title": "“Need sheets that fit the bed.”", "Author": "nansam1", "ReviewID": "UR121224396", "Content": "The first impression of this hotel was great - the decor was beautiful and the room smelled so clean. We had a King Suite and the bed was a pillow-top - but that's the problem. The mattress pad, which was also pillow top and the bottom sheet would not stay on the bed. With every turn and movement, the pad and sheet came up and we would end up on bare mattress with the pad and sheet in a bunch. As you can imagine, that is not a pleasant thought - wondering who else had slept on that bare mattress. Had a very difficult time sleeping both nights. We were with another couple who was in the room next door and they had the same problem. They had a very nice breakfast, which was free to guests, but the room where they had tables and chairs was way too small for the number of people who tried to get breakfast there. If you waited very long after nine o'clock, the line for a table was out the door. We looked at reviews on trip advisor before we chose this hotel and have a hard time beleiving that no one else had the 'bed' problem.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Stewartsville, Missouri", "Title": "“Nice Hotel”", "Author": "Country_Traveler2011", "ReviewID": "UR121026190", "Content": "Yellow Rose was a nice hotel. Breakfast was a little disapointing as there was no meat, but plenty of other choices. It also is a little hard to find. Be sure to have a good map or GPS.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calimesa, California", "Title": "“Hard to climb stairs, but good overall value.”", "Author": "Grannybird4", "ReviewID": "UR120963825", "Content": "We enjoyed the comfortable bed, and clean room.The staff overall was most helpful, especially Irene and her daughter at breakfast. Quiet location, a little difficult to find, but overall a good experience. We found it difficult to navigate the stairs as there is no elevator, and we had to climb two flights of stairs with baggage for a week.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marshall, Missouri", "Title": "“Wonderful hotel, just need larger dining room!”", "Author": "Norma J", "ReviewID": "UR120957156", "Content": "The Hotel was wonderful. I wish there was smoking rooms available but at least having an outside entrance and exit helped. We could smoke directly outside our door instead of exiting to a hallway and having to walk downstairs and then outside to smoke. The breakfast was very good and the personnel was extremely helpful and very friendly. I certainly would hope that this dining area could be enlarged extremely so people would have plenty of tables to go to directly to sit down. The personnel did everything in their power to seat everyone as quickly as possible. Also for people who need it, it would be nice to have sugar free syrup for their waffles. It would also be nice to have pancakes on the menu and some sausage links or bacon to choose from. Also the eggs could have some cheese and green and red peppers for flavoring. The main thing is to just enlarge it extremely. Having a large dining room will keep people from having to go out to restaurants to eat breakfast. Flavored coffee and coffee creamers would also be nice. I am used to drinking flavored cappachino but I made do. We will definitely come back as soon as possible.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springboro", "Title": "“Branson Vacation”", "Author": "Garry G", "ReviewID": "UR120951237", "Content": "We stayed a full week at the Yellow Rose and they made it a wonderful week. All the folks there were very helpful and super nice from the front desk, maids, and the breakfast crew. It is located close to Branson but far enough out that is is a very quiet and peaceful. The breakfast was a full breakfast, not just donuts and coffee. The room was always clean and the beds were very comfortable. My wife and I will stay here the next time we go to Branson.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Excellent local hotel”", "Author": "BJL83", "ReviewID": "UR120443776", "Content": "This hotel has been updated and remodeled. It was VERY nice, comfortable and quiet. Breakfast was nice, with a good variety (complete with an attendant who kept things stocked as needed). We had no idea where to stay and was lucky to find this hotel on Trip Advisor. We were NOT disappointed at all. Staff is very accommodating at check-in and with show tickets. If you need a clean comfortable and AFFORDABLE room, check this place out. It will be on our list the next time we are in Branson and need a hotel.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "KANSAS", "Title": "“Great location off the strip with quiet rooms!”", "Author": "BGDUDE", "ReviewID": "UR120230950", "Content": "We stayed at this location for 3 nights in November in a King Suite. We arrived late but had no problem finding this location after dark. It is perfectly placed so you can access it from more than one direction and avoid almost any traffic. The room was very clean and the beds were firm and comfy. The parking was plentiful and the breakfast was well attended by staff members. We would definitely recommend this location for an extended stay in Branson!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Saint Rose, Louisiana", "Title": "“A Great Stay at Branson”", "Author": "Bob H", "ReviewID": "UR120128347", "Content": "We, my wife and I went to Branson in late October 2011 for a getaway from home. I tried to do my homework before leaving and found the Yellow Rose Inn and Suites. We had a wonderful time in Branson and were very well pleased with the Yellow Rose. The accomodations were new, clean, well attended and comfortable. There was a pillow top on our bed which made it extra comfortable. The price was right as well. The breakfast room was well attended by a mother and her adult daughter who made everything easy for you, including even making waffles for you. My only complaint was no fruit. My hat is off to all of the staff, The general manager and the owner M. D. Weill.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Downers Grove, Illinois", "Title": "“Found a Gem!”", "Author": "jwoge", "ReviewID": "UR119968171", "Content": "We usually stay out at Emerald Pointe but for quick trips (1-2 nights) we tend to find a place in town. In the past we have stayed at other motels in Branson but we tend to go back to our chain favorites since none of these other motels (although good) have the amenities we enjoy. We were a bit disappointed to find our #1 & #2 choices booked. After reading the reviews on Yellow Rose we decided to give it a try. I am pleased to report that the reviews here are very accurate. The motel is off the beaten path of 76, which is a very good thing. Our king suite was comfortable and more important, immaculate. The folks in the office are very pleasant and helpful. The breakfast was more than \"continental\" with offerings like waffles, eggs, cereals, pastries. All in all we enjoyed our stay and would go back. The only downside is they don't accept pets for those who travel with their extended familiy.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kirksville, Missouri", "Title": "“Branson Visitor”", "Author": "Dennis S", "ReviewID": "UR119912983", "Content": "Our stay at the Branson Yellow Rose Inn & Suites was a great value. Our room was very clean and quite. The staff was great and very helpful in getting us show tickets on short notice. Can't forget to mention the free breakfast every morning (includes waffles and biscuits & gravy).", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Very nice,clean”", "Author": "travelinmimi", "ReviewID": "UR119893435", "Content": "I and some of my family stayed at the Yellow Rose Inn 2 days ago and found it to be very clean and comfortable and an excellent value.The beds and pillows were every bit as comfortable as those at a Marriot that I recently stayed at.The breakfast was very good with a good variety and a staff member who even makes the waffles and serves them.I would highly recommend this motel.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tunica, Ms", "Title": "“Nice stay with one caveat”", "Author": "tonka11_99", "ReviewID": "UR119720069", "Content": "I recently stayed at the \"Yellow Rose\" and it was very nice. It was recently renovated. There was a nice looking pool. They even serve a free breakfast with waffles and eggs albeit hard boiled eggs. They are off the main drag which, trust me is an advantage. It gets very busy on that main drag. The \"Yellow Rose is also very inexpensive. Our room had a small refrigerator with a freezer section (handy for freezing cold packs for coolers), a microwave and a coffee maker. All in all, I would highly recommend the Yellow Rose. I have one caveat. If you need a ground floor room because of mobility issues, you may want to consider another place, You have to walk up about 8 stair steps from the parking lot and there is no elevator. My wife has C.O.P.D. and back problems so it was difficult for her.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shakopee", "Title": "“Wonderful hotel and bistro”", "Author": "Sherla M", "ReviewID": "UR119600904", "Content": "We stayed at the Yellow Rose for six nights and had a wonderful experience. The rooms were clean, well appointed and very quiet. The housekeeping staff is top notch and did a great job cleaning the room each day. The Inn also has a bistro that serves a complimentary breakfast. Breakfast includes freshly made waffles, fresh pastries, hot and cold cereals, toast, juice and coffee. The bistro is run by a mother/daughter team who are about the sweetest two people you would ever want to meet. We will be staying again at the Yellow Rose. You should too! You won't be disappointed!!", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfield Bay, Arkansas", "Title": "“Great Hotel”", "Author": "Dorothy T", "ReviewID": "UR119521742", "Content": "We went to Branson for two nights. First night stayed at Howard Johnsons and was not pleased at all. Checked out the next day and I had seen the sign to Yellow Rose the day before so we decided to check it out. We ask the desk clerk if we could see the room because we just had a bad experience the night before with a bad room. She was very nice took us to see the room and it was a king bed with a very nice comforter the room was very clean. The room we stayed in the night before was more expensive and it didn't have nothing but a little coffee maker. The room at Yellow Rose had a microwave, fridge and coffee maker. The bed was so comfortable and one of the most important things the room was so clean. Had a very nice clean pool and a nice gazeboo with wicker furniture. My husband I sat out there to eat our breakfast. The staff was very friendly. We will definitely stay there again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grandview, Missouri", "Title": "“What a wonderful hotel! The rooms are Super Clean!!!”", "Author": "Sue H", "ReviewID": "UR119410681", "Content": "We came down from Kansas City to Branson for a business seminar and were SO pleased with our stay. The hotel staff was very friendly and helpful! And our room was perfectly clean! We felt very comfortable there! If we come to Branson again - we definitely will come back and stay there again!", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Arkansas", "Title": "“Spotless and Quuiet”", "Author": "Travel501", "ReviewID": "UR119339236", "Content": "We stayed here two nights. Bedding, carpet, furniture all new. Sink/bath spotless. Front desk very friendly and very apologetic: If you arrive after 10pm have them recode your room key or you'll have to make a trip back to the office like we did. Something about the lock resetting if not used before 10pm. Only downer was the continental breakfast area. Offerings are OK, but the area seats perhaps 20 or so, and getting to the food through the tightly packed seating is a chore. We went down the street to Uptown Cafe- $5.99 buffet- very good. The Yellow Rose is easy to get to, in a quiet spot. We'll definitely stay here again.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fayette MO", "Title": "“Very nice room”", "Author": "sunshine0046", "ReviewID": "UR119272513", "Content": "We only stayed one night at the Yellow Rose Inn and will definitely stay again. We found the room to be very clean, the beds very comfortable and having a refrigerator in the room is a big plus. The towels were thick and fluffy. Also I appreciated the desk and comfortable chair for working on the computer. The motel is in a quiet setting and the staff was very friendly. The only thing keeping me from giving this motel a 5 rating is that the young man I spoke to on the phone didn't tell me the coupon I had wasn't good for the walk-in level rooms, only the upper floor. The girl apologized the next morning about the mistake. It is still a very good value for the room and we will be glad to stay there again.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This was a very pleasant surprise!”", "Author": "shiningspark49", "ReviewID": "UR119159972", "Content": "We only stayed one night but would definitely stay again. The rooms were clean & fresh. The linens, including the bedspreads and towels were like new AND best of all the mattresses were extremely comfortable.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poplar Bluff, MO", "Title": "“A very comfortable hotel at a reasonable price”", "Author": "PBSpeakeasy", "ReviewID": "UR119123546", "Content": "We just returned from a 3 nite stay at the Yellow Rose Inn in Branson. This hotel was an excellent value. We are a 50ish couple who don't really want to be in the center of the action, but want to be close enough to get there easily, and this place was perfect for us. It is quiet, the beds are super comfortable, the room and hotel were clean and well maintained, and it includes a continental breakfast. The price was reasonable for Branson, and we saved $10.00 per nite with a coupon we printed off Trip Advisor. The hotel is located off the beaten path in a quiet area, but is just a couple of blocks from Hwy. 165, one of the major arteries in Branson, and it is about a quarter of a mile from Green Mountain Drive, one of the traffic relief alternatives. If you have been to Branson, you know about the traffic at all times of the day and night, so this location was really handy. The room includes a fridge, microwave and one cup coffee maker. The only thing that was disappointing is that the shower, while clean, had very low water pressure. It took a long time to shower just because the water came out so slowly. The breakfast had the usual stuff--waffles, bagels, cereal, toast, donuts, milk, juice, and coffee. All in all, this was an excellent choice.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jonesboro, Arkansas", "Title": "“Quiet, friendly, very nice stay”", "Author": "Keith R", "ReviewID": "UR119072652", "Content": "Staying Oct 7-8, 2011. Room renovations are great. Excellent decor and bed is very comfortable. Great location, out of the main traffic but very close to everything. Extremely quiet. Hotel staff is very friendly and helpful. Great breakfast. I have recommended to my parents and children already. Will stay here again.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wichita Falls, Texas", "Title": "“GREAT CHOICE”", "Author": "Derrek B", "ReviewID": "UR118978650", "Content": "We stayed for 4 nights. And enjoyed every minute. Although most people come to Branson NOT to stay in the hotel/room, but to get out and see every show and shop available. The location and beauty of this place is just wonderful. I/we wish our schedule wasn't so full ! We could have experienced GOD's wonders more. The ladies in the breakfast area were AWESOME!!!! You didn't have to ask for assistance; they were asking to assist you. GREAT JOB by Nancy (the manager) on assembling a WINNING TEAM. This will be our #1 choice on our return visits.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Holton, ks", "Title": "“Will stay again”", "Author": "M1ke22", "ReviewID": "UR118865021", "Content": "This was our first time at the Yellow Rose and it was a very good stay. The rooms are very clean and the beds are very comfortable. The ladies in the breakfast were very helpful and very willing to meet our needs. It was a very quite motel off the strip which was great for us. The one and only fault that I could find was the shower was a little low for me. For the majority of the people it would be just fine. Plan on staying there when we come for the Christmas shows. I loved the large 40in. TV in the room as we were able to watch the football game before we went and saw the amazing TEXAS TENORS.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lees Summit", "Title": "“Hotel Quality and Service....Excellent!!!!!!!!!!!”", "Author": "S M", "ReviewID": "UR118799907", "Content": "I usually stay at one of the motel or hotels on the strip... This place is off the strip and 165 is a few blocks over.. I stayed here for 5 nights and it was an excellent choice.. The place has been recently remodeled in May and the breakfast attendants were the best. I have never stayed at a place where the breakfast attendant made your waffle and brought it to you.. We we arrive greeted promptly and staff even helped us bring our luggage up to our room... The reason that they helped us is because they saw us at the stairway going up with all of our stuff. The breakfast was excellent and the room was as well. There are 40 inch tvs, new beds, bedding, and excellent service..Room includes microwave and fridge. I am going to stay here again when visiting Branson.. The lighting at night was great and there is plenty of parking..Use the travel buddy book for discounts.....", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Quiet and comfortable”", "Author": "southsidehog", "ReviewID": "UR118395514", "Content": "If you want a place away from the traffic of Branson's main drag, this is the place. Very clean and comfortable with pillow top mattresses that made me want to stay in bed all day. A good restaurant just down the street is convenient. Can't beat the price for the cleanliness and comfort.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jackson", "Title": "“Would stay at this property again”", "Author": "Susan H", "ReviewID": "UR118393335", "Content": "Am often hesitant of booking online site unseen, but the recent reviews convinced me to give the Yellow Rose a try. I'm glad I did! This property isn't fancy, but it's very clean and the beds were comparable to those in much pricier establishments. Add in the fridge and microwave in each room and you really can't beat the value of this property. The only thing I would improve on would be a few more options for breakfast. A couple of fresh fruit options would be nice. Overall we were very pleased. This property is tucked back in a quiet location which is a pro if you don't like the noise from the strip. The downside is that it's not actually on the strip if you'd like to be able to leave the car in the parking lot. Looking forward to returning to Branson and the Yellow Rose!", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Nice Place - Newly renovated.”", "Author": "StLoueyGal", "ReviewID": "UR118012800", "Content": "I've stayed at the Yellow Rose several times and this last trip was the best. This property is under new ownership and has recently been updated. Rooms have microwave and fridge, flat screen TV and pillowtop mattresses. Everything has been freshened up and the service was great. We stay there because it's affordable ($50 range), they have a great outdoor pool; and it's off the strip away from traffice but close to everything, Excellent value for the money. I suspect prices will go up once more people discover it's been renovated and is so nice.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sunrise Beach, Missouri", "Title": "“Great accomodations at an affordable price”", "Author": "Tina M", "ReviewID": "UR117747359", "Content": "We just spent three nights at the Yellow Rose Inn & Suites and were pleasantly pleased with our choice of lodging. Although it was a little tricky to find, once we got there it was a pleasure. The location is extremely quiet yet close to all of the attractions. Its location makes it possible to get where you want to go without sitting in all of the traffic on 76. The room was clean, the pillow top beds in the King Suite were extremely comfortable and the addition of the refrigerator & microwave was an added plus. The staff was friendly & very helpful! After years of spending twice the price for a room elsewhere, we will be staying at the Yellow Rose in the future.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Byron, Illinois", "Title": "“One of the best!”", "Author": "35745Pat", "ReviewID": "UR117678488", "Content": "Very clean rooms, recently redone so everything was new. Frig and microwave in every room. Staff was exceptionally friendly, breakfast was great. Quiet area.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Hominy, Oklahoma", "Title": "“Cleanest ROOM ever!!!!!!!!!!!!!!!!!!!!!!”", "Author": "brandi s", "ReviewID": "UR117143025", "Content": "It was a great place to stay except(pool did not open early enough and stay open late enoughfor my kiddos) and I would love to come back when I vacation there in Dec. but no indoor pool. the beds were out of this world!!!!!!!!!!!!!!!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Great place to stay”", "Author": "jerryredpath", "ReviewID": "UR116422365", "Content": "We stayed at the yellow rose August 2-5/2011 on vacation. The Rose was spotless all the time. The staff was very good and curtious with us and the other guests. The rooms we had were very nice and very clean. We had no problems at all. We will go back there on our next trip to Branson.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Smith, Arkansas", "Title": "“...a must stay, if your in or near Branson”", "Author": "janiepo", "ReviewID": "UR116400068", "Content": "Our family travels to Branson about six times every year, we have stayed ay various places from $29-$299, this is without a doubt the best all around value in room comforts by far, pillow tops,large flat screens, super nice bedding, refrig. /mirco., top breakfast, did I forget the staff, there the best in Branson. Don't look no further, no disappointments here, super quiet also. Janie , from Fort Smith, Arkansas", "Date": "August 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice place for the money; will return”", "Author": "longdog100", "ReviewID": "UR116235655", "Content": "Branson is a great place, its the only place I know of with so many decent and inexpensive places to stay...the yellow rose has lots of excellent competition but their recent \"paintjob overhaul\" has given them an edge over others. Most important, this place was spotless. For me, this is key. Other reviews call the rooms large however I would consider them average siziie. In fact,the new 40 inch flat screens are actually too large for the rooms. Still, lots of value here for 50 bucks a night with the nice tv microwave refrigerator new carpet, and wireless internet...did I mention its super CLEAN??? I love the location of this place . I do not like to stay on the strip , it was very quiet here . a rare treat , they supplied nice pool towels - make sure to go to the office to ask for them as they're not at the pool . pool was nice although much smaller than the pictures look like . someone has nice photo skills . Contrary to other reviews the included breakfast was lackluster. We stayed for almost a week and after the third day we decided to go elsewhere.4-5 cold cereal choices, thawed frozen donuts, hard boiled eggs , toast, waffles, or biscuits and gravy are your options . the waffle syrup was not good and the biscuits were unusually hard - but the gravy was better than expected . Just remember, you're paying 50 bucks for a room and breakfast - value here is in the room - the food is a bonus. We will be back!", "Date": "August 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wow! What an unexpected great value!!!!!”", "Author": "Eaglesredsox", "ReviewID": "UR116062108", "Content": "When my wife told me she changed our hotel just a day before we were to begin our week vacation in Branson, I was hesitant. As a creature of habit, I don't like change. Yellow Rose only gave me reasons to want to come back. After only one night, even our children said \"Can we come here from now on?\" Large comfortable rooms, soft beds with nice clean linens, large flatscreen tv, coffee maker, microwave, fridge, large curved shower rod, great clean pool, amazing breakfast!!!! But the best part of all (besides the price) was the friendly staff. The ladies serving breakfast were smiling as they made our waffles or cleared our empty plates. Even the room cleaning crew would graciously come back at our request if we needed a little extra time to sleep or hang out in our room. They provided extra blankets at our request and during the day we could always find one of the workers to meet a toiletry need in our room. Best value ever in Branson. When our time share is not available, we will always come to Yellow Rose from now on!", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“we loved it so much and did return.”", "Author": "stoneyice", "ReviewID": "UR115714726", "Content": "We had our vacation planned at a different hotel. We decided to come down a day early and on the way down we called yellow rose and got a room for that night. I was so impressed. What a professional staff and clean, bright place. Everything was bright and updated. It had a mini fridge and microwave. They even had large beach towels. This place was exceptional. The only reason why we did leave was a paid commited we had to another hotel. We stayed at the other hotel for 2 days and came back to the yellow rose and stayed an extra night there. It was quiet, clean, updated and an extremely professional well groomed staff. Thank You Yellow Rose we will be back.", "Date": "July 24, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Nice little motel”", "Author": "Korn74", "ReviewID": "UR115662556", "Content": "This motel was a little hard to find but well worth it. It's away from all the traffic of Branson but close enough to be right there. It's nothing fancy but it's well run and you will not be disappointed if you stay here. Beds were extremely comfortable. TV was a large flat screen and I was very impressed by it. Breakfast in the morning was great. Thank you for a great night's stay.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Savage, Minnesota", "Title": "“We all loved it!”", "Author": "makufs", "ReviewID": "UR115650139", "Content": "We had five rooms (10 people) booked in our group. We all appreciated the cleanliness and upkeep of this motel. Everything was newly remodeled. All the amenities you would need are in the rooms. Super comfortable beds! A great pool and area! They had a very nice breakfast and their hospitality/friendliness was outstanding. They really went the extra mile trying to help us out with the attractions in the Branson area. We had one handicapped room which was very accommodating also. Don't let the bargain price fool you on this one! We are hoping to make this an annual trip.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great Choice”", "Author": "dkny7", "ReviewID": "UR115632266", "Content": "The Yellow Rose was a super clean and enjoyable place for us. We loved the bright colorful decor and the king bed was sooo comfortable. Having a new microwave, refigerator, and flat screen T.V. made the room. Our hot breakfast at the Bon Appetite Cafe made breakfast a no brainer. We will be back for sure.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Salem, Arkansas", "Title": "“Great hotel”", "Author": "Tinajeffco", "ReviewID": "UR115486190", "Content": "This hotel was recommended to us before we chose a location to stay for our weekend getaway with the kids. I would highly recommend it to anyone wanting to stay in a very clean, privately located, inexpensive hotel. We are not into paying $100 + a night for a room where all you do is sleep there. The owners were extremely friendly, breakfast was home made & wonderful & the room was everything we needed it to be for approx $50 per night. Everything was excellent & we will be staying here again.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Maynard,Ar", "Title": "“We will return.”", "Author": "bigdaddyMaynard_Ar", "ReviewID": "UR115484439", "Content": "I have been across our great country and this place was the best yet.The room was very nice and the service was second to none.Thanks for a weekend to remember.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Star City, Arkansas", "Title": "“We loved it and we'll be back!!!”", "Author": "SnoopyMc", "ReviewID": "UR115292651", "Content": "We had a wonderful time!! The hotel staff is amazing!! They are always smiling and friendly. They were all eager to help with anything we needed. The rooms are great! Everything is new and completely remodeled. Nancy is a great manager and attends to the guests with a nice and professional attitude. The breakfast is very nice. You wiill enjoy Irene and her hospitatlity. The pool is very clean and convientient. The grounds are beautiful!!! You will enjoy your stay!!", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cave City, AR", "Title": "“Great place to stay!!”", "Author": "Cynthia040", "ReviewID": "UR115162697", "Content": "This place is worth the money! Rooms have been updated and are super clean. All rooms are smoke-free and have microwaves and refrigerators. They serve a really good breakfast every morning and the workers are very nice! This was our second time in the last 4 or so years to stay - we will continue to stay there as long as they are in business!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Huntsville, Arkansas", "Title": "“Nice place and very nice stay”", "Author": "msspur", "ReviewID": "UR114626862", "Content": "Stayed here on a referral from a friend and was not disappointed! It was a little off the beaten path, but that's what we liked! It was a quiet setting but didn't take long to get anywhere in Branson. The room was VERY CLEAN!! The staff was super friendly and the grounds were well kept. Great breakfast available and the girl taking care of the breakfast room is the best! Plan on staying again in about 3 weeks so that says a lot!! Have already referred others to the hotel as well!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Scott, Kansas", "Title": "“Very, very nice, clean, newly remodeled motel!”", "Author": "fortscottperson", "ReviewID": "UR114579984", "Content": "We stayed 2 nights with the Branson Yellow Rose Inn. Wish we would have had time to stay more, but we will be back! Newly remodeled, pretty room, lovely continental breakfast area. The ppl are really nice. This place gets a '10'! I'm telling all my friends! It should be called the Pink Rose Inn, the new pink color is pretty!", "Date": "June 20, 2011"}], "HotelInfo": {"Name": "Branson Yellow Rose Inn and Suites", "HotelURL": "/ShowUserReviews-g44160-d278900-Reviews-Branson_Yellow_Rose_Inn_and_Suites-Branson_Missouri.html", "Price": "$69 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3140 Falls Parkway</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> (Formerly Branson's Yellow Rose)</span></span></address>", "HotelID": "278900", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/79/9d/7b/swimming-pool.jpg"}}