{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "elverum", "Title": "“Good and nice”", "Author": "Tom O Posted by an Easytobook.com traveler", "ReviewID": "UR127616832", "Content": "Close to Tram isy traveling to center of Barcelona. Close to Metro to travling after going of tram. Its out of center of town so you must travel to get to town but use tram to travel whith- Nerest tram station is only 5 minuts of walking and the tram/metro you can travel to all of barcelona.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Misleading description, terrible customer service.”", "Author": "RSBrooklyn_NY", "ReviewID": "UR127372534", "Content": "I booked this hotel for a few days. I knew it was a little bit out of the way, but decided to stay here - as opposed to something more central for the same price - because of the amenities - specifically the fitness center with jacuzzi, wifi, and restaurant. Upon check-in, I find out that the \"free wifi\" is only given in 30 minutes, and only good for the lobby. Next I went to the \"fitness center\", hoping for a good run and maybe a soak afterwards. What was actually there was a jacuzzi that looked like it probably hadn't been functional for at least a year with a sign on it saying \"not working\". Ditto for the saunas. Went to get on the treadmill - the belt was busted and warped. Tried the bicycles, neither were working. Figured I'd check with the staff - they pretty much shrugged their shoulders. Asked them about the restaurant - turns out the \"restaurant\" is just a buffet breakfast bar. So basically, all of the amenities which made me choose this hotel were not available. I tried to get some sort of rate reduction, or at least a voucher for wifi in my room, and the girl working the desk just kind of shrugged and rolled her eyes. Asked if there was a manager, she said no one would be available until Tuesday (this on Friday) because of a \"holiday\". What kind of holiday means that no hotel manager is available to handle guest needs for four days? Too bad, I had heard good things about NH hotels and thought I would be in good hands. I travel regularly for work and have to say, this is probably the worst customer service I have ever experienced at a supposedly reputable hotel. I've stayed at hostels where the staff was more concerned with guest satisfaction!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Swindon", "Title": "“Excellent Service, Poor Location”", "Author": "Kdizz23", "ReviewID": "UR122472570", "Content": "Having booked a trip to Barcelona for my Boyfriend, I was very excited. The hotel was only about 20 minutes transfer from the airport using a shuttle bus (organised through Thomas Cook). The hotel was perfectly clean, cleaned everyday with new towels whenever requested (if you left them on the bathroom floor) It had a free safe to use that you could set the code yourself, a TV, Bath and shower, and wardrobe. It was probably the first hotel I've ever stayed in that had piping hot water!! It was fantastic. In addition to this, the service was impecable! on arrival the receptionist gave us a map and identified all transports links (bus numbers, tram numbers) and wrote on the map the stops. During our visit my boyfriend got food poisoning and was really poorly; the lady on reception helped me translate with the cleaner to get new sheets, as well as drawing me directions to the pharmacy (approx. 3 blocks away) and telling me the words I needed to know in Spanish. The only negative aspects of the hotel is the distance from Barcelona centre. The hotel was very close to the Camp Nou football stadium, but was a 35 - 55 minute bus journey to the centre and la rambla. It was ok for us as the buses are easy to use, however, it may not be as easy for someone travelling with children as, like the UK, buses can get congested during peak times. The only negative for the room was there was no kichenette, or tea making facility in the room. Overall the holiday was brilliant (bar food poisoning), and Barcelona is beautiful, the hotel was absolutely perfect, just too far away. There are other NH hotels in Barcelona, so would 100% recommend staying in one that is closer to the city.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "belfast", "Title": "“Good point to start from in the morning”", "Author": "wondermash", "ReviewID": "UR108683595", "Content": "Spent Easter 2011 in this hotel. It's very functional, clean and for Barcelona CHEAP! Staff were fantastic, very helpful and friendly. Its about 40 mins on the bus to centre of Barca but good regular service up to 11:00 pm then the night bus takes over. The Restaurant was closed the who time we were there except for breakfast which at 12 euros I felt was over-priced. There is a fantastic small coffee shop about 5 mins from the hotel, in the main street, where you can get coffee and croissant for 3 Euros. They also do wonderful sandwiches for lunch - very fresh and cheap, great cakes also!! Would stay again if I go back to Barcelona. My son really enjoyed the gym and Jacuasi. Wi-fi was not free but thanks to the guys on reception for the free codes - 30 mins per day per person.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“If you're a tourist this hotel is lovely but too far away from Barcelona!”", "Author": "flower1111", "ReviewID": "UR85755957", "Content": "We were told by Fleetway travel that this hotel was only 10mins from the Bus stop and a 'short' 20 mins ride into Barcelona - yes it wasn't far to the bus stop but it took AT LEAST 50 MINS to get into Barcelona. This was a regular time and it never changed during the 5 days we did the trip so you could say it was consistent but far too long. The bus only cost £1.40 which was a maximum charge thank goodness. It was like living in Epsom and travelling into London by bus - Hard Work, and not what we had asked for or wanted to do on a leisure holiday! However the hotel was fairly reasonably - it was very clean, breakfast was delicious, there was food available in the evenings but only after 7.30pm. Although room service menu was minimal we ordered a sandwich and chips but the chips were cold by the time they arrived. The place was quiet and seemed deserted mainly and we only saw other guests at breakfast, sadly we heard them through the thin bedroom walls but this was only a problem on one occasion during our stay. The staff were friendly enought but just the usual hotel staff pleasantries. We had been given the wrong room but they were unable or unwilling to give us a double bed until the following day and we spent most of the morning waiting for the room we had booked to be cleaned and available for us to move our luggage into. We were too tired to argue the toss on the night we arrived as it was nearly midnight so we ended up unpacking and repacking to move. There is a fitness centre but this is only available when staff are available in the mornings only. Barcelona was fantastic and there are lots of other hotels in the area I would suggest finding an alternative. We enjoyed Barcelona enormously but wouldn't use this hotel again because of the obvious reasons. Hope this review helps others before they book it because I didn't find them until too late.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Guatemala", "Title": "“Not in Barcelona”", "Author": "DannyRoman", "ReviewID": "UR52455180", "Content": "For family reasons, I stayed in NH Barcelona for 3 days. The hotel is located in San Just Desvern, a community in the outskirts of Bacelona, aprox a 40 minutes commuting using Tram and Metro. The hotel is clean. The rooms are confortable BUT the walls are paper thing, TRUST ME! The first night I heard a concert (moaning) from my neighbours room. Every time someone enters their room you can hear their footsteps, if they talk, cough or use the toilet you will certainly hear them as if they were right in your own room. The breakfast was ok, nothing special for the 10.50 euros they charged. The hotel doesn´t have internet access, so you have to pay to an external server if you want conection, 10 euros daily.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“Tourist in Barcelona? Forget it!!!”", "Author": "oldbones", "ReviewID": "UR48696483", "Content": "I booked a four day stay through Venere at the porta Barcelona. I read the description both on the NH hotels web site and Venere website. Both sites gave the impression that this hotel is ideal for tourists, being only a short distance to central Barcelona.I believe Venere were given their facts by NH Hotels. Nothing could be further from the truth. As with the majority of reviewers on this site ( with the exception of DC World citizen, who appears to have a Spanish twang to their american grammar?), I believe this hotel to be unsuitable for tourists to the centre of Barcelona. We arrived on our first night at 1140pm having just paid 25euros for a taxi from the centre of Barcelona to the hotel, the driver having told us\" this hotel long way out\", We were checked in by a very pleasant young lady by the name of Sandra. We asked if we could get a drink, but were told that the bar was closed. We asked if there was anywhere close by but were also told that there would be nowhere open We went out anyway, to find the whole area deserted. The hotel is clean and smart, sterile in fact, but the good points end there. No service ,facilities closed most of the time and located in a ghost town. .I found this hotel to be so far out of the main tourist area, that, in the morning during rush hour, with all the waiting around, a journey of one and a half to two hours each way was nearer to the truth. We returned to the hotel after our first day in Barcelona having spent half of it travelling to and fro and told the reception that we would be checking out. They said that they could not refund any charges for the next three nights ( they had already charged my credit card on arrival) as I had booked with a no cancellation clause!! I pointed out that I believed that they had misrepresented the hotel in their description but to no avail. The staff were rude and obstructive, and at one point left me standing for nearly twenty minutes mid conversation, having answered the telephone. We left anyway and booked into the Montblanc Hotel in central Barcelona. great hotel (see my review). I believe that this hotel offers a slightly reduced charge with the no cancellation clause, because so many guests find as I have, that this hotel is a complete waste of time and money if your aim is to see the sights of Barcelona so beware. On a positive note. I made my complaint known to Venere, who having tried, to negotiate on my behalf with NH Hotels with no result have offered to refund the three nights As they had repeated the description given on their web page, they felt that customer service and was all important and I would recommend Venere to anyone wishing to book with confidence that problems will be dealt with reasonably", "Date": "November 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Hamburg, Germany", "Title": "“too far away from downtown Barcelona”", "Author": "Terence_Hill", "ReviewID": "UR23262601", "Content": "I stayed in this hotel for 5 nights during a business trip. The hotel is located in the outskirts of Barcelona. If you want to go to Barcelona for a city break, I would definitively not choose this hotel. It is too far outside. There is a tram station approx. 10 min. walking away from the hotel. It takes you to the metro station (after approx. 10 stations) that brings you into downtown. In total it takes almost 1 hour. The hotel itself is ok. My room was spacious and the staff was very friendly. There is not much to see or do outside the hotel, you also won’t find shops there. If I would go to Barcelona on personal matters, I would rather choose a hotel closer to downtown.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA-Europe", "Title": "“Friendly, Tasty, Comfortable, Convenient and WiFi”", "Author": "DC-World_Citizen", "ReviewID": "UR7985764", "Content": "I stayed for a week in June at NH Porta Barcelona and had an excellent experience. I rented a car at the airport and drove there within 10 minutes. The hotel can be seen from the motorway. The #1 priority for me was good working high speed interenet connection. My room had a strong WiFi signal and I never had any connection problems. The food in the restaurant was delicious and very modestly priced. The service was excellent and friendly. My air conditioning worked perfectly, bed was comfortable, good windows blocked all outside noise from the motorway, and the room had a good, working safe sufficient to hold my laptop and more. The area where the hotel is located is a quiet and safe. Although I had a car, I used public transport for two days to explore the heart of Barcelona where driving and parking is more of a challenge. There is a bus stop 2 very small blocks away (3 minutes walking) and from there you can reach the tram, underground or go on with the bus. It takes about 5-10 minutes with the bus to reach Av. Diagonal where the shopping malls and sightseeing begins. There is also a very complete supermarket 2 stops away with the bus (5 minutes). The beaches to the south are easily accessible from here if you rent a car, as I did, and you can be outside of Barcelona on beautiful, clean beaches in 15-30 minutes depending on how far south you want to travel. The staff in total had English good enough to fill in the missing words in my Spanish and they were always polite, helpful with information, suggestions, and in total, made for a positive experience. They were also genuinely interested to know if I enjoyed the beach/restaurant/location they helped me to find. I personally found this hotel to be an excellent choice. It is true that the restaurant does not open until 8:30 for dinner but there is room service and pizza delivery available. Most restaurants only serve dinner from 7:30 on. This is normal in Spain, although fast food is always available.", "Date": "June 25, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "PA", "Title": "“Nice place, but lacks some basic necessities”", "Author": "MK96", "ReviewID": "UR7284420", "Content": "My wife and I are staying here as I write this review. We have been here for 5 nights. The hotel is nice, clean, and the staff is helpful. It is a little far from town. You can catch a bus (30 min), take the tram/metro (30 min) or take a cab. Our biggest complaints are that they did not have an iron/board; have a clock in the room; or provide currency exchange services. Restaurant does not open for lunch and dinner does not start until 8:30PM.", "Date": "April 5, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Jose, California", "Title": "“Far from downtown - no A/C”", "Author": "ixion", "ReviewID": "UR6788619", "Content": "I stayed at this hotel for 3 nights during the 3GSM conference. I do not recommend it. It is very FAR from downtown attractions. The taxi drivers do not know this hotel and this is a big problem as you will be driving around trying to find it. The room itself is new and modern, but on the small side. The problem is that nothing works properly. The hotel turns off the A/C to the rooms at this time of year (the A/C in my colleagues rooms was also off) and the rooms are way too hot. The safe in the room is permanently locked, when i asked, they said non of the safes work, you have to bring your valuables downstairs. The shower head spayed water all over the place. The lights in the room are all halogen and act like mini-heaters, after just 5 minutes, the entire room is very hot from the lights. Only some rooms have minibars; my minibar was not cold enough, warm beer. The bar downstairs is never open, what's the point? The front desk staff is very slow and do not speak any english. Pro: - modern room, bed ok - wireless internet (for a high fee of 17 Euro) Con: - no A/C, very hot room even in Feb - very far from downtown - absolutely NO restaurants or bars anywhere around the hotel - taxi drivers do not know this hotel, so you end up driving around and around until they can find it (this happend every day) - pillows not comfortable - lights heat up the room - bar in lobby is never open - minibar is not cold enough, only 2 beers in the minbar and they will not refill it NOT RECOMMENDED", "Date": "February 14, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Porto, Portugal", "Title": "“Very good value but out of hand”", "Author": "ip202659", "ReviewID": "UR3992699", "Content": "I stayed at the Porta Barcelona in mid August 2005. The hotel is located on the outskirts of Barcelona, nearing Sant Just Desvern if memory serves me right.is being built, at the moment the nearest one is Port d' Esplug If you're looking for a base to explore Barcelona then this hotel is too out of reach. Whilst a nearby tram station ues which is about a 10 min walk away. If you're arriving by car you probably won't find that to be a problem, but if you're carrying a lot of bags be prepared to face either an expensive taxi or a bit of a painful walk. I paid 53 Euros a night including breakfast and VAT. Excellent price for a city like Barcelona, even though that is a sub-standard (Express) NH hotel. Tram will take you all the way to Francesc Macia in about 15 minutes or slightly less, and from there you can hop to the centre of town. If you're looking for a good, cheap option in Barcelona and don't mind the distance, the Porta Barcelona should be good for you. But in general it is a little too off site to be worth staying in if you plan on visiting the city.", "Date": "October 4, 2005"}], "HotelInfo": {"Name": "NH Porta Barcelona", "HotelURL": "/ShowUserReviews-g187497-d279036-Reviews-NH_Porta_Barcelona-Barcelona_Catalonia.html", "Price": "$46 - $95*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avda Generalitat de Catalunya, 6</span>, <span class=\"locality\"><span property=\"v:postal-code\">08960</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "279036", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/da/d3/dad33360885631fd1af16a18763aa1435large.jpg"}}