{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newbury, United Kingdom", "Title": "“Clean hotel in great location”", "Author": "aukfrequenttraveller", "ReviewID": "UR139993299", "Content": "Location: As stated below, minutes walk from a tube station that has you in the centre of Madrid in 20 minutes (I found the tube to be clean, safe & reliable. Easy to use tube map similar to London's). Neigbourhood is fine - but only resturants I could find were fast food in nearby shopping centre. Taxi to/from airport cost about 30 euro's each way Room: I booked a double room for single use. Large room with lots of storage space, wardrobe etc. Double bed had firm comfortable mattress. Desk with chair, also an armchair included. Big bathroom with usual facilities (and nice strong shower in 5th floor room). View from hotel windows (two) was city & mountains. Customer service: Friendly reception, basic tourist advice only, but lots available in central Madrid tourist offices. Web Access: I only took a mobile 'phone (good receiption) & used the reception area PC once to check emails etc. about 2.5 euros for 30 mins. Was offered free wifi (if I'd wanted it) Other Didn't use the hotel for breakfast (cost was 10.5 euros per day extra to rate I paid) and not sure if they did evening meals - I ate reasonablty priced meals in Madrid center). Overall a good, clean hotel with value for money away from the hubub of the city centre with easy access to the city. Would stay here again", "Date": "September 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Fantastic value and HUGE rooms!”", "Author": "Joe S", "ReviewID": "UR136748408", "Content": "We stayed here for 2 nights while travelling around southern Spain in July. The hotel is located in a residential area of Madrid about 15 minutes from the city centre (Sol) but because of this the hotel is exceptional value for money! The area is newly developed and feels very safe, even after dark. The metro stop is 2 minutes from the hotel and takes you in to the centre very easily and quickly (the whole metro system in Madrid is very easy and efficient). There is a small shopping centre by the metro stop where you can pick up food/drink very cheaply if you don't want to eat breakfast/lunch out. We were welcomed by a very friendly receptionist and checked in quickly. As a summer offer we got a free bottle of wine and free late checkout which was a nice bonus. Our room was on the 4th floor so not quite high enough to fully appreciate the views previous reviewers have talked about but it was an enormous size! The room was air conditioned had a mini bar and everything else you could need. Overall I fully recommend this hotel for a short stay in Madrid, you would pay 3 times as much for a worse experience closer to the centre!", "Date": "August 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Donostia", "Title": "“Lovely hotel in quiet location, but convenient for metro”", "Author": "fishwebby", "ReviewID": "UR135129781", "Content": "Stayed here for one night in July. City centre hotels were stupidly expensive, but this one wasn't - it was clean, safe (they have a private underground car park for €10.80 a night) and the room we had was fantastic - huge, on the ninth floor facing north, so had a brilliant view of the Madrid skyline and the Sierra Nevada mountain range north of the city. Room was clean and had all we needed. If you like walking, it's about an hour's walk from the centre (past the bullring at Las Ventas, which is worth a look), or there's a metro station about 2 minutes walk from the hotel. Trains run regularly, takes about 20 minutes to get to Sol in the centre. Costs €2 but less if you get a multi-trip ticket. We only used the hotel to sleep really, so apart from the room and the staff (who were very helpful and nice), I can't comment on the other facilities, but if you want a nice place out of the centre (so it's cheaper), you can't beat it really. Try and get a high room if you can as the views are great!", "Date": "July 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Merseyside", "Title": "“Well located hotel”", "Author": "hbtn_kaz", "ReviewID": "UR131468743", "Content": "We stayed for 7 nights and found it was well placed 2 minutes walk from the Metro (10 minutes to the centre of Madrid) and the Carrefour Supermarket in the nearby Las Rosas Shopping Centre. It's a very residential area - but with some nice bars. Our room was well placed on the 6th floor overlooking some nearby gardens, the room was really big and had two large singles pushed together (we expected this from previous reviews though). The bathroom was marble throughout and the shower was super powerful - don't put it on full blast! Rooms were cleaned daily. There were 2 massive cupboards for all your kit and a safe (10 Euros refundable for the key), there was also a minibar with enough extra room to get in a box of chocolate croissants in from the supermarket. All in all it’s a lovely hotel, staff were really helpful and spoke good English, We would definitely stay there again - it is very reasonably priced if you shop around. Tips - The Carrefour Supermarket: On entering if you have a backpack, show it to the security guard and they will secure the zips. There is an English option on the self-serve checkout and it’s much quicker than the main queues.", "Date": "June 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“Unexpected pleasure!!”", "Author": "cornishlass25", "ReviewID": "UR130270594", "Content": "I booked this hotel through an agency and read most of the reviews on trip advisor, which were mostly good. I booked it an behalf of 8 people and was quite anxious before arriving at the hotel; all my fears were allayed as the hotel was of a good standard, being in a good residential area and the Metro only 100 metres away which gave good, quick access to the centre of Madrid. The rooms were spacious - almost a mini-suite - well furnished to include a mini-bar, t.v. and very clean modern bathroom. Food at the hotel was a little limited but there are plenty of local bars and excellent chinese restaurant within walking distance. Would recommend this hotel to anyone visiting the city of Madrid. Breakfast was also very good and all the staff were helpful and courteous. Well done, Hotel Silken Garden!!!", "Date": "May 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Blairgowrie", "Title": "“Excellent value and location”", "Author": "TonyMBlairgowrie", "ReviewID": "UR128387096", "Content": "We stayed for 5 nights in a very good sized, clean, and comfortable room. Very friendly staff. Plenty of variety in the buffet breakfast which was enough to keep us going until dinner most days. Breakfast served until 11.00 which meant there was no rush in the morning, which was especially good after a day's sightseeing or late evening in the city. 2 minute walk from metro which goes straight into the city centre. Hotel easily accessible from airport either by taxi or metro. Beware, however, of thin walls!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prague, Hlavni Mesto Praha, Czech Republic", "Title": "“Quite good value for money”", "Author": "Jan N", "ReviewID": "UR126111918", "Content": "Value for money hotel, 200 m from metro station, 20 min from city center of Madrid. Large and comfortable rooms, large bathroom. Cleaned well every day. BTW, it is very close to big Carrefour. Breakfast is monotonous, but tasty and sufficient. Excelent frontdesk service. Rooms in the main street are noisy.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Bristol, England", "Title": "“You get what you pay for”", "Author": "pete_wright16", "ReviewID": "UR126087684", "Content": "Myself and my girlfriend travel a lot. 7th time i have stayed in Madrid in 12 months. We were excited by reviews, particularly as hotel is very cheap, but you get what you pay for..! It was clean and tidy (although dated), which is ok for us. However, the worst bed I have slept in ever... It is amazing how much it dipped (like a semi-circle!!), it must have been very old. A functional bed is a prerequisite for us, just something where you don't wake up with a terrible back! Also, maybe just our bad luck, but noise and fights outside hotel did not help our stay.... But, Staff friendly and room is big... When new i am sure it was a nice 3* hotel. For a similar price, I would strongly suggest to stay at one of the many ibis hotels in Madrid which are cheap (all outside of the centre, like this hotel, and car needed).", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "manchester", "Title": "“Close to metro - best thing about it”", "Author": "NatRyan", "ReviewID": "UR125926518", "Content": "Not a bad Hotel, bedrooms are huge, but the tv did not work properly, and it got a little chilly at night with no real covers/duvets. Really close to the metro station - which is a great service, got a taxi from the airport and was charged 35 euro, bit of a rip off for a ten min journey - but i was tired. Next day got 3 day metro pass for 13 euro, excellent value. Madrid has great little bars/restaurants - We found one called la Evita - which was a little gem. Loved the Park and drinking coffee near the metropolis. Still think Barcelona has more to offer as a city for tourists. But thats just my opinion.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St Valerien", "Title": "“Value hotel on outskirts of Madrid”", "Author": "GaryTG", "ReviewID": "UR125405759", "Content": "It took ages to find this hotel - I had booked it through 'Booking.com' and the address it gave me was not acknowledged by my Tomtom! Once you get to the main road keep going, out of the city, until you see Carrefour, and it is on the right. If you want the garage you have to go right around it due to the one way system. This is not a central hotel but it is very easy to get into the centre using the excellent Metro system which is a few minutes walk - next to Carrefour. The rooms are large but over heated and my wife and I opened the windows and turned the heating off. Breakfast is good with a wide variety on offer. In some reviews I have read they state that there is no restaurant - wrong - there is with a limited menu but with the ease of the Metro why would you want to eat in the hotel anyway? For those who like 'fast food' there are more than enough outlets in the Carrefour centre if you want to come back to the hotel early. All in all a good valued hotel with it's limitations!", "Date": "February 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Another great stay”", "Author": "irenemHongKong", "ReviewID": "UR122387943", "Content": "We stayed in the Silken Torre Hotel for 4 nights. We got there from the airport by metro. Take line 8 to Neuvos Ministerios, change to grey number 6 circle line, change to the red line 2 at Manuel Beccera, travel in the direction of Las Rosas, gets off at Alsacia. You can see a hotel sign almost as soon as you get off. It is 3 minutes walk from the metro. Being on the red number 2 line the hotel is very convenient for most of Madrid's sights. There was only one person working on reception when we arrived and we had to queue for a while before getting to check in. This annoyed me because I was coming down with some kind of virus and was desperate to have a lie down. Anyway, the room was large and pleasant with lots of storage space. The in room safe requires a key. You pay a refundable 10 Euro deposit at reception to get one. The room had a TV, fridge, no free drinks were provided. The bed was very comfortable. We slept well. We received a free bottle of wine for booking the hotel through the hotels own website. We did not have breakfast at the hotel. The restaurant offered a good value evening meal deal, but we did not try it. The hotel offered free use of a pool in a nearby building. We would normally have loved this, but as I was ill did not use it. The reception staff got friendlier as our stay went on. we asked for a map and were given lots of information, too. The receptionist printed off our boarding passes for us on our last day. Free wifi was available throughout our stay, just ask for a username and password at reception. It is valid for 3 days then you get another one. There was a huge Carrefour supermarket near the hotel. We could hear other guests moving around, talking etc during the day, but the hotel was quiet at night. I would stay here again. Best thing about the place is the ease of access to line 2 of the metro.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aussie in UK", "Title": "“Good value for money”", "Author": "AUS_MAP_IT", "ReviewID": "UR121881708", "Content": "Hotel was very good value for money. We booked it because we wanted to be near the centre of Madrid and the conference centre (near the airport). The hotel was close to the metro station 5 minutes walk if that. There was also a shopping centre near the metro station, with a supermarket, a food market with lots of spanish cheeses and meats, a food court and basic clothes shops. The hotel itself was very clean, the room was spacious with a lot of cupboard space! The room was cleaned everyday. There were shutters on the windows so you can block out the light! The only thing we did not like was that the bed was uncomfortable. The mattress was hard and sloped into the middle. I think they need new mattresses! Overall though we would recommend the hotel for its location and value for money.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Very good choice for the money”", "Author": "Marinada11", "ReviewID": "UR121831396", "Content": "Hotel is not situated in the center, but metro station is very close. Rooms are clean, breakfast was fine. We lived in the suite room, little bit expensive like normal room, but we recommend this type of room.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“Truly excellent”", "Author": "jklivintraveller", "ReviewID": "UR121758638", "Content": "It is only sensible to start wondering, seeing a 3-star hotel in the 65th place of all Madrid hotels, what is going on there. What kind of place this is. Seeing the hotel photos, also magnifies your desire to first hand experience staying in Silken Torre Garden, considering the attractive offers available. When I first got there and saw the hotel from the outside, I have to say I was a little concerned, since I was awaiting a shining skyscrapper, from what i had seen in the photos. But these expectations, of course, were not logical. There must be some reasons to typificate this hotel as a three star after all. Went inside, and checked in two hours earlier than normal. Every reason to be grateful about that, of course. Used one of the 4 (satisfyingly fast and ok seized) elevators, and got to the 9th floor, where my room was. I was amazed by my room. It was truly fantastic. I've payed more in the past to stay in worse places, claiming themselves 4 or even 5 stars. But this room was excellent. Very big-could be a small apartment, with well-seized windows, from which you could enjoy exceptional view. The bathroom was large as well, and all made of marble. I felt like living in a New York sky scrapper. Now, talking about the stuff, could not have any complaints, they helped me with whatever I wanted and were polite and professional enough. Room service was ok too, providing what necessary in time. Breakfast was another advantage of this place, and I have to say that it was the richest I've ever had in 3-star place. It is clear in this hotel that the people working there, from the hotel manager to the cleaning ladies, are doing their very best to make their place the best it can be. The only disadvantage could be the location. Or, better, it is not a disadvantage, but could not characterized as advantage, too. There is a very close metro station (Alsacia), which is on the red line, and connected directly with central stations (Sol, Opera etc). But it is a little far. Only a little. It is a 20 minute trip from Puerta del Sol to Alsacia. If you don't care about this, Silkent Torre Garden is the perfect place for you-and in a price that could be characterized as bargain.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Bucharest", "Title": "“Average hotel at the correct price”", "Author": "Liriodendron10", "ReviewID": "UR120808030", "Content": "Even the hotel is not situated in the Medrid center you can use the metro nearby directly -20 min maximum- 7-8 stations au to Puerta del Sol. The hotel is quite old with an old furniture but the rooms are big and clean although is better not to choose a room not situated in front of the hotel at the street - do to the noise. The breackfast is quite good and the customer service is very good -they were very friendly. The wifi is free but the dowload speed is very very slow.. The price is correct for quality - we pay 60 Euro for 2 with the breackfast included.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "picassohdi", "Title": "“Comfortable, Good Location, Helpful Staff”", "Author": "picassohdi", "ReviewID": "UR120626723", "Content": "Well located near a metro stop and a shopping centre; very nearby a lovely Chinese restaurant thats amazing value. Rooms are absolutely spotless and kept that way by daily cleaning. Good size though our double had 2 singles pushed together!! Staff were always willing to help as much as possible. Breakfast is about average and I would not pay more than £5 per person for it but it was was fine. Only downside is you can hear neighbouring residents in their rooms moving chairs/ using bathroom.. slight disappointment but not enough to recommend this efficient, pleasant, quiet base from which to explore Madrid.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tirana, Albania", "Title": "“Perfect stay, if you don't mind a 15-20 min metro ride to the center”", "Author": "Kami_Albania", "ReviewID": "UR120199539", "Content": "We liked the hotel very much :)). Comfortable , big marble bathroom, daily room making, excellent breakfast, helpful staff. The lunch at the hotel restaurant with only 10 euro for a three course meal, water including, was delicious and of great value. I wished they had the restaurant opened for the dinner also. If you don't mind a 15-20 min metro ride to the center, is the perfect report of price-quality. but the metro is not a problem, since Madrid metro is clean and very efficient I would recommend it highly", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“4 days in Madrid”", "Author": "Herve_Westgate", "ReviewID": "UR118570660", "Content": "After reading some review of this hotel on tripadvisor we decided to book for 3 nights from 16 September 2011 for me and my wife. This was my present to my wife for her birthday (4 days in Madrid). We used the Metro from the Airport to the Hotel. The metro station (Alsacia) is just 2mn from the hotel. The Hotel is situated away from the city centre in a quiet area and take 20mn to the city centre (SOL) by metro and its a direct line (No2 Red). At the Airport we bought 3 days metro pass for 13 Euro. Madrid Metro is very clean and easy to use. For the Hotel we was not disappointed with the comment left by another tripadvisor member, the hotel is very clean, our room was big with a sitting area lounge like a little flat, bathroom all marble+clean. We was on the 7 floor with view over the city roof tops. Buffet Breakfast was excellent. The staff was very nice and helpful, especially Adrian at the reception (day time) who give us some useful tips. Also there is a good place to go shopping call LAS ROZAS VILLAGE and its outside Madrid, about 40mn by bus from Moncloa bus terminal (Moncloa metro station Line No6 Grey) This village is a designer outlet with all the worldwide brands, and is possible to find some bargains!!! (Wife very happy) ;-) Good Hotel, Quiet Area, easy to go anywhere, maybe not good for people who want to go to disco+bars late at night, could be expansive to use a taxi. Metro is from 6am to 1.30am.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Best hotel”", "Author": "amazingkitkat", "ReviewID": "UR117055329", "Content": "with 35 Euros per nite for an couple, i found this is the best place to stay in Madrid! I love the neighborhood with surrounding residential area. It's suitable for those who wants a relaxing evening, no night club! just relaxing in the hotel! Free wifi is a bonus and i could access free internet every night (althought signal is weak in my room) bad thing is everything time when u need to go to the city centre, i need to pay 2 Euros for return ticket (Metro), but then metro is very convenience. No kettle in the room!", "Date": "August 21, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bursa, Turkey", "Title": "“not bad”", "Author": "ugurkoksal", "ReviewID": "UR116950450", "Content": "far from downtown but metro station 5 minutes by walk. rooms is good, breakfast avarage.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dortmund, Deutschland", "Title": "“wow!!wow!!wow!!”", "Author": "meirna", "ReviewID": "UR116392919", "Content": "Me and my friend recently went to Madrid and stayed at this hotel for 4 nights, we are there for \"Girls just wanna have fun\" trip. Silken Torre Garden Hotel was so amazing! This hotel is not in the centre from Madrid, but it only 15 minutes away with Metro and Alsacia Metro station is just 100 mtr away from the hotel, The metro in madrid run from 6am untill 1.30am the next day, and between this time, there is bus line no. L2 with route from Sol to Alsacia, you can also find bus stations in the corner of the street across a shopping mall!! A quiet big shopping mall with carefour and shops and restaurant for just 3 minutes away by foot. We've stay at the room in the 1st fl (room no. 101) even tough its only 2 of us that slept in this room, but they gave us 1 extra bed inclusive! The room is so big, approx. 45 m2, and full equiped with small fridge, big table, a sofa, a massive wardrobe, the kind of wardrobe that every girl dream of! LOL!! The bathroom also quiet big, with complete toileteries, hair dryer, bathtub with cold and warm water. The Receptionist so helpfull and can speak a very good English, I found this a plus point since learning from my experience when I was traveling to Barcelona, the Receptionist there couldnt speak English even we were staying in 3 star hotel, and it's hard for us to ask from some tips, since none of us can speak Spanish. We both really satisfied with this hotel, and we will absolutely come back, when the next time we visit Madrid.", "Date": "August 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Haaften", "Title": "“Close to new metro station Alsacia”", "Author": "Rosalien58", "ReviewID": "UR107318320", "Content": "I booked this hotel, as it had a good price quality ratio for €60 per night including breakfast. I knew it was not in the center, but we preferred this hotel over the hostals in the center. Madrid is a very big city, so it takes some time to travel. I searched the website of the hotel, but could not find good directions from the airport to the hotel. I mailed them twice, but no reaction. So we took the metro station Garcia Noblejas. On the site it was mentioned to go left, so we did. But after 5-10 minutes we asked a spanish lady for the hotel. It turns out that we were walking in the wrong direction. So you need to go right and that a steep 20 mniutes walk. In the hotel we asked for the fastest route to the center of madrid and we were surprised to hear that there is a metro station just acrcross the street! From the hotel 2 minutes walk to Alsacia. This metro takes you directly to the center without any transfer. From the hotel to the center is is less than 30 minutes. Therefore I would choose the hotel again if I were in Madrid. Yes you can hear the traffic noises in the hotel room, but the room was spacious and the bathroom more than ok. The beds are not really soft, but we slept very good. The staff is friendly/business like. The breakfast was ok/good. Directions from the airport to the hotel are as follows: From the airport it is line 8. Transfer at Colombia and take line 9 (arganda del rey) and transfer again at Principe de Vergara line 2 (las rosas) and get out at Alsacia. Take the exit to centro commercial. Outside you see a big roundabout go right look up at you see already the sign of Hotel. Cross the street and than you see the hotel on your left. You can buy a metrobus ticket for €9.20 (10 tickets) + €2 airport fee at the airport. As long as you stay underground you can travel whole madrid for just €1 per ticket per person. The metro is an ideal and very cheap way of transportation in Madrid. The trains are clean and feels very safe. As I was there with my daughter of 11 years old. And we travelled late. Recommendations in Madrid: The palace especially 1st wednesday of the month: change of the guard. .", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Bologna", "Title": "“Ottimo”", "Author": "Luca A", "ReviewID": "UR39214865", "Content": "I think that in general terms it has turned out much bond because out of center city but far from shutdown Metro 1,2 km", "Date": "August 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“good value”", "Author": "elizalily", "ReviewID": "UR26310774", "Content": "We stayed outside the centre to be nearer family. We were able to get a good price using Trip Advisor searches. We asked for, and got,a room on the top floor, as we knew that the road outside was busy at all times (noisier than the centre of Madrid at night). With the widows shut it was reasonably quiet, but the air conditioning didn't seem to work, as someone else said ,and as we were lucky enough to be there in lovely weather it was very hot and stuffy. The walls between rooms were very thin. The bed was very hard as was the pillow. Having said all that, the room and bathroom were large. The receptionists were friendly and helpful, but the woman behind the bar was not. We did not think that the restaurant breakfast looked good value, so we had fresh juice, coffee and a pastry for 10.28 euros each in the bar area.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Hot and suffocating at the Torre Garden”", "Author": "Kmyrhaug", "ReviewID": "UR10279392", "Content": "We have just returned after having spent one night at the Torre Garden. We ended up there because all the decent hotels in the city centre were full. Upon arrival we were actually pleasently surprised - newly refurbished hotel with large, clean rooms. The neighbourhood didn't have anything to offer (it was more of a residential area if anything). However, the hotel is not far from the city centre at all, about a ten minute cab ride (at around 10 euros). Not bad at all actually! The problem started when we entered our room - it was about 40 degrees in there! It felt like a wall of heat knocked us over when we entered the room. We quickly realised that the AC had been turned off in the entire hotel by routine Oct 1st, and the heat turned on instead - thats apparently when the season \"ends\", and AC is no longer a necessity. But trust me, that was not the case! We tried opening all the windows to relieve the heat, but outside it was so noisy there was no way we could sleep like that. After a few hours we decided to close the windows to see if that helped on getting some sleep, but instantly we felt like being suffocated! There was NO sirculation of air in the room. Trying to get some understanding from the staff on this issue was not easy at 4 am in the morning. So here is my advice - if you are going to Madrid between May and September you should be safe choosing this hotel. The rest of the year: STAY AWAY!", "Date": "October 24, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "USA", "Title": "“Good Hotel”", "Author": "Ansol", "ReviewID": "UR3986855", "Content": "My wife and I stayed at the Silken. It was a last minute reservation. The hotel is OK, very far away from Metro or the Main attraction. Close to the airport more than the city. You will need a car to go to the city. Nearest metro station is about 20 minutes walking and the neighborhood dark at night.", "Date": "October 3, 2005"}], "HotelInfo": {"Name": "Silken Torre Garden", "HotelURL": "/ShowUserReviews-g187514-d279272-Reviews-Silken_Torre_Garden-Madrid.html", "Price": "$55 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Hermanos Garcia Noblejas 190 bis</span>, <span class=\"locality\"><span property=\"v:postal-code\">28037</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "279272", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/89/f2/89f28545cdf7bd9e0338079d0ae92e3b6large.jpg"}}