{"Reviews": [{"Content": "Excellent Value, Great Service This hotel is great! I was at the hotel for 4 ntis for business. Rooms are very large (was able to do Yoga in my room each morning). Bathrooms very spacious as well. There is not an alarm clock on your night stand, however, it is on the TV (as is the case in most of Europe). Setting the alarm is easily accomplished with the remote control. The time is displayed on the tv (lower right corner), so you always have a clock around you. Additionally, I, too, had challenges getting my wireless to work with their system, however, the staff worked tirelessly until this was resolved. I was at the hotel while American Airlines was cancelling 900 flights a day. The concierge worked with me, waiting on hold with American Airlines for over an hour to help me confirm new flights to get me home. I LOVE this hotel, will stay here again and offer it the best rating possible. The staff is excellent, the hotel is very good and the entire package makes it a winner for everyone!", "Date": "Apr 11, 2008", "ReviewID": "UR364306594", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Intltvlfool"}, {"Content": "Simply the best! I stayed here on a business trip for 5 nights. 8 very large boxes for my business meetings were stored safely by staff even though they arrived 2 days before I did! I battled to use the internet (Im a bit of a technophobe) and the reception staff came to my room and didnt leave until they'd got it working for me. I said I loved drinking lots of tea, and it was a pity to not have tea making facilities and 15 minutes later someone knocked at the door with a kettle for me to use throughout my stay. The room was very clean, the bathroom was marble with both bath and shower, and even though I was facing the station I found the room very quiet at night. The air conditioning was great as it was humid outside so it was a pleasure to get to my room each day.Having the station so close was brilliant as I had to travel by train everywhere. As far as Im concerned the hotel is top class and excellent value for money and I won't even look anywhere else next time, I'll go straight there!", "Date": "Sep 29, 2007", "ReviewID": "UR467525241", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "jennywxy"}, {"Content": "Fabulous hotel  Lovely, spotless  modern boutique hotel in the heart of downtown Frankfurt. I highly recommend this place as I stayed here for a week and had no complaints. Staff was extremely friendly and helpful, and spoke excellent English. Conveniently located across the street from the main train station, a few short blocks from the Messe Frankfurt tradeshow venue, and walking distance to the great shopping  dining neighbourhoods. Restaurant was great  excelent food, good breakfast, but it is fine dining so it's pricey. Good value to buy a quick bite at one of the many nice kiosks in the train station across the street or at one of the many cafes down the side streets. I had a room facing the street  train station and had no complaints about noise. Just shut the window at night. Fairly sound-proof, but then I always take earplugs when I travel! Only 2 constructive criticisms - no ramps at the front of hotel, so not appropriate for individuals who can't do stairs or have alot of luggage  also the housekeeping staff do not like it if you wait to leave your tip on check-out day. If you don't leave a daily tip, various immenities such as your do not disturb sign, bottle opener, etc. will go missing. Overall this is a great hotel for the money  I'll be back.", "Date": "Sep 13, 2007", "ReviewID": "UR780913673", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "bcgiftgirl"}, {"Content": "nice hotel right next to the train station This is a very nice boutique-feeling hotel. It's literally right across the street from the north exit of the main train station in Frankfurt -very convenient. It has a very quiet and stately feel to the hotel - seems to be frequented more by business people than families.The rooms are very well appointed - dark brown, and a great bathroom. Yes, it is true that the view is not much of one since the windows have very high sills and really serve to bring light into the room. Plus, the view of the trainstation isn't that great to begin with.The exercise room is pretty decent - especially by European standards (elliptical, treadmill, free weights, natilus like machine, an erg). The sauna room is small but very well designed with a sauna and a steam room (was out-of-order during our stay). Breakfast IS very expensive (20 euros) - so skip it and just grab some baked goods and food in the many stalls at the train station.We only paid 108 euros for a night through hotels.com and so it was a very good deal for a nice hotel.The staff is typical German efficiency - not particularly warm but check-in was super fast. Like many other hotels (even 5-star) in Europe, there are few porters to help with luggage.", "Date": "Apr 27, 2007", "ReviewID": "UR209052083", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "induway"}, {"Content": "Highway Robbery! We booked this hotel thinking it would be close to the train station and also a step above the usual hotels in a main station area. The former proved to be true (about 5 minutes from the Hauptbahnhof) while the second was only marginally true. We paid 210 euro for a perfectly ordinary room with one small window. The sill was high and the noise from the outside - sounded like garbage being thrown down a chute - was irritating. The so-called modern bathroom included a bowl type sink which was very user-unfriendly and a very small shower although there was a separate tub. There was no clock in the room AND most significantly no breakfast was included unless you wanted to spend an additional 40 euro for two! So we decided to search for another hotel in the area and found the Hotel Manhattan (wow! read separate review) and checked out of the Steigenberger after one night. Upn checking out, we were billed for breakfast which we did not have. Check your bill carefully for additional charges. We can't understand such favorable reviews for such a mediocre hotel a such outrageous prices.", "Date": "Apr 23, 2007", "ReviewID": "UR408596538", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "2", "Value": "1", "Rooms": "3", "Location": "2"}, "Author": "NewYorkIndyTraveler"}, {"Content": "My favorite hotel in Frankfurt The Metropolitan is one of dozens of hotels located around the main train station. Some of these hotels are quite decent, some downright grubby but only a handful are what one would generally describe as nice or pleasant. The Metropolitan most definitely belongs to this category. I've tried many hotels in Frankfurt and it's my absolute favorite of what the city has to offer. It's right next to the Frankfurt main station, the location is both convenient for visitors of the trade fairs and it's also reasonably close to the downtown area. (two subway stops or a 15 minute walk)Although the hotel is quite large, it has a distinct boutique hotel feel. Reception is very professional and well groomed and the person checking you in will also bring you up to your room and explain how things like the safe, lighting, internet etc. work. The standard rooms are a wee bit on the small side but still perfectly acceptable but an upgrade to the next category is definitely worthwhile. My only suggestion in regard to the staff would be to fit them with a bit less matronly uniforms, they don't quite fit the otherwise very elegant surroundings.The rooms are very pleasantly decorated, colors are various shades of brown and even the art on the wall is much better than usual. The last time I stayed here, I actually really liked the painting on the wall! Amenities include in-room safe, bathrobe, slippers, mini-bar with beer, juice and soft drinks (free in all room categories above standard) and a TV (not flat unfortunately) with pay TV channels. Internet is exemplary, you have either the choice of wired LAN, WLAN or dial-up through your modem and all of these connections are free. This is exactly how it should be, availability of a free internet connection for me is now a reason to either book or not book a hotel.The bathrooms are lovely with lots of marble and are furnished with thick towels and lots of cosmetic products, some of the smaller rooms only have a shower but with a huge, rain forest shower head, most also have a bathtub.There is one really annoying thing that bugs me about the Metropolitan's service which you may encounter or not. The beds are fit with day pillows, these are exchanged in the evening during turn down service. If you happen to be in your room around 6-8 pm and have a do-not-disturb sign outside, you might miss turn down service without knowing it. These day pillows are not made for sleeping on. Maybe you'll, like it happened to me several times, arrive back at your room at midnight and find that your bed hasn't been turned down and you won't have a decent pillow to sleep on. Other hotels won't disturb you but they'll slip a note under your door offering turn-down service at a later time. The hotel has a very cozy and elegant bar and a restaurant which doubles as the breakfast room. I haven't tried the restaurant yet but judging by the offerings at the bar and breakfast, I have no doubt that the food there will be way above average. Have a superb club-sandwich at the bar and definitely don't miss breakfast. When I stay in hotels, I usually just go out for a coffee and a croissant in the morning but the Metropolitan's breakfast spread is for once really worth the high price all 5 star hotels tend to charge. Apart from a really outstanding buffet (the rare roast beef is almost worth the price), you also have a choice of a la carte items which are cooked to order and served. The menu includes a vast variety of items, I recommend to for once forget the calorie-counting and indulge in their scrumptious Eggs Benedict!Depending on the day and season, a standard room here is available from 99 Euros without breakfast. Compared to the hotel prices in other financial capitals of the world, this is an incredible bargain.", "Date": "Feb 3, 2007", "ReviewID": "UR332333046", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "CamelClass"}, {"Content": "Great Location, Ammenities and Staff This hotel was exactly as it states on the website. The suana and steam room were a great end to our long days of siteseeing. If you want a central location from which to sightsee and take day trips, this hotel is perfect. The train station is just a few steps across the street and when you get home late at night, there is plenty to eat as most of the restaurants are open in the station. The staff speaks English and are always very helpful.", "Date": "Dec 16, 2006", "ReviewID": "UR943178986", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "AtlantaLovers"}, {"Content": "Good Choice in Frankfurt       Our room", "Date": "Nov 16, 2006", "ReviewID": "UR648341324", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "jojo"}, {"Content": "A stylish hotel with standard service       The view of the train station from my window.", "Date": "Jul 20, 2005", "ReviewID": "UR751311291", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "No room at the inn I can't really write a review on this as when I arrived at 1830 was told that there had been a mistake and that my reservation had been cancelled. When I pressed them to tell me who had cancelled it they admitted that they had over-booked and thus had arranged for me to stay at their sister hotel next door - the Intercity. Not impressed - will never stay there again.", "Date": "Mar 8, 2005", "ReviewID": "UR941454034", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Swindoneric"}, {"Content": "Good The hotel staff were very helpful and friendly and the rooms were very new, clean and modern. Loved the bathrooms!Ordered room service on evening for dinner which was a bit pricey but very good nevertheless. Recommended!", "Date": "Jan 28, 2005", "ReviewID": "UR298806648", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good Location, noisy rooms - check your bill Steigenberger Metropolitan is very well located in Frankfurt, right beside the Bahnhof (Train Station). This makes the airport only 15 minutes away (Euro3.25 by train - no need at all to take a taxi) A tram stop is within seconds of the front of the hotel also. My hotel has some positive points, but surprisingly many negative points also.My room (on the fifth floor) was nice, with a great bathroom (complete with heated marble floor - nice touch on stepping out of the shower). However the room had a connecting door, and the guests in the adjoining room were very noisy. The room had two large single beds - something quite frequently seen in Germany - rather than a double bed.The room was not overlooked either - being higher than the station- a nice touch in such a big city.The carpet in the room was in very poor condition - it was badly stained, and a section of the carpet right in the middle of the room was cut out and replaced - but glued back down badly resulting in stains around the cut out section. This makes the room look very tatty, and not what you would expect from a five star hotel. Checkin staff gave me the wrong room number which involved me going back down to get the right room number. Apart from this staff were friendly, and helpful. Room price also includes a city public transport ticket. I was not given this on check-in - only later did I find out. I had a problem with my quoted price (quotedEuro150, charged Euro249) which took twenty minutes to resolve at reception. Needless to say I was not impressed, and was late for my meeting.Breakfast buffet at Euro 19 is a rip off, considering the nearby shops, and the food available in the station opposite. I had warm Cheese Croissant every morning from the station. NB this is the going rate for breakfast in good european hotels - but with such choice so close, I wonder how many guests vote with their wallets and cross the road into the station.The hotel has free internet access - via Dial-up, ISDN or wireless - a great service.An area close to the hotel is seedy - probably not advisable for women to walk alone in the evenings down that area. Naturally this is not a problem of the hotel but the area. However - the immediate area outside of the hotel is very safe, and there are plenty of police around at all times. No coffee making facilities in the room.Room service charge is price plus Euro4 delivery charge.", "Date": "Jan 26, 2005", "ReviewID": "UR472847759", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Value, Very Impressed Stayed at the hotel for one night on a quick business trip to Frankfurt. The staff was gracious and most helpful. The room was clean, comfortable and the bathroom was wonderful. Gym was solid, but not outstanding. Would definitely stay here again as it was great value.", "Date": "Dec 13, 2004", "ReviewID": "UR276565277", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A Great Hotel We spent two nights here at the end of a business trip to do some sightseeing in Frankfurt. This is an excellent hotel with a very convenient location. The hotel is clean and modern and the staff is exceptionally courteous and helpful. The high tech bathrooms were especially fascinating.Having made the reservation sight unseen on the web, we were somewhat anxious about the location in the Hauptbahnhof district. This was not an issue. The hotel is literally across the street from the north train station exit and we had absolutely no problems walking to the Allstadt area from there.There are many other hotels in the immediate area, and having seen some of them from the street, I am happy we chose this one. Most of the others were old and run-down.We were able to secure a weekend promotional rate of E99, far below the normal rates which made the stay a bargain as well. The breakast is a bit pricey for what you get and eating elsewhere is the only thing we would have done differently.", "Date": "Nov 15, 2004", "ReviewID": "UR548935187", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The most modern hotel ever! This five-star hotel is conveniently located accross the Frankfurt train station. It is brand new, the decoration in the rooms is very contemporary, no old-fashioned painting on the wall, no out-of-date furniture. I would describe the rooms as 'zen'. The bathrooms are hard to describe but I would say they come right away from a design magazine! Everything is modern and elegant, it is one of my best hotel experience ever. One thing though, I thought the breakfast at 17 euros was overpriced.", "Date": "Jul 10, 2004", "ReviewID": "UR115351053", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location, staff and value This is a brand new hotel directly facing the north side of the main train station, which is a 10 minute, 3.25 euro train ride from the airport. Just take the Poststrasse exit from the station, go up the escalator and you're there.Despite being across from the station, the hotel is very quiet and clean. Spacious rooms with in-room safes. Nice gym on 6th floor with new equipment. Great value through hotels.com. Staff was very friendly and helpful. Newer building and better value that the Steigenberger flagship Frankfurter Hof, whose rooms I have seen.", "Date": "Jan 29, 2004", "ReviewID": "UR746177791", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "椐呫伄闅ｃ仹璞彲   showReview(20753034, 'full');", "Date": "Sep 14, 2008", "ReviewID": "UR252558720", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "gerne wieder !!   showReview(11434978, 'full');", "Date": "May 17, 2007", "ReviewID": "UR858753622", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Top-Lage f眉r Bahnreisende und Messebesucher   showReview(11411181, 'full');", "Date": "Apr 8, 2007", "ReviewID": "UR777050811", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "In Frankfurt mein Liebling: Elegant, Location am HBF, aber etwas unpersoenlich   showReview(7194562, 'full');", "Date": "Mar 20, 2007", "ReviewID": "UR109992664", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "aussteiger"}, {"Content": "渚垮埄锛嗐亰鍊ゆ墦銇★紗璞彲   showReview(19159048, 'full');", "Date": "Oct 6, 2006", "ReviewID": "UR462464793", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銉曘儵銉炽偗銉曘儷銉堜腑澶...   showReview(21801094, 'full');", "Date": "May 14, 2006", "ReviewID": "UR843947524", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d280221-r14952203-Steigenberger_Hotel_Metropolitan-Frankfurt_Hesse.html", "HotelID": "280221", "Price": "$356"}}