{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Springfield, illinois, USA", "Title": "“Great location at affordable price.”", "Author": "Xtreme12", "ReviewID": "UR139769477", "Content": "I selected this hotel based on the reviews. We were not disappointed. The price was very reasonable for the central location in Branson. I prefer to spend my $ on other vacation activities. The evening desserts are a nice extra.", "Date": "September 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazingly clean, friendly staff and great location!!!!”", "Author": "smiranda3", "ReviewID": "UR139702852", "Content": "I am actually in the room right now while writing this. I couldn't wait to give this place a great review. Breakfast and dessert are great but the rooms have us won over. They are extremely clean and quiet. The staff has been so nice and helpful. The hotel is in a great location! We leave in 2 days but we will absolutely stay here next time we come back!", "Date": "September 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great stay, great value!”", "Author": "Mom0198", "ReviewID": "UR139618110", "Content": "My family & I stayed here 1 night on August 29th. We were very pleased with the updated, very clean room. Check in & check out were super fast with friendly service! The next time we're in Branson we will definitely be staying here!", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Kansas", "Title": "“Very Clean Accomodations”", "Author": "Karen C", "ReviewID": "UR137550109", "Content": "Rated highly by Trip Advisor and the reviews were very accurate The room, dining area and pool were immaculate We were so impressed we will definetly stay there again Warm cobbler, cookies and ice cream served in the evening was great Breakfast was good but ran out of sausage early Very well located to all attractions and restaurants", "Date": "August 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MD", "Title": "“Good package deal.”", "Author": "pasherry", "ReviewID": "UR136774035", "Content": "Booked a 4 night package that included tickets to four shows for two people. I received a call to confirm the room and dates and times for the shows. We found the motel to be in a very good location on the yellow route. It is not a fancy motel, all rooms open to the outside, but it was clean, quiet, and staff were friendly. There is a refrigerator in the room, no coffee maker but they provide free coffee, cappuccino or hot chocolate all day. They do not provide much shampoo, luckily we brought our own amenities. The breakfast in the morning was good with eggs, biscuits, gravy, cereal, waffles, juice, doughnuts, and the cobbler, ice cream and cookies in the evening was a nice touch. The outdoor pool was clean. Having the show tickets pre-purchased was nice and I was surprised by how good the seats were. The price was very reasonable for the package, they even took $50 off because there was a special going on. It may be more expensive for a family. You can purchase individual tickets to shows at the motel. I would definitely stay here again.", "Date": "August 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lake Waccamaw, North Carolina", "Title": "“Great Value and Accomodations”", "Author": "Ed H", "ReviewID": "UR136729928", "Content": "We spent four nights at Branson's Best and we couldn't have been happier. The room, breakfast, evening dessert, and service received are above the rest for the price we paid. I felt like we definitely received our money's worth, that is all I can ask. You will look long and hard if you find a better value that you will be happy with. We will be back.", "Date": "August 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Grandkids had fun too!”", "Author": "Jan H", "ReviewID": "UR136399782", "Content": "Great location, rooms clean, very nice pool, staff very helpful & would do anything to help you have a fun vacation. Nice to have a late check-out. Breakfast was very nice plus the late evening desserts were delicious. We stayed 4 nights & loved it!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Marshalltown, Iowa", "Title": "“Like home”", "Author": "Karenm014", "ReviewID": "UR136052024", "Content": "We spent three nights there and this was our first stay. The beds and room were nice. Did have to ask that they not open the curtain after cleaning because it would be warm in the room upon our return. Very HOT outside. Nice pool but only open 10am-10pm. Would of liked to let the kids swim awhile before going out for the day. Had a very nice breakfast with biscuits and gravy. Very nice staff. I will stay there again.", "Date": "August 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pittsburg, Kansas", "Title": "“Great place for the price”", "Author": "Gina B", "ReviewID": "UR135971522", "Content": "For the price it is a great place to stay. It is very clean and fresh and since it's not on the main strip but close by on the side road it is very easy to get around. They do have a free Breakfast and late night snack. Id say if I had to find something wrong with it is no coffee pot in the room and I get up very early. They do tell you they have coffee 24 hours in the food area BUT I got up at 5:00 and went down at 5:30 to get some and it was locked up until about 5:50ish. My son use to work in this business so I understand the reason for it but think they should have a bell for service. I rattled the door but no one came once he came out from where ever he was a saw me he opened the door. Also the pool is VERY small (More for kids to get in and get wet) and only open from 10 to 10, had it been opened earlier I would have swam before all the kiddos got in I ask but was told no. I did see on the next morning that a couple went in and just swam and didn't ask and it was about 7:50... I'll do that next time. But all in all it was a nice place to stay.", "Date": "August 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Great experience”", "Author": "jvmarr", "ReviewID": "UR135745281", "Content": "Even with the late 1 PM check out time, our rooms were ready by 2 PM. Check in was quick and simple. The staff was extremely friendly. I overheard multiple front desk clerks help other guests with information on restaurants or attractions. Our rooms were clean and tastefully decorated. The beds were comfortable. Even with the air conditioner on high, the room was stuffy at times. I think this was due primarily to extremely high outside temperatures and that our room faced the west. The pool was crystal clear and well-maintained. I witnessed maintenance checking chemical levels daily. My only suggestion for the pool area would be some type of shade, ie umbrellas, awning, etc. Although the breakfast selection was the same every day, there were enough options to have a varied meal each morning. Evening desserts were an added bonus with fresh baked cookies, soft serve, & cobbler. Staff kept the eating area stocked and clean. There were 3 separate seating areas, one being outside. Our overall experience was very good. We wood stay here again.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Conway, Arkansas", "Title": "“Just o.k. Won't stay there again.”", "Author": "Vanessa H", "ReviewID": "UR135214953", "Content": "The location is great. The late-night snacks are great. The breakfast is better than most. However, the beds were not comfortable in our room. They probably needed to be replaced about 7 years ago. Also, my granddaughter, not yet two, could open the locked door from the inside. There should be an inside dead-bolt on the door! There was some strange stain on the door facing in the bathroom too. I am pretty sure it could have been cleaned off easily, but I was afraid to touch it!", "Date": "July 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gower, Missouri", "Title": "“Teresa C.”", "Author": "Teresa C", "ReviewID": "UR135082034", "Content": "We recently stayed at this motel in Branson. The staff was very friendly and informative. The rooms are clean and tastefully decorated. Location is great. They serve a delicious breakfast; and as a special treat each evening; blackberry and/or peach cobbler and cookies are homemade by the \"best baker in Branson.\" I highly recommend this enjoyable and welcoming motel for your visit.", "Date": "July 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "KC", "Title": "“The name says it all”", "Author": "MWTrav", "ReviewID": "UR134820207", "Content": "Branson's Best is one of several in the Branson area owned and operated by the same couple. They also run Savannah House and two others I can't remember the names. I've stayed here multiple times over the years as well as the Savannah House and have always been more than satisfied. They really do their best to make your stay a great one. This property is older but they are constantly updating to make it current. For a motel with outside entrances, there is none better. The location is perfect being one block off the strip on Green Mountain Drive which gets you any place in Branson quickly. Clean rooms and small but nice and clean pool. They recently added an elevator to accommodate restricted access folks. The breakfast, although maybe not as good as a restaurant, is unbeatable for a motel. The cookies, cobbler and ice cream at night is a great bonus. Honestly, what makes this place and the others they run the best is the people. It really does appear they enjoy helping folks and understand to succeed in Branson in the hospitality business, you must be hospitable. They excel at it. Having lived in Branson and now visiting multiple times per year and having stayed in probably 1/2 of all the hotel/motels over the years, for the price you will not find better than these properties.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“Got what I paid for....”", "Author": "NolandJr", "ReviewID": "UR134818183", "Content": "My family's experience started with booking about three weeks ahead of time. The gentleman on the phone was very courteous and handled my transaction with ease. When we finally checked into our room we were shocked as to the size of the room. Compared to other hotels that my family has stayed in this was quite small. However, we didn't spend a lot of time sitting around in the room either. We must've checked in at the same time when there was a sport event going on. Children all over the place which at times was quite noisy. Sometimes the adults were noisier than the children. Sounded like King Kong from the wax museum was a guest there too. It seemed to have quieted down a bit after they left. HOT BREAKFAST!!! This was a big plus. May I suggest adding some bacon? Housekeeping didn't do a good job in cleaning my room. My daughter dropped some food on the floor and it's still there after two days. Please, if you want customers to be happy, please be attentive. Seeing dirty rooms or half cleaned rooms only add to the stigma that hotels are breeding grounds of various forms of bacteria. Overall, I was happy with my stay here. The staff was pleasant, room was okay for what I paid (very affordable may I add), breakfast was great, and all the sites that my family wanted to see was just minutes away. Would I consider coming back? Yes. Would I recommend this motel to others? Yes. Thank you guys. My family and I really appreciate your efforts in making everyone happy. Room 216", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hobbs NM", "Title": "“Clean, quite, and very relaxing! :)”", "Author": "carol s", "ReviewID": "UR134780226", "Content": "Absolutely the perfect place to stay. Every time I went to the office the staff was eager to make everything right for our stay. I especially want to thank Judy and Brandy. We had some problems the first night and they moved us to beautiful accomadations. The breakfast are very good and so is the night desserts. The rooms are spacious and clean. We have stayed here several times and will again when we are back in Branson. Thanks Branson Best staff for a wonderful stay at your place.", "Date": "July 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus Ohio", "Title": "“The Best in Branson”", "Author": "LucyLou1944", "ReviewID": "UR134553713", "Content": "After checking out several rooms at different hotels in Branson, we found Branson's Best. It really is the best. The room was clean; the beds were comfortable and they provided nice thick towels. It has been refurbished and they did a great job. As others have said, the breakfast was good as well as the cobbler and ice cream at night. There was no comparison to other hotels we checked out in the same price range; this was by far the best.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fenton, Missouri", "Title": "“Great Place to stay”", "Author": "cryadk", "ReviewID": "UR133757368", "Content": "Very friendly people they worked hard it seemed to keep everyone happy. Excellent free hot breakfast they even had ice cream, cookies and cobbler free every night. The kids loved that! We will stay there again.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“a great bargain”", "Author": "ghouck", "ReviewID": "UR133643454", "Content": "we booked 2 rooms here in June-stayed on the third floor which is no problem-they have an elevator for easy transit. The rooms were very clean and beds were most comfortable. The free breakfast every day was fresh and hot - eggs,gravy and biscuits, cereal and even Krispy-Kreme donuts. At night they serve cobbler and ice cream until 11 o'clock - everyone enjoyed that! The location is on the yellow route and it's easy to get to any theatre from here. There is also a winery across the street that offers a great free tour and tasting. We will certainly stay here again.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Loved It!”", "Author": "cat726", "ReviewID": "UR133316924", "Content": "It has been 8 years since my husband and I have been to Branson. We took our kids this time, and we had a great time. I pick our hotels based on reviews from Tripadvisor, and I was glad I picked this hotel. We spent 4 nights, and it was wonderful. It was very clean, the beds were comfortable, and the pool was refreshing. We would get up every day to a delicious breakfast of 2 kinds of scrambled eggs (one with ham, one without), biscuits and gravy, fruit, yogurt, waffles (which my son became an expert on making!), many kinds of cereals, Krispy Kreme donuts, milk, juice, and coffee. It was 105 degrees every day we were there, but our room was nice and cool. Our room was on the back side of the hotel, and was very quiet. There are 3 floors with exterior corridors, but there is an elevator. The location is perfect, on the yellow route. Easy to get to everything and avoid the main strip. At night, we would return and have ice cream, 2 kinds of cobbler, and cookies, all free! Yummy! We got a great deal (used a coupon from the books you pick up along the interstate at the rest stops). I will not hesitate to stay here again. Everyone was very friendly. The name says it all.....Branson's Best!!!!", "Date": "July 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "greenville, illinois", "Title": "“Relaxing vacation”", "Author": "lefty2u", "ReviewID": "UR133140873", "Content": "Have stayed at Branon's Best everytime we go to Branson. Been going there for over 15 years. I have never had a bad experence there. Great staff, comfortable and clean rooms. The pool area is always clean and plenty of chairs around the pool. The breakfast is as good as any and the ice cream and cobbler and cookies are a wonderful end to the day. If you are looking for a nice motel at a resonable rate...you won't be disappointed.", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tecumseh, KS", "Title": "“Fantastic Experience!”", "Author": "Robbie A", "ReviewID": "UR132839101", "Content": "Branson's Best made our stay in Branson very pleasant. Their breakfast offerings were great and it was nice to have warm cobbler and ice cream before bedtime. The desk help was very helpful. We asked for a recommendation for lunch and received the name of a great local BBQ. The services that they provided were well worth our money. I highly recommend Branson's Best to anyone!", "Date": "June 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mississippi", "Title": "“Great Hotel at a Great Price”", "Author": "1fromMS", "ReviewID": "UR132759466", "Content": "We recently stayed at Branson's Best for the first time. Upon arriving, check-in was quick and easy and the desk clerk was friendly and helpful. Our room was an average sized hotel room; however, it was very clean. The complimentary breakfast is nice but very limited. The evening snacks were nice. The pool is clean and wasn't crowded. Overall, our stay was excellent. The hotel was fully booked a couple of nights during our stay and the breakfast donuts were gone well before 9 one morning; so if you stay on a booked night and want to eat, get to the dining room early.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Effingham, Illinois", "Title": "“Great place to stay, clean, nice people, great breakfast and evening snack”", "Author": "moonstone0005", "ReviewID": "UR132664384", "Content": "We stayed at Branson's Best Hotel two days on a Thursday and a Friday evening. The room was clean and well appointed. The bed was comfortable. When we arrived there was only one room available for Thursday night, but we asked to be put on a waiting list for Friday night in case someone cancelled, which they did. The people running the hotel were kind and very helpful, and so were the housekeepers. After we got back from the show we enjoyed two kinds of hot cobbler (peach and blackberry), vanilla ice cream, coffee, cappucinno, and four kinds of freshly baked cookies. The food was very good. I'm glad we didn't have to go to a restaurant for a snack. The next morning at breakfast at the hotel they offered a hot bar with scrambled eggs, biscuits and sausage gravy. They also had a waffle maker, Krispy Kreme doughnuts, bread for toast, yougurt, sliced peaches, and five kinds of cereal.There was also iced tea, ice water, milk, coffee, and cappuccino available. The food was very good. The cost of the food is included in the cost of the hotel room. It was nice to enjoy breakfast at our hotel rather than drive to a restaurant. The hotel has a pool but we did not use it. The hotel has three floors and there is an elevator available. Parking is very good and mostly level. The hotel sits on a road south and parallel to the main highway so it is easy to get into and out of. We will return to this hotel if rooms are available.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Missouri, United States", "Title": "“WOW”", "Author": "Teach2kids4", "ReviewID": "UR132266721", "Content": "This is the the first time I have stayed here at Branson's best. I read the review. Do you know what? They are all true. The room was clean. The bad was very comfortable. The pool was great. The breakfast was good. They even had blueberry waffles! That's the first place I have seen that. They also have a late night dessert snack. This is a must stay! You won't be disappointed.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basehor, Kansas", "Title": "“A Great Hotel”", "Author": "Sunnyksgirl1948", "ReviewID": "UR130008639", "Content": "I was looking for a nice clean hotel and after reading all the excellent reviews from previous travelers, we booked a three night stay at Branson's Best. We were very happy with our room. It was clean and the beds were very comfortable. The great breakfast every morning was a plus and the warm cobbler every night was great. I visited with several people while we had breakfast and most everyone were repeat customers. We will definitely stay there again on our next trip. Thank you Branson's Best......you really work hard to make this a nice hotel. Linda and Jack B", "Date": "May 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "monroe, wi", "Title": "“the place to stay in branson”", "Author": "david K", "ReviewID": "UR129587804", "Content": "i told the manager that i really didn't want to write a review of the hotel because then people would start staying there and i would have a harder time getting a reservation there the next time i wanted to stay there. he assured me that that wouldn't be a problem. i have stayed at other places in branson, but this is the best. the morning breakfast has everything you could want. then every night they have hot cobbler, ice cream, cookies, donuts, etc from 8p to 11p. the room are very comfortable and newly renovated. the staff go out of their way to meet your needs. the location is ideal in that it is a block off the main street and easily accessible to the theatres and shopping. as for the price- you won't find all these things for the price. oh, i forgot to mention they have discount prices on some of the shows as well that no place else in town can beat, unless you listen to a presentation.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SeaTac, WA", "Title": "“great branson experience”", "Author": "happycamperSeaTac_WA", "ReviewID": "UR129042974", "Content": "This hotel is clean, comfortable, quiet, great location, friendly staff, good value and well managed. The breakfasts were very good. The staff did a super job keeping food supplied and tables and counter clean from beginning to end. The cobbler and ice cream each evening was delicious, also complimentary and over the top in service and appreciation to their customers. We also were able to print our air line tickets for free. (we have always been charged a fee by others.)", "Date": "April 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jonesboro", "Title": "“shopping getaway”", "Author": "Angie S", "ReviewID": "UR128434170", "Content": "We really enjoyed the stay. The rooms were very clean and the staff were very friendly.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth", "Title": "“Clean and Close to the Strip”", "Author": "3426oak", "ReviewID": "UR128197489", "Content": "Very nice place for the money. Clean rooms and family friendly. Breakfast was good and the evening dessert was a big hit. Close to the shows and Titanic we will diffently go there again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cottondale, Alabama, United States", "Title": "“Thanks guys”", "Author": "Dwayne R", "ReviewID": "UR127678132", "Content": "This place was great. The kids loved the desert bar at night. The rooms were clean and the people very friendly. I'd stay here again in a heartbeat.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maine", "Title": "“Wonderful Experience”", "Author": "kteacherMaine", "ReviewID": "UR127263652", "Content": "The front desk people were friendly and helpful. We even bought a couple of show tickets at the front desk. Mostly we bought tickets from the 2 for 1 Branson ticket place that is not a timeshare place. The room was clean and had 2 queen beds. It was a non-smoking room. In fact, I think the hotel may be completely non-smoking. There is also an elevator. They have a small outside pool that wasn't open yet. We were there from March 21-25, 2012. The price was reasonable, about $62 a night. I believe it also has free Wi-fi. We really enjoyed their breakfast and evening snacks. They have a waffle maker, cereal, fruit cocktail, canned peaches, cereal, biscuits and gravy, toast, bagels, Krispy Creme doughnuts, hot chocolate, coffee, and two kinds of juice. They may have even had scrambled eggs and sausage (I can't remember for sure). In the evening they had two kinds of cobbler, two or three different kinds of cookies (chocolate chip, macadamia nut, and one other kind, I think), and vanilla soft serve ice cream (or was it soft serve yogurt?) This hotel is not on the strip, but is very close and is located on one of the back routes (yellow, I think). I will likely try to book this hotel again when I return to Branson.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ward, Arkansas", "Title": "“Problems Handled, Clean Motel”", "Author": "southernqueen20", "ReviewID": "UR122048359", "Content": "We stayed at Branson's Best for the Thanksgiving holiday. As usual we called and made reservations several weeks before hand and was quoted the price of $59.99/night. Upon arrival, they told us that we were not quoted that price and that it hadn't been that rate since this season had began. The woman (I forgot to get her name of course) at the front counter had such a terrible attitude, I told DH let's just go to another hotel, but knowing that it was a busy holiday, he said no since he didn't feel like dealing with it. DH told the woman at the front that we have stayed there numerous times, and never once have had any problems, so she looked us up in the \"system\" and couldn't find where we've stayed even once... which was so ridiculous, because we've stayed there I know at least 10 times before. We paid the difference and got checked into our room. The room was nice, as always is and has been before. There is a fridge in every room, which we have found to be very convenient. The rooms have been always clean, and they have elevators which make it easily accessible regardless of what floor you stay on. The breakfast was great, as always, as well as the cobbler/ice cream and cookies served in the evenings. (There was a man working one night, and he was soooo great! He kept everything up, and even when another patron was not being the nicest because the cobbler's were getting low (they had 5 minutes until they stopped serving) he said he would go get another one for her!) The day of check out however (they offer a 1:00pm checkout), our keys stopped working before time to check out. (DH went to go get ice, and tried to come back in, and couldn't..on either card) So we had to prop the door open to be able to go get the rest of things needed and to load our car/etc. I was told it had to do something with magnetization and wasn't controlled by the front office. I was still very upset from our check in experience, and felt it should be shared (because the woman's attitude was just rank, and that bothered me more than the $30 extra dollars we were being charged) and so I was going to fill out the comment card that was left in the hotel room, but there was no pen. So I brought it back home with me, filled it out and mailed it in. I was called very quickly by a woman named Desiree (sp?) and she was very helpful and courteous. She apologized for the woman's attitude and for the misquoted price, twice actually, which I was very appreciative of. She comped us one night stay, which I told her I greatly appreciated. We have always been very pleased with Branson's Best, and have referred several people there, and now knowing what it's like to have a problem with them, and seeing that it will be handled appropriately, encourages me to continue to stick with them, and to continue to refer people to them.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Butler, Missouri", "Title": "“The very best hotel in Branson”", "Author": "Arnold H", "ReviewID": "UR121227728", "Content": "We have been going to Branson for over 25 years and have stayed at several hotels over the years when some friends suggested we try Branson's Best this was 2 years ago and it only took one stay and we've been staying there ever time we are in Branson. Friendly staff rom the manager to housekeeping and just a drive to all the attractions.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midland, Texas", "Title": "“Very good experience”", "Author": "Traveler56287", "ReviewID": "UR121150184", "Content": "First time to Branson so I checked TripAdvisor for hotel information. Reviews of Branson's Best stood out so I made a reservation there. Was not disappointed. Was told on arrival that our original room was booked by mistake, so we were given a larger room at the same rate. Had just gotten into the room when the manager came by to see if everything was to our liking. Hot breakfast in the morning was good, as was the cobbler, coffee, and ice cream at night. Pauline W. who cleaned our room was very friendly. Very close to all attractions. Will definately stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Surprised by the value”", "Author": "Lovetogo052", "ReviewID": "UR121143496", "Content": "For $64.95 we got two very comfy, nicely made-up, queen-sized beds with lots of pillows (think Springhill Suites or Hampton Inn), a clean bathroom with good toiletries, a refrigerator, a new TV, warm cobbler, cookies and donuts to enjoy after we came home from Silver Dollar CIty at 9:30 PM, a lobby coffee machine that is always available (and had tea & hot water), AND a huge breakfast spread with real scrambled eggs, Krispy Kreme donuts, biscuits and sausage gravy, and the other usual breakfast items. Even though this is a motel with floor units to heat and cool the rooms, our heater was quiet and the fan never woke me up when it cut on and off. Although we could hear people walking outside our room, there was no noise from the adjoining rooms although the motel was quite busy. Would definitely recommend and would stay again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best hotel in town.”", "Author": "rstroud9520", "ReviewID": "UR121033594", "Content": "We always stay here when we come to Branson. Hot continental breakfast every morning and dessert every night. Great cobbler! Very clean rooms. Friendly staff. Minutes away from attractions without being right on the strip.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great place to stay”", "Author": "YvonneR940", "ReviewID": "UR120787087", "Content": "We stayed here with group tour for 5 nights. Everything was done right. Breakfast was super with many choices, plenty of food. Staff was helpful as needed, getting tickets to extra shows, etc. Housekeeping service was over the top, plenty of towels, etc. Every evening when we returned from seeing show there was cobbler, ice cream cookies, cocoa, coffee for late night snack. Not too far from central location.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Duncan, Oklahoma", "Title": "“Clean, But Nothing Special”", "Author": "Pam F", "ReviewID": "UR120689289", "Content": "After searching online for a motel that had a smoke-free, no pet policy, we decided to stay at the Branson's Best hotel. When we first arrived at the hotel, the manager that checked us in was not very friendly. She acted like she would rather be doing something else. Our room was clean and had a fresh smell. We had two queen beds which were firmer than what we like. The pillows were nice and comfortable. The lady who cleaned our room was very friendly and always did a great job. The breakfast was good, however with the motel being full and the seating space being limited, there was not enough room for us to have a place to sit down and eat a few mornings. They served cobbler, cookies, and ice cream from 9 to 11 every night. The girl that checked us out was very friendly.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Keota, IA", "Title": "“Love this place!”", "Author": "Linda S", "ReviewID": "UR120088992", "Content": "We loved it at Bransons Best! Stayed here 4 nights at a great price. Will certainly stay there when we go back. Very clean rooms, and very nice staff. They were very helpful in recommending good places to eat. The breakfast is great, and the cobblers, ice cream, and cookies at night are a special treat when returning from 8 pm shows!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dakota, Illinois", "Title": "“Awesome place to stay!!”", "Author": "Stanley D", "ReviewID": "UR119972046", "Content": "st dak1956 We discovered this motel on the internet and decided to spend 4 days and 4 nights there. We were very happy with our choice. EVERYTHING was very clean and comfortable. We had a great breakfast and the cobblers, cookies, etc. were wonderful in the evening. The staff was very courteous and helpful and it was a lovely, quiet place. It was a very good price and we will be returning there again whenever we come to Branson. They were very dedicated in making their guests happy.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SIKESTON", "Title": "“Highly recommended!”", "Author": "HEATH P", "ReviewID": "UR119143628", "Content": "This is a great place to stay!! They offer more than just bagel & cereals for breakfast. You have eggs,sausage gravy,bisuits,waffels,cereal,Krispy Kreme donuts, execellent coffee, milk,orange juice, and kiwi juice. The rooms have a new and very clean appearance and water pressure in shower is wonderful!! It a great value for the money!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bella Vista, Arkansas", "Title": "“Great value for an overnight stay”", "Author": "felinefine12", "ReviewID": "UR119114607", "Content": "We went to Branson just for the night and I saw Branson's Best online and read the reviews and was not disappointed. The rooms were very clean, the beds were nice and comfy. Our toddler loved all the pillows on the bed, definitely enough for all 3 of us in the king size bed. We paid $70 for a king size bed vs I think it was $65 for 2 queen size beds in the room. We checked in around 6pm and you could smell the cookies being made filling the lobby. The desserts are from 9pm - 11pm so no need to rush after dinner. They also replace the cobblers as they are finished off. They don't have milk to go with the cookies though, only coffee. I say this because we had our toddler with us. The breakfast the next day was nice, eggs, cereals, waffles. For the price, the clean rooms and the amenities definitely a place to return to.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockford, Illinois", "Title": "“Room,Breakfast,Staff all perfect!!”", "Author": "gardener8764", "ReviewID": "UR119089199", "Content": "Didn't have a clue where I was booking us into in Branson. It was a 4 day,4 night trip and each day got better. This property is one of 5 owned by a local family who are very dedicated to exceeding their guests expectations. We talked to numerous people who had been coming here for as long as 15 years. Always staying on top of quality and comfort, I found out that they had replaced all the mattresses in the past year. We slept wonderfully. Located on the YELLOW route of the main strip, it was very quiet. Their other property that we would consider staying at is Savannah House. That's because it looks so stately and has a beautifuly landscaped front with a waterfall and gazebo.One of the best trips we have taken in the US.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oak Forest, Illinois, USA", "Title": "“Good service, clean, economical, great cobbler!”", "Author": "Jerilyn R", "ReviewID": "UR119047687", "Content": "This motel was recommended to us by friends, and we certainly were not disappointed in the service, cleanliness, price. Breakfast in the morning and blackberry and peach cobbler with soft serve ice cream at night. What a bargain for the price. We definitely will return.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mendota, Illinois", "Title": "“Great motel - Friendly staff - guests too!!”", "Author": "christine L", "ReviewID": "UR118816194", "Content": "My husband and I came to Branson for a vacation. We checked on the internet for places to stay, read reviews and chose Bransons Best. We were not disappointed. Location was perfect to get around. Rooms were clean, well maintained, and staff was friendly and accommadating. We enjoyed the breakfast and treats at night, yummy! We will definately stay here again! Great value.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Campbell Hill", "Title": "“Branson's Best Motel”", "Author": "Cathy L", "ReviewID": "UR118370628", "Content": "My sister and I were meeting in Branson for a girls weekend. We used these reviews to choose a place to stay. Branson's Best is by far the BEST place to stay! On Green Mountain Road away from the crowd but easy to get to. SUPER CLEAN rooms with many extras (refrig, iron, hair dryer, etc.). Comfortable beds with lots of pillows. Very friendly and helpful staff. Full and delicious breakfast with too many items to mention. And yummy cobbler (two kinds), ice cream, and homemade cookies in the evening. What more can you ask for! We highly recommed Branson's Best!!!!", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durant, Ok", "Title": "“Great Stay....lots of fun!!!”", "Author": "minmurphy", "ReviewID": "UR118364290", "Content": "This was our third time to stay at Branson's Best. This time we took my father who is 74 and he too loved the hotel. This hotel is best for the vaule. With your price you get a great breakfast, come back from the show at night and they have cobblers, cookies and icecream, everynight. The rooms were clean and fresh. The pool is always sparkling clean. Hotel staff go out of their way to make sure your stay is awesome. Branson's Best is our home away from home and always will be!!!!", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Plano, TX", "Title": "“Will definitely stay there again”", "Author": "dleatx", "ReviewID": "UR117680035", "Content": "Very clean, comfortable and - since it is off the main street - quiet. Very good breakfast bar. Wonderful idea having free cobbler, cookies and ice cream at night. First time we ever stayed at a motel and got to visit with other guests. It was kind of like an ice cream social. Excellent value.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brussels, Illinois", "Title": "“Very clean, great price, great complimentary food!”", "Author": "CountryMomof3", "ReviewID": "UR116635919", "Content": "*Great location; it is off the main strip (76) but still close to attractions. *Rooms are nice and clean, as well as the pool area, and the lobby/breakfast & snack area. *Breakfast/snack area was very crowded but food was excellent and plenty to choose from. *Icecream, cookies, and cobbler in the evenings were complimentary and tasted delicious! *Pool was in the back corner of the hotel's property and went from 3-5 feet in depth. It was in a great place, kind of private compared to other hotels' pools.", "Date": "August 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "st louis, missouri", "Title": "“Wonderful place!! Will definitely stay here again!”", "Author": "cancun4us", "ReviewID": "UR116581563", "Content": "We stayed 5 nights the first week in August and had a great experience. The staff was nice & helpful. The rooms have been recently updated and the beds were comfy. The breakfast was really good with lots of hot items as well as the traditional fruit, yogurt etc. We also really enjoyed the dessert bar in the evenings too!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Value Simply Can't Be Beat”", "Author": "stickbuc", "ReviewID": "UR116000247", "Content": "We have stayed here multiple times when coming to Branson. This place is in one word \"Value\". For a very reasonable price, you will have a clean updated room, nice outdoor pool, hot breakfast (eggs, sausage, fruit, etc... the whole nine yards). Their slogan is \"So great you'll think we are a bed and breakfast\". Well, they are right. The service and treatment could not be better. Plus, at night it's free coffee, cobbler, cookies and ice cream for the crowd coming back from the shows. For the money Branson's Best can not be beat.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Nothing Short of Awesome”", "Author": "sunshine2shadow", "ReviewID": "UR115863365", "Content": "There were 5 of us .2 were Moms and 3 were girls7,8,9. We had to get the most out of our money and time. Someone told us about this hotel at church and we decided to try it with breakfast and late check out1pm and cookies and ice cream in the evening. Not to mention the awesome personnel that work there all very curtious and helpfu; from towels to shampoo as children have very long hair. I can not think of when we have enjoyed a trip more. There were routes from there that enabled us to avoid traffic to just about anywhere. I have one suggestion put business cards on magnets for my frig. cause I have already reserved aweek in november.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Russellville, Arkansas", "Title": "“I think we found our yearly motel”", "Author": "Nana22gr8boys", "ReviewID": "UR115367155", "Content": "We took our 2 young grandchildren on vacation and chose Branson's Best. The breakfast has things like fruit and yogurt, different cereals, make your own Belgian waffles, biscuits and gravy, scrambled eggs. The evening buffet of cobbler, ice cream and cookies was a nice bonus. Coffee is available all day. The pool was great for us, it went from 3 to 5 ft. The rooms were immaculate and the service was very friendly and great. I would definitely recommend to anyone. Also there is a Walmart and grocery store right down the road for any of your needs. The location was also great on the yellow route right off 76.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edwardsville, Kansas", "Title": "“\"Love, love this place!\"”", "Author": "Scoan19", "ReviewID": "UR114971279", "Content": "We have been to Branson's Best twice now and both times have been excellent. From the friendly staff, to the beautifully cleaned rooms, to the sparkling pool and yummy breakfast and evening dessert bar this place is perfection at a very reasonable price. We travel with our two children and the rooms are large enough to accommodate us and all of our stuff. The rooms have fridges so you can bring drinks and snacks to keep in the room. In addition, they serve a very generous hot breakfast along with an evening dessert bar complete with warm cookies, ice cream, warm cobbler and a variety of drinks. Our kiddos love the pool also. It is nothing fancy but it is sparkling clean and just the right size to hang out and play. We have gotten the two queen room in the past but next time we will upgrade to a king suite which has a microwave and extra sitting area. I would highly recommend Branson's Best to anyone who is looking for a nice, clean place to stay with friendly service and a \"bed and breakfast feel\". We will certainly return time and time again!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Independence, Missouri", "Title": "“Honey, Stop The Car, This Is The Place”", "Author": "gettingold422", "ReviewID": "UR113491442", "Content": "Branson's Best, this will be number 1 on your list when in Branson. Spotless rooms, wonderful bedding, refrigerator in every room, granite counter tops, clean showers, Hot Breakfast that includes, cinnamon waffles made to order, biscuits and gravy, scrambled eggs, scrambled eggs with diced ham, peaches, mixed fruit, yogurt cups, Krispy Kreme Donuts, Bagels, Toast, 5 kinds of cold cereal, Oatmeal, milk, orange juice, strawberry kiwi juice, coffee, and flavored coffees, hot chocolate, peanut butter, jams, ketchup, sugar. Food bar is constantly maintained for cleanliness. Two dining rooms with seating outside also. Large clean outdoor swimming pool with plenty of lounge furniture. Special treat at night from 9pm-11pm, 2 different fresh baked fruit cobblers, Chocolate chip cookies and Vanilla Ice Cream all included with your room. Coffee is also available 24 hours a day. The staff is remarkable, extremely friendly and respectful.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Midwest", "Title": "“Great Place”", "Author": "Harmony_peace", "ReviewID": "UR112311217", "Content": "The hotel was a great place at a great price. The staff was friendly and courteous, and do a great job. Breakfast was good, although some fresh seasonal fruit would be nice, and fresh oatmeal for those of us who don't eat biscuits & gravy. The cobblers and ice cream in the evening was a great end to our day. Rooms were good size and very clean. Only disappointment was no coffeemaker in the room. If you go ask for a room on the 2nd floor so you don't have to wait for an elevator. All in all a very good place to stay at a reasonable price. Would stay again...........!", "Date": "June 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gainesville, Missouri", "Title": "“Great Hidden Asset in Branson.”", "Author": "Darrell1959", "ReviewID": "UR109328895", "Content": "Found motel on internet. Stayed in Branson several times, but this time was the best. I always look for cheaper prices, and found a good price here. When we arrived we not only got a good price but was surprised at the service and ammenities. Just to highlight a few, great breakfast, very clean rooms, very quiet, good location to all Branson attractions and I have NEVER seen a Hotel that puts out a great dessert bar at night after the shows are done. You have to try it to know why I say, exceptional. We come to Branson often and will definitely be using this motel or 1 of the 4 or 5 they have there again. They also offer money saving deals on a lot of shows, etc. If you book ahead of time they can get tickets for about anything.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“this was a very nice and comfortable place to stay and a great value.”", "Author": "Princess1960", "ReviewID": "UR107297975", "Content": "I am very particular when it comes to staying in hotels/motels. I was more than pleased with Branson Best! This was a great value and the room was very clean. Plus the free breakfast was exceptional. We would definitely stay here again.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carthage, Missouri", "Title": "“Branson's Best Motel is by far the Best stay in Branson!!!”", "Author": "My-Big-Family007", "ReviewID": "UR103614916", "Content": "This place is a reasonable price and the rooms have always been immaculate. We have stayed several times since their opening and feel as though Branson's Best is our home while we are in Branson. The staff is always helpful and curtious. The beds are so comfortable and the bedding clean. The motel is smoke free so there are no offensive oders. Each night they offer free icecream and cobbler. The Blackberry cobbler is my favoriate! Best of all it is centrally located at Green Mountain Drive where it intersects with Hwy 165. Green Mountain Drive is also known as the Yellow Route which runs parallel to Hwy 76 with several roads to take you up to Hwy 76 near your chosen theater or restaurant. I will never stay anyplace else.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“This was better than EXCELLENT!”", "Author": "haleyandheathersmama", "ReviewID": "UR103134047", "Content": "I have stayed in many motels in Branson over the years and Branson's Best is just that. It is the BEST! The rooms are very clean and they are nice sized. My friend and I went and took our kids. It was 2 adults, and 3 kids age range from 9-16 and we were not crowded. We even had enough room to place a full size blow up mattress on the floor for the younger kids. The beds are comfortable and clean. The breakfast is better than most breakfast at a motel. The night time ice cream and cobbler is great. The staff is always extremely friendly. I have never had 1 second of a bad experience with this motel. I highly recommend it. Make your reservations, you wont regret it! Follow them on facebook, sometimes they offer discounts on facebook.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Champaign, Illinois", "Title": "“clean comfortable room”", "Author": "JohnDoe1877", "ReviewID": "UR86096772", "Content": "Stayed there two nights. Wednesday and again on Friday. Was in a different town on Thursday. Mistakenly left slippers in the room on Wednesday. When we got back on Friday we asked and they walked out back and brought a plastic bag up that had our slippers in them. +1 for that. Room was clean. Checkin was painless. Late night snacks were a berry cobbler, and a peach cobbler. Also had soft serve non-dairy ice cream and some chocolate syrup. And, chocolate chip and sugar cookies. Nothing was homemade, but home baked. Lots of sugar in everything. Breakfast was: scrambled eggs, scrambled eggs w/little diced ham pieces, biscuits, sausage gravy, krispy kreme donuts, a waffle maker with waffle batter, bagels, 5 or 6 kinds of cereal.. some oatmeal packets.. and probably a couple of other things I've forgotten. Some meat would have been nice. The place next door was advertising $4.99 buffet breakfasts. Cost was $55 each night. A lot of places on the strip were advertising high 30s/low 40s. So, the value might not have been ideal. But, if you eat breakfast there, it isn't too bad. Walked to the Rankin Brothers show one evening. No sidewalk on the road that goes from Green Mountain up to the strip, but there was enough of a shoulder that we didn't feel unsafe at any point.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fresno, California", "Title": "“A most pleasant stay!”", "Author": "janbelt", "ReviewID": "UR85909765", "Content": "We came from California to attend a Billie Brim Ministries Prayer Meeting at the Hilton Convention Center. We read the reviews of this motel, and decided to try it. Six nights we were with them and found the place to be very clean, courteous, quiet, and economical. The breakfasts were adequate and the hot berry cobblers and peach cobblers with ice cream and coffee every evening, starting at 9:00 P.M.-11:00, were just the cherry on the top to make this stay quite delightful!!!", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Conroe, TX", "Title": "“First visit but not the last!”", "Author": "ftloos", "ReviewID": "UR83995045", "Content": "We contacted Branson's Best 6 months prior to our visit and had our list of shows. Within minutes we had our hotel reservations and show tickets reserved and paid for. The hotel was very clean, new comfy beds, new elevator, good breakfast & cobbler social, shower heads for tall people, location close to everything and extremely friendly and helpful staff. When, not if, I go back, I will definately stay at Branson's Best.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waynesville, Missouri", "Title": "“Wonderful!!”", "Author": "airbornerangerwife", "ReviewID": "UR73504417", "Content": "We stayed at Branson's best a few days ago and I would go back in a heartbeat. The staff was very friendly and helpful. The room was spacious. The bathroom and towels were all fresh and clean. We loved it. The pool was outside but had some shade in the afternoon. We enjoyed the cobbler and ice cream both evenings we were there. Breakfast was a good selection with both of my picky children being happy. The staff was right there to help with any questions and always pleasant. My husband was very happy that we had a strong wireless signal at the hotel. I recommend staying here on your trip to Branson. I know we will stay on our return trips to Branson. It was wonderful. Thank you!", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Very nice hotel”", "Author": "takeatripsoon", "ReviewID": "UR68452620", "Content": "We go to Branson every year and always stay at a different hotel. Branson's Best is one of the best places we've ever stayed. Great continental breakfast and nice evening Cobbler & Ice Cream after the shows. Enjoyed talking to other guests about what good shows they'd been to.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Independence, Missouri", "Title": "“Great place to stay”", "Author": "Samster714", "ReviewID": "UR67495968", "Content": "We stayed 2 nights. Everything about the place was great. The room was very clean. The free breakfast was very good. 2 kinds of scrambled eggs, biscuits & gravy, waffles, fruit, etc. In the evening they had free ice cream, cobbler & cookies. VERY yummy! And it was all free. The pool was a little small, but it seemed that the pools we saw at other hotels were small also. Not really an issue for us. Just got into it to cool off. All the employees we encountered were friendly & helpful. I would definitely stay there again", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“I Don't Know Why Anyone WOULDN'T Give It A Good Rating...”", "Author": "scooby1214", "ReviewID": "UR64368235", "Content": "The customer service has always been great, the rooms are well-kept and tidy, the location's very good... We stay here every time we come to Branson, and we plan to continue that way!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“great stay, friendly and helpful staff”", "Author": "roamers76", "ReviewID": "UR64295447", "Content": "Our family has been staying at Branson's Best for years. We have found the hotel to be clean, maintained well and feels safe. They have a nice little breakfast buffet to grab a bite before you head out in the morning...get there early though to have some choice. They also have dessert later in the evenings too. The staff has always gone out of their way to help us choose fun shows and attractions to see. The motel is on Green Mountain Dr which is central and close to most attractions. It is close to Walmart., Mc Donald's, putt-putt, Bread Company etc...great for families. Now that our children are grown...we are looking forward to bringing our grandchildren to Branson to stay for vacation..at a price we all can afford.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jefferson City", "Title": "“Great Place”", "Author": "TerboyJeffersonCity", "ReviewID": "UR60335912", "Content": "This was our first time staying in this motel but won't be our last. Place was extremely clean in general. Room was very clean and roomy. A refrigerator is in the room but no microwave. Hair dryer, iron, and ironing board. Breakfast in the morning include Biscuits and Gravy so no need to go anywhere else for breakfast. Cobbler at night with ice cream was great. Great location. Mattresses are more comfortable than I usually find in a motel. My only complaint is there were only two visible electrical outlets.", "Date": "April 4, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Jacksonville, AR", "Title": "“Great price, clean rooms, wonderful cobbler and breakfast”", "Author": "Tom-Brenda", "ReviewID": "UR59184635", "Content": "We stayed at Branson's Best a few nights, the rooms didn't have many frills but a nice granite counter top for the sink area. It was very clean and the beds were Comfortable. They are building an elevator which will make it nice in the future. The breakfast was good and the dessert bar in the evening with the cobbler was really nice. The price was very reasonable.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "St. Louis", "Title": "“Not bad for the price...”", "Author": "arat18", "ReviewID": "UR38416630", "Content": "Our past few trips have been during the Christmas season, and we normally stay at the Thousand Hills Comfort Inn. It was priced over $100/night for summer, so I decided to stay here due to budget constraints. I thought it was a nice, smaller hotel. We had a king \"suite\", located on the end of the building (thought it was nice and quiet til the morning we left, the proximity to the stairs created a lot of noise on Sunday when everyone was leaving). Nice sitting area in our room with couch. We had fridge & microwave, but didn't use them. My only complaint about the room was that the bed was a little hard (and I can pretty much sleep anywhere - after our 3 night stay, I was ready for my own bed). The breakfast area was fine, typical contiental breakfast, although it was nice to have scrambled eggs. The poor nice guy working it worked his butt off to keep up! Did enjoy the ice cream in the evening. I would like to try the sister hotel - Savannah House for my next stay.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bonne Terre", "Title": "“simply the best...outstanding breakfast and snacks..clean..nice location”", "Author": "felinajo", "ReviewID": "UR37775616", "Content": "I loved it! It was recommended by a very picky Sister of mine and she was right! CLEAN..comfy and outstanding rate!! WONDERFUL breakfast and delicous snack in the evening of 2 varieties of cobbler along w/ice cream! Maid was very good..changed towels and made of beds..etc. I love the fridge in the room at no extra charge! We will for sure go back...cause they have biscuits and gravy for breakfast :) THANKS Bransons Best you are what you say you are!! See you this fall for the Christmas lights.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Defiance, MO.", "Title": "“Lives up to it's name!”", "Author": "JJWDefiance_MO_", "ReviewID": "UR31235661", "Content": "We always try to stay at different places, in Branson. We go every year. I did a lot of research on motels before we went. This place, is nice for twice the price. Great everything.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Missouri", "Title": "“Another Wonderful Weekend at Branson's Best”", "Author": "Insuregal", "ReviewID": "UR27929217", "Content": "Since we had such a great stay in November my husband and I went back to Branson's Best for our weekend fishing getaway. (Would there be the same quality service and delicious food as before? We needn't have worried.) This time we stayed in room 100, a king room that had a refrigerator. Since we are trying to be more budget conscious now it was great to be able to take our things out of the cooler and store them without worry. We had salads, sandwiches, soda and bottled water to save on our eating expense. Then when we included the superb breakfast provided each morning it was a very economical weekend. There are two sister properties that provide the same breakfast as well as the evening dessert. (We like this one for its close proximity to the trout fishing water; just hop on 165 and head south to Lake Taneycomo.) I did ask about the other two properties. The front desk clerk told me that they are run exactly the same way. However, if we ever travel with folks who need an elevator to get to their room then we might want to try Whispering Hills. When I come back with my mom we might give them a try. Although there are two levels at Branson's Best that are ground level. That is one cool thing about Branson's hills- all the ground floors in a three story lodging!", "Date": "April 13, 2009"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Burlington, Iowa", "Title": "“Very Nice Motel”", "Author": "eemcz", "ReviewID": "UR18458364", "Content": "We very much enjoyed our stay at Branson's Best. The room was completely redone with new furnishings and very nice. It was very clean and housekeeping did a great job every day. The pool was nice and clean and we almost had it to ourselves. Breakfast was great as was the evening snack of cobbler, ice cream and cookies. We could not hear anything from the other rooms. We generally stay in a condo and prefer that, but would stay here any time we need a hotel. It was a great place at a great price.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "austin,tx", "Title": "“Very overrated-very disappointed !!”", "Author": "txmar", "ReviewID": "UR18054412", "Content": "We thought this was going to be a great bargain and a great motel to stay in according to what we had read here. I don't know who is writing these glowing reports,but this motel was a HUGE disappointment. FIrst of all, I must say most of the room seemed clean until we saw the mattress and boxspring. There were small brown stains that were visible on the bottom edge of the mattress and boxspring . The sheets were so thin you could see the striped matress below,and the boxspring was completely uncovered. We stayed. on the bottom floor because I can't use the stairs easily. THERE IS NO ELEVATOR! There are two floors,and every step can be heard above you on the outside corridor above . There were children running back and forth and you could hear every thump of their steps. The walls were thin and you could hear people talking in the next room.The drapes do not close well and anyone passing by can peek in. The bedspreads were threadbare and needing replacing. The ironing board is behind the bathroom door,and it is awkward to remove . The front desk lady was very pleasant and the breakfast was fine,also the cobbler and ice cream in the evening was good,but it was not enough of an inducement to stay another night. Branson has many,many hotels and motels that are nicer and very affordable. We stayed at the Holiday In Express for just little more than we payed here,and it was a world of difference, We payed 65. for the room,and it was a ripoff. Do yourself a favor and don't stay here.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St.Cloud MN", "Title": "“Excellent place to stay”", "Author": "Cycleguy67", "ReviewID": "UR17129335", "Content": "Branson's Best is an excellent place to stay while vacationing in Branson. We found the hotel to be very comfortable and the staff was very helpful. The rooms were very clean and updated. It was a very good decision to stay here while we were on vacation. The breakfast in the morning is very good and the ice cream and cobbler at night is open when you get back from your 8pm show. It is a nice treat after a busy day.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Topeka, Kansas", "Title": "“Loved this place!”", "Author": "midwesterner1kansas", "ReviewID": "UR16580525", "Content": "This is a great place!!! The rooms are very nice as well as being clean and affordable. They offer a hot breakfast which is included with your stay, as well as a nightly hot cobbler and ice cream social in the lobby. The owners are very nice and seem to truly want to please the guests. We definitely will stay here again!", "Date": "June 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Channelview", "Title": "“Branson's Best is the BEST!!!”", "Author": "SuzyQChannelview", "ReviewID": "UR16322158", "Content": "Branson's Best is a GREAT place to stay for the price. If you are looking for affordable accomodations then Branson's Best is for you. You will get a nice, clean room, a free breakfast, and cobbler and ice cream at night. The staff is the friendliest I have ever seen at a hotel and if you have any questions all you have to do is ask. We arrived early on the day we checked in and the manager went out of his way to accomodate us with no extra charge. You can be sitting outside and the manager will come up to you and start talking. Very friendly staff. If we go back to Branson, we will be staying at Branson's Best.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bartlesville, Oklahoma", "Title": "“Branson's Bets”", "Author": "PattiV", "ReviewID": "UR10023665", "Content": "Just returned from a 3 night stay at Branson's Best. The room was very clean and comfortable. I liked that they had all the little extras...hair dryer, iron and wi-fi internet access. The price was not bad, moderately priced. The breakfast was okay, the only draw back was it is a small area and I was really put off by a large group of hotel guests hogging all the tables after they finished thier breakfast, but that is not the hotels fault. Really enjoyed the Cobbler, Ice Cream and Cookies in the evening. The hotel location was great for us. It is off the main strip but really easy access to all attractions. My only real complaint regarding the hotel is that this is a typical older hotel, where you can hear lot's of the noise from outside and your neighbors. Part of the problem is really inconsiderate people who stand outside your hotel room door late in the evening and talk, or parents that don't mind that their kids and they are running or roller skating along the walk ways. Again this is not really the hotels fault. I visit Branson several times a year and will stay at Branson's Best again.", "Date": "September 30, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tulsa, OK", "Title": "“Not The Best, But Not Bad”", "Author": "ProPoke", "ReviewID": "UR8375998", "Content": "If you have been to Branson, you know how many old nasty motels are there. Compared to these old motels or inns as many are called, Branson's Best is awesome. Compared to Cheatau on the Lake or one of the better hotels though, it doesn't compare but it is a lot less expensive too. Let's start with the good things first. We were moved from Whispering Hills property which we agreed to. We did not have to change and the staff was very nice about it. For moving, we were placed in one of the suites which has a refrigerator, a microwave and extends the length of the room the size of a love seat which it includes. So I have to thank the staff for putting us in a suite. The bed was a king and they are of average comfort. I can sleep on just about anything though so it was fine. The size of the room was above average. The TV is at least a 27 inch so it was sufficient too. Not a great TV as the speakers would distort or the metal casing was rattling, not sure which one it was but the sound would have to be pretty high for this to happen. I didn't notice any sound coming from any other rooms but we were at the very end. The only sound I would hear is when somebody was rolling their suitcases to their room. That would make quite a bit of noise but it didn't happen frequently. We were upstairs too so this may have helped with not having too much noise. Branson's Best offers a breakfast adjacent to their office and I thought it was excellent. They offer make your own waffles, scrambled eggs, bageles, breads, fruit, 3 cereals, biscuits, gravy, grits, orange juice, apple juice, I know I am leaving some things off the list. It's not everything under the sun but there is more than enough to choose from. It is served from 7:00 am to 10:00 am. From 9:00 pm to 11:00 pm, blackberry and peach cobbler is served along with cookies and ice cream. It's very good. The location of the hotel is pretty good. It's located on the yellow route just off Gretna Road. Nearby is Legends and the Titantic exhibit. Now let's go over the things that could be improved. It took quite a while to get the air conditioning to where it was comfortable. Either we would be hot or would be freezing. After two days, we found the right setting. Not a big deal. The air conditioning was leaking into the wall so the sheetrock was very soft around it plus there was brown streaks leading from the wall to the tile located at the front door. The bathroom doesn't have a fan to remove the steam so it gets pretty steamy in there. There is a sign stating the bathroom is continuously ventilated and maybe it is. There is a vent located in the bathroom but I sure couldn't hear anything in there such as a fan. It would be nice if there was a real fan that removed steam immediately but again, only a minor problem. I was hoping to see a restaurant by the hotel and there was one called Choppers if I remember correctly. However, it was closed every time we tried to eat there which was Thursday night at 9:00 pm and Friday around 8:30 pm. There is a restaurant fairly close but not in walking distance called Uptown Cafe. Do not eat there unless you like knats flying around your food. There are a lot of motels or inns in Branson that charge around $35.00 a night. They look something out of the Bates Hotel. The price per night at Branson's Best is around $50.00 to $60.00 a night. It looks much better than these other places. Then there is Cheatau on the Lake that offer some really nice rooms and amenities. However, you will pay a lot more than $60.00 a night. I was pleased with Branson's Best. It's not fantastic nor it is awful. It is what I expected which in this case, that's good.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“The name FITS”", "Author": "cajunladyoklahoma", "ReviewID": "UR8370065", "Content": "I recently stayed at this property and absolutely enjoyed everything. When I booked the dates I wasn't expecting the best because I knew this was an older property, but to my surprise it was wonderful. They had completely refurbished the lobby and rooms with an updated decor everything was very clean and comfortable. The room was spacious and they had put in new shower heads that were tall and wonderful. (I hate doing a backbend to wash my hair) The breakfast is the best hotel breakfast I have ever had, they not only have all the \"continential items\" but in addition, they have several warm items with Meat. Everyone was friendly and very helpful. The property was kept very clean and maintained very well. The pool is set back so you feel private from all the traffic in the Branson area. We will definately make this \"our hotel of choice\" every time we visit the Branson area. The name definately FITS!", "Date": "August 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belton, MO", "Title": "“Nice place to stay”", "Author": "MOracefan", "ReviewID": "UR8230432", "Content": "We enjoyed our stay at Bransons Best! A travel agent friend suggested it and she was right. The rooms were clean and comfortable and we liked the location-not right on the strip but close enough. We could have walked to attractions and restaurants, and there is a restaurant on one side and a convience store on the other. The ice cream and cobbler were a nice extra and the breakfast was big enough for our needs. When we arrived, our TV connection was broken, but it was fixed within 10 minutes. We would stay here again!", "Date": "July 24, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "joplin", "Title": "“very pleasant”", "Author": "kitty66joplin", "ReviewID": "UR8061812", "Content": "Very nice staff, we arrived about 4 hours before check in and they rushed to clean our rooms so there was only an hour and a half wait to get into the rooms. We were told that one room was short 4 wash cloths that we never received but then we didn't contact the front desk either. The rooms were very clean, and comfortable, the pillows were a little flat and the bathroom door was very hard to open and close. But it was an over all nice stay, and we would stay there again.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“A Truly Great Place”", "Author": "ARKTraveler54", "ReviewID": "UR7282178", "Content": "We have stayed in many hotels in Branson and we can honestly say Branson's Best is at the top! The service was excellent and the room was beautiful. The location is perfect, not too close and not too far from the happenings. The breakfast is great and the night time dessert of hot cobbler and ice cream was tremendous. And think about it...FREE! Can't beat a deal like that. When we checked out, we told the clerk that we would be back, and we will!", "Date": "April 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "OK", "Title": "“Simply the Best”", "Author": "beautybiz", "ReviewID": "UR7260500", "Content": "We have been going to Brasnon for years and have had some good and some pretty BAD experiences with motels. This one is the best motel we've stayed in anywhere. The rooms are so clean and the extras you get make this an outstanding value. We always try to book early for fear of having to stay somewhere else. Try it you won't be disappointed!", "Date": "March 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Holmen, Wisconsin", "Title": "“Surely one of the best”", "Author": "gloworm22", "ReviewID": "UR7184690", "Content": "As first time guests of the Bransons Best Motel, we can only sum up our experience as being one of the finest, for value, cleanliness, hospitality, tasty continental breakfast, and a yummy evening treat, consisting of your choice of either Peach or Blackberry Cobbler with ice cream. Desk staff was friendly & courteous and extremely accommodating to your every need. The upper half of their updated construction was supervised and controlled by the owners, allowing no interruption to guests, with absolute consideration for noise during the morning hours. Our room was on the lower completed side of the building which was quiet with comfortable beds, nice fluffy towels, new carpet, freshly painted from top to bottom, new TV, the usual amenities, new iron & board, a curved shower rod and best of all, SOFT WATER. Housekeeping maintained this fine room in perfect condition during our 6 day stay. We will certainly book our stay with Bransons Best during our next visit, perhaps as permanent residents. Jerry & Patty Osborne - Holmen, WI", "Date": "March 18, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "dewey, ok", "Title": "“problems”", "Author": "anniedoodle", "ReviewID": "UR7160998", "Content": "We had heard very good reviews about this motel. We made reservations weeks ahead for 3 nights with a first floor room. I called 2 days before to confirm it. They assured me of our reservation. My husband has bad knees and it is hard for him to climb stairs. When we got there they only had us down for 2 nights and had us on the 3rd floor. They did finally put us on the 2nd floor but we did still have to climb stairs as the front side of the motel was having construction done. The breakfast and evening cobbler were great. Room was very clean except for the bathroom floor and the ring in the tub..", "Date": "March 14, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "St. Louis MO", "Title": "“Branson's Best Motel REALLY cares”", "Author": "Chezie2010", "ReviewID": "UR5361471", "Content": "We, as people, want to be heard. This is one of the reasons we have forums. We, as people, want to make sure we get the best deal for the money. This is why we use websites such as this one. We, as people, often take what others may say as the truth instead of realizing there are always 3 sides to every story, your story, my story, and the real story, before making our decisions as to how to judge the situation. Have you ever ate at a restaurant and the food was great? You go back again and it was not as good as before? Maybe a different chef was working that day. If it's real bad, you contact the Manager. If the Manager doesn't seem to help, you try to contact the owner/s. Did you try to contact upper management and/or the owners? Finally, my wife and I have always had a wonderful experience with this motel. Very friendly staff, great breakfast (we have stayed at many hotels in our travels and have never found one to have scrambled eggs, biscuits and gravy, waffles and all the other items for FREE on any continental breakfast!), and we have met the owners who are the kindest, caring people who's main interest is satisfying their guests. We have been repeat guests of theirs for over 9 years, not because of the price, but because of the service, the breakfast and the CARE. It's unfortunate you did not have a pleasant stay, but they have repeat guests year after year and that means something. We love Branson's Best Motel!", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "3"}, "AuthorLocation": "NW, AR", "Title": "“Definitely not Branson's Best”", "Author": "bdb1985", "ReviewID": "UR5304716", "Content": "The family and I vacationed in Branson this past June weekend to see a special concert. As usual, we consulted Tripadvisor for recommendations before we booked our hotel. Imagine our delight when we came across the listing and reviews for Branson's Best. From all reviews, pictures and descriptions the motel sounded almost too good to be true. The rooms were pictured as nice sized and clean and the amenities listed were aplenty, especially for the price. We didn't hesitate but booked a two night stay at once, confident we'd chosen well. Unfortunately, that's where the happy part of this story ends and the sad part begins. Before we mention everything else we should say this: the room we had was clean, not as big as some but big enough, reasonably comfortable and air conditioned. The property itself was as pictured; clean looking, well-kept, not overly out of date. That said: We knew right from the moment we stepped into the lobby there was something not quite right. Instead of the warm welcome feeling one should get when entering a home away from home we were met with a blank stare- a glare of indifference. The way we were treated was no better: not hostile or rude, per se, just an air of mechanism. While the motel's website claims this motel is family owned it was remarkable how little the clerk (later identified as the manager) knew about her own property. We were not provided any details about the facility such as if and when breakfast was provided, notified about the advertised evening reception nor given it's time, provided any mention of the property's pool or vending services nor check out time. We were, however, forcefuilly issued the motel's time for check-in as we had apparently arrived somewhat early. When we inquired about the pool closing time the clerk said she didn't know for sure. The advertised \"25 item breakfast\" is probably just that if you included the butter, syrup and juices, coffee and water and perhaps the paper plate and cup. Sorry about that, don't mean to sound sarcastic but this was by far the most pathetic \"breakfast\" we've come across at a motel in many years. After we ate what little they offered we went down the street to IHOP and had a real meal (and we don't eat that much for breakfast.) There was no one on duty to assist us in the office when we went to ask about getting some aspirin late at night so so much for their 24-hour staffing claim, too. Also, the room's iron spewed out rust onto my favorite short sleeved shirt for which I am truly not too thankful for. Fortunately I was able to get the stains out before they set. Additionally, if your room is anywhere near the office area beware: you will hear lots of noise at any time there is people checking in, checking out or eating breakfast or late evening snack. If you're a late sleeper- say any time after 6:30am- you can forget it. We could go on but you get the point. The problem with this motel is mostly not the motel itself- it's the people. If the motel's owner's would simply staff the motel with people that made you feel welcome when you arrived, thankful you're there when they interacted with you, and actually knew what they were doing, this would indeed be a nice place to stay (sans the rooms next to the office and the breakfast, of course.) By the way, we couldn't wait to get out of there so we left bright and early the very first morning after we arrived even though we didn't even know if another hotel would have a room for us or not for the remainder of our stay in Branson.", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Wonderful place to put your feet up”", "Author": "A TripAdvisor Member", "ReviewID": "UR5211765", "Content": "This is a great place to stay. My husband and I felt very comfortable there. They were EXTREMELY friendly and even got us discounts on our show tickets. The cobbler and ice cream are fabulous. We even recommended it to my Grandparents. They are 73 and 71, they came back with wonderful marks for this motel, too. We are planning on a trip in June, and want to stay here. In fact, we have already made reservations and were offered additional discounts on the room and tickets for shows.", "Date": "May 24, 2006"}], "HotelInfo": {"Name": "Branson's Best", "HotelURL": "/ShowUserReviews-g44160-d280644-Reviews-Branson_s_Best-Branson_Missouri.html", "Price": "$66 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3150 Green Mountain Dr</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "280644", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/57/52/bc/branson-s-best.jpg"}}