{"Reviews": [{"Content": "Don't do it This could be the worst hotel I have ever stayed in. You know you are in strife when the info folder in your room is littered with spelling mistakes on most of the pages.The only two positives are the location and the price. As far as I could gather there was not a single thing that would recommend the hotel.I booked on Wotif for around $95 a night (including breakfast). I was given the key to room 105 from one of the two shabby disinterested blokes behind the counter.Room 105 is on the first floor with New South Head Rd just outside. The combination of the world's noisiest road and the least sound proof room in the world was not a good one. It seriously is as if you are sleeping on a park bench outside such is the noise level. It's possible that rooms on the other side of the building are quieter.The room was also as grubby as any you would ever hope to see. Cobwebs everywhere on window sills etc. The TV was made in about 1980 and is located in the wall up near the ceiling (for those of you with neck problems).After one night of this madness I tried to move to another room on the other side. They told me that this would be possible but I'd have to incur a $25 room move fee (despite the fact that I had not been back in my room since it was serviced that day)! I declined and toughed it out for another evening.On the positive side this is a superb location. Edgecliff train and bus station across the road and you are only a short walk from Double Bay and its very flash cafes and boutiques.Only stay here if you are desperate, don't need a good sleep and don't have much cash. Backpacker rooms would be preferable to this slum.", "Date": "Dec 20, 2008", "ReviewID": "UR964930256", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "AMP1618"}, {"Content": "Not a nice place This hotel was unpleasant from the start . From the minute we arrived we experienced less than satisfactory treatment. There wasnt a smile to be seen just a very stern attendant at the reception. We had booked a double for 1 night and found are room clean and that was about it. We ecperienced leaking aircon that dripped like a sieve all night long. The aircon was an old model and not the kind you would expect in a 3 star hotel. We were told that there was a lovely view to be had in the dining room and so we ventured down to see and were promptly told to leave as we had to have permission to go in which i thought was handled quite odd, Considering it was lunch time and we were guests. I know that many people dont smoke which is fair enough so we asked if there was any place in the hotel or perhaps a nice covered outside area to go an quietly have a fag. we were told we would have to go and have a ciggie in the car park as there was nowhere else . The place is also not licenced to serve alcohol so i thought that was strange. Overall we were not made to feel welcome so we will not be returning . Not may facilities only dining and internet. The lift was also quite grubby and had seen better days.........Poor hotel", "Date": "Nov 16, 2008", "ReviewID": "UR893732685", "Ratings": {"Service": "1", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "3"}, "Author": "phillipislandfamily"}, {"Content": "Quite the Gem! I have stayed here numerous times and let me tell you, it's a really great hotel. The room itself is very spacious! If you're there in the winter, this hotel was the warmest hotel i've stayed in in the Sydney area. They have dual airconditioner/heater and it allows you to choose your desired tempreture. VERY desirable! Colour tv with basic channels. Very clean. Located between double bay, and right across the street from Edgecliff train station (which is 6 stops from Central Station or 1 stop from Bondi). Staff were more than helpful, and will store bags if you need to check out after their check out times. They have an internet kiosk for a really reasonable rate. They also offer room service, and has a basic cafe. I've always had a great night sleep and felt very safe as a single female traveller. I'll go back here any and every time I go to Sydney!", "Date": "Aug 18, 2008", "ReviewID": "UR489873998", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Zoolg"}, {"Content": "nice stay       bathroom", "Date": "Apr 23, 2008", "ReviewID": "UR704402374", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "kiwipaul_8"}, {"Content": "Budget hotel in great location in Sydney's eastern suburbs I have stayed at the Metro Inn Edgecliff a couple times in recent years, the most recent visit was in mid-2007. In each case it has been for a night before catching a flight early the next day. If you search through the last minute type websites for hotel bookings, you can often find a standard or budget room here for a very low price (for Sydney). I think I paid around $A82 for a room with a double bed. Is it worth it? My answer is YES. Firstly, you will struggle to find a hotel at this price point in Sydney. And if you do, it is not likely to be in this area. Edgecliff is two train stops from the city (Martin Place -- Kings Cross -- Edgecliff -- Bondi Junction) and one from the Cross. The train station at Edgecliff is a couple minutes walk from the hotel. The hotel is a short walk from Double Bay and Woollahra, two of the glitziest suburbs in Sydney. You could also walk to Kings Cross from here (about 10-15 minutes, a bit uphill). And you're only a few minutes on the train from Bondi Junction (which is NOT Bondi Beach I hasten to add...) The rooms are clean but basic. The bed is fine, there's a small table and chair, a desk, television, wardrobe space, and a reliable bathroom with a hot shower. All neat and tidy. The only downside is that it is a bit noisy - so bring earplugs. Firstly, try and get a room away from ye olde elevator, because it really is a clunker. Secondly, New South Head Road is a major thoroughfare in Sydney, so traffic is always busy. Ask for a room on one of the top floors. My tip would be to not take the option which includes breakfast - it is nothing special. Save some money there. You can get some food from the Edgecliff centre nearby.", "Date": "Feb 26, 2008", "ReviewID": "UR898779240", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "The_Made_Guy"}, {"Content": "Good value for money This is still one of my favourite value hotels in Sydney. Easy access to both trains and buses to the CBD. Far from the nicest room in Sydney but the staff is always friendly and helpful. Don't expect the Hilton but a comfortable, traditional motor lodge.", "Date": "Oct 19, 2007", "ReviewID": "UR484871751", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "MidwestGuy11"}, {"Content": "Budget Hotel punching above its weight We stayed at the Metro Inn Edgecliff over NRL Grand Final weekend 28 Sep - 1 Oct 07. We arrived at 9.30 am and whilst the rooms were not scheduled to be ready until 2.00pm the staff went the extra mile to get us in early. We managed to get to our room at 10.30 am. We had a harbour view room which gave an uninteruppted view from Double Bay through to Manly. The extra few dollars for a harbour view is well worth it. The rooms are not large but are airconditioned. The rooms were clean, maintained daily and came complete with toiletries in bathroom. Bathroom facilities comprise shower over bath, toilet and handbasin. Small refridgerator, TV and a queen bed.Cheap continental breakfasts available for $5, communal newspapers in guests lounge. Internet available in guests lounge, no broadband wifi or cable TV in bedrooms.The hotel is five minutes walk from Edgecliff tube station. Train station complex has a small supermarket, coffee shops, bakery, butchery and pharmacy to meet any unplanned emergencies.Hotel staff were very friendly and welcoming. We thoroughly recommend this establishment where a budget is important. Rooms are available on a number of internet booking sites at up to a third of rack rate.It will be our home in future on our annual footy pilgrimage to Sydney", "Date": "Oct 1, 2007", "ReviewID": "UR860024621", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "beanb41"}, {"Content": "Basic Harbout View Room Good Value Friendly Staff Stayed over night as it was walking distance to a wedding and close to the train station for getting to/from the airport and visiting some mates.It was clean, good value for money, with great views and the tea, toast and ceral for five bucks was a bargin in Sydney, it had aircon and the bed was not spongy.The staff were helpfull they let us check in early and even let us eat breakfast just after it had closed. They lets us leave our bags after we checked for four hous. They gave great directions to a funcky cafe on the Bay. The train was great and it was only ten bucks in a taxi back from the city at 2am.On the down side, the lift was crappy and the doors were noisy but at a hunderd bucks for the location, the transport, the breakfast , the staff and the view I thought it was good.Tips, get on the harbour side and level 3 or higher (we didnt hear any traffic), eat the breakfast, leave your bags in the lock up on the last day and be nice to the staff and they will probably be nice back!", "Date": "Jan 28, 2007", "ReviewID": "UR844372055", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Kabwe"}, {"Content": "very basic Main road location handy to bus,rail etc.Rooms small but clean,no bath (taps have been dissconnected)..shower only Poor TV reception/selection (3 channels only..no cable) Car park very small,tricky to park..but at least it was free...Very difficult to exit carpark to main road due to heavy traffic flow...patience is needed.Rear rooms offer great views over harbour...worth trhe extra few dollars.Overall I would say it was value for money,about 30% cheaper than most other hotels I have stayed in,so must take that into account.Biggest gripe was they did not accept Amex card...very unusual", "Date": "Nov 13, 2006", "ReviewID": "UR647380536", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "concupnz"}, {"Content": "Cockroach Inn Arrived in room to find a very out dated room with two single beds yellow painted walls and purple painted furniture! It looked nasty!The room was also very noisy due to the busy road just a few feet from my window! The lift also made a loud noise as it went up and down all day so ear plugs needed.So after a long flight I thought Id take a quick nap if I could with all the noise of the traffic. About 3 hours into my sleep the fire alarm went off so I had to get dressed and get out onto the street only to find out the water boiler had sprung a leak and the steam had set the smoke detectors off. There was no hot water for approx 8 hours after. Not a good start!The hotel was very close to the train station which was very handy.There were several other problems with the hotel like the lift was out of order one of the days. I ordered a take away as recommended by the hotel but the hotel couldnt supply me with a fork to eat it with! There were also plenty of cockroaches to liven us up during our stay!!As this was a budget hotel I was prepared to take a drop in quality but this was well below the standard I expected.I will never stay here again!!", "Date": "Sep 26, 2005", "ReviewID": "UR609549398", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Old and grubby Not what I expected. very small place on a busy street, I drove past twice before realising that was my hotel. It was old (60's style), run down and quite dirty. My room was down-at-heel, paint peeling off cabinetry, evidently they'd 'updated' it some time ago with turquoise paint. There was adequate room, and the bathroom was OK although they had soap and stuff in dispensers, and half of them were empty. Air conditioner was whirring away, but not actually cooling anything. The TV remote was missing its battery panel. No SBS that I could find. Although checkout was at 10am, room service were trying to get in before 9am. There was a jug for teamaking, and a small fridge, and that was that. I won't be staying there again.", "Date": "Apr 29, 2005", "ReviewID": "UR431478326", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "ant100"}, {"Content": "1浜烘梾銈掑揩閬┿伀銈点儩銉笺儓   showReview(19158666, 'full');", "Date": "Sep 2, 2006", "ReviewID": "UR325364306", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d281265-r22879599-Metro_Inn_Edgecliff-Sydney_New_South_Wales.html", "HotelID": "281265", "Price": "$70"}}