{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "LONDON", "Title": "“Looking for a bed then it's fine”", "Author": "JudithChalmers09", "ReviewID": "UR128884589", "Content": "I stayed here for one night- hotel is average. Rooms were fine and clean - nothing special but not terrible. Service was somewhat slow at check in/out and at the bar of an evening. Bar and restaurant are basic . If your using the hotel to sleep the it's fine, anything more than 2 nights then you could go mad. Wifi is non existent so if you plan to do work in you room think again. Breakfast was average, shuttle to office in complimentary bus was a added bonus.", "Date": "April 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brownsburg, Indiana", "Title": "“Acceptable hotel for business trip”", "Author": "Aaron F", "ReviewID": "UR128583936", "Content": "This hotel was moderate and okay for business travel. The wireless internet was so-so but didn't work at times and was fairly slow. The front desk was very helpful and accomodating to a non-Spanish speaker. The hotel bar serves food when the restaurant is closed and the quality was good. I have stayed at this hotel twice and will continue to use it for business travel due to it's location.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "NYC", "Title": "“Average accomodation for business trip”", "Author": "eil83", "ReviewID": "UR128423531", "Content": "-Internet in rooms is extremely poor - wireless doesn't reach to all rooms and hook ups in many rooms don't work -Water in shower goes from very hot to very cold often while showering -The room was clean when I arrived, but they did not clean much on a nightly basis -Staff is not very accomodating -Breakfast is great -Close to the metro (hour ride into downtown Madrid) -Very hot in rooms, had to sleep with the window open, which was very loud because the hotel looks out onto the highway", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kolkata (Calcutta), India", "Title": "“Good hotel for Business Travellers”", "Author": "soumiunq", "ReviewID": "UR124700633", "Content": "I stayed 2 nights at this hotel. It is a standard comfortable hotel for business travellers. Breakfast is adequate, but the restaurant did not operate the evening I was there. I had to make do with a sandwitch at the bar. The bartender was very helpful and a real nice guy. The hotel has free internet, but it doesn't work !!!!", "Date": "February 17, 2012"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Odessa", "Title": "“Good choice for business travellers”", "Author": "LunaticoOdessa", "ReviewID": "UR118255243", "Content": "Hotel is not something special but it has everything a business traveller might need. More or less convenient location, excellent breakfast, quiet rooms, pool, good service. We were group and hotel provided us with daily shuttle service from hotel to office and railway station. That's a plus. However restaurant food was average and really far from being cheap. Room I stayed was a standard one which could be a bit more clean. My opinion hotel deserves fair 3 stars.", "Date": "September 18, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "La Murta, Spain", "Title": "“Very expensive food and drink, soulless”", "Author": "lamurta", "ReviewID": "UR110662982", "Content": "No eating or drinking options near the hotel. So only option is hotel food. Which is really expensive and not that fantastic. The rooms are OK, but not anything special.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London", "Title": "“Stop people smoking in your rooms!”", "Author": "Claphamguy", "ReviewID": "UR91885257", "Content": "This place stinks of smoke. Unless you want to feel like you've been in a seedy bar all night I suggest you stay somewhere else. It's certainly not 4* standard. There are much better hotels nearer the centre of town - avoid this place.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“Not 4 star standard, a let down”", "Author": "supermum_10", "ReviewID": "UR85858121", "Content": "My family and I stayed at this hotel for 1 week, my husband was on business and we were house hunting in the area. The hotel was a little tired around the edges, chipped bedroom furniture etc. The entrance felt cold and we felt the staff made more effort for people attending conferences than guests. The breakfast was not exciting and on the last day of our stay there was no butter, which is a key essential at breakfast time! We found on a couple of occasions at breakfast time that where were no cups and saucers left and the tables were unlaid. The walls were thin and the wooden/laminate floors were noisey which meant we could hear people walking around in the neighbouring rooms. I also agree with another reviewer the smoking in the entrance of the bar/cafe is not pleasant especially if you have a child with you like we did. On the plus side the swimming pool on the roof was nice, although there were no poolside towels which meant using the towels from the rooms, despite saying in their manual not to.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good for business stay, not so much for tourists”", "Author": "Dorotka_BS", "ReviewID": "UR81951131", "Content": "Some reviews of the hotel that I read before the trip were pointing out poor quality of the hotel and outdated interiors. As much as I agree with the latter - walking thru the corridors you can barely admire anything modern, the quality has improved greatly. The rooms are comfortable, beddings fantastic, bathrooms well fit. Disadvantages: terrible noise from the streets running just under any window (forget opening it for the night) and similarly bad noise from the A/C fan. Breakfast buffest moderate but with considerate amount of fresh fruits. From AMura you can take a short walk to the nearby Commercial Centre (or use a free shuttle from the hotel; also provided to the airport) but if you're planning to do any sightseeing - that's a long ride with either Metro (up to 1,5h) or a taxi.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“One of my worse business traveler experience”", "Author": "philippe_cwt", "ReviewID": "UR81368871", "Content": "I cannot believe some can rate this place more than 2. I stayed 2 nights for business. Four stars hotel actually worth 2:you can hear everything from neighbor's room! My colleague staying room next to mine could hear me type on the keyboard! And the hotel very often lodges sports group Staying awake very late. Hotel is very old with outdated and basic furniture, pool is small (but clean) with ugly surroundings and old floor that does not make you want to walk on it Breakfast is a mediocre: no more coffee at 7:30am witha lazy hostess. Buffet very badly set with bread heater that does not work. Only value is the 15-20min drive to airport..ok shower (recent!) which let water soak the bathroom while you shower. What a poor and disastrous experience. Staff not friendly and location horrible. Please don't go. Not worth the rate promotions they display everywhere: you don't sleep well, you don't eat well, you don't feel welcome and do not realize how Madrid can be great. Four stars...What a joke.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Avoid Dinner at this hotel”", "Author": "TheRoliingMcStones", "ReviewID": "UR78371597", "Content": "Hotel a bit tired and dated - convenient for the surrounding business district and not far from the airport. On a busy intersection - avoid the rooms on the roundabout unless you like traffic. Rooms OK, with all the required business amenities, but no tea or coffee facilities. Had a lunch in the restaurant, which was pretty good - then a dinner which was inedible, served by a waitress who was willing and clueless - red wine stored in fridge?? Pathetic effort at an evening meal. Breakfast OK but not imaginative.", "Date": "September 5, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Arnhem, The Netherlands", "Title": "“Bit dated and remote from Madrid centre”", "Author": "fspaan", "ReviewID": "UR55346978", "Content": "The hotel is a bit dated, but has surely put in the latest requirements. Free WiFi Internet, basic television. A good bed, spacy bathroom with shower, toilet and bidet, Not an hotel to stay for a long period, but good enough for a one or two day business trip.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“Decent hotel. Nothing spectacular. Free wifi”", "Author": "travel4workandplay", "ReviewID": "UR35396443", "Content": "Hotel is fine and comfortable and convenient for the area. Wifi is free which is a big plus. Not much to say about this one. Clean and serves purpose.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Connecticut", "Title": "“Excellent and well run business hotel”", "Author": "Z3PML", "ReviewID": "UR33151999", "Content": "I stayed here for 3 nights. Very close to Madrid airport - 15 minutes. My room was ready for me when I arrived early morning from the USA. The rooms are good size, clean, and very functional. Wireless available everywhere. More than enough towels, etc. Nice large bathroom. Very comfortable beds. Breakfasts were very good - a nice selection on the buffet. You can also order from a menu. The bar is off the lobby and has reasonable prices. I did not eat at the hotel restaurant except for breakfast. The health club and pool are good. I don't think you will have any problems here. Parking seemed to be a little tight but I didn't have a car there so I am not an expert on that. I did go for a run in the mornings - roads are a little congested so be careful. Never felt unsafe anywhere around the hotel.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Excellent base for Jarama race circuit”", "Author": "johngrant13", "ReviewID": "UR21326406", "Content": "Stayed at Amura Alcobendas for a weekend of motor racing at the Jarama race circuit. Very convenient location - 15 minutes from airport, 15 minutes from Jarama, 20 minutes from downtown Madrid - and easy to find. A good, straightforward business hotel with all the usual facilities (including free broadband in bedrooms and WiFi in public areas), and where everything worked as it should. NIce swimming pool. Free underground parking.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Singapore", "Title": "“Very Warm People - Good Experience”", "Author": "B_TravellerSingapore", "ReviewID": "UR19521323", "Content": "Hi, I stayed at Amura hotel for the entire month of August 2008. I do not speak Spanish and I am a vegetarian. The overall experience at Amura was not bad. I do not have any complaints but I think I could have lived better and more luxuriously had I stayed in the center of Madrid. The Room itself was clean and neat. It was provided with a color TV, a small well stocked fridge, a writing desk, a telephone, lovely bedside lamps, a long mirror, a standing lamp and a sofa chair. The bathroom was very clean and the bed, sheets and toiletries were changed daily. The room also has free broadband internet connectivity. I really liked the \"People\" at Amura Hotel be it at the Reception or at the Restaurant or the Cafetaria or the Room Service People or the shuttle driver. Everyone was soft spoken, sensitive to those who did not speak in Spanish and gave them a fair hearing and went out of their way to help the guests if required. Amazing Staff ! Hats off for their spirit of hospitality. The Breakfast at Cafeteria has really nice spread. It is a wholesome American buffet. They even make small egg dishes for you on request. The cost was Euro 13.50 which is the average cost of a dish and a drink outside in Madrid and so works out cheap. The biggest negative of Amura is that is located at the Northern extreme of Madrid and in fact it is part of a township called \"Alcobendas\" and not Madrid itself. So commuting to the city takes long. The options are to take a Metro, which is 5-10 minutes walk or a taxi which can be either hailed or booked. There is a free shuttle service too for nearby locations and for airport drops. Amura has a good gym but hardly used. The Sauna though equiped does not work properly. The jacuzzi is really good. The Swimming Pool though is more of an extended bath tub. Being an avid swimmer, I was really disappointed to see the size of the swimming pool. Another problem is that the TV shows only Spanish Channels. But the TV had options to connect to Radio Channels using Internet Radio, which played English Channels. Overall I think Amura is a good place to stay with Family and is a nice romantic get away. I would love to come and stay here again but for shorter durations of say 3-4 days. It is a good place for business travelers who have offices in the nearby areas.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MN", "Title": "“Great Find”", "Author": "Junespain", "ReviewID": "UR17902559", "Content": "This hotel was recommended by our local contact in La Moraleja. The breakfast buffet that came with our room was great - fresh fruit, cheese, and pastries. The hotel restaurant is reasonably priced and the food quality is good and wine selection is fair. The hotel is small, but typical European room. Clean and quiet. The pool on the top floor was a treat and a good escape from the heat. Good place to get a suntan. The staff are friendly and speak good English. Very helpful in giving us transportation option. The Metro rail is only 4 blocks and within walking distance (about 10-15 minutes). This will get you to Madrid and connect you to the bullet train stations. Alcobendas is a suburb of Madrid so it is about 40 minutes by train. I would highly recommend this place if you were going to Alcobendas for business but stay in Madrid if you're there for leisure.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Unimpressed”", "Author": "Callymosh", "ReviewID": "UR16051487", "Content": "The Amura is situated on an industrial estate. I chose it because it is within walking distance of the client I was visiting, and as it was listed as 4* catering specifically for business travellers. I am afraid I was unimpressed overall. The worst thing was the non-smoking rooms smelling so strongly of smoke. I changed rooms once, but the impression I was left with in doing this was that smoking in non-smoking rooms was not top on their list of concerns. I don't suppose the fact that the smoking rooms were on the first floor (so everything permeates upwards) helps. No irons are available either in the rooms or from housekeeping. Does this go against the grain for a 4* I wonder? The only way you can get your shirt ironed for the next morning is to pay double for housekeeping to do it. 12 Euros. No tea or coffee facilities in the room Restaurant food very sub-standard. The rolls were solid. The fish croquettes were 99% potato. The lamb chobs wouldn't have fed a bird. No veg. I found the cheesecake inedible. And no wine list. Room service breakfast was similiarly unappetizing. The swimming pool is smaller than it looks in the pictures. Eight crawl strokes long. And only open in the evening. and no changing rooms in the immediate vicinity. Its a shame - some of the staff seem nice. But I wouldn't stay here again.", "Date": "May 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Charlotte, NC", "Title": "“Great hotel, mediocre staff”", "Author": "jdoliver", "ReviewID": "UR14357875", "Content": "The 4 star rating is appropriate for the hotel itself. The room and bed were quite nice. But I would lower my overall ranking due to the staff. When we arrived in the early evening, the man behind the desk was more interested in the computer monitor than acknowledging our presence. This happened more than once. And, he was not at all friendly (I should note that the woman at the desk in the morning was just the opposite). Later, when I called reception for a morning wake-up call, it took four attempts to get someone to answer the phone. The shuttle (free) to the airport took us to terminal 4; we were never asked \"which terminal?\" (there are 4), or \"which airlines?\", or \"domestic/international?\". On the way I said to the driver \"USAirways\", but he shrugged and indicated no knowledge. Turns out we had to go to terminal one, and had to find and take the airport shuttle. Disappointing for a hotel next to an international airport that must have tourists as a major clientele.", "Date": "March 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Wiltshire, UK", "Title": "“not good enough to use again”", "Author": "DrGarySmith", "ReviewID": "UR13211132", "Content": "for business travel, suffers from no decent desk in the room. Had to move TV. Room servive was cold. No white wine Restuarant food ok, but no atmosphere - empty , need to access through smoky \"cafe style\" room. TV seletion only CNN English Speaking Channel", "Date": "February 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Boulder, CO", "Title": "“Upscalish business hotel, a bit far from everything”", "Author": "GuinevereMurphy", "ReviewID": "UR8216516", "Content": "This was a very nice, clean, relatively elegant business hotel with just a couple problems. To discuss the good things first, the hotel is quite modern and pretty with good internet facilities, and a very nice breakfast buffet (opens at 7 AM) with a variety of hot and cold foods. I approved of the faux marble bathroom in our room, which had a luxurious 6-function massaging showerhead and a comfortable, gleaming white bathtub. The bed was something like a king size, but not as big as you’d expect in North America, and was quite firm, which is good for back sleepers (which I normally am) but I found relatively uncomfortable as I’m seven months pregnant and forced to sleep on my side, so it made my hips hurt a lot. My husband thought the bed was fine, though. The two problems we had with Amura were: First, the hotel’s neighborhood is very suburby, not too much going on, and is pretty out of the way with respect to the airport. As other reviewers have warned, beware: if you expect their advertised airport shuttle, you have to call a couple days ahead in order to get one in a timely fashion. We called from the airport upon our arrival at 1:30 PM to see when the next shuttle would be, and they told us there’d be one along at 4:45 PM! There is a way to take the metro to the hotel, via a new metro line (the #10B) that just opened up a month ago (it’s now June 2007). However, you’d have to take three trains: the #8 from airport to Neuvos Ministerios stop, then the #10 towards Hospital, and finally transferring to the #10B. Incidentally, the #10B uses different tickets from the normal metro, because it is part of a system called MetroNorte, which as far as I can tell only encompasses the #10B line at present, so unless you are staying a while in Alcobendas, you don’t want to buy the 10-pass, because it doesn’t work in the rest of the Madrid metro system, we found out the hard way. You’d exit at the Parque de Cataluna stop, and walk about 10 minutes (downhill) to the hotel. I think the whole process could take upwards of an hour, and if you have a lot of baggage it would be rather painful, since there aren’t always elevators or escalators in the metro stations and the trains can get pretty crowded. We ended up taking a taxi, which took about 15 minutes and cost 25 euros, including tip. However, on the up side, this new #10B line makes it convenient to get into Madrid from the hotel, and the trains seem to come every 5 minutes or so on weekdays, though with at least one transfer (to the #10) it still takes about 30-35 minutes to get anywhere you might want to go, like the first district or the Chamartin train station. Second, the reason we stayed at this hotel, and not more conveniently located in Madrid, was because it had a nice looking pool on the website, and it was the only hotel with a pool that we could find anywhere near Madrid for under $200 in June (Orbitz had a great deal, at $80 less than the other sites). Upon our arrival, we learned that the pool was closed for three days! The desk clerk claimed this was routine maintenance only done once per year and we were just unlucky to have happened to arrive when it was closed. Given that we were there during peak tourist season, I am skeptical of her explanation (why wouldn’t they do once-per-year maintenance in January when nobody’s there?). I complained somewhat bitterly (just having been traveling for 20 hours didn’t help my mood), and asked for a discount or refund of the 25 euros we had just spent on the taxi to get to this out-of-the-way hotel, but the clerk refused. We were pretty angry, but a couple of hours later the manager sent up a fancy fruit basket and a note of apology, which was a nice gesture and made me feel better about their customer service. If the pool is important to you, when you are calling ahead about booking the airport shuttle, you might ask if the pool is open, as well. I would stay here again if the price difference compared to other Madrid hotels was as good a deal as we got this time, but if traveling in off-season, you can probably get a decent deal for a similar hotel somewhere better located for tourism.", "Date": "July 22, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Faro", "Title": "“Very far from airport, bus transfer not reliable”", "Author": "elsamorgado", "ReviewID": "UR7654707", "Content": "This hotel is recommend as an airport hotel but it is located 9 Km away from the airport and the free bus transfer service is not reliable. Some of the staff is not friendly. We would not recommend this hotel for an overnight stay when using the Barajas airport in Madrid. For further details read the text below. We (I, my husband and my 2 years-old daughter) had to stay one night in Madrid when travelling to and from our Mexico vacations. Our travel agent made us a reservation for the Amura Alcobendas Hotel because, in spite of its distant location from the airport, it offered a free bus transfer service to and from there. Other hotels nearer to the airport were already full; other hotels did not offered the possibility of free bus transfer. The only reason we agreed on the Amura Alcobendas was because the free bus transfer. The request for the transfer was made by our travel agent. When we first arrived in Madrid, there was no problem: we headed for the hotel bus pick up point and there it was...BUT when we arrived from Mexico (with one and half our delay due to flight re-scheduling) we waited for about 45 minutes at the hotel bus pick up point and there was no bus. Then we decided to call the hotel. They put us on hold 3 times. Only at the 4th call I was able to talk to the hotel reception to ask what had gone wrong. They told me that the bus had already been there and since we did not appear he had left. I argue that there had been a flight re-scheduling. Apparently the hotel had not checked the time of our flight arrival. Furthermore, I was informed that for that day there was no possibility for them to come to the airport to take us to the hotel. Apparently there were other scheduled services for other hotel guests. No effort was made to solve our problem and we were coldly suggested to get to the hotel by other means. We took a taxi which costed us 25 euros. Upon arrival at the hotel we asked for a refund which was not granted. And to our surprise, when we arrived the bus was parked in front of the entrance and it stayed there during our dwellings with the reception staff (at least for half an hour).We filled in a reclamation form and informed them that we would describe this incident on the internet!", "Date": "May 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "newcastle-upon-tyne", "Title": "“a tad to far from madrid”", "Author": "beniboi", "ReviewID": "UR7012788", "Content": "we were soposed to be staying in madrid... but this hotel isnt even in madrid!! so as you can expect we were a bit annoyed when we found out how far away it was, but at least the hotel was nice. nice rooms, great pool, good food. the bus to take you to the madrid metro (line 10) was every hour. the women at reception told us by spring 2007 there will be a new metro station 5 mins from the hotel, unfortunality this was under contruction when we went!! the bus however only ran till half 8, so we had 2 leave madrid early (the bus terminal was north of the city aswell but reached by metro.). when i visit madrid in october again ( the city is very very nice) i will staying more central, or at least somewhere reached by metro", "Date": "March 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Great vacation hotel”", "Author": "Kedwyn", "ReviewID": "UR5507293", "Content": "Excellent hotel. It is designed as a business style conference hotel. Clean, roomy, and with every amenity. Friendly, helpful staff. Shuttle service but for too short of hours. No service after 7pm. Nice pool on the roof. Sauna and workout room are great. Hot tub was not hot while we were there, but may have been a fluke. The only drawback was the distance from rail center. Once at the station fast, clean efficent trains whisked you to the center of Madrid in a relatively short time.", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "california", "Title": "“nice but out of the way”", "Author": "serg33", "ReviewID": "UR5055402", "Content": "The hotel itself is pretty nice, it's not very luxurious, but better than other hotels that I have stayed at in europe. The staff is pretty friendly, nothing to above average. The Hotel is clean, although at times (usually in the morning) the shower would go from warm water to scolding hot water, so that was a bit bothersome. It is about 20-25 minutes away from madrid, the plus side of it, there is a bus stop right in front of the hotel, the bad thing is if there is tons of traffic, you may look into getting into the city at about 45 minutes to 1 hour. So that was not very good for any of us (I went with a group). The other plus is that the night bus drops you right in front of the hotel, the bad thing, that bus doesn't run on saturdays, sundays and holidays. Aside from that, the actual hotel is just fine, no major complaints, only that it's a bit outside of Madrid.", "Date": "May 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Woking, UK", "Title": "“Not quite a four star hotel”", "Author": "sellybelly", "ReviewID": "UR4252798", "Content": "Location isn't really that great, as it's right next to one of the extremely busy entrances leading onto the motorway. Hence, trying to get into the hotel during peak hour is a nightmare not to mention the amount of traffic noise wafting up to the rooms. The rooms are simple and comfortable, however the walls are thin and if the noise of the traffic doesn't keep you awake, the guy in the next room blowing his nose will (bad experience first night)! The bar and restaurant both serve food till late and it's nice to have a bar food option, especially when travelling on your own. The breakfast was really average - I love a hot breakfast when putting in a hard day at the office, but I wouldn't touch the scrambled eggs and bacon on offer, it looked like it had been there for three days. The staff weren't all that friendly and reception check-in and out was frustratingly slow. If you're desperate for accommodation (as there is very little offered around the Alcobendas area) then book this hotel as a second option - which is what I had to do. I normally stay in the Eurostars Gran Madrid, the standard is a lot higher and the staff are fantastic with extremely good English (although, you always need to stress the no smoking option).", "Date": "December 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Warrington,England", "Title": "“Great Hotel Loved the Pool”", "Author": "The_Crofter", "ReviewID": "UR3818673", "Content": "Just got back from a long weekend in Madrid staying at the Amura Alcobendas. As previous reviews state the hotel is about 16km from the centre that you cover by getting the courtesey bus to Plaza Castilla and then transfering onto the metro, all in all about 40mins of a trip. Normally we would be the first to say that we should have gone for a hotel in the centre, however we knew in advance that we would be outside the city but the lure of the rooftop pool made the decision for us.We werent disappointed.The hotel is a four star and the rooftop pool gave us somewhere to relax and chill at the end of the day being open until 11pm. In my book the price and facilities outweighed the location, and I would recommend the hotel to anyone.", "Date": "August 30, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Great Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3780656", "Content": "I have recently returned from a 3 night stay at the Amura Alcobendas hotel just outside Madrid. My partner and I enjoyed our stay at this 4* hotel, and were delighted with the free shuttle service the hotel provides. A Spanish speaking friend kindly emailed the hotel prior to our trip with our flight details, requesting collection from the airport, and we were greeted on arrival by a prompt representative from the hotel in an air-conditioned people carrier. This service is free, and saves paying for a taxi - just inform them beforehand of your arrival time. We also used the free shuttle to take us and collect us from the metro and back to the airport. This is slightly restricting in that you have to book what time you wish to be collected from the metro, however I'm sure you could get a taxi back to the hotel at whatever time you fancy (as I believe the latest pick-up is 7pm). The hotel itself was exactly as described, excellent pool and jacuzzi on the roof with high quality sun loungers that we had to ourselves for alot of the time (great on sunny days to relax and unwind). All the photos were a true representative of the hotel itself, and the bar served cheap bar meals until 11pm, where we ate most evenings. Most staff speak reasonable English, and we were able to get by easily with only knowing a few words of Spanish! The only downside to the hotel is that there isn't very much around it, apart from an interactive space museum and a basic shopping mall. This suited us though as we were there for a relaxing short break and were happy to stay in the hotel, however I could understand this being frustrating for the more adventureous traveller! It is also NOT actually in Madrid, but in Alcobendas just outside, this again was fine by us and we knew that from booking. We were able to use the hotel's free shuttle service to spend a full day in Madrid and see the sights, although again, if you are looking for a hotel in the city for late nights out, this hotel's location would be restricting. All in all, I'd definately recommend this hotel as I have no complaints (modern building, friendly staff, very clean and good food), and would stay there again for a relaxing, rather than sight-seeing, break.", "Date": "August 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“LOVELY HOTEL”", "Author": "A TripAdvisor Member", "ReviewID": "UR3193449", "Content": "I stayed at this hotel for 3 nights and was very happy with both the hotel and the staff. The hotel is about 15 minutes from the Airport and you can get a taxi for about 20 Euros, but you can pre-arrange with the hotel for their free hotel bus too pick you up. The hotel is about 15 mins on the hotel bus from the Plaza de Castilla from where you can get the metro to anywhere in Madrid. The metro is an EXCELLENT way to travel and is very convenient, extremely easy to use and very frequent. You can buy a pass that allows 10 trips for just under 6 Euros, which is more than enough for a short stay. The metro runs till about 1 am and even at this time it is very busy, so you do feel safe! From the Plaza de Castilla you can get a taxi back to the hotel for about 15 Euros. There is a shopping mall near the hotel and it is a bit awkward to get to as you do have to use an under passage, but the mall itself is very nice. There is a convenience store there where you can buy a variety of things from and it was also the only place I saw in the whole of Madrid from where you were able to buy alcohol from. There is a cinema complex there, pool tables as well as a variety of restaurants, from Japanese to American to Spanish. The rooms are also of a very high standard and nice size, with king-size bed and a marble bathroom, I could not complain. The hotel does have a gym, unlike stated in a previous review and also has a swimming pool and Jacuzzi and as they are on the top floor and the roof is all glass there is a lovely view of Madrid! I did not have any swimming costumes but the hotel will provide you with this.", "Date": "February 15, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Great hotel for a relaxing city break”", "Author": "judithchalmers2", "ReviewID": "UR3182775", "Content": "We stayed at the Amura Alcobendas for 4 days in january 05 - the coldest 4 days in recent history - it was minus 11 outside . IMPORTANT !!!! this hotel offers a free shuttle bus direct to and from the airport but it usually isnt advertised when booking through an internet website - phone the hotel direct after booking and arrange it then. This is a lovely 4 star hotel - very minamalistic in style and design but thats because it is japanese owned . Rooms where great ,bathrooms and toiletries where lovely , great power shower !!! biggest downfall is that there where no tea and coffee making facilities in the rooms - Dont charge drinks to room service go down to the cafe bar where they are 50 % cheaper ... great coffee and the vino's only 7 -10 euro's a bottle !!! .This hotels bar and resteraunt prices where excellent value for money - this was very favourably compared to the city centre hotels and wine bar prices - you get much more at the Amura for your money . Warning take a travel iron - no ironing facilitys in the rooms - a local laundry will do it for you at a price . The rooftop swimming pool and jacuzzi where a wellcome break for our tired tootsies . Yes its about 30 minutes from the city centre ( 50 if stuck in rush hour traffic ) the local bus is 1.50 euro's and the hotel actually put on a free shuttle bus to and from the metro -just prebook drop off and pickup times. To be honest the city centre was hectic - the sales where on so it was extremly busy. The metro was great so easy to get around and cheap to . A taxi from the nearest metro station to the hotel was 13 euro's but why pay when the hotel shuttle picks you up! On our flight home we talked with lots of different people and all where very suprised at the prices we where paying for tea , coffee snacks etc at our hotel - they where all complaining at how much more expensive it was in the city. Our check out bill was a pleasant suprise. The staff where very friendly but some do not speak very much english which did cause a little confusion. A phrase book came in very handy. Don't bother buying any gifts in the city centre because a 5 min walk takes you to the \" campo \" massive shopping centre with some great shops , bars and resteraunts - we got some great stuff to take home at half the price !! This is a great hotel if you want 4 star luxury at 2 star prices . Its good for those who don't like the hustle and bustle of staying in the city centre but still want to be close enough to see all the sites - the facilities are excellent - food and drink really nice- and with friendly staff . i would definatly stay at one of the Amura hotels again.", "Date": "February 13, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Free shuttle a big bonus”", "Author": "A TripAdvisor Member", "ReviewID": "UR1748004", "Content": "Christine and I stayed at the hotel for one night as we arrived late in the evening from our (excellent) BMI flight from London.The hotel is about a 15-20 minute drive from the airport as Alcobendas is to the north of the City whereas Barajas is north east of the City.I phoned the hotel from England a couple of days before (0034914903860) and arranged for the complimtary pick up at Barajas. The transport was a modern Mercedes minibus, the driver was early and very polite.The hotel is a modern \"out of town\" - business district - property, rooms were of a good size and the rooftop pool and jacuzzi, although not used, appeared inviting.A complimentary shuttle (you must book with Reception) was available to a Metro stop to the north of the City where we were able to get to the Plaza Espana (our next hotel was the Crowne Plaza - very nice) in about half an hour.In summary, this is a modern, fairly priced Spanish hotel with compimentary links to the Airport and City which is, we feel, suitable for a stopover but not for an overly long term occupation.The Metro by the way is a clean and fabulous way to get around the City - buy a carnet of ten tickets for no more than 6 Euros. London Underground take note!", "Date": "March 27, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Dallas", "Title": "“A LONG way from the airport!”", "Author": "MissPicante", "ReviewID": "UR1717877", "Content": "I, too, was mislead by an on-line booking site that lead me to believe this hotel was an \"airport hotel\". It's actually almost as far away from the airport as downtown Madrid! There are no restaurants or shops within walking distance. You are stuck in the middle of nowhere!It took us a while to check in because the door lock on our room was broken. Our room was terribly hot all night-couldn't get anything but warm air from the vents.There ARE lots of closer hotels to the airport. The website for \"world airport guides\" or the madrid-mad web site lists several. One is only half a mile from the airport and has a shuttle. I'm goin there next time.Forget the Amura Alcobendas.", "Date": "March 10, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington, DC", "Title": "“Great hotel”", "Author": "mab367", "ReviewID": "UR1503293", "Content": "New, modern hotel with a lot of amenities. I would not say that this is near the airport (there didn't seem to be any hotels right at the airport)- a taxi ride from the hotel cost about 17 Euros and takes about 20 minutes but the hotel does have a free shuttle to the airport but you must schedule it with the front desk. The rooms were very nicely decorated with minimalist furnishings and were very clean. Great bathrooms with fabulous stall shower. There isn't much in the neighborhood, mainly businesses.", "Date": "December 1, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Really enjoyed our stay at this Hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR1384636", "Content": "The Amura Alcobendas was near the airport and had a courtesy bus if required (we just took a taxi to save waiting). The location was as described - suburban - however it was only a short bus (bus stop just outside) or taxi (14 euros by taxi) to the Centre of Madrid. Locally to the hotel was Alcobendas a little town with shops etc. There was a nice shopping centre/mall Al Campo within walking distance of the hotel which looked recently built and contained a good variety of outlets. There were also eateries and pubs within walking distance - mainly local cuisine although there was a Pizza Hut and Burger King. It was good to be near Madrid City Centre and attractions but able to avoid the noise which one experiences when staying in hotels in large cities. The rooms vere very high standard - spacious marble bathroom with good tub and shower and you could dim the bathroom lighting .Room had hairdryer, minibar, very efficient airconditioning and the double glazing kept noise out very efficiently as the front of the hotel is close to the motorway. We had an excellent sleep (which we value as we have stayed in cities and hotels world-wide and this can be a problem).There was a rooftop pool and jacuzzi - good area available for sunbathing or relaxing.The restaurant was very nice and prices were reasonable. The only thing was that with the hotel being relatively new there was no english version of the menu. However, with our limited Spanish and help from the waiter we ordered excellent meals during our 3 day stay and the house wine was reasonably priced but an excellent choice by the hotel.The chef even produced burger and chips for room service for our daughter although it was not on the menu.The restaurant manager and all of the staff at the Amura Alcobendas made you very welcome and looked after all of your needs. I would go there again and will probably try out other hotels in the Amura group.Also, when we checked out we were really pleased with the bill as we had had such excellent service and good quality food, bar tab etc that we thought the cost would be higher than it was.So overall yes it was an excellent stay and although we were there as tourists it looked like it would be a good conference or seminar venue for businesses.", "Date": "October 11, 2003"}], "HotelInfo": {"Name": "Amura Alcobendas Hotel", "HotelURL": "/ShowUserReviews-g187514-d282606-Reviews-Amura_Alcobendas_Hotel-Madrid.html", "Price": "$71 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avda de Valdelaparra 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">28100</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "282606", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4b/9d/4b9d577965f8977bc0a5f2cba65961585large.jpg"}}