{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Samara", "Title": "“an excellent hotel! in the center”", "Author": "andyl2001", "ReviewID": "UR124436941", "Content": "an excellent hotel! in the center, to the Kurfürstendamm - 3 minutes at a slow pace. nice, very neat and clean rooms. no frills, but on the level. windows are located on a quiet fugger street, at 3 meters on the corner of a charming cafe. Breakfasts are delicious and dense, half-day load. and the expense of the fact that the hotel is small - no crowds and the search table. with the staff, too, had no problems - all problems were solved quickly. besides, the girls at the reception speak many languages. In general, the most positive impression. advise.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vasteras, Sweden", "Title": "“Nice hotel with good breakfast”", "Author": "AndreaPSweden", "ReviewID": "UR120583314", "Content": "Stayed here for 3 nights okt/nov -11. The receptionists where very helpful with information and tips about the city, they also let us leave or bags in a room and passports in the safe after checking out (since our plane left in the evening). The breakfast was good, even with Swedish standards and served between 7-10. The rooms where modern and clean, we had bath in ours, but our friends did only have shower. Free internet in the lobby and restaurant. The hotel lies a couple of blocks from KaDeWe and the closest U-Bahn, but on a street with gay restaurants and bars. It felt safe and central. The only thing to complain on was the elevator, which took forever... And (almost forgot) it often want by ambulances/police cars which sometimes woke us up.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Berlin - Hotel Artim”", "Author": "Navylad69", "ReviewID": "UR120170459", "Content": "I have stayed at this hotel 3 times over the last couple of years, I was recommended to it by a close friend. The hotel is supurbly located, a 5 minute walk from wittenburgplatz u-bahn station and kae da wae. The hotel is on a quiet side street, though this is in the middle of the gay area, but its not a gay hotel, so you may not even notice until a leather clad man walks past lol. The breakfast is great, the rooms very large and beds very comfortable, personally I cannot fault it and its my hotel of choice for Berlin. There are others that are cheaper, but I like the location and standards of this one so will continue to go back. Staff are very helpful and speak English, I asked for some train times and they printed them off for me. Overall, I can't fault it !!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good standard for a short visit in Berlin.”", "Author": "Hogsbo", "ReviewID": "UR117368803", "Content": "You don't come to Berlin to stay in a hotel room. The room was excellent for a weekend stay. Nice, clean and spacious. However, if I had stayed there due to a business trip or similar, I would have appreciated facilities as international TV channels and free WiFi. The location is perfect, almost neighbour with KaDeWe.", "Date": "August 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Taarnby", "Title": "“Ok hotel not 4 star”", "Author": "pedkola", "ReviewID": "UR84661386", "Content": "The hotel is situated on a quiet street near Wittenberplatz. The hotel staff is friendly, Rooms are spacious and clean. Breakfast was buffet style with a good choice on offer. I would recomend this hotel for anyone wanting to stay in this area of Berlin.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ashbourne, United Kingdom", "Title": "“nice hotel, good rooms”", "Author": "doncha1", "ReviewID": "UR81073155", "Content": "This hotel is a five minute walk from the wittenberplatz u bahn station and its square. This was handy for us as we were going to a concert at the Olympic Stadium (on the u bahn line we needed) as well as exploring this large city. If you enjoy walking you can reach the zoological gardens and further afield the Reichstag area without too much difficulty. The hotel is situated on a quietish street near the gay district. The hotel staff were friendly enough, rooms were spacious and clean. We requested a room with a balcony which we got for no extra charge. Breakfast was buffet style with a good choice on offer. I would recomend this hotel for anyone wanting to stay in this area of Berlin.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Monchengladbach, Germany", "Title": "“Lovely Street and good position,but some poor service”", "Author": "dempster_lisa_j", "ReviewID": "UR65345071", "Content": "Service desk- one staff member in particular- needs to get act together. Lack of Attention to detail caused undue problems, particularly concerning payment protocol. Removal of all personal baggage, because they could not read their own paper work, was totally unacceptable.Being locked out of your own room, when booking sheet was there, was unacceptable. Having to move your own things back to your room, after they make a mistake, unacceptable. Having shampoo everywhere, because a staff member could not close a shampoo bottle when moving your things- unacceptable. DEMANDING PAYMENT FOR A PHONE CALL BEFORE YOU CAN GET BACK TO YOUR ROOM- TOTALLY UNACCEPTABLE. The room was lovely, and the position excellent. But the actions of one staff member, left a very sour taste in this travellers mouth.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "bolton", "Title": "“Oh My God What a DUMP, (4 Star never)”", "Author": "xxxdarren", "ReviewID": "UR57897228", "Content": "I stayed in this hotel because I coudn't get any rooms at Quintin Design Hotel where I normally Stay, At Hotel Artim I found the Reception Staff to be UNFRIENDLY, Night Staff need more training on how to speak to guests. Room was would not get very worm. Bath room stank wee. Breakfast was was good or german standard, not British. All other hotels around the area internet is free except this hotel, they charge 20.00 euro per night, that is so expensive and it wasn't even fast. When I told my problems to reception, her reaction was \"oh ok\", I wasked to see the manager, ans she told me, next time she would look after me, I told her that I would never return, She said thats fine. 4 star hotel?!!!! Who ever you are, enjoy your stay.... (My question is does the hotel never read the guest feedback and learn from it, clearly not?)", "Date": "March 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Poor standard hotel. Ok for 2*, no way a 4*”", "Author": "ryanmo", "ReviewID": "UR54438761", "Content": "The hotel was typical of a 1-2 star hotel. Rooms large but very basic. The shower did not work, nor did the TV. There was no air conditioning or manual heating - so the room only heated up when the hotel decided to put the heating on. On the bed (a double for 2 of us) there were 2 single duvets which were extremely thin. It was -6 outside and we were freezing. The first night we had to sleep with 2 layers of clothes on. The next morning we asked for more blankets - and we were delivered 2 more of these thin single duvets, but without duvet covers, and very dirty with some pretty revolting stains on them. One morning, after we had been out for a big evening of partying, the maid came into the room and shouted that we were lazy and should get up. When we asked her to come back later, she refused and proceeded to clean the room with us still in bed !!! I would expect that in a youth hostel maybe, but this place is supposed to be 4star, and I paid EURO 150 a night for 4 nights. Not great !!", "Date": "January 26, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Athens, Greece", "Title": "“Fantastic!!!”", "Author": "IdgieThread", "ReviewID": "UR49794992", "Content": "Big rooms with high ceilings, clean, quiet, comfortable, with a biiiiiiig variety of breakfast, friendly reception and very good value for money!! Will definitely stay there again!!!", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "israel", "Title": "“nice ,simple and friendly”", "Author": "malkiely", "ReviewID": "UR35530855", "Content": "we arrived the hotel on the 16h of july and it was just like it looks in pictures on the internet. the hotel is not big but the rooms are large and nice . breakfast is the same every day and you can defently start the day with it the street was a little noisy especially at the end of the week the reception desk is superb the u bahn station is 5 minutes walk from the hotel the kadwe is also 5 minutes walk alexander platz is 15 minutes by train", "Date": "July 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "abhasia", "Title": "“poor”", "Author": "john112211", "ReviewID": "UR15603170", "Content": "Good location, but poor service. No food if you have the breakfast too late. No minibar in the room. Certanly not 4 stars.", "Date": "May 3, 2008"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Unprofessional & Unfair Cancellation Policy”", "Author": "The_flying_Kiwi", "ReviewID": "UR8666593", "Content": "I booked this hotel through [--] last November (2006) for a stay over Easter 2007. At that time, the confirmation from the booking agency/hotel stated the cancellation policy was for 4-days prior to arrival. During the 5-month period between my booking and my stay, the hotel changed their cancellation policy but did not inform me. I cancelled my reservation 6-days prior to arrival and was horrified when my credit card was charged for the full 3-night stay. I queried this through the booking agent [--] and they completely washed their hands of the matter, were rude, unprofessional and would do nothing except say I had to deal directly with the hotel. Over the last 5-months I have been in e-mail battle with the hotel to have my money refunded and have failed. They continue to quote their cancellation policy despite the fact they changed it, didn't tell me and it's written in a mixture of English and German which I could not understand. So BE WARNED. Before you book or consider cancelling, call them and find out what the current rules are. Lastly, do not book your hotel through [--] as they are unprofessional and unfair in accepting their responsibilities.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doncaster", "Title": "“Excellent hotel”", "Author": "acciomen", "ReviewID": "UR8451867", "Content": "Upon arrival in our limo, we werent disappointed at all. The receptionist was very friendly and helpful. The rooms were very large and clean. We had 3 rooms in all, and although one room did smell of smoke, the others were emaculate. 2 of the rooms had balconies and overlooked the main street, but there were no problems with noise. The breakfast was good value, although the apricots and tuna were a little unusual for us british tourists lol, the rest was excellent, with a choice of cereal, toast cooked meats and good selection of breads, and for those who want a cooked breakfast, there were eggs, bacon, sausages etc All what you would expect from a 4* plus hotel. I would definatley choose and recommend this hotel for anyone who wants a fantastic stay in Berlin.", "Date": "August 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“I wouldn't recommend it”", "Author": "bruxe", "ReviewID": "UR6013729", "Content": "As far as I'm concerned, this hotel has some problems. I'm American but very familiar with Europe. I'm also bilingual, but unfortunately don't speak German. There are no labels on the phone in the room. People have called me, but I can't access the message. When I asked the clerk at the desk how to use the phone, her answer was, \"I don't know.\" She was also unsure about the cost of calls to cell phones versus those to land lines. I have work to do here in the morning, and don't get out until the afternoon. There is no \"occupied\" sign to put on the door, so each day, a cleaning lady enters unannounced, often seeing me in my underwear and sometimes nude. She gasps and leaves. The hotel advertised as having internet in each room. They do, but it's $18 each 24 hours, by way of a T-Mobile Hotspot. You don't find that out until you get here. When I filled out the booking form, it said, \"check here if you want a nonsmoking room.\" I'm a smoker, so I didn't check it. When I arrived, I was informed that I'd been assigned a nonsmoking room and that there were no smoking rooms available. There is no free information for tourists at the desk. They charge for everything, even a tacky booklet called \"Best of Germany\" cost 2 euros. There seem to be no maps available. Other than that, it's clean and quiet, though somewhat kitsch. I'm wondering about the star system for German hotels. This one has 4 stars, but I'd be willing to bet they're not Michelin. Finally, I'm paying 100 euros a night for a double, quite a huge price in a city full of bargains.", "Date": "October 26, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“loved Wittenberger Platz.”", "Author": "LOCHSIDE", "ReviewID": "UR5884257", "Content": "My wife and I stayed here for four nights in September. Overall we were pleased with the accommodation and the breakfast choice was much more than the expected basic continental option.The location was quiet but convenient for shopping and sightseeing.I would not rate it as a 4star hotel however, more a good three star tourist hotel.The hotel lacks a comfortable seating area unless the weather allows you to sit outside.No tea/coffee making facility in room.On the plus side we found the staff cheerful and helpful.Would I be happy to stay here again? Probably, because the advantages outweigh any disadvantage.", "Date": "September 28, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Europe", "Title": "“Not a 4-Star Hotel”", "Author": "Linnen", "ReviewID": "UR5229552", "Content": "I totally agree with a previous traveller who rated the Artim not as a 4-Star hotel ! I stayed there for 4 nights. It seemed that the reception's duty was only to register new hosts and that's all! There were only 4 armchairs in the hotel \"lobby\" and the luggage storage room was full, so the reception was full of waiting luggage. there was no possibility to purchase any postcards at the reception desk. The only things to buy were cigarettes and nuts. The unspectacular breakfast is to take at the chinese restaurant belonging to the hotel (you don't have to go out of the hotel though). The linnens and towels were clean but had holes, there was no minibar nor a \"please don't disturb/make the room\" sign in the rooms at all. The night curtains had no double linings so that the room didn't get dark at night. The only 4-star standard was the bathroom: modern, plenty of storage space, plenty of towels, shower lotion dispenser refilled daily, make-up mirror, hair dryer. Another positive thing was the large size and bed in the single-room I stayed in. In addition to that, the location in a quite side street of Ku-Damm close to the Ka-De-We department store. The Artim is not what I expect of a 4-star hotel, but also one of the \"cheapest\" 4-stars in Berlin.", "Date": "May 28, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Bognor Regis, West Sussex", "Title": "“Very disappointed”", "Author": "Linbri_7", "ReviewID": "UR5181090", "Content": "Hotel should not be a 4 star. Room clean but shower over bath just 12inches above bath and no shower curtain. Large crack in sink in bathroom. Towels old and had holes in. Hole in duvet cover. No restaurant as such in hotel but breakfast had to be taken in chinese restaurant attached to hotel, Happy Duck. No lounge in hotel and drinks bought in the attached chinese restaurant, that doubled as the hotel bar, could not be charged to room. We would not use this hotel again.", "Date": "May 19, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newcastle Upon Tyne", "Title": "“Very friendly, helpful hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3617308", "Content": "Warm welcome at this small hotel, near to city shopping centre, just a short walk away from largest department Store in Europe, Ka De We. Close to public transport services also. Reception staff all spoke excellent English and were very helpful. Good Breakfast included in room rate, good selection of both hot and cold at self service buffet. Rooms clean and serviced every day, clean towels each day. Only critical point, would have benefitted from tea/coffee making facilities in room. Enjoyed our stay and would definitely recommend this to our friends.", "Date": "June 28, 2005"}], "HotelInfo": {"Name": "Hotel Artim", "HotelURL": "/ShowUserReviews-g187323-d282647-Reviews-Hotel_Artim-Berlin.html", "Price": "$97 - $223*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fuggerstrasse 20</span>, <span class=\"locality\"><span property=\"v:postal-code\">10777</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "282647", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/75/f1/75f14138ba8f43e48c4cd501fece0c4110large.jpg"}}