{"Reviews": [{"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Romania", "Title": "“Very Comfortable, Nice Rooms”", "Author": "Research-Wanderer", "ReviewID": "UR113352868", "Content": "I have accommodatel at this hotel for one night, on my way back from Morocco. It is very convenient located (near Rome Termini and Bus station connecting Rome Termini with Rome Ciampino Airport. They provide Internet reservations, and they allow very late check-in (I have arrived around midnight). Rooms are very nice, so it canbe considered as a very good hotel (not as a transit hotel).", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Oakville, Canada", "Title": "“Fantastic location, beautiful hotel!”", "Author": "laurenball07", "ReviewID": "UR112028902", "Content": "This hotel is located 10 minutes walking from Termini Station (the main station) and is within an hour walking to all major sites. We booked this hotel after reviews from trip advisor and after looking at their website- www.cristinahouse.com I found most websites to be incomplete, or not impressive at all, but this one was thorough, and had a fantastic layout and pictures! (I'm not a web critic by any means, I just like a good informative website when I'm planning on staying there). When we arrived we were greated by I believe Cristina's husband, and later met Cristina herself. It is a smaller hotel comprised of about 10 rooms in a building. Seems most hotels over there take over 1 or 2 floors unless they are the larger hotels (I.e. holiday inn...) The rooms were beautiful, spacious, full private showers, and all for 50eur per person per night. They also have 2 other accomodations, 1 of which Is cheaper per person but looks just as nice, and all are within a few minutes of each other. The only downfall was my forgetting we had to pay cash upon arrival and the man at the desk was less than accomodating (when we were clearly sweaty and exhausted after getting off 6 hours worth of trains), granted they did warn us of this in advance... I just misread the confirmatino email. So advice: bring cash or you will be scrambling to find a bank machine. Other than that, the place was fantastic. They provide towel and linen service, as well as breakfast. The breakfast is at a small cafe only 5 minutes away and provides pastry and coffee/tea and juice which is typical for a European breakfast. Overall, fantastic experience! Location was perfect for the trains, but I would recommend Vespas for getting around (we rented them to get from all the major locations), and enjoy the Roman inspired decor.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap & Central”", "Author": "Lukie89", "ReviewID": "UR109513624", "Content": "Booked to stay at this hotel last minute and was surprised at how excellent the location was. The terravision bus that brought us from the airport stopped with the street of hotel opposite so ended up being a 5 min walk. Near central station (5mins) and within good distance of all major sights. Room: basic but had decent bathroom, air con & wireless with great reception. Breakfast was very simple but very tasty. We were given a voucher to go to a cafe and had the choice of coffee or juice and a pastry. The only negative was the man on reception, very rude and had no customer service skills so had to pull him up.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rome, Italy", "Title": "“Bad service, dirty secret.”", "Author": "anonymous0505", "ReviewID": "UR106880422", "Content": "Used a pen to mark the dirty towels rolled up in the corner of the bathroom floor to see if they were being changed. Found out that they were being folded up and placed neatly on the bed as if they were clean.", "Date": "May 4, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hamilton, United Kingdom", "Title": "“First trip to Rome”", "Author": "Anthony66", "ReviewID": "UR78622258", "Content": "Finally got to visit Rome for long weekend, saw some truely unbelievable sights. Stayed at Cristina Hotel which was considering the price for 3 adults surprisingly very good. service was spot on with breakfast being delivered to the room every morning and at a time requested. Staff where also very good, nothing was too much trouble. Would definately stay here again.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Hotel OK but arrogant man at reception”", "Author": "JulesTrac", "ReviewID": "UR32751712", "Content": "We were initially booked into the Cristina Residence but due to a double booking, we were kindly relocated by Carlo (very nice man and extremely helpful) to the Cristina hotel. The room is quite small, kitch but adequate and comfortable. The airconditioning was very noisy and ineffective for such a small room. The internet is just outside the rooms in a very hot part of the hotel. The rude arrogant man at reception refused when asked several times to put the split system air conditioner on. He excelled at rudeness and being uncooperative. We were glad to leave this hotel, however we have to say that Cristina was very helpful and nice when we first checked in. The breakfast consisted of nice coffee but sweet biscuits, biscotti and cake. Not very appetising. We think you could do better with your choice of hotels as there are so many in this area as it is very close to Termini Station (the main local and international train station). The lift to the 3rd floor is a scary old fashioned phone booth like lift that does not always work.", "Date": "June 20, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“not bad, but beware of the guy at the reception!”", "Author": "aberna", "ReviewID": "UR4933593", "Content": "The hotel is clean but Termini is not a very good place to stay at. Termini is itself a dirty place. However, the hotel is very close to a Metro station (C. Pretorio). I had a bad experience on the night of 27th March. We came to the hotel at 6pm after a long day of walking. We wanted to take a short rest at the hotel for an hour and then go back to the city center to meet with our friend for dinner. I looked for the guy at the reception but there was noone there to call a taxi for us. Then I found the telephone number of the taxi company from the internet and using the phone at the reception I called them. But they couldn't speak English so I couldn't call the taxi. Then after 15 minutes, The receptionist came and I told him that I tried to call the taxi company but they couldn't understand me. The receptionist told me \"No use phone!\". I think he wanted to say that the customers are not allowed to use the phone. I said \"OK but you were not at the reception and I wanted to call the taxi\" Then suddenly he got mad! He showed me the phone in crazy manners that I made a phone call and he started to shout \"No taxi! Go to Termini and find a taxi there!\" I said \"I can pay for the telephone.\" But he was so mad at me that I used the phone when he was not there, I just ignored me and didn't call a taxi for me. Then I went down to the street in front of the hotel and tried to catch a taxi. I spent 30 minutes in front of the hotel until I found a taxi. It was a very rude behaviour of this strange guy at the reception that he did not call us a taxi, although he should be knowing that my wife is pregnant.", "Date": "April 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "3", "Service": "1"}, "AuthorLocation": "Alexandria", "Title": "“It was not clean”", "Author": "A TripAdvisor Member", "ReviewID": "UR4080065", "Content": "The rooms were not clean and the service could not speak English. The sheets were not changed before our arrival. There were cocroaches running around in the room.", "Date": "November 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Chester", "Title": "“Traditional Rooms Great Coffee!”", "Author": "emskilove", "ReviewID": "UR3344639", "Content": "Stayed here during one of the busiest times Rome has seen (the week of the Pope's funeral) and was thoroughly pleased with the location, cleanliness and polite service. Only a 5 minute walk down a straight road to the Termini station where you'll find buses, tour buses and on-foot access to the city's greatest tourist spots. The rooms are decorated in a tasteful and traditional style and we found the beds and bathroom spotless. The coffee with fresh cream and croissants served at your time of choice between 8 and 9 am are most welcome. The free internet access and 24 hour access by personal key is great. Would recommend this place to anyone who hasn't got the budget or need for a lavish suite on their trip.", "Date": "April 8, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago", "Title": "“loved it”", "Author": "munkispank", "ReviewID": "UR2696947", "Content": "we stayed in the Cristina in June 2003, I loved the room. I did not find it too far- it was actually really handy for us- we came in and out by train and the station is 10 mins away, it is difficult to find though. The location is good as it is quiet and away from soem of the hassles you can get in the more touristy areas. Our room looked out over the courtyard and was really pretty- had the cool ceiling and a compact, but clean bathroom. The aircon was not very good- and it was very warm in the night. Free internet accessin the lobby area and the coolest elevator in the building. It is clean, safe and an excellent bargain for the location in central Rome-but don't expect the hilton. I loved the Breakfast- you give a nod to the guy on reception and 10 mins later he brings you cappucinno and a croissant to your room- room service for free!!!!", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Perfect for our needs and budget.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2695960", "Content": "I was expecting the worst after reading some reviews of the Cristina Hotel but was very pleasantly surprised. It may not be slap bang next to your major tourist destinations but it has a metro station around 200 metres away and Rome's main train station (Termini) is a 10 minute walk away. You can get direct tubes to the Colliseum, the Roman Forum, the vatican, the Trevi Fountain and several other places from the metro stop. If you are going on holiday for lavish buffet breakfasts, it is not the place for you as breakfast comprises of a croissant and a cup of tea or coffee but why eat breakfast in the hotel when you can easily nip to a nearby cafe and people watch for an hour or so. The staff were very friendly and very helpful when asked questions about places we wanted to go. The rooms were clean and nice enough for a holiday. If you desire to be on the doorstep of any major tourist attraction you can pay over triple what you would pay at Cristina but if can spare a 5 minute tube journey and plan to spend time outside of your hotel room, you'll save a lot of cash. I would recommend the Cristina to anyone who is on holiday to see Rome rather than marvel at the folding of the loo roll in the hotel bathroom.", "Date": "October 11, 2004"}], "HotelInfo": {"Name": "Cristina Hotel", "HotelURL": "/ShowUserReviews-g187791-d283637-Reviews-Cristina_Hotel-Rome_Lazio.html", "Price": "$100 - $198*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Viale Castro Petrorio 64</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "283637", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d7/5f/d75f94355d3eb8fd309fe050dfef5d0e1large.jpg"}}