{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Douglasville, Georgia", "Title": "“Room smelled like fish and AC filter stopped up”", "Author": "mamalisarides", "ReviewID": "UR136964092", "Content": "I've stayed at this place many times, it was always old but kept up well and clean. I liked it because it has kitchens, was clean, ocean front with a pool, and didn't cost a bunch. This time my room smelled like fish, stink bombs didn't help. Not updated at all since last visit 18months ago, overall nasty. On last full day a/c wasn't blowing well, thought about fish smell so took out a/c filter. It was black and obviously had not been changed in months. I won't be making reservations again at this place. Extremely disappointed, not a very good week.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Asheville, North Carolina, United States", "Title": "“never again”", "Author": "Randy R", "ReviewID": "UR135738184", "Content": "We stayed many times. This time bad. AC didrnt work the lady at the desk told us to rough it. Rooms were poor and dirty and hot. Carpet dirty. Ceiling falling and cracked. The reservation was lost even tho we had paid. Swjchedrooms the other was no better.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Just average”", "Author": "Fair_12", "ReviewID": "UR127921094", "Content": "This is a cheap motel and if that's what you're expecting, it's ok. They go by a new name ' Seascape Inn'. All rooms have a view of the ocean. The rooms could do with updating however, it's quite dated. The doors to the rooms are not very secure. The safe deposit boxes don't work. The cleaning lady is nice, but overworked, so the rooms are not very clean. Don't get me wrong, they're not dirty either. All rooms have refridgerators, which is convenient. There's a decent private pool with access to the beach. Location is good. Breakfast is not really worth it, you're better off getting groceries. We did enjoy our stay, it's quiet, so you get a good nights rest and everybody is friendly. Also the prices are affordable for a hotel at the beach. For dinner go to Crabby Joe's! Also there's a menu for a pizzeria in your room, the pizza's are very fresh, tasty and big. Not sure yet if we would stay here again.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Another Good stay at the Seascape Inn, formerly Magic Carpet”", "Author": "04eagle", "ReviewID": "UR119515899", "Content": "My husband and I have stayed at this motel numerous times, it is a family-style drive up motor lodge on the beach. It is clean, friendly staff, continental breakfast included, laundry facility onsite, pool and beachside. We plan to stay again next year. It is a great place to stay for the price, and the rooms are very large. It is NOT an all-inclusive resort with all those amenities. If that is what you are looking for, do not stay here. It IS a great place to stay for the location, price, and friendly staff.", "Date": "October 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Iowa", "Title": "“Great Little Motel Right on the Ocean! Love it!!!”", "Author": "IAMom_09", "ReviewID": "UR115851107", "Content": "We've stayed here 4 times now and I just love it! The rooms are bright, clean, and large with a nice bath, dressing area, and even a kitchen! The beds are quite comfortable!! The price is TERRIFIC!! It's right on the beach and each room has a small balcony with an ocean view. I especially like the fact that it's owned by AMERICANS! You can understand what they say and they can understand you as well. The lady we talked to was so very nice and she even gave us a gift bag when we got there. It had many really neat things in it - razors, shampoo, conditioner, toothpaste, etc. It was just a nice little extra! Anytime we're in Daytona, we will be staying at the Magic Carpet/ Seascape Inn! We really enjoy it!", "Date": "July 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Horrible stay, New lady in office not Diane or Debbie, VERY RUDE”", "Author": "sabell83", "ReviewID": "UR101881363", "Content": "Well have been going to this hotel for many many years, and this last stay was horrible. It is like a senior citizen Hotel. If you are going with your kids or are younger than 50, save yourself the trouble and do not come here. I had 5 rooms rented out, like I always do, and we always have a great time. The cops were called on us at 10:00 for being to loud, which the cops even said was ridiculous. They were told there was underage drinking. Everyone in our party was of age. I guess we just all dont look 80. Everything is dark at 8:00. No noise is allowed. The new person they have in the Lobby, Not Diane or Debbie, is the rudest women I have ever seen or talked to in my life. She was rude to the entire group we were with. The older people were allowed to have bottles of wine with wine glasses at the pool, however we were not. We were harrassed and harrassed constantly. This was the worst time ever and the older people were just rude. Save yourself the time and do not bother coming to this hotel unless you are older and dont like to have fun past 8:00 in the evening. Also the glass sliding door was broke, service was awful, didnt get any new towels for the next day. Was really upset to be treated so badly. If we were being to loud by the pool all they had to do was ask us to quiet down. That I can understand. But the treatment of the staff at this hotel was horrible. The older women in the lobby took upon herself to be rude to my children, and when told that I would speak to Debbie, she said go ahead it wont change anything and threw her arms up. Very digusted with this Hotel. Will never stay here or recommend this hotel to anyone.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Another great stay at the Seascape Inn!”", "Author": "04eagle", "ReviewID": "UR86119661", "Content": "Improvements continue with the refurbishing of rooms. Staff is still great and extremely friendly, really trying to please and meet your needs. Comfy Queen-size beds, mini-fridge and microwave are standard in the non-efficiency rooms. This is an older drive-up style motel at a great location on the beach. If you are looking for an all-inclusive resort, this is not it. But if you are looking for a great location on the beach, clean rooms, attentive staff, and a great value this is it! We have stayed at this hotel numerous times for a week-long stay, and plan to stay again!", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“Great place, great value for you!”", "Author": "04eagle", "ReviewID": "UR73307537", "Content": "Have stayed here a number of times, older hotel.... hotel changed owners and name, and has been doing alot of refurbishing of property overall. Rooms now have 2 queen beds instead of doubles, rooms are clean, and cleaned well every day! Staff is friendly and prompt with your requests. Location is perfect for beach, sightseeing, etc.. Continental breakfast is large with many choices, not chintzy. Will definitely stay here again and again!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shreveport", "Title": "“Wonderful location!!!”", "Author": "janna5187", "ReviewID": "UR60734754", "Content": "Great hotel, Great Service!! We had a wonderful time here and will be there next year for sure!!! Its not a fancy hotel but the price and location on the beach is amazing and totally worth it plus you are only in your room to sleep right so who cares!! The pool is nice could have been a litte warmer. They have a nice grill, and shuffle board and horse shoes to play! The even have board games in the office for children to play with on a rainy day! I would recommend this hotel to everyone!!", "Date": "April 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "summerfield,fl", "Title": "“Wonderful will stay again and again”", "Author": "chicoschicka", "ReviewID": "UR27609665", "Content": "We been coming here for the last 3 yrs. The motel staff are wonderful. If you are looking for a quiet place to relax and enjoy the beach you came to the right place.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "CR Iowa", "Title": "“Great Place to stay- Getting better every year!”", "Author": "BigMo59", "ReviewID": "UR26339099", "Content": "Great location, The staff was very helpful and our group had a great time and are planning to extend our time each year. The Iowa Group loves it here.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Loved the Magic Carpet Inn”", "Author": "rxavonlady", "ReviewID": "UR17102328", "Content": "This hotel is the best place to stay in Daytona. We will definitely stay there again. They have clean rooms, a wonderful staff, and we felt right at home.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kinston", "Title": "“Very Impressed”", "Author": "Yeller77", "ReviewID": "UR10317444", "Content": "We stayed at the Magic Carpet for Biketoberfest. I wasn't expecting much considering it was one of the lowest priced rooms I could find on the beach. However, I was pleasantly surprised! At check in the manager (can't remember her name) was extremely friendly & helpful. We had a huge room with 4 queen sized beds, a kitchen & two balconies. Room was clean & spacious. Management & housekeeping were extremely helpful & friendly. Not one complaint, if we go to Daytona again we will definately be staying at the Magic Carpet!!!!!", "Date": "October 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "CT", "Title": "“Horrible!! Horrible!!”", "Author": "kat63ct", "ReviewID": "UR8139589", "Content": "Our worst vacation ever!! Our room was robbed (the safe in room did not work and the front desk was aware of this). The owner was not sympathetic at all, she all but acused me of scamming her!! When I requested her insurance info, she refused to give it to me. After a month, I did get her insurance info and they finally settled with me after almost three months. In addition, she wouldn't even change the lock or move our room (there were plenty empty!) to make us more at ease. Run from here as fast as you can!", "Date": "July 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Maryland", "Title": "“Laid back hotel”", "Author": "warren810", "ReviewID": "UR6891333", "Content": "I love this hotel my husband and I have stayed here many times and plan to return for 2007 Bike week. I will post again and let you know how the new management is. I love the hotel, no it does not have all the bells and whistles as the larger chain hotels do but it's quiet and management doesn't bother you. The rooms where good and the price was cheap compared to all the others for Bike Week. I will stay here every time I visit Daytona Beach. Always fun and they do try to help you. Even let me ship my bike stuff prior to us getting there, Now that's service for you.", "Date": "February 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "tavares Fl", "Title": "“Horrible”", "Author": "jucaperk", "ReviewID": "UR5487110", "Content": "I have been going there for years and now that it is under new management I will never go back. We stayed in a room for 8 people and it was only equipted for 2 in the kitchen. It was so dirty we had to go buy cleaning supplies to clean enough to stay. Management was rude and nasty and lied to us. We were told we could have a noon check out and then at 10 we were asked to leave because she only had one house keeper for the day but we saw 3 working. Don't go you won't be happy.", "Date": "July 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“what a great place to stay for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR5017626", "Content": "june 6th thru june 11th we was looking for a motel to stay at and found this one and couldn't been more satisfied with it. we will be back next year. the mgmt. was great. the rooms are really big and also clean. great place for the money.", "Date": "April 29, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Magic I don't think so”", "Author": "A TripAdvisor Member", "ReviewID": "UR4984749", "Content": "The room had mold on the ceiling in the bathroom which was to be cleaned with bleach by housekeeping and never was.The television has fuzz the whole week we were there and we never had a clear picture,plus the remote would not work. The shower stall needed a real shower head and the floors were dirty. the toilet ran and the maintenance man was there as much as we were.I Had to throw away 3 pairs of footies due to the dirt on the floor.Honesty if that's what you like than I guess the Magic Carpet is for you. My last visit in 2005 I was with a friend and I did a quick look around, I guess I should've looked closer. If I knew what I know now I would never had stayed there.I will not recommend this motel/hotel to any of my friends. I don't care if it is close to the beach pay a little more and get a quality motel or hotel or at least a clean one.", "Date": "April 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“nice and economical, perfect for the family”", "Author": "A TripAdvisor Member", "ReviewID": "UR4964849", "Content": "My parents stayed here in may of '05 and they told me about how nice it was. So we tried it out in july. My 6 and 7 year old boys had a blast! It was small enough they could go out and play while we fixed lunch or got ready for the beach. Everyone who works there is really nice and helpful. Our room was clean and cool. The only negative thing I could say is the parking is limited. I grew up coming to Daytona every summer and we've stayed at all kinds of places, but one's like these small mom and pop motels are where I have the best memories. Too bad all the giant condos are running them out and shading out all the beach!", "Date": "April 11, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“We loved the Magic Carpet”", "Author": "NOOPY", "ReviewID": "UR3790784", "Content": "Ok this was my second stay at Magic Carpet Motel. My last stay was in 1997 and it was great then too. Its a 3 story older style motel on the quiet lovely nice end of Daytona Beach Shores. Its been updated recently and the rooms are basic but VERY clean and cute. Bathrooms are basic, clean and well stocked .The rooms are partly tiled.The balconies are not that large but have great views OF DAYTONA BEACH .The owner is a lovely lady named Vickie who makes you feel very welcome. The pool is small but very clean and refreshing. Again this motel is located in Daytona beach shores section of Daytona beach... its beach is wide quiet and clean.You can also walk to Mini golf from here and Dennys and a supermarket. Overall its a small motel thats clean and quiet and and you can have relaxing BEACH FRONT stay here. ..I like the rooms on the second floor ... room 212 or room 211.", "Date": "August 19, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“hated Magic carpet motel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3630387", "Content": "Kitchen was poorly equipped. Had to ask managment for just about all kitchen equiment. When I went to the front office to ask for the can opener he got very nasty. He got in my face and started yelling at me. I found out many other people had the same problem as me. They also charge 50 cents for 800 toll free numbers. Very rude managment. Would never stay there again. It was a horrible, horrible place to stay with children. Very bad experience.", "Date": "July 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ocala Florida", "Title": "“What a bargain! Cute and Clean!”", "Author": "anniebanannie2", "ReviewID": "UR3616374", "Content": "The Magic Carpet is located at the south end of the beach on the east side of the road. I came back to trip advisor to specifically recommend the Magic Carpet Motel. My friend and I stopped at a half dozen plus motels before we came upon the Magic Carpet. Most we stopped at were priced over our budget for two adults and three kids, or they weren't clean enough to please us. Many times when you walk into the lobby of most motels, \"off the street\", you are given the highest rate. Not so with the Magic Carpet. We rented a two bedroom (four beds) with full kitchen on a Monday for $80 for the night. We had two balconies...lots of room for the kids to play inside and on the grassy grounds. A beautiful HEATED outdoor pool, which was great because it ended up being a rainy, dreary day. They even had pool toys! The rooms were very clean with tiled floors, the beds were super comfortable. Two TV's, microwave, pans, dishes, silverware.... The Taiwanese lady who ran the place was very sweet and always had a smile on her face. I would definitely recommend this hotel to anyone who is looking for a clean room at reasonable prices. You will enjoy your stay at the Magic Carpet in Daytona Beach because of its cleanliness, fair prices, swimming pool, and the nice lady at the counter who was a pleasure to deal with. Did I mention the pool overlooks the beach?????? FIVE STARS", "Date": "June 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“The perfect little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3558438", "Content": "My boyfriend and I have gone to the Magic Carpet Motel for the past 2 years...and plan on going again this year! The hotel is wonderful, it has everything you need including a kitchenette, color cable tv, tile floors, air conditioning, swimming pool with seperate kiddy pool and a GREAT GREAT view of the OCEAN!! It's wonderful to wake up in the morning open the blinds to your balcony and see the beautiful ocean. The hotel is family owned, a smaller hotel, but everyone is so very nice. You literally walk out of your room past the pool and you're on the beach. There is a convenience store right across the street...and for anyone looking to party there is a liquor store within walking distance as well. The staff is so great that last year our flight didn't leave for a few hours after we had to check out of our room so we left our baggage in the lobby for the owner to keep an eye on, she was happy to help us out. (( If you read one of the reviews prior to mine yes you do need to put a deposit down on the remote control for the tv but they just don't want you to steal their stuff!! )) I highly reccommend this hotel for a nice comfortable vacation.", "Date": "June 15, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "4", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“entertaining?”", "Author": "A TripAdvisor Member", "ReviewID": "UR3350434", "Content": "From the very start we knew we were in for some surprises. Like the continental breakfast consisted of granola bars and packaged debbies, waited for coffee every morning, the rooms were dirty and some smelled of smoke, parking was not a big problem, but we relized for the money this is not a bad place to stay. I would recommend to bring your own vacuum cleaner. I would come back because the price is right and their are great views of the ocean and easy access to the ocean.", "Date": "April 11, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Don't Stay Here!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2817446", "Content": "They quoted us one price and then charged us more when we got there. Our balcony was flooded from the air conditioner that was dumping water onto it. When we complained they told us we could use one of the mops they leave in the hallway. Parking is awful here too. When it fills up you have to park accross the street. They try to charge you for every little thing they can think of, if you leave a dirty dish there's an extra charge, need a rollaway, extra charge. They made us pay a deposit for the stupid remote control and then gave us the wrong one for our TV. When we took it back they acted like we were stupid for not realizing. Rude people run this place. The pool is always crowded. Do yourself a favor and stay somewhere else.", "Date": "November 10, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“this hotel was horrible”", "Author": "A TripAdvisor Member", "ReviewID": "UR2206449", "Content": "This hotel was horrible the air did not work properly we were hot the whole time the parking was limited we had to park across the street from our hotel the tubs in our 2 rooms did not drain correctly overall our vacation was a big disappointment", "Date": "June 20, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“We Love Miss Vicki”", "Author": "A TripAdvisor Member", "ReviewID": "UR2205150", "Content": "We have been staying at the Magic Carpet since my four yr old was in utero!! We love it and book the same week every year over and over again. WE look forward to seeing Miss Vicki and I always make her meatballs and sauce to enjoy when we go there. The room is clean and newly tiled and although it might not have some luxury things like the big hotels, this quaint place continuely draws us back year after year.", "Date": "June 18, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“A jewel in Daytona Beach”", "Author": "A TripAdvisor Member", "ReviewID": "UR1853438", "Content": "I have been coming to this motel for the past 10 years with my family and have always enjoyed my experience. While the Motel isnt much to look at from the exterior, the rooms are always kept clean and comfortable. The rooms are very spacious and most units have a kitchenette. It is convenient being directly on the beach and all the rooms have a view of the ocean. I have stayed in several hotels in the Daytona beach area but have always felt that this establishment (which is family owned) is the greatest value out of all of them. Everyone who I have referred to stay here has always had a great time and would reccommend anyone to stay here.", "Date": "May 2, 2004"}], "HotelInfo": {"Name": "Magic Carpet Oceanfront Motel", "HotelURL": "/ShowUserReviews-g34172-d283979-Reviews-Magic_Carpet_Oceanfront_Motel-Daytona_Beach_Florida.html", "Price": "$38 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2601 South Atlantic Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32118</span></span> </span></span></address>", "HotelID": "283979", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d9/bd/2d/magic-carpet-oceanfront.jpg"}}