{"Reviews": [{"Content": "Ok", "Date": "Sep 1, 2005", "ReviewID": "UR893759510", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "kariluz"}, {"Content": "Very Nice Hotel My mother and I stayed at this hotel and were very pleased. All employees were friendly and helpful. The room was very clean and comfortable. There were places to eat very close by. We used the public transportation and paid only a couple of dollars to go to the mall. People in this city are very nice and polite.Hopefully they will finish renovating the city soon. The cathedral is beautiful. They should paint the buildings and plant trees.The hotel was excellent and we recommend it.", "Date": "May 13, 2005", "ReviewID": "UR720964892", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent Hotel I have done much traveling inside PR and most hotels are overpriced, but Mayaguez plaza is really good. The rooms are new and clean, very comfortable bed, nice employees, free parking, and continental breakfast. It's an excellent choice b/c at night you can go out to dinner or a bar in Mayaguez (walking distance) and it's very accesible to all the tourist destinations of PR's southwest. I am making a reservation to stay there again!", "Date": "Dec 18, 2004", "ReviewID": "UR296121614", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent choice in downtown Mayaguez This is a beautiful, relatively new, small hotel right in downtown Mayaguez. Near all downtown ammenities (restaurants, bread shops, drugstores, etc.) but a bit of a drive to any beach (maybe 30mins?). There is not much to do in downtown Mayaguez... there are a few bars/pubs, a good looking church at the center (the plaza is beautifully decorated for Christmas) and that's about it. The rest of the town looks quite a bit run down, but apparently is undergoing lots of renovations. All in all, a much better choice than the isolated Holiday Inn in town for a very good price. Good option if you're visiting the Mayaguez University or for a meeting in town, but there may be better choices if all you're looking for is a beach.", "Date": "Oct 9, 2004", "ReviewID": "UR940336514", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "myself"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g147321-d287263-r3836225-IHP_Mayaguez_Plaza-Mayaguez_Puerto_Rico.html", "HotelID": "287263", "Price": "$104"}}