{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Dingy, unfriendly, no heating”", "Author": "TayarIL", "ReviewID": "UR125533786", "Content": "This must be the one of the worst hotels my partner and I had ever stayed at, especially within the medium price range. Our bathroom was filthy; the electric socket next to one of the beds was missing, revealing the wiring underneath; the bed itself was not the cleanest; and, despite the snow storm raging outside, the heating did not work. Given the unfriendly service we had encountered at the desk, we did not bother to complain, but were thankful to be leaving the next day. In an area that is chock-a-block with pensions, you are sure to find a better deal elsewhere.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Auckland", "Title": "“Positano is a cheap and cheerful place for short stays in Rome.”", "Author": "Tony v", "ReviewID": "UR122952268", "Content": "We've stayed at the Hotel Positano many times. We choose it because we're staff travelling with university students on limited budgets. Students stay in dormitories of 3-6 beds and staff stay in single or double rooms. Although modest in provision with small rooms we take pleasure in the reasonable prices and the location - only 5 minutes from Termini Station - as well as the dozens of small restaurants and pizza bars nearby. Even better are the staff, especially Javed at reception who is immensely friendly and helpful at all times. Breakfast is taken at a corner cafe. Positano is not flash but it's clean and comfortable enough for our (admittedly undemanding) purposes. We'll be staying there again this year and saving money for other more exciting things. After all, why stay in your hotel room while on holiday in Rome?", "Date": "January 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "denver, co", "Title": "“Good Value for price”", "Author": "chevaf8b", "ReviewID": "UR122004269", "Content": "Hostel Positano is in a good location very close to the train station. We walked everywhere and never took the train. We were able to walk to all the main attractions including collesium, vatican, forum, etc. There are many restaurants and bars around the hotel which is very convienient. The hotel staff isn't the friendliest but were helpful. I had read about guest getting bed bugs and i was very worried about that but I never experienced any bugs. I had paid for a private room with a shared bathroom and the bathroom was very dirty. I don't know why but there were girls staying there that threw away their dirty underwear in the bathroom trash without even trying to hide them. STRANGE! Can somebody explain this to me? For the price of the hotel in the city it is in I think this place is a good value. I would return and I would recommend for my friends. Families should go elsewhere.....", "Date": "December 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Don't even think about it”", "Author": "LizzieTravelsOut", "ReviewID": "UR119782408", "Content": "The location was very good, just around the corner from the train station. Close to a supermarket and a metro. But these are the only good things about it. The hostel was dirty and had graffiti and swear words and beer bottle stickers on all the walls. There was hair on the floor, the toilets stank and neither of them had toilet seats. We did not even try and have a shower. The door jam in our dorm room was damaged, it was clear that the door had been forced open/kicked in at some point and the wood was never fixed, just a new piece of metal put there. We were a mixed group of three and none of us felt safe leaving our bags there. Our concerns for saftey issues were ignored by the three members of staff we spoke to and also the manager when we finally found him. After a sleepless night with drunken roommates having a fight in our room at 3am we could not face another minute there - so lost our money on the second one booked (they have you pay before they show you the room!) then when we asked for the money back they refused saying that basically it was a cheap place and that you get what you pay for! Shocking that they expect people to pay to stay in rooms that are like a cell. The manager says he has never had a complaint, but judging from these reviews, that was a lie. Lesson learned, never book a hostel that you do not do research about before! We ended up going to the M & J hostel next to the Lounge Bar, just around the corner and it was total bliss in comparison.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Unhelpful staff and dirty”", "Author": "jab8942", "ReviewID": "UR117094570", "Content": "While staying here we got bedbug bites and a girl down the hall also did and we found the bugs on the mattress. The internet was only in the very small lobby and they shut it off a 2 am which would be find except for the time difference, I had to work around to get in contact with my family. When I checked in and paid they did not have enough change and simply said we owe you a few cent, just very unprofessional. Atleast the front desk the rest of the workers were friendly. Overall it was not worth saving a few bucks to stay here", "Date": "August 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Gatineau, Canada", "Title": "“Just okay”", "Author": "Patty103_103", "ReviewID": "UR74903444", "Content": "Dark room, dingy feel. Front desk just \"going through the motions\".", "Date": "August 12, 2010"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Location": "5", "Value": "4"}, "AuthorLocation": "tel aviv", "Title": "“good location worth for what we 've paid”", "Author": "jocohentelaivi", "ReviewID": "UR69600015", "Content": "We found the Hotel Positano by asking for a recommendation at the Beehive, a Rick Steves' recommended hotel. The location was fantastic, blocks from the Termini train station in Rome, only 5 minutes away from Termini and Metro, , the bedding and linens were clean, the price was right and again, the location was great. The reception staff was friendly and helpful, and we only paid 30E per personvery good location room was clean and had been cleaned up every day; we got new towels every day If you're compare hotel and hostel prices in rome , really can't complain about the place t at all!", "Date": "July 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“NO FRILLS or power”", "Author": "AndrewandJenna", "ReviewID": "UR67706405", "Content": "Very poor condition, smelly and dirty. The power went out about 4 or 5 times at night because it couldnt cope with all the people on the floor using laptops and hair dryers so had to go downstairs (6 floors) to get reception to reset it everytime. Extremely noisy, don't expect to get any sleep, beds are crap, no bedding, just sheets. We had drunk kids all night long and you basically have to take it into your own hands if you want them to be quiet. Complaints to reception were no use at all.. Good location, that is all..", "Date": "June 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Think twice before booking!”", "Author": "applelov3r", "ReviewID": "UR62186402", "Content": "My friends and I were there for a trip and we have forgotten to lock the door one night.The hostel door couldnt auto-lock from outside and as a result, a thief came in to steal my bag off while I was asleep. I only realised it the next morning. And when u asked the reception what they can do, it was disappointing cos there was practically nothing they can do! The hostel didnt even have a CCTV for safety purpose. So if you are looking for budget hostel, never even think of going there because it is not worth it at all. A totally bad experience for me, and I hope it doesnt happen to anyone of you vising Rome.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good value - ok rooms”", "Author": "majorthombe", "ReviewID": "UR54953251", "Content": "For a budget stay in Rome, this seems to be a good offer. Clean rooms with nice reception personnell. God value for money", "Date": "February 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“SAY AWAY FROM THIS PLACE! SAVE YOURSELF!”", "Author": "ajstraveller", "ReviewID": "UR53715077", "Content": "Spent two painful nights at the Hotel Positano. The room was dirty, to say the least.The bathrooms were so bad that I waited until going outside and used public toilets instead. I don't think the toilets had ever been cleaned. They had some weird, green growth covering them and smelt discusting. The lift scared me. I was on the top floor, and saw that the roof supporting it was heavily cracked and sagging under the weight; a MAJOR SAFTEY ISSUE!!!!!! It reminded me of an orphanage or a prison cell. the walls were covered in beer bottle labels and we only got towels after fighting with the person at reception. Worst Hotel/Hostel I have ever stayed at.", "Date": "January 17, 2010"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "East Midlands", "Title": "“A bad experience”", "Author": "bowra", "ReviewID": "UR23703415", "Content": "The outcome of my overnight stay in a not very clean room at the Hotel Positano, in late November 2008, was 39 bed bug bites. The bedcover had stains, the bathroom mirror light was not working . A request for a refund has so far been ignored.", "Date": "January 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bargain bed in dorm”", "Author": "pmbma", "ReviewID": "UR13239608", "Content": "I missed a flight, and got back to the city centre needing a bed from midnight until 4 am. There's a load of cheap places around Termini statio - first few were completely full (it was almost almost midnight, late on a Saturday evening). Positano had a 3-bed dorm, which had only one person in it. Guy at reception was cheerful, and for 12 euros, I couldn't expect that much. Bed was OK with clean sheets. Not that quiet (could hear someone having a shower across the corridor), but did manage to get some sleep. If you're paying hostel prices, really can't complain about the place.", "Date": "February 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“Good/inexpensive place to stay for the night”", "Author": "artdreams", "ReviewID": "UR7999787", "Content": "We stayed at the Hotel Positano in Rome this past Saturday night, June 23rd. It was fine! And the location is only about 4 blocks from Rome Termini in a nice part of town; there were several trattoria with outside seating in our immediate vicinity. Our room on the first floor with four beds was spartan(looked like a hospital room) but very clean, and two single bathrooms were right outside our door. They also were clean and attractive. The desk staff was friendly and helpful, and we only paid 30E per person. I had dreaded going there after reading posts on here from a couple years ago, so I wanted to update the reviews with our experience there. If you only need to stay for the night to catch a bus or train in the morning, as we did, this was a good place to be.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "England", "Title": "“dirty!”", "Author": "Italytourist1", "ReviewID": "UR5609716", "Content": "The bathrooms are filthy, there are no mirrors and the shower doors are hanging off so the bathrooms flood. we had trouble locking and unlocking our door, but when reported to reception the staff were unhelpful and may made no attempt to sort the problem out. There's only one key for every shared room, and the bedrooms were not cleaned once in our four night stay. no towels were included either, even though their website said that they would be. the only good thing is that it is five minutes walk at most from termini station and the metro.", "Date": "August 14, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“pretty good hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5296190", "Content": "I have stayed in Hotel Positano several times and I find that the staff has been quite friendly and helpful. However, my advice is to avoid rooms on the upper floors without private bath because the shared bathrooms are kept in a horrendous state. Rooms with private bath on lower floors are quite good and are a good value. The area itself is seedy and shady so try not to walk alone very late at night.", "Date": "June 3, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Tucson, Arizona", "Title": "“A real stinker”", "Author": "crotalusBerkeley_CA", "ReviewID": "UR5182572", "Content": "I thought 65 E a night with bath was a good deal, but I must recomsider. The staff were indifferent to rude. My room was dark, airless and grubby. The bedcover was filthy. The TV did not work, the haidryer had no hose, and the place smelled of old sox. The location is excellent, but that is about all I can say for it", "Date": "May 19, 2006"}], "HotelInfo": {"Name": "Hotel Positano", "HotelURL": "/ShowUserReviews-g187791-d288463-Reviews-Hotel_Positano-Rome_Lazio.html", "Price": "$86 - $158*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Palestro 49</span> | <span class=\"extended-address\">Rome, Lazio, Italy</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "288463", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/5f/13/hotel-positano-thumbnail.jpg"}}