{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Reggio Emilia, Italy", "Title": "“No reason to choose it. I explain you why.”", "Author": "marcoferra", "ReviewID": "UR127067743", "Content": "I frequently travel to barcelona and I've tried many hotels. Barcelona is full of good hotels for 100 euro. This one, for this price give you. Small rooms, old dirty moquette, broken elevator,noisy rooms, unkind and useless reception desk and a terrible breakfast ( 9 euro extra). The best of thi hotel is the position, it's between university an catalunya. But in barcelona public transport (metro+ bus) is fantastic, taxi are cheap, I suggest to find a new design hotel for the price of pelayo and spend 5 mins in metro to move to the cent er.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bridgend, United Kingdom", "Title": "“clean and basic”", "Author": "stephen c", "ReviewID": "UR125037490", "Content": "neat hotel, bathroom clean, good shower, comfortable room and excellent location with access to all city centre shops and attractions.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "AyeshaA-F", "ReviewID": "UR122682671", "Content": "Nice, clean hotel..friendly staff..excellent location..right on University square..1 min walk to Metro..5 mins walk to La Rambla and Placa de Catalunya", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lausanne, Vaud, Switzerland", "Title": "“Well located, friendly staff but average room”", "Author": "Primaully W", "ReviewID": "UR122403793", "Content": "Situated just in front of Universitat de Barcelona, across the metro station, surrounded by shopping area, restaurants and 5-10 minutes walk to Plaza de Catalunya. The staff are very friendly and helpful and even helped us to printed out our boarding pass for free. Free wifi available only at the lobby and there are PCs available for guests. The room is a bit out dated but clean and comfortable enough. We got the corner room with the view of Universitat de Barcelona which we are quiet happy with.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great Location and Very Clean!”", "Author": "SBW11", "ReviewID": "UR119087068", "Content": "This hotel is in a great location. The aerobus drops you off right across the square from here and the metro station is just a few steps from the hotel. Very easy to walk to Las Ramblas, the nice area up by Casa Battlo and you can actually walk to the beach from here (30 minute walk). Lots of restaurants and stores in the area. Didn't get the breakfast. No wifi but the room was cleaned daily. Very simple rooms but they do have a safe in them.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Faulty towers!”", "Author": "Renee2208", "ReviewID": "UR118847729", "Content": "Do not stay here! They messed up our booking and they were completley incompetent in resolving the matter. We were forced to stay at another location and were out of pocket by hundreds of euros. At the same time as we were checking in, another customer was complaining because they had misplaced her passport, and she had to report it missing to the police. They have completley inconvenienced us and made us waste time we could have otherwise spent exploring Barcelona. If you expect good customer service, do not stay here.", "Date": "October 2, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "perth", "Title": "“nice little place :)”", "Author": "26andcounting", "ReviewID": "UR118316722", "Content": "this hotel was lovely. its location is perfect for la rambla and the beach, also good for buses etc as they are just a block or two away, as is a starbucks. which is where we often went in the morning for breakfast or coffee on our way out for the day as we did not pay fro hotel breakfast. the staff were very friendly, professional and helpful. it was well run and organised but still felt a little like a family business - which is nice. our room was a triple and was quite spacious with lots of storage and very comfortable beds. it was modern but not flashy, quite basic and simple. the bathroom was good and there were complimentry toiletries. there is a good lift and the stairs are wide and easy to take upon arriving our aircon switches seemed to be broken and i went downstairs to ask them to look at it, before i got back to the room someone had already got there to fix it. it has 24 hour reception and they were very helpful. they gave us maps and explained distances and travel times, suggested things to do. there was a computer in the reception area with internet access that was free to use. i dont know if there was wifi it isnt ultra flashy but is very clean and minimal and a happy place to be. i would gladly stay here again :)", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Great location”", "Author": "Julie A", "ReviewID": "UR117750365", "Content": "This hotel is in a great location less then 5 minutes from Las Ramblas and other tourist attractions. There was a good selection of foods for breakfast and the staff were helpful and courteous. We were able to leave our bags at the hotel for the day after checkout time as we had a night flight which was really helpful. We were allocated one of the corner rooms which was lovely, cleaned every day and had air conditioning that wasnt noisy and worked perfectly. IWe can recommend Scobies an Irish bar just round the corner and the staff twere really friendly and gave us tips on where to eat etc. Although finding somewhere cheap to eat proved difficult we managed to find a selection of great restuarants just of las ramblas (in a square) that did fantastic 3 course meals of the day for 10 Euros inc wine. Great for a late lunch. No problems with security (our room had a safe) and the area that the hotel is in felt very safe as it was on a main road not one of the side streets and wasn't noisy at all. Can highly recommend this hotel. Would recommend the Olympic Park which was amazing and of course the Gaudi architecture is outstanding. A great city to visit.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great value for money! I definately recommend this hotel”", "Author": "itayab", "ReviewID": "UR116141090", "Content": "The location of this hotel is great! physically 10 meters away from the Universitat Metro station, 100 meters from Catalunya Metro station; 6 minutes walking to Catalunya square, 5 minutes walk to 'La Rambla' street. The hotel name might be confusing - it is also called \"City Park Pelayo\", of HLG hotels branch. Maybe the owner changed recently... so you might see the same hotel photos & address over the internet - with different names. If you arrive to Barcelona Prat Airport at night, you can take the night bus N17 directly to the hotel - stop is at 'Universitat' station. The street itself (pelai street) has a lot of shopping stores, like Zara, C&A, TopShop, Pull&Bear, etc.. The hotel room is small, without much space to move around - but assuming that you're not staying at your room the whole day.. it's fine! The air condition was OK ! also, you have a safe in the room which is important. There is no WIFI in the rooms - you have a computer with free internet in the lobby. The room was clean and the chambermaid cleaned it every day. The hotel staff was very helpful and nice. They also kept our luggage in a safe room. The breakfast was good, but not excellent - you won't get omelete or vegetables - but you will enjoy it: coffee, cornflakes, bread, croissants, cheese, sausage, yogurts, fruits, jams..", "Date": "August 2, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Nice, France", "Title": "“Very much liked the hotel but....not sure about the security”", "Author": "tillietee", "ReviewID": "UR115680050", "Content": "I left the hotel on Friday 22 to continue on to Nice. It was not until i went to use my credit card, which i left at the hotel since 4pm that day. There are only 2 possibilities 1) a pickpocket got me and very kindly decided to pickpocket me again to return my wallet......? 2) Someone at the hotel entered the room and ruffled through my things until they got what they wanted My advice is it´s a nice hotel, most of the staff were great, but lock up your valuables and don´t get your room cleaned", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Don't go there- very Bad experience”", "Author": "revimon", "ReviewID": "UR115440400", "Content": "My wife and I stayed at Hotel Pelai 1 - City Park in Barcelona between 3-6 of July 2011. Throughout the four days we stayed in this hotel we didn’t have any hot water to shower. We asked the reception several times to take care of the problem but we came across Bad and indifference Attitude and abusive comments, aimed mainly to buy time until our check out. The room we stayed at was very very small, with a small window that can't be opened and the air conditioning is weak. The hotel is in good location for those who like to be in the most visited areas in Barcelona. We paid 72 € per night - not worth the money.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Great place for a first visit in Barcelona”", "Author": "Radev", "ReviewID": "UR114940346", "Content": "The hotel is located in a perfect spot for visiting Barcelona. Friendly personnel, great room and although in a very busy location, well isolated and quiet. Subway just 5m from the entrance and bus stops near, we were able to visit every part of the city easily. Its a perfect city hotel, yes without extra facilities, but when you come for a city visit and spend mainly the night in the hotel its more than excellent. Room perfectly cleaned and tidy everyday and the bathroom was from a class of more stars.", "Date": "July 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boldon, United Kingdom", "Title": "“Excellent City Centre Location”", "Author": "m_mckenna76 Posted by an OctopusTravel traveler", "ReviewID": "UR103855846", "Content": "This hotel is in an excellent location, aprox 150m from Placa de Catalunya with excellent transport links to the airport (via Aerobus) and around town using the excellent Metro system (there is a stop about 10m from the front door of the hotel. The staff are friendly and the hotel is clean and well maintained. Only issue I had with this hotel is that the rooms were very small. But for the price and location I can't complain. Breakfasts were a continental buffet. There was plenty of choice of meat, cheese, bread, pastries, cerials. Overall an excellent stay.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good Location and Value but small rooms and rather loud”", "Author": "dlibes", "ReviewID": "UR86315797", "Content": "We recently spent a weekend at this hotel. The location was very good - close to the Unversity and La Rambla. The cost was very reasonable making this a good value. There were a number of inexpensive locations for breakfast nearby. However, the rooms were very small and there was a good amount of street noise so that should be taken into consideration for those who might be bothered by that. Also Internet is only available in the lobby.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sunnyvale, California", "Title": "“Hidden Gem”", "Author": "JenB3", "ReviewID": "UR65728514", "Content": "We stayed here during our European honeymoon between Christmas & NYE in 2007. We were coming from a very bad hotel stay in Dublin, so my expectations & spirits were pretty low. I'll admit that upon walking into the tiny lobby, I didn't get an excellent first impression, and worried that it was going to be more of the same. Fortunately, when we got off the lift and walked into our room, I was very pleasantly surprised! I will say that I think we had one of the biggest rooms in the hotel (the rounded, corner room with a whole wall full of windows), according to the emergency evacuation floor plan, so that could make a difference. But, we were very happy with our room, and it instantly made us excited about our trip once again. We were out exploring Barcelona most of the time, but we were always happy to return back to the room at the end of each day. It was safe, quiet, and clean. We were really surprised at how quiet the room was even though all of our windows faced out on the corner of the street which was a very heavy traffic area & right across from the University. We rarely heard any road or horn noise. We also appreciated the free breakfast (although, the breakfast room feels like a dungeon) & espresso machine each morning. It wasn't anything fancy, but it was fine for a free light meal. The front desk staff was really helpful. I came down with a bad cold while we were staying there, and they explained how to find (and use) the Farmacias there. They also directed us on how to get to La Rambla (which is only a few blocks away), Parc Guell, and the nearby Open Top Bus Tour stop. The ideal location, clean, modern rooms, and low price (in comparison to surrounding hotels) makes this a hidden gem. We would stay here again in a heartbeat!", "Date": "May 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Good location, CLEAN, rooms a little small though.”", "Author": "PeterIovan", "ReviewID": "UR60693192", "Content": "A good choice in an area dominated by much more expensive hotels. The location is great, 5 minutes from Placa Catalunya, the heart of Barcelona, and one end of La Rambla. Modern furniture, a very nice hardwood floor imitation which entices to cleanliness. Our room, 408, a triple, had a nice a bathroom with a window, that can be opened allowing for quick steam and smell elimination. The 2 single beds were very good, but the third bed, a single sofa bed, would not be comfortable for an adult. It also makes the room quite small, when extended for use, but if you only use the room to sleep and wash, as we did, it is OK. I would emphasize again the CLEANLINESS, the bed linen is spotless white, as the towels. There are no rugs, a plus from a health point of view, just plain shiny laminate floors.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Undervalued gem in the heart of Barcelona”", "Author": "barthelonaluvr", "ReviewID": "UR50758851", "Content": "City Pelayo is only a 2 star hotel, but deserves at least 3. The location was perfect - literally right next to the metro stop 'Universitat', is a few blocks away from La Rambla, a block away from the University, and is on a great street full of shopping and restaurants. Though simple, the rooms were very clean, classyand comfortable. The reception was always very helpful - willing and ready to recommend places to eat, visit, or shop. Overall, I would recommend this hotel to anyone, especially those travelling on a budget and looking for a great place to stay. I will certainly return to this hotel again.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "luxembourg", "Title": "“cheap but poor”", "Author": "giofit", "ReviewID": "UR49479968", "Content": "Pros: location (only 3 minutes from plaza de catalunya), price. Cons: our room was very tiny (I believe other rooms to be normal, as from the hotel plan); unfortunately it was not possible to change it... breakfast was very poor recommended only for low budget weekends.", "Date": "November 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tottenham", "Title": "“This excellent hotel in a good location deserves a 3 star rating.”", "Author": "TottenhamJim", "ReviewID": "UR47629895", "Content": "Good service. Small but comfortable room with mini fridge. Bathroom very well equipped with Bath/Shower and - to our amazement - BIDET. Good location - just across the road from the Airport bus stop coming into Barcelona, and close to Universitat Metro station. 5 minute stroll to Plaça de Catalunya (where there is another Metro station), then stroll down the Ramblas, and end up at the beach. Lots of shops and places to eat, but our favourite place for an evening meal was another hotel around the corner, the H10 Universitat, Ronda de la Universitat. They had a special offer at €20 each and it was a treat! Barcelona was lovely and the weather was perfect (beginning of May). We will return!", "Date": "October 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "iriskas", "Title": "“Good location, clean,very basic”", "Author": "iriskasiriskas", "ReviewID": "UR41438832", "Content": "My husband and I are in our late 20s/ early 30s, were overall satisfied with the location and cleaniness of this hotel. However, be sure to bring a clock, as this hotel has no clocks int he rooms and one time they forgot to give as a wake up call! thank goodness it was not the day we were leaving, or we would have missed the flight. Otherwise, it's a decent hotel.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great location! Basic, but everything you need.”", "Author": "SFHSydney", "ReviewID": "UR39011704", "Content": "We really liked this hotel - it's not flashy, it's nice but fairly basic, but it has everything you need and is in a perfect location. For us location was everything, we don't spend that much time in the hotel anyway and we wanted to be close to the action. This hotel is a 2 minute walk to La Ramblas and Placa Catalunya, and 5-10mins walk if you want to go down to the Gothic Quarter or further. We walked everywhere and loved it. The hotel staff were very friendly and helpful. We stayed 3 nights at the start of our trip, and had a fantastic room (one of the larger corner rooms, on the curved section of the building) which was lovely. The bathroom was large and immaculate. We had nice views, and the rooms have a safe which is important in Barcelona. We actually decided to return to this hotel at the end of our trip, as we had a couple more days in Barca. We booked at the last minute and had a smaller room, but it was fine for our purposes. Would recommend if you want a great central location, pretty good value, and are happy with a room that's clean and comfortable, but not really flash.", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Great Sutton", "Title": "“Excellent Price, Location & Service”", "Author": "79SHS", "ReviewID": "UR34028413", "Content": "Hotel is less than a 5 minute walk from bus stop where aeroport bus picks up & drops off at Placa Catalunya. Various metro stations within easy walking distance, not that we used the metro as the location of the hotel is perfect. Hotel staff friendly & helpfull as we were able to check in early. Continental breakfast provided, which had plenty of choice. Room was much bigger than I expected & bathroom had 2 showers & a large bath. Both bedroom & bathroom was air conditioned.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Very enjoyable”", "Author": "Rogsim", "ReviewID": "UR20055121", "Content": "Just returned from a 5 night stay at this hotel, which was clean, room basic (double bed, desk unit, leather chair, tall unit for TV, coffee machine and fridge) but comfortable although on the small side. Bathroom, good size, very clean and stocked with toiletries, daily towel change, efficient room aircon (33 deg outside during the day). Breakfast was adequate for a 2 star, variety of breads, rolls, cheese, cold meats, yougart, pastries, etc. The breakfast room in Basement was a bit claustrophobic. Fantastic hotel location, metro right outside and 5 min walk down to the bustling La Ramblas. Thought the many Tapas bars along La Ramblas to be 'rip offs' and better to seek out eateries in the side streets and narrow alleys. Most tourist sites easy walking distance, public toilets exist but you need to hunt them out!!! Port Vell leisure island is good for harbour side restaurants, 'The Wok' was excellent, the beach front also has frequent toilets and good bars/restaurants, 'Sol Cafe' was also excellent value. The Aerobus from airport was ideal, terminates at Place Da Catalunya, less than 5 mins to hotel, fare now Euro 4.05. and run every 6 mins. The only 'downside' of a city centre hotel is the traffic noise which disturbed the sleep but other than that .............would recommend the hotel and Barcelona which has a great atmosphere.", "Date": "September 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Excellent location, helpful staff”", "Author": "Tavistock", "ReviewID": "UR16752079", "Content": "I spent 3 nights at the City Park Pelayo Hotel with a friend just a week ago. The location is the best: the underground stop Universitat was just under our window. Moreover, we could have easily walked to Placa de Catalunya, which was just one underground stop away. The street was very quiet and we had no trouble whatsoever in going back to the hotel at night. My friend and I had a double ensuite room on the 4th floor. It was a nice room, not enormous but comfortable enough for two people. The only thing missing was a desk or small table, but then we didn't need it. The bathroom was spacious, quite big actually. The air conditioning, which I guess must be very useful in Barcelona during the summer, was working very well. There were also a fridge, a tv and a coffee machine (we never used this). Everything was clean and functional. Everyday new towels were provided, even if not asked for. Breakfast was not included in the room fare, but it was always available in the morning in the breakfast hall for a little extra. It was a buffet, nothing special but enough to fill you in. The hotel staff were kind and helpful. On the last day they let us keep our luggage in a locked room after we checked out. To sum up, the hotel is good, the location excellent. I think we got what we paid for.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "edinburgh", "Title": "“great location”", "Author": "jambofan", "ReviewID": "UR15382209", "Content": "the location of this hotel is excellent. the room we had was very small and the bed was so hard it was difficult to sleep. although the room was very clean and done every day, the coridoor carpets were very stained and shabby. the room was very warm and the windows didn,t open, also the air condition wasn,t working. breakfzxt was included in our price but the dreary room in the basement where breakfast was served would put you of. also it was not worth getting up for. all in all, not a hotel i would ever return to i,m afraid.", "Date": "April 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Fantastic value for money!”", "Author": "gemma_00", "ReviewID": "UR12594783", "Content": "Great location for visiting all the sites in Barcelona. The Metro is right outside the hotel, + La Rambla is only a 3-5 min walk away! Had a great room overlooking the square, the room itself was basic but had a spacious (clean) bathroom. The breakfast was good, toast, friut, cakes, meat and various drinks. The staff were pleasent and could speak good english. Would recommend to anyone doing a short city break. Would return again!", "Date": "January 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North East, UK", "Title": "“Great budget hotel”", "Author": "monkey3479", "ReviewID": "UR10660959", "Content": "I stayed here for 4 nights with my boyfriend. The hotel was excellent value. Our double room was small but had a good sized bathroom. The location is excellent. Staff were very friendly. We did not have breakfast in the hotel as there are so many great places all around.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Top Basic Hotel!! Highly recommended for the budget Traveller!”", "Author": "kanta79", "ReviewID": "UR10038104", "Content": "This hotel was in an excellent location, right round the corner of Plaza de catalunya. Heart of Las Ramblas. Would definitely stay again...! We stayed for 4 nights, had a very comfortable stay. The breakfast was good, simple buffet. Service was Excellent. Location Excellent. Clean rooms.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Brilliant! Best location you could ask for!”", "Author": "ScoutManchester", "ReviewID": "UR8238017", "Content": "This hotel is at the top of La Rambla , right next to Universidad metro stop and a few minutes from Catalunya metro stop. It's less than a minute to La Rambla and althoguh it's on a busy street, it's not a problem. A recurring theme seems to be the TV and coffee machines being out of order, maybe they never worked! But it would be better to remove them from the room completely if this is the case. The hotel is very clean, modern and has a top breakfast down in the basement! We loved our stay here, the room and hotel overall were quite small but not inconveniently so. I would defeinitely recommend, and I can't believe what great value for money this is. Also....we arrived late and wanted to find somewhere for dinner near by and that were still serving! One of the first buildings on La Rambla that you'll come to is a cafe downstairs but just above is Bacco (you'll see the name on the window, it's next to Burger King unfortunately!). It was really cheap, lovely food (starters were stunning, main course nice but nothing fancy). And we had a view over La Rambla and Place de Catalunya.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "CARDIFF", "Title": "“Had everything we needed! Fab little hotel.”", "Author": "TCTOPS", "ReviewID": "UR7587381", "Content": "Got back this morning from a short stay in this fab little hotel. Highly recommended. Can't understand why it's classed as a 2star - I've not long come back from a 4star in Rome, which wasn't any different! Room was slightly on the small side, but that's not really a negative, as it had everything we needed. Room was exceptionally clean. Clean bed sheets and crisp white towels, which is what you would expect anyway but after reading reviews of other hotels around La Ramblas - you never know!! Slept through the night - no problems with noise. Mini bar / fridge in room - apparently the refreshments are free - they didn't charge us for the water we took. There is a coffee machine in the room, but even my clever techno sister couldn't work it out! Continental breakfast. A little basic, but very filling. The usual, bread, toast, cakes, (try the pain au chocolate - yummy) fruit, cereals, tea coffee fruitjuice etc.etc. ALL Staff were very friendly and helpful. Excellent locatation. Very close to La Ramblas - less than a five minute walk - in a straight line, so no way of getting lost!! Lots of very nice clothes shops all around the hotel, so get ready to spend some money. Just behind the hotel is Bus Stop No.1 of the open top hop on/off bus. This will take you to all the sights around Barcelona. it cost 20euros for one day, or 24 euros for a two day ticket. Well worth the money if you want to try and fit everything in in a short space of time. We just managed most of the sights in two days. If you're looking for somewhere nice to eat, try The Attic Restaurant near the centre of La Ramblas. V.nice restaurant. Bill for 4 of us came to 100euros (£70) for 4 three course meals, which included a bottle of one of their dearer wines. Couldn't understand why it was so cheap there as the food was fab. (Tho, Make sure you ask for your starter to come separately to your main, or they'll bring it all out together)!!!! I travel a lot, and always research my hotels before I go - this hotel is definitely value for money. No complaints from me.", "Date": "May 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Conwy, Wales", "Title": "“Absolutely Recommended”", "Author": "yerominas", "ReviewID": "UR7564698", "Content": "We would recommend this hotel on all counts. The location is superb, on Placa Universidad a couple of minutes walk from Rambla & Placa Catalunya. Our room was great - we had a double bed (a little hard but we were so tired after walking all day we hardly noticed that), safe(no extra charge), desk & chair, fridge, TV, coffee maker (but no coffee!), bathroom with bath & shower, WC, sink, bidet, hairdryer & complimentary toiletries. We were on the fifth floor & had no problem with noise from within the hotel or outside. Everywhere in hotel extremely clean & well cared for. Continental breakfast in the basement dining room was good & plenty of it. All staff, especially reception, were really friendly & helpful. We were able to leave our cases locked in office all day on day of departure. Will definitely return to Barcelona & to this hotel.", "Date": "May 8, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Terrific”", "Author": "Tricia60", "ReviewID": "UR7339130", "Content": "Great location. 2 mins from Universitat metro station (buy 10 journey targete to use on metro or bus) and 5-10 mins walk from Plaza Catalunya - the centre of everything. No 24 bus (cross road and round corner) will take you out to the Park Guell, which is well worth a visit. I booked at last minute via Ratestogo - added 2 nights on to business trip - and had small double room on 4th floor, Room 402. Would have been bit of a squeeze for 2 people but OK for one. Expect that's why they gave it to me. Room was clean and in good condition. Water and soft drinks in free minibar. I couldn't get coffee maker to work, but that may have been down to me. Receptionists very friendly and helpful. I arrived quite a bit before earliest checkin but that wasn't a problem. I was given room at once. When I said I wished I had a small metro map instead of the one on the back of the large map, she cut one out of another map for me. The only lift was out of order on morning I was checking out. Receptionist suggested I leave packed bags in room and chambermaid would lock them away upstairs. I didn't hear any noise from other guests. Bit of traffic noise even with windows closed, but that is to be expected given the good lcoation. I was given window key at reception to open window during day. Hotel is run to higher standards than your average 2 star. There is a white coated housekeeper with clipboard who supervises cleaning and preparation of rooms. As others have said, breakfast is a bit basic, but there is plenty of food there if you want. Fresh melon on the second morning was a welcome addition. I wouldn't hesitate to stay here again or recommend it to friends.", "Date": "April 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast Northern Ireland", "Title": "“City Park”", "Author": "OpsRog", "ReviewID": "UR6557349", "Content": "Booked last minute and arrived late, had absolutely no problems checking in and finding the room. Got to the room and was surprised at the facilites, tea/coffee/fridge which i found particularly handy for keeping drinks etc. Bed was firm but very comfortable, the bathroom was great, very well fitted and modern. It was a clean and friendly hotel which is all you want when travelling, the point is you go on holidays to see the sights etc, not spend your holiday in your hotel....it was so good we have booked to stay there again this year and would recommend it to anyone and in fact have done so to a few work colleagues who have also stayed and would so again.", "Date": "January 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, UK", "Title": "“Fantastic Location”", "Author": "NikNak79", "ReviewID": "UR6552786", "Content": "We stayed in Barcelona over the New Year period this year and booked the CityPark hotel as it was cheap and seemed near to the Ramblas area. Because of the price - about £30 a night, we weren't expecting much at all, oh how wrong we were. Room was lovely, very clean and with everything you need for a short city break.....beds, clean bathroom, safe, fridge with free drinks, hairdryer, free toiletries .... and hotel had a spacious lift to each floor - always useful! The location of the hotel is fab, just one block from the Ramblas, which means you are near enough to all the action but slightly away from all the hustle and bustle for sleeping at night. We were two girls and felt very safe walking back to the hotel at silly-'o'-clock in the morning. The hotel is also right next to the Universitat metro station and 2 mins down from Catalunya Square station. I would definately recommend the CityPark to anyone going to Barcelona, I have been and stayed in the H10 Montcada before which is a very nice hotel but is not in as good a location as this hotel. I managed a photo of the bathroom but my camera batteries ran out so sadly not one of the bedroom area!", "Date": "January 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“It's a 2 star hotel”", "Author": "Globetrottin_Grannie", "ReviewID": "UR6164340", "Content": "Hotel City Park Pelayo Barcelona My husband and I stayed here for 3 nights in late September/October. It fitted our criteria of A/C,fridge,non smoking and a safe in the room. We booked it through Expedia in July before we set off on a long trip and it was amongst the most expensive hotels we stayed in. 129.00 Euros room only. And the least value for money. The lobby is tiny, as is the lift. Needless to say so was the room. The bed was so small it can’t even have been a double. It was downright uncomfortable too. There was no night table by the window side, so we pushed the bed against the window wall to be able to move at all. We were falling over our bags as it was. The wardrobe was minute There was only room to hang up 2 jackets, and was really only the entry to the water downpipes. Every time someone upstairs had a shower or used the loo we knew about it. There was a stand at the end of the bed containing T.V. and an espresso machine, with 2 plastic disposable shot cups and 2 sachets of coffee. Minibar underneath no milk provided. The 1st day we returned in the middle of the day and were surprised that the coffee and cups were not replaced, neither were the towels. So we asked for, and got them assuming it was just sloppy housekeeping. The 2nd day towels replenished but no coffee. When my husband asked for it he was told that they only supply once. When he pointed out that we were paying the same rate every night he was given 2 sachets-we had bought our own milk already. It was just ridiculous the machine would only hold these little sachets; I’ve no idea where one would buy them. We didn’t bother asking for new disposable cups-(they were never replaced) as we had our own basic travelling picnic gear and we felt it just wasn’t worth the hassle! We made sure we asked for-and got coffee our last night, ready for the morning The bathroom was (naturally) tiny, and no toiletries supplied apart from soap. They have a breakfast room but we never ate there, plenty of other places nearby. On the plus side the position is very handy Calle Del Pelai corner of Ronda de la Universitat. Close to Placa de Catalunya square and La Rambla But it’s almost on a traffic island, so very noisy from that and our room had virtually no insulation. I always sleep in earplugs and my husband can sleep through anything,but it could be a big problem for other people. The A/C worked very well,and there was a safe amongst the down pipes of the wardrobe.No sign of smoking in the room. Fortunately we didn’t go to Barcelona to spend much time in the room. Apart from all the usual tourist things we had dinner at Los Caracoles, and I can thoroughly recommend it! The food wasn’t great but the experience was. We hadn’t booked but fortunately got there about 8.40pm and only had to wait 1 ¼ hours in the bar. By which time we had made several new friends and got rather sozzled. On the extreme downside, my husband had his pocket picked coming down from Parc Guel to the open top bus stop. We think it must have happened when we stepped back to let a couple pass us on the very narrow footpath. Don’t let your guard down for a second in Barcelona.", "Date": "November 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "washington", "Title": "“good value for money”", "Author": "babsart", "ReviewID": "UR6140730", "Content": "we have just returned from barcelona staying at the city park pelayo we were very pleased with this lovely little hotel it was idealy situated cne block of the las ramblas very clean with a lovely big bathroom breakfast was very good wide choice available,we found the bus touristic tour good value also .we had a great time and would definitlely recommend this lovely hotel to anyone", "Date": "November 17, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vantaa, Finland", "Title": "“Good basic hotel, central location”", "Author": "Mucha", "ReviewID": "UR5525864", "Content": "We stayed one night at the Citypark Pelayo in July 2006. Overall, the experience was positive. Positives: + easy access from/to the airport + close to Placa de Catalunya + price was ok (around 93 euros through Destinia incl. breakfast) + beautiful building + quite spacious bathroom + efficient air conditioning Negatives: - the room itself very small I would recommend this hotel to anyone looking for basic, clean and modern accommodation in the heart of Barcelona. I would try to get a corner room in the \"tower\", it could be nice.", "Date": "July 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“A surprisingly great, cool hotel for 100 euros”", "Author": "A TripAdvisor Member", "ReviewID": "UR5324940", "Content": "After finding that the Hotel Condestable looked like (in my friend's words) \"a methadone clinic\" with dank rooms, narrow hallways and plywood doors with holes in them, we quickly fled to this one around the corner. Despite having the same two-star rating, the rooms here were clean (though kinda small) but the bathrooms were large and the design had an Ian Schrager-esque look. The staff was very helpful, printing out directions and event info. It would have been nicer if breakfast went later that 10:30 or the large downstairs breakfast room was better lit, but the food was good. Sure it wasn't as nice as the Hotel Jazz next door, but it was much less expensive. The location for all of them was a bit commercial, but an easy walk to the Gothic district and right next to an equally cool area near the Universidad. Just across from the metro as well. Giving it an excellent rating because it was far better than the 100 euros for a double room or two-star rating would indicate. I'd recommend it to anyone - giving the website since it was so hard to find online: (--)", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dundee", "Title": "“Perfect Location”", "Author": "theweebludug", "ReviewID": "UR4953019", "Content": "The location of this hotel couldn't be better. Its 2 minutes from Las Ramblas so close to all the major tourist attractions and metro lines. However, its also only 2 minutes from the Eixample and Gracia areas where there's some fantastic shopping and eating to be had, away from the majority of the tourist hustle and bustle. It is on a main road so has the potential to be a little noisy at night but it didn't really bother us. The rooms are very clean and well decorated, staff friendly and efficient and continental breakfast sufficient. Be warned the rooms can be quite small so if you are used to loads of space and living in the lap of luxury this may not be the hotel for you. However, for the budget traveler who wants a pleasent, central base for their trip this hotel is perfect and it would be difficult to find better for your money. Would definately stay here again and reccommend to friends.", "Date": "April 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "staffs, uk", "Title": "“super budget hotel”", "Author": "itchyfeetlady", "ReviewID": "UR4147885", "Content": "Me and Hubby stayed at this hotel 24/11/05 for 2 nights. It's in an excellent location just a short walk down the road to La Ramblas and right outside is a metro station, so all the well known sights are in very easy reach. It's clean and smart. The people on the reception desk were friendly. Our room was smallish but plenty of room for us get around it. Our bathroom was very roomy, it had a massive shower cubicle with a great powerful shower and plenty of hot water. Our double bed was comfy. We were on the 3rd floor and looked out onto the street. You could just here the traffic but we slept soundly both nights. We got 3 free drinks a day in the mini fridge, shampoo etc and fresh towels every day. The breakfast was fine; juices, tea/coffee, cereal, yoghurt, fruit, ham, cheese, toast and pastries. In fact it was a bonus as when we booked we didn't realise it was included. and the best bit... it was very very reasonable at 50 euros a night for the room.", "Date": "November 28, 2005"}], "HotelInfo": {"Name": "City Park Pelayo Hotel", "HotelURL": "/ShowUserReviews-g187497-d289342-Reviews-City_Park_Pelayo_Hotel-Barcelona_Catalonia.html", "Price": "$144 - $195*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Pelayo 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "289342", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/37/06/37065a39bd33876b49448ac21335bac68large.jpg"}}