{"Reviews": [{"Content": "never again Very disappointed, we've been there before a few years ago and it was ok, but now it's unkempt and the bathroom was very filthy. The shower-curtain was all over with mould and everywhere long dark hair on the ground. The toilet was so filthy that we used the one at the Ihop. The guardrail was broken and very dangerous. It's difficult to complain because the most servants don't understand English.", "Date": "Sep 19, 2008", "ReviewID": "UR520906547", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "4"}, "Author": "US-traveller-2008"}, {"Content": "Noisy,Smelly, and WiFiDoesn'tWork Wireless Internet didn't work the whole time I was there. Many excuses: Someone downloaded too big a file; Then, The guy who fixes it got in a car wreak, etc. I suspect the wireless connection never works.Door looked like it had been kicked in- paint cracked and weather stripping didn't contact so the constant street noise came in. Folded newspaper strips stuffed in the door helped.Smoke alarm battery door hanging by piece of tape and no battery present.Odd musty smell in this no smoking room.Cranky owner. His son more friendly.We would have stayed at a much quieter place two blocks away on a side street if we hadn't passed the cancellation deadline.", "Date": "Jun 12, 2008", "ReviewID": "UR524137114", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "JTBOregon"}, {"Content": "Great deal, great location If you're like my husband and I, you would rather spend your money on activites and sight-seeing in the city than on a fancy hotel. We just needed a decent room in a good location. That's exactly what we got at the Surf Motel. Sure there were no frills and yes it's on a noisy street, but it's the big city.... I imagine very few inexpensive motels are quiet. Who goes to the city for quietness anyway? The free parking was a huge bonus and just one block away is Chestnut Street, a safe and trendy neigborhood with good ethnic restaurants, shops, several bars, and even a movie theatre. There was plenty to do within walking distance and the motel could not have been easier to get to. The room was basic but clean and had everything we needed. Overall, we enjoyed our stay and will probably stay there again. The Surf Motel is a great launching pad (for those on a budget) from which to enjoy the wonderful city of San Francisco.", "Date": "Jun 9, 2008", "ReviewID": "UR708299194", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "barginhunter_8"}, {"Content": "Okay, Good Value We've actually stayed here twice... the first time was a great experience. We paid $90/night and had a good room, set way back in the corner away from the road. The room was small, but comfortable and clean. The location as so good that when we went back to the city a few months later we went back. The second experience was awful. Our room was practically on the street, so we heard street noise (including screaming drunk people) all night. The room we were in this time was even smaller, and dirty. The parking this time was awful-- they ran out of parking spaces so we had to park awkwardly, so that when we pulled out we almost got creamed on Lombard. I would recommend this motel for people who want a good value and just need a place to crash-- not people with families who want a nice place to stay in the city.", "Date": "May 27, 2008", "ReviewID": "UR356977999", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "-1", "Location": "-1"}, "Author": "citygirltravels"}, {"Content": "NOISY!! The only good thing about this place was the parking. It's located right on Lombard Street, a main thoroughfare, which is noisy 24 hours a day. Room was very small and cramped. Numerous things were broken like bathroom hardware and lights and it was obvious no one had bothered to fix them. I don't ask for much but couldn't wait to leave and find somewhere quieter and more comfortable.", "Date": "Nov 2, 2007", "ReviewID": "UR592189480", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "2"}, "Author": "Cyd'sTips"}, {"Content": "Good value accomodation We had a great stay at the Surf Motel. Didn't really compare prices on too many places, but it seemed like good value to us. Got a room on the first floor and slightly back from the road so there wasn't any noticeable noice either. The hairdryer was broken, though in fairness I didn't report it, but other than that the room was clean and functional. We'd stay there again. There's also a direct bus link into the main shopping area about one block away.", "Date": "Aug 29, 2007", "ReviewID": "UR587977122", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "FE2007"}, {"Content": "Avoid at all costs After reading a reasonable review of this motel in the usually relaible 'Rough Guide' . We called and booked a room for 1 night. On arrival the place looked rundown and not in the slightest bit welcoming. At this point I was reluctant to even get out of the car and venture in. However as we had booked it and the guide book recommended it we thought we'd give it a go. In the reception we were eventually met by a pretty grumpy motel owner. I explained that I would be grateful if I could have a look at the room first before taking it. He eventually agreed but insisted that we leave our passports at the reception whilst we had a look!(what did he think we were going to do?) The room was apparently non-smoking but smelt of stale smoke, the decor was tired and very dated. But worst of all was the uneasy atmosphere outside in the motel courtyard. I'm a policeman in the UK and I have a pretty good idea when people are up to 'no good' . There were various groups of people hanging around outside rooms and I'm pretty confident that they weren't tourists. It made us feel pretty uneasy and there was no chance that we were willing to stay there overnight. I told the man behind reception that we would not be staying and quickly left. Worst thing is we were still charged $70 as we had paid when booking over the phone. Avoid at all costs, given the massive amount of accommodation available in SF, there is no need to stay here! (in the end stayed in the Coventry motor inn, a few blocks away, which was very nice, a complete contrast)", "Date": "May 7, 2007", "ReviewID": "UR459842626", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "JamesOsterberg"}, {"Content": "Not recommendable Stayed here for 4 nights during our trip to the US.This was the worst motel on our 20 day trip.Cons:Loud, 24/7 traffic on Lombard street, bad isolationLots of drunk and loud kids around (weekend)Smelly roomWorn and smelly towelsOverall a very rundown placeForget the breakfast (dry donuts)Pros:CheapFree ParkingRelatively safe neighborhoodLots of nightlife opportunities near", "Date": "Sep 17, 2006", "ReviewID": "UR130587772", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "2"}, "Author": "Eggi0711"}, {"Content": "Unbelivable.... My sisters just stayed at this hotel for 2 nights before they were flying back to Europe. I tried to call them 3 times and this is what happened:1. As I asked to transfer me to their room the person at the front desk told me that they asked to call back after midnight which they did not as he never called their room(he put the phone down for about 10 seconds only). 2. I called again about 20 minutes later and the person said that there is no answer from the room(after he put the phone down again for about 5 seconds) , although I sent my sisters a text message to make sure they were there.As I told him that he hung up on me.3. I called again the next day and the person at the front desk tells me: I don't feel like connecting right now and hangs up on me again.I finally called them via cell phone to make sure they are ok and they confirmed whatever the other people wrote in reports before on this page. As expample, their shower head does not work at all and the room is pretty dirty.It's not worth it to concider this hotel even if it is inexpensive. There are many other hotels or motels in SFO that offer much nicer rooms and service for not a lot more money.", "Date": "Sep 7, 2006", "ReviewID": "UR420888643", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "Groupie83"}, {"Content": "Scammed at the Surf Motel This was one of the worst motel experiences I've had in my life. It all started with them trying to scam us into a King room. THey told us we had reserved smoking and the only non-smoking they had left were larger. We fell for it and paid the extra . Afterwards we checked our reservation and it was for non-smoking. They were clearly scamming us. Aside from that, the beds only come with two small pillows, making it uncomfortable to sit in bed and watch TV. It is located on a busy street and the walls offer zero insulation from the noise. There was an ironing board but no iron. And the toilet made a weird noise like a sick cow when you flush it. Motel 6 or Super 8 would have been better for the money.", "Date": "Jul 5, 2006", "ReviewID": "UR746924953", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Stay here only if you absolutely can't afford anything else This place was pretty bad, even for a budget traveler. I decided to stay here for one night after I decided to extend by trip by one night. The other place I was staying at was a little pricey for a Friday night and Surf offered $79. So I took it to save about $40. I should have just sucked it up and paid the extra money. The outside is okay, like any other motel you see, but the rooms are pretty small, bathroom is average size, and parking is free. First of all, to enter room you had to insert card, hold and lift door nob a certain way to open door because nob was broken, which I never did figure out, but luckily my girlfriend did, room had bad odor, shower had obvious fungus and shower nozel fell off. Bed was okay, when opening sheets, my girlfriend found a public hair, disgusting! Coffee maker was broken and room didn't even have cream and sugar if it did work. Continental breakfast is free, but don't bother, it is a box of old muffinfs in the office with someone sitting their watching what you take. No offense to this place, but don't wast your time and money, there are plenty of other choices in San Franicisco and especially on Lombard Street to choose from. I am all for saving some money, but c'mon, some places should just be left alone so they can be torn down, and this is one of those places.", "Date": "Jun 25, 2006", "ReviewID": "UR332900083", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "Angelfan"}, {"Content": "Mixed Bag Our family of 2 adults and 2 teenage kids stayed 6 nights at the Surf. It had both good and bad features:Good:InexpensiveFree parkingQueen size beds (very comfortable)Clean roomLarge bathroom with iron and boardCoffee maker in roomAdequate space, but not roomyNext block contained many trendy international restaurantsOK neighborhood--although we didn't go out at night, there were no homeless hanging around and it seemed safeBadNOISY--you are on the main street to the Golden Gate Bridge. Traffic is constant all night. Garbage pickup and street cleaners came at 5:30 am,and there was construction across the street.Continental Breakfast consisted of a box of muffins and donuts (nothing to drink and not even napkins)--served in the officeTowels were thin, stained, and frayedNot walking distance to any tourist attractionsFront desk manager didn't understand English very wellPicture on websites is not the hotel!If you can take the noise, and you are not there much, this place is a good bargain.", "Date": "Jul 17, 2005", "ReviewID": "UR607723507", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "correspond bien aux crit猫res de description   showReview(20554724, 'full');", "Date": "Sep 1, 2008", "ReviewID": "UR984282804", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "San Francisco - immer eine Reise wert!   showReview(11435719, 'full');", "Date": "May 21, 2007", "ReviewID": "UR504635902", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d291071-r20207438-Surf_Motel-San_Francisco_California.html", "HotelID": "291071", "Price": "$113"}}