{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New York", "Title": "“Great Service”", "Author": "Amy S", "ReviewID": "UR127861719", "Content": "My husband and I recently stayed for three nights at the hotel, and had a very nice time. The hotel staff was VERY pleasant and accommodating and I enjoyed my interactions with them. The historic building is beautiful, the decorations tasteful, the room was roomy and enjoyable. One of the best features was the free breakfast buffet that had on it anything that you could possibly want (meat, eggs, cereal, fruit, bread, etc.) The staff who worked the breakfast were very kind and very thorough. The negatives? Location. I know that others claim that this is a good area, and maybe it is, but I found the area to be sketchy and did not feel comfortable walking down to the Inner Harbor because of the nearby neighborhoods. This, of course, is not the hotel's fault and there is plenty of parking garages and public transportation to accommodate for this anyhow. Another negative- we got stuck in the elevator not one, but two times. Both times the issue was fixed and we were out of the elevator within 15-20 minutes, but still. Scary. Lastly, we found a package of condoms behind the nightstand in our room. I know this is small, but it made me wonder how clean the room actually is. Thank God the condoms were in foil, not used. Regardless, I want to reiterate how kind the staff was, and how beautiful the building was. I would recommend this place to friends- for the price, you cannot go wrong.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Decent hotel, convenient location”", "Author": "cakebaker31", "ReviewID": "UR127840849", "Content": "My 2 daughters and I spent 5 days in Baltimore for spring break. We were looking for a hotel that was central to Inner Harbor, museums, shopping, and Washington DC. I booked 5 nights thru booking.com for approx $350 total. We checked in on Sunday, staff was very friendly. We entered the room that we were given, it was very small, dark and had a view of a brick wall. We immediately called the front desk and received a new room, which was much larger, brighter and had a much better view. A hot breakfast was included, each morning. The hot, home cooked breakfast was very good and featured slightly different offerings, each morning. There was also yogurt, breakfast pastries, cold cereal, variety of juices, etc. The heat/air is a bit antiquated and therefore controlled from a central source. The parking area is located beneath the hotel and is secure and well lit, but very small, awkward and the parking spaces are very, very tight. The hotel is definitely in need of a refresh, but overall was clean and definitely a good value. Pros...price, hot breakfast, convenient location. Cons.....aesthetics, parking, heating/air conditioning. Tips - get to breakfast early, tends to get a bit chaotic, later in the morning. Also if you opt to park beneath the building ($15 per day), plan to arrive back to the garage by at least 8:00,so that you can have your choice of spaces, Lastly we walked one block over to catch the Charm City Circulator (free), which transported us to Penn Station so that we could catch the train to DC and then we used the Circulator the following day to go to the Inner Harbor.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brunswick, Maine", "Title": "“Excellent choice in Baltimore”", "Author": "Intrepid8", "ReviewID": "UR127735760", "Content": "On our return from a golf excursion to South Carolina, we stopped in Baltimore to attend an Orioles/Yankees game at Camden Yards. MVH is well located - 15 minute walk to CY and good public transportation options. The price is remarkable for an inner city hotel of this quality; the breakfast included in the rate was an excellent buffet in an appealing room. The $15 charge for parking in a garage under the hotel is also remarkable. We will return for a Red Sox game.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Warm sleeping, ok breakfast, terrible parking”", "Author": "Brittanythechef", "ReviewID": "UR127548701", "Content": "The parking lot is under the hotel, locked garage which was nice but if you have a large vehicle it will be impossible to park. The parking is so tight! We were told by the website and front staff how wonderful the breakfast was and how big of a selection but when we ate we had eggs, sausage only (no bacon), cereal, bread...that's all but no ketchup! It was ok. Yes better then other hotels but not as much of a selection like we were told. We went in April and there is no AC!! When the hotel switches over from heat to AC it's warm in the rooms so our sleeping arrangements weren't the best. The room was clean. Beds weren't that comfortable. Location to the inner harbor was good", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Virginia Beach, Virginia", "Title": "“Nice hotel,Great People. Awful parking situation!”", "Author": "Pololady1056", "ReviewID": "UR127324917", "Content": "Motel has had a good renevation! Parking is a serious problem! Breakfast was good!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kutztown, PA", "Title": "“Large room, Extra Large Breakfast”", "Author": "kevinmpa", "ReviewID": "UR126947233", "Content": "Our room was a big as a suite and it cost about $80 with AAA. The beds were comfortable. Parking added $15 (overnight with in and out privileges) but it was a secure indoor lot, and parking in Baltimore can cost $5 an hour. They let us park in the lot even though we arrived before check-in time. We walked to the Inner Harbor, about 8 blocks. There were a number of homeless people along the route, so we stayed on main streets. There were also a lot of drunks of all sorts on the street, but it was St. Patrick's Day, so it may be a more relaxing walk on another evening. This is not the most convenient hotel if you want to spend the night wandering the Inner Harbor area. The main purpose of our stay was to attend a lecture at the Walters Art Museum, and the Mount Vernon is just around the corner, so it was perfect for our needs. It is also very close to the Peabody Conservatory's concert halls. We ate a nice dinner at Turkish restaurant near the hotel called the Cazbah. In the morning the hotel served a complimentary breakfast that was truly a full meal, with choice of eggs, potatoes, bacon, even grits which I like on occasion. There was yogurt, fresh fruit, cereal, bagels, and a decent dark roast coffee. There was decaf tea, which is my wife's drink of choice. The variety and size of the breakfast makes the Mt. Vernon a very good deal for families with children. There is a old grand piano in the lobby and some young girls proved that they had studied music, by playing a bit. The hotel isn't luxurious by any means, but it has character. It offers good value, and we would stay there again. I somehow left my camera at the front desk when I checked in, and when we arrived at the room, the phone was ringing to let me know. That saved my weekend and made me a fan of the Mount Vernon.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Largo, Florida", "Title": "“Very Good for the Price”", "Author": "KeithB05", "ReviewID": "UR126887520", "Content": "I don’t understand some of the other reviews. This hotel is a third of the price of a Marriott or Hilton. Yet many of the other reviewers expect it to be the same quality. Sorry, folks, but that just can’t happen. This place is very reasonably priced and it can be that way because it doesn’t have fancy facilities and the rooms are basic. The location is very good and within just a couple of blocks of the art museum, basilica, and Washington Monument. Other reviewers say that it is in a bad neighborhood. That is just nuts. The area is a downtown area but there are nice cafes and antique shops within a block. Yes, there are some homeless people around, but that is the same all over downtown Baltimore (and most other urban centers). The rooms are basic but spacious and have the feel of a lower-priced hotel at a highway exit. Nevertheless, the are clean and have all the basic features needed. I found it to be quiet and comfortable. A nice, hot breakfast is included and it is quite tasty. The staff members were all pleasant. For this price, how can anyone complain? And if you do, then go stay at the Hilton and pay a lot more.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania, United States", "Title": "“Conflicted”", "Author": "NJSKIM247", "ReviewID": "UR126798075", "Content": "This was a place that could have received an excellent rating, if not for the unprofessional, 'it is was it is, your problem not mine' night manager and the 'I can't do anything to help you, oh well, thanks for paying upfront' day manager. I sponsored a trip for an international non-profit organization which provides outreach young girls. 16 young girls and adults were taken to Baltimore this past weekend. I purchased 5 rooms at a great price for 2 nights. Unfortunately, after experiencing a severe allergy attack from all the pollen outside, I was looking forward to seeking refuge in an air-conditioned room. Well, that wasn't happening since I realized that the a/c was not functioning in the hotel. Yes, this was a major problem for me, the adult with severe hot flashes, and the children who had breathing issues. The terribly arrogant night manager just shrugged his shoulders. He said 'we ran out of fans and this was unexpected.' Then, informed me of the future plans of converting the system which doesn't go on until April and how old the building was, etc. How is this unexpected when you gave a bunch of fans to other people who only purchased one room. He was not about to do a thing to help us to prevent having to send me to the er or any of the other children I was responsible for to the hospital because the heat in the rooms was rising. Since he, did and said all he was going to say, he looked past me and ask if he could help the next person. If I could have afforded it, I would have tried to have booked another hotel, but that was impossible to do with all the kids at 10pm. It would have been nice to be told about this prior to checking in. Luckily, the Friday night security guard became someone who was the most helpful to me. So, the only resolution was for me to find a store open at 11pm and purchase fans. So, the guard, and only her, told me that there was a 24 hour Walmart near by and how to get there. She was the only one trying to resolve the immediate issue. I purchased f box fans for $125.51 with money designated for the activities on our trip. We survived the night. And, had to drop one of our activities from the itinerary. Not something you want to do with kids looking forward to going places. The next day, I had the displeasure of speaking to the unhelpful day manager. I thought that I could be reimbursed for the fans, especially since they have, and periodically need fans, and have, and use fans for when the weather is 'unexpected.' Or some other compensation. Foolish me. I was told that the night manager should have made other accommodations for us. And, that no money could be refunded because I prepaid for the rooms. So, sorry so sad, next attitude is unacceptable. Oh yeah, after I checked out and left the rooms, I told him that I didn't want to be charged for the bottle that was never there in one of the rooms. I was told that the $2 bottles of water would not be charged to me because it was so hot in the rooms. Didn't open any bottles. Gee, thanks for nothing. I was hoping to post a positive review, because the hotel is priced right, nicely kept, great complimentary breakfast, reasonable parking options, great places in walking distance and the location was perfect. I was hoping to recommend this hotel to others, including our group's national and international sponsors visiting this area. Is this how Marshall Hotels & Resorts, management company runs business. I thought they want more business not discourage future business from people who would purchase more than just one room and for more than one night. But, I have been finding myself starting off with the bad, then some good, then the bad again. It's terrible that things couldn't have been worked out. I felt bad for the other guy who complained about his room being a sweltering 100 degrees. But, at least they asked him if they could make other arrangements for him. Maybe if I paid for 1 room, I would have gotten better customer service.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "u.s.a.", "Title": "“four stars include price and staff”", "Author": "ivyU_s_a_", "ReviewID": "UR125946248", "Content": "the average may not convey all that's good about this. the reasonable price would make it a four-star hotel. our room was large, the beds were comfortable, and it was very clean. the staff was perhaps the best thing of all, as they were helpful and accomodating. they include breakfast in the price, altho the hot food was not as good as should be, while the rest were good choices. the location is excellent for downtown (not inner harbor) baltimore, quiet and within easy walking distance to peabody and the walters museum, and easy driving to the harbor area. parking is not free, but a more reasonable rate than most. we would stay here again.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sparta NJ", "Title": "“What a surprise”", "Author": "JFCSpartaNJ", "ReviewID": "UR125809538", "Content": "A lot of the reviews I had read were not favorable. Wrong! The hotel is in a great location, there was plenty of free self- parking with in-and-out capability. The room was large - not elegant but large and clean. Service is a little sloppy but the front desk crew was fine and friendly. Breakfast was fair - ok if you eat pre-made stuff like cereal and yogurt. Hot food was not so good. Two minor complaints - I never heard of a hotel that ran out of tissues - no box available for the bathroom. The kitchen ran out of orange and they were out for two breakfasts. If you can't get the fountain oj, go to the supermarket and buy a few half gallons to get you through. I bought two nights with parking and breakfast through Living Social. Really a bargain. I would go back - and bring my own tissues!!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ms Gulfcoast", "Title": "“5 Days at Mount Vernon”", "Author": "Mississippigal43", "ReviewID": "UR125336942", "Content": "We stayed here for 5 days and found it met our needs. The room was roomy with a comfortable bed. Bathroom and decor had been recently updated. Is in the middle of a nice old neighborhood with great restaurants and attractions. Staff was pleasant and helpful. Has a delicious breakfast with a variety of items. The only thing missing was a small refrigerator and microwave in our room which we could have one for an extra $10 per day.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Great spot for Orioles trip”", "Author": "GoCanucks2233", "ReviewID": "UR125045758", "Content": "I stayed here with a couple buddies on a trip to see the Orioles upset the Redsox in September 2011! It was very clean, largish sized rooms and was about a 15 minute walk to Camden Yards. The front desk people were very friendly. The best part was the unbelievably low price we were charged for a better than decent downtown hotel.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cork", "Title": "“so so”", "Author": "HappytravellerCork", "ReviewID": "UR123855467", "Content": "Good american-size room. The room was warm. The heating controls worked. Reasonable choice of TV channels. Breakfast was fair. Very limited choice of food (hot and cold). when things ran out, they were gone. This included knives - when the knives ran out people used spoons and forks to spread butter. I didn't like the hidden charges. Charging extra for the use of the room safe was a sharp practice I thought.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Houston, Texas", "Title": "“Would not be my pick but great employee's”", "Author": "Tim A", "ReviewID": "UR123455631", "Content": "I stayed in mid January for 2 nights. Andy at the front desk was fantastic! He was helpful and gave great advise. I took the light rail in from the airport and was a bit concerned at the area of the stop for the hotel, most of the buildings were abandoned and had to walk 3 blocks to the hotel. The city itself is very run down unless you are on certain streets or at the Inner Harbour. The hotel itself is older and could use some refurbishments carpet,furniture and such. Breakfast was okay. All in all I wold not stay here again I would recommend staying in the Inner Harbour area.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bradenton, Florida", "Title": "“Good deal”", "Author": "jearly67", "ReviewID": "UR123327486", "Content": "Not luxury but more than adequate. Central location, attentive staff & full breakfast included. Near museums, dining & the Circulator bus route. Better than budget.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Princeton, NJ", "Title": "“Pleasant Surprise!”", "Author": "eshinn", "ReviewID": "UR121366478", "Content": "We booked this hotel with the Living Social deal to see the fireworks at the lighting of the Monument and visit the inner harbor. It was a pleasant surprise to see how nice the Mt. Vernon neighborhood was and how close we were to everything. We found the staff of the hotel and also the Baltimore residents we encountered to be very friendly and helpful. In any large city you will find vagrants or those trying to scam you for money. It comes with the territory. We encountered a few, but not near the hotel. The hotel room was more than adequate for the king size bed and the bathroom was spacious. We brought our own pillows after reading another review here. Yes, they do need to be upgraded. We heard no street noise and had no temperature issues as others have mentioned. The garage was a tight fit for our SUV but we managed. It was a great benefit to have the parking available. The breakfast which was included in the price was pretty good... a few mistakes (potatoes were undercooked one day, omelette was botched) but overall not bad at all. All in all the hotel seemed very clean but just two little annoyances I have to mention. A blue M&M remained on the floor of our room the entire 2-day stay. I left it there just to see if housekeeping would pick it up but I guess they didn't see it. The dark color kind of blended in with the carpet. Also, a Q-tip remained on the floor of the hallway near the elevator at the 3rd floor for the entire 2 days we were there. Housekeeping staff had to have noticed it. I was surprised no one bothered to pick it up. This was our first visit to Baltimore and we did enjoy it. We found a cute Irish bar around the corner from the hotel on Charles St. - O'Shea's I think, which was fun. We also visited the inner harbor, the aquarium for $8 after 5pm and Fells Point which was quaint with the cobblestone streets. It was nice to be there without crowds. I would recommend the hotel to anyone who is looking for a pleasant place to sleep at the end of the day, not a fancy resort or bellmen to carry your luggage.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very nice hotel”", "Author": "Gwiggs1", "ReviewID": "UR120738797", "Content": "Very nice rooms. Awesome hot breakfast, with omelettes made to order. If you are a light sleeper like me, remember to ask for an inside room. Covered parking under the hotel.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Fantastic Experience”", "Author": "Ryan E", "ReviewID": "UR120710904", "Content": "I recently stayed here for two nights during a business trip and I have nothing but good things to say. I was weary about this place after reading some of the reviews, but I found a LivingSocial deal and decided to give it a shot. I was pleasantly surprised. Granted, this is not a 5 Star Hotel or one of the brand new harbor hotels, but my room and bathroom were clean and the staff was very friendly and helpful. Case in point, during my 1st night my room was very warm (I prefer to sleep in the cold) and after going to the front desk to complain, they informed me that because it was a historic property the Heating/AC was centrally controlled. To accommodate my discomfort, they immediately provided me with a large floor fan and when that wasn't enough they gave me an entirely different room that was much cooler. They even offered to help transfer my luggage at 1am. My new room stayed perfectly cool the rest of my stay and they also let me continue to use my floor fan. Additionally, when I wanted extra towels there was no delay from housekeeping and they sent more than I would need during my entire stay (which made me very happy!). I'm not sure if it was because of my LivingSocial deal of if it comes standard with any room rental, but each morning there was a free breakfast included in their cafe. This wasn't just a continental breakfast but a full buffet of scrambled eggs, fried potatoes, pancakes, waffles, bacon, cereals, muffins and danishes, fresh fruits, and a build your own omelette station. It's not Ruth's Chris but it's also a lot better than the Sherton's continental options. The parking was tight like other ppl have mentioned, but I had no problem finding a spot during the week days I stayed, and that was at any point I came or went btw 2pm and 11pm. All in all, I had a great 2 days there and I will be returning again. Just remember you're not in a resort, and enjoy your stay with friendly staff.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hatboro, Pennsylvania", "Title": "“Convenient, centrally located,Historic area!”", "Author": "iamskybluepink", "ReviewID": "UR120621649", "Content": "Thanks Dan for greeting us personally! The building, garage clean and well lit. Rooms were average, clean, with basic ammenities. The breakfast had a large array of different food that would please most tastes, it was staffed by students of the Culinary School. Location was center city in the historic district. I walked the area by myself to visit the Bascilica and the Enoch Pratt Library, just around the corner. Very beautiful, don't miss! The Circulator bus was only about 2 blocks away and will take you around town for free (yes, free). Pick up the route maps on the bus. What you should know about this Hotel: Older hotel with average rooms, quiet, clean and affordable.(Mgr: pillows need updated!) Located in center city but with access to the inner harbor thru free public transit On site garage but PLEASE NOTE: the parking is tight, Large SUV or trucks are a bad idea. Breakfast, nice assortment, clean and large eating area, pleasent attendents! Staff was helpful.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania, United States", "Title": "“Wonderful hotel in a great location!”", "Author": "Amy K", "ReviewID": "UR120546385", "Content": "We stayed at the Mount Vernon Hotel this weekend after purchasing a deal on living social. Having read some of the previous reviews, I was a little worried. I was pleasantly surprised to find out how wonderful this hotel was! The room was clean and comfortable. If you're worried about noise, request to stay on the 3rd floor rooms 305-309. Our window looked out onto a private lot. We heard no street noise. Some people had mentioned homeless people outside of the hotel....we saw no homeless people hanging around. The hotel was in a great area. It's a two block walk from the Charm City Circulator which is a free bus which will take you to all the city's major destination including inner harbor. The hotel is also a $7 cab ride to and and from inner harbor. If you are looking for a nice, clean place to stay in Baltimore, this hotel is the one! We will definitely be staying here in the future.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio, United States", "Title": "“Great hotel, great area”", "Author": "Krissie W", "ReviewID": "UR120404948", "Content": "An excellent experience all around. The rooms were very clean and spacious. The room temperature was perfect and we didn't have to mess with the thermostat at all. The staff was very helpful. I was on the 6th floor and it was very quiet - no street noise or sound from other rooms. The neighborhood is amazing. I definitely never felt unsafe at any time and I was traveling late at night. The architecture blew my mind. There are quite a few coffee shops and ethnic restaurants around. The location is great if you plan on visiting some of Baltimore's more popular neighborhoods, like Hampden and Fells Point, because it's very close to the bus line and smack dab in the middle of both.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“tolerable”", "Author": "visitor00", "ReviewID": "UR120350263", "Content": "As most have already noted, this hotel is showing its age. Decor is dated, furniture is worn or nicked, and heating/cooling is a bit unpredictable. However, there are very few 2-3 star hotels in Mt Vernon. Given this and the reasonable cost, this place is perfectly acceptable for shorts stays if you're simply using it for a home base. Two areas of disappointment. (1) room service tray from previous guest was still at the room door when we checked in at 5pm. (2) uneven service: while reception staff was pleasant during check-in, staff at check-out could not even be bothered to look up at us when we checked out - kinda reminded me of the ambivalent service you get at the DMV. We tried to resolve an issue regarding parking (the hotel parking lot was full when we checked in so we had to park elsewhere), their attitude was that it wasn't their problem. YOU'RE IN THE HOSPITALITY INDUSTRY - looking a guest in the face when they're speaking to you should be the most basic act of hospitality, even if you can't help them with a specific issue. So I don't dislike the place, but we probably wouldn't stay there again.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Skippack, Pennsylvania", "Title": "“Friendly Staff, Average Rooms”", "Author": "missmins", "ReviewID": "UR120070574", "Content": "We stayed at this hotel because of a deal on Living Social. After looking at other hotels such as the Kimpton and Marriotts, this was a bit disappointing. Let me start off this review by saying the staff was VERY nice and friendly and it's not their fault the room wasn't that great. The building is historic and they only either have air conditioning or heat. We were (un)lucky enough to get there when the moved to heat. The room was already hot to begin with and we did not know of this one-track system so we turned the thermostat down to 50 degrees and put the setting on low. I woke up in the middle of the night thinking I was suffocating it was so ungodly hot in there. The windows don't open so there was no relief. The next night we requested a box fan that helped, but we still slept with no covers. If you do stay here - get late night pizza from Brother's...delicious!! Also, on a good weather day you can take a 15 minute walk down to the inner harbor. We went to the aquarium which was tons of fun and then stopped at some local bars.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Princeton, WV", "Title": "“A pleasant surprise!”", "Author": "WVUJanie", "ReviewID": "UR119874676", "Content": "We got a room at the Mount Vernon for the night before our cruise! After reading some of the comments I was really worried, but decided that we'd try and see what it was like! Boy, were we pleasantly surprised!! The room was HUGE!!! Yes, it's an old building...but has so much history! The restaurant in the hotel is run by the Baltimore International Culinary School. So, we had a marvelous dinner and a great breakfast!!! The price of the room was great - and included breakfast, the dinner was most reasonably priced as well. If I had a complaint - it would be the parking area...but it was in an old building...so they didn't make spaces for huge cars!! I'd definitely stay there again!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "phila PA", "Title": "“check their heat/ac settings before you go.”", "Author": "katrina_traveller", "ReviewID": "UR119723542", "Content": "This is an old building so they have heating or ac, and as of October 23rd it was AC. I bought a voucher on a deal website, did a reservation in advance, confirmed it at the day of my stay. But when I came there was only one room left, sure enough wrong type(why did I get confirmation before?). And it was cold, and there were no more blankets. So everything there seemed to be on a first come first serve basis. It didn't help that I had a reservation with a note of late arriving. Everyone there was extremely nice but couldn't do anything. They really did their best to fit us in the garage(first come first serve). And we would probably stay at the smaller room. It was clean but too cold to stay. And the fact that there were no extra blankets left confirms I am not being too picky. We were left in the middle of the night to go somewhere else. And the manager in the morning told us he couldn't do anything about it as we bought the voucher through the deal website. By the way we ended up staying at Days Inn Baltimore West, security blvd, which is a 20 minute drive from there mostly on highway, just in case you'll get in the same situation.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great place for the price — large rooms, clean, nice staff.”", "Author": "Niia", "ReviewID": "UR119682711", "Content": "This hotel is in Mount Vernon, one of Baltimore's more interesting neighborhoods, close to many cultural institutions — museums, music and more. My rate of $66 which I secured online got me a huge room with two comfortable double beds and a large bathroom with bath amenities. The place was quiet and while older and not fancy, it's perfectly fine if you're looking for a nice, basic place to stay. I've spent three times the price for rooms in the Inner Harbor that were not a whole lot nicer (and a lot smaller). Everything was clean, the front desk staff was pleasant and helpful and I really had no complaints. I had to leave very early in the morning so didn't get to try the breakfast, but I will be back there the next time I'm in Baltimore. What a great deal.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ocean City, Maryland", "Title": "“Fabulous weekend!”", "Author": "smwilkins74", "ReviewID": "UR119185159", "Content": "Just stayed the weekend at the historic Mount Vernon Hotel. I have to say that the hotel was very nice, the room was clean, and the staff was beyond accommodating. The hotel offered a complimentary breakfast, that was very tasty. We were with in walking distance of the Inner Harbor and other tourist attractions, which made the location ideal. I would gladly recommend this hotel to anyone.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Poor service, poor response”", "Author": "ldymnky", "ReviewID": "UR119143920", "Content": "We found this hotel for a last minute 2-night get-away. It was priced right and was AAA rated. When I made the reservation, the staff was very friendly. That was the last of the quality service. The hotel is about 7 blocks from the Harbor, in an ok section of town, near a hospital. The lobby was dark and rather uninviting. The room was small and basic, the bathroom, even smaller. We requested a king bed. The room was cold when we arrived and we adjusted the thermostat on the wall marked \"AC/HEAT\". I set it at 72 degrees figuring that would be a relatively decent temperature. In the bathroom there were two towels, one hand towel and two washcloths. There was a small single cup hot pot to make instant coffee. Not a coffee maker as advertised. The bed had two pillows that went flat when you laid your head on them and was hard as a rock. The sheets and blankets were 1980's less than \"Ho-Jo\" quality and there were no extra blankets or pillows. We asked at the desk for an extra set of towels and pillows. They were delivered while we were out. We decided to make the best of our trip and forged on. The temperature in our room never got warmer. As a matter of fact, it got colder and having no additional blankets to throw on did not help. We set the temperature gauge to 90 degrees with no luck. When attempting to take a shower the next morning we discovered that you could turn the water on and turn the water off. That is it. You could not turn the knob in either direction to change the temperature. When we called the front desk on a phone that crackled and had static we were told by the front desk, \"Sorry, maintenance will not be in for another 2 hours.\" It was 6:30 in the morning. We asked what else they could do for us as we needed to take showers and get our day started. Once we prompted them, we were offered to move to another room on the first floor. (Let me remind you the hotel is situated near a hospital, we heard sirens going at all hours of the night from the 5th floor.) My boyfriend went down to the front desk to speak to a manager. When he arrived at the front desk, he was greeted by a woman on the phone holding a personal call. He and the woman behind him waited patiently until she was able to take a break and ask them what they wanted. He asked to speak to a manager and was given a so-called housekeeping manager that chucked her arms and asked him \"...what he wanted her to do about it. Maintenance would not be in for two hours.\" He returned to the room, remembering we had a mini buck tool with us; he attempted to fix the shower himself so we could promptly check out. He jimmied the shower enough to get clean; meanwhile a housekeeper was sent to our room. We informed him that we \"fixed\" the shower ourselves, and that we were checking out. He was nice enough to inform us that the air conditioning was still on the building and showed us how to jiggle the temperature gauge to get a warmer temperature in our room. I will note, this gentleman was very nice to me and was just a messenger sent to an unfortunate situation. He also informed me that the woman who supposedly was the housekeeping manager, was NOT so. He did make a phone call to find out when a real manager would be on duty. When we checked out, we asked for a manager, and were given the accounting manager. When she questioned the front desk receptionist about the incident earlier, the woman replied that she was on the phone with maintenance. When my boyfriend contradicted her, she rolled her eyes and sighed at us. The accounting manager adjusted our bill and informed us we would not be charged for the additional night. She was polite and apologetic. She also explained to us at that time that the maintenance department was at a mandatory meeting at another facility. No one had given us this response to this point. We were simply told maintenance would not be in for two hours. An explanation would have been helpful and understood. Upon arriving home, I checked my card statement and found we were actually charged for a half a night (the agreed amount for the first night) AND we were charged for the second night. I contacted the hotel to clear up the matter. I spoke to the exact same woman I spoke to when we checked out. I informed her that we did NOT stay the second night and I wanted the charges removed from my charge card. She put me on hold, when she returned she said \"The card has been credited, thank you, good bye\" and almost hung up on me. When I asked her to confirm that again, that the charge was being credited back to my account she said \"Yes, the card has been credited, thank you, good bye.\" at which point, she hung up on me. We have stayed in some interesting establishments before. We have made the best of them, but this is by far the worst experience either of us has ever had. And they are supposedly a AAA rated hotel. We will be contacting them next.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely hotel”", "Author": "manali1", "ReviewID": "UR119055155", "Content": "This hotel offers a great breakfast, it is so filling. The location is very good and the charges are very reasonable also. A clean and cosy room!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Midlothian, Virginia", "Title": "“great customer service!”", "Author": "pamelaanne68", "ReviewID": "UR118866109", "Content": "My fiancee and I just checked out this morning, and we enjoyed our stay at the Mount Vernon Hotel. I was a bit afraid of booking a room here after reading some of the reviews on tripadvisor, but I refuse to pay Inner Harbor prices -- I like a view, but I don't NEED a view -- and I was VERY pleasantly surprised that it was much nicer than I thought it would be. From the moment we entered the lobby to check in until the moment we left, EVERY staff member was friendly, helpful, and quick to answer our questions and attend to our needs. We asked for more pillows, and they were brought to us within 10 minutes. We left for dinner, and when we got back to the parking garage, someone had taken up two spaces, and the rest of the spots were taken -- I waited in the car while my fiancee went to the lobby to see what we could do -- the clerk had the non-parker move their car, and we had our space. We had leftovers from dinner, but no flatware -- it was brought within 10 minutes. The breakfast staff was very friendly as well. The room wasn't huge, but it was CLEAN, as was the bathroom. I don't know if bedbugs have made it to Baltimore yet, but if they have, they're not checked in at the Mount Vernon. We had a decent view of the city from our window. My only kinda-sorta complaint about the room is that the coffee pot is a single-serving pot, but since they give you a free full breakfast, I had plenty of coffee when we went down to eat, and took a large cup back up to our room. I'm sure that had I asked, they would have been more than happy to bring more coffee pods up to the room, but it wasn't needed. The breakfast was pretty good -- scrambled eggs with cheese, home fries, potato casserole (basically home fries with bacon, ham, and cheddar), french toast, and bacon. They also had turkey bacon for those who don't dig on swine. They also had muffins, bagels, toast, cereal, fruit, and yogurt. The coffee wasn't bad for hotel coffee -- as I said, I drank a TON of it. They also had a very good juice selection -- not just your standard orange and apple -- they also had cranberry and grape juices. To those that gave bad reviews, I have a few pointers for you: 1. You are in the CITY. There are going to be panhandlers, homeless people, and weirdos near your hotel no matter where you stay. This is true for ANY large city, not just Baltimore. 2. Rudeness begets rudeness. If you have a problem, but are polite to the staff while explaining your problem, chances are that the staff will be polite to you and help you in any way they can. However, if you are rude, obnoxious, demanding, and unreasonable, don't expect anyone to bend over backward to appease you. You catch more flies with honey than vinegar, honey, so be sweet. 3. If you're picky about pillows, bring your own, or ask for more. I'm picky about pillows, so usually bring my own when I travel, but since we were only staying one night, I didn't this time. I asked for more, and they were promptly delivered. 4. Why would you complain about a free breakfast? I'll take the Mount Vernon's breakfast in a SECOND over the typical Continental that most hotels offer -- I'm not interested in cereal or mini-muffins if there's REAL food available. 5. The parking garage is small and the spaces aren't huge, yes. However, if you have any sense, you will have already read the other reviews and know this. We brought our smaller car for just that reason (and also because we didn't know how much street parking we'd need to do while wandering around Baltimore, so the smaller the car, the better.) 6. If you want to stay in a five-star, STAY IN A FIVE-STAR.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Creepy.”", "Author": "Xyzmama", "ReviewID": "UR118826341", "Content": "This was more like a homeless shelter. It actually does house displaced people for the Baltimore area. There were panhandlers in front. Garage was creepy. Located on a dark street you had to get out of your car to open door. Breakfast is dormitory style. Maybe because this hotel is also used as a dorm for a local college. The help at the front desk were pleasant and cordial. However this is not a place for me. I travel to Baltimore at least every 6 wks so I know for the money, there are better places.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Just read my review”", "Author": "GeraldWLee", "ReviewID": "UR118746299", "Content": "Okay so I see some reviews on here that are negative. Maybe, I stayed at a good time. Lol The only thing I have to say is some off the staff aren't to friendly that work on the floor and in the dining area. They can be rude. Also, the smell in front of the hotel is bad. It is a cheap stay compared to other hotels. The breakfast was good. You can't want to much for the price. The room was clean and the bathroom was nice. Wifi threw the hotel that's free. Close to downtown with free buses.", "Date": "September 29, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Waynesboro, Pennsylvania", "Title": "“An easily overlooked place close to downtown.”", "Author": "SouthCentralPA_11", "ReviewID": "UR118214162", "Content": "Our daughter had surgery at a downtown medical center at Six in the morning. We live in South-Central PA and we needed a realtively inexpensive place near downtown for the night before. The Mount Vernon Hotel was nothing fancy, but it was very clean and the folks there couldn't have been nicer. Parking under the hotel is extremely limited, but there is a public garage directly across the street. If you're looking for a destination hotel, keep looking. If you're interested in a relatively affordable place to sleep at night that's close to everything, this is the place. (And FWIW my daughter's surgery was a success!)", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Palm Bay", "Title": "“Crud hole”", "Author": "orphicdragon", "ReviewID": "UR118045201", "Content": "I type this review from the Mount Vernon Hotel room where I am currently a guest on the fifth floor. I check out tomorrow and I could not be happier to be leaving. I feel like I got ripped off royally. I will be spending more $$ to stay elsewhere when I have to come back Short version: The good: Location Room size The \"eh\": Price ( I paid just under $100 per night) Bed comfort The Ugly: Parking Homeless people congregating and following you Clueless Guest Reps Did I say parking? Dirty Old (Not the quaint charming vintage \"old\" but the beat down only doing the basics old) The manager \"Ben\" is pretty useless. Details: I am not from Baltimore. I am from a small town in Florida. Normally, this would not be a problem but apparently the folks at Mount Vernon Hotel have ZERO idea that people from other places visit this city. Directions are always the same, \"10 minutes THAT way\" or \"two blocks down\". Down?? Down where? What way? Half these streets are one way, you have to turn 17 times to get a mile worth of progress to your destination. A name a street SOMETHING USEFUL?! Nope, you're on your own. Thank god we stumbled upon a traffic officer who took pity and explained to us about the free orange and purple buses. NOT ONE REP mentioned this free bus thing that is literally just down on the corner. I thought maybe it was just the reps I had talked to. Maybe I was just unlucky or something, but tonight after arriving at the hotel (10:30pm) and finding NO parking despite the fact that they have my 15$ Ben, the manager, says \"sorry I guess someone took two spots\" and directs us to parking by pointing and saying \"2 blocks that way\". Real helpful Mr. Manager, I appreciate that. The hotel is old. They call it historic and vintage and all sorts of nice things. It WOULD be those things if they bothered to clean anything worth a darn. They clean the stuff you can see at first glance. Everything else is left to grow fuzzy and gross. The ice machine is raggedy and grimy looking. The ice seems clean I suppose but I looked it over pretty hard before using it and still didn't feel comfortable with it. I ended up using it like cooler ice and just dropped my drink bottle in it. I'm not generally nit picky but with the sludge on the toilet seat, the trash I had to trip over to get on the elevator, and the fuzzy brown junk in the tub I wasn't really taking any chances. I ended up having to take a picture of the trash and show the counter to get it picked up. Parties and stuff happen, it's a hotel, what is so difficult about giving guests a place to put their trash?! The ice room is already a dump, one good sized trash can is hardly going to ruin the ambiance. Location, location, location. This is a good one for the sights and local flavor of Baltimore. However, there are many others that are just as convenient, cleaner and are not directly across the street from a women's center. Homeless people like to congregate there. Homeless people are all over the city, it's a big city, it is unavoidable. However if you are going to drop $100+ a night you should get a heads up that it's possible packs of them will be in your face when you leave the hotel via the front door. They don't \"harass\" but they do hover around you and will ask for food, money or whatever. The homeless are people and deserve respect and a measure of understanding, but there is a large amount of mentally ill homeless and frankly I don't feel safe walking through 4-5 homeless men at 8pm on a street I barely know in an unfamiliar city.This would not be an issue if you could actually park at the hotel. The tiny little underground parking is like a real live game of traffic. I had no trouble parking, but I can actually parallel park, and back into a spot. Many other people are apparently unable to do this. So, even though you paid 15$ and they tell you that you will have a spot its more of a YMMV sort of thing. They make this better by saying \"We don't charge you until you check out\". Wow, but you do place a hold on my card for the cash, and you do tell me I have a spot...alrighty then. I can completely see how this is my fault, thank you for allowing me to park three blocks away and walk back to the rat hole that is my current abode. They know which guest is parked wonky and can ask them to come park UNwonky, but why exert effort or care. It's only a guest after all, and it would interrupt the little social circle they have happening behind the front desk. You get a free breakfast every morning for every guest. It was hit and miss. Day one eggs were good, bacon was burnt. Day two Eggs were burnt bacon appeared ok, but then we both ended up puking bacon chunks for the remainder of the morning. Tomorrow I am just going to go hungry till I grab something from the terminal food providers. So tomorrow, I check out at 5am and walk the 5 blocks to my car. I am sure every step away from this dump will be a pleasant one. The real shame is, I wanted to love this place. I am tired of the same old hotel chain cookie cutter boredom. I bought inot the hype and truly thought this would add a level of excitement and novelty to my trip here. Oh how horribly wrong I was. Goodbye and good riddance Mount Vernon Hotel may we NEVER meet again.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Good location, good value”", "Author": "sharriewatson", "ReviewID": "UR117972923", "Content": "We don't live too far from Baltimore but wanted to stay overnight a few nights because we were going to the Baltimore Grand Prix over Labor Day Weekend. We looked at the hotels in the Inner Harbor but decided we really didn't need to spend that much. The Mount Vernon Hotel was close enough that we felt we could easily walk to the Inner Harbor. Being relatively local, we did a 'drive by' and felt comfortable so we booked it for the weekend at much less than the Inner Harbor would have cost. It was the right decision! The hotel staff was friendly, the room clean and the bed comfortable. My husband and I are not big breakfast eaters but on the second day, the breakfast looked so good that we decided to check it out and it did not disappoint. Although there are buses (and some free I think) we didn't check it out because we wanted to walk. Other reviews have confirmed our impression that this was a pretty safe section of Baltimore to walk through and we were very glad we stayed here. Staying in the city one needs to expect some noise but each night was quiet - an unexpected bonus. (But it sure wasn't quiet when we got close the the Harbor for the race!)", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ballston Spa, New York", "Title": "“Overall pleased.”", "Author": "Maureen F", "ReviewID": "UR117678593", "Content": "Nice old hotel with a lovely foyer. Reception person very helpful. Room nice size and clean. Flat pillows and very light blankets. Wished I had something a bit heavier. Free breakfast a plus and it was good. The price I paid was decent. Overall I was pleased.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mechanicsburg, Pennsylvania", "Title": "“A delightfull surprise.”", "Author": "Brewer1954", "ReviewID": "UR117299193", "Content": "I am not much of a city person but going to Baltimore Inner Harbor and staying at the Mount Vernon Hotel was a delightfull surprise that turned our two day trip into an enjoyable family mini vacation. The Mount Vernon Hotel was very clean, nicely decorated, friendly atmosphere, very affordable, and offered a hot and cold breakfast selecton in a beautifully decorated style cafe. In door parking was available for $15 dollars a day and a free Baltimore bus service stop was only 2 short blocks away. Information on the bus schedules and routes was provided by the hotel along with brochures on most of the attractions located around Baltimore Inner Harbor. The Mount Vernon Washington Monument was only two blocks away and the surrounding area was clean, safe and attractive. I would highly recommend this hotel and I and my family plan to return.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Virginia", "Title": "“Great value and location”", "Author": "VirginiaNan", "ReviewID": "UR116943368", "Content": "Just echoing other positive reviews of this hotel. Excellent hot breakfast in a pleasant setting, helpful staff, clean room. Walters museum, Enoch Pratt free library right around the corner and boy did we use that free Charm City Circulator bus back and forth to Inner Harbor (love the American Visionary Art Museum). Walked to City Café on Eager Street for great dinner. Good rate, too. Who needs the big chains?", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ft. Myers", "Title": "“If the room was clean the neighborhood would have looked better...”", "Author": "Ileane", "ReviewID": "UR116762218", "Content": "Arrived by cab from the airport on a Friday night, and the neighborhood looked a little rough. The bathroom wasn't very clean, the shampoo was from China, and no conditioner. The towels were thin. Bed had only two flat pillows. The hot breakfast was a plus, and when we took a cab to the nearby Inner Harbor, we felt better about being in Baltimore for a wedding. However, I found garbage in my sheets from another guest later the first morning, and it soured my stay. I told the manager after my 2nd night, and he said that was \"a real shame.\" The price was right, and the staff was friendly, but all I required was a clean room.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "new york", "Title": "“made me love baltimore”", "Author": "erlich5", "ReviewID": "UR116704070", "Content": "gotta say that I wasnt a lover of baltimore. think on my first trip, had a bad experience but had to enter baltimore again, and I choose this hotel, the mount vernon. Had to say that upon first entering I was told that they had no rooms with double beds but Tom was nice enuff to upgrade me to another room. Just had to use the pull out couch. I didnt mind. just needed a safe place and clean place to stay. The breakfast (included in the price) at first I thought was a bit bland, but after a while it grew on me. Hey..its free! Bed was comfortable, pillows was hard, so I had bought my own.( thanks to previous trip advisor members who took the time to alert me to the hard pillows ahead of time, so I bought my comforty soft one! )The neighborhood is ok. I am an avid exerciser and after the first jog, further from the hotel, I decided against doing that again. Too deserted. As I said earlier, i dont like Baltimore on a whole, but after staying here for five nights, I have changed my mind. If I go back to baltimore, I would definately make this my hotel of choice. Feel free to say there. Its a good value for the buck!..", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Irmo, South Carolina", "Title": "“Much more than expected.”", "Author": "Lilukalani", "ReviewID": "UR116252012", "Content": "I read a lot of reviews on this hotel and had mixed feelings but I was very pleasantly surprised. My sister and I had a corner room, which was bigger than the other rooms, and the bed was pretty comfortable. The AC worked perfectly and sometimes it got a little too cold for our tastes but you can turn it down and change the air temperature. The room was also very quiet and there wasn't any problems going to sleep. The hotel staff was incredibly friendly and very helpful. When we woke up, we took showers and noticed that the water pressure was very good. They only offer shampoo (From the looks of it, it didn't have conditioner in it), soap and body wash. There's a hair dryer in the bathroom as well along with a coffee maker. After we showered, we went down to eat breakfast and were very surprised at how much they offered. The first day there was pancakes, bacon, breakfast sausage, eggs, hash browns and 4 types of cereal. The second day, instead of pancakes, it was french toast. The breakfast, in my opinion, was very good! I liked it a lot and it was just amazing to me how much they offered for being a complimentary breakfast. For dinner, there are a lot of restaurants within walking distance of the hotel. My sister and I ate at this authentic Thai restaurant that was absolutely incredible. It was very easy to walk back and forth to places. Overall, I highly recommend this hotel. The rooms are very nice, the service is incredibly friendly and the location is very convenient!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bergenfield, New Jersey", "Title": "“Nice hotel and friendly staff”", "Author": "DIANAMC405", "ReviewID": "UR116178033", "Content": "We stayed in this hotel during a visit to the Inner Harbor. The hotel was clean and comfortable. The staff was incredibly friendly and very helpful (directions, information about the harbor and the free shuttle that takes you around town). Eric greeted us at the front desk and was very friendly and also advised on the parking lots (since the one for the hotel was full) There is a no smoking policy in the hotel but our loft did have a smell of cigarette smoke. We made the staff aware before check out and they said they would look into it and apologized for it. Other than that, my family and I would definitely stay there again.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel for price, perks and decent location!”", "Author": "laineylains", "ReviewID": "UR116136869", "Content": "I travel to Baltimore once a year and was a bit worried about the distance from the convention centre but it wasn't bad at all. A short walk (4 blocks) west of the hotel is the Light Rail train that takes you to the airport, very convenient. Stayed at this hotel with an awesome deal of $55/night. Free hot breakfast (eggs, bacon, and sometimes french toast, biscuit and gravy, pancakes), free WIFI, free service for accepting parcels (fancier hotels charge like $10 a box, and this important for those who need this service) and a free shuttle bus nearby that takes you to the Baltimore Convention Centre. What more could you ask for? Renovated rooms, AC was fine (although a bit too cold), the hallways had no AC but I didn't mind (saves the environment and energy). The main lobby had a nice mini grand piano (out of tune) with very friendly and inviting staff. I had a very good stay here and even the walk to the convention center is not that far. Otherwise you can hop onto the free shuttle bus or take public transit ($1.60/ride). My friends and I were extremely impressed with the clean and spacious rooms and the amazing service. I gave an employee a healhy tip at the front desk for helping me move my giant boxes around! I had some friends who stayed at other hotels in the area and they received very rude treatment from the staff. I paid much less but was given nothing but top quality service and I told the staff that I will return and advise all of my friends to book this hotel.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Great hotel in Baltimore”", "Author": "BAM1953", "ReviewID": "UR116040391", "Content": "Location is good...on Purple Route of FREE Circulator Bus...took that free bus from Penn Station after arriving on the train...very convenient. Hotel is within 1 mile of Inner Harbor...I easily walked to Inner Harbor from the hotel. Had AC problem in my room, hotel staff responded promptly & fixed it fast! Breakfast was good. Friendly, responsive staff. One negative: the hallway smelled musty...as if the carpeting had gotten wet. But the odor was not in the rooms.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Greene, maine", "Title": "“great price, good location”", "Author": "armymomME", "ReviewID": "UR115753797", "Content": "The location of the hotel made it easy to access public transportation. The buses and train were 1-3 blocks away. The hotel staff was very helpful, room clean, bed comfortable. This was hot weather in Baltimore and the air conditioner worked to keep the room comfortable. Breakfast had good options to choose from, eggs, bacon, cereal, bagels, yogurt, etc.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Illinois", "Title": "“Good deal in great location”", "Author": "SMO23", "ReviewID": "UR115616367", "Content": "I booked this hotel because some fellow travelers were staying here, it ended up being a great time. The hotel staff was friendly and helpful, they went out of their way to assist with providing information about getting around and things to see. The hotel itself is not too fancy, but it is pretty decent for the price and the breakfast buffet was fantastic. You could ask for a better location, but you would be paying twice as much. For the price the location was outstanding. Mt Vernon is a great area to wander around, and it is not too bad of a walk down to the Inner Harbor. There are museums, shops and restaurants/pubs in the immediate area (Cozy Corner across the street from Walters Art Museum is a good place to stop for food!). I booked a package that included parking in the building and I am glad I did. You could only access the garage from the outside with your room key, so did not have to worry too much about just leaving it there for the 3 days I stayed. If I end up back in the area I will most likely stay here again.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Spotsylvania, Virginia", "Title": "“You are the best!!”", "Author": "queenie03", "ReviewID": "UR115591269", "Content": "My husband needed to be at Johns Hopkins for a heart procedure so he and I stayed at your hotel together the first night and I stayed by myself at the hotel the second night because he needed to be observed overnight at Hopkins. Under such stressful circumstances, we could not have been in a nicer, cleaner and more welcoming environment than at your hotel. It's in the middle of the art neighborhood and walking distance to the waterfront. The room was huge and well appointed and immaculately clean. Your staff couldn't do enough for us i.e. extra pillows, passes for breakfast, cab fare back and forth to Hopkins and making recommendations to several wonderful restaurants a block or two away. Thank you and your staff for providing such a relaxed and nurturing atmosphere at a time of uncertainty and stress regarding my husband's procedure which by the way, was successful in getting and keeping his heart into shape. Thanks for a healing and pleasant visit to Baltimore. Best, Pauline King [...]", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "Norfolk, VA", "Title": "“Horrible”", "Author": "hamatosan", "ReviewID": "UR115495306", "Content": "Very disappointed. Upon check in, was informed that I was booked in a room with ONE double bed. Two adults, one small child travelling. Asked if we could move rooms. Without a second's hesitation, clerk said no, they were booked up. Paid ten dollars for a cot, which smelled like it hadn't been washed in 20 years. Called the hotel later that night and asked if they had rooms available. Hotel's website says \"Each guestroom is newly renovated to provide comfort for today's savvy traveler, either rooms with king or queen and/or rooms with either two double beds or two queens. Our 135 guestroom hotel and bi-level lofts are ideally situated for the corporate traveler, honeymoon couple and a small family taking advantage of the Baltimore sights.\" Horrible.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Not that great”", "Author": "Daisy1034", "ReviewID": "UR114813272", "Content": "Mount Vernon is in a great location for walking around Baltimore and the hotel parking and laundry room are convenient. It is however, not a great hotel. When we first checked in we were told we would be getting an \"upgrade\" to one of the corner rooms of the hotel. Imagine our surprise when we opened the door to find that the room hadn't been cleaned and looked like someone had just checked out of the room. This was about 5:30pm, so there should have been plenty of time to clean it. We were given another room on the sixth floor. The carpet in the hallways is old and worn and somewhat stained so was the room. Mismatched furniture and old carpet, a bathroom without a fan and free internet that hardly worked. The pillows were very flat and I had to fold mine to get my head at the angle I am used to sleeping. I didn't see dirt in the room, but it just felt a bit dirty. I thought the bottled water next to the ice bucket in the room was a nice touch until I read the little card on it saying that our room would be charged $2.00 if we drank it. Another annoying touch was that every time we got back from the hotel after walking around the city our room keys would not work. We had to go to the front desk every time we came back to get them re-calibrated so we could get back into our rooms. The hot breakfast was pretty good, but was only open till 9 on weekdays. Not bad unless you've been sightseeing all day and then checking out the nightlife and want to sleep in a little. . But, if you want a relatively cheap hotel both in price (by Baltimore standards) and decor that is in a good location, go for it.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "SpringfieldTwp", "Title": "“Pleasant stay”", "Author": "MontcoPA24", "ReviewID": "UR114681768", "Content": "Good, reasonably priced, convenient hotel. Staff was efficient and courteous; room was clean and comfortable; complimentary breakfast was an added treat. Our first floor room was suprisingly quiet. We parked at the self-service garage across the street, which was an easy in-and-out.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Lyon, France", "Title": "“Close to inner harbour but bad hotel”", "Author": "anonimus13", "ReviewID": "UR114467772", "Content": "The hotel has a cheap feeling to it, although prices are very high. Ugly colors in the rooms, old TV and furniture, smelly rooms and hallway, noisy air conditioning, breakfast was of very poor quality. I do NOT recommend staying at this hotel.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cary, North Carolina", "Title": "“Away from the hustle and bustle but close enough to walk to Inner Harbor”", "Author": "twofromNC", "ReviewID": "UR113902305", "Content": "Older hotel but very clean and functionable. Has underground parking which was a little tight for my Highlander SUV but it worked. Easy walk to restaurants and then down to Inner Harbor. Baltimore now has free buses that circle the area and so we used it to come back up the hill to the hotel. Dropped us off a block from the hotel.", "Date": "June 16, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Raleigh", "Title": "“Great Hotel for a group”", "Author": "TarHeelsareBest", "ReviewID": "UR113124929", "Content": "The Hotel worked great for a group of 30 kids. The breakfast went great for our large group. The Hotel was clean and the rooms were large. The location allowed easy access The Peabody Institude and touring the Basillica of the Assumption. It is a little bit of a walk to the waterfront, but there is free bus service nearby that worked well.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Pittston, Pennsylvania", "Title": "“Great Staff. Excellent Service!!”", "Author": "grvolans", "ReviewID": "UR112792928", "Content": "We weren't expecting much after a disasterous stay in another hotel one day prior to our reserved stay at Mount Vernon. The front desk staff were friendly, helpful, and courteous. The rooms were very clean and spacious. Bathrooms were spotless with no mildew or mold anywhere. Cleaning staff replenished necessities every day . Beds were comfortable and we had no trouble sleeping. Free breakfasts were a plus and food quality is decent.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Greenwich, Connecticut", "Title": "“Great value, extra helpful staff”", "Author": "laurac044", "ReviewID": "UR112307951", "Content": "I happened to have gotten a fantastic deal on this hotel through Priceline. Based on that price, which was less than $80.00/per night, I would definitely stay here again. I was recovering from surgery at one of the local hospitals and an extremely helpful woman at the front desk brought breakfast to my room every morning, on her own time. The hotel does not offer room service, and since I was on crutches, her efforts meant a lot to me. I thought the room was a generous size, clean. There was pretty decent free WiFi in the rooms (sometimes it would be down for a bit, but mostly it was working and with a very good speed). I have seen some people complain about the breakfasts, but I was pleasantly surprised. Bacon, sausage, french toast, home fries - all very good! The scrambled eggs weren't so great, but I was pleased with the rest of the complimentary breakfast. I requested a quiet room and had no issues with noise. I wasn't able to get out much, due to my recovery from surgery, but it's my understanding that this hotel is in a pretty centralized location. I probably wouldn't stay here at the list rates, which were about 200 per night, but I definitely would stay again and recommend the hotel for under 80 per night.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sweden", "Title": "“Certainly recommended.”", "Author": "Tobias032", "ReviewID": "UR109748303", "Content": "It's a very nice hotel! The rooms are very clean and very well organized, and the staff is very helpful and welcoming. The hotel is located very close to buss stops, taking you within 10 min to the city center and the inner harbor. Certainly recommended!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Queens, New York", "Title": "“Good Location”", "Author": "entetoo", "ReviewID": "UR108245700", "Content": "Clean room and a good staff. I'd stay again. Baltimore is a great city.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Merchantville, New Jersey", "Title": "“Great hotel for the price”", "Author": "pha1226", "ReviewID": "UR106865182", "Content": "We stayed overnight during Spring Break (April, 2011). I got a very cheap rate on Hotwire. The hotel is not really within walking distance of anything but I'd rather take taxis than pay Inner Harbor prices. I had read here about the parking situation in advance so we parked in the public lot across Franklin St. It was very easy to get in and out of and the price was reasonable. The building and lobby of the hotel are nothing special. We had no problems checking in and the man at the front desk was efficient and polite. Our room had no view at all but was very spacious and clean. The temperature control in the room worked fine and we were very comfortable. The beds were firm and comfy and the bathroom was clean. The free wi-fi worked fine. We didn't eat the free breakfast as it ended at 9:00 am. My only issue with the hotel is that there are benches in front of the outside stairs and there always seemed to be random individuals hanging around (maybe there is a bus stop close by or something. Overall, it was a nice stay and I'd recommend the hotel for someone who doesn't mind being a little further away to save some money.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Potentially good but needs improvement.”", "Author": "Bhibsen", "ReviewID": "UR105674501", "Content": "This hotel was a great value as I booked it through Pricline and only paid 59.00 per might for Easter weekend. Unfortunately, there were a few very strange quirks. One, they had no heat because they had switched the system to a/c the day before we arrived and the room was cold the first night. The location is a bit sketchy, being about one block from a kind of run down neighborhood and about six from the ballpark, which was fine bit the hotel comes up on Google as right near Camden Yards. The street is also one way and you cannot park in front to unload and check in. There is underground parking but you have to check in and get your key to access it, making arrival a bit of a challenge. The staff is very friendly though a bit undertrained. I booked a room with two beds and was given one with one calefornia king. When I complained I was told there were no more rooms and nothing was done to try to rectify the situation. I should note that I was told that there is no guarantee you will get the room you book when you go through the web, and I got a GREAT price so I can't complain too much. The hot breakfast is great albeit basic, fine for me b/c I am not a huge breakfast person anyway and more substantial then at most other hotels, even more expensive ones. Another great thing was it is right across the street from he Baltimore Bassilica, so I was able to take my nephew to Easter Mass and it was conducted by the Archbishop of Baltimore! I also should note, do mob pay for the \"movie deal\" because it is misleading. It says it gives you 80 movies to choose from but it really just gives you a few Starz channels. Overall, a good value bit needs some improvement. Sent up extra blankets and pillows and the bed was fantastically comfy.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bradenton, Florida", "Title": "“Better than expected”", "Author": "kdfrench", "ReviewID": "UR105066639", "Content": "When I booked our room for our recent trip to Baltimore, this hotel had wonderful reviews. Shortly before our trip, there were some negative reviews. I hope my experience provides clarity for anyone who may be undecided. We had a corner room, which was really large. It was pretty clean, the furnishings were fine - typical hotel furniture. Several reviewers complained about the neighborhood. If you come to the city from the airport via the light rail, the stop is in a rundown looking area. We never felt threatened during the walk. Walking to the hotel from Penn Station or the Inner Harbor, we used other streets and felt much safer. Of course, no matter where you are, you need to be aware of your surroundings. We found the staff to be extremely friendly. We arrived to check-in around 9 pm and asked for a restaurant recommendation and the desk clerk offered a good suggestion. They also called cabs for us when need be and answered other questions about the city. Breakfast - Most of the complaints I saw related to the breakfast. The selection is limited, but some offerings are better than what you'd find in some chain hotel breakfasts. It was nice to have the choice of hot eggs and bacon instead of just fruit and boxed cereal. The quality was fare. If I traveled to Baltimore again, I would consider staying here again, but my decision would likely be driven by rates/location. I will add - there are many hotels in the Inner Harbor that were double the price. To me, the short walk was worth the savings.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Best Birthday in B-more”", "Author": "Kdurrant", "ReviewID": "UR103697652", "Content": "My husband and I booked our reservations through Hotwire and I have to admit we were both skeptical b/c of the low rating. To our surprise we were 100 % pleased with the customer service, the cleanliness of our room and the free breakfast. The staff even suprised me with a birthday card (I'm still smiling), gave us resturant suggestions, printed out directions and responded promptly when we requested help w/ the heating system. We'll certainly be back!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Suprisingly Great”", "Author": "lahutr", "ReviewID": "UR103541741", "Content": "At first glance, the hotel seemed more \"dated\" than our liking. Quickly, the knowledgable and friendly staff made me feel so comfortable. It was one of the front desk staffs first day...I would have never known had he not mentioned it after checking us in! Thanks very much for the \"non\" hotel, homemade breakfast too! My 3 boys look forward to our return! One suggestion, maybe pillowtops...", "Date": "April 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful rooms however the staff is simply mean.”", "Author": "4courtNey", "ReviewID": "UR103377053", "Content": "I would stay here again but I would not plan on eating the complimentary breakfast. The wait staff acts as if they get paid on how little people eat. All I wanted was some coffee, and I was yelled at in front of other people when I went back for a second cup!", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Erie PA", "Title": "“I love the place!”", "Author": "wdaliangiup", "ReviewID": "UR102978416", "Content": "It was a wonderful experience. Yes, it is 2.5-star hotel but Mount Vernon is one of the best in its category! Friendly staff, clean room, big TV with decent channels, GREAT hot breakfast (why did someone complain about this? ), free wireless Internet. This location could not be better!! Light rail from and to BWI airport for $1.6! Bus line 11 and 3 are around the corner which takes you downtown with 20 minutes. Talking about the corners, there are Walters Museum, library, Basilica of the Assumption, 7-11 convenient store, best Chinese restaurant in town (I'm Chinese so this is the best for me:-)), and the whole Mt. Vernon cultural area! you get to all those places mentioned above within 5 minutes on foot. I took a cultural walk in that area up to the Baltimore Museum of Art (bus 3) in spring blossom. I had to say this is one of my best experiences in many years! You can also walk for 40 minutes along Charles street to inner harbor to see all those attractions there. anyway, this is a wonderful affordable place for museum/art/architecture/history lovers like myself. I will definitely stay there again next year.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Not Impressed, Skip Breakfast”", "Author": "AngelaIndigo", "ReviewID": "UR101879068", "Content": "My husband and I stayed at the hotel on a Friday night, it was our anniversary and we wanted to stay in the city. The location is wonderful, we love Mt Vernon, but we were disappointed in the hotel. When we opened the door to our room, we were hit with a strong musty smell. The room itself was fine, clean bathroom, firm bed, but the smell really detracted from it. We had a nice quiet sleep, but were hit with another disappointment in the morning. We were told that breakfast was included, and served from 7-10am. We arrived for breakfast at 9:45 and found the cafe had a 'Closed' sign on the door. We entered anyway and the breakfast buffet was bustling with people. The woman who appeared to be in charge of the cafe was extremely rude and was loudly complaining about how guests kept entering even though the 'Closed' sign was on the door. She was very hostile towards the guests. Again it was only 9:45. People were lined up for food and pancakes were being delivered out of the kitchen to guests. I asked the woman if there were anymore pancakes and she said no. A few minutes later I saw another chef come out with more pancakes and he did give them to us and other guests. The whole thing was very disorganized and the people working there seemed very unhappy.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westminster, Maryland", "Title": "“Loved Mt. Vernon Hotel”", "Author": "SSG127", "ReviewID": "UR101795062", "Content": "We booked the hotel for a birthday celebration and I am glad we found this hotel. The location of the hotel is within walking distance of the inner harbor. The front desk staff was wonderful, they helped us out getting a cab ride down to the harbor. The room was clean and neat. Nice size room for a group of four. The breakfast they served was great. Big breakfast of everything from eggs to pancakes to fruit and yogurt. Their parking garage was full, but there is another garage across the street. The only thing is does cost extra money. Would definitely stay here again!!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Noisy, horrible breakfast”", "Author": "orvalectiq", "ReviewID": "UR97958304", "Content": "Stayed here for one night. Service ok. Noisy room and terrible breakfast. Wouldn't recommend going there. There's much better hotels out there for the same price. Could be more clean also. A lot of noisy students were staying in the hotel also.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Friendly staff BUT beware of lack of individula climate control in rooms!”", "Author": "Serena", "ReviewID": "UR87047445", "Content": "We stayed Friday November 12th for one night. Although the hotel has very friendly front desk staff, is well-located, has parking available (for a fee), has free hot breakfast, and has clean rooms with all of the basics, I would not stay here again because of three problems with the physical plant itself that make it an undesireable place to stay. First, the hotel building does not have modern HVAC. This means only one form of climate control can be turned on at a time for the whole building, as the front desk staff explained to me when I called from my room which was 80 degrees and had all the drapes wide open letting in all the heat from the sun when I entered it. Although we visited in November, the temperatures were in the 60s and 70s, which is not at all unusual for this region of the country. Instead of having the heat on for the whole property, it would have been much better to have it off at least during the day so that the temperature would have been closer to bearable. I was not informed of this climate control situation when I made the reservation (through Hotwire, to whom I have also written about the issue) or when I checked in at the front desk. Unfortunately because I was not informed, I entered the very hot room (est. upper 80s at least) and immediately turned on the A/C, not having any way to know that this would cause the fan to just pump more hot air into the room, because the A/C was disabled completely. There was no signage on the thermostat/climate control knobs in the room to inform me of this fact. The response of the front desk was apologetic, and they did send up a fan, but the fan was very weak and in no way sufficient to cool the room. The temperature made it uncomfortable to even just sit and try and relax in. It turned the room into a sauna: if you showered (with bathroom door closed) and then came out of the shower you would just end up sweating immediately. In fact, the room was so uncomfortable that we ended up propping the door open while we were in it and awake, just to let some of the air from the corridor in. The room discomfort resulted in us altering some plans and leaving Baltimore before we had planned to leave. Second problem: The room we had faced the street and there is no soundproofing to speak of so it was very difficult to sleep from the street noise plus the heat. This noise problem did not really become apparent until all of the Friday night/early Saturday morning street noise commotion with sirens etc. started, when everyone in the room was quiet and in bed trying to sleep - which of course is not the time you want to get up, get dressed, and find out if there is possibly another room available away from the street. I take melatonin as a sleep aid, which works very well for me, but the noise was an impediment to sleep that melatonin could not overcome. Third: The parking deck, which costs $15 per night and is under the hotel so it must be accessed by going around a couple of blocks because of the one way streets, is very cramped with spaces that are very tight and awkwardly position and thus very difficult to navigate and park in. Also, on exiting the deck, there is some concrete lump or something that scrapes the underside of your car badly on the way out. I have to go get my car looked at now, and I am very concerned that damage was done. I drive a Nissan Altima, which is probably average clearance from the ground and I would not expect to encounter such a problem with a parking structure. As I said, the hotel is well-located, has friendly front desk staff, and clean rooms with all the basic furnishings and fixtures you would expect for the hotel class. The staff was helpful, even printing out my concert ticket confirmation sheet that I mistakenly left at home, and calling a cab for me when I needed one. However, the bottom line is this: it is hard to predict the weather, and I want to be in control of the room temperature when I travel so that I am able to enjoy the room and shower and sleep in comfort. The street noise and parking issues are also factors with decrease the desireability of the room, but lack of climate control is the biggest negative.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Nice historic hotel in heart of Mt Vernon District”", "Author": "Visitor58350", "ReviewID": "UR85656849", "Content": "Friendly hotel staff, good breakfast in lobby cafe, great location in Mt Vernon District of downtown Baltimore. A half block from the free purple Circulator Bus which runs from the Inner Harbor to Penn Station every 10 minutes. The bed was very comfortable, but the walls are thin and the rooms are small. Free Wifi is also a nice plus. Perfect for a single traveler.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lincoln, Delaware", "Title": "“A pleasant surprise in the heart of the city”", "Author": "fearslady", "ReviewID": "UR85172326", "Content": "For the price, I did not know what to expect, but I was pleasantly surprised. The room was large and comfortable and most of all CLEAN. The parking garage was right underneath the hotel so we did not even have to cross the street, but take note it is not designed for larger autos/trucks so if you are not driving a small car or SUV there is a public parking garage across the street. There was a hot breakfast from 6 to 9 am with freshly made food that looked pretty good. The staff was friendly. I stayed here while a family member had surgery at Johns Hopkins and I am looking forward to returning with my family sometime.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice place in an amazing city”", "Author": "hannypops", "ReviewID": "UR84781253", "Content": "The Mount Vernon is well-located; just a few blocks from the Inner Harbour and not far in a cab from Fells Point. We got mixed up with parking and parked in a lot across the street but the hotel does have parking too, although it wasn't that easy for us to find. The room's were ok - nothing too fancy - but the bathroom was good. Breakfast was fine, they don't serve hot food but have pastries, fruit and cereal - and everyone who worked here was really friendly and helpful. It's a great city and it would have been super to stay here longer, and it would have been perfectly comfy in this hotel.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tallahassee, FL", "Title": "“Fab & fun value!”", "Author": "MaryFredTallahassee", "ReviewID": "UR84558762", "Content": "Whaddya' get for $110/night? Well, you get a big, clean and quiet room with comfy beds. You get a free hot breakfast. You get free off-street secure parking (in the tightest parking lot I've ever seen!). The hotel is in a fab historic part of Baltimore, within walking distance of great restaurants, bars, museums, and America's original cathedral. Our room didn't have a view but hey, who stays inside their hotel room all day long? It was a great stay at a great price! This was our second stay at MVH and I highly recommend it. I've read some of the negative reviews and quite frankly, those folks need to stay home--they'd be happier.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Lovely hotel, great location, wonderful price!”", "Author": "Beckster16", "ReviewID": "UR82913716", "Content": "My husband and I wanted a place to stay that was close to Inner Harbor without costing a fortune. Mt.Vernon fit the bill. The owners have done a commendable job renovating the building which was formerly a YMCA. Our room was cozy and clean; we only had to ask for more tissues which were promptly brought to the room. The hot breakfast was a real plus as well, including scrambled eggs, hot apples, breakfast potatoes with peppers and onions, biscuits and gravy. There was also a selection of cereals and breads. You can park across the street in a garage with full in and out privileges for $10 a night! The free Walters Museum is only a few blocks away. We'd definitely stay here again!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Very nice hotel at a great value”", "Author": "Yankeefan83", "ReviewID": "UR81759353", "Content": "My girlfriend and I stayed two nights at Mount Vernon when we visited Baltimore to watch the Yankees and Orioles. I was very pleased with the hotel. We arrived at 2am. The attendant at the front desk in the lobby was very nice and helpful. They have a small parking area in front of the hotel for people arriving. It comes in handy to check in and get a parking pass for their garage , which is under the hotel ($15 a day but worth it). The room we had was big, very clean, and up to date. It was also quiet despite being right in the middle of the city. The hotel is close to the Inner Harbor and Oriole Park, around 1 mile away give or take. In the day time, I wouldn't have any issues walking from the hotel to the ballpark or harbor. That said, the area the hotel is in is a little sketchy, and maybe not the safest area, so I wouldn't recommend walking back to the hotel at night. There is tons of parking around the harbor and ballpark, so I'd recommend driving to those locations if you're planning to come back to the hotel late. Overall, it was a pleasurable stay, close to everything, and it met and exceeded all my expectations.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Hanover, New Jersey", "Title": "“Very pleasant experience at a great value”", "Author": "Mr_McD", "ReviewID": "UR80880188", "Content": "The Mount Vernon was a nice hotel in a great, convenient location with exceptionally friendly & helpful staff manning the front desk. They have their own secure, tiny parking garage below the hotel that costs $15 extra to utilize. The room was very clean and the bed & pillows were nice and comfortable... for once, I had no problem at all falling asleep in a hotel. The only very minor issues for me were that the thermostat in the room was set to 60 degrees with the a/c blasting when I arrived (felt like a meat locker... turned the temperature up and went for a walk to let the room warm up a little), and the next morning, my \"hot\" breakfast wasn't so hot, though I did arrive right at the tail end of breakfast service, so I am willing to cut them some slack for this. This probably sounds really minor, but being that I was in town on business and that my shirt had gotten really badly wrinkled in the suitcase, I was really happy to have an iron in my room that worked so effectively. I was really happy overall with my stay, and I plan on returning to the Baltimore and the Mount Vernon next year with my wife for our 10 year wedding Anniversary.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“A well kept hotel in the heart of the historic district..”", "Author": "Ingrid84", "ReviewID": "UR80305850", "Content": "A free standing hotel with views over Baltimore's historic district and easy access to the city's many attractions. We found it clean and pleasant and we enjoyed a full and delicious breakfast.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“All Around A-O-K”", "Author": "ashfordst", "ReviewID": "UR78551378", "Content": "Real good location - close enough to everything without being in a real busy area. Nice room. Very friendly and helpful staff. Hot breakfast - a lot better that dropping an English Muffin in the toaster. Maybe it would've been nice to have a newspaper in the lobby in the morning - but there was a guy right outside on the corner selling them. But what about when there's inclement weather? Still, it's a cool place.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great Baltimore location, outdated interior”", "Author": "natalka523", "ReviewID": "UR77539590", "Content": "Checking-in was fast, easy, and the attendant was very friendly. Rented a loft that looked very different from the photos on the hotel's website. I expected a much more modern looking room. The decor is circa 1983, the carpets are sticky, furniture is hard, worn and torn. The televisions (not flat panels) show very staticky cable, almost to the point of being unwatchable. Found bottles and bottle caps under and behind furniture and ac blower. The room never got cold even though I had the AC on the coldest settings for 48 hours. And I can't explain the reason, but I had a migraine from the time I walked into the room until I checked-out. Atleast there were NO bedbugs, for which Baltimore is notorious. Saw only one lonely little spider.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh-Durham", "Title": "“Great location,wonderful and very helpful staff,great breakfast,lovely hotel”", "Author": "Judy0810", "ReviewID": "UR76831750", "Content": "Free shuttle very close to hotel. My first time going to Baltimore. I can hardly wait to go back. I will stay longer next visit!", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, VA", "Title": "“Helpful staff, lovely rooms, convenient location, tasty breakfast!”", "Author": "jonnielime", "ReviewID": "UR76676880", "Content": "Stayed here for two nights (a Wednesday and Thursday) with my husband and our three 20-something kids and were very pleased. My first impression was positive. Although small, the lobby has the atmosphere of an intimate, European boutique hotel with a nice seating area to the left and tables and chairs that spill out from the cafeteria on the right. When we arrived, at about 7:00 p.m., there was one clerk behind the counter helping a customer and a woman in line ahead of me. Another woman stood off to the side, looking as though she was waiting for someone, and when I walked up she asked me if I was checking in. When I said yes, she said, \"Then let me help get everyone registered.\" Turns out she was the manager, and although she was ready to leave for the day, she returned to the counter to expedite our registration. That is the kind of customer service you rarely see these days, and I was very impressed. Charm City, indeed. Registration was speedy (I had a reservation) and I was further impressed with the parking facilities, which had an elevator that led right up to the lobby as well as to the hotel floors. The front desk staff provided a card to place on your dashboard, which also included clear and explicit directions to the garage. It is attached to the hotel, but because of all the one-way streets in Baltimore, it takes a couple of turns to access it. It is small -- which I actually liked, since it meant less walking and quicker departures -- but I can see that, from what another reviewer said who was not able to secure a spot, its size could be problematic. I didn't price any other parking facilities, but I thought that $15 a day was very reasonable for a city hotel. Service continued to be efficient: at registration, the clerk made a call to housekeeping to bring extra towels and a rollaway to our room; by the time I had parked the car and made my way upstairs (no more than 10-15 minutes, tops), the addtional towels were in the bathroom and my son was happily ensconced on the extra bed. Towels were good sized and nice and fluffy, too -- not the thin, skimpy things you sometimes find at hotels. Our room was also to our satisfaction. The decor was very updated and had a high end feel: very nice desk and chair, TV armoire, 2 upholstered chairs with small side table, brass lamps. Not the Four Seasons, of course, but definitely at least equal to most good quality hotel chains. We all agreed, however, that the desk area definitely needed more lighting. Room was not huge, but even with 5 adults and the rollaway we never felt cramped. Bathroom was very clean with a marble vanity that gave it a touch of elegance. My only complaint is that I found the beds too hard, and the rollaway too thin and soft, but I am very picky about my mattress; it is a problem I have at many hotels. The central location of the hotel was also great. It was a short ride to Lexington Market in one direction (we could even have walked it, but had later destinations that required a car, so we drove the few blocks) and to Antiques Row in the other. My husband and sons caught the Light Rail a few blocks over to catch a game at Camden Yards, which worked beautifully. The hotel is virtually across the street from the Walters Art Museum, and Harborplace is also just down the road. I was really surprised by some of the other reviewers' comments that the area is not safe. I did not have that impression at all. Although it is certainly not in an exclusive neighborhood by any means, it seemed fine to me; pretty much what I would expect to find in a large downtown area. We thought the breakfast was also good. Each guest is given a ticket for one hot meal per day of stay, served to you in cafeteria style. Each day of our stay it included ordinary but well-cooked scrambled eggs, bacon, and sausage, as well as some really excellent potatoes. One day it also included french toast, and the other pancakes, which we found to be just OK. Next time I would probably skip those and just ask for more potoates -- yum! Also available -- and not limited by a ticket -- were bagels, english muffins, toast, cold cereal, and packages of instant oatmeal and grits. Peanut butter, assorted jellies, and cream cheese were provided and, contrary to the experience of one reviewer, so were cups of yogurt and canned and frest fruit. I was also very pleased by the choice of juice that was offered -- orange, grape, cranberry, apple and (my favorite!) grapefruit. We did not eat in the cafeteria for any other meals (except that my son purchased a beer one night, which was nice to have available), but the prices I saw seemed very reasonable. All in all, a happy stay and a place I would definitely visit again. The young man from the American Visionary Art Museum (our first stop in Baltimore and a really cool place) who gave us directions said his parents stay there every time they come to see him. I can understand why.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Canada", "Title": "“Hotel was decent, but in a shady area of town!”", "Author": "peekaboo_iseeyou", "ReviewID": "UR76079149", "Content": "We stayed here in order to save a bit of money as the hotels in the Inner Harbor are more money, We both agreed that although the hotel was decent, the area was not! Next time we'd definitely spend a bit more money for the Inner Harbor hotels. We arrived here fairly late and there was NO parking for our car. And the front desk guy could have cared less that we now had to drive around to look for a safe area to park our car. Personally, I think that if you know someone is coming with a car, you should reserve them a spot in the parking garage or make the garage bigger. This area of town is not the safest and we were worried sick about our car bring parked a couple of blocks away with out of State plates. We were not even compensated for our trouble and I think the guy who was at the desk when we checked in genuinely didn't care. The room was really big and it was decent. Although the hotel lobby was beautiful and our overall experience was decent, we'd never stay here again. And I know the general manager comments on all posts by customers and we have zero interest in discussing this further. Thanks anyway though.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Don't pay more than $60 for this hotel\"”", "Author": "Bill_M_Toronto", "ReviewID": "UR75509684", "Content": "Fair budget hotel for Baltimore - don't pay more thank $60/night for it on Priceline or similar bidding sites - it's not worth more than that. Good Points: - centrally located in Mt Vernon historic area - great if you want to explore that area - spacious room - king size bed with firm mattress - quiet hotel Bad Points: - we arrived at 11 pm and wanted to use bathtub but it was plugged up and did not drain - no plumber available until next morning at 9 am - breakfast is pretty sad - carbonized sausages, not enough coffee, no fruits or yogourt - no healthy food at all - no amenities - forget about a pool, business centre etc - this is a basic hotel with room only If you're looking for something beyond basic, stay away from the Mt Vernon and check out the name brand hotels near the Inner Harbour", "Date": "August 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Central FL", "Title": "“Very Satisfied Customer”", "Author": "Joshgator", "ReviewID": "UR75129411", "Content": "Arrived and departed by light rail, 5-10 min walk to the hotel. Stayed six nights. Rooms are what I call standard, everything seemed clean, and in working order. Breakfast was a pleasant surprise, cafeteria quality hot meal of eggs, bacon, sausage, home fries and either french toast or pancakes - plus the expected cereals, bagels, muffins, etc. Its a 15min walk to the harbor/camden yards, and even closer to lexington market. The Basilica, and Walters Art Museum are literally across the street. Free wi-fi was hassle free, and they held my bags until my evening flight. Plenty of restaurant options within a few minutes walk. Front desk staff was always helpful.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "VT", "Title": "“Good, basic hotel with off-street parking”", "Author": "agent1974", "ReviewID": "UR75061109", "Content": "The room had a safe, a TV, an iron, and an ironing board. That's it for amenities, but that's all I needed. I got a great rate and the bed was comfortable. I paid $15/day for the underground parking garage, which seemed reasonable. Can't beat the location.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Quakertown, Pennsylvania", "Title": "“You get what you pay for.”", "Author": "Andit519", "ReviewID": "UR74296872", "Content": "As has been said in the past, you get what you pay for!!! This hotel is great for being close to the Inner Harbor, especially if you use the FREE Charm City Circulator busses. However, the rooms are very plain and furniture is sparse, especially in the bathroom. The bathroom is very large but there is nowhere to even sit your clothing for after you dry off. My other major complaint is that housekeeping is stingy with supplies. I had to go to the main desk to get another roll of toilet paper and twice had to ask for more towels. The included breakfast was edible but nothing special. We parked across the street in the parking garage and saved a boatload of money. The place isn't terrible, but also isn't anything spectacular either. But, for the price, you can't beat it.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dover, New Jersey", "Title": "“one of the the greatest hotel in baltimore”", "Author": "DFD476", "ReviewID": "UR72579620", "Content": "myself and my gf stayed here for a convention and from the momument we checked in to the day we checked out the staff especially Andy(Front Desk Manager) and Jerome at the front desk were absoultely great we arrived our room wasnt ready Andy offered to hold our bags for us until the room was ready and told us he would call when the room was ready sure enough he did and the day were set to leave our train wasnt until 9:30 at night and Andy was kind enough to hold our bags for us until we were ready to head to train station", "Date": "July 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "philadelphia, Pennsylvania, USA", "Title": "“Staff is courteous, but not very knowledgable”", "Author": "crysdunn", "ReviewID": "UR71493169", "Content": "A friend and I decided to have a girl's weekend away. We chose the Mount Vernon Hotel for it's affordability and reasonable proximity to Baltimore's Inn Harbor and other attractions. Not being familiar with the area, and also wanted to do more relaxing than site seeing, we chose two excursions; The National Aquarium and a visit to Edgar Allan Poe's grave at the Westminster. We were told by the concierge that the Aquarium was with in walking distance -- this walk was the equivalent of a marathon. Walking in the blazing heat uphill is not what I would consider \"reasonable\" as they were unable to give us specific directions. We also inquired at the front desk as to the location of EA Poe's grave. The gentleman on duty was unsure but offered to do a google search and print walking directions, stating that it would take no more than 6 minutes. Our 6 minute walk turned into nearly 90 minutes and we ended up at a police station no where near the cemetery. This directional failure then forced us to spend $40 on a cab ride to back track the entire route. In addition to a blatant lack of information, the hotel was not equipped with basic essentials such as glasses (not plastic cups), or real utensils (again, not plastic). We inquired as to where such items could be purchased and the suggestions were slim. Despite the aforementioned issues, the staff was very friendly and quite adept at uncorking wine bottles. Staff aside, since the heat was near volcanic temperatures during our stay, the garbage at the hotel was beginning to noticeably fester, leaving a pungent odor in the loby and elevators. The facility itself, however, was clean. The rooms were also clean and very well maintained. There is no room service in this hotel, parking is $15 per day and the \"restaurant\" is more of miniature cafeteria. I would not recommend eating here despite the offer of a free breakfast. You would be better off visiting the cafe in the Public Library across the street. Surprisingly enough, even though our trip has some problems, if you're on a budget I would still recommend staying here... just make sure you have all the directions you need to any attraction you're interested in. And the number of a good cab company!", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "West Lafayette, Indiana", "Title": "“Needs to be updated”", "Author": "akadvm", "ReviewID": "UR71046751", "Content": "This hotel is not terrible, but certainly not one I'd like to stay at again. There is no fitness center; the restaurant is really just a cafeteria (complete with a serving line and food scooped on to your plate); the amenities in the rooms are outdated; the comforters are polyester and the pillows are thin; the parking garage has limited spaces and is so tight I was afraid I would not be able to get my SUV parked. My air conditioner didn't work so I had to change rooms because all the maintenance had \"left for the day\" and there was only one person on duty at the desk so I had to come downstairs and get what I need to move rooms (it was only 8pm!). The only plus was free Wifi in the rooms. Basically this hotel is good for sleeping and that's it. Don't expect anything fancy or luxurious by any means. My job booked the hotel for me, but I am going to recommend they not send anyone else here.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Nice hotel, great location”", "Author": "Vacationista7", "ReviewID": "UR70490831", "Content": "This hotel was easy to get to from the airport. It was only a lightrail ride, and the stop was 4 blocks from the hotel. We were looking for a hotel within walking distance to the Mt. Vernon neighborhood, and this was perfect. The front desk staff were extremely friendly. We got there before check-in time, but we were able to check our bags so we could explore. The staff member remembered us when we came back in the late afternoon. Our room was very nice and cool (especially nice because Baltimore was in a heat wave). Everything was clean and average. The elevators were a little slow, and seeing we were only on the second floor we often chose to walk up the stairs. There was a free breakfast, which was filling (eggs, bacon, hashbrowns) but was little lacking on fruit. At the end of our stay, we had appointments in the late afternoon, and we were able to check out but keep our bags safely in the back room of the front desk. I would definitely recommend staying here. It wasn't a luxury hotel, but I felt the price was good for the place, and it met our needs for location when we were visiting Baltimore.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Carbondale, Illinois", "Title": "“Great place to stay”", "Author": "theleftway", "ReviewID": "UR70067169", "Content": "I recently stayed at the MVH. I was a little nervous to stay there because the reviews were very mixed. However, my stay there was great! The location is wonderful -- very close to many parts of the city. However, just like all parts of Baltimore, there are some seedy sections about 2 blocks away. The breakfast was GREAT! I was really surprised too! I had a nice hot breakfast every morning. Parking is a little annoying. We parked on the street one day and I was towed ($275!!), but it was my first time in Bmore, and I didn't understand the parking signs. After talking to the front desk, I parked across the stree for $10 (but each time you leave you have to pay, which the front desk didn't tell me). We also parked 1 1/2 blocks away, which was a $6 parking lot for 24 hours. So, parking turned out fine. The rooms are really nice. However, to have a microwave, it's an extra $10/day. I thought that was crazy! But, there is free internet, which was great. Also, the hotel desk guy with the braids is really, really nice!! Overall, I'd recommend people to stay at this hotel.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bear, Delaware", "Title": "“Awesome hotel.......hidden treasure”", "Author": "valeriecolleen", "ReviewID": "UR68845237", "Content": "I am always nervous to stay in hotels that I have never heard of. I read the reviews on trip advisor and they were mixed. I went to Baltimore with 2 girlfriends to go to the Oriels games and night life. The hotel was convenient to shopping and eating. We were able to walk to the baseball game and inner harbor. It wasn’t as close as some of the name brand hotels. The inside was nice and the rooms were spacious. The room rate includes breakfast and it wasn’t just continental. They had a hot section which included bacon, eggs, potatoes, French toast, and eggs. They also had cereal, sodas, coffee, bagels, and muffins. Overall, we would definitely go back. The staff was friendly and you couldn’t beat the price for being in the city of Baltimore.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“You Will Be Pleasantly Surprised”", "Author": "MizzM500", "ReviewID": "UR68490674", "Content": "My family and I traveled June 11-13 for a wedding in Baltimore from Pittsburgh. We were going to stay in a hotel at the Inner Harbor but chose not to at the last minute. After reading the positive reviews ( I read them all both good and bad) and some good natured teasing about our sports teams.... GOOOO STEELERS.....I decided to book at the Mount Vernon...with my husband and two children...and we are glad that we did. The staff was excellent...Jerome and Carl were very helpful as well as the rest of the staff. We went to the Rusty Scupper but my husband was not pleased and the following night Carl recommended a WONDERFUL seafood restaurant name Moe's...he even had them come pick us up and bring us back....the food was EXCELLENT and well worth the money. THANKS CARL.....The hotel garage was full so we had to park in the garage across the street...which was no big deal....and we felt safe. The breakfast was good and getting to the Harbor was easy.....We would have no problem stay ing there again.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cedar City, Utah", "Title": "“Loved the Mt. Vernon”", "Author": "B-Travlin", "ReviewID": "UR67108684", "Content": "We thought this hotel was a little hard to find and didn't realize it had an underground parking garage until we'd already arrived and had tried to find a parking place while checking in. The hotel was in a great location with lots of restaurants and a mall not far and within walking distance. The Harbor and National Acquarium were within walking distance as well. We loved our time in Baltimore and the Mt. Vernon Hotel was a great addition to our visit. The room was clean and the staff was outstanding. The free breakfast wasn't great, but it was okay. But give me a clean room over a great breakfast anytime!", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Not bad for the price I paid”", "Author": "Iluvtravel007", "ReviewID": "UR66238671", "Content": "This hotel is pretty good for the price i paid (100per night). My stay was pretty comfortable though I wish I had a room looking out the street whether then the one with the inner view. I cannot tell the difference between day and night. However, the area is good, it is within walking distance to most sights. Pro: The internet connections is VERY fast. The area is close to a lot of good restaurants and the inner harbor. The location is also the safest in the area. Con: The breakfast left something to be desire. I am not an early raiser. When I get to the breakfast at 9am (which serve from 6-10), all the hot food (eggs, bacon, hash browns) are already cold. I stayed for 4 nights and for 2 of the nights I was asked for changes from some weird people standing right outside of the hotel.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kutztown, Pennsylvania", "Title": "“The best staff”", "Author": "TravelingMom1990", "ReviewID": "UR65230103", "Content": "Much more personality than a large chain....both the building and the staff. Very convenient to the Basillica.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canton OH", "Title": "“Good stay at Mount Vernon Hotel, would recommend”", "Author": "brownsherie", "ReviewID": "UR64654694", "Content": "We visited Baltimore for our son's graduation and wanted a different place to stay than our typical haunts way outside of town along the highway. We've made at least 15 visits in the last four years so have plenty of hotels to compare. Because our visit fell on the same weekend as the Preakness, we knew things were going to fill up fast. Seeing the positive reviews here, I decided to book Mount Vernon Hotel because of location, price and because it included Wi-Fi and breakfast. Most of that turned out to be true. The hotel is very beautiful, the rooms clean and the staff exceedingly helpful. But due to their being completely booked, we had some issues. This hotel used to be a YMCA and the rooms are not uniform, so I should have thought to ask for a room with a window--I've never thought of not having one and how claustrophobic it would feel. So, Night #1 in the first room: low ceiling, no window, no closet (not even a coat hook for our dress clothes) no working WiFi, broken coffee pot and a telephone that kept inexplicably buzzing (as if the phone was off the hook) until we pulled its plug. The lamps, etc. were sort of second-hand shop. We also paid for the hotel parking lot that night, but pulled our car into the garage to find that they have about 15 spaces for the entire hotel, and they were all taken. We had to pay for another lot across the street. The desk clerk took the charge off the room. (We aren't complainers, we just didn't want to pay for parking that didn't exist.) In the morning, I asked if we could be moved to another room if one became available because my husband was really claustrophobic. Since it was now Sunday night, they did have enough checkouts and we could move. They had us call later in the day and had new room keys for us when we returned to the hotel that night. Night #2 was a completely different situation. The new room had a closet, very nice furnishings, a window (!) and the WiFi signal was strong. The coffee pot even worked! The breakfast was great both mornings, with an actual cafeteria with hot food including french toast, eggs, bacon/sausage and hash browns. Staff was very very nice at every interaction. There is so much to do within walking distance that I would like to stay there again when we have more free time. So, make sure you ask for a room with a window! Even looking at a brick wall and a glimmer of sunlight made a big difference. You won't find a better bargain.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Pluses and Minuses”", "Author": "lon46408", "ReviewID": "UR63529828", "Content": "Great location for daytime walking around a beautiful Baltimore neighborhood. At night, there's lots of restaurants and places to visit in the neighborhood. Very nice trendy neighborhood. The breakfast was terrific for an inner city hotel. A reasonable walk to the harbor----but a nice walk. Only problem might be parking, but there is a locked garage available to park in. I would stay here again.", "Date": "May 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great location and staff”", "Author": "btallman06", "ReviewID": "UR62330664", "Content": "I was recently stranded in Baltimore for a week due to the volcano. I arrived later on a Sunday night, dropped off my bags and went down to the desk in search of places to eat. Not only was there an awesome list (most of which I tried during the week), but Carl recommended a place just down the street and called to let them know I was coming. The great service continued throughout the week. I had to study for an exam and write an essay, so I spent a lot of time in my room where the wifi worked brilliantly. The location is great, in between the Inner Harbor and, what I would call, the theater district with lots of cafe and cute restaurants. The staff was extremely accommodating when my flight ended up being later in the evening and made arrangements for transportation to the airport. I whole-heartedly recommend the Mount Vernon Hotel. The breakfast is good, the location is great, and the staff is fantastic. No frills, but who needs frills when you're in the middle of everything!", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Horseheads, New York", "Title": "“A gem of a hotel”", "Author": "93happycamper", "ReviewID": "UR62311761", "Content": "This is a beautifully restored hotel. The rooms are clean and tastefully decorated. The lobby is comfortable and the breakfast is quite substantial. The best part was the hotel staff. Carl at the front desk was extremely helpful. There were no spaces in the garage for our car. He came down and moved his car so we could park. He called our restaurant to arrange for a ride and called again when the shuttle took longer than expected. He shared great insights about the attractions in the area. He is a great asset to the hotel.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Friendly atmosphere and accomodating”", "Author": "chicnhair", "ReviewID": "UR61992363", "Content": "I stayed at the Mt Vernon Hotel for 6 days in April of 2010. The staff was friendly, honest and accommodating of my schedule. They assisted me when needed with directions and attractions. I liked the close proximity to Baltimore's ethnic restaurants and locally-owned shops as well as the Walters Art Museum, Contemporary Museum and the History Museum. Although the wireless signal was sometimes not available in the room, it was always available for FREE in the lobby. The free breakfast was a great time to meet with other colleagues staying at the hotel and spend some time in a home-like atmosphere. Really enjoyed my stay!", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fredericksburg, VA", "Title": "“A Good Value”", "Author": "RoscoLyons", "ReviewID": "UR61654610", "Content": "All in all a very good value--through Hotwire I got a $57 rate. The hotel is in an historic building, but the rooms have been fairly recently renovated--clean and spacious. If you're up to a 10-15 minute walk to Inner Harbor attractions, you'll find the location to be fine. The neighborhood is deserted at night, but not intrinsically unsafe. Staff are very helpful and courteous. Comes with a hearty breakfast.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Friendly staff. Good room but lobby needs work. Location looks unsafe at night”", "Author": "Andre", "ReviewID": "UR61637930", "Content": "The photos are somewhat reflective of what the hotel is - rooms are nice with good decor. However, when I checked in at the lobby, perhaps because of the cheap fluorescent lighting, the lobby gave me a rundown motel 8 feel. During daytime, it looked better the reality is probably somewhere in between. The night-hour staff who checked us in was very friendly. I am not familiar with the Baltimore downtown area that is not near the inner harbor, but at night, the area doesn't look completely safe. We opted to pay $14 to park our car in the secured basement of the hotel. Internet is free but is close to unusable in terms of speed. The rate is pretty good so I would still consider it a good value overall.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "SW VA", "Title": "“Exceptional value for a budget hotel”", "Author": "GoingGoingSwVa", "ReviewID": "UR60947121", "Content": "This is an exceptional hotel for budget-conscious travelers to Baltimore. It is across the street from a beautifully renovated cathedral (tours for donation), within sight of a large public library (free), and a block from the wonderful Walters Art Museum (free). The neighborhood is great for those who like to walk around and admire old Baltimore architecture (free). Lots of good restaurants nearby, and Walgreens and CVS only about 5 blocks away. We enjoy seeing a city on foot, and walked all the way to the Visionary Art Museum and Harborplace. We had 2 rooms. The rooms were very clean (thank you, housekeeping) and the furnishings modest but very comfortable. There was the usual urban noise at night, but nothing that prevented a good night's sleep. The first floor cafeteria had a good hot breakfast. Other guests included retirees, young adults with backpacks, and at least one family with young children. It was a diverse and comfortable group. All the staff were friendly and gracious. The Mount Vernon is a great choice for economy-minded travelers. It is now my favorite Baltimore hotel.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Winchester, Va", "Title": "“Disappointed”", "Author": "guseroni", "ReviewID": "UR60525766", "Content": "We chose this hotel as we like to stay in unique hotels and it was close to our son's apt. We reserved a king room with the loft as we were also meeting out of town friends and thought we could all come back to our room and visit after dinner. There was a long line at check in which finally another staff memeber helped with . I asked if we had the king loft and he informed me we did and when went to room it had 2 Queens. Went back out to lobby and had to wait in long line again. No problem with changing room but no apology. Now for the biggest disappointment. The \" loft\" is nothing like the picture on the internet. There was 1 small love seat and a television. We were hoping for ample room for 7 people ( as the internet pictures show) We were late for dinner so did not notify management. We were also told we could park across the street for 4$ a day or in their garage for 14$. When we came back to hotel around 11:30 the garage across the st. was closed and the hotel garage had no spaces. It is very small and difficult to manuever your car. We had to drive back around a few blocks and pull over to go in and inform management. Carl was very pleasant and said that he was leaving and let us have his spot. It took us more than 1/2 hr to finally park the car. It was very cold in our room and just to inform you the heat control is up in the loft which we did not realize until morning. The register by the bed blew cold air which we turned off. I had read good reviews about the breakfast buffet but they must have been short staffed that Sun. Runs from 7-10am. At 9 they were out of bacon and potatoes, \"would take 15 min,\" took 1/2 hr for potatoes. No milk for cereal, people were using coffee creamer. No bread or toast for 1/2 hr and then staff put out 5 bagels. There were probably 30 people present at this time. Very poor Overall very disappointed with experience. We only see our friends one weekend a yr. They come from Wisconsin and our son's apt is too small for all of us to visit in. We spent almost $200.00 to stay there and it definitely was not worth the price. I guess for the 100.00 it would have been sufficient for a regular room but the breakfast would still have been an issue. We come to Baltimore frequently and will not stay there again. On the positive side we did find the Walters Museum and cannot wait to go back there, it is amazing!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Good deal, good location, not fancy”", "Author": "USA_Super_Traveler", "ReviewID": "UR60421068", "Content": "Very good location and a pretty good deal overall. Recently remodeled and lobby and hallways are very bright. Parking is $14 per day, and is in a newly renovated (and very safe feeling) garage in the basement. Room was a decent standard room. Clean and functional, just what you need and nothing more. Free breakfast was so-so, but lots of selection. Front desk staff was very friendly and made us feel welcome. Short walk or taxi ride to Charles St. and Mt. Vernon, great location! I would stay here again.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Amazing price with little technicalities”", "Author": "rajwani007", "ReviewID": "UR60279713", "Content": "At first they let us park for only 14 dollars, which i thought was a good price considering that everywhere else was overpriced. The receptionist was nice and told us all of the attractions and she told us directions to go places we were unfamiliar with. They had an optional safe we could use to keep valuable items. The room overall was nice, just that the bed was creaking a little and made some noise but that wasn't much of a problem. We had a room next to the elevator so we could here the dings and dongs as the the elevator opened and closed. Breakfast is from 7 am to 10 am. The breakfast was not the best at all the eggs were cold, the toast was not well cooked and it was such a small variety of food, but considering it was FREE it was good. Checkout time is 11 but they let us stay till 12. We got to keep our car there for couple more hours even after we checked out. Overall this hotel is nice, its close to all the attractions like inner harbor, well priced considering we reserved our hotel the day before, I slept very well, but the breakfast was alright.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wallingford PA", "Title": "“a great value and location”", "Author": "GeorgisWallingfordPA", "ReviewID": "UR60214051", "Content": "This hotel is a find! Newly restored in 2009. This was originally a YMCA built in 1907. The renovation is beautiful and took great care in preserving some of the orignal features in the old building. Rooms are a nice size and clean. Front desk staff were all very courteous and helpful with directions, tickets, etc. You can buy tickets for the aquarium in advance and they are discounted as well. The full breakfast is included in the room price. Food and choices were very basic. The $14/day self parking was much appreciated. Located in a nice neighborhood close to museums and Basilica. We walked to the inner harbor in about 20 minutes (about 10 blocks downhill. Uphill on the way back!). Would definitely stay here again!", "Date": "April 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hagerstown", "Title": "“You can NOT find a better hotel for this price and location.”", "Author": "hoppa1177", "ReviewID": "UR59815709", "Content": "I stayed here with 2 kids. I was happy to find such great reviews by other people who had stayed. We were able to walk to the harbor (however with children is difficult). The staff was amazing. Carl the desk manager was such a great help. The hotel has such charm to it. The rooms were roomy and very comfortable. We were so glad to have a hot buffet breakfast to help cut costs on eating out. We will continue to stay here time and time again. In fact we are planning a trip again soon. Only downfall is parking overnight is expensive here. Would recommend to anybody.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“A Pleasant surprise!!!”", "Author": "Monserrata", "ReviewID": "UR57281612", "Content": "Having grown up in New York City, I am very familiar with some of the finest hotels in the country in addition to having worked for a private hotel in NY that caters to UN Diplomats, I have a very discriminating palate when it comes to hotels. \"You get what you pay for\" often applies to hotels, NOT IN THIS CASE!!!!!..............You get much much more than you are paying for in terms of the level of hospitality, room and location. I would recommend this hotel to one and all, and plan to make it my home away from home when in Baltimore!!", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Great bargain for the location and nice buffet breakfast included!”", "Author": "NancyBuffalo_NY", "ReviewID": "UR56184941", "Content": "We chose this hotel to be near the Peabody Conservatory where my son was auditioning. Very convenient to the conservatory by the way. The room price included a nice buffet breakfast which was great! It was nice not to have to find a place for a quick breakfast OR pay for an exensive hotel breakfast. The Front Desk staff was very friendly!", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Loved it!!”", "Author": "mimays2", "ReviewID": "UR53386772", "Content": "I went to this hotel for New Years Eve & Day with my husband & friends. It was not only a great price of $99/night but it was very tidy & the front desk personnel were great as well. They were always very helpful. The rooms were extremely presentable, clean & comfortable. I'd definitely go back to this hotel.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Good Deal”", "Author": "RLee3", "ReviewID": "UR49749575", "Content": "The Mount Vernon is in a pretty good location in downtown. It's within walking distance to the inner harbor, Federal Hill and Camden Yards although it's a trek. The rooms are huge. There are students living in the hotel but they're quite and respectful. We had no issues with them. The garage is a nice benefit. The breakfast is amazing with a ton of options. The staff was pretty helpful.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "tux259", "Title": "“Not the nicest hotel, but great service and nice little touches”", "Author": "tux259", "ReviewID": "UR45542731", "Content": "I stayed here on a Friday night in order to take my LSAT on Saturday morning at the nearby university. It was a great experience. I was warmly greeted every time I came into the hotel by the receptionist (who used my first name) and they had no problem taking my luggage for an extra few hours after my check out. I rode my motorcycle there, and the receptionist, who was a motorcycle guy, was more than happy to let me park in the garage for no charge. I also got a call a bit after I checked in to check up on me and see if there was anything that could be done to make my stay more comfortable. The rooms themselves were average. No cool TV services or anything, but there is WiFi. Bathroom and everything else was just fine. Overall, I enjoyed my cheap stay in Baltimore here. It's no luxury hotel, but it was perfect for a college student.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Westchester County, NY", "Title": "“Basic, old-fashioned hotel - great value in good, center-city location.”", "Author": "FrugalSophisticate", "ReviewID": "UR40372074", "Content": "After booking this hotel I read earlier reviews with trepidation. But my stay was an entirely pleasant experience. Very cordial and helpful check-in; clean, comfortable and updated room; safe and secure parking underneath (key card garage with metal door, an easy elevator ride to lobby or room); and full, cooked breakfast buffet. The lobby is quite basic, with formica counter possibly left from when this building was the Baltimore Y, but rooms, hallways etcetera seemed comparable to any good quality, mid-level hotel, and the breakfast room is pleasant - all for a bargain basement rate. Short walk to Monument Square, Walters Art Gallery, Peabody Institute, Basilica and Mount Vernon restaurants - easy 10 min drive up Charles Street to Johns Hopkins or the other way for Inner Harbor, Fell's Point etcetera. Parking is extra - still a bargain!", "Date": "September 9, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lexington, KY", "Title": "“Great value - will return”", "Author": "bnssr", "ReviewID": "UR39775828", "Content": "We were greeted by Carl when we arrived. Talk about GREAT customer service! Not only was he helpful & friendly but was also a refreshing voice after an 8 hour drive. He even gave us tips on parking (park in the garage across the street). Did not have a problems w/ bedbugs. All the staff were friendly, nice, courteous, & helpful. If you will be out at night know where you're going! If standing in front of the hotel w/ your back to the front door, going to the right (after dark) would be questionable. Any other direction you're ok.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Okay, no frills”", "Author": "zooeyG", "ReviewID": "UR39686449", "Content": "I stayed in Mount Vernon Hotel for almost a week at the end of August, beginning of September while waiting to move into my apartment. The location is very good, Mount Vernon is close, the Inner harbor is not far either. Rooms are okay, but I did get bitten by bedbugs in the first room. I reported it to one of the ladies at the front desk but I guess she just couldn!t bother to do anything. After my second request (by then I had bites all over) I got another room. This, of course, pretty much cast a shadow on my stay there, especially that I had to clean and laundry everything I had with me so that I don!t carry bugs with me back home. Otherwise the hotel is okay, staff was overall very nice and helpful, except for that one young lady. Carl is a real gem, great sense of humor, very very helpful. Breakfast was nice variety. I would not return.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Philadelphia", "Title": "“Great staff!”", "Author": "Chizhik55", "ReviewID": "UR37198564", "Content": "We stayed at Mount Vernon only one night and were very impressed by the service there. Everyone was super nice and went out of their way to help us with whatever request we had. Mount Vernon has the friendliest staff out of all the hotels I have ever stayed in. The hotel is very nice and affordable for the location. The room was comfortable, clean, and had all we needed, including wifi. A good variety for breakfast, which is complimentary. We will definitely definitely stay at Mount Vernon again!", "Date": "August 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dallas", "Title": "“Good price for a decent, no-frills place”", "Author": "MarkWing", "ReviewID": "UR35708712", "Content": "My son and I were visiting the Peadbody Institute, and this hotel has a special rate for Peabody guests, which was a fantastic rate for the area. It is a close walk from here to the Peabody, which was great. The room was large and rather plain, but clean and decent. No frills. Having read the many complaints on Trip Advisor about air conditioning, we were suspicious but discovered you simply have to turn the thermostat all the way down, and then it seems to work OK. The free breakfast is extensive and better than most other hotels. Location is only a few blocks from a light rail stop, and the walk to the harbor isn't bad if you're accustomed to walking.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pa", "Title": "“Very nice but no AC in our room”", "Author": "palovestotravel123", "ReviewID": "UR33955451", "Content": "It was a bit of a walk to the harbor, but not too bad. Don't stay in room 317 if you want air conditioning, but there was a fan waiting in the room for us. This tells me that they have already had complaints about this. The room is large and clean. The breakfast was cold both days that we were there.", "Date": "July 5, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, UK", "Title": "“Good Inner Harbour hotel”", "Author": "jalu", "ReviewID": "UR33939824", "Content": "We stayed at the Mount Vernon hotel in June as part of a combined tour of Washington and Baltimore and rated it highly. The hotel is on a hill close to the Inner Harbour and has a car park below it, although the instructions given to us by reception didn't make the location immediately clear. The rooms were decorated with dark wood which took a bit of getting used to however were always clean, tidy and welcoming. The hotel included free breakfast with the room, however the food didn't look massively appealing and we only ate there a couple of times during our stay. The staff were always polite and friendly with lots of printed information available in the foyer. Would definitely stay again.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "jocelynp85", "Title": "“great service, great location!”", "Author": "phillips85", "ReviewID": "UR33179999", "Content": "Stayed a night at the Mt Vernon Hotel on a whim, found the service to be impeccable (Carl behind the desk had an easy, appealing sense of humor and took good care of our reservation!) and the location to be perfect. The room was clean, comfortable, and affordable. We'd definitely stay here again!", "Date": "June 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Utica, NY", "Title": "“this is the place to be to enjoy downtown Baltimore”", "Author": "Ippex", "ReviewID": "UR31706735", "Content": "My husband and I decided to attend an event at the conference center in Baltimore at the last minute and I had a hard time finding a place to stay with a decent room rate in a pleasantly safe area. Thank goodness I found the Mount Vernon. I knew it was the right choice the moment I walked in the door to see the beautiful lobby and the extremely friendly staff. Check in was a breeze and our room was nicely appointed, the bathroom lovely and the whole think was clean as a whistle. The complimentary breakfast was hot and plentiful and the breakfast room is charming and whimsically decorated. It is a short walk to the inner harbor and the conference and to other areas of interest. The neighborhood looks to be on an upswing and there were plenty of interesting restaurants and shopping in the immediate area. We are definitely going to return soon!", "Date": "June 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "maryland", "Title": "“WONDERFUL NIGHT”", "Author": "deninfred", "ReviewID": "UR30964390", "Content": "Very nice hotel. Room was clean and comfortable. Front desk staff helpful. Only 2 small concerns, first no place to park to check in and second the garage in bottom of building was very small to get around in. I have a full size extended cab pickup and one corner to get around I only had about 1 inch on each side of vehicle and that was by pulling and backing up several times. SO DO NOT BRING A BIG VEHICLE!!!! Although garage was very secure.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "cphawkes", "Title": "“Nice place, resonably priced”", "Author": "cphawkes", "ReviewID": "UR30694102", "Content": "Cheaper than neighbouring hotels and within walking distance of the pier / conference centre. Clean and friendly hotel, I'll be back.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Detroit", "Title": "“We love this place”", "Author": "Peabodyparents", "ReviewID": "UR29641970", "Content": "This hotel has become our home away from home when we visit Baltimore (which we do often, as our daughter attends the nearby Peabody Conservatory). Even though we have relatives with whom we could stay, we choose to stay here because it is close to the Inner Harbour and cultural sites. The renovations are beautiful, the rooms are clean, and the free breakfast alone makes the stay worthwhile. However, the best thing about this hotel is its manager (Carl Smith) and his wonderful staff. They are the definition of hospitality, warmth and efficiency. They really go above and beyond expectations. For us, it is always a 5-star experience!", "Date": "May 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "San Francisco", "Title": "“Obama Inaugural Base”", "Author": "Koolit", "ReviewID": "UR29208850", "Content": "Good intercity hotel. This property would normally be reasonably priced except that I booked late to attend the Obama inauguration, so the price was abnormally high. Rooms are sad and not well kept, but the staff was very friendly and tried hard to accommodate. However, the included breakfast was excellent , because the cafe downstairs pride itself in fixin up a great hearty full breakfast - a lot local non-guest ate there each morning my son and I were there.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Hampshire", "Title": "“Minimal frills, but great service and very clean! Great value!”", "Author": "Dvm2k1", "ReviewID": "UR28900017", "Content": "Not fancy, but highly recommended for the great service and reasonable price.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“I would stay here again, great value”", "Author": "carolrn65", "ReviewID": "UR28437159", "Content": "I found the hotel to be clean, comfortable and the front desk staff very helpful. The hot breakfast included was an unexpected plus!", "Date": "April 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Purcellville, Virginia", "Title": "“Very clean rooms.”", "Author": "SmokeysMom", "ReviewID": "UR27201875", "Content": "My husband and I stayed here March 19th, 2009 for a concert. While he waited in the car I went and checked in. You can park at the entrance temporarily (you'll need to in order to check in and then get a pass to the parking garage) but he stayed there just in case there was an issue. The hotel is four blocks from the First Mariner Arena, and not in a very good looking neighborhood (my husband was approached by someone wanting a ride). The hotel lobby is very clean and the receptionist was prompt and polite. She gave coupons for breakfast and a paper on how to get to the parking garage. You have to go around the block to get to the parking garage, and then since it is closed, you need to \"honk horn once for entry\". In our case it was more like five times, with perhaps 1 minute intervals between honks (the receptionist can hear the honking and presses a button to open the garage). The parking garage is a very very small, very very compact, with not a lot of spaces. I have a Subaru Forester and I do not want to ever go back there with a car that size. A compact car would be \"ok\" in this garage, as its a very very tight squeeze. I found a good parking spot (which wasn't very good when it came time to leave). The only thing good about the garage is it is enclosed and somewhat secure. Our room was very clean, though no refrigerator or microwave. They had extra pillows in the drawers. My only con against the rooms is that there are a few channels, and the TV Power button was broken (the power button on the remote worked fine). The hotel has a very good buffet. The food was excellent and the area was clean. For lunch I had beef and a roll. The beef was very tender and made my mouth water. For dinner I had the chicken and noodles, and that too was very good. Checking out was a breeze, however leaving the parking garage was a pain that I would rather not go through again. With the tight fit of the Forester, I had no more than an inch to spare on each side pulling out of a very tight parking spot. I enlisted the help of my husband and a very helpful employee to get out of my parking spot. I had another tight spot I had to maneuver around (we didn't leave the hotel to sight see like we wanted to mainly because of the parking garage, and the area did not look too \"safe\" to walk around in) and then I got to the garage door. It automatically opens so no wait for the receptionist to hear our honking. Overall, I LOVE the hotel. I absolutely hate the parking garage, so if you either have a compact car, have someone else driving, or take a cab, you should be ok. As I said, the area itself doesn't look too safe, so I wouldn't recommend it for the solo traveler. I would rate this five stars if they had more channels, a fridge, and a better parking garage.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Boone, NC", "Title": "“dirty and awful”", "Author": "johgoodrich", "ReviewID": "UR23071207", "Content": "Smoke free room? Our phone had been used as an ashtray (not cleaned out). It was January, and we had no heat for the extent of our stay, even after complaining. Cable had, perhaps, 6 channels. Windows filthy, could not see out of them. Great location.", "Date": "December 29, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hurley NY", "Title": "“locks and lighting”", "Author": "ShaunaofSCA", "ReviewID": "UR23043100", "Content": "I stayed at the Mt. Vernon Hotel for one night the day after Christmas. I'd selected it for it's proximity to the Walters Art Museum, which is one block over from it. I called directly to place my reservation and asked for a smoke free room. I was pleased to be told the entire facility is smoke free. The directions to get there from rte 83 were simple. On arrival, I was given simple instructions to drive around the block to the parking garage in the basement. The parking garage area is unstaffed, and therefore a safety concern to a woman traveling alone. It is well lit, reasonably clean, and odor free. On check in, the assistant manager working the desk was friendly and personable, I was given a keycard and voucher for breakfast in the cafeteria and a tourist map of Baltimore. I went up to my assigned room and found it to be quite cold in the room. The heating controls were prominently located and simple to operate and when turned on let out a strong blast of hot air. The room lights were quite dim (60 watt bulbs in dark shades). Even with all four room lightsources on I would not have been comfortable reading in that inadequate light. My mother, who has poorer vision than I do and who fortunately was not with me, would have found the dim lighting an unacceptable handicap. While messing with the lights I determined why the room was so cold with the heat blower off. It's an old building with marble slab windowsills -- formal and elegant and cold as ice to touch. I don't envy them their heating bills trying to overcome a building full of such heatsink windowsills. I left the room to go see the Washington Monument (about two blocks away) and as I exited, I automaticly reached back to be sure the door had locked. It had not locked, and I spent the next 5 minutes trying to get it to lock without success. I went down to speak with the assistant manager at the check in desk. He was horrified, and immediately swiched my room to another on the same floor. While he and I were speaking, I observed some college age young men enter with a case of beer and get on the elevator. I commented that it looked like there would be a party tonite. The assistant manager who had just told me he was moving me to 305 noted my comment and handed me a keycard for 318, saying 305 would be too close to the party. I never heard any party noise at all. 318 was just as dimly lit and just as cold on entry as my original room, but 318's heat blower was also quite strong and the room reached a comfortable temperature quickly. All carpeting appeared brand new both in rooms and in halls. Bedding, bathroom and elevator were all clean. The shower controls required experimentation to master, but there was lots of hot water with excellent water pressure and showerheads that adjusted to power stream if wanted. The choice of TV channels were minimal (about 20) and the weather channel was via sattelite and therefore did not have local weather which was annoying. I arrived for breakfast at the cafeteria just before it closed (10am) so no bacon, lumpy farina and a dry biscut were predictable, and good scrambled eggs were an unexpected bonus.", "Date": "December 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“Great location - Well run, very clean hotel”", "Author": "bustravlr", "ReviewID": "UR21932230", "Content": "I reserved a room at the Mt Vernon recently because the hotel was close to the Convention Center in Baltimore and had reasonable rates. I stayed for two nights and really enjoyed the stay. The room was very clean and the room and bathroom had been recently upgraded completely. They have a funky little cafeteria adjoining the hotel lobby that serves breakfast, lunch, and dinner. It's not an \"order from menu\" type of restaurant but they had two hot entrees and vegies, etc for the lunch and dinner meals. The food was good, \"down home\" type faire and very reasonably priced. The breakfast was huge - lots of eggs, sausage, bacon, hot cakes, biscuits/gravy. I had my fill! All in all, the hotel is a bargain and the staff was very responsive. And as I mentioned, the hotel is very clean. I'd definitely stay there again.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“Stay Somewhere Else: Cannot be Trusted”", "Author": "MindGuyTraveller", "ReviewID": "UR21651955", "Content": "First the positives: Clean rooms, excellent renovation, free breakfast. Now the rest: Booked a block of over 20 rooms for a wedding. Management over promised and under delivered. Loft rooms were not with sofa beds as promised. Adjoining rooms were sold to other guests. The groom's room the night before the wedding was sold out to another guest. Rather than sharing his last night before his wedding with his groomsmen in an adjoining room, he ended up at the opposite end of the hotel. Management tried the best they could, but they would rather wash their hands of guilt than act quickly to alleviate problems. If you're coming to Baltimore and the Mount Vernon area, stay at the Peabody Clarion Court Hotel. Yes, the rates may be twice as much as the Mt. Vernon, BUT AT LEAST YOU WILL GET THE ROOM YOU ASKED FOR. PS. Central air, so the system was blowing out heat on a 72 degree day. Nothing like putting on a tux and sweating! Avoid at all costs.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "altamont, new york", "Title": "“Great location, Great Price, Clean too”", "Author": "taylor130", "ReviewID": "UR21376172", "Content": "We just returned from a 5 night stay. The purpose of our visit to Baltimore was to attend a family reunion. Originally we planned to stay in D.C. for a couple of days and then stay at the Mt. Vernon for the night of the reunion. But, since the hotel prices were exorbitant in D.C., we stayed in Baltimore and went in to D.C. for the day. Our room was in a corner on the 2nd floor...very clean and quiet and a decent size. Check in was a breeze and the front desk people were cheerful and helpful. Yes, it is also a dorm for students attending the Baltimore International College; but their rooms seem to be on the top floors (6 upward). The students were courteous and created no problem for us during the 5 nights we were guests. The only negative was the cafeteria for breakfast (which was included). It was more like a soup kitchen, plastic utentils, etc. But, we found a great breakfast cafe, David and Dad's, just one block down on Charles Street. Teo Pepe's is a super resturant, 1/2 block away. It was so good that we had dinner there twice. It is Spanish cuisine. The chef has been there for 28 years, so you can imagine how great that is, knowning how chefs come and go on a regular basis in most resturants. We also enjoyed a local Irish pub, Mike O'Shea's, 1 block down Charles Street (next door to David and Dad's). Not only a friendly local pub, but the food was really good. We had both lunch and dinner, and except for the enormous portions, the food was very good. Next time we go back to Baltimore, we would definitely stay at the Mt. Vernon again.", "Date": "October 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leatherstocking Region New York", "Title": "“Great Hotel, Great Location!”", "Author": "The-Flying-Circus", "ReviewID": "UR20859865", "Content": "As of October 2008 this hotel was great! The room we stayed in on the 5th floor was completely renovated. Clean, comfortable, courteous, what more can you ask for. Two queen beds in room with plenty of space left to maneuver around. This place is not 5 star, but its location makes it a super place to base your stay in Baltimore. Light Rail is a few blocks walk, bus lines are all around. Metro subway is only one more block over from Light Rail at Lexington Market. There is some truth to what I've read in other reviews, but the college students were quiet and courteous, the breakfast is cafeteria style but adequate, and the elevator is slow, but that is because it stops at every floor on weekends. Front desk staff was very helpful when I needed assistance. If you can get this place for under $100/night it is more than worth it for the price. Mount Vernon is a very safe neighborhood between Charles and Catherdral. Most places to eat were within 2-5 blocks of the hotel. Be careful at night if you stray more than 3 blocks to west, as that neighborhood is in tough shape. If you don't mind walking you can get to Inner Harbor, Camden Yards, Little Italy, and Fells Point pretty quickly. Most areas that you want to get to are within a 1-3 mile radius. I went with a buddy of mine to visit the historic sites, but plan on bringing my wife and kids to this hotel when I return to Baltimore.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Oddest Hotel in a really strange city”", "Author": "misterfisher2006", "ReviewID": "UR19308924", "Content": "Oh my gosh! This was just the oddest hotel stay. It seemed more like a college dorm than a hotel, but it was quiet, clean and comfortable, located a quick cab ride to where ever, and at $159 plus tax, one of the best values downtown Baltimore has to offer. At that price, I didn't mind pulling the empty plastic vodka bottle out of the toilet tank when it got lodged under the flapper and the glass pot pipe stashed on the window ledge outside the room seemed simply charming. The continental breakfast was great and well attended by a roster of international tourists, but the restaurant was not open for business, yet, so I don't know how the food will fare on a regular basis. When I arrived a couple hours before check in, they kindly checked my bags and I wandered off to check the local brews and watch the soccer. I'd stay again, if I ever had any reason to be in Baltimore, god save me.", "Date": "August 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "massachusetts", "Title": "“don't overlook Mount Vernon”", "Author": "awrey", "ReviewID": "UR19199912", "Content": "We'd read some iffy reviews of the Mount Vernon, but all the Inner Harbor hotels were booked. Thank goodness they were! The Mount Vernon recently underwent a renovation--the rooms are comfortable and neat, the staff was ever-smiling and helpful, and the rates were half that of the big hotel chains by the Inner Harbor. I lived in Baltimore many years ago and think the Disneyfication of the Inner Harbor has obscured Baltimore's real charms. The Mount Vernon is in a great location (walking distance of Inner Harbor/Camden Yards/Aquariumm etc.), in heart of Mount Vernon area, close to Lexington Market, Pratt library, etc.) and the building is historic (the old YMCA). Has its own garage. Couldn't have been happier with it.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Northern Ireland, UK", "Title": "“\"Interesting\" Lovely staff, well equipped room.”", "Author": "arisun", "ReviewID": "UR19181481", "Content": "Well, I booked the Mount Vernon to stay for two nights, just my boyfriend and I on our road trip adventure. We started in NYC and finished in Key West, did a LOT in between! We wanted a hotel in Balitmore as our base to see both Washington DC and Baltimore. DC is VERY expensive hotel wise in comparison with B'more and just a short train ride away. We booked the hotel apprehensively after reading some of the reviews here on trip advisor: ceilings falling down, only three legs on beds and so on, we figured it may be an adventure!! Arrived to be greeted by really lovely helpful staff who checked us in quickly and gave us good tips on where to get lunch and how to get to the harbour etc. Very friendly. Got a slow lift up to our hotel room which was (as others have mentioned) on an otherwise rather quiet floor. Opened the room door and were greeted to a fab room, much bigger than (maybe 3 times the size!!) our room in NYC. TV in a huge wooden lush unit, floor lamps, nice new carpet (we've experienced some awful sticky carpet... eww), clean immaculate comfy beds, lovely clean bathroom, we couldnt fault the actual room or the air con etc. We went out for dinner that night to the harbour and came back late to the hotel. Tired and weary from travelling during the day, we were looking forward to a comfy bed. Pressed the lift button (again, took an age to arrive) and waited. Eventually it opened, Im pretty sure my jaw smacked the floor as it did. A burly guy (looked like a minder) walked out with a prostitute in tow (leopard print bra, matching underwear, fishnets, high heel platforms, make up shovelled on, need I continue?) I know Im pretty naiive, and it was a warm night, but is this normal practise to teeter about in such attire? I understand its something that happens, but is it accepted in hotels? So blatent and obvious? This was our main gripe. That and 'grown ups' playing tag in the corridors, running past our room. (I was practically coma-tose I was so knackered, my other half informed me of these extras the next morning!) Also, a drunk guy bouncing off (and slumping against) the corridor walls in what we supposed was an effort to get back to his room after a hard night out. Needless to say I wouldnt recommend it for a family, but if you can look past this it was a fantastic price for a fantastic room in a quiet but central enough part of B'more. I dont know if Id stay here again, im 50:50. My other half thinks he would, for location price and a decent bed it was great. If you can close your eyes to the afforementioned then it would be fine.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huntington, WV", "Title": "“Love this Hotel”", "Author": "japamella", "ReviewID": "UR19115549", "Content": "We have stayed in this hotel six times since Sept. 2007. They were remodeling when we first stayed but had no problems. It is not a great hotel but the staff is friendly and the rooms are clean. We love the location. It is close to Peabody Conservatory of Music (which my nephew attends) and is very close to many attractions. We usually park in the garage across the street and just walk everywhere. The only complaint I have is that this past time we stayed, they no longer offer compliementary breakfast, they now have a small cafe instead. I would also advise to park at the garage across the street since the garage under the hotel is very tight to get through.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Location": "2"}, "AuthorLocation": "Claymont, DE", "Title": "“Hotel from Hell”", "Author": "erbowman", "ReviewID": "UR18403449", "Content": "When we arrived at the hotel, check-in was quick and easy. However, we got into the room and it was smelly and muggy. We immediately went to turn the A/C on and, after about 30 minutes, noticed that the air conditioner was not blowing cool air out. This was our first contact to the front desk. They apologized and told us that they don't have the air on for the season yet. Let me express to you how HOT it was in this room, and my situation. It was me and a few girlfriends staying in the room. We were there to hit some of the clubs in the area and have a girls weekend out. So we were going to be getting ready in this hot, sticky room. Anyway, we asked them how they expected us to be able to enjoy ourselves in this room when the windows DON'T OPEN and the air conditioning didn't work. Yes, that's right, the windows were not even created to open. So we had to blow-dry, curl, and take showers in this hot, muggy room. Since the hotel was going through renovations (which was not posted on the website, or mentioned on the phone) the elevators were not working, and the only other option was to take the workers stairs, which were cramped and confusing. There was barely anyone else staying on the floor that we were on, so we left our room door open to let some air in. While I was in the bathroom getting ready, I looked out the door and saw someone hide behind a corner. I looked a little further and noticed that a HOTEL EMPLOYEE was standing in a dark room caddy-cornered from ours watching me get ready! With all that being said, my stay at the hotel was awful. We did however, get our money back. Oh, and by the way, the hotel is also used as college dorms.", "Date": "July 29, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "State College, PA", "Title": "“I would stay here again.”", "Author": "bamt08", "ReviewID": "UR18053973", "Content": "I found this hotel to be clean, comfortable, and convenient. It’s in the heart of the Mount Vernon section of Baltimore and many cultural attractions and restaurants are in walking distance. I arrived about 9pm and the hotel parking was full. There is a parking garage across the street, but I chose to park on Charles Street as it was free from 10pm to 8am.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Atlanta. GA", "Title": "“Good stay if you can get the price right”", "Author": "Samatva", "ReviewID": "UR17588161", "Content": "Ended up at the Mt Vernon after Days Inn Inner Harbor did not honor my reservation. Mt Vernon is a bit older and one elevator was under repair during my stay. My room was nice, but small. The TV channel line up was limited, but surprising has ShowTime included. They do have free WiFi (not secure) which was quite strong and fast in my 5th floor room. The morning continental breakfast was fine - the restaurant was closed (renovation?). The neighborhood is \"interesting\" - I walked through a few questionable blocks (boarded up businesses, etc), but never felt threatened. I was able to get the same price for nights 2 and 3 that Days Inn paid for my first night - $99 vs. $155 normal or $122 govt employee. They were not booked full even though a national extreme sports competition was in town... My guess is that you could negotiate a good deal on a room - if so, it's a good stay.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Really Great Stay!”", "Author": "killgore", "ReviewID": "UR17325639", "Content": "Our stay at the Mount Vernon Hotel was excellent! Although it is about a 12-15 minute walk to the harbor and convention center, the hotel was by far the best value I could find in the area. It is an older building, but that gives it a lot of charm and interest. It is beautifully decorated in the main entrance and there is a great contenental breakfast in the morning (waffles, cereal, bagels, yogurt, fresh fruit, etc.) in a separate dining room with lots of decorations and flurishes. My room was complete with a great King size bed, beautiful solid wood furniture, decent size TV, new carpet, and a newly renovated, clean, and nicely adorned bathroom. My wife loved the lighting and mirror in the bathroom and said she would stay again just for the bathroom, if nothing else. The room had the usual freebies of shampoo, conditioner, etc. and had a hair dryer, iron, and ironing board. There was free wireless internet too. We stayed in the first week of June and it was scorching hot outside, but our room was comfortable and the air-conditioning was perfect. Cleanliness is very important to me in a hotel, and the Mount Vernon was one of the cleaner hotels I have stayed at in a while. The staff at the desk was helpful and always in good cheer. Probably my biggest complaint was that there was only one elevator working at the time I was there, which made things slow at times. Often I took the stairs to the 6th floor, rather than wait. However, in fairness, there was a construction crew fixing the elevator the day I checked out, so this might not be a permanent problem. There is parking available in a garage below the hotel and there is a small fee for that. The hotel is not too far from some nice little shops and restaurants in the area and a cab ride to the harbor is less than $5. Overall, if you like the charm of early 20th century architecture and are not looking for the usual Holiday Inn generic hotel, this place can make for a pleasant and memorable stay. We would definitely stay there again if we go back to the Baltimore Harbor area.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nice Hotel - clean, attractive room, & good value”", "Author": "buddmar", "ReviewID": "UR17268902", "Content": "I like staying in the Mount Vernon district of Baltimore, \"midtown\" about 8 or 9 blocks from the Inner Harbor. The First Cathedral in the US is one block away, the excellant Walters Art Gallery is also just one block away. Within 5 blocks are dozens of great restaurants. The rooms in this hotel are spotlessly clean, super comfortable mattress (but very high off the ground!) and the bathrooms sparkled with classy high polished granite countertops . The room was as good as any 4 star hotel: attractively decorated with cherry wood furniture lots of brass/crystal lamps and the big TV can be hidden in a lovely armoir. My only problem was there were college students who reside on one floor of the hotel, but they were not rowdy ... management should tell them not to loiter in the lobby. I always loved staying at the Peabody Court, two blocks away, but they were asking $179 a night and here I paid only $95. By the way, there is a garage directly across the street that charges $10 for 24 hours, and never closes ... pay no heed to the untruthful and bogus claims that the fee is twice as much or that it is not open 24/7.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maine", "Title": "“We'd stay every time!!”", "Author": "maniacMaine", "ReviewID": "UR16220321", "Content": "My husband and I have stayed there at least five times when we have come to Balitmore for baseball games. Its location is great ( an easy 25 minutes walk to the stadium), the price is right ( we're hardly in the room, going to museums while not at the ball park or eating at one of the many ethnic restaurants in the Mt Vernon area), and the service is really fine. We like it because it doesn't pretend to be somethng it isn't!! Wallking around the Mt Vernon area is a joy!", "Date": "May 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mystic CT", "Title": "“Very Clean Hotel.”", "Author": "Plaruba", "ReviewID": "UR16041245", "Content": "I stayed for one night for a baseball game. It was a good location for a good price. Walking distance to everything, and easy to get to. It was a really safe clean hotel. I wasnt planning on staying in the hotel all day so the minor issues werent really a problem for me. The problems: 1. No dial tone on the phone (who uses them anyway) 2. There were two slow drips from the air conditioner from the celing to the floor once I an while. (I just placed the waistbasket on the floor for one and the ice bucket for the other.) 3. TV reception was poor (some snow and hissing) I wasnt there to watch TV anyway. 4. The toilet tank wouldnt fill up so it wouldnt flush. (I just pored water from the waist basket in the tank so it would flush.) I notified the desk when i arrived. The next day when i left noting was done yet. i.m sure they would take care of it as soon as I left. The business center is closed (being remodeled One of two of the elevators is out. Did I mention it was very very clean. With all the problems I really would stay there again. The hotel being clean and safe was the important issue for me.", "Date": "May 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "pennsylvania", "Title": "“Great Hotel!”", "Author": "qualityisjib1", "ReviewID": "UR14843497", "Content": "This is a fine hotel. It obviously has gone under some major renovation and it certainly looks it. The staff was helpful and kind. I will stay again. I have found a new homeport in Baltimore. It's called the Mount Vernon Hotel.", "Date": "April 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "The Bronx", "Title": "“Ehhh, lacked common sense”", "Author": "Jo-awesome", "ReviewID": "UR14683830", "Content": "I liked the visit I had to Baltimore, since it was my first the seafood....amazing! The Mount Vernon was missing something though, little things. I could be nit picking but honestly when I stay at a hotel I don't expect to be calling the front desk for things that should have already been in my room. I had to call for a waste paper basket, a tub stopper, more towels after room service came and fixed my bed, an ice bucket. To me and my fiance these items should not have to be asked for. The choice of TV channels were a bit stale aslo. The bed was comfortable, the room was a bit smaller than I'm used to and it had a connecting door which made me nervous lol. The place is still undergoing renovation but I believe they were almost done. I don't think I will stay here again. Jo, the Bronx!", "Date": "March 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“What a change.. Renovated and Friendly!”", "Author": "ConventionGuy", "ReviewID": "UR14021599", "Content": "We stayed here a few months back and enjoyed our visit. But what a difference in this place...and for the BETTER! We noticed signs of renovations upon entering the lobby...new tile, new carpets and furniture too. The desk staff explained that we were going to be in one of the newly renovated rooms and to let us know if we had any suggestions to improve our stay. Anyway, everything was new in our room and beautiful. The hallway on our floor was bright and also newly renovated. We very much enjoyed upgraded rooms and clean feel at this hotel. Thanks", "Date": "March 3, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York City", "Title": "“Mt. Vernon Hotel - Worst Hotel Experience Ever”", "Author": "Triptaker919", "ReviewID": "UR12922667", "Content": "I brought my family to Baltimore and wanted to stay at a moderately priced hotel that was close to downtowm. We picked Mt. Vernon because it looked like it had character and charm. We knew it wasn't new, but that's OK. What we didn't expect was the roach problem in our rom that completely spooked my wife and kids. We counted at least six different roaches. When we complained they told us to write a letter to the ownership (which we did and got no response). And using the bathrooms were quite an experience. We had some sewage backup when we arrived and asked for a change of room. They refused that request and instead sent up a third-rate maintenence man. He roto-rootered the prblem out, but it left the room smelling very bad. Later that evening the same problem re-surfaced. Again we complained and asked for a change of rooms and again they refused. I asked to speak with the manager and was told he was busy and to check back in the next day. I asked to make an appointment with him and he laughed and saif that wasn't possible.", "Date": "January 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "syracuse", "Title": "“terrrible reviews are true”", "Author": "soccermomcamillus", "ReviewID": "UR12865142", "Content": "We were more or less assigned to this hotel as part of a soccer tournament.... I had read previous negative reviews and hoped they were not accurate. I was wrong! We actually checked in to learn that our \"loft\" room had no beds in the loft...in fact the sleeping loft was empty. A bedside light had no bulb and when we asked for one, the man who was to bring it asked to check the lamp himself. Carpets were dirty, beds were saggy and the total atmosphere was dismal almost frightening. They had no other room with the correct number of beds that they could offer us...but staying was not what we wanted to do. The only good thing was that we had no problem finding another hotel and the front desk did not hassle us about leaving. Assured us that our credit card would not be charged. We were not the only family who left so perhaps they are used to this.", "Date": "January 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Batlimore at a great price”", "Author": "Terrychicago", "ReviewID": "UR10619560", "Content": "My wife and I Stayed at the Mount Vernon many times and the staff always made us feel welcome. The hotel is currently doing some major renovation and so far as made a tremendous effort to upgrade. I talked with the front desk person and was told renovation should be done by spring 2008, New carpets, new bathrooms with granite etc...We will definitly return...It's a great location......", "Date": "November 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "chicago", "Title": "“a charm in charm city”", "Author": "traveler816", "ReviewID": "UR10255161", "Content": "Stayed at the hotel not long ago and had a wonderful time. The staff was very nice and accomodating. The breakfast in the morning was great! My two kids loved making their own waffles in the morning. The room was clean and a great value. We had a great time and will stay here again!", "Date": "October 23, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Who nicked the 'S' from the word \"hotel\"?”", "Author": "glesgamail", "ReviewID": "UR10054888", "Content": "What a dive. This place could be a wonderful downtown spot – the ideal location for loads of historic Baltimore – but it's one of the worst hotels I've ever stayed in. In the first room we were assigned the shower settings went from \"very hot\" to \"scalding\". The utterly useless people at the reception desk gave us another room – the one and only time they actually managed to help solve a problem – but only after I'd seared a layer of dermis off my back. The second room had one thing going for it – size. Jesus, you needed a GPS to get from the bed to the bathroom, but it was musty, dark and retained all the charm of a poorly-appointed prison cell. We endured three nights simply because we were in a wedding party and all the other guests had checked into the place. The rooms were $99 per night – $9.99 would have been too much. As others have noted the Mount Vernon doubles as a student dorm and the front entrance appears to be a prime spot for the students to hang out smoking cigarettes and annoying paying guests. The worst thing about this hotel though is the front desk staff – about as much use as breasts on a frog. They failed on almost every count. By the end of the trip we amused ourselves by having a competition to see who could come up with the simplest request they failed to answer. The winner? What time is it? Avoid at all costs.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Rockville, MD", "Title": "“Terrible Choice”", "Author": "SugarandSpice1995", "ReviewID": "UR10048697", "Content": "upon arrival at the hotel, there were about 1000 kids who were hanging around the entrance. come to find out they were students who lived there. i then had the lovely experience of meeting some blonde headed punk kid who was working the desk. where do they get thier employees from? all in all i never had a clean room for my stay. at night i asked for a manager and they told me that he was in the back working at his desk and couldnt tend to me. i have never felt so insulted nor will this hotel go anywhere with this kind of attitude towards its customers.", "Date": "October 7, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boston, MA", "Title": "“No sense of hospitality”", "Author": "jermrev", "ReviewID": "UR10030668", "Content": "Spent a Saturday night with my wife and two kids. Called them a few days ahead because my wife was concerned about the negative reviews. Was assured we would have a good stay. Also asked for a rollaway. Upon arrival, the lobby was filled with exasperated travelers. Check-in time was 2 but rooms were not ready. They could not tell us when they would be ready. We did not get into ours until around 3:30. The room had an odd smell, white powder on the carpet, a used cup with flat orange soda on the windowsill, 2 hand towels and no others, and no rollaway. When I asked about the rollaway at the desk, I was told they were all already allocated, despite my request via telephone. Oh well, got to sleep with my son in a hard bed with sandpaper-like blanket. Found out that their Sunday breakfast ends at 9am. That pissed off a lot of guests, who came to eat as staff was cleaning up causing the staff to call the guests rude because they tried to turn the juice machine back on. On the plus side, they knocked $30 off at checkout without my asking (\"Your room smelled bad, right?\") - odd, because I never even commented to them about the room's smell. Makes me wonder what was in that room before it was \"cleaned\".", "Date": "October 2, 2007"}], "HotelInfo": {"Name": "Mount Vernon Hotel", "HotelURL": "/ShowUserReviews-g60811-d291397-Reviews-Mount_Vernon_Hotel-Baltimore_Maryland.html", "Price": "$79 - $763*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">24 West Franklin Street</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21201</span></span> </span></span></address>", "HotelID": "291397", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f0/cd/f0cdae46da871968786a15ac140cdb881large.jpg"}}