{"Reviews": [{"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Note the wide variety of rooms!”", "Author": "John987654321", "ReviewID": "UR118308906", "Content": "I reviewed the Orto di Roma a couple of years back and have since stayed there on a further couple of occasions, once with a large group which gave me the opportunity to see a number of the rooms. These are very variable. The doubles I saw (and on one occasion stayed in) are really excellent - large and well furnished. Most of the singles I saw were like the room I first stayed in - very small. One block seems to have been converted (or purpose-built) as these small rooms, whereas other buildings (and part of the main block?) have been developed to house larger rooms. The staff are consistently very, very helpful and the breakfasts (especially the cappucinos) are excellent. The WiFi doesn't work well throughout the site, but does work in most rooms. I have not eaten in the on-site pizzeria since my first visit; several of my colleagues reported that they were less than satisfied with their experiences. A local contact recommended a Neapolitan-style fish restaurant on Via Giunio Antonio Resti (named something like Cioppa Bleue - I can't find it listed on the net) and I have eaten there several times. It's a fair walk from the Orto di Roma (off Via di Vigna Murata) but worth the walk. I considered staying at the Orto di Roma when I recently visited Rome as a tourist, but decided it was too far from the centre. I believe the easiest of several ways to get to tourist areas such as Piazza Navona is to take the bus from (almost) in front of the hotel to Trastevere station, and then the number 8 tram to Largo di Torre Argentina. Alternatively, it's possible to change (I think, at Basilica s. Paolo) to the Metro for Colosseo and (with a further change of metro line) Spagna. Either is a long journey. However, if funds are tight and you are willing to put up with that commute, Orto di Roma is a very good choice.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Very nice experience”", "Author": "Baha0", "ReviewID": "UR115349532", "Content": "Our trip to Rome was phenomenal. We had a lovely stay at Orto di Roma for 4 nights in a room with 3 single beds as we had requested. The room was immaculately clean, with air conditioning, flat screen TV, small fridge, comfortable beds and pillows. It had balcony, although no view. This was not important. The room was spotlessly cleaned everyday, shower was good with good pressure, no complaints at all about the room itself. Lift was available and that was nice for my mother and sister who needed some assistance. The room we were given, however, was above where they cooked the pizzas for the adjacent pizzaria, so we smelled bread baking very early on rising and sound from the restaurant carried somewhat. This was not really an issue. We did ask not to be placed directly above or near the restaurnat and I guess they honored that. Note to others: If not, it will be noisy. The staff was fantastic. Very helpful, especially with direction, advice, etc. The reception desk is always staffed. Any thing you want to know about, ask Paolo. He is your man, although they were all great. You can buy metro passes to get started in Rome from the hotel. They can also provide you with a pretty good free map, tell you which bus to use to get where etc. Breakfast bar was very good. Good variety and fresh. Coffee bar with a barista. Note: Both baristas are rather unfriendly, but who cares, you are in Rome. Location of hotel is all right. Takes 20-30 min by bus to get to the metro station Basilica di san paolo (line B) that then takes you anywhere else you want to go. so, give yourself plenty of time to get to places. Look into the Roma pass. It was a good deal.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fareham, United Kingdom", "Title": "“Lovely”", "Author": "SamLaw74", "ReviewID": "UR101315930", "Content": "It takes about 45 minutes to get from the hotel to the centre of Rome - basically you want bus number 764 heading toward the left as you come out of the hotel drive to the Laurentino Metro stop. The benefit is that it is very quiet in the area where the hotel is at. Breakfast was a selection of bread stuffs, cheese, ham, fruit, cereals, yoghurts and some sort of cake. There's juice, tea and coffee. It's served from 7-10am. The rooms are clean. We were fortunate in that we were in the main hotel. It's obviously been redecorated lately. Each room is en-suite and has shutters to make the rooms dark in the day time. The beds were two twins pushed together but topped with foam so you really couldn't tell it was two separate beds - and very comfortable. The rooms each have a fridge with a mini-bar; prices are as expected, but there's enough room to store your own stuff in them. TV seemed to be in Italian only - no English channels. The hotel has a computer in the lobby with free internet connection. Not all the staff speak English. The restaurant attached to the hotel was really good food, great service and great value for money.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Ok”", "Author": "reecepoutawera", "ReviewID": "UR89302545", "Content": "Actually stayed in September 2009. The hotel was OK, but our room was very noisy as it was situated just above the restaurant which was always busy. It was a mission to get into see any of the sights of Rome as you had to get a bus to the subway first and these were not that frequent. Room was clean and service was OK. Overall, OK for the money though next time I would get something closer to the city.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Clean, basic & friendly. What more do you want!”", "Author": "mini_rar", "ReviewID": "UR74937745", "Content": "We recently stayed in the Orto Di Roma hotel for 10 days for our yearly holiday, and i have to say we were not dissapointed. For a start, prior to arriving the hotel, they managed to organise us a taxi from the airport for 50 Euros (Thankfully most of the staff at this hotel speak some level of english). This was alot more reliable than some of the horror stories i have heard about unlicensed taxi cabs in Rome. The only thing we didn't really like is that the hotel have these automated shutters on the windows which you can lower and rise accordingly. O./urs was stuck, and it took them four days to fix it, meaning we couldn't look outside for four days. However, In their defence, we arrived on the weekend and they said they could not get the maintenence guys to look at it until during the week. Fair enough i suppose. We booked a double room, however this is basically two single beds pushed together which can be quite weird if you are staying in the hotel as a couple as we were. The room was quite small, but as we were only using it for a base and somewhere to sleep it was fine for us. The room was cleaned by the hotel staff every single day, with fresh towels etc. The shower was lovely and hot. In terms of basic clean accomodation, you will deffinitly not find any horror stories here, it's spotless. Every morning they provide a complimentary european style buffet breakfast between 7 am - 10am. There are meats, cheeses, croissants, pastries, and all the fresh coffee you can possibly drink. It was lovely to have a cappuchino out in the sun with your breakfast before heading into Rome for the day. To travel into Rome, there is a bus stop literally just outside the hotel. The hotel reception sells bus tickets which cost 1 Euro. This is valid for 75 minutes for one bus journey, and one metro journey. what we did is bought a 1 euro ticket from the hotel to the metro statiom. then, if we were requiring more trips for the day, you can go to the ticket machine and buy a 4 Euro ticket, which is valid all day for unlimited travel on the metro and many busses. You need to stand at the bus stop on the same side of the road as the hotel itself, and catch the 766 bus to Basillica San Paulo. From there, you get the metro (blue line) towards Rebbibbia. If you get off at the colloseum stop, you can walk to most of the main features in Rome from here. This way we managed to visit The colloseum, the spanish steps, Trevi Fountain, Pantheon etc. You have to get on another metro line to visit the Vatican and St Peters Square, however it's not in the slightest bit complicated, and everything is well sign posted. Alot of people have said that ;this hotel is a a way away from the city. It took us about 25 minutes to travel into the city each day. There is a restaurant and pizzeria connected to the restaurant, which is just top notch. The portion sizes have to be seen to be believed. thankfully, They have a set of menus in english, and they do their best to try and cater for English people. Myself and my partner enjoyed a beautifully cooked Italian meal. It was a little expensive, however their pizzeria is deffinitly for those who are more money conscious. well worth a visit at least once. Genuinly, the only thing i didn't like about the hotel was the incident with the shutter, and the fact that our room was directly above the restaurant, which meant there was quite alot of noise at night time. Too be honest though, we were so tired from sight seeing each day we soon drifted off. Would i reccomend this hotel to a friend? Well, as it says in the title, for good basic clean accomodation, then this place recieves top marks. If you are after luxury all inclusive frills then this place is probably not for you. I however, would deffinitly stay here again should i ever go to Rome again, which is inevitable since i threw a coin in the Trevi fountain!", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Deva, Romania", "Title": "“..feel like home”", "Author": "Criss_7", "ReviewID": "UR74183921", "Content": "Yes this was the feeling ! The hotel is not so close to center but is situated in a quiet area of Roma with good connections of public transportation (bus + subway) .Bus 677 at 20 m of Hotel and subway San Paolo . We liked the rustic atmosphere of the hotel with an pure italian air ! The staff was great : nice and welcoming ...most of them from Romania :) ! For baby crib in the room was already installed and the elevator was roomy enough to allow access for truck . All tikets for public transportations costs 1 euro and you can buy them from reception .There are also nearby a good italian restaurant , we ate here and we loved and the staff was very nice to our daughter occupying it while we eat . Our 4 days here was great ! Roma is great !", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Katoomba, Australia", "Title": "“Great little homey hotel out of the way with helpful staff”", "Author": "paolaedavide", "ReviewID": "UR62459819", "Content": "We spent 3 nights here, and felt very welcome and comfortable. it was a little out of the way, but with easy directions from the friendly staff, we were easily able to get a bus and a metro into the old city. the restaurant next door is fantastic, and the breakfast were lovely.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "russia", "Title": "“Very good because of a great restaurant.”", "Author": "zelenskya", "ReviewID": "UR55803660", "Content": "The main attractive feature of this hotel is a restaurant! Full of locals, with one menu in English only it's still wonderful. I guess we faced the real Italy there. Location: It's a kind of dormitory area but it was interesting to see another side of Rome. It's quiet and (it looks) safe place. It takes about 15 minutes by bus to get to the metro (S.Paolo Basilica). Bus stop about few minutes out the hotel. Hotel: Nothing special but the room was clear, bad was ok and there was a hot water in a shower. That's enough. Staff is ok. We are going to visit Rome again and planning to live in this hotel again.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Quirky, and a shade cramped, but well-run, clean and very friendly”", "Author": "John987654321", "ReviewID": "UR45898741", "Content": "I spent three nights here whilst attending a business meeting in the suburbs of Rome. I elected to stay at the Orto di Roma since it received the best Tripadvisor reviews of those in the area. As others have said, the entry is unimposing, down a short lane off a suburban street. The signs advertise a large pizzeria/ristorante of the same name which occupies the ground floor of the main building and much of the area to one side. My room was certainly small. The furnishings (a small working table, a chair, a small wardrobe, and a further small table bearing a television which received only Italian stations) were basic but adequate. It reminded me of some of the better student rooms I once occupied. It took me a while to get the air conditioning working but once switched on (with a remote control), it was very effective. The small single bed was sufficiently comfortable. The fully-equipped (but again cramped) \"en-suite\" bathroom was clean, basic toiletries were provided, and the towels were of good quality. A very attractive breakfast spread was available for self-service from 0700, complemented by good fresh espresso, and could be taken either in a pleasant room indoors or outdoors on a small verandah amongst the various semi-rural buildings that make up the accommodation. The staff were extremely friendly. Nothing seemed to be too much trouble. WiFi was available throughout the hotel, although the staff struggled a little with the technology when I asked for their help in using it. After some fiddling, it worked once I changed the DNS entry to point to a known service instead of the auto-found option. I wasn't at all impressed by the pizzeria, but it is not clear whether this business is connected to the hotel as we had to leave one entrance and walk all the way round the building to get into it. Service was incredibly slow, waiters were uninterested and unhelpful, the main meal I requested (pasta carbonara) was stone cold when it eventually arrived, and the bill we received was only vaguely related to what we had ordered. Unfortunately, this seemed to be the only option for an evening meal in the immediate vicinity. A frequent bus service along the Via di Grotta Perfetta links to the Metro system, but i takes at least half an hour to get to central locations at other than very quiet times. Transit tickets are available from hotel reception. Overall, a decent budget option as long as the out-of-town location is acceptable.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Beer Sheva", "Title": "“Nice, Quiet, Great service, local atmosphere but room ridiculously small”", "Author": "gilanir", "ReviewID": "UR40271099", "Content": "The hotel stuff are very nice and helpful. The hotel is clean and the breakfast was nice served in the balcony in a relaxed setting and everything has a local feeling- not too touristic. The rooms are sparling clean, airconditioned and has a minibar, a shower and even a bidea but the whole room is very small and crowded. To get to the city center you need a bus, which is close by, and the metro and it takes about an hour to get to the main attractions with public transport. The value for money is high.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Peaceful escape in busy Rome!”", "Author": "Fairyfort", "ReviewID": "UR35810343", "Content": "I stayed here while attending a conference and really liked it! The hotel used to be a farm and once you enter the gate, you feel like you're in the countryside, despite actually being in the city! It's a lovely, peaceful place to come back to after a busy day in Rome. Rooms are spacious and clean and the usual essentials (shampoo, soap etc) are provided. There is a television and radio in each room, but CNN is the only english language channel so I watched alot of news while I stayed here! Rooms also have air conditioning, which is an absolute must in the Summer! Breakfast is buffet style with cereal, yoghurts, breads and fruit. It was very nice and I particularly liked the peaches and kiwis that you could help yourself to! Staff were always very helpful at this hotel and I really had a very pleasant stay! The only downside to this hotel is its distance from Rome city centre. To get in to Rome, you have to take a bus to the metro station and then take the metro for about ten stops into Rome. This only costs €1 but does take quite a while. Although I was never waiting for longer than ten minutes for a bus. Also, the area that the hotel is situated in is residential so there really are no restaurants or bars nearby to go in the evening, although the hotel does have its own restaurant. All in all, I would recommend this hotel but be prepared for a bit of a trek into Rome each day!", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "2"}, "AuthorLocation": "jazzbbb", "Title": "“A diamond in the rough”", "Author": "jazzbbb", "ReviewID": "UR25096702", "Content": "Well I really can't stay enough about this hotel. Upon initial glance you see a gravel road which leads back to the hotel and the restaurant and you just think \"ohh boy did I make the right choice\"? The service desk was very friendly and if i ever needed a phone call, they were more than willing to translate my questions (to the locals) and assist with local services. The room is small, YES very small but it was clean, as was the bathroom. No real issues. The breakfast.....was true to Roma. It's free, they have coffee, espressos, fresh fruit, pastries, and polite people that greet with a smile. They even allowed me to press one of my shirts in their pressing room with no hassles since no iron was available. Now on to the restaurant.....wow....speechless. Thee best food I enjoyed the entire trip, and that's not to say I didn't have good food elsewhere it's just their food was just that much better. Once again the service is top notch....it has a real family feel to everything, and the food was amazing. Families not even staying at Oro Di Roma come to the restaurant to enjoy family meals....which speaks at lot about the restaurant....which is connected to the hotel. The location, close to metro service, but it is a ways from the city. It may take about 30 mins to take the bus to the train and arrive at the Colosso for instance. The room price was good around 110 or something...a fair price. Orto di Roma is great for a lot of types of travelers, if I returned to Italy I would stay here again for sure.", "Date": "February 24, 2009"}], "HotelInfo": {"Name": "Orto di Roma", "HotelURL": "/ShowUserReviews-g187791-d291685-Reviews-Orto_di_Roma-Rome_Lazio.html", "Price": "$84 - $146*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via di Grotta Perfetta,551</span>, <span class=\"locality\"><span property=\"v:postal-code\">00142</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "291685", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/20/e5/3c/de-luxe-room.jpg"}}