{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lugano", "Title": "“Like staying with friends.”", "Author": "AnnaMatador", "ReviewID": "UR127649892", "Content": "Clean, comfortable, and friendly - this quaint hotel has an intimate feel and is a fantastic choice for couples. The staff is especially nice and helpful. Breakfast is brought to your room or the private rooftop terrace. Right off the main piazza in Trastevere and a ten minute walk to Campo di Fiori or the Jewish Ghetto, this will be our number one choice next time we're in Rome.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frederiksberg, Denmark", "Title": "“In the heart of Trastevere.”", "Author": "Winesurgeon", "ReviewID": "UR127018341", "Content": "This is a very small B & B, in Trastevere just behind ,Santa Maria in Trastevere, the wonderful old church. Lovely breakfast at the small but very cosy terrasse.You live very quiet and central, Trastevere is a hidden diamond. Do yourself a favor try this next time in Rome.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Lovely (clean & safe) hotel in a great location”", "Author": "shan921", "ReviewID": "UR126699885", "Content": "My husband and I stayed at Villa Fonte for 4 nights at the beginning of our honeymoon. We had never been to Europe and this was our first stop of our two week trip. We were surprised that the room was sparsely furnished, but now that we've stayed a few other places, it seems to be the norm in Europe. The room/hotel was clean and safe which were our two biggest concerns, the third being we wanted and ensuite bathroom. This bathroom was clean and nice although small (again, seems very european, I wouldn't say that's a negative at all). The location was perfect, we walked everywhere and loved waking up to see the fountain the middle of Piazza Santa Maria. We loved the simple breakfast served in the rooftop garden, what welcome respite from the crazy lively chaos of Rome. Again, having never been to Europe, I was expecting more for the price (at least, in major cities in the states you would get more for the same price) but we were extremely pleased with the hotel. If we went back to Rome I would seriously consider staying there again - probably the only way I would not is if we decided to stay in another neighborhood to experience something different. Although it would be a hard choice - we loved Trastevere!", "Date": "March 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“A gem in Rome for a moderate rate”", "Author": "juliusjulius", "ReviewID": "UR126314004", "Content": "Simply put, I loved this little hotel. The location is perfect, especially for those who prefer this bank of the Tiber with it´s local buzz, off but not far from the noisy, sometimes annoying turisty Rome. No real specials in the Villa appart from a very clean efficent room, hard shades on the windows, wonderful older lady preparing breakfast on the terrace and an absolutely wonderful vibe over all. Do not choose this property if you are travelling on business or expect corporate like service. If you´re on vacation whether romantic or clubbing with friends, this is your place. In the heart of Trastever, Rome at it´s best.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A good place to stay in a central position”", "Author": "Davo55_11", "ReviewID": "UR123125670", "Content": "We found we could walk to just about every main attraction in Rome from this small hotel. It is very conveniently situated to lots of good trattoria/cafes/bars and there is a tram reasonably close to catch. The rooms were wonderfully clean. The breakfast was served in the room (winter) and on a very attractive terrace in the warmer weather. I suppose the only thing we really missed was a kettle so we could have a tea or coffee when we liked, and the noise from nearby restaurants and their voluble patrons standing around outside went on into the wee hours of Friday and Saturday. I think that's just how things are in Rome in the evening!", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winooski, Vermont", "Title": "“Excellent small hotel”", "Author": "Richard J", "ReviewID": "UR119916812", "Content": "I had a very pleasant stay at Villa della Fonte. The friendly and accommodating staff, nice breakfast on the attractive terrace, great location on a little street just off Piazza Santa Maria in Trastevere, and the comfortable, pleasant room all contributed. I was there for seven nights in October. The first night was a bit noisy with conversations on the street, but after that, quiet. I recommend Villa della Fonte highly.", "Date": "October 30, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Exton, Pennsylvania", "Title": "“Villa della Fonte Guest House was a good find in Rome!”", "Author": "ajbinusa", "ReviewID": "UR118123149", "Content": "Villa della Fonte Guest House was a good find in Rome! We wanted a true neighborhood experience and after having a little trouble with the taxi finding the B&B, we were greeted kindly by the desk reception. It is a small, family run B&B with only 5 rooms, which are well maintained with nice furniture, attention to detail, very nice service, a lovely terrace in the back for breakfast and sitting out in the evening. There is no elevator in case you require one. The rooms are small but for Rome this is quite normal and expected like NYC. You are within walking distance of the Piazza Santa Maria in Trastevere and all the restaurants and nightlife you could wish. We enjoyed wandering the neighborhood and discovering places off the tourist trail. Our room faced the small street of Via della Fonte d'Olio where we received some noise from outside at night, but it did quiet down after midnight. Overall, this is a small trade off to be perfectly located in Trastevere. A/C works well so don't need to have window open unless you wanted the local flavor. I enjoyed listening to the sounds of the city in the morning. We highly recommend staying at the Bed & Breakfast Villa della Fonte and enjoying the hospitality and local neighborhood flavor that is so Rome!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fleet, United Kingdom", "Title": "“Charming and clean - highly recommended”", "Author": "RL1960", "ReviewID": "UR116464644", "Content": "Although initially alarmed by the graffiti on the walls approaching the entrance this was soon dispelled once inside the hotel. Very comfortable room, pleasant staff and lovely breakfast in the sunshine on the terrace every morning. The square which is a stone's throw from the hotel is a lovely place to sit and have a coffee mid-morning overlooking the fountain and the oldest church dedicated to Our Lady in Rome. Very easy to catch buses nearby and there are a number of very agreeable restaurants within a few minutes walk. We really couldn't have asked for a more suitable place to use as a base for our stay.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“wonderful people and location”", "Author": "RobTy", "ReviewID": "UR115179563", "Content": "Fantastic customer service, perfect restaurant recommendations and good tips for visiting Rome's attractions (which have confusing opening/closing times and peak busy periods); they wanted us to have a great visit to Rome and we did. Clean, good sized room and nice bathroom. Good breakfast. Some noise from outside at night, but seemed to quiet down after midnight, probably louder in the summer, but this is a small trade off to be perfectly located in Trastevere. A/C works so don't need to have window open. We will return to Rome, and we will always stay at Villa Della Fonte.", "Date": "July 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“A Little Gem!”", "Author": "tobiasoberascher", "ReviewID": "UR114298709", "Content": "We - a couple 24 & 27 - spent two charming nights at this guesthouse. Nothing to complain! However, at warm summer nights it does get noisy, which we didn't really bother. The best about this little gem is the location (Trastevere) and the roof-top like terrace, where you are being served sweet, yet no sour breakfast. To top all off, there's free wi-fi and the hosts are friendly & helpful anytime. Recommended!", "Date": "June 19, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New York City, New York", "Title": "“Sorry to say this didn't cut it”", "Author": "nytraveler287", "ReviewID": "UR113679072", "Content": "This would be the perfect small hotel experience in Rome except for one major thing - every morning they insist you eat breakfast before 10 AM and when you don't show up exactly at the minute you said you would arrive, they call your room, waking you with its incredibly loud ring and when you still don't show up 10 minutes later, or if you've fallen back asleep, they call your room again 10 minutes later. This practice might be fine for European visitors for whom there is no time difference, but for American travelers who are suffering from a 6 hour time difference, as I was, it was extremely unpleasant. If you try to say that you don't want to have breakfast as it's too early and you're jet-lagged (or you simply don't want it), they insist you must. On my final morning I finally succeeded in saying I wouldn't have breakfast but it required a real back and forth, and I speak fluent Italian. Waking up at 9 or 9:30 every morning when I was extremely jet-lagged made me too tired to do much in Rome, and I was completely exhausted for the rest of my trip around Italy. I'm very sorry to report all this as the hotel itself is lovely, I didn't find the noise from Trastevere to be any problem, I think it's reasonably priced for Rome accommodations, and I found the owner to be incredibly kind (the man in the mornings less so, as it seemed my every action, sleeping in past 10 am and not wanting to eat breakfast, was a problem for him). It's really a shame, because Rome is lacking in good quality small, affordable pensioni, and this would be a fine option for anyone on Italian time, but for American visitors arriving directly from the US, it is really unpleasant to be woken up every morning. I also think it's bad business practices to call someone's room before 10, even more so for jet-lagged clients. For these reasons, sadly I will not return.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful place to stay”", "Author": "TEC10009", "ReviewID": "UR108823228", "Content": "I loved this place. I recently traveled to Italy with my 70 year old mom for a friend's wedding. We stayed at a place in central Rome for a few days, traveled to Umbria, then came back to Rome. I really wanted to stay in Trastevere and explore it more. The hotel was wonderful. Clean, comfortable and in an amazing location. The only thing I didn't realize was the number of steps which was a little hard on mom, but she was ok. Plus, the service was excellent, the desk clerk carried our bags up and seemed unhappy when I carried them down when we were leaving. He was so helpful and friendly. The free wireless in the room was a bonus as well. The other hotel we stayed at charged 5 Euros for 24 hours and you had to use it in the lobby! This is a noisy section of town, so know that going in. We shut the window and turned on the a/c and we both slept like logs. The bed was comfy, the room spotless....I much preferred this hotel over the fancier one we stayed at during the start of the trip. Being steps from the Piazza Santa Maria was wonderful as well....we could just pop out to see what was going on. I'd definitely stay here again and/or recommend it to a friend.", "Date": "May 18, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oslo, Norway", "Title": "“Perfect location and breakfast in bed”", "Author": "Snow2011", "ReviewID": "UR91923467", "Content": "I can really recommend this hotel. It's a clean, welcoming hotel situated right by the Piazza Santa Maria in Trastevere. A part of Rome with lovely resturants and in walking distance to lots of sites. And you even get breakfast delivered to your room every morning...", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“Lovely small hotel in an especially picturesque part of Rome”", "Author": "BostonTraveler82", "ReviewID": "UR90178604", "Content": "Very helpful and welcoming staff, immaculately clean rooms, and a beautiful terrace help set the Villa della Fonte apart from the standard run of small Rome hotels. The hotel is in the heart of Trastevere, steps away from the movie-set perfect piazza in front of the church of S. Maria in Trastevere. Walk out the door and there are restaurants and small shops by the dozen within just a few steps. That central location is also the source of the hotel's only possible drawback, which is that Trastevere can be very active late into the night. Light sleepers might have some trouble with street noise if they want to sleep with the (double-glazed) windows open.", "Date": "December 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“A charming base for exploring Rome”", "Author": "eleanoran", "ReviewID": "UR87330394", "Content": "My husband and I just spent eight nights at Villa della Fonte, and enjoyed our stay immensely. We loved the location, just off Piazza Santa Maria in Trastevere, with its beautiful church and neighborhood gatherings, including an impromptu songfest on a Sunday afternoon. Trastevere was a lot of fun, full of excellent and inexpensive restaurants, and within walking distance or connected by easily accessed bus and tram routes to all attractions. Our room was immaculately clean and very comfortable, and breakfasts were delicious and delivered to our room every morning. Free wireless in the room made it easy to keep in touch with family and to plot out bus routes. After exploring different parts of Rome each day, it was relaxing to return to such a charming base. Many thanks to the staff who were always ready with recommendations and a friendly greeting, especially Claudio and Simona's mother. We would certainly return again.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Wembley, Western Australia", "Title": "“Small and a bit smelly...”", "Author": "ABSViews", "ReviewID": "UR85419685", "Content": "We stayed one night only there thank goodness. The room was very small but adequate. The bathroom was clean and toiletries were provided. The terrace where breakfast is served has so much potential, it would be good to see them brainstorm some ideas about this space. Our biggest grudge was that our room was on a low floor, so twice during the night we were woken up by a group of revelers walking, talking, laughing below our window. There was also a foul smell of sewerage in our room which after a long international flight, does not help the jet lag.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Very nice, but a bit noisy at night”", "Author": "Lore_marcelis", "ReviewID": "UR73570418", "Content": "Overall we enjoyed our stay at this hotel. The staff is friendly, the rooms are comfortable and very clean (they have airco) and breakfast on the terrace is really nice (the day before you can choose what you want to eat - coffee, tea, juice, bread, ceral, yoghurt, ...). There is also free wifi in the hotel. The prices are rather high. The hotel is located in the heart of Trastevere, at the piazza santa maria, a charming neigbourhood just outside the centre where you can find a lot of bars and restaurants. Touritsts and italians come to Trastevere to eat/drink/hang out (Pizzeria \"Dar Poeta\" serves great pizzas). But, since the hotel is located near the piazza (there's also a restaurant next to the hotel)there is a lot of noise untill late at night. We didn't always have a good night sleep, wich you do need after a day of site-seeing. (We did stay in the summer vacation - maybe there is less noise during the off season) So, I would recommend this hotel, if you don't mind a bit of noise at night.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlotte", "Title": "“altogether lovely little guesthouse”", "Author": "CLT-BasedTravaholic", "ReviewID": "UR72197735", "Content": "The guest house has 5 rooms and we occupied two, but the size didn't diminish the amenities, clean, great service, and wonderful breakfast on the terrace. We liked the location - not in the tourist district but bustling with restaurants, shops and lots of people watching nearby. The area is well known for its nightlife, which for us demonstrates the vibrancy that is Rome but others might find the occassional 2:00 a.m. revelry too much. We didn't mind.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Very comfortable home away from home -Staff went above and beyond”", "Author": "LisaPisa2", "ReviewID": "UR71385384", "Content": "My partner and I loved staying at the Villa della Fonte while in Rome and look forward to going back again. At first we were afraid that staying Trastavere would be out of the way from everything we wanted to see, but it is really walking distance to almost everything. And it was great to walk back over the Tiber to our own cozy neighborhood--full of life and genuine Romans. Piazza Santa Maria di Trastavere is a lively piazza with a stunningly beautiful church on the inside. And as someone mentioned, the neighborhood is magical at night. (Though I would recommend having a map that details Trastavere well--the streets can be a little bit of a maze.) Simona, Claudio, Vadim and Simona's mother were always very friendly and went out of the way to help us with restaurant recommendations,museum info, taxis, etc. We had a very early flight out of Rome and Simona even set her alarm for 5:30 am so she could come in early to help us get off okay. This made what could have been a very stressful departure from Rome into a joyful arrivaderchi! The continental breakfast on the terrace was always a great way to start the day. There was a mixup in our reservation when we first arrived but they were able to accommodate us and gave us a price break on the smaller room we had the first night. They certainly made it up to us the rest of the stay. We went back and stayed there again after touring around Italy, so all in all we had a chance to stay in three of the rooms. I believe room #1 and #5 were the two larger rooms. I wouldn't recommend room #4 for two people, unless you really want to save $$. It's nice, but just a little small. I miss this little place, our adopted neighborhood in Trastavere and our new friends and hope to go back soon.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sioux Falls, SD", "Title": "“A treasure in the Midst”", "Author": "Spicegirl10", "ReviewID": "UR69888344", "Content": "Although it can be somewhat difficult to locate, this hotel is well worth the search ... the rooms are immaculate and unique and cozy ... the staff is very helpful and friendly ... they were kind enough to send me a souvenir book that I left behind, which I greatly appreciated ... the Villa della Fonte is right in the heart of a piazza where locals and tourists enjoy the evenings with gelato and musicians ... you know that you are visiting Italy ... If you want to get the full flavor of Italy ... this is the place to stay ... Dr. Spicero", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Piedmont", "Title": "“Great location, good value and warm staff.”", "Author": "Tobydoby", "ReviewID": "UR69001082", "Content": "This really should be rated higher. I really liked this place; clean, nice neighborhood, beamed ceilings, my own bathroom. Breakfast was decent and the staff was wonderful. The only thing that would have made it perfect would have been free internet access. Don't know why everyone doesn't offer that.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gent", "Title": "“Great place in the heart of trastevere - the more \"relaxing\" part of Rome.”", "Author": "Feniksian", "ReviewID": "UR65078752", "Content": "I stayed for 6 nights in Villa dell Fonte in May 2010, and I can recommend the place, for single travellers, couples and a small group of friends. It's a small ( 5 rooms) hotel located in Trastevere, a lively and less expensive) neighbourhood of Rome (think plenty of ristorantes, pizzerias and Bars). The hotel is located very close to the main square (Piazza Santa Maria), but it is not a noisy street at all. The staff is very friendly and helpfull and the breakfast (included in the price), is very good....The breakfast is made with love by the nicest Italian signora you'll ever meet (Owner Simona's, mom). She even made me breakfast, my last day when I had to leave early in the morning. I had some very nice conversations with (among others) Simona and Claudio abouth Rome, Italy etcetera.. The rooms are small, but comfortable (very good bed), a safe and a minibar is included. There is a sattelite TV with includes BBC WORLD, BVN (for dutch-speaking viewers) and lots of German and Italian channels. The location is excellent: The Vatican is a 20 minutes walk, the colosseum is 30 minutes away (by foot) and the historical center is very close by as is public transport. Don't forget to explore Trastevere itself: it''s a lovely auhentic neighbourhood with a beautiful botanical garden and lovely views on Rome from Gianicolo mountain. I will recommend this place to all of my friends!", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Yorkshire", "Title": "“Fine location and very helpful staff”", "Author": "TonytheTurner", "ReviewID": "UR64060258", "Content": "Stayed for six nights with my wife and adult daughter. The villa is yards from the Piazza Santa Maria and surrounded by the widest variety of eating places and bars, but very quiet. The staff are particularly helpful making phone calls to obtain taxis at a moment's notice. Breakfast on the terrace (until it rained!) was an unexpected bonus especially as the rooms were on the small side when it was served in the room. Overall, an excellent choice which we will doubtless repeat for our next visit to the Eternal City", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“Great Stay,”", "Author": "dkoff", "ReviewID": "UR60252635", "Content": "My wife and I enjoyed the Villa Della Fonte for four nights in mid-March. Our room (No. 5) was spacious, clean and very comfortable. The Villa is off a small square in Trastevere, close to the historical area (walking distance) but not surrounded by tourists. The rooms were very clean and the staff was very helpful with directions and recommendations. They even came in early to serve breakfast as we had an early morning tour. The only issue was some noise during the nights as students wandered back to their apartments after a night on the town. Our bed was very firm and the A/C worked well. The only english chanel was the BBC. We very much enjoyed our stay and would recommend it.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cologne, Germany", "Title": "“Cute little place in the heart of Trastevere”", "Author": "DorCologne", "ReviewID": "UR49800020", "Content": "Great location in Trastevere with lovely and friendly owners/staff. We stayed for one week in a pretty decorated room which was spotlessly clean. The lovely breakfast has been served on the terrace with a nice view of the piazza.", "Date": "November 22, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Worcestershire", "Title": "“Small hotel with a big heart!”", "Author": "GillyP62", "ReviewID": "UR48561694", "Content": "Tucked away in a side street in Trastevere this is a gem of a hotel.Good sized room with en-suite shower room which was serviced every day to a high standard. Beds very comfortable too. The weather was warm enough to have breakfast (the most wonderful bread rolls!)on the delightful terrace which looked down towards the Plazza. We were greeted by the hotel cat on the first morning-one of many we were to see in Rome. Claudio made us feel very welcome and we hope to go back as we are planning on an regular annual holiday to this wonderful city.", "Date": "November 5, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "4"}, "AuthorLocation": "norway", "Title": "“Helpful, friendly, central and cozy”", "Author": "kjartman", "ReviewID": "UR35160849", "Content": "I would like to say that I usually dont write reviews for hotel stays.however im making an exception today. I misplaced my mobile on the taxiride from the airport to the hotel, and the next day it was in the reception waiting for me. Its just an example of the good service you get at this hotel. My jumper was folded to perfection, dirty laundry was placed in a bag etc. Service is good. The breakfast served in the room or on the terasse is simple but nice. The rooms are small, but not that small (we were comfortable). Me and my gf would highly reccomend this \"close to everything\" hotel!", "Date": "July 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Hammonton, New Jersey", "Title": "“Clean and a Good Value in the heart of Trastevere area of Rome”", "Author": "sillygirl49", "ReviewID": "UR28660705", "Content": "Stayed at the Villa Della Fonte for two nights on a short visit to Rome. The rooms were small but beds were comfortable and the bathroom again small, but very clean. Breakfast was brought to the room in the mornings, standard Italian breakfast of brioche, caffe latte, a roll and jam, juice, yogurt. There were a couple more choices on the menu we could also have ordered. The hotel is difficult to find initially, located in a narrow alleyway off the Piazza Santa Maria, but there are lots of places to eat and of course the beautiful church on the piazza, and lots of pedestrian traffic. This is not a place you would want to stay if you have trouble climbing stairs. Reasonably priced. Safe location.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Super little place, perfect location, friendly staff.”", "Author": "beachedwhale", "ReviewID": "UR25822977", "Content": "Spent 3 nights in Villa della Fonte and it was super. The location is very good, beside restaurants and bars. There is a great buzz in Trastevere at night. The hotel is very small, rooms are quite small too but very comfortable. Don't expect luxury, it's quite basic but it is a very homely little place. For restaurants, try Trattoria Da Lucia, it was quite good and Il Ciak. Would not recommend La Cannonica, very anxious to get us in the door but very disappointing. Great area for peoples watching and time wasting!", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas, USA", "Title": "“Wish we had stayed longer!”", "Author": "ejaves", "ReviewID": "UR23295880", "Content": "GREAT hotel! I absolutely loved Trastevere and will stay in this neighborhood (at this hotel if possible) from now on. If you are a foodie, the restaurants in Trastevere can't be beat. The hotel was only a short walk from the Pantheon, Piazza Navona, and Camp di Fiori. Staff was wonderful. Room and bathroom were spacious, clean, and quiet. Very nice terrace area. The beds were the most comfortable of anywhere we stayed in Italy for 2 weeks (just as comfortable as home!) As a nice touch, we were left a welcome basket for New Years Eve with champagne and chocolates. I would stay here again in a heartbeat!", "Date": "January 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "brooklyn, ny", "Title": "“Great hotel, great location in Trastevere”", "Author": "packjev", "ReviewID": "UR23282939", "Content": "What a great little hotel! I stayed here by myself for 4 days in Dec 2008. The single room was tiny, but perfect for me. And the connected bathroom was very nice. On warmer days, they offer breakfast (juice, yogurt, coffee, tea, cornetto) on the lovely terrace. Otherwise, the breakfast is brought to your room. It was a nice start to the day -- and it helped me get out early. The room was very quiet considering how close the hotel is to Piazza Santa Maria. There was also wifi Internet in the room. The staff were friendly and helpful (especially Carmen!), and someone is always available (24 hours). I look forward to staying here again.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Best Small Hotel in Rome”", "Author": "meggielein", "ReviewID": "UR22445534", "Content": "I went to Rome with a friend for a few days of sightseeing and shopping, and we stayed four nights at the Villa della Fonte. It was fantastic. The hotel only has five rooms, and the staff is wonderful. It's located near the Piazza Santa Maria in Trastevere, which is my favorite neighborhood in Rome. It's quaint, quiet, and within easy walking distance of the main tourist sights on the other side of the river. The staff brought us breakfast in our room every morning (when the weather is nice, they serve breakfast on an outdoor terrace), and you can choose what you want. I had blood-orange juice, cappucino, chocolate cornetto, and a roll with butter and jam every morning. I highly recommend this hotel. The staff could not have been friendlier and the room was clean and the price right. I will definitely stay there again the next time I'm in Rome.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Could hardly be better”", "Author": "LondonJourneyman", "ReviewID": "UR20817636", "Content": "I can only heatily endorse the overwhelmingly positive reviews on this site: it is hard to imagine how they could do things better here, and for a very reasonable price. Service is very friendly but always unobstrusive. The rooms are just what you need in a city centre hotel after a hot day's sightseeing: simple, clean, airy, fresh, with picturesque (though not far-reaching) views into a typical Trasteverean street (sienna walls, creepers, shutters, inoffensive graffiti - because you can't understand it!), like something from an operetta. The street was very quiet. The public areas of the hotel are modest - no grand staircases here! - but they are bright and sunny and beautifully maintained, and give onto a large roof terrace where breakfast is taken and two very friendly cats come and nudge at your knees (I was told they like eating bread!). Before going out in the evening I would have a glass of wine there, followed by another one in the cafe on the square, watching polite Italian kids kicking a football about against the wall of the church looked over by a kindly, frowning priest who never said anything to them. If you like a simple, elegant, fairly-priced and utterly charming hotel in an ideal location I would strongly recommend the Villa della Fonte and I would not hesitate to stay there again should I be lucky enough to visit Rome again in the future. Perfetto!", "Date": "October 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kosovo", "Title": "“Perfect place to stay in Rome!”", "Author": "OutOfAlbuquerque", "ReviewID": "UR18891103", "Content": "This is a gem of a hotel. It's perfectly situated in a lively neighborhood, but it is surprisingly quiet at the same time. The roof-top terrace for breakfast was a nice start to each day. The room was very clean, had a nice bathroom, and satellite TV. It was a great place to rest after longs days of tourism. It's also easy to walk to the main sites from the hotel.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Superb little hotel”", "Author": "knightyson", "ReviewID": "UR12319717", "Content": "Very impressed by this hotel located just off the a beautiful square, which comes alive at night with restuarants and people milling around the fountain - just as imagine Rome to be! Lovely staff who are extremely helpful - despite my poor Italian! The breakfast is also v good - served on the terrace part of which looks out to the square. Rooms are well fitted out and v clean. Location is also excellent, being a 20 minute walk along the river to the vatican and easy walking distance to many of the other sites, with the added benefit of being 5 minutes from a the major bus routes. All round you just cant fault it", "Date": "January 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“A Wonderful Little Gem!”", "Author": "Dewtrell", "ReviewID": "UR12305714", "Content": "When I was planning my trip through Italy I had the most difficult time choosing a hotel in Rome. While I thought traveling off season would provide better rates, I was surely mistaken so I was a bit defeated in the idea of paying upwards of $200 a night for a not so great hotel in Rome, particularly when I booked a top 4-star hotel in Nice, France. Needless to say, I read a review about this B&B from another poster and booked it right away. The rate I received was decent; it averaged just under $150 per night and I thought that was great considering the area. We wanted to be close to central Rome but still wanted a neighborhood type feel with many restaurants within walking distance. Villa della Fonte was the perfect fit, although it will not work for everybody. While this is not a B&B, it is not a hotel either, it's something in-between. So, the quarters are close, don't take large pieces of luggage becuase you'll have a hard time with the narrow staircase. And the rooms are a decent size but still small. Villa della Fonte is located right off Piazza Santa Maria. Be mindful, some cabs will drop you off just outside of Piazza Santa Maria, I guess cars are not allowed, although we did see a couple a few times. It was by pure luck that I choose the right street to walk down, so we had no problem finding the hotel. So, keep in mind, either get dropped right near the Piazza or walk to the Piazza. You'll see the Santa Maria church, diagnoally there is a cafe (can't remember the name), the hotel is right around the corner, there is a sushi restaurant right before you hit Villa della Fonte. You will have to ring the front desk to open the door, and you'll need to leave your key each time you leave the establishment. We never encountered a problem of the front desk clerk not being there. As mentioned before, the staircase is very narrow but the rooms are nice and clean. The bathroom was rather larger and we had zero problems with noise from the Piazza, but we did hear noise within the establishment. It was quiet for the most part except in the morning, you really can hear everything in the morning, so no sleeping in. The bed happened to be the best bed we slept in throughout our trip, even better than the hotel in Nice. Overall, we were pleased with our choice and I would recommend it for a couple or single traveler.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Luis Obispo, California", "Title": "“Great Location”", "Author": "michaelmelton1", "ReviewID": "UR11226213", "Content": "This hotel is located in a great part of Rome called Trastavere. The hotel is surrounded by great cafes and restaurants. You can spend the day roaming the streets of Trastavere, or take a short walk over the river to Campo dei Fiori for some good people watching and amazing baked goods. If you want a hotel that is perfect for a relaxed, cafe frequenting trip to rome, this is the hotel for you", "Date": "December 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "burntwood", "Title": "“little oasis in trastavere”", "Author": "annandronBurntwood", "ReviewID": "UR10564801", "Content": "my friend and i stayed 5 nights at the villa della fonte in september. The hotel was spotlessly clean and our room was spacious and comfortable.The location is brilliant for all the major sights especially at night with so many bars and restaurants close by . We also felt very safe at night being two ladies on our own.We would highly recomend this hotel and would stay there again", "Date": "November 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Stay”", "Author": "rcb-au", "ReviewID": "UR8754644", "Content": "We stayed here for 5 nights and found the Villa della Fonte to be better than we had expected. The room was quite a good size and the beds very comfortable. The bathroom was a reasonable size and very clean. The hotel staff were very helpfull and our room was cleaned thoroughly every day. As the hotel is situated virtualy on the Plazza Sants Marie we were a bit concerned about the noise, however once the windows were shut there is little or no noise. The major attractions of Rome are within 15-20 min walking distance and we had little trouble finding them. We would certainly stay here again and would highly recommend the Villa della Fonte", "Date": "September 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect place to stay in Rome!”", "Author": "tripc", "ReviewID": "UR8485178", "Content": "I loved the Villa Della Fonte! Located in Trastevere, off of the Piazza Santa Maria, the location is ideal. While Trastevere is a bit far from some sights in Rome, it is a great way to feel like you're part of a neighborhood and the nightlife is never wanting. Restaurants are spectacular and reasonably priced. As for the hotel, I had a single room, which was large and very clean. Every single person who works at the hotel is nice and will talk to you about where to go, what to do, etc. Rarely have I encountered such a helpful and friendly hotel staff. I felt like I was part of their little \"family\" after 6 nights. Breakfast is included as well--coffee, juice, croissant...on a beautiful terrace. The street is quiet, but only a block away from an extremely active nightlife. My only complaint would be that the air conditioning isn't as cool as it could be, but the other attributes of the hotel more than made up for this small defect. I will definitely stay there again the next time I am in Rome! FYI, I booked the hotel through the lonely planet website and it required a 10% deposit.", "Date": "August 23, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "chicago", "Title": "“just right”", "Author": "artist-travelor", "ReviewID": "UR8267866", "Content": "This a very special place and a real haven after a day of walking around Rome. The rooms were reasonable size and tastefully decorated. Very clean not at all stuffy feeling. We found it very easy to walk to many of the sights. The staff was very helpful with directions. We walked almost everywhere but did take a cab from the other side of the Tiber to the Villa Borghese which ran around 7 Euro's. On return from our outings we found Villa della Fonte's well air conditioned room and terrace were welcoming places to relax, we often took a break between sight seeing and dinner with a glass of wine or beer from mini fridge. While other reviews mentioned the noise from the piazza we did not find it a problem, but our windows were closed at night because of the air conditioning.This could be an issue in mid temperature nights as the area is quite busy even at 2 am. But then again maybe you want a geleto before you go to bed and one can easily be had just a short walk from this guest house.", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Aylesbury", "Title": "“Fantastic hotel”", "Author": "Dhonidoe", "ReviewID": "UR8176674", "Content": "This hotel was absolutely perfect for our 4 nights in Rome in early July. The rooms were very clean and large with a/c, mini bar, hairdryer, satellite TV and a full bathroom. We chose what we wanted for breakfast the evening before and it was delivered at our specified time on the lovely rooftop terrace the next morning. There was a choice of croissants, cereal, bread rolls, yoghurt, juice, coffee or tea - you could have everything if you wanted. As there were only 5 rooms, personal service was guaranteed and the staff were always polite and cheerful and very helpful with directions. The location was right on the Piazza Santa Maria which was full of restaurants and shops. It had a great buzzy atmosphere. Most major sights were about 20-25 minutes walk away but there were numerous trams and buses which went to Trastevere. I would certainly recommend this hotel and would definitely stay there again.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Lovely stay in Trastevere”", "Author": "MindyDeanne", "ReviewID": "UR7636449", "Content": "You must go to Rome, and when you go to Rome, you must stay in Trastevere. Trastevere is the Rome you’ve come to see. In Trastevere, a small hotel, Villa della Fonte, will not disappoint. Located right off the Santa Maria en Trastevere, Villa della Fonte is a prime location near to great restaurants, fun nightlife, quirky stores, yummy gelato, and all the small, cobblestone lanes your heart could desire. It is within walking distance of the Roman piazzas…Piazza Navona, Piazza de Pantheon, Campo dei Fiori, San Pietro, and though a small trek to the Trevi and the Spanish Steps, it is doable, and the public transportation is affordable, and close to the hotel. My husband and I first stayed at the Villa della Fonte in April 2005 and again this past April 2007. Villa della Fonte is family-run by Simona and her mother, both as kind and helpful as we remembered. It is a small hotel with 5 basic and clean rooms, furnished with satellite TV, and ensuite bathrooms. This past trip we stayed in a room with a double bed and a large bathroom. The prior trip we stayed in a room with 2 twin beds and a much smaller bathroom. My husband thought the beds were a little hard and said he didn’t sleep very well, but I slept just fine. My favorite part of this hotel is the delicious breakfast served either in your room or on a gorgeous sun-filled patio. I have never eaten a chocolate croissant more delicious than the ones I ate there. I love Villa della Fonte and have beautiful memories from both my stays there and hope to make this hotel the place I stay when I travel to Rome.", "Date": "May 17, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Newcastle, UK", "Title": "“Lovely traditional Villa della Fonte”", "Author": "FS&JP", "ReviewID": "UR5791899", "Content": "We stayed at the Villa Della Fonte for 4 nights in September and it was perfect. It is situated next to the Piazza Santa Maria in lovely Trastevere. The rooms are really clean with traditional wooden ceilings, with a/c and a mini bar. The Trastevere area is a great place to be at night and much cheaper to eat/drink than in the Historic Centre. The cobbled alleys are lined with cafes and restuarants - try one of the tourist menus - great value for money and the food is supurb!! We walked everywhere from Villa Della Fonte, to all of the main sites, although our legs did ache by the end of the trip! Regarding taxis to and from Ciampiano airport, we were a bit confused as we were charged 55 euros going and 26 euros coming back!! All in all a great hotel, especially breakfast in the roof top terrace each morning!", "Date": "September 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice hotel - great neighborhood”", "Author": "JonKMontreal_Canada", "ReviewID": "UR4568411", "Content": "We stayed at the Villa Della Fonte for three nights in Feb of 2006. It wasn't our first time in Rome and we were interested in seeing what the more \"authentic\" neighborhood of Trastevere might be like and the Villa Del Fonte looked right for the job. And it was. It almost defines \"small, charming, hotel.\" People who work there are quite nice, very helpful and always in evidence. The hotel is very small but looks to have been renovated in the last year of so with beautiful floors, good windows, beds, shower etc. Our room had high ceilings, a wooden roof and some nice touches. It was small, but that's what you get in Europe, mostly. Only drawback was sound - Friday and Saturday night when it's not cold and/or raining people gather in the nearby Piazza St. Maria del Trastevere (a great spot with a wonderful church) and they walk past the hotel right up until 3 in the morning. The windows are double glazed but you can hear them talking on the little street. For those who pack ear-plugs this is no big problem. For those who want pristine, soundless nights in Rome then you must find a hotel and get an inner room. Or spend a fortune and live high up. In short - we liked the hotel and would recommend it. Jon and Leslie - Montreal, Canada.", "Date": "March 2, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cleveland Heights, Ohio", "Title": "“Absolutely fabulous!”", "Author": "wendygrace", "ReviewID": "UR4390084", "Content": "My husband and I stayed at Villa della Fonte off Piazza de Santa Maria in Trastevere for 5 nights in mid-January. We absolutely loved the place. We tend to be fairly aggressive sight-seers, with lots on every day's agenda, so it was a delight to have a place as clean and comfortable to recooperate in while planning the next day's excursions. The staff were polite and friendly, with fairly good English, and the room was all that we expected and more. Since it was winter, and too cold for breakfast on the terrace, we were served our choice of breakfast in our room every morning - heaven! The bathroom was well appointed, and the bed was large and comfortable. The only downside is that, as other travelers have noted, the crowd in the piazza can be very loud at times, but it being winter, most of the noise was done by midnight. The color of Trastevere was worth a little noise one night. When we go back to Rome, we will be going back to Villa della Fonte.", "Date": "January 26, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "newcastle tyne and wear", "Title": "“Noisy central heating”", "Author": "A TripAdvisor Member", "ReviewID": "UR4365425", "Content": "Found details of this small Hotel in the Rough Guide to Rome .Staff were friendly and recommended and booked an excellent restaurnt for us. We stayed 4 nights in early January 2006 .However the central heating in our room [5] was very noisy ,it appeared to have air locked and gurgled very loudly to the extend that our sleep was very disturbed.This spoiled an otherwise enjoyable break .There was not another room available for us to move to and though the staff accepted there was a problem nothing was done to sort it .It was suggested we purchase ear plugs !", "Date": "January 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Oakland, California", "Title": "“Really delightful”", "Author": "A TripAdvisor Member", "ReviewID": "UR4074112", "Content": "Couldn't be more perfectly located, just off the Piazza Santa Maria in Trastevere. The room was very attractive, the bed as \"heavenly\" as any at a Westin. Even though there is noise in the small street outside, the windows tone it down well, and we slept just fine. The real treat here is the staff, pleasant, available, and welcoming. Opera buff Teegan gave us great restaurant recommendations. The Villa Fonte is small enough that the owner's delightful concept permeates its every aspect. We will certainly hope to stay here again when we are next in Rome.", "Date": "October 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“A little Gem in Trastevere”", "Author": "A TripAdvisor Member", "ReviewID": "UR3498048", "Content": "We stayed one night at Villa Della Fonte (our only night in Rome), and consider it a good value for this area. The staff at this family-run small hotel was friendly and helpful. Both desk clerks during our stay spoke English well. Our room was spacious and very clean, with a large modern bathroom. The rooftop terrace was great for continental breakfast. One BIG note of caution if you are planning a stay involving a weekend. Trastevere is party-central, and with the hotel's location just off the busy Piazza Santa Maria, the noise you hear from your room is loud and continues well into the morning hours. There are two restaurants with outdoor tables in the narrow street directly below the hotel windows. As non-smokers, we were also bothered by cigarette smoke filtering into our window from time to time from the patrons below. If you plan to eat dinner in this area, learn from our experience and ask for recommendations at the front desk or if you want to stroll and find someplace appealing as we did, make 2 quick observations before you commit yourself to a table. 1)If they have a fixed price tourist menu option, go elsewhere. 2)Are the wait staff scurrying about? If so, they may be churning over tables of tourists as quickly as possible. In both cases, your chances of lingering over a finely crafted meal are much less. We chose poorly, and had a rushed meal of mediocre food, even though the outdoor setting was pretty.", "Date": "May 24, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“A lovely little hotel”", "Author": "Nono-London", "ReviewID": "UR3423950", "Content": "We stayed at the villa della fonte last weekend. It was a very lovely, clean, farily priced hotel, with excellent service. The area is very fun with loads of bars and restaurants. The only slight downside was that you can hear the people partying in the square on Saturday nights - not so good if you are tired after a hard days walking!", "Date": "April 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Liverpool, England", "Title": "“Worth the price just for the daily breakfast in bed”", "Author": "Nezzerus", "ReviewID": "UR3199862", "Content": "We stayed four nights in the Villa della Fonte - a bit unsettling on arrival, given the graffiti-covered walls and the fact that you have to ring a bell to gain access, but once inside it's a very friendly, comfortable place, and incredibly quiet given the fact that it overlooks the noisy heart of Trastevere, Piazza Santa Maria. Apart from the excellent location, the best thing about the hotel was the breakfasts - served on the terrace in the summer I believe, but brought up to your room in the winter, which made for a lovely, relaxed start to the day. The room itself was warm and well kept, with a clean and modern bathroom, and the service was impeccable - on Valentines' Day, a little bag of heart shaped chocolates was even left in the room for us!", "Date": "February 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Savannah, GA", "Title": "“Enjoyable Experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR2320406", "Content": "I searched the web for affordable air conditioned accomodations in Trestevere, and the Villa della Fonte is it! My sister and I stayed 4 nights July 2004. The room and amenities were as they were promised. One desk worker in particular was an excellent help in recomending restaurants and general info on Rome. I would definately return to this establishment. The hotel's own web site villafonte has the best description of how to find the place.", "Date": "July 25, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great spot in Trastevere”", "Author": "fredbram", "ReviewID": "UR2218642", "Content": "We stayed only one night in this tiny hotel just off of Piazza Santa Maria en Trastevere, on the way from Umbria to the airport the next morning. Very nice and helpful staff, Simona has pretty good english also. The location is excellent--right in the heart of Trastevere, but easy walking distance to Piazza Navona and the historic center. The room was clean, well kept, comfortable bed, excellent shower. And the price is very reasonable for Rome. Will definitely use it again.", "Date": "June 23, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Monterey CA", "Title": "“Wonderful experience in Trastevere”", "Author": "CharlieMontereyCA", "ReviewID": "UR2187902", "Content": "My daughter and I stayed here for 8 nights and it was fantastic. The staff is so helpful and charming. The rooms are very clean, especially since there is no smoking allowed. Breakfast on the terrace is quite nice; if you want fresh fruit, there is an open air market 2 blocks away. Also there is air-conditioning, which is very important since the lively Trastevere area can be extremely noisy into the early morning hours. You can walk everywhere from this central location, and you're surrounded by restaurants and bars. I wouldn't hesitate to stay here again.", "Date": "June 14, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wonderful small hotel...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2132570", "Content": "My husband and I just returned from a one week trip to Rome (5/15-5/22). This is a small but terrific hotel. Our room was small, but nicely decorated and had an en-suite bathroom. The hotel was just redone in 2000 so everything is new. They have a lovely terrace where they serve breakfast every morning. Breakfast is included in the pricing. The front desk is open 24hrs a day, so you can have all of your questions answered. The location is terrific!! We walked everywhere from the Vatican to the Piazza Navona. No problem. The Trastevere is the best place to be at night, it is all resturaunts, bars, wine bars, and people watching. I would suggest this hotel to younger singles or couples, the walking might be too much for some, and it is a busy area at night. Also, this is not the most touristy area, so most people speak little English. We don't speak Italian, but we got by ok. One other thing, no cars can drive down the street of the hotel, so you have to get dropped off or picked up by taxi a few short blocks away. We found it helpful to have the phone number for the taxi driver to call the hotel directly to get directions. Have fun in Rome, Ciao!!", "Date": "May 31, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Betws-y-Coed, United Kingdom", "Title": "“trastevere - the place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR1878795", "Content": "fab little guest house that was welcoming and spotlessly clean. rooms are nice, beds are really confortable and the power shower a dream!. walked EVERYWHERE from here and only had to take a bus when we had our luggage on the way home. Trastevere is a great place to stay, with loads of little bars and restaurants down a maze of cobbled streets.", "Date": "May 6, 2004"}], "HotelInfo": {"Name": "Villa della Fonte Guest House", "HotelURL": "/ShowUserReviews-g187791-d292087-Reviews-Villa_della_Fonte_Guest_House-Rome_Lazio.html", "Price": "$158 - $224*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via della Fonte d'Olio 8</span> | <span class=\"extended-address\">Trastevere</span>, <span class=\"locality\"><span property=\"v:postal-code\">00153</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "292087", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d1/92/f4/villa-della-fonte-guest.jpg"}}