{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Location": "4"}, "AuthorLocation": "Coquitlam, BC", "Title": "“A better budget property worth the stay”", "Author": "RobCoquitlam_BC", "ReviewID": "UR126660781", "Content": "We had planned a 12 day vacation in Arizona /Nevada and normally stay in budget motels like Super 8 or Days Inn. They are affordable and usually clean and they have a loyalty program through the Wyndham chain that encourages return stays. This trip we pre-booked most of our motels through the Wyndham website and were very pleased with the one that we stayed at in Las Vegas. It was a newly renovated property and new member of the Super 8 chain. It was freshly painted and very obviously clean. The rooms were a cut above the usual budget motel with their headboard and new linens. Even the way the beds were made up, looked more like a luxury hotel rather than just a budget. And the price was the lowest of the Wyndham chains. We changed our plans on our trip and came back to Las Vegas early and had to find a motel again for our last night. We returned to the same location and they extended the same 20% off when paid in advance price that we had booked on-line. Comments: Pros • Fresh and clean property • Staff that we dealt with were personable and good at their jobs • Very well priced • A certain higher level from the staff and property Cons • No fridge or coffee maker in the room Definitely a budget property that I can recommend and not, “would return to,” we actually did return to it……. and the price is the best of the other Wyndham properties. It is really, as the saying is, “a no brainer” Just a note to comment on our stay in the Super 8 in Las Vegas. It is newly renovated and new member of the Wyndham chain and we booked it off the Wyndham website sight unseen, of course. It was hard to find because they are apparently waiting approval for their new sign but what a surprise being there. It is obviously being managed by someone with a higher than average …..something…. perhaps professionalism. The property is clean because it is new but the rooms/beds were made up a cut above what we expected and have experienced in other Super 8 properties. The staff were professional and personable and they made it a good experience which sometimes can be lacking especially in a budget motel.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“super 8 super vacation”", "Author": "leon s", "ReviewID": "UR124979616", "Content": "me and my family stayed in for 3 nigth and 4 days the hotel crew was really cool and profesional help me with all my family needs and always were available to us truly nice place and will defenetly will be back thanks guys Leon .s miami", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Super 8, Super Place”", "Author": "Gila L", "ReviewID": "UR123816838", "Content": "In the last minute I found this new Super 8 on Las Vegas Blvd, Great place to stay for the $$$ Very Clean in just minute from the strip. I will go their again.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California, United States", "Title": "“family trip to las vegas”", "Author": "573CMORA", "ReviewID": "UR123282452", "Content": "Stayed for one week on a family trip was a great place to stay, clean, great service, everything is walking distance and the price was excellent Definitely we are thinking of make it our place to stay in las vegas...", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Value for money weekly rate”", "Author": "MrsBubbly", "ReviewID": "UR121506963", "Content": "I have stayed in this hotel for 8 nights. I really like this hotel as it is clean and newly renovated. Some minor complains like toilet can't be flush, bad internet connection, balcony door can't be locked, TV not clear and noisy phone line but they were all fixed immediately. The single queen size bedroom only provides basic needs, no microwave, kettle, coffee maker nor fridge. Hence, it's not convenient if you want to make a hot drink. Their weekly rate of $200 inc tax is very reasonable. However, I am moving out tomorrow as I do not want to pay $328 for 30/12-31/12 which is a New Year Eve weekend. During that weekend, their weekly rate does not apply. I would rather stay in other weekly apartments.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“WOW WOW WOW!”", "Author": "moisce b", "ReviewID": "UR120880318", "Content": "What an amazing experience! i stayed at the continental for a week and i had the most amazing time! The hotel is right next to everything and walking distance to all the major attractions etc... you can't beat the price! The rooms are extremely clean and the service is amazing. I will definitely recommend this place to anyone who wants to go to Vegas and not spend a fortune with Vallet, resort fees etc... Thanks Continental suites! i will be back!!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“home sweet home”", "Author": "Janessa s", "ReviewID": "UR120673788", "Content": "i went to vegas for my twenty first birthday and halloween and it was the best birthday i ever had and staying at this hotel made it the best. When i first got there i was a little surprised at how it had looked but then i found out they have only been open for three months. I walked into the room and it was pretty nice. You can definatley tell they were up grading everything slowly but surely. After one night with a few of my friends it was okay, but then they left me in vegas by my self. the next day i met one of the hotel owners. He realized i was in a jam. He made me feel at home and helped me out as much as he can. i met a few other people that worked at the hotel like a cleaning lady and one of the clerks. they were really nice. My point is i felt at home. yeah the area is not the best and the hotel is not at its highest peak but i will deffinatley stay there every time i go to vegas for now on. its right next to a wedding chappel so they try and keep the weidos away cuz they they want there guests to feel at home. I deffinatley reccomend this hotel mostly cuz its a great price and great people. Why would you spend all this money on a hotel in vegas when you go to vegas to get drunk and have fun.NOT TO STAY IN YOUR HOTEL!!! i was barely in my room,cuz i was out haveing fun.when i was in there i was sleeping, the beds are great. i love that all rooms are non smoking, but most of the rooms have huge balconys. its very close to the stratosphere and its on las vegas blvd. on the strip. i hope you take my word for it. STAY AT THE HOTEL ITS AMAZINGLY AWESOME!!!", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“GOOD FOR YOUR MONEY”", "Author": "abc209", "ReviewID": "UR120604442", "Content": "The newer renovated room gave me ample of room with very good service. excelllent value for the money and friendly staff at the counter. Transit bus that takes me to downtown Freemont and going the opposite direction to the Strips. Also there is enough parking when I rented a car for a week. I would stay there again definitely.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Ok Value”", "Author": "FLQ0024", "ReviewID": "UR120376423", "Content": "I picked this hotel since I didn't want to pay ridiculous prices for a Saturday night on the strip. So I booked here for one night. The location is OK but the parking lot is horrendous. It's right beside a wedding chapel which may be a plus for a few. Now the room showed signs of renovations and age. The carpet was new but the bed clearly wasn't. I think it was a double bed and not even attached to the headboard. No bed skirt etc. you can see that in my pics also the water pressure and the hot/cold seemed to be off. I had a 3rd floor room. I didn't notice any issue with noise. Continental breakfast is nothing special at all. Just basic enough for them to sell it as a feature. I do believe that most of these 5 stars were written by the owners this place is in no way deserving of 5 stars. With that said you you need a quick night with no frills, you'll be ok here.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mount Shasta, California", "Title": "“Great time during \"Halloween\"!”", "Author": "SSM32755", "ReviewID": "UR120305616", "Content": "Prices were excellent and the rooms are very spacious, clean, & comfortable. On our three night stay the staff was more than helpful & friendly with information to places on the strip and events going on. Excellent customer service! My friends and I will be returning for another trip and staying here. Thanks so much for a wonderful weekend.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Not for passing-by visitors”", "Author": "fiddler_dan", "ReviewID": "UR120275053", "Content": "It looks like the other reviews for this inn are written by visitors staying in Las Vegas as their primary destination. If you have a car and you just travel through Las Vegas and won't make use of The Strip proximity, go rather somewhere else, probably to the airport area or to Henderson for nicer hotels in the same price range. Pros: the check-in agent gave us a room at the more quiet end of the building after requested. The bathroom was quite ok. Cons: The building is old and worn-out. The door lock was damaged and we were unable to close the door properly. Very old and dirty carpets and furniture. The neighbourhood is anything but nice and it doesn't make you feel safe. The breakfast room is tiny for a 150-room hotel however you won't mind anyway as there is rather nothing decent to eat for breakfast.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best place for the money”", "Author": "Eli879865", "ReviewID": "UR120217126", "Content": "We stayed there on 11-2 for 2 nights it was cheap clean and in the best location in between freemont and the strip. Free brackfast Internet cable. \"what else can you ask? for $49, we were verry skeptical about it because the price and some reviews complaining about brackfast? What are people thinking to them self? $49 it is by far the best place in Vegas that we stayed for the price.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Lower quality than Red Roof Inns, ok for one or two nights”", "Author": "Pretty_Kitty_Ottawa", "ReviewID": "UR120163825", "Content": "We were planning our trip to Las Vegas a few weeks ago, and noticed that prices were skyrocketing on the third and fourth days of our stay. We checked out Tripadvisor, our trusted source, and found the Continental Suites, at the time sitting at #9 for all hotels in Las Vegas. At $29 per night for 2 nights, and $49 per night for the other two, we figured we would take a chance. We've been to Las Vegas a half dozen times before, and never went the \"cheapest hotel we could find\" route, so we thought we'd experiment. Pros: We had booked a balcony room, and ours overlooked the chapel next door, so it was entertaining to watch the weddings, especially on Halloween. We also asked for and got a fridge for our entire stay, so that was good. Parking was never a problem, it was available on both sides of the building. Free internet was a bonus in this town that is notorious for charging for it all along the strip. Cons: Overall the hotel is a bit run down with stained carpets in the hallway and a non-functioning ice machine (not that I was going to get any anyway). The towels are hit and miss, the tv only has about a dozen channels, and the bed is not at all comfortable. I realized after this trip that I really do need a few more comforts when I travel, and a nice bed is at the top of my list. We also skipped the breakfast. I personally would not choose to stay here again, but I can't completely bash the place at $29 and $49 per night. The reviewers giving this place 5 out of 5 are a bit overzealous, but I wouldn't give it a 1 out of 5 either. You get what you pay for, know that going in.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glendale", "Title": "“totally worth the price and a great stay”", "Author": "Arpi E", "ReviewID": "UR120122563", "Content": "the place was very clean, the staff was very friendly. For the money spent, it was totally worth it. I recommend others to stay at this hotel because i enjoyed my stay for sure. The staff was really nice and friendly. Will stay here again for sure.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Clean, OK location, cheap”", "Author": "LHO39", "ReviewID": "UR120026191", "Content": "Three nights (Halloween weekend - a hoot) in one of the third floor balcony rooms overlooking the Viva Las Vegas wedding chapel, entertaining in its own right, or rite. $60 per night total for Sat, Sun, Mon. Bed, bath and beyond all good. Perfectly clean. Good office, good attentive staff. WiFi. Breakfast poor, cereal, toast, coffee. That's it. No fridge. No microwave. No coffee pot. Small but OK size room. From here you can walk about a mile to Fremont Street (highly recommended for ambiance and town square party feel). Prefer the strip? You can easily walk to the north end of the strip for shows and gawking. Next week the weekday price is $45 total. This is a super deal so we will come back for our last two nights in Vegas.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“OKIE DOKIE”", "Author": "Dan S", "ReviewID": "UR119815463", "Content": "Based on our experience I would simply say that the location is great, the service is great, and you really get a good bargain at this hotel. The MAIN DOWNSIDE (and you have been warned) is the \"Free Continental Breakfast\" they offer. Its almost non-existent, they only have 3 things on a little table. Dry cereal, milk, and a few pcs of bread with optional jam.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "suffolk, UK", "Title": "“Great value and downtown experience!”", "Author": "millieboo", "ReviewID": "UR119512120", "Content": "The staff were faultless and couldn't do enough to help. We found the area fine, with a view of the Viva Las Vegas wedding chapel quite a bonus. The area was safe and comfortable to walk around if you're confident and streetwise and don't mind seeing some of the gutsier side of Vegas, but maybe not if your expecting Vegas Strip luxury. We much preferred downtown and the Freemont experience was a 15minute walk away and we felt safe walking this at anytime of the day or night. The value for money, staff and cleanliness were all superb, be prepared for all night music from the tattoo parlour over the road and it would of been nice to have coffee making facitlites in the room. Breakfast is fine, but get there early, they have usually run out of butter and sugar by 8.30am, and they don't get replaced. Muffins are only vaialable on a Saturday morning, so enjoy them while you can. We will definately stay again and can't wait to go back!!! You really need a room with a balcony though to truly appreciate the downtown atmospher, and yes there is music all night, but for us that just added to our Vegas experience. Total bargain and superb customer service, faultless.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“I had fun”", "Author": "dan h", "ReviewID": "UR119467609", "Content": "I had a great time, my friend got married next door and we had a great party! thank you continental", "Date": "October 19, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“dissapointing!”", "Author": "Imgelem", "ReviewID": "UR119420603", "Content": "It is not really as the other reviewers described. We were very disappointed! It was loud! There is a tattoo place across the street and they don't stop playing their heavy metal music 24/7! The environment was horrible, we felt like we came to a ghetto neighborhood and we were about to get jumped in. I thought I would come back from the ice machine with a new prison tattoo. Either way, we ended up leaving our room in the middle of the night to find another hotel. The receptionist was nice and he gave us a full refund. However if you are looking for a \"nice\" place I do not recommend this hotel.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "a", "Title": "“Overwhelmingly disappointed”", "Author": "Mommy_AB", "ReviewID": "UR119377847", "Content": "Where do I begin? Well, we were first attracted to this hotel because of the price and the fact that it was rated #9 out of almost 300 hotels in Las Vegas. First of all, we should have realized that with only 20 reviews, the management probably wrote them all to bring in business. After reading the reviews and then staying there, I'm thinking that they're either dilusional or they're talking about a different hotel. The prices on tripadvisor were accurate but there is NO WAY this hotel should be rated #9. It was so gross. The towels and washcloths had multiple long black hairs in them. We asked for an extra pillow and they brought us a dirty/smelly one. The bathroom smelled like a port-a-potty. The carpet looked pretty clean but after I took a shower and walked to my bed, my feet were dirty again. When the people in the room above us came back for the night, they were walking around and talking to each other. The floors creaked with every step they took and we heard every word they said. They weren't being ridiculously loud, the floors were just that thin. It kept me awake for a couple hours. The parking lot was TINY - both the number of parking spots as well as the spots themselves - they were so close together that we could hardly get out of our car without scratching the ones on either side of us. Adjacent to the parking lot was a vacant lot full of garbage dumps that were overflowing with trash. We went to get some ice from the ice machine and there was a homeless guy living in one of the stairwells. There were prostitutes and drug dealers on the street right outside. Are you getting the picture? It just had an overall creepy, dirty feeling. My poor little 5 year old niece was scared out of her mind and I didn't blame her one bit. Call me spoiled but I will never stay in a place like that again.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dinorubin", "Title": "“Good, clean, convenient”", "Author": "dinorubin", "ReviewID": "UR119162951", "Content": "I stayed at the Continental Suites for an overnight. I was attracted by their very reasonable rates and I was not interested in staying in a mega hotel/casino. Continental Suites was just what I was looking for. Clean, cheap, convenient, plenty of parking and it seemed recently renovated. Will stay again!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Best little secret on the Blvd,”", "Author": "Eli F", "ReviewID": "UR119136871", "Content": "This Great little Hotel has it all except gambling. Its located minutes away from all the happenings, yet its very quite. it was recently totally renovated with some great upgrades, Its very clean and the stuff is very friendly. you cant beat the price for what you get.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Riverside, Ca", "Title": "“Parking awful but very clean rooms”", "Author": "rickiestrada", "ReviewID": "UR119126772", "Content": "It was a very clean room and the price was excellent but there is not enough parking space and I had to park in a vacant lot on dirt and rocks that was the only thing that would stop me from coming back", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“great hotel with great prices”", "Author": "jhon g", "ReviewID": "UR119099402", "Content": "this is a great hotel to stay at. i came with 2 of my friends and we had a great time over here, the price was low, and the rooms were very clean. the staff was really nice, and i will defiantly come back again! strongly recommend :)", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“My Hotel stay”", "Author": "lita y", "ReviewID": "UR119046837", "Content": "My business trip to Las Vegas was great,I stayed at the Continental Suites, the staff is friendly and polite, the rooms are very clean, I specially love that is nice and quite. I had a good night sleep.Also is very close to the strip. I would strongly recommend that if your planing your next trip, to come and stay at the Continental suites.,", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great hotel & Prices”", "Author": "Jesse S", "ReviewID": "UR119030092", "Content": "Stayed in room with two beds it was nice and clean, hotel staff is friendly & helpful with affordable prices, enjoyed my visit to Las Vegas. I will stay here again next time and recommend to friends.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "sherman oaks", "Title": "“Great hotel on the strip”", "Author": "morannp", "ReviewID": "UR118950940", "Content": "This hotel has big rooms that are newly remodeled and clean. I had to write a review for this hotel because when I was looking for a place to stay in Vegas I had a hard time finding something good in my price range and close to the center of the strip. I was surprised that you can get such a nice intimate hotel for such a low price, and it is on the strip minutes away from the Wynn and Bellagio. It has all the necessities in the room, and the people working in the front (especially Lena) are great! For this price I say that it is definitely worth it to stay!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Clean, Inexpensive, friendly staff and greatly convenient”", "Author": "Sam B", "ReviewID": "UR118908674", "Content": "My wife and I wanted to stay on the strip close to downtown Las Vegas. We found Continental Suites. We were quite impressed. The hotel was remodeled and everything was new. The price was right, and on top of that we didn't have to pay for the internet use. We stayed 3 pleasant nights. The staff of the hotel was courteous and helpful. I definitely would recommend this place because it is affordable and clean, and you get a free breakfast.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chatsworth", "Title": "“Great value!”", "Author": "Al G", "ReviewID": "UR118859738", "Content": "You can't beat the price. Very clean place next to a charming wedding chapel. Friendly, professional service. Granite counters and a safe are definite pluses. For the price you could do a lot worse with other motels in the area. I recommend this place if your budget is tight.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“very nice good price”", "Author": "tony v", "ReviewID": "UR118741279", "Content": "it was very nice and good service ,its look like a new hotel the staff was very good and friendly. the hotel is in avery good area close to all the main things . they have very good breakfast and its free,and the rooms are very clean. evrything was working for us internet ,parking ,good food and good service. the price was very good for the service, i was realy worry befour we got ther and i was so happey when we left . overall i strongly reccomended we will be back.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“fabulous Hotel”", "Author": "shamell25", "ReviewID": "UR118658969", "Content": "first i want to say when you walk into the hotel lobby the staff is very welcoming. Me and my friends really enjoyed the hotel. the rooms were very clean and refreshing. The continental breakfast was great every morning. Its really convenient if you want easy access to downtown and the famous strip. I would recommend this hotel to all my family and friends", "Date": "September 27, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Arizona", "Title": "“Few frills but good value”", "Author": "sonia530", "ReviewID": "UR118288152", "Content": "Continental Suites is a decent basic hotel. Few frills but great value. The hotel is basic but clean. Our room looked like they had recently removed one of two beds, but left everything else in place making for an awkward arrangement. The bathroom had nice tile floor and marble counters, making it a little fancier than I was expecting. It didn't quite go with the rest of the hotel, which was so basic that their complimentary shampoo + conditioner came in foil packets like ketchup. One nice add-on: free wifi. Few hotels in the area offer free wifi, charging anywhere from $9.99 to $13.99, so this was a good perk. Nothing fancy, but it wasn't bad either. If you just need a place to sleep and shower this will suit your needs just fine at a great price. Tip: This hotel apparently just reopened under the name Continental Suites, so there's not much signage. Make sure not to blink or you'll miss it - look for the giant neon \"Viva Las Vegas Wedding Chapel\" sign and make that turn. They share a parking lot.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Fabulous Hotel, a gem in the desert”", "Author": "Esther B", "ReviewID": "UR118135099", "Content": "My family and I spent a weekend at The Continental Suites in Las Vegas. The Hotel has been beautifully renovated.The rooms were clean and well equipped. My family enjoyed the free continental breakfast that met our expectations and more. The staff was fabulous, friendly, courteous and welcoming. The staff and management was hands on and helped us with our every needs. We were able to enjoy free wifi, and free parking. I highly recommend this hotel and will bring my family back during our next trip.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Amazing price and Great hotel”", "Author": "Mickey838", "ReviewID": "UR118095364", "Content": "We were at the famous wedding chapel and we were looking for a property in the vicinity. We decided to stay at Continental Suites. We had a wonderful experience as the staff was overly friendly and professional. Moreover, the hotel itself was quaint and very nice. It was special!!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tarzana, California", "Title": "“Great Hotel”", "Author": "Leslie R", "ReviewID": "UR117460154", "Content": "I loved the hospitality of the front desk and all the employees in general. The prices were reasonable and the rooms nice and clean. It is also great that we had free breakfast every morning. It has a family environment and we are going back for the Holidays. Joan Membresa", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very clean and Friendly Staff”", "Author": "RafaelAC", "ReviewID": "UR117243731", "Content": "The rooms were very clean, from floors to sheets. The staff was friendly and helpful. Our customers loved the hotel we didn't receive one complaint. We are definitely going to book witht them again.", "Date": "August 25, 2011"}], "HotelInfo": {"Name": "Super 8 Las Vegas Blvd", "HotelURL": "/ShowUserReviews-g45963-d294800-Reviews-Super_8_Las_Vegas_Blvd-Las_Vegas_Nevada.html", "Price": "$33 - $70*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1213 S. Las Vegas Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89104</span></span> (Formerly Continental Suites)</span> </span> </address>", "HotelID": "294800", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/55/ff/06/super-8-las-vegas-blvd.jpg"}}