{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice and friendly”", "Author": "erika_thelning", "ReviewID": "UR128434071", "Content": "I highly recommend this hotel to those who want a small, personal hotel. Turkish style, perfectly situated with very nice rooms and reception. Also a small garden outside and a wonderful roof terrace where breakfast and other food i served. Very good service, lovely breakfast and very clean and reasonable prices.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“charming hotel in the tiuristik center of Istanbul”", "Author": "HistorianMoscow", "ReviewID": "UR128416950", "Content": "Just returned from 6x-days trip to Istanbu. Lived in Valide Sultan hotel. The hotel has greate position - just two minutes walk from the Topkapy entrance. In adddition there is a splendid view to Ayasophia from some roomes on the second and apparently also on the third floor (we stayed in 201 and our friends in 203). Rooms are pretty small (not easy to find place for suitcases) but very clean and look lovely. The personel is very friendly and helpful. The breakfast is agreable; besides, the view from the restoran-terrase on the top floor is fantastic, especially in evenings when Ayasophia and Blue mosk are illuminated. One can can hve lunch and dinner in hotel restorant. If not, very close is nice street with a number of restorants with local and international food. Finally, the price for the rooms is reasonable and one can make reservation and arrage transfer from aeroport via internet. It is not a luxorous hotel, but a good choice for those who came for sightseeng", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "fort lee, nj", "Title": "“Location, location and location”", "Author": "goodtravel", "ReviewID": "UR128062769", "Content": "Topkapi Palace entrance is 200 feet away. Blue Mosque is 7 minute walk. Hagia Sophia is 3 minute walk. Many (touristy) restaurants are around the corner. Third floor rooms have a gorgeous view of Hagia Sophia and Sea of Marmara. Rooftop restaurant has an additional view of Blue Mosque. The rooms are pretty, freshly painted, but very, very small (have to be creative with placing 2 suitcases). 3rd floor rooms have nicely redone bathrooms, but the 1st floor bathrooms are old. The service is with a smile, and the staff english is good.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, England, United Kingdom", "Title": "“Perfectly located, very clean, comfortable and friendly”", "Author": "PenelopeDaviesBr", "ReviewID": "UR126675987", "Content": "Just returned from a week in Istanbul where we were very well looked after by the Hotel staff. They were friendly, welcoming, efficient and amusing, and we couldn't have wished for better. The room was smallish but perfectly formed, immaculately clean and beautifully decorated, the bed was comfortable and the large shower was wonderful after a hard day's sightseeing. Breakfast was ample, tasty and most efficiently served by the delightful Rambo, and alcoholic drinks or tea were readily served at all hours by patient staff. The first time ever I've been able to get a good cup of tea abroad! The lady owner of the hotel doesn't speak English, but she is friendly and runs a very tight ship. On the one occasion where we had a disappointing night out, the staff were at great pains to compensate and to ensure that we were able to enjoy other and better entertainment. I cannot praise this hotel highly enough, and very much hope to stay there again in the future.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roma", "Title": "“Perfect location”", "Author": "Aleardor R", "ReviewID": "UR125721871", "Content": "It has the perfect location, only couple of steps away from Topkapi Palace and 2 min walking away from Hagia Sophia. The rooms are nice and clean, staff is helpfull and great breakfast :)", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good for group travel”", "Author": "macfrazzle", "ReviewID": "UR125341167", "Content": "Just returned from a 4 day stay in Istanbul. We were a large group of over 20 and the hotel accomodated us very well. We were greeted with Turkish tea on arrival and shown to our rooms. The staff were very helpful throughout our stay, especially dealing with our late at night return times and opening the bar at all hours! (although beware if asking for restaurant/shop recommendations they might recommend you to visit their friends/family restaurants instead of where you actually want to go!) I cannot comment on the booking process as this was done through our travel agent. Top floor rooms recommended for wonderful views. Rooms are small but very clean and comfortable. The hotel is not the most peaceful, being made of marble you can hear everyone walking up and down the stairs and people coming back late at night. If you're a light sleeper like me it can be disruptive (ask for a room away from the stairs) but otherwise it's not a problem.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very good hotel”", "Author": "dipi k", "ReviewID": "UR121281782", "Content": "Hotel was very good. Serkan and Okhan were excellent. They helped us a lot. Rooms were very clean. Good vÄ±ew. LocatÄ±on Ä±s perfect. I recommend thÄ±s hotel to everyone. I wÄ±ll stay here agaÄ±n.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Menorca", "Title": "“perfect”", "Author": "Isgoma", "ReviewID": "UR120669123", "Content": "Marta and me, Isidro, are a Spanish couple travelling twice a year to Istanbul for business. This last trip at the end of October 2011 we ended in Valide Sultan Konagi. Very good hotel, very good staff. Everybody very kind, Serkan, Ramazzan, Marthe the new breakfast waitress. Excellen, special mention goes to Veysel. He helped us a lot in finding good places and wholesellers. We can say he turned into our friend. He is very kind and good man. The hotel is very clean and has very good room. Breakfast at the top floor with view to the sea and Ayasofia and Bluie Mosque is maervellous. Prices a bit high compared to hotels we can find in Barcelona but that is Istanbul!!!!", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yokohama, Kanagawa, Japan", "Title": "“Brilliant Hotel”", "Author": "Brenda B", "ReviewID": "UR119645541", "Content": "I just returned from 6 nights at Hotel Valide. It's a real treasure, located just a few minutes walking form most of the sites, yet very quite and peaceful. The hotel is so well maintained and managed. Rooms may be a little small but tasteful decorated, small marble bath in my room 0 3rd floor and heated floors which were a real treat to come back to on cold and rainy days. The view from the restaurant is fantastic. But beyond that, the food is superb. Breakfasts were excellent and dinners also. The quality of the ingredients and the chef's capability is outstanding. The restaurants I tried nearby were not nearly as good. Perhaps the best point of the hotel is the staff. The head waiter in the restaurant is quite a character, makes sure you get what you want. The the hotel desk staff and other staff always went out of their way to help. They were always friendly, giving trusted information and advice. I truly enjoyed my stay at Hotel Valide, and highly recommend it to others.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Riverside, Ca", "Title": "“Good location”", "Author": "marared", "ReviewID": "UR119298671", "Content": "This hotel is in a good location and has a spectacular view from the breakfast room. Some of the staff were great, some were overattentive in a way that was a little disturbing to me as a female traveler on my own for part of my stay. The rooms are small but well maintained and clean. Breakfast was very good and the location is within a block of the Aya Sofya.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“Geat Location and Interesting Apartment”", "Author": "Paul_In_Basel", "ReviewID": "UR119101225", "Content": "We visited this hotel 10 years ago and I can vouch for the fact that the location is great. I tried to book again but they were full. But they did have an apartment I could have instead so we took it. It is in a private bulding on the 4th floor a five minute walk from the hotel (they take yor bags round and up to the aparment for you). It has a great view out over the blue mosque and we could sit at night having a drink watching the birds wheeling above the blue mosque lit by the spot lights shining up onto them. Although its an apartment they come and clean every day and we could go to the hotel for their buffet breakfast . The breakfasts are great all the usual turkish stuff with cereals and sweet things if you want them. The hotel staff are friendly and helpful. This might be a worth while option if you are a family as the apartment sleeps 5. There is no elevator so if you can't manage stairs its not for you. But it was a really good find whch we got quite by chance", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Charming setting, perfect location, GREAT service”", "Author": "David B", "ReviewID": "UR118446702", "Content": "This hotel is a gem of a boutique, family-owned and run hotel in the Sultanahmet area of Istanbul. The location, within a few hundred meters of Topkapi Palace and Hagia Sophia, could not be better. The rooms are small but charming, as one would expect in a boutique hotel which was the former residence of the Turkish Queen Mother. The staff, many of whom are family, is the most sensitive and responsive hotel staff that I can think of. The desk personnel, the restaurant staff, even the bell staff-one could never ask for better or more attentive service. The quality of the food in the restaurant, including the sumptuous, free-of-charge breakfast buffet in the lovely rooftop terrace restaurant setting, is as good as one can get in Istanbul, which is saying a great deal. I cannot say enough good things about this hotel and its personnel. I never stay anyplace in istanbul, and I am there two or three times yearly at least.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tbilisi, Georgia", "Title": "“Very nice, recommended”", "Author": "katiusha008", "ReviewID": "UR118364343", "Content": "very nice hotel with a very nice and friendly personal. Hotel has a perfect location and rooms are clean and comfortable, service is also very good. Dinning room has very nice terrace with an excellent view on Bosphor. Breakfast was good but could be better, as everyday was the same food. Hotel has an airport transfer service, even for free ( one way ). I really recommend this hotel.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Nice hotel, perfect location”", "Author": "hmarket", "ReviewID": "UR118052180", "Content": "Almost boutique hotel with nice interiours. Nice room, but quite small. This is the reason, why I rate as an average. Was nice furnished, but for dolls mainly. On a site of our room was a lift and emergency exit and also some ventilation, making noise in the night. Breakfest was little bit dull especially the salty part - 3 days the same offer - hard boiled eggs, one strange salami, some chees. Staff was friendly and communication in advance good. I got good internet rate, for desk price 160 EUR I would be disappointed. Good location with panboramatic views on Aya Sofia and Bosphor.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bradford", "Title": "“Nice hotel - would recommend-”", "Author": "Nineteen84NWO", "ReviewID": "UR115648402", "Content": "We left an awful hotel and walked around for over an hour looking for room at an inn. The manager kindly offered us an apartment that belonged to him overlooking the blue mosque. The apartment was perfect for us and very clean and he also offered us breakfast on the terrace in the mornings. Apartment is great for friends and family but perhaps not a couple looking for luxury. Breakfast was nice if a bit repetitive but hotel was very close to all the attractions, Topkapi, Blue Mosque, Hagia Sophia etc. Staff were excellent - thank God for Turkish hospitality.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“This was a perfect hotel”", "Author": "mkmcintosh", "ReviewID": "UR115543120", "Content": "This small hotel offers the mood and personal care of a traditional Turkish hotel, but with many modern conveniences. My husband and I, our daughter, and our 11-year-old grandson stayed at the Valide Sultan for 4 days. It was a perfect base for sightseeing: just a few blocks from the Topkapi palace, the Blue Mosque, and Aya Sophia, and a pleasant walk to places like the Spice Bazaar, the main covered bazaar, and several other Ottoman mosques. The neighborhood was quiet in the evenings, our rooms were clean and comfortable, with good bathroom facilities and beds, the elevator was convenient, and the owners have found interesting 19th-century decorations. Breakfast is served up on the top floor of the hotel with stunning views in three directions over the various waterways. The hotel met us at the airport and arranged for travel to our next destination. We recommend the Valide Sultan Konagi most highly.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Charming, convenience and the SERVICE is exceptional”", "Author": "sliutsc", "ReviewID": "UR115231250", "Content": "My friend and I stayed at this charming hotel in June. The location is amazing. The Topkapi Palace was right in front of the hotel. Every morning we had breakfast at its rooftop restaurant with the panoramic view of the Istanbul. The room is clean and the bed is one of the most comfortable I have slept on compared to the other hotels in this price range. The best of all, the service and its staffs were exceptional helpful. Its front desk manger, Serkan, helped us with all the questions we have and made some great recommendation that made our rest of Turkey trip a breeze and blast.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“altogether superb!”", "Author": "ermd_11", "ReviewID": "UR114990214", "Content": "This hotel is right next to the Top Kapi palace, with exceptional views of Aya Sofya, the Blue Mosque, and the Bosphorus. A beautifully renovated Ottoman building with clean, comfortable, quiet rooms furnished simply and attractively, it has a rooftop restaurant with unbeatable food at reasonable prices. Air conditioning and well-equipped en suite bathrooms combined with unusually good mattresses and linens ensure a comfortable stay. Family-owned and -operated means the staff is exceptionally helpful and kind, even by Turkish standards! Extra services such as travel assistance, ticket-bookings, and advice are readily available. This is the best hotel I've ever experienced in Istanbul, after years of visiting the city.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bandung", "Title": "“Nice bedroom even small and no balcony”", "Author": "Jodhy", "ReviewID": "UR114735126", "Content": "This hotel looks nice, semi clasic, wooden style. Friendly staff and has nice view from top floor/restaurant. The view to blue mosque, aya sofia museum, galata bridge and marmara sea. Has nice breakfast menu, only free internet coverage in the lobby, another floor wasnt coverage. This hotel doesnt have international coffee tested such as machiato, espresso or cappuchino, they have only turkish coffee and tea. But dont worry this hotel is very close to many nice restauntants that have coffee what you like (for european who coffee addicted).", "Date": "June 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland New Zealand", "Title": "“very nice Hotel excellent location”", "Author": "brentb", "ReviewID": "UR114415621", "Content": "The Hotel was booked via our Travel agent as part of a tour.We stayed 2 nights prior and 1 night after the tour. The manager met us on arrival and offered us drinks while we sorted the paperwork out.As this was late at night this was appreciated.The room was small but spotlessly clean and tidy.The only downside was that it had 2 x twin beds instead of 1 x double.The room when we got back was the same except for it had a double bed. We had dinner the first night at the restaurant and it was very good.The breakfast was included and it was excellent. Thisn hotel had location location location.A short walking distance from the major attractions and a 2 minute walk to a street full of restaurants. Overall a very good Hotel-staff was friendly and helpful but it was close to a mosque and the call to prayer was clearly audible early in the morning and late at night.But you did get used to it. Would we stay again-despite the early morning wake up yes we would", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Honest and friendly staff”", "Author": "mbayarsky", "ReviewID": "UR109096547", "Content": "The location could not be better. When we arrived the manager explained the hotel, its services as well as possible tours to us while serving tea and coffee.. I have never experienced this in another hotel. The next day one of the managers personally took us to the Grand Bazaar for the afternoon. This was not a paid for tour, it was just something that was offered. We also had the hotel arrange a tour of Istanbul. The price was in Euros and we were accidentally charged the wrong exchange rate. The hotel called us in the United States to apologize and to tell me that they would send the overcharge via Western Union. They could have kept this and be dishonest, but they did the right thing. Highly recommended.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent location”", "Author": "A TripAdvisor Member", "ReviewID": "UR108301986", "Content": "In addition to the excellent location the staff was very friendly, helpful and accommodating when we requested a room change. Included breakfast was very good. Would definitely stay there again. CQ USA", "Date": "May 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel in great location”", "Author": "clashgour", "ReviewID": "UR96115742", "Content": "You can't go wrong at the Valide Sultan Konagi. The staff were all very friendly, the room we stayed in was very comfortable albeit a little on the small side, cleaned every day with new sheets and towels and had a great view over the Bosphorus and Topkapi, plus the buffet breakfast, included in the price, was a very good start to each day. The location is ideal with the major sites of Topkapi, Aya Sophya and the Blue Mosque all a few steps from the hotel. Other major attractions such as the Grand Bazaar and the Cisterns are in easy walking distance. There are loads of places to eat and drink that will suit all pricing requirements in the area. The only downside was having to leave and even that was made easy as the hotel offers one free airport transfer as part of the deal. We will be back. ps they offer a 10% discount if you pay in cash.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfectly fine but nothing more”", "Author": "EdLondon_10", "ReviewID": "UR89148929", "Content": "First things first - this is not a 4 star hotel, or at least not by the standards applied in most major cities. It was just a little bit too basic, though it did have an LCD tv in the room. The hotel is, however, clean and the location is good if you are just in town for the sights. If you want to go out in the evenings, however, you are better staying in the Tunel part of town. If you book direct you can pick up a room for 50 Euros in the off season.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“Not bad but overbooked. Deceiving staff”", "Author": "AndrewPStevens", "ReviewID": "UR77786570", "Content": "Sink not working, no toilet paper unless asked for!!! I would not recommend this hotel because you cannot really count on it -one is in a strange country and only have this reservation and gets something totally different that what has bargained for. At first we were welcomed with the message that our double room was already given to somebody else (we got there on a friday around 22hrs because our flight was delayed and ). My husband and I were forced to accept a small twin room with two separate beds that could not be moved closer together and were promissed we would be moved in a double room the next day. The next day they said 'Sorry, no room is available yet, you will get the room tomorrow'. We were there for a romantic weekend of only three days so it didn't really matter if we got the double room only for our last night there. The reception staff were always very welcoming with a fake smile on their faces but no actual doing of what they were promising ever happened. Breakfast staff though were very welcoming and made us feel like we were in a 5 star hotel. Almost same thing for breakfast everyday.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Great location but the hotel was overbooked”", "Author": "J80-benelux", "ReviewID": "UR68269688", "Content": "The location of the hotel is magnificent. Views from the restaurant terrace are spectacular. There were however a few drawback: - The rooms are clean but very, very small - The hotel was being renovated when we arrived. The view from the windows where therefore partially blocked - When we are arrived, they tried to put us in an appartment near the Blue Mosk as the hotel was overbooked. The entrance of the appartment was a construction yard and there where shoes of fellow residents everywhere. We objected to stay here and suggested an other hotel. However no hotels were available at that time (11pm). So my brother who is 18y had to share a room with us and we were told to have an extra room in the morning and would get one room compensated. The next day, we had to ask (strongly) several times before the room was given to us. The compensation was never given.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Motherly Touch @ VALIDESULTAN”", "Author": "paymach", "ReviewID": "UR67546221", "Content": "ISTANBUL: a place to visit for all who love to be with themselves on a holiday and yet have some few adventures. Its beautiful to see so many architectural and natural wonders. Me and my friend planned this trip just three weeks in advance and we were off to go before we knew. Our stay was planned at the Hotel Validesultan, very friendly staff and Mehmat - front desk executive was very helpful. Situated in Sultanhamat area, which is a tourist area of all, it was close to the airport and centre of the city to travel any where. Having rooms with a motherly touch to their dÃ©cor. The stay was just perfect for a weeks trip. The view was perfect in the morning for breakfast on the terrace and just a lane from this hotel you find a full street buzzing with restaurants serving you some good variety of meals for the perfect evening. Hotels on Istiklal street are also recommended for young crowd, Hotel Lush is good with every room in a different layout and design, my friend recommends it atleast for one night stay. Breakfast at the hotel we were staying was awesome a good blend of raw blend of vegetables and so many options in bread. We were served fruit juices â€“ orange and wild berry â€“ tea and coffee â€“ breads (with different coatings and many different shapes and tastes, toast, etc ) boiled egg, jam, cheese spread, butter, honey â€“ dark and light, mix and watermelon marmalades, fruits, chicken and salami, raw tomato and cucumbersâ€¦.so much and we almost skipped our lunch. It was a very comfoortable and a scenic place to be in turkey.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Salisbury, United Kingdom", "Title": "“Could be so much better”", "Author": "steviecee", "ReviewID": "UR60552765", "Content": "It started to go wrong at the airport, when our guaranteed driver was not there. The hotel is ideally situated, right next to Tokapi Palace, but the staff seem to be running their own scams to extract as much cash from their customers as possible. Our room had a great bathroom, but that was all - the double bed was actually a large single, with sheets that barely covered the bed. We fell out with one of the hotel staff when we did not take up his Bosphorus tour offer, which presumably he got a 'cut' for, and the final indignity was the taxi back to the airport on our last day, booked the day before, which did not turn up. The hotel flagged down a passing taxi and got the driver to give them a tip before letting him leave with us, and I hard a really hard time getting a bill for our stay (we paid cash, presumably this did not go through the tax books?). This hotel could be so much better, it's a great location but the staff need changing - oh, and the advertised wi-fi only works in the lobby, nowhere else. Try somewhere else instead is my advice.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Connecticut, USA", "Title": "“Charming and delightful”", "Author": "JaneConnercticutUSA", "ReviewID": "UR38447777", "Content": "This is a small a hotel, centrally located in the heart of the old city within walking distance of all the tourist sites. The staff is very accomodating, friendly and helpful. English is spoken. The rooms are on the small side but very clean and comfortable with beautiful modern bathrooms and air conditioning. The top floor dining room has a wonderful view. The breakfast buffet was quite good and the waiter and waitress were terrific. The waiter will even help you with your basic spoken Turkish!", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Good Hotel: Safe, Clean,Comfortable, Well Priced, Courteous & Responsive”", "Author": "Itineranttinker", "ReviewID": "UR34602363", "Content": "I am reluctant to write this review as I travel a lot and like most experienced travelers do not want to share my \"good finds\" with others who will either be foolish or over crowd me out of accomodations when I wish to stay there. However in this case I will make an exception. First: Istanbul is a fantastic city teeming with people, music, exotic sounds and smells of terrific food. It is a moderate Islamic, very civilized and pro American place. An Adventure, immerse yourself in it! If you want the US, Club Med or Disney Land- Please Stay Home. This hotel is what a traveler's hotel should be: Small ( about 15 rooms, no pool, no daycare, no gym, just good clean and pleasant accomodations), moderately priced, centrally located( you can walk or take public transport easily to anywhere worth visiting adn the views are incredible) very responsive (they answer your questions very quickly), accomodating ( they pick you up from the airport as part of the cost of the stay and things you need done get done). Excellent staff. Small limited fare restraunt but all of the food is good and breakfast is very good. I wouldn't stay here for a three months business stay as it is an old home and the rooms are politely small but for a long weekend or a week,.......very adequate.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Not a bad Hotel”", "Author": "Sniffingmoose", "ReviewID": "UR31389800", "Content": "We stayed for a week in May 2009. There are much more good points than bad. Firstly the location in Sultanhamet (the old city) means that is in walking distance from the main tourist attractions such as the Blue Mosque, St Sophia, Basilica Cistern etc. The hotel was nicely decorated and the bedroom was comfortable. Each room has air conditioning. You get a good buffet breakfast in the rooftop Restaurant, the waiter who called himself Rambo worked hard hence you were looked after. The restaurant has a Panoramic view of the city, the sea, and the Hagia Sophia. They serve nice evening meals in the rooftop restaurant. Points to watch, the transfer from the airport (16miles) is I think too expensive at Â£20 each way making Â£40 return. You get driven at high speed through the Istanbul mad traffic the drivers dont care much about safety as our one was texting while driving! Also they do a hard sell on buying tickets for the tourist attractions. Much cheaper to go and buy your entrance ticket at the attaction. You get woken up at 4:30am when the Mosques call to prayer! But Overall I would reccomend this nice small Hotel.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great hotel”", "Author": "christyreznor02", "ReviewID": "UR20849534", "Content": "The Hotel Valide Sultan Konagi is a terrific hotel. The staff is very friendly. The location is terrific. Great views of the city from the hotel rooftop terrace.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta GA", "Title": "“Great location and staff”", "Author": "amyAtlantaGA", "ReviewID": "UR14832496", "Content": "We stayed in the Hotel Valide Sultan for three nights. We found a discount rate for this hotel through Orbitz and contacted them directly. They matched the rate (85 Euros). When we arrived the owner sat in the lobby and talked with us for a while. She encouraged people to contact her directly.This hotel looks like a fake Ottoman hotel (maybe it isn't) and is not as atmospheric as Kybele. On the other hand, the rooms are nice (though the dÃ©cor is a over the top)We had a beautiful view from our room of the Bosphorus. The rooftop restaurant was wonderful. Best views to the Bosphorus (better for instance than the Sari Konak though in the evening there is a restaurant so you can't just sit up here). Breakfast was great on the rooftop. The folks on the frontdesk were warm and friendly. We had a problem with our credit card then the front desk sorted it out for us. We definitely would stay here again. (but beware of problems with overbooking reported on Tripadvisor). The best location because it is quiet and just a short walk up to Topaki.", "Date": "April 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“good location”", "Author": "goodmiki", "ReviewID": "UR14596847", "Content": "Unfortunately our room was overbooked so they took us to another hotel for a night. They were very kind and the substitute room was very nice (even if the other hotel wasn't), but still we were not that comfortable moving around. for the rest the hotel is very nice, with a great breakfast room with a good view of the bosphorus. The room was small (as usual in Istanbul) but quiet and at walking distance of the main tourist attractions. The staff was extremely kind and made an effort to make our stay enjoyable. Print out a small map of the hotel indications, so you can show taxi drivers when you take a taxi... we found that many were asking directions along the way! There are quite a few good carpet shops around the corner (south from the hotel) dig in!", "Date": "March 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Valide Sultan good choice in Sultanahmet”", "Author": "Brooklynite718", "ReviewID": "UR14506466", "Content": "I just returned from a 5 night stay at the Valide Sultan Konagi Hotel in the Sultanahmet section of Istanbul. I recommend the hotel for its great location, incredibly nice staff and restaurant with amazing view. It is not as luxurious as its four-star rating might imply, but the rooms are definitely pretty and clean and comfortable. There is an elevator to all the floors; I know people in the forums have been curious about accessibility in Sultanahmet hotels. If walking is an issue for anyone the area is hilly. For instance the entrance to the Topkapi Palace is a one steep uphill block away and maybe three to the Hagia Sophia. The rooms don't have safes but there are individual safes behind the front desk. There is wi-fi in the lobby, but I was able to get the signal in my room... don't know it that was because I was on a lower floor. As far as the room goes, the beds are very comfortable (easy to sleep late!), there's a minibar restocked with drinks daily and the bathroom was good - standup shower, no tub, but other rooms might be different. They have complimentary airport pickup -- the friendly driver was right there on time and the ride in to the hotel was easy. They don't accept American Express.. the people who checked out before me had problems because they had reserved the room on Amex so thought the could charge the room on it. All in all it is a really nice hotel and I recommend it.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern California", "Title": "“Great care- attentive staff”", "Author": "CBD100", "ReviewID": "UR10299523", "Content": "October 10 through October 17 My wife and I were met at the airport by a driver with a car sent by the hotel. We had requested a large room, as we have stayed at the Valide Sultan in 1999 and are aware of the sizes of some of the rooms. The staff was kind and courteous in their manner, friendly and very helpful. From the lobby to our room to the roof top restaurant of the hotel the decor and furnishings are beautifully appointed. The hotel is in walking distance to all major sites (we are senior citizens). We were there for the last day of Ramadam and Eids (the following 3 day holiday). The Turkish people are just so nice. This was a lovely trip that we will long remember.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Queensland, Australia", "Title": "“Very Good accomodation”", "Author": "CeeJay55", "ReviewID": "UR10061833", "Content": "We have just returned from 2 weeks in Turkey. Staying 2 nights at the end of trip at this hotel. The hotel's location was excellent. Easy walking distance from restaurants, Blue Mosque and opposite Hagia Sophia. Fantasic views from the top floor restaurant of the Bosphorous. Breakfast was limited compared to other hotels we stayed in. The down side was the traffic noise. Overall our stay was very pleasant and the staff were friendly and helpful.", "Date": "October 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Great Location for Old City”", "Author": "Starog", "ReviewID": "UR10041504", "Content": "We stayed here in April and June 2007. Very convenient location to all major tourist attractions in Old City. Staff very helpful and friendly. Rooms comfortable. Regrettably a power failure in June caused some inconvenience but hopefully this situation has now been rectified. Rates reasonable with breakfast included. We would stay here again in the future.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "ontario canada", "Title": "“Not Great”", "Author": "feathergate", "ReviewID": "UR10030074", "Content": "I will first tell you that the people are nice and all you read are good reviews, but the people we met while we where there did not feel that way at all. They advertised a balcony, wireless internet, and other things . They had no balconies, and wireless was in the basement beside the office or in the smoky lobby. This was the error of Expedia we where told. Our room was on the third floor and above a youth hostel which was very noisy and we could not get any sleep. The noise of course rises and at 12midnight it started and ended at threee pm making it difficult to get to your complimentary breakfast. We complained and the told us they did not hear the noise. What do you do in a strange country but count the days until you can get out and that is what we did. Other travellors had the same story, nice people they would say but never again ......the room was big enough for one but we are two and we booked for two. We where there six long days. I think if we could have gotten a nights sleep we would not be writing this type of review..... I should tell you that our first room was in the basement and that is how we knew that we had wireless internet because we where beside the office.", "Date": "October 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“My Home in Istanbul”", "Author": "Turkophile", "ReviewID": "UR8381159", "Content": "The Valide Sultan Hotel is my home in Istanbul, where I have traveled 19 times in the past 7 years, and have probably spent a cumulative total of at least six months or more at the hotel. It is one of the \"special class\", or \"charming\" hotels, a converted Ottoman mansion. The location is fabulous, walkable to everywhere in Sultanahmet (the Old City,) and nearby the tram tracks as well. The staff is unbelievably wonderful and competent: friendly, courteous, solicitous and helpful. The service is outstanding. They, and the owners, have become like family. Rooms are smallish, but stylishly decorated, comfortable and clean, with cable TV and minibar, and there is an elevator. The entire hotel is well-kept-up, and drapes, upholstery and paint are new; bathrooms are modern. There is no faded tattiness here. The rooms, and the rooftop restaurant, have wonderful views, either to the east over the Bosphorus, where you can see dolphins frolicking and huge ships passing all day, and to the west a short block's length to the basilica of Aya Sofia, and the Blue Mosque. The main entrance to the Topkapi Palace is also a short block away. The breakfast buffet is superior, with a larger selection compared to other small Turkish hotels where I have stayed, and the lunch and dinner meze (hors d'oeuvres) and soups are divine. There is wireless access from the lobby. Two couples to whom I recently recommended the Valide Sultan have just returned from Turkey; they absolutely loved the hotel, where they stayed for 3 nights before their fancy Nat. Geographic Black Sea cruise adventure (which housed them at the Istanbul Hilton.) The Valide Sultan is a great experience in Turkish hospitality, for a reasonable (but not super-low-budget) price. Several travelers have mentioned that they have been transferred to other hotels. I believe this is not always due to overbooking, but to other guests who overstay their reserved time. Since the hotel is so small (only 15 rooms) it is easier, but still not correct, to transfer an incoming guest. The solution to that is to mention firmly ahead of time, with your reservation, that you absolutely must not be transferred.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great Location”", "Author": "NaliniM", "ReviewID": "UR8349817", "Content": "This was a lovely little hotel right in the heart of Sultanamet and so close to some of the great sights of Istanbul - The Blue Mosque, Ayasophia, Topkapi... The staff was exceptionally warm and friendly and helpful. Their rooftop resataurant has a fantastic view of the Bosphorous and they serve a wonderful breakfast . The hotel is located so close to the Ayasophia that you can almost reach out and touch the walls! The resatuarant scene in the vicity is very active and lively. The rooms are small and felt a bit cramped. However, we willingly traded the size for the proximity to all the places we wanted to get to. The only downside to our stay was the water situation in the hotel. Of the 5 days we stayed at Valide S, on three of the days we did not get water in the taps in the morning and had to do a bit of running around to get someone to fix it quickly. But for this problem, it was a great stay and I would recommend the hotel to other travelers.", "Date": "August 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "boston, ma", "Title": "“Great location, helpful staff, clean and modern”", "Author": "practical2007", "ReviewID": "UR8209807", "Content": "The friendly and helpful English speaking staff at the Valide Sultan made a huge difference. The location is fantastic -- the touristic areas of Aya Sofya, Blue Mosque and Topcapi are even more wonderful in the evening after all the tourists leave. Hotel was very clean and modern. Small bathrooms but perfectly acceptable.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Great Location, Super Staff”", "Author": "TechWing", "ReviewID": "UR8131175", "Content": "Our group of 10 university students/faculty spent a week at the Valide Sultan Konagi. Seemed luxurious for a study trip, it certainly was a step up from our accommodations in Germany! A few of the reasons weâ€™d go back â€“ Location â€“ proximity to Aya Sophia, Blue Mosque, Topkapi â€“ and more! And the area is very tourist friendly â€“ restaurants, grocery stores, shopsâ€¦ a comfortable neighborhood in a big city. Staff â€“ Mehmet, Marmut at the front desk â€“ and well, the staff was very accommodating â€“ I like being offered tea when I come in after a day touring! Breakfast included â€“ A must when traveling on a student budget â€“ Fruit, meat, eggs, cheeses, breads, olives and beverages all in a dining room on the top floor with a great view. We also had dinner in the restaurant â€“ good food, good service. Rooms â€“ I did mention we were on a study tour, right? The rooms seemed great to us! We used many of the services: laundry, laptop/internet, Mehmet booked a tour guide, arranged for transportation and generally took good care of us! Perfect, probably not â€“ but we didnâ€™t notice anything lacking! Each one of said we'd stay here again!", "Date": "July 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Outstanding bargain”", "Author": "Gary23", "ReviewID": "UR8129027", "Content": "My wife and I stayed for almost a week and a half in May 2007 in the Valide Sultan (broken in the middle by a short trip to Selcuk). Our experience was outstanding in every way. The staff was extraordinarily helpful, very considerate, eager to advise, and eager to please. Our arrangements were just a little unusual (because of our trip to Selcuk, we needed airport transfers on four occasions, and we also needed an additional room when our twenty-year-old son joined us part-way through our stay), but were managed almost seamlessly. There was one small oversight, as a result of confusion (my fault, not the hotelâ€™s) about my sonâ€™s arrival date. The Valide Sultan did not have a room for him for his first night, but they responded quickly and, despite its being my fault, took responsibility to remedy the situation. They arranged for a room at another, fancier hotel and provided a taxi to shuttle us back and forth. On the second night, lacking any other room, they put my son into the bridal suite! The hotelâ€™s location is ideal for visiting the major sites in Sultanahmet. It is on the same block as the Four Seasons Hotel and just a hundred yards or so from the Ayasofya and Topkapi Palace. It is only a few hundred more yards to get to the Blue Mosque, the Basilica Cistern, the Hippodrome, and the nearby museums. It is an easy walk to the docks, if one is interested in a boat tour on the Bosphorus. It is a longer walk through a bustling commercial district to the Grand Bazaar (over a mile), but well worth doing on foot. There are also dozens of very reasonably priced restaurants within walking distance â€“ some are truly outstanding and quite inexpensive. The Valide Sultan is immaculately clean and maid service was prompt, thorough, and unobtrusive. The hotel serves a substantial breakfast with an admirable variety of dishes, including plenty of fresh produce (fruits and vegetables), wonderful pastries, and delicious Turkish yogurt. We had laundry done through the hotel and it was returned earlier than promised for a bargain price. Our one disappointment was the restaurant in the hotel. Although it served an outstanding breakfast, it was merely satisfactory at dinner â€“ a perfectly serviceable place to eat, but I would not recommend it over many others in the area. We had a stunning view of the Ayasofya from one of our rooms (the other had a view of the Bosphorus). The restaurant is on the roof of the hotel and provides similarly stunning views of both the historic buildings in Sultanahment and the Bosphorus.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mannheim, Germany", "Title": "“Fantastic service, location and facilities!”", "Author": "LeAnne319", "ReviewID": "UR8081295", "Content": "The staff at the Valide Sultan Konagi ensured that we had a great trip to Istanbul. From airport service, to early check-in, everything was taken care of at a great value. The room had a beautiful view of the Hagia Sofia and it was imaculate! The continental breakfast had a great variety and the front desk staff, fluent in English, constantly provided friendly service. I highly recommend this hotel. LeAnne from Germany", "Date": "July 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "California", "Title": "“Great Location, Good Hotel”", "Author": "Ott-Traveling", "ReviewID": "UR8073550", "Content": "We found the name of this hotel in our Eyewitness Travel Book for Turkey, and we are pleased we did. With a stay of two nights or more, they picked us up at the airport. The rooms were good, although the bathroom was tight. The breakfast was great and the views magnificent. We were very pleased with our stay. The hotel staff were extremely friendly. A short five minute walk to the center of old Istanbul. We know where to stay next time we come back to Istanbul. You'll be glad with your choice.", "Date": "July 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Worth Every Penny”", "Author": "FreguentTraveller", "ReviewID": "UR8065500", "Content": "This is a cute little hotel. My husband and I stayed here for 4 nights. it was our first time visiting istanbul. We were lucky to find this hotel at TripAdvisor. The hotel was very clean and nicely decorated. The service was personal and attentive. The location couldn't be better. Many Istanbul's well known attrations are only a short walk away. We love this hotel and would recommend this hotel to anyone.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Pleasant experience”", "Author": "HappyTraveller15", "ReviewID": "UR7958983", "Content": "We were greeted with warm welcome upon arrival with Turkish tea and coffee by the friendly and helpful staff before check-in. The hotel is charming, cozy and the service is personal. Our room was very clean and well equiped. The room is not large, but it's comfortable enough for me and my husband. The receptionist, Marmet, speaks excellent English. He is very knowledgeable about Istanbul and is very helpful in suggesting places to go. Another staff, Husien, doesn't speak much English, but his service was extremly attentive. The hotel has Turkish decors with good taste and is very clean. Free breakfast is included at the top floor restaurent. The view at the restaurent is great, it overlooks Topkapi Palace and Hagia Sophia. This hotel is in an excellent location, next door to the Four Season Hotel, but without the Four Season's price. Many popular historic tourist attractions are just a short walk away. Due to its nearness to a mosque, we can hear the moslim \"call of payers\" in the early morning (a common problem in many areas in old Istanbul), although, we got use to it after couple days. Our stay at this hotel was perfect. It exceeded our expections by a large margin. We would definitely stay at Valide Sultan Konagi again when we return to Istanbul.", "Date": "June 21, 2007"}], "HotelInfo": {"Name": "Hotel Valide Sultan Konagi", "HotelURL": "/ShowUserReviews-g293974-d295488-Reviews-Hotel_Valide_Sultan_Konagi-Istanbul.html", "Price": "$131 - $416*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Cankurtaran Mah. Kutlugun Sok. No/1 Sultanahmet</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34122</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "295488", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/aa/74/aa74238017adb9fe03568074582815df4large.jpg"}}