{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hollywood", "Title": "“FRONT DESK STAFF AWFUL”", "Author": "pedro c", "ReviewID": "UR128552572", "Content": "Really beautiful hotel! everything fine about the room,the view was fantastic and the food good but so expense,i paid for coffee and salad 87 tl, the other complaint was the front desk staff, i was in a business trip and i have to use the conference room many times, i mean the hotel is not cheap,so i have to ask for the key and always was a real pain in the neck and the owner of the jewelry store is the most unlike person that you can imagine,i was interesting to by a bracelet but this men does not open the door for us,definitely,i'll come back just if i have to stay near to the airport,that's all but with my ipad ready", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Oxford", "Title": "“Close to airport but expensive”", "Author": "Chris B", "ReviewID": "UR128185401", "Content": "We stayed here as a cancelation on a flight and found the hotel was close to Ataturk airport. We were put in a smoking room which we did not ask for but it was very last minute so can't complain. We had a few drinks at the bar which was extremely overpriced and after 2 drinks each the bill was about 85TL. The rooms themselves were small and an ok bathroom but again pretty small and you could only just close the door to go to te toilet. There was an outdoor pool to use but due to the weather we did not use it. Overall the stay was ok but I wouldn't rate it as 5*", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice hotel, excellent staff”", "Author": "Jr444", "ReviewID": "UR127031566", "Content": "Really liked this hotel. Its a bit out of town but easy for the airport. Very efficient and helpful staff. Quiet rooms. My only complaint is that there's no hot food at breakfast. There were hard boiled eggs and a multitude of pastries yoghurts etc so it was perfectly fine. Would definitely stay there again.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“not bad for an early flight from Istanbul”", "Author": "Alexander K", "ReviewID": "UR126674900", "Content": "I used to stay at Cinar Hotel in Istanbul couple of times. Location of this hotel is convenient especially for those who have an early morning flight out of Istanbul, and in both cases I had those... Althought there is nothing to see around, one can enjoy walking/jogging down the sea shore as the hotel is situated right on the Bosphorus. Morning vies from the rooms are fantastic with naval traffic and dozens of ships at anchorage! Although i would not say hote is a top destination (as hotels in the downtown are more advantageous), service and breakfasts are very good - no surprise as Turks are expers in hotel business. Rooms are clean and very quiet - good to sleep in :). Would recommend to those who has to stay overnight in Istanbul and does not want to get stuck in traffic in the morning.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Room with a view”", "Author": "crazychic", "ReviewID": "UR124586913", "Content": "Friendly staff and spacious room. Booking a non smoking room if you don't want that smokey aroma. Make sure you book a pool view which also gets you a sea view too! Outside area is lit up at night and our room had a balcony too, although it was one of the coldest weekends in years so wasn't tempted to sit outside. Would be great in the summer to watch the ships go by and there are plenty of them! They are currently refurbishing reception and our room was very clean and had a well stocked minibar :) and everything else required for a weekend stay. Plenty of breakfast choice. Well located for airport and a taxi down town takes about 30 minutes on a busy Saturday evening. There is a lovely bar with a good atmosphere next door! (Friday night) popular with a trendy set", "Date": "February 14, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "UK", "Title": "“One night business trip”", "Author": "Basil-Forties", "ReviewID": "UR121834253", "Content": "My room was overlooking the pool and water - it was dark but the pool area was attractively lit. The room was unfortunately a smoking room and had a stale air. The aircon provided hot air although I requested cool. My collegue suggested the hotel next door to eat in as she had found from experience that the restaurant wasn't up to much. The surrounding area is run down. The room was clean and the staff pleasant.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shropshire, England", "Title": "“For what it is, it's fine”", "Author": "Bagster", "ReviewID": "UR118589756", "Content": "We needed a business hotel for meetings with people flying in from UK (2) and South Africa and our local man. The hotel had to be near the airport. This one seemed to fit the bill -- and it did. Turks are naturally reserved people, but with that in mind we found the staff helpful and friendly. The rooms were fine, though the mattress could have been a bit more generous. Breakfast was pretty good compared with some I have known. The local authorities have done their best to make this area welcoming to tourists -- a bay, a beach, good walks. It's half the price of some places we could have stayed and I think it punches a little above its weight.", "Date": "September 26, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Stockholm", "Title": "“Ok hotel but for whom?”", "Author": "No_1_Scorpio", "ReviewID": "UR118185524", "Content": "I stayed overnight here bexcause the airport hotel was full. The staff i met was friendly and I got a good impression of the organisation. Room was ok with a fresh and probably more recently redecorated bathroom. Great sea view and a balcony with the room. Aircond did not deserve its name and still it was not the hottest season. The room was quiet and I did not get disturbed by traffic or airplanes. The riddle with this hotel is really for who will it serve its purpose? Airport hotel? Not really a airport hotel even if it is very close to the airport. It is too far to walk. There is a hassle with taxi drivers getting upset about the short drive. Mine was foul mouthing and hitting the steering weel/ dashboard to express his disapointment with the drive. City stay? in order to explore Istanbul at least I would chose something more centrally located for that purpose. Company conference? This could perhaps be a good hotel for this purpuse allowing both some recreation possibilities and access to Istanbul facilities outside of sheduled conference-hours.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“overpriced”", "Author": "nin6811", "ReviewID": "UR117852721", "Content": "I had ever stayed in this hotel for 3 times. The breakfast is always the same. Service is ok. Room rates are getting higher but rooms are small. The only advantage of this hotel is the location is near to seaside and airport, but far away from any famous spots.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "sydney australia", "Title": "“Very relaxing”", "Author": "SydneyAnne27", "ReviewID": "UR115879802", "Content": "We spent one night at the Cinar Hotel at the end of our Turkey trip. We stayed here because of its proximity to the airport and were very happy with our choice. Our room was recently renovated, very comfortable and with a balcony and great water view. Breakfast on the terrace (also with views) provided a very pleasant start to the day. The area around the hotel was perfect for taking a long relaxing walk before beginning the journey back to Australia.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Good hotel, clean and quiet.”", "Author": "OliviaB19", "ReviewID": "UR115391962", "Content": "Stayed here for 2 nights on a business trip in March 2011. Rooms are very clean and good quality, breakfast was also very good. Near to the airport which was the main reason I stayed there. I ordered room servise one night which was ok, not great. There isn't much around though in terms of restaurants, shops etc, but as a business hotel it was fine. Would stay again if I go back to Istanbul.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "veghel", "Title": "“Business Hotel swimmingpool open at 10 am and closed at 18.00 pm haha”", "Author": "JanVeghel", "ReviewID": "UR112225480", "Content": "Nice hotel close to airport and exhibition CNR centre. But they pretent to be a business hotel, can somebody explain me how it is possible that the swimmingpool is open at 10.00 am and closed at 18.pm, business is normally done between these hours, Crazy idea and stupid rulles. For business hotel I will choose next time the neighbours", "Date": "June 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“An expensive hotel but not worthy”", "Author": "nin6811", "ReviewID": "UR106776725", "Content": "Over priced, inconvenient location, bad manner staffs, even the hotel taxi is too high price. An expensive hotel but not worthy at all. At nights, I can hear next door guests talking on phone clearly. They start clearning very early and always woke me up by knocking the door. The only good thing is this hotel is the view is nice. There are other better hotels near airport and I don't recommend this one.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brugg, Switzerland", "Title": "“Simply amazing!!!!!!!!!!!!”", "Author": "loonad", "ReviewID": "UR85150574", "Content": "Cinar Hotel is one of the best hotels I stayed in Istanbul. It was so close to Airport, service was wonderful, the view from the room was simply amazing. The room was so clean, so romantic and very very quite. I loved it very much and I am looking for the day when I again will go and stay in this Hotel. Thank you to all staff of Cinar Hotel for such intelligent reception and good service.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Just another hotel”", "Author": "meetthebigj", "ReviewID": "UR83111149", "Content": "A typically nominal hotel. dono how they managed to get 5star status. hotel is pretty close to the airport, around 10 - 15min by taxi and it will cost around 12 turkish lira. The hotel is located on the coast, so if you get a room that over looks the beach, then the view is very beautiful. the reception staff is lousy. they dont even inform about hotel facilitites or the time the breakfast opens. Room and the hotel in general is clean. Breakfast is very simple and its the same every day. Wireless internet is free, but its not working all the time. Nothing special about the hotel, but just another hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "jockgrim", "Title": "“Very nice location, but the hotel looks already a little bit old”", "Author": "luitome", "ReviewID": "UR73906779", "Content": "The location in front of the beach, and in a quite zone in the intense city of Istanbul is a previliege. The hotel has a very nice swimming pool, you can have breakfest outside with a beautiful view. The only problem is that the hotel looks like it needs to be refurnished, there is a lot in the rooms that look old...", "Date": "August 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Not 5 star”", "Author": "SSpade", "ReviewID": "UR62770084", "Content": "No doubt it has some attraction in the summer. but with the outside pool empty of water, the lighting yellowy dim, the restaurant perfunctory, the bathroom tiny and the room spartan the only redeeming feature was the balcony overlooking the sea. Convenient for the airport and sea. Prompt room service but fast food level cuisine. fresh fruit, plate and cutlery provided but weirdly the cleaner didnt replace used plates/cutlery just left them dirty with the cores/peel. room was cleaned but everything left as was i.e cleaned around. Such a dim basic bar ;didnt feel comfortable to sit there on my own", "Date": "April 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Netherlands", "Title": "“Good hotel for a short business trip”", "Author": "PausJoh23", "ReviewID": "UR34332692", "Content": "I do agree with the former writers. Basicly a good hotel. Clean and a good staff. Prices for extra's, minibar etc are absolutely out of order. â‚¬ 5 for a normal can of beer, â‚¬ 8 for a small bottle/glas of wine etc. No internet access on your room. Recommand for a short business stay, not for leisure, holliday etc.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Surrey", "Title": "“OK - expensive”", "Author": "JLM71", "ReviewID": "UR30911368", "Content": "My partner and I stayed here for the weekend as he had business over there. The hotel is very close to the airport and is predominantly a business hotel. The prices of drinks and food are ridiculously expensive - not sure how they can be justified - Â£11 for a gin and tonic and if you dont stipulate local spirits they automatically default to imported which cost more. Rooms small and basic but are clean. We are due to return to Istanbul but I won't stay there again the room rates are expensive for the hotel which is a little out dated. The positive is the pool area which is very nice and staff very helpful.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“WOW! This place is fabulous!!!!”", "Author": "Funfolks", "ReviewID": "UR30444593", "Content": "We booked this luxury 5-star hotel to celebrate my birthday and our last night of 27 nights in Turkey. We needed to be near the airport and the Cinar is 5 minutes away (only 8 TL), yet a world away! I generally am so disappointed with Airport Hotels. as I'm sure you are also. This was really the best decision we could make. Our room was perfect and comfy as it overlooked the sparkling Marmara Sea with bustling ship traffic in the distance. The outdoor pool was right beneath our lanai/terrace and added to ambiance and romance. The room had apparently just been redone in the most delightful colors, woods and fabrics. The bath had all the fine touches one could wish for. Everything was clean and immaculate. We travel more than 50 nights a year, every year. This place is a winner. Every thing was excellent and it far exceeded our expectations. Sometimes, when you book on line -- sight unseen -- you're never really sure what the outcome may be. But this experience was fabulous! The front counter staff was professional and efficient. The door staff attentive and ever so quick and helpful. The morning breakfast crew excellent and more than perfect! (as was the deliciously varied hot 'n' cold buffet day-starter)! Housekeeping kept everything neat and tidy and friendly. Indoor pool and spa person was kind and understanding. We should have dined in the Cinar restaurant as the \"Highly Touted\" nearby seafood restaurant down the street was a TOTAL disappointment. 50 Turkish Lira for a \"seafood-less\" seafood salad and 6 little fried squid rings. They offered Shrimp at 140.00 TL per kilo, and their fish averaged over 70.00 TL per kilo. Always check the menu first before going into any restaurant! Their indoor spa pool was heated and idyllic. We strolled the neighboorhood and enjoyed the park with several local families picknic-ing and mini-zoo. There was a problem, however! We only stayed one evening, as we would have LOVED to have stayed many, many more!!!! For sure, next time next time. The highlight of my birthday was being able to spend it at the hotel Cinar in delightful Turkey! We will always have such fond memories of the hotel Cinar. The GM Esen Cetingil and Sales Manager Yasemin Yucel are to be commended for assuring that this hotel is as wonderful as it is.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Washington DC", "Title": "“Stay Somewhere Else!”", "Author": "FrequentFlyer072", "ReviewID": "UR21177770", "Content": "A client of mine paid 145 euros so that I could get a good night's sleep before catching an early morning flight. (The hotel is near Istanbul's main airport.) When I arrived, I learned that my room was 3 levels below the lobby and that there were no elevators to that level. Thus, I had to carry my bags down 3 flights of steps (and up again the next day.) The room was not terribly clean, having grimy and sticky spots on the furniture. The shampoo bottles were half-full. Clearly, the cleaning done between guests is minimal. And in the middle of the afternoon, a hotel worker who was clearly not a member of the cleaning staff unlocked the door and came in unexpectedly. I know how to speak Turkish and asked him what he was doing and he had no good excuse. To cap it all off, I got hungry mid-day and went to the nearby grocery for a couple of pieces of fruit and some bottled water. When I tried to reenter the hotel, a security guard told me I could not bring in outside food; instead, I had to use the mini-bar. I showed him the small things in the bag and explained that this was an irrational policy. He said that the boss keeps cameras everywhere and that if he didn't prevent me from bringing in the food, he would be fired. I told him that his boss is ensuring that I will never spend another euro in his hotel ever again because of this idiotic policy. I felt the entire episode was degrading. I was very happy to leave the next morning. I will not ever stay there again.", "Date": "October 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Central Italy", "Title": "“Decent 3 star hotel, definatly not the 5 they say they are. (or leaves)”", "Author": "mtmuller", "ReviewID": "UR16893379", "Content": "The most confusing part is Cinars hotel rating. They have 5 leaves. Although to be fair there is a plaque hidden behind a plant in the front entrance, in Turkish that shows 5 stars. I have stayed in many 5 star hotels in North America, and i don't find this hotel a 5 star hotel. I would say its a good 3 star hotel. The price is not that different from the Renaissance Polat. First off the rooms are decent enough. The 70's wallpaper has been painted over in a taupe color, however they are generally nice enough. Rooms are rather dusty, and while doing my pilates, I can see that the vacuum the maids use should be replaced. I have had to get my own towels a couple of times, as well as soap and toilet paper. Garbage, like empty plastic bottles will not be picked up, but left there. The hotel softens its water, so thats nice for hair washing. The pool is salt water, which I personally find a bit gross. Also my skin can not tolerate salt water. I found front desk service generally okay. I think there are far too many parking attendants and if your room is at the front you risk hearing them all night long. I purposely brought grocery items in many times, no one said anything, which is good, as being in a different country one would like to tend to their dietary needs at times, in a way that restaurants can not often provide. Breakfast is horrible. Each and every morning I have had to request coffee several times before I actually see any. That is annoying, VERY annoying. My husband usually orders eggs, sunny side up. They are a little too runny, and he usually only receives 4 bacon bit sized squares of Turkish Ham on his eggs. Internet has been working while I was here. On another note, I travel with my companion dog. This has proved to be a problem in Istanbul. There are many vets, but pets are not viewed as the pampered loved companions that many owners now see their pets as. No hotel we stayed with in the area would except my dog. While I can understand that to some extent I would think that a hotel wanting to be perceived as a modern hotel in 2008 should provide some area for pets. If not allowed in the room, perhaps for an extra amount an indoor/outdoor kennel can be provided at a small extra cost. As well as bedding for the pet. Likewise, smoking and nonsmoking rooms should be provided, this is 2008. As an nonsmoker / ex-smoker I dislike the faint scent of smoke on the mattress. The hotel might want to consider for guests staying longer than a week, that a kettle and complimentary tea and coffee be provided in the rooms. Other than that, if this hotel is a 3 star hotel, then its decent enough. If its a 5 star hotel, it falls really short.", "Date": "June 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Gulf", "Title": "“ONE OF THE WORST HOTELS”", "Author": "Wadi_bashing", "ReviewID": "UR8397816", "Content": "Stayed at this hotel for business along with several colleagues. With a few exceptions the hotel staff were generally rude - especially at reception and only interested in making as much money as possible out of the company. The hotel is nowhere near 5 star, the hotel pool which is salt water is quite good but closes at 6pm which is the nicest time of the day (its mid summer and light till about 9pm so this rule is ridiculous) and the staff start packing up the pool area around 5pm which is annoying. I travel a lot for business and found the hotel very expensive. My wife came to stay for a week with me and the hotel charged extra for her to stay with me and when my daughter (aged 12) joined us the hotel wanted to charge us the same price as a room to put an extra bed in the room for her. The hotel will not provide an iron for you to use but is happy to charge you about 4euro to iron a shirt. There are no laundry facilities at all on the weekend. The hotel shop charged euro17 for a regular magazine such as Marie Claire. There is however one impressive thing about the hotel, the wildlife...the cockroaches were healthy, unlike my wife, myself and several colleagues many of whom suffered from food poisoning. My wife and I were treated like criminals when we entered the hotel with a small bag of groceries which included bottled water and peanuts and we were constantly reminded by the front desk staff that we were not allowed to bring any items of food or drink onto the hotel premises. There are no coffee and tea facilities in the room. The rooms are old but ok except the bathrooms are a bit mouldy. Basically I would avoid this hotel like the plague.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chile", "Title": "“Disappointing”", "Author": "munizaga", "ReviewID": "UR7937196", "Content": "I spend about 7 months of the year travelling and in different hotels every week. My company booked this hotel for me probably because it was cheaper than the alternatives. I arrived at this hotel on a Sunday evening at 11:30pm and the loud music from the wedding made me nervous but the music stopped at 12:30am so it wasnâ€™t so bad. Check-in was fast with no problems except I asked for room on the ocean side but they didnâ€™t have any rooms on the ocean side. They gave me a big metal key and there was a sign telling me to hand it in when I left â€“ unfortunately when I returned from a days work I had to hang around for 5 minutes trying to get someoneâ€™s attention to give me my key. My room cost Eur$110 per night including taxex and breakfast. My room is small and dingy â€“ the furniture is new but very cheap, the two single beds are also quite uncomfortable. The internet, they claim they have WIFI, but the two days I was there it wasnâ€™t working â€“ I asked at the reception and they advised that it would be working in a couple of days. I spoke to another employee who stayed there two months prior and the internet wasnâ€™t working then. My room is facing out onto the road and carpark and normally there are sporadic car alarms and regular boom cars. My first sleep was bad due to the traffic and the room next to me watching video clips all night. Breakfast was very ordinary and not much to choose from â€“ some cereal, melon and watermelon, bread and some cold meats â€“ tried to find orange juice but without success. Staff generally disinterested and rude. In the mornings it is quite still and there is a sickly sewerage smell coming off the beach, but when there is a breeze this goes away â€“ our local staff advised the beach is polluted with sewerage and various chemicals and elements and not good for swimming. Put my laundry in and it came back quickly and they did a good job. Shower was good. Asked to be moved on the second day at 6.30pm to the ocean side and they said they could move me next week â€“ I just donâ€™t buy this, there are rooms available as I know our company had a number of our staff arriving on the midnight flight who were booked into this hotel so why canâ€™t they change my room â€“ the reception just couldnâ€™t be bothered moving me to another room. Pool is closed at 6.00pm so for people like me who start work at 7.00am and return at 6.30pm there may as well not be a pool. Room service was good â€“ well cooked and served quickly. I was booked in this hotel from the 17th to the 23rd â€“ when I decided to cancel and leave the hotel on the 19th at 11.00am they charged me for the night of the 20th and then threatened to â€œcharge me a percentage of the amount due up to the 23rdâ€� - I asked for an explanation of what they were talking about, for example what is the percentage and they responded that â€œit was normal practice in Turkey to charge such cancellation feesâ€� but when I pressed them further they seemed to be unable to explain what they were talking about. The final bill didnâ€™t include any other shocks so I should be thankful for that.", "Date": "June 19, 2007"}], "HotelInfo": {"Name": "Cinar Hotel", "HotelURL": "/ShowUserReviews-g293974-d295483-Reviews-Cinar_Hotel-Istanbul.html", "Price": "$158 - $240*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fener Mevkii</span> | <span class=\"extended-address\">Yesilkoy</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34149</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "295483", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/52/4f/524fd05679ce34065031a1ff20615f091large.jpg"}}