{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salisbury Wiltshire", "Title": "“Mixed Review”", "Author": "Ms_j_Subtle", "ReviewID": "UR127743506", "Content": "Our 3 day break got off to bad start. When we checked in we were told that due to a delay in new carpets being fitted our rooms were not ready but they could take us to a different hotel for one night. We could choose in which hotel we could have breakfast and they would take us to and from the hotels in their own transport. We didn't use it in the end as the hotel was only a 10 minutes away and it was quicker to walk.We were assured we would get very nice upper rooms on our return the next morning. Although nicely decorated, the rooms we were first shown for our second night were relatively small and we didn't feel we had an upgrade. We were given a second choice of rooms which were marginally larger. By then we were feeling pretty fed up as we wanted to begin our exploration of this fantastic city so we accepted them. On our return we found lovely bowls of fruit. We thought they were standard but maybe they were by way of an apology. Some of the staff especially the maids and waiters were friendly and smiley. Others would speak politely but abruptly. There were no plugs for the bath or hand basin ( a bit odd for a four star hotel). Breakfast was fantastic, the mix of foods was really interesting as well as the people watching... so many different nationalities. The waiters were helpful, friendly, polite and efficient. The views were wonderful. Only one small gripe the juices were processed squash or you pay extra for fresh. There is loud music playing until one so if you need an early night you need to pick your room carefully. Or just make sure you are so tired it wont matter. The beds were very comfortable and the air con was quiet. I just wish they had let us know sooner about the problem and I'm not totally convinced that we were compensated enough for our inconvenience.Overall I would recommend this hotel for the terrace views, comfortable beds excellent breakfast and closeness to the trams for getting around.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Worth the money spent”", "Author": "viveksr", "ReviewID": "UR123593961", "Content": "I have been to Istanbul on many occasions but this was the first time I was travelling with my family. The hotel is very close to city and well connected. The only problem I faced during my stay was repairs on the road (I am sure it must be over by now). The restaurant has beautiful view of city and canal and the menu is well spread. The room was clean and well furnished. Most of the city attractions are at walking distance or you can walk and take a tram.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Easy walk to tram and major sites within 10 mins”", "Author": "Melanie124", "ReviewID": "UR123063826", "Content": "The hotel is very nice - a lovely view from the rooftop restaurant, where you have a good choice on the breakfast buffet, and a nice heated swimming pool open until 10pm, the rooms are medium size, clean and nicely furnished. It was easy to get there by metro and tram during the day, but for the return to the airport, we took a cab - which was 52 lira - and so it would have been better to get the transfer that the hotel offers. The best part about this hotel was the position - only 10 mins to suleymaine mosque and the amazing hammam (turkish bath for families and couples) and the grand bazaar.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Location only issue”", "Author": "dermotmclean", "ReviewID": "UR122699544", "Content": "There is a great view on the top floor where breakfast is served, which was very good. The staff were very kind and helpful the only draw back was the location, although its a short walk to the metro there are not many good restaurants and things to see. Avoid using the taxi's located outside the hotel as they are a rip off...", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“an enjoyable stay at the Zurich Hotel”", "Author": "nerv0usflyer", "ReviewID": "UR119669262", "Content": "We had an enjoyable stay at the Zurich Hotel. After a rocky start (specifically not the welcome we would have expected - maybe the female receptionist was just having an off-day), we were VERY well taken care of and we were treated with the utmost care and attention. We would like to thank the hotel for putting things right straight away and they should be commended for this. This is a sign of a good hotel. The room and bed were comfortable and we enjoyed the facilities on the top floor - the pool and bar. There is also a gym but even with the best will in the world, we didn't quite make it there. Maybe next time! The breakfast fare is plentiful and there is something for everyone - even if various bits are not quite to your taste. I discovered two delicious Turkish cheeses via breakfast. There is a lovely view of Istanbul to enjoy while eating. If there is one improvement I could suggest, maybe the rooftop jacuzzi could be operational during the colder months. It is usable if cold water doesn't bother you - apparently the water is not heated from October, according to the friendly waiter. Overall, a lovely hotel.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East coast", "Title": "“Everything we needed”", "Author": "Hedo-goer", "ReviewID": "UR119484034", "Content": "We stayed in Hotel Zurich for 4 nights. The location was excellent for sightseeing in Istanbul. You could walk to most of the tourist areas, or walk a couple of blocks down to the tram line, if you didn't want to walk the complete distance anywhere. For example, it was only 2 trams stops to the Cemberlitas Hamami Turkish baths. They were repaving the street and sidewalks while we were there, so getting to the hotel from a taxi meant having to walk a block, but that wasn't a problem. We ate at the outdoor restaurant there and enjoyed the food and the service. Our room was a suite, with a TV that swiveled so you could see it from the bed, or from the big bathtub (through the glass wall). I only ran into this TV once, as it hangs down from the ceiling. There was a big walk-in closet in this room, which was helpful in keeping the clutter in the room to a minimum. Miray, the Guest Service Supervisor gave us a lot of help and advice, which proved to be very useful. She directed us to several things we wouldn't have seen otherwise. We even had a nice chat with Muhammet, the manager. The restaurant for breakfast was on the seventh floor, and had a nice view of the city. As a bonus, you could choose to sit outside on the terrace if you wanted to. There were 3 elevators, and one was definitely faster than the others, which seemed strange. The pool was on an upper floor, and was nice, but of a constant depth, which might be too deep for small children. This seemed to be an architechtural characteristic of all pools in Turkey, as we saw it at other hotels, too. The jacuzzi was a floor above the pool, but was a bit cool for us. However, the loungers were very nice. We tried the disco one night, but apparently there was a mix-up after we placed our drink order, and we never got our drink. But since we were tired, we didn't stay long anyway. At the end of our visit, they arranged for a private minibus to take us to the airport, and we'd like to thank them for that, as my companion was having difficulty doing any physical activity by this time (as she was sick). All in all, a very pleasant stay in this hotel.", "Date": "October 19, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Bucharest", "Title": "“nice Place to stay”", "Author": "cdanaioana", "ReviewID": "UR118048454", "Content": "Nice place to stay if you want to be near the Grand Bazaar. At the restaurant, it was very nice panorama over Marmara Sea and good meal at breakfast. It could be a little bit noisy during the night because of the music, they are playing at the restaurant. But if you are tired enough, you can sleep with the music playing :)", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“loved it....”", "Author": "ersinozgel", "ReviewID": "UR117019836", "Content": "My family and i decided to go on a trip in Istanbul. Some close friends told us that Hotel Zurich is a great hotel. Finally we stayed 5 nights.The service was very friendly and polite. The rooms were very clean and we enjoyed our sleep such we didn't want to wake up. Fresh fruit,delicious sausages,marmalade and beaked bread were some of the tasty food that we ate in our breakfast.I also swam in the swimming pool and i really relaxed myself. The view from our room was nice and generally all was excellent!!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Nice Hotel”", "Author": "Seckin_1234", "ReviewID": "UR116840866", "Content": "We had a wonderful stay here for four nights in June, 2011. We had two separate rooms, my husband and I in one room and our two college- aged sons in the other. The staff was very friendly and always was readily accesible to us. Upon arrival, they said they had upgraded us to nicer rooms. The rooms were a good size and comfortable, and the furnishings appeared to be quite new. There were big windows in the rooms but not much of a view however. But both rooms had beautiful plates of fruit waiting for us on arrival, which we devoured right away! The location seemed excellent to us. There was no problem walking to any of the sights in Old Town. There is plenty of shopping and restaurants in the area also. Wi-Fi was free which was a nice touch, since still many of the nicer hotels in Europe still charge you 25 or 30 Euros per day for using the internet. My husband swam every day in the pool and it was long enough to do short laps. Our favorite part of the hotel was the breakfast. It was our favorite hotel breakfast of our whole vacation in Europe. There were all kinds of Turkish cuisine plus plenty of recognizable items for Americans too. It was big but without being overly crowded. Actually, one of the most interesting parts was seeing the other hotel guests as there was quite an array of different family cultures represented at the different tables. It was almost like \"Casablanca\" or something. Best of all, the buffet was already open for breakfast when we were leaving for the airport at 6 am! Thank you for everything...", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“loving zurich!!”", "Author": "Mike R", "ReviewID": "UR116649009", "Content": "This is my second time in istanbul.This hotel is more than i was expected.The rooms are very big ;the breakfast buffet is excellent;indoor and outdoor pools are amazing.Hamam is wonderful .The staff is helpful .I think location is perfect.10 minutes to taxim square 3 minutes to sultanahmet area.5 STAR SERVICE 5 STAR FACILITIES Thank you Zurich Hotel ..", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“a hotel as your home in Ä°stanbul”", "Author": "FiratEker", "ReviewID": "UR116459696", "Content": "At the recommendation of a college friend who travels quite frequently to Istanbul, I stayed at the Zurich Hotel in 2010. The Staff was very welcoming and most importantly, the hotel was cleaned. I had access to their sauna with complementary messages; which was a plus. I saw the gym but was too lazy to use it. The restaurant and bar were exceptional. Overall, I enjoyed my stay. In August 2011, I stayed again at the Hotel. This time, the whole hotel had just been renovated. The Staff was still welcoming and the whole experience a success again. I am going this year and plan to stay there again. I would not hesitate to recommend it to anyone.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“we would come back again”", "Author": "aushra17", "ReviewID": "UR116384164", "Content": "Fantastic central location 7-10 min walking distance to Grand Bazaar 20-25 min to Haiga Sophia, Blue mosque Topkapi palace. Excellent service and the room was very clean. Very comfortable queensize bed, decor was beautiful. Indoor swimming pool, Outdoor terrace swimming pool. complimentary full buffet breakfast. Thank you for all well configurated to provide us fast access to the Internet!", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pensacola, Florida", "Title": "“i loved”", "Author": "whatawhat", "ReviewID": "UR116238261", "Content": "We stayed in this hotel at the beginning and end of our small group tour. Rooms are well equipped, staff are pleasant and helpful. There's free tea and biscuits at 17.30. Beds were comfortable and it's well placed within walking distance of main sights of Sultanahmet. It was the best hotel of the tour. I checked in online for my flight and printed boarding passes: no charge from hotel.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York", "Title": "“will come back againn”", "Author": "juno50", "ReviewID": "UR115219281", "Content": "Hotel staff was just amazing.Ä° had really grate time there.Ä° will come back there as soon i can.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Please Read, Great stay!”", "Author": "istanbultrip059", "ReviewID": "UR114994976", "Content": "We are a thirty something couple who chose Hotel Zurich from several others on the advice of our travel agent and their own website. Good Stuff The Hotel is located in a very central location, no more than 10 minutes walk from the major tourist destinations which is great, however this does mean you are exposed to Istanbul's less reserved nature 24/7 but don't let that stop you, Istanbul is a great city and this was only reinforced by our stay at Hotel Zurich. The pictures were taken by us three days ago. We stayed for 5 days and really enjoyed our stay, the room was great. However we did upgrade for a very fair price as the first room was just a little small for us, big bed, and kept clean and quiet, A/C worked well, bathroom was awesome, but be sure to have no inhibitions! Food was good, in fact the main menu served at both the Rooftop and the Front Restaurant was the best food we ate in that part of the city. Staff were great, friendly, polite and helpful, especially Guest Relations, thank-you for adding to our stay. Having a rooftop to get away from everything was nice, space in the city is limited so being able to relax was nice. We never used the spa so can't comment but prices seemed fair. If there were negatives, breakfast was usual for that part of the world, carpet in the corridors was possibly a poor choice, but we would stay again as it was a good hotel. Big Thanks to all for a great stay, recommended!", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "tehran", "Title": "“very niceeeeee trip”", "Author": "feredytehran", "ReviewID": "UR114860546", "Content": "i was in Zurich hotel last week for vacation.beside the beauty of Istanbul ,the hotel was great and very cozy and in good location .my friend and i had a great time there .the staff were very lovely and ready to help us in any time .i will recommand to my other friend to stay in this hotel at least 1 nt .they will find its services and every thing ok. love to be there again.", "Date": "June 29, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rabat, Morocco", "Title": "“nice journey”", "Author": "widada", "ReviewID": "UR113722821", "Content": "i had a great journey in turkey and i have a special tought to the hotel , very nice situation just few minutes walking from the historical monuments , the safety and quiteness of the nearby pleases me also , not to forget the very freindly stuff. keep on imrpoving ....good luck", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Marrakesh", "Title": "“the good hotel and a very kind Miray”", "Author": "redaMarrakesh", "ReviewID": "UR113074899", "Content": "I was in Zurich hotel between 27 May and 3 june,i remember that a beautiful girl name's Miray who works there was very professional and so kind and helpful,and the hotel was clean and nice l,despite that the rooms was small ,generaly i enjoyed my holiday there and i advice this hotel for tourist.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“thanks for good company”", "Author": "eymur", "ReviewID": "UR113002303", "Content": "*when Ä± entered the lobby, Ä± was suprised about the gorgeous view,decoration. my little girl liked the guest relation also they had picture together. Ä± tried to paste here but it did not accept. all stuff was really professional and smiling. we joÄ±ned the spa and swimming pool. they were enoguh to enjoy ourselves in the hotel. thank you for everyhing. it is good memory for us.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Alexandria, Egypt", "Title": "“I adore Istanbul”", "Author": "Noura_25", "ReviewID": "UR112456104", "Content": "We stayed thÄ±s hotel for 7 seven days. We joined all activities like swimming, massage,disco etc... But hospitality is the best thing that we met during staying. they reflected all TurkÄ±sh Behaves towards us. Especially We want to thank you the front manager who name is Remzsi. he really helped us in checking time and after processes. We advise to everyone to see this hotel andb joÄ±n thÄ±s entartainment world", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Amazing”", "Author": "sumesh_11", "ReviewID": "UR112140953", "Content": "Hotel Zurich Excellent place heart of city.....close to tram station from where u can access city easily....as well as staff very polite and helpful....Guest Relation: Miray Yauuz was very helpful and guided us properly for city tour...must go hotel...:-)", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hertfordshire, UK", "Title": "“I would return to this hotel”", "Author": "Uk-Traveller300", "ReviewID": "UR108438215", "Content": "Just stayed at Hotel Zurich for 3 nights and apart from a mix up with our booking which was quickly remedied and we were served coffee while we waited we had an enjoyable stay. The rooms were clean and comfortable with air con, tv, tea/coffee making facilities, choice of pillows available. I would say having light coloured carpets means they need cleaning more often and I was a bit concerned to find a tiny smear of recent blood on my comforter. The staff were very friendly and helpful, the usual Turkish push to eat in the restaurant and use the spa facilities. We did eat in the restaurant and had a nice meal, we didn't use the spa or roof top pool as it was too cold. The roof terrace is a nice area to sit when it's warm with views out over the sea. It was well placed for visiting the main sites of interest, Istanbul is a beautiful if very large city.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vicksburg, Michigan", "Title": "“strongly recommended !”", "Author": "BryanAnthon", "ReviewID": "UR108414607", "Content": "My wife and I stayed here for 3 nights and 4 days for a short getaway. The service was simply exceptional and our room was great. The hotel offers great services to help you relax and it is only about 15 minutes walking distance to the Grand Bazaar and about 25 minutes from Hagia Sophia and other great attractions. Thanks for a great weekend, your staff and hotel provided exceptional service! My wife and I WILL definitely be returning to this hotel in the near future!!", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Exceptional in Every Way”", "Author": "Escape34", "ReviewID": "UR107733560", "Content": "My partner and I (who travel overseas regularly) recently stayed at the Hotel Zurich and put simply this is the best hotel we have stayed at based on value for money, customer service, room design and cleanliness. (It also has a great reputation locally - just ask any taxi driver). We initially were booked to stay at the Mosaic Hotel (across from the Hotel Zurich) but despite the friendly staff, the rooms were too small and didn't provide any value for money. So having caught our eye on arrival, we walked across the road to the Hotel Zurich to see if they had any vacancies. The Hotel went to great lengths to secure a corner suite for us (Room 514) and it was exceptional - the bed was heavingly and the room large and modern with a fantastic spa bathroom and lighting. The Hotel itself is located within close proximity to the tram station; the Grand Bazar, and other historic sights including a magnificent Turkish bath house. We also loved being able to pop outside and window shop, buy a pomegranite juice from the street vendor, or grab a cab with great ease. The Hotel's Zurich Cafe was also a wonderful venue for us to rest our weary feet at the end of the day and to enjoy a bottle of wine and a nice meal/snack. The atmosophere here was classy yet relaxing thanks to the great service, nice decor, smooth live entertainment, a lovely fire place for the cool nights, and a great outdoor area on the sidewalk for those beautiful sunny afternoons. Breakfast is served on the top floor of the hotel with sweeping views of Instanbul. The Hotel also has a nice roof top terrace. The welcome and exeptional service we received from the Hotel Zurich team made our holiday so very special that we were sad to leave not only Instanbul but also the Hotel Zurich. Thank you Hotel Zurich ...our visit was exceptional in every way.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "VÃ¶lklingen, Deutschland", "Title": "“Top Hotel!”", "Author": "hellovany", "ReviewID": "UR106957073", "Content": "I was staying here with my friends for 5 days. And everything was just perfect! The Rooms were clean, The Staff and Crew really really nice! The location is really lovely in old town Istanbul. And Try the Spa, the turkish Bath is just awesome.. We had luck, that the weather has been perfect, so that we could use the outdoor pool as well! I would recommend it for your stay and I will definitely check in here the next time, I am going to visit Istanbul ;)", "Date": "May 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pune, Maharashtra", "Title": "“this is the place where i feel pleasure”", "Author": "sangvedl", "ReviewID": "UR106950874", "Content": "this is my pleasure to stay for a day in this hotel. the rooms are really comfortable when Ä± rised up the restaurant for breakfast the sunset was really awosome and Ä± used the spa especially turkish hamam with scrub fee was unique Ä± am sure that Ä± will come back to the this hotel thank you for every deparment of your hotel ...", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "stuttgart", "Title": "“this place is perfect...”", "Author": "thestormStuttgart", "ReviewID": "UR106683600", "Content": "First of all, the hotel has very comfortable rooms. And the public relations consultants was interested about us so much, so that maked us more relax and peaceful. They were debonair and friendly. Also they were the most exprienced staff who i haven't seen before. And the last thing for me, you can have a dinner with wonderful aspect.", "Date": "May 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“what a good hospitality....”", "Author": "mami90", "ReviewID": "UR106326355", "Content": "The first important things to inform is hospitality , Ä± feel that the guest satisfaction is so important for this hotel staff ....all the time they are smiling and try to serve something to your satisfaction ..... after all day work , Ä± used sauna , Turkish bath and swimming pool , their pool is so nice because they are arranging the degree of the pool depends on the weather condition...also there is a outdoor jakuzi , and you can see all historical place when you are in jakuzi..... If you are looking a hotel in Ä°stanbul , dont worry u ll be happy there", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Great Stay..”", "Author": "losttime_7", "ReviewID": "UR106058451", "Content": "First, I want to say that It was amazing hotel.. We stayed at this hotel a couple of times and found it very clean and a most enjoyable experience. The owners were very friendly and accommodating,The bed was comfortable and the bathroom had clearly been refurbished nicely.The food was good and delicious . If you are thinking of visiting Istanbul , this is a great place to stay and Value for money was exceptional. We will definitely be returning and would highly recommend this hotel to other travellers", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice place friendly people”", "Author": "Janetez", "ReviewID": "UR105637048", "Content": "Place has very nice Istanbul and Bosphorus view. Food is great! I loved staying here. Location wise its a very convenient hotel for business trip.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Excellent Location Modern desingn”", "Author": "3979ams", "ReviewID": "UR104473820", "Content": "..Everything was awesome stayed 7 nights in Istanbul Excellent location modern design.., good location at 10 minutes from hotel to the tram atation.. not far from AyaSofia and Topkapi palace. friendly staff with excellent reception good beakfast.. rooms clean and comfortable... Internet here is free and has good speed..", "Date": "April 18, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Stavanger", "Title": "“A great choice”", "Author": "Hidle", "ReviewID": "UR102657398", "Content": "A really beautiful and relaxing hotel. Great food, amazing view from the roof terrace. The staff is amazing.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newark, New Jersey", "Title": "“Hotel Zurich is one of the best best hotels that I had ever been so far.”", "Author": "venusue", "ReviewID": "UR96980381", "Content": "I stayed in Zurich Hotel during my summer for a vacation. Everyone was very welcoming in the hotel. Your stuff were well trained that they were able to help me with all of my concerns. I strongly recommend this hotel everyone who want to travel to Istanbul and also wants to stay out of concerns. I enjoyed the every moment while I was in your hotel. Thank you very much.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ongar, England", "Title": "“Comfortable stay in Istanbul”", "Author": "CWhitehouse Posted by an OctopusTravel traveler", "ReviewID": "UR90603287", "Content": "We went for the Grand Prix and combine sightseeing as well. Hotel was fine - we didn't spend much time there but rooms were very comfortable nicely decorated. We used the rooftop pool in the evening - small but adequate to cool down. Great views from the top watching the sunset at the rooftop bar - very romantic! Restaurant opened out onto the street - therefore noisey so we didn't eat there but lots of restaurents to choose nearby. Very comfortable and relaxing stay - would use again.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The staff really made us feel welcome”", "Author": "Kevoroni", "ReviewID": "UR89352281", "Content": "My girlfriend and I stayed at your hotel recently.there were many amenities for us to enjoy and we tried to use them all. The service was impeccable along with the overall cleanliness. We currently live in Florida now but hope to return soon", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Overall enjoyable pleasant stay.”", "Author": "EricNorthman55", "ReviewID": "UR89041556", "Content": "My wife and I wanted a week off work to see a few historical sights in Istanbul. We stayed a week, service was excellent and enjoyed our stay.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Value for money”", "Author": "faris1951", "ReviewID": "UR86526179", "Content": "11 family members inc. 2 children stayed from 30th Oct-7th Nov 2010. I would strongly recommend this hotel for the position with walk reach to the old city. The hotel is clean with clean rooms, good service, variety of hot and cold breakfast, warm glass covered swimming pool, panoramic resturant on top floor, sauna, turkish bath...etc. Above all a very active and friendly assistant manager (Mr. Murat). At last a very hospitable and helpful receptionists and bell man among them (Mr. Dogan) who we can give 100% points in all receptionist aspects. Don't miss reserving in this hotel.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cyprus", "Title": "“perfect”", "Author": "frost55", "ReviewID": "UR86387200", "Content": "I've stayed in this hotel in august and I've been pleased very much. It's very good, at the city center, clean, hospitable and very quality. The meals are really delicious, prices comprehensible. Especially I want to specify that selling office is very quality. when I was reserving on the phone they have helped me very much and interested me. when I arrived to hotel the same interest gone on. go and stay at this hotel you won't be disappointed trust me ;)", "Date": "November 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Muscat Governorate, Oman", "Title": "“I would like to blame only for room service of this hotel is poor”", "Author": "shuellas", "ReviewID": "UR85382281", "Content": "I have to thanks for the staff of Zurich Hotel especialy Nihad and others two ladies which i forget the names there charming to us all the days which we stay in this hotel", "Date": "October 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Windsor, Canada", "Title": "“Centrally located”", "Author": "PAMELA B", "ReviewID": "UR85151727", "Content": "We enjoyed our overnight stay here--decor pleasant and different--food was good. Under new management, trying very hard to please. In clothing shopping area and within walking distance to Grand Bazaar.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Antofagasta, Chile", "Title": "“very good service”", "Author": "Monte_Christian", "ReviewID": "UR84845216", "Content": "on a business trip I stayed at the Hotel which is conveniently located in the old part of the city with the tram stop very close and some points of interest such as the Grand Bazaar, Suleymaniye Mosque Sultanahmet and even St. Sofia, very accessible, the view in the restaurant is amazing the rooms were very clean, bedding and towels in very good condition and the room was spacious and well decorated. attention was very good especially for Miss Feruza Saidova, was very attentive and cordial service, with a very good level of English, which is why again would stay at the hotel on my next trip", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“thanks boss and management”", "Author": "arifugur", "ReviewID": "UR83979591", "Content": "All months Ä± m going to visit istanbul .....Ä± have a lot of hotel experience for this city , but last time Ä± choose Zurich Hotel....their staff were so friendly and they know what they have to do for guest satisfaction....when Ä± was there Ä± noticed that their management deal with all guest ...its so important...they have a good communication.....zurich hotel will be my choose ....", "Date": "October 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“How the hell did this hotel got 4 stars”", "Author": "King73", "ReviewID": "UR71695116", "Content": "I was too excited to have the chance to meet up with friends (total, including my self , were 5 guests) which i haven't see in over 10 years, so we decided to meet up in Istanbul. Long story -short we booked 2 rooms in this hotel (1 room double beds and 1 room triple beds) in total 5 beds and we booked it over one month from our arrival date. we arrived (only 4 of us made it (one guy didn't show up) and the man behind front desk told us that our rooms are not ready he will put us in a temporary rooms for today until tomorrow (remember that we booked it over a month before we arrived) so we said: ok since we all had more that 14 hours for flight time and we just wanted a bed to crash on. the next day the did move us to new rooms (2 double bed rooms) so i went to the front desk asking him why are we in a double bed room while we ordered one of the rooms to be triple (and i couldn't believe his answer), he said why would you need 3 beds and you are only 2 guests in the room. i told him i want it because i paid for it and i should get what i paid for and he said but you are only two people in the room why should i give you a room with three beds (it was like I was living in a different planet where people have a different logic) and i repeated my self i want my three bed room because i paid for three beds room or you pay me back the difference, and that's where he lost it and started screaming and saying I am not paying you anything, go back to the agency you booked the hotel from and ask them to pay you back. so I insisted on talking to the manager and he made me wait over 3 hours until he got back to me with a very bad attitude saying that the manager is not here but he will try to get me what i paid for tomorrow. Next day we were moved again, and this time to a three beds room but that was just the beginning of the descending to hell: 1- Cleaning service: the first day nothing (not even clean towels) the next day clean towels but no new bed sheets (mind you it was really humid and you sweet all night) so we told them if we can get bed sheets changed, and the cleaning lady came (and i was there in the room) she pulled all the blankets of the bed and through them on the floor and she changed the bed sheet and left LEAVING THE BLANCKETS ON THE FLOOR FOR CRYING OUT LOAD. 2- Second night of sleep we ended up with bed bugs bite. 3- hot tub on the roof looks very nice a bubbly but freezing cold so I asked if the heater can be turned on so we can have a relaxing time and they said no we don't turn it on. 4- The breakfast is a 2 star quality. 5- I was ready to pay 100 dollar ti any one just to see someone smiling. Every one who was working in the hotel made us feel like they are doing us a huge favor for working there. 6- The food quality in general was poor to fair. All that would be ok if we could find someone in the whole city that can speak English or at least understand it we couldn't communicate at all so we stayed within walking distance from the hotel at all time. It was a huge waste of money and time.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "seattle", "Title": "“not worth the price”", "Author": "SeattleTourist17", "ReviewID": "UR64318191", "Content": "The rooms were clean, but we had trouble getting the air conditioning to work, which we needed since it was too noisy to keep the windown open while we slept. The breakfast buffet was quite generous, but the coffee was lousy. The service is what was really disappointing. The front desk was not very helpful and in some cases, gave us incorrect info. Serice in the bar was also terrible. Not many restaurants nearby and those that were we not very good. The location is fine if you need to be near the university, but it was a 20 minute walk to the major historical sites and a 20-30 minute tram ride to Taksim Sq. All in all, not much value for the price.", "Date": "May 16, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Oslo, Norway", "Title": "“No regards to guests while renovating”", "Author": "BlueEarl", "ReviewID": "UR49513955", "Content": "We felt we lived in a construction site all week. Drilling and other machinery starting at 8.30am and went onwords until late afternoon. Workers often blocked the elevators, and had first priority. I'm on crutches, and were once told to take the stairs from one of them! Area is not the best, but it's close to the tram, so it's not that bad. Breakfast is rather poor, and the small half bald running man should really stop offering people juice and omelettes with out telling that it have an extra cost. Front desk staff and cleaning staff were nice tho. Istanbul is a fantastic city, but next time we will probably look for a place in the Taksim area or Sultanahmet. Hotel ZÃ¼rich is not an option.", "Date": "November 18, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Location": "4"}, "AuthorLocation": "Gent", "Title": "“Hotel to avoid”", "Author": "traveller1039", "ReviewID": "UR47728975", "Content": "We stayed 4 nights and always unpossible to sleep before 1 a.m. because of very loud music in the restaurant although there is a discotheque in the hotel. When we complained at reception even difficult to understand each other due to the loud music. Our complaints were not taken into account! At breakfast, juice and scrumbled eggs extra to be paid for!", "Date": "October 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "The Mediterranean", "Title": "“Good Value all round”", "Author": "Calypso857", "ReviewID": "UR46292271", "Content": "We decided at the last moment to go to Istanbul for a holiday and after many attempts found 2 empty rooms at the Zurich hotel. When we read the reviews we were extremely worried but once we arrived there we were pleasantly surprised. The rooms (on the 4th floor) were very clean, the bed linen and towels in very good shape and the room was spacious and well decorated. The hotel is central, the breakfast is varied and good and we had absolutely nothing to complain about this hotel. I would not hesitate to recommend it other travellers.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Not so good as it seemed”", "Author": "GalaMak", "ReviewID": "UR42250374", "Content": "The hotel is typical city Turkish hotel of economy type - so don't expect too much. I haven't liked the location: it's not far from the main attractions but situated in the heart of the trading quarters so be ready to start the morning with the noise and walk constantly interrupted by the vendors. To the old center - about half an hour of the slow walking or 3-4 tram stops but the atmosphere is really different. It's rather the hotel for those who came to Istanbul for the cheap shopping than for those who came for attractions. The room was quite big but the furniture is rather old. The view is directly to the dirty street and the walls of another hotels. The textile looksdusty and unclean. The only one perfect thing in this hotel (but seems like it's the feature of lot of hotels in the district) is a roof restaurant. That was a real pleasure to have a breakfast on the roof with the view on sunny Marmara sea- very romantic. But after the breakfast - we've preferred to spend the whole day outside and return to the district and hotel only late at night. During my next visit to Istanbul I stayed in Taksim - and that was much better. Next time I'll try to chose some hotel in the heart of Sultanahmet - let's see. Love Istanbul and feel real pain about the recent disaster", "Date": "September 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Hotel Zurich should be sued for false advertising”", "Author": "Jasmine31", "ReviewID": "UR38330563", "Content": "When my sisters and I booked our holiday, we were really excited to be staying in a four star hotel with all the amazing amenities it claimed to offer. Imagine our surprise when we turn up at a dingy reception where only 1 guy spoke English and broken at that. We were then told that even though we'd booked our 2 rooms a few months ago, they would not be located on the same floor. To top that off, the 2 deluxe twin rooms that we paid for couldn't be more different. One of the rooms was a bog standard 3 star room with questionable cleanliness and the other one was heaven and beautifully decorated! Breakfast in the morning was interesting - we had to pay 6 lira for an dire orange juice and the tables were filthy. Then when we asked for an iron which on the website is \"available on request\", we were told in broken English that there was no iron but an ironing service is offered which you have to pay for obviously! One day we made the terrible mistake of ordering room service thinking that pizza is the safe choice but we were wrong! What came up to us was soggy and unappetizing. The most frustrating part was trying to explain what we wanted over the phone to someone who clearly didn't understand English, so much so that he had to come to our room instead and we pointed on the menu what we wanted! Feeling adventurous one evening, we decided to check out the hotel's disco and to our dismay, we found a seedy bar with questionable clientele and feared our own safety! To top it off, on our last day we asked if they could order us a big taxi as even though there were 4 of us, we had 4 suitcases which would not fit in the boot. But never fear, Hotel Zurich is here who proceeded to squash all our luggage in a regular taxi and 2 suitcases were hanging out! I have personally travelled to a lot of places and stayed in all manor of hotels but I wouldn't even wish Hotel Zurich on my worst enemy and can safely say it tainted our image of Istanbul and Turkish hospitality.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Toronto (GTA)", "Title": "“Don't recommend at all... MK Toronto”", "Author": "kmartyni", "ReviewID": "UR32055995", "Content": "Well, the only 2 good things i can tell about Hotel Zurich is a convenient location for tourists because all the attractions are not far away as well as a Tram & Grand Bazar and the Pool on the roof. The Service, rooms, food (especially breakfast where you have to pay for Juices, Espresso and Eggs !!!), stuff were VERY bad !!! People on the reception didn't speak any English and stuff was very rude to their guests. For sure that wasn't a 4 star hotel... I would never come back there as well as don't recommend it to anybody.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "(Asia,Europe, Africa)", "Title": "“IF ISTANBUL THEN HOTEL ZURICH”", "Author": "loosinajan", "ReviewID": "UR30012915", "Content": "Hello to everybody. My name is Lusin I am from Armenia.I have just returned from Istanbul/Turkey where I had an unforgettable vacation in May 2009. I stopped in \"Zurich\" Hotel which was really great.It really made my dreams come true.High quality service, all available activities lika swimming pool, sauna, turkish bath, massage, solarium, fitness center, beauty saloon, vapor bath. But most of all I would like to express my gratitude to one of the best receptionists whose name was Mehmet, very professional employee, real asset for his management. Choose this hotel and you won't regret. Thanks to everybody", "Date": "May 15, 2009"}], "HotelInfo": {"Name": "Hotel Zurich", "HotelURL": "/ShowUserReviews-g293974-d296328-Reviews-Hotel_Zurich-Istanbul.html", "Price": "$131 - $459*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Vidinli Tevfik Pasa Cad Harikzadeler Sok No 37</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34470</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "296328", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b2/3c/60/restaurant.jpg"}}