{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Magelang, Indonesia", "Title": "“Modern Hotel in Old City”", "Author": "AlexSantosa", "ReviewID": "UR127500563", "Content": "The breakfast is good, staffs are polite and able to speak english. We can found free internet wifi connection.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Old Hotel but nice”", "Author": "Letizia G", "ReviewID": "UR126816373", "Content": "After almost a week in the hotel I can say: - The service is great and the staff is well trained, helpful and speaks English - There is an awesome view from the restaurant - I got a corner room, very old fashion but charming. The/Coffee facilities in the room - Even though the hotel is not in the main city center there is a tram just in the from of the hotel to take you to Taksim - The only issue I met was with the WIFI internet connection but I was provided with a cable. - On my floor there were some very noisy clients, the receptionist try to help me but the hotel is certainly responsible for other client behavior. Istanbul is a awesome city and I recommand to visit it.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Nice view from the Restaurant”", "Author": "MsLovabledog", "ReviewID": "UR125891224", "Content": "the room is clean n nice but too small for comfort.. But e restaurant tat we had our breakfast is fantastic .. E view is breath taking. Oso they served 3 min eggs,( half boiled ) in which so far only tis. Restaurant have..", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“HAUNTED!!!”", "Author": "carolinakaro", "ReviewID": "UR125629210", "Content": "Why has nobody mentioned how haunted this hotel is? I got confirmation that it is by the hotel staff!! What i experienced: lights and tv switching on and off by themselves, woken up by ghosts when I was sleeping, you feel their presence and they tried dragging me out of bed. Ever seen the movie Paranormal Activity? Just like that. I heard noises and chants. The second night after being dragged out of bed I ran to my friend's room who was staying right below mine. I then heard on my room above heels clicking hard and objects being dropped. Freaaaky! The first night i was so scared i spent the night in the lobby by the restaurant which was closed. Yet, the lights and tv kept switching on and off. I cut my 7 day trip short and fled the country after 2 nights. DO NOT STAY HERE.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Great hotel, good staff, close to public transportation”", "Author": "ronnie20", "ReviewID": "UR122475327", "Content": "I stayed here with a group in October 2010. The staff was very friendly. It's close to the public rail system and you can go right to the Bazaar... not to be missed. You will hear the mosque alarm clock if you sleep with the windows open.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Great Hotel, will def be back! :)”", "Author": "Macy K", "ReviewID": "UR121845101", "Content": "Ramada Old City Hotel is really a great place to stay, I think it's perfect for families.. The location is very accessible to the tourist spots, and even if the hotel itself is not that big, it's very tidy and it has a friendly and safe ambience. It's my family's first time in Turkey (they came from Philippines for my wedding)and I was quite afraid the hotel wont meet their expectations. My family was even surprised to arrive in the room exactly as I have seen it in photos (I think it's even better!); plus they did personalize some stuffs in advance like my request for a 3rd bed for my nephew at no extra cost, extra slippers and robes, and of course, all our 3 rooms' LCD TV has a welcome banner for my family! The rooftop breakfast is perfect, the food and location is amazing. :) The hotel price is quite high, but it's worth every penny you spend. Check-out was swift, the staff are very courteous, and they speak good English :D More power, Ramada Old City!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Astoria", "Title": "“OK Hotel w problems”", "Author": "Ben S", "ReviewID": "UR120021582", "Content": "First, the positive things: The hotel is pretty well located, about a 20-minute tram ride to the main tourist area. It's in a pretty nice neighborhood. The (small) rooms are clean and some have nice views of spectacular mosques. In the context of the prices of other Istanbul hotels, the value is pretty good. Some of the people who work there are very nice and helpful Real Problems: Some of the people at the front desk are rude and extremely unhelpful. When a friend of mine, a Turkish-speaking local, called and asked to speak to me, the person at the front desk refused to look up the room that I was in and connect her to me and hung up on her. The \"business center\" is pretty inadequate. There are 2 computers but one was broken the entire week that I was there and the working was was so obsolete as to be difficult to use at times. It was hard to use it also because with only one computer, there was a long line. The line was longer because hotel staff members used it to chat on Skype while guests waited. The hotel tried to steer me towards the buffet breakfast without mentioning that, while it is complimentary for most people, it is a whopping (and hugely overpriced) 20 euros for people who book through Orbitz. It's also the only hotel in that price range that I know of that reuses the boxes for the soaps in the bathroom (sanitary?). In all, the location is pretty good and value is pretty good, but there are real issues to be aware of. And probably not the best place if you need to do business (have access to a fax machine or scanner) or if you want access to the internet through a hotel computer.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cedar Rapids, Iowa", "Title": "“An outstanding view of the city plus a competent hotel all in one.”", "Author": "mjrg59", "ReviewID": "UR119541210", "Content": "A not-so-big hotel in a good location that affords a fantastic view of Istanbul from its dining room and terrace. The breakfasts were very excellent with many varieties of food.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Mn", "Title": "“Good hotel”", "Author": "Sandi123Mn", "ReviewID": "UR118701333", "Content": "This hotel is located on the outer edge of \"Old City\" but the tram runs directly in front of it so it is quick & easy to get to the historic sights. I booked it through a discount website so breakfast was not included. Although it is good, it is very expensive ($20) for a buffet of only average selection. The staff is very accommodating & speak English well.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Quality hotel in a place where many of the \"quality\" hotels aren't quality”", "Author": "Badsie", "ReviewID": "UR118570947", "Content": "After staying in a couple of places in Turkey that did not meet my expectations, this hotel was great. The staff were very friendly and spoke very good English. They went out of their way to be helpful. Turkish bath was really good and worth doing. Just make sure you specify non smoking as they do have smoking rooms/floors. I Would stay there again.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Excellent choice”", "Author": "lolla23", "ReviewID": "UR118462305", "Content": "I have stayed at Ramada old city four times, twice for business and twice for leisure. On the business trips, although it's a 4star hotel, yet the business center is reliable and fully equipped, wi-fi in all rooms and meeting rooms were fully equipped (air condition, sound, light, projector and a very rich coffee break) As for leisure, the hotel staff were extremly helpful, 100% garateed to be clean, very comfi beds and pillows, LCD and minibar. Bathrooms are extra clean with hot and cold water. (unlike many 4star hotels in Istanbul, this one is 100% reliable for being clean and comfi beds). The only issue is that the rooms are kinda small, so if you are Big&Tall, ask for a superior room. Breackfast is very rich including all sorts of bread, eggs, hot and cold varieties and juices and coffee or tea and the service is very fast and people are very friendly and polite. The location is a bit far from the historical area (20mins tram ride) but compensated with bus station, taxi stop and tram station litrary at the door step, in addition to the option of the yellow minibusses passing by the doorstep. The area of findikzade is alive, with plenty of groceries and supermarkets for water and treats shopping, in addition to a large and good shopping mall just at the adjacent back street (u cant miss it). This is a 100% recommended hotel especially for elder people not tolerating bad service, hard beds or uncleanliness. Thanks", "Date": "September 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Aberdeen, Scotland", "Title": "“Excellent Location”", "Author": "Barbarous", "ReviewID": "UR118357132", "Content": "Excellent location close to the main attractions. Great view from the restaurant. Rooms were a little on the small side but were clean and well maintained.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Varese", "Title": "“Nice Hotel”", "Author": "dancefloork", "ReviewID": "UR118102646", "Content": "In good position, with a tram stop very close. Hotel have nice modern rooms with free tea and coffee, free Turkish Bath. The breakfast was a rich buffet, with a suggestive view on the city", "Date": "September 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Well located & comfortable hotel”", "Author": "Mia K", "ReviewID": "UR94204067", "Content": "With the tram line/stop very close by, this hotel gives you easy access to all the main sights. Although small, the rooms were modern, clean & included tea & coffee making facilities in each room. I did not eat dinner there, but the buffet breakfast was good - plenty of variety & a terrific view through to the water. Wifi was free & worked well. Airconditioning centrally controlled & was overheated for our January stay.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Lisboa", "Title": "“they should be rated 3 stars...”", "Author": "pspires", "ReviewID": "UR82622865", "Content": "Far away from the \"Old City\", to be called like that. small rooms, clean. They tried to avoid the dinner included on the package. After claim to agent they gave us the a fix menu at the bar... They have a restaurant on the 7th floor... The view fromthat restaurant is the only thing spetacular of the hotel!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Pleasant stay”", "Author": "Zuzka123", "ReviewID": "UR64058172", "Content": "We spent three nights in Ramada Istanbul Old City hotel. Everything was as you would expect from a 4* business hotel. The room was on the smaller side, but this is typical for hotels in downtown Istanbul. The room and the bathroom were both clean and in a very good condition. Most of the rooms in the hotel are facing a busy road and also there seem to be about five mosques in a very close proximity, but the double windows do a very good job and we didn't hear a thing from outside. We could however hear the shower and toilet flushing of our neighbours. Can't comment about the breakfast because it wasn't part of our package, the hotel charges 15 euro per person, which we though was a bit silly to pay bearing in mind the local places, where the 4 of us could eat for the same amount. There is a free WIFI with reasonable speed in the hotel. All the staff were very nice and helpful (and trust me I do not say this very often). The hotel is about 6 tram stops away from the main sights like the blue mosque, the trams are modern and easy to use, but at times they get very busy and crowded. I felt a few times on the tram that the local men \"enjoyed\" being crowded with me, which wasn't a very pleasant experience, so ladies watch out...", "Date": "May 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“very good service, near all transportation, clean..I love it”", "Author": "NoraH16", "ReviewID": "UR52571200", "Content": "i went there second time during Jun 2009. I feel their like at home.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Al Khobar, Saudi Arabia", "Title": "“Clean, comfortable good value hotel”", "Author": "Hoods_Travels", "ReviewID": "UR50859848", "Content": "The Ramada Old City is a decent hotel appointed with modern furnishings. The only minus point really is that the rooms are small and the conference rooms are in the basement. I had an upgraded room on the 2nd floor which had a separate living area and bedroom. Small but nicely decorated/ furnished. Staff are friendly and helpful and the roof top restaurant has nice views. The location is little away from the heart of Sultanahmet so if I was coming to visit the main historical area then I'd try to find something closer to the Blue Mosque etc. The hotel is just 20 minutes from the airport but you'll need to take a taxi to most sights.", "Date": "December 8, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "California", "Title": "“Great Place to Stay in Istanbul”", "Author": "California86", "ReviewID": "UR36944017", "Content": "We stayed in this hotel for five summer nights. We found the staff to be very friendly and very helpful. We especially enjoyed chatting with the woman who manages the well-stocked little gift shop, who gave us some great tips and suggestions for our time in Turkey. The rooms were small, but clean, well-equipped, and comfortable. The restaurant downstairs served a good selection of beers and other beverages, and the food, a kind of hybrid of Turkish and American cuisines, was good. Wi Fi in the room was free. Breakfast was served on the top floor, which offers a wonderful view of the city and the Strait. The food selection was excellent, and the staff went out of its way to provide good service. For example, my wife mentioned to one of the staff that she especially enjoyed a certain kind of bread. The next morning we arrived too late and none of this bread was left. Without a word, a member of the staff went downstairs to a next door bakery and surprised my wife by presenting her with a basket of exactly the bread she missed. In short, we think that this hotel is a great place to stay in Istanbul.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC", "Title": "“Great Hotel for Business or Pleasure”", "Author": "c2u4ze2im", "ReviewID": "UR25428219", "Content": "My company hosted an event at the Ramada Old City back in January, which I coordinated with the hotel. The hotel staff, environment, food, etc must have been the best I have encountered to date during my event planning. The staff went out of their way to help me in arranging airport transfers, meals, rooms, training rooms, and tours for my clients who stayed at the hotel for one week. The business facilities at the hotel are top notch, with plenty of meeting space (we had 50 people) and plenty of internet access. The hotel is also great for tourists. I was able to have two free days during my stay, and the hotel location in the heart of the Old City is great! A simple 15 minute walk to the Ancient Aqueducts, or the Church of St Saviour in Chora (beautiful mosaics) makes this an ideal location. Also the Grand Bazar and Blue Mosque/Hagia Sophia complex are only about a 15-20 minute pleasant stroll from the hotel. There are plenty of great restaurants near the hotel as well as a major shopping center with fast food establishments such as Burger King, KFC, and Pizza Hut. Overall I would recommend this hotel to anyone traveling to Istanbul who wants the comfort at home at bargain prices. THIS IS A GREAT PLACE, and I plan on staying again soon!", "Date": "March 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "brussels", "Title": "“ambassador of the famous Turkish hospitality”", "Author": "siwafan", "ReviewID": "UR16061607", "Content": "Coming back from another business trip to my favorite city, Istanbul, I stayed at the Ramada Old city this time and I must say that my stay was extremely pleasant: well appointed, newly renovated rooms with comfortable beds, the hotel is really clean and the English pub on ground floor had a lively atmosphere (I was there on weekdays). Breakfast is served on the top floor, with views all over the city. I was very happy with the breakfast choice trying out all kinds of local cheeses, tasty olives and tomatoes. The location is perhaps a not in the direct vicinity of the tourist highlights, but at least it is in a authentic part of the town and the tram (stop is very close)brings you to the Sultanahmed in no time. Also, I am a female travelling by myself for work and felt absolutely comfortable in and around the hotel. (I read the review of a fellow guest on her way to Tashkent but must say I did not experience anything of the kind (and I don't look like Frankenstein :-) But what makes me write this review, is the friendliness of the staff. They were amazing at trying to make my stay as comfortable as possible and I really think that is what hospitality starts with! Hoping to return soon!", "Date": "May 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Volos, Greece", "Title": "“thin walls , small rooms , certainly not a 4* star hotel”", "Author": "Kyriaki", "ReviewID": "UR15949195", "Content": "My husband and me stayed at Ramada old city hotel , visiting the Istanbul Sodex Exhibition.The reason we chose it was because it seemed easily accesible to both the Exhibition and the old city . Not at all : to the airport / exhibition , you had to take the metro , station Emniyet about 1km walking from the hotel, so we took a taxi .We paid three different prices , due to the traffic conditions : 20 , 25 , 30 euros each time . As far as the Haghia Sofia , it was seven tram stations away , with a metro crowed with people . As far as the hotel itself : the walls are so thin that you could hear the person next room talking to the phone , or waching TV. Room is rather small for a 4* star hotel . Breakfast is rather rich , but i did not find it tasty . The porters were vey helpful and friendly but Ican not say the same thing for the receptionists . The good thing was the free internet in the business center . Overpriced , mediocre hotel .", "Date": "May 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Breda", "Title": "“Great Hotel on a good location”", "Author": "Escape-traveller", "ReviewID": "UR14765300", "Content": "When staying at this renovated hotel, I was pleasantly surprised by the friendly staff and the rooms. Having breakfast at the top floor restaurant gives you an amazing view on the city.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“Liked this hotel”", "Author": "Intrepid_simian", "ReviewID": "UR12360093", "Content": "My family and I just spent the time around new year 2008 in this hotel. The hotel is nicely located, with easy access to the sights of the old city. The metro stop Findikzade is just in front of the hotel. There are plenty of shops and eating places around the hotel, albeit mostly Turkish. On Fridays (and possibly other days) there's an open air market in one of the streets across the hotel. The area appears to be quite safe - we went in and out until about 10 pm, and did not feel unsafe. The hotel staff are wonderful and a real asset, I think. Overall, my impressions - good price, good location (for tourists), and good facilities.", "Date": "January 5, 2008"}], "HotelInfo": {"Name": "Ramada Istanbul Old City", "HotelURL": "/ShowUserReviews-g293974-d296327-Reviews-Ramada_Istanbul_Old_City-Istanbul.html", "Price": "$132 - $215*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Millet Cad No. 82</span> | <span class=\"extended-address\">Findikzade</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34270</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "296327", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b1/0f/b10f90957f41a051e01766946604a1fb4large.jpg"}}