{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Old, cramped, noisy area”", "Author": "toygim", "ReviewID": "UR128422433", "Content": "Stayed at the Germir for 1 week in April 2012. The first room we had faced a concrete wall and the A/C didn't work for the entire building. We were moved the next day with no complications. The rooms are small, dark and dated. The beds were extremely uncomfortable; my hips and back felt like they were bruised. Bathrooms were updated; again very small but functional. After every shower there was a large puddle of water on the floor. Talked to the management about it, they sent someone to check on it but he just said don't worry about it, turn the nozzle against the wall. Okay, it's not my home! The location is noisy with lots of street and people traffic. On a few occasions there was loud music and noise coming from the street in the middle of the night. Breakfast was ok with exactly the same items every day. They close at 10:15am and I do mean promptly. First a verbal warning \"breakfast is now finished!\" and then they clear everything out in 5 minutes! Germir is very near Taksim Square and the Taksim funicular so it is very easy to get around. However, most of the sightseeing is around Sultanahmet area so if we were to go to Istanbul again we would choose a different area. Thanks to the gentleman at reception in the evenings. (Sorry, I've forgotten your name.) He was very friendly and helpful. I think there is better quality for the price out there so I can say I would not return to Germir Palas.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Alexandria", "Title": "“Cleanliness & lights”", "Author": "Bassent F Posted by an Easytobook.com traveler", "ReviewID": "UR127064478", "Content": "The clerks were nice welcoming, however the room wasn't clean I.E bed sheets weren't clean in addition to the lack of lights. The room was very dark even during day time. Noises were unbelievable, could hard sleep! Location was perfect next to subways & buses stations in the heart of Taksim.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "istanbul", "Title": "“Average+”", "Author": "Kemalk_52", "ReviewID": "UR126765562", "Content": "Excellent location,british style interior,rooms could be little bigger,bathrooms need to be renewed(not suitable for older guests-too high to get in to the shower) Very friendly staff,wonderfull view roof restaurant...Breakfast concept could be better..some items missing,like as omelettes and pancakes,but quite well on other items..", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK/Oludeniz", "Title": "“Home from home in the city.”", "Author": "Willintohelp", "ReviewID": "UR125064423", "Content": "I had read the other reviews so was expecting to have a pleasant experience but the Germir Palas excelled my expectations. Very pleasant and attentive staff, one took our shopping up to the rooms while we were having a drink, no fuss, just superb, caring service. I can endorse the other positive comments wholeheartedly: supurb convenience, the airport shuttle is directly across the road; Taksim, Istiklal Street and its' shops, restaurants and atmosphere are a very short walk away. The hotel itself is just as the photos portray. TV had several non-Turkish channels, of particular interest to me were the English language ones and these included BBC World and Entertainment. The free internet signal in my 6th floor room was very strong and easy to use. I was there in February and the nights were very cold but the hotel was cosy and warm the minute you stepped inside. The room temperature was too hot for me at first but was easily controllable in-room. Lots of hot water, all the usual toiletries are provided. The free room safe was easy to set. Well stocked mini-bar. Lavender bag by the pillows. Excellent breakfast. Attention to detail is what makes the difference between a good hotel and one which is remarkable, Germir Palas is remarkable. There was even an umberella in the wardrobe. The staff were the icing on the cake, no corporate robots here, warm human beings with a smile and a personality, and this was true from the room cleaner to the reception staff. The staff were brilliant. Istanbul is a wonderful city and this hotel is a wonderful home-from-home in this city. I live in the south of Turkey now and come to Istanbul several times a year. I will, definitely, use and recommend this hotel.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“Very clean, great location”", "Author": "gobluego", "ReviewID": "UR120516799", "Content": "We stayed here for two nights and found it to be spotlessly clean, lavishly decorated and quite central to transit. The classical rooms were replete with a comfortable bed, featuring multiple pillows and cozy bed sheets. A tip of the hat goes to a very professional staff. The breakfast was plentiful and varied and didn't disappoint. The hotel is extremely convenient to the airport shuttle bus (it is right across the street) and there are buses to both of Istanbul's airports for about 10-12 lira. The metro is also located conveniently within steps of the hotel's front door as is the Ischital shopping area where there is plenty to see and do.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thousand Oaks, California", "Title": "“Excellent all around”", "Author": "dragon789wv", "ReviewID": "UR119809178", "Content": "My wife and I traveled with a tour group of 44 for 2 weeks in Istanbul, 4 of whom were friends. Stayed here for 2 nights each at beginning and end of tour. Rooms are decent, nicely furnished, very clean. However, the TV was tucked into a corner and you had to turn your head to one side to watch, and needed to lean halfway in the bed in order to use the remote. Great location for restaurants, shopping, or just walking around! Bus drop-off right in front of hotel; workout room, one PC for Internet. Dinner okay, chicken salty. Great breakfast with lots of fruits, cereal, breads, meats, 3 & 5-minute eggs.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Location..”", "Author": "chomi", "ReviewID": "UR119655166", "Content": "We stayed for a week in Germir Palas Hotel, Taksim, Istanbul for a week in month of September. The hotel is very easily accessible by the Airport shuttle (Yavas), as it terminates right in front of the hotel after a 45 min ride. The Yavas airport shuttle costs 10TL, Reg the hotel, it is very well appointed. Nice and warm lobby, with very comfortable rooms. The staff are helpful. We got a room on 6th floor on the right side as soon as you get off the elevators. These room was not street facing, and was quiet. The breakfast on the terrace was good, and has plenty of choice. Excellent coffee to kick start the day. Accessibility to old town was very easy. Taksim square (right opposite to the hotel), there is a funicular going to tram stop called 'Kabatas\". From there trams take you to old town. The total commute takes less than 30 min, and costs 4 TL each way. Nice hotel, very convenient location, good restaurants nearby makes Gernir palas a good hotel to come back to while in Istanbul", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Nice hotel - indifferent staff”", "Author": "_C_964", "ReviewID": "UR119190138", "Content": "The hotel is really well located if you want to go shopping / drinking / dining around Istiklal. The rooms are very nice and clean.The staff is doing his job right, just not very interested in knowing how things are going. I would recommend to ask a room which is not facing the main street because it is very noisy.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "belize", "Title": "“Great location, great service”", "Author": "mariu40", "ReviewID": "UR113647788", "Content": "As part of our turkey tour, this was our first and last hotel where we stayed in. They have a central location, easy to get taxis, access to restaurants and shops. The rooms were clean and comfortable, safe in the room, free Internet, Ac worked fine. The staff was very helpful also. We had dinner at the restaurant, the food was good but they were understaffed and made some mistakes with the orders, but they had a great attitude. breakfast buffet was ok also, not ,any fruits available, but many different kind of olives were available.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ft. Lauderdale, Florida", "Title": "“Charming European Elegance”", "Author": "flaphoto", "ReviewID": "UR113342072", "Content": "We really enjoyed our stay here. Very convenient to public transportation. The rooms are fairly large and traditionally European. The staff was always helpful and friendly. Our first morning we slept through breakfast, but the staff made us each something even though the restaurant was closed. The breakfasts were among the best I've had in any hotel anywhere. The hotel is a little pricey, but well worth it.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kutztown, Pennsylvania", "Title": "“Great location, small, noisy rooms”", "Author": "Pnemiller", "ReviewID": "UR84724810", "Content": "We were on a tour and stayed at the Germir at the beginning and end of the trip. The best thing about the hotel was the terrific location, a short distance from Taksim Square. It is on a noisy street and if you have a room in the front the noise can be a bother. This is an older hotel with a classic look--we felt that the rooms and bathrooms were small, although not uncomfortable. There is a safe in the room which was tiny and could only hold a few items. The hotel indicates that it has WiFi, but we found it was very inconsistent and rarely could get on the internet. There is one computer for use in the small lobby area. We had 2 breakfasts and one dinner, buffet style, in a cramped room in the basement. The meals were adequate. The coffee in the morning was excellent.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rayleigh, United Kingdom", "Title": "“Central location - comfortable but noisy rooms”", "Author": "CDM52", "ReviewID": "UR79530244", "Content": "Location is close to Taksim Square, on a busy road. it was very noisy. Room was comfortable and the entire hotel has is dark with a style from 50 years ago. We travelled with a group and the dinner was not great and served in a basement room. Breakfast on the room garden was much more pleasant - as was lunch in the small bar/ restaurant.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "USA", "Title": "“Not bad; got it for a good price; otherwise, not worth it”", "Author": "GlendaleCA", "ReviewID": "UR67875188", "Content": "I got a great rate off hotels.com. No way I would be their full price. Pros: Clean Central in Taksim near the square (but also a con) Decent sized room Good breakfast Nice roof terrace Cons: TV from 1981 Bed that felt it had been dry-rotted out. The bed was flat-out awful Very old style furnishings and dark in the room. Felt like an old person's bedroom. Not the type of old-style furnishings that feel luxurious or chic. Staff that knew very little about anything (transportation, how to fix the internet, things in the area, etc...although they were generally nice) Windows had ZERO soundproofing and the street this hotel is on is beyond super busy. Beyond. It is the only hotel on this street in the area. There are many hotels on side streets a 1-2 minute walk away that are out of the extreme noise. I don't mind some noise either but it is amazingly noisy till late hours. Also, there are people lined up to take bus transportation right outside the hotel. So often, there is a line formed that is very long that goes in front of the hotel and you have to battle to get in the door. Very frustrating. All in all, it is in a safe area, but you would be wise to stay @ one of the places literally down the street. It will be 10 times more pleasant with noise. That is unless you find a deal you can't refuse. This is not a bad place at all, just not charming like it looks on the website. It is more dark and dreary yet clean.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tehran, Iran", "Title": "“Excellent Hotel, Great Location”", "Author": "JarchiBashi", "ReviewID": "UR64828057", "Content": "I stayed Germir Palas for 5 nights and pleased it. the location is great, by the Taksim square and you can go every where in the city from Taksim also the HAVAS (airport bus) bus station is across from the hotel.The hotel has WiFi service and there is a PC on the lobby you can use it to connect to internet. The rooms are medium size and so nice with very comfortable beds. interior design of the hotel is nostalgic and it's like an English club. The staff are really nice and helpful I thank Mr. Unal, Mr. Cavit, Mr. Erdem and the others for their hospitality.", "Date": "May 20, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“Great Hotel, perfect location”", "Author": "Dimka7", "ReviewID": "UR34561513", "Content": "Was staying one night in this hotel prior to going back to US. It is a nice, clean, well maintained hotel with nostalgic victorian wallpapers in the rooms. Rooms are of medium size, beds are good, sheets are clean and pillows are comfortable. The breakfast served on the top of the building, on an open patio with beautiful vista of Taksim square. This hotel opens to Taksim square, so for those who like to be in the epicenter of various events, it is a perfect spot. There is airport bus departing from across the street every 1/2 hrs. Metro is at Taksim square and Istiklal avenue with a boiling life is at your feet. There are nice narrow streets with numerous small stores and restaurants around this hotel. The staff is courteous and helpful.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“great location - helpful staff”", "Author": "djarum", "ReviewID": "UR32302490", "Content": "I stayed in germir palas for 3 nites and i was there for some business. Its just on the other side of the street where we have the Havas - Airport Shuttle Bus Stop in Taksim !! No need to carry your bags, no need to take a cap and get fooled if you dont know Istanbul.. and the staff let me do early check-in and late check out. I was in the 7th floor and i stil had high speed wifi in the room, the armchair with the leg laying sofa was so relaxing and comfortable that i use my computer there ;-) The bathroom was so clean and renewed. Altho the hotel is located in a noisy area i didnt hear any noise because i was in the upper floors, so go for it .. and i would like to mention that the breakfast was really nice and it was available for various ppl who have different tastes.. - fresh fruits , cornflakes, warm eggs & sausages/sucuks & types of cheese & olives, tea & coffee & water & juice...", "Date": "June 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tromso", "Title": "“Very nice hotel”", "Author": "hufsa", "ReviewID": "UR28726357", "Content": "I stayed at the Germir Palas 5 nights in september, and was very pleased with the stay. The hotel interior is old fashioned in a charming orient express way which I liked. The room was clean and quiet and with good a/c. Nice bathroom with bathtub. The breakfast was a little boring, but the coffee was good and the breakfast \"room\" at the roof terrase was lovely with wonderful views. A lovely hotel all in all.", "Date": "April 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Lovely small hotel.”", "Author": "traveling_geek_14", "ReviewID": "UR16659633", "Content": "The Germir Palas Hotel is located around the corner from Taxim Square and just across the street from the pick up/drop off point of the airport bus line. Higher floors are less noisy and there is always the possibility of closing the sole window and relying on the air-conditioning. The rooms and loby are plush and comfortable, and since it is a small hotel you are treated like a guest, not just one of a hundered bodies in other larger establishments. Suprisingly, the breakfast was a bit bleak (no fresh fruit, small basement dining room, no possibility of ordering a turkish coffee or espresso) and at the time of my stay there was no internet (lan or wi-fi) in the rooms.", "Date": "June 4, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“Fantastic Location; Great Value; Nice Details”", "Author": "pmohanram", "ReviewID": "UR7756293", "Content": "My wife and I stayed for six nights at the hotel. It is located around 200 m from Taksim square, which makes it super convenient for getting around Istanbul. The hotel lobby is very tastefully decorated with lots of wood panelling and lovely rugs and couches. The hotel is generally well maintained. The rooms are also tastefully decorated. Beds are comfortable, sheets and towels are very nie, bathroom was excellent. Only downside - the room is a bit small and closet space/storage for suitcases was a bit lacking. Breakfast was generally excellent but monotonous - eggs, cold cuts, wide variety of breads, pastries, cheeses, and nice produce - tomatoes, onions and amazing olives, tea/coffee, milk and cereals. I guess by mixing it around it's not too bad. The location is fantastic. Around a quarter mile or so is the pedestrian boulevard that is filled with wonderful and inexpensive places to eat. The staff was uniformly friendly and nice. A case in point - I purchased an \"Akbil\" or prepaid refundable metro card. On checkout day, the bellhop offered to \"buy\" it from me at whatever I said was the value on it plus deposit - saving me the trip and wait as well as the loss of unused value (the authorities will only refund the deposit). The only two negatives - they have no irons in the rooms, none are available and laundry charges are expensive. Also, they have a fantastic terrace lounge where we often dropped in for the city view (including a view of the Bosphorus and the bridge) but a glass of white wine was 15 YTL (around 12 USD), a bit of a ripoff. All in all, a great little hotel.", "Date": "June 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“A comfortable and well located hotel”", "Author": "WinstonB", "ReviewID": "UR6646987", "Content": "Stayed at this hotel on 2 occasions. It provides an island of peace in this part of town and the stay was very enjoyable. It feels like staying in an English Gentleman's club. Only downside perhaps are the cost of drinks at the bar and the slightly dull breakfast room in the basement, but otherwise a great place to relax and a good service.", "Date": "January 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "milan, italy", "Title": "“Average value for money”", "Author": "lucaerrante", "ReviewID": "UR6124118", "Content": "Convenient location, not too noisy (at least if you stay in the rooms facing the side streets), small rooms for two people, outdated furnishing, not very expensive rates. An average hotel.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Everything is about details”", "Author": "gdekui", "ReviewID": "UR5532017", "Content": "Like so many other big chain hotels, Germir Palas is located near Taksim Square but outstands easily these hotels (Crystal, Golden Age 1 etc.) by many detailed qualities like the interior design, atmosphere, quality of the breakfast, service and cleaniness. Our other friends were staying around Taksim as well and one day we did this tour to check out each others hotel rooms. Despite it's near Taksim Square, we were not disturbed by noises outside at the busy street. Our friends envied us for our choice for Germir Palas was indeed the best in comparision of their hotels. We stayed in a standard double room (twin bed) for 5 nights for a special conference price of 70 euro per night, so I guess the normal price should be around 90 - 95 euro. Our room is a bit small but it has a walk-in cupboard, a fully and newly equipped bathroom with good amenities. The interior and furniture are in 19th century style but that didn't feel old at all, rather in a well-kept condition. The family that runs this hotel used to produce textile -- the wonderful quality of the bedsheets easily confirmed this story. I was most impressed how clean everything was. We never walk in hotel rooms without wearing slippers, but this time we just forgot to do so because the cleaniness of the room invited us to act like at home... Each morning we looked forward for breakfast at their beautiful rooftop terrace with view on the Bosporus and the city, with a good variety of cheese, fruits and breads. This is perhaps one of the most comfortable hotels that I stayed in of all my European trips. It's a treat. It's all about details.", "Date": "July 31, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved the Germir Palas Hotel!”", "Author": "cantravel1", "ReviewID": "UR5225851", "Content": "We stayed at the Germir Palas Hotel as part of a tour from May 7th to 9th and from May 20th to 23rd. We really loved this hotel...the rooms were tastefully decorated, clean and very comfortable. The beds were extremely comfortable with fluffy duvet covers. The hotel itself is only approx. 49 rooms, so the staff does get to know you. Breakfast was included, and although the breakfast was located in a small dining room, the food was good and plentiful. The location of the hotel is wonderful also. The hotel is a block away from Taxsim Square and there are a number of good restaurants nearby. Overall, I would definitely recommend this hotel and would stay there again.", "Date": "May 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Philadelphia", "Title": "“Taksim hotel”", "Author": "docinphila", "ReviewID": "UR4051079", "Content": "Very conveniently located on Taksim Square right across the street from the airport bus. Belle Epoque lobby lovely to sit in. Comfortably furnished room. Helpful staff.", "Date": "October 25, 2005"}], "HotelInfo": {"Name": "Germir Palas Hotel", "HotelURL": "/ShowUserReviews-g293974-d296332-Reviews-Germir_Palas_Hotel-Istanbul.html", "Price": "$118 - $236*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Cumhuriyet Caddesi No 7</span> | <span class=\"extended-address\">Taksim</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">80090</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "296332", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/36/0e/9c/hotel-entrance.jpg"}}