{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Guildford", "Title": "“If you can avoid it, please do!”", "Author": "Saif5042", "ReviewID": "UR127846732", "Content": "we were also lured by its decent reviews on tripadvisor. however our actual experience was only a tad better than horrible. Hot room with no ventilation; when u try to open the window the handle breaks and the noise from the road down below is so horrible that you cannot sleep; could not even arrange for a table fan; no ironing facility let alone kettle and other stuff; what was called minibar was actually a dysfunctional fridge with stale items contained within it; in the toilet, if you flush, the sound of water entering the flush tank will never stop until you go back and manually lift up the flush lever; you would forever struggle to get hot water and if you do its never guaranteed that it will stay at that temperature for the duration of your shower. all in all - a truly budget hotel meant only for shoe-string budget holidays.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Worst Hotel I've stayed in”", "Author": "buzz444777", "ReviewID": "UR127040082", "Content": "The Santa Sophia is the worst hotel I've stayed in. My room is so small I have to walk sideways to get between the bed and the table. The wireless keeps going off. The waste water from rooms above me goes right through a pipe in the wall of my room and it is very noisy. The walls are so thin that I can hear conversations two rooms away. The staff start cleaning very early in the morning and seem to delight in banging everything as loudly as possible. The front desk personnel are sometimes surly but the porter is superbly helpful.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Amazing People”", "Author": "Sra7", "ReviewID": "UR123825572", "Content": "This hotel is right in the heart of Sultanahmet (5 mins from Blue Mosque, Hagia Sophia, and Grand Bazaar). Breakfast is great. Very reasonable price. The staff are some of the sweetest and kindest people you'll meet in Istanbul! If you end up staying here, be sure to talk to Turan (great communication skills and very knowledgeable), Birol (very nice and helpful), and Yusuf (also very nice). Safe travels!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Portland", "Title": "“Santa Sophia hotel--GREAT!”", "Author": "Rosina C", "ReviewID": "UR122931031", "Content": "We stayed there 4 nights on the first run and a return of 2 more nights. Onder and Loman at the front desk are AWESOME--transport to and from airport. SOOOOOOOO reasonable, fabulous breakfast, nice side street, easy walking to all the key attractions, including Grand Bazaar and on tram line, one block away. Clean rooms, wonderful breakfast too. helpful staff, kind, friendly and an overall FABULOUS experience. Do not pay more!!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kiev", "Title": "“Very nice hotel!”", "Author": "Julia V", "ReviewID": "UR122453794", "Content": "This hotel is so nice! At first we booked another hotel, but it was in reality it was terribre and we decided to change it. The free room was in Santa Sophia. The place in the center of Istanbul, good prices, clean and very nice room, sea view, delicious breakfast, careful staff. We spent a very good time there.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Debrecen, Hungary", "Title": "“It was great to saty in this hotel.”", "Author": "annavacsi", "ReviewID": "UR121280443", "Content": "It was great to stay in this hotel. The location is simply perfect, it is in the heart of the Sultanahmed, which is home of many toursitic places. It has a great atmosphere with a friendly and helpful staff. I am looking forward to spend some days tere again. Thank you very much.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Debrecen, Hungary", "Title": "“nice price and good services”", "Author": "sinan s", "ReviewID": "UR121220322", "Content": "during stay in santa sophia , it is best thing , very near for best place area and so helpless staff and so clean hotel ,,, i loved it ,,, and i am looking forward to go there again ,, thank you guys :)", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zonguldak, Turkey", "Title": "“It was a great week in this hotel.”", "Author": "sercan m", "ReviewID": "UR121220288", "Content": "It was really great week in this hotel. The staff were really so friendly and helpfull. They cleaned our room every morning, and the breakfast was also so tasty. And the place of the hotel is just in the middle of Sultanahmed. You can walk to any historical place. I would love to have another week in here.Thanks alot.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, England, United Kingdom", "Title": "“Enjoyable stay”", "Author": "Kim A", "ReviewID": "UR120173486", "Content": "The hotel is in a very convenient location close to the tram stop and within walking distance of the main tourist attractions such as the grand bazaar, St. Sophia church and the Sultan Ahmet mosque. It is also not far to the water front and main tourist areas. Our stay was very pleasant, the rooms are clean and the staff was very friendly and helpful. We really enjoyed our stay.", "Date": "November 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“It is a real gem in the heart of the Old City”", "Author": "ugurdy", "ReviewID": "UR117371658", "Content": "We've stayed there 10 days to visit almost all the ancient history around the area. I have to admit that the hotel has a great location! It is right in the middle of the Sultanahmet Square and Beyazit area which is very close (5 min. walking distance) to Grand Covered Bazaar, Blue Mosque, St.Sophia, Museums etc. I can say we only walked to reach anyplace we wanted to go. In addition, public transportation is only 100 yards away from the hotel in case you want to go to the public boats and other main transportation center. It was all convenient for us. Many restaurants, super markets are around there like you fell yourself at home. I don't think I could find a better location than that to spent my entire 10 days holiday. Hotel rooms are great, clean and in decent size. Breakfast was awesome! I could find different kind of cheese, olives, pastries, cakes, fruit juices, breads, traditional sesame bagels (simit), good quality coffee, tea etc. Service was great, Front desk, restaurant service and bellboy staff were very helpful and friendly. You can't beat that! We got all the answers from front desk for the questions we asked. They offered us Bosphorus and Princess Islands tours which were great and very enjoyable! I recommend them. Room was cleaning everyday by maids and they change the towels and sheet if you requested even everyday. Ohh I have add this; hotel lobby was gorgeous! It was very comfortable, stylish, well decorated! There are some chair and table you can sit front of the hotel and enjoy your drinks at night! It is overall nice charming, clean hotel which is well worth what we paid right in the heart of the Old City of Istanbul. Don't miss it!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“lovely and helpful staff, decent room”", "Author": "RUMAY", "ReviewID": "UR115152877", "Content": "the staff are really helpful and friendly staff. and the hotel is a perfect location for all the important sites.the breakfast was okay, but kind of boring, there is no cereal or fresh fruit except watermelon. the room was clean on arrival, but we stayed for 6 nights and it wasn't cleaned during our stay especially the bathroom, although fresh towels were provided everyday. for a budget hotel it was great and if i were to have a budget holiday again i would stay at Santa Sophia.", "Date": "July 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“A Pleasant Surprise”", "Author": "DAAziz", "ReviewID": "UR109894632", "Content": "My friend and I were pleasantly surprised with this hotel. We were worried before we arrived as the route to this hotel had bad traffic...but all that disappeared within minutes of our arrival.. The lobby was clean and nice. The receptionists and staff were very courteous and helpful; including bookings for the tours. The room itself was ok with all the basic facilities working well. Internet wireless was free. From this hotel, we only needed to walk about 10 minutes to reach the blue mosque, ayasophia and sultanamet square.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Hello from Switzerland”", "Author": "pilletvirginia", "ReviewID": "UR86174723", "Content": "We've had an nice holliday in Istambul. The hotel Santa Sophia is correct quality /price. the rooms are simple but clean. 3 Staffs very friendly, Turan, Yusuf, and the \"young barman future maried\". We thank you all. See you soon. bye Virginia and Danielle", "Date": "November 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oradea, Romania", "Title": "“Didn't liked much”", "Author": "Cris_Daniela", "ReviewID": "UR83302602", "Content": "The only good thing was location - very near to touristical points as hagia Sophia , Blue Mosque, Grand Bazar, etc. Rooms were not properly cleaned, i think they need to refresh rooms and specialy bathrooms!!! If you are for the first time in Istanbul the personal of the hotel will guide u to expensive ways of spending time so better check on net anything you need. For example we asked information for having a Bosphorus cruise and of course recomenede a private one trople as cost as normal one with ferry. Thank God we used net and had a friend there, but i am telling this to know what to expect. Breakfast was poor and the same every day...if u stay more than two days you won't be happy. No parking zone ...i think for maximum 3 cars so if u travel by car don't pick this hotel. I won't go again, that's for sure.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "sweden", "Title": "“Bad service in the Hotel. Good location of the Hotel.”", "Author": "mustafasweden", "ReviewID": "UR78227133", "Content": "Never trust the receptionist or the workers in the Hotel. They cheat us when we where staying in the Hotel. The Hotel has good location near Aya Sophia and Sultan Ahmet and the market but the service is bad. They cut dowen the aircondition in the morning only the fan is working and never trust them. Check the minibar with the personal before you leave. They cheted us. There are many Hotels att the same price level near by. Like Dedem Hotel and California Hotel. I do not recommend Santa Sophia.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "osaka", "Title": "“super location”", "Author": "royalosaka", "ReviewID": "UR78031384", "Content": "Ä°ts in the center of old city, clean friendly staff. Walking distance to museums.What to expect more for a few days in istanbul?", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "zolder", "Title": "“very good located hotel with very friendly and helpfull staff”", "Author": "obike", "ReviewID": "UR47643255", "Content": "Perfect located hotel, close near all touristic places, ( grand bazar, sulthanamet with blue mosque and hagia sophia is very near) close near tramway and even trainstation is not far. Clean rooms, good breakfast and very helpfull en friendly staff. Always there to help you when you have questions. Nice rooms: big, good beds, nice bathroom and clean. I had nice vue, i could see the sea, what was an extra nice thing. Very recommenable hotel, when i come back i would stay here again.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Derbyshire", "Title": "“The hotel was just right.”", "Author": "hbuxton", "ReviewID": "UR46098725", "Content": "Great hotel with very friendly and helpful staff. Everything we wanted to see was just around the corner. We had a great time. Heather Worsley", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Lagos", "Title": "“Friendly”", "Author": "funmiyinka", "ReviewID": "UR36990664", "Content": "The hotel is clean and service was excellent. the guys there are so friendly, cleaners are caring Desk Manager is willing to help with lots of information", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“Worth only if other hotels are full”", "Author": "snlka1", "ReviewID": "UR33364340", "Content": "Not very pleased with the hotel. The location is not as mentioned in the website map, it is located at a rundown area. Pieces were falling apart in the room. Triple room was basically a double with additional bed, making it cramped - but the price was 35% more than a double.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Leeds", "Title": "“Dark, dismal and gothic”", "Author": "Legbye", "ReviewID": "UR30655537", "Content": "Despite telephoning Yosef on reception and ordering a hotel transfer taxi to meet us at the airport on our arrival - none arrived and no apology. Blank looks all round and Yosef is not around. Refused room offered because of smallness and rubbish dump outlook, accepted second room because it was marginally bigger but with similar garbage dump, landfill outlook (see Photos). Breakfast was less than basic - tasteless cheese slices with bland, awful tasting cold dressings, no milk or cereal nor toast. The walls are paper thin and the lift whilst being some distance away from our room, still sounded as though it was in there with us!! Dismal and Gothic without the ambience of Norman Bates behind the reception desk. On the credit side, it was within walking distance of most of the sights and thankfully we were only there for three days. Would I recommend this hotel? Only if I did'nt like you... No Roofgarden views of the city, the door was blocked with three matresses and the staff said that it has'nt been available for years!! Still advertised on there website though.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Minster Thanet", "Title": "“Lacks finesse, a bit sad and in need of a complete revamp and staff training”", "Author": "hearthammer", "ReviewID": "UR28490200", "Content": "We arrived at the hotel to a very average welcome. Rooms that were allocated were over looking a rubbish strewin back courtyard. We changed rooms which were marginally better with at least a street view. Showers old and in need of a deep clean where it was difficult to get at to clean. Shower hose and rose did not reach the holder. Baths half size and difficult to move about in Rooms sparse and not exactly clean with dust and fluff . Reception staff not very pleasant and when asked to supply another pillow we were told to roll up a blanket and put it under the existing pillow. Also reception staff did not alert us to our taxi for the airport even although we were waiting outside on the pavement. Breakfasts were good and substantial although very samey. The area is central but a bit dark and seedy Be careful of the area as my wife had her handbag grabbed and stolen on the way back to the hotel. I will not be back.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“nice hotel...”", "Author": "taramw", "ReviewID": "UR28348400", "Content": "nice clean, tidy base for a sight-seeing stay in istanbul. nice breakfast too....but don't expect to get much sleep, as you will hear all of your neighbours. unfortunately other couple we travelled with received an early morning (3.20 am!!) wake up call that was not ordered, only to receive another minutes later. when our friends complained of this next morning, front desk claimed this was not possible and there was no apology for both calls. hmmm. though this incident didn't happen to me, it didn't make for happy travel buddies that day.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sarajevo", "Title": "“I recommend it”", "Author": "bosankaela", "ReviewID": "UR27173563", "Content": "I spent there whole week in april 2008. with friend. We got a small but clean room with WC/bath. The cleanlady do her job, keep it good, and change towels as soon as we need. Very, very good choice for breakfast every morning, even when came little later. The walls are thin, so you can hear some noise from other rooms or lift, but we were too tired walking all days to be bothering about that. All stuff are friendly and helpfull, with many good advices what to see, where to eat, organized few excursions and taxi for us.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Very good deal!”", "Author": "aeronaut", "ReviewID": "UR20998154", "Content": "Booked hotel golden crown through Turkey TPS incl. airporttransfer to hotel. One week prior to my departure my booking was moved to the Santa Sophia hotel, which was right next door to Golden Crown. Upon my arrival at Sabiha GÃ¶cken Airport nobody was there to pick me up and the phonenumbers given did not work. Contacted the agency when i arrived at hotel, but they had no intention to help out. Taxibill was quite expensive and cabdriver stole my money. Can NOT recommend Turkey TPS- when you book:-) As for Hotel Santa Sophia: Location is just in the middle of everything- you can easily walk to everything in Sultanahmet area- and tramline is just up the road from the hotel. 5 star location. Staff: Absolutely friendly and helpful and very kind. When my money was stolen I was invited to have lunch with staff- see thats Turkish hospitality:-). 5 star staff. Room: I do agree that some rooms might be very near elevators and the noise they make. Same thing for rooms in lower floors- might be noisy- you are in the middle of everything:-) My room was on 5th floor- smallish as normal for this type of hotel. Clean towels and change of bedspread was done a couple of times during my week there. For a 3 star hotel I found it to be fine. Telly: no english news channels. Breakfast: I was pleasantly surpriced of selection for breakfast- very good for a hotel of 3 star. All in all I think that the hotel lives up to its 3 stars- and service is more than 3 star- definately:-) I am a big fan of Turkey, bigger fan of Istanbul- and I love the genuine Turkish people- and no, not everything is perfect there but I always feel very welcome and people want to help even if they dont speak one of my languages. I do recommend the Santa Sophia if you like a good-deal, good location and friendly staff. As for Istanbul- YES YES YES!", "Date": "October 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Santa Sophia Hotel... not again”", "Author": "scarleta", "ReviewID": "UR14583177", "Content": "We went to the hotel for four nights on Easter, the staff at the reception desk was professional and helpful but unfortunately the rooms were not as good. We stayed in two different rooms, the first one was quite big but seemed the walls were made of paper!! We could hear the phone, alarms and conversations in other rooms as if they were happening in ours. After a few days traveling traveling around Turkey we went back to the hotel for the last night, (had already booked it and didn't have time to look for a different accommodation). We were given a different room, which was not very clean, (mould in the shower, paint & plaster falling off the wall), and had quite an unconfortable bed. The location was good, 5 minutes away from the Cemberlitas tram stop, and 10/15 min away from the main views in Sultanahmet, but there are many hotels on the area and would definitely try another if I went back...", "Date": "March 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Santa Sophia”", "Author": "ermakov.vitaliy", "ReviewID": "UR6840200", "Content": "We were there from 23/02/07 till 25/02/07/ The staf is realy good, very polite and kind. But it's not a 3 stars hotel - the room wasn't ckeaned during our leaving, size of the room is veeery smal and the worse is elevator which work we heard all night long.", "Date": "February 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“Excellent staff”", "Author": "Nikki_Elchin", "ReviewID": "UR6008919", "Content": "The staff was excellent. I recommend this hotel. It is a good price. I paid 40 USD for double and 35 USD for single.", "Date": "October 25, 2006"}], "HotelInfo": {"Name": "Santa Sophia Hotel", "HotelURL": "/ShowUserReviews-g293974-d296579-Reviews-Santa_Sophia_Hotel-Istanbul.html", "Price": "$72 - $449*", "Address": "<div class=\"amenFloat\">", "HotelID": "296579", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/23/88/2388d89253379fa88382393f5afe0d9b1large.jpg"}}