{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great stay”", "Author": "lucky_charm2300", "ReviewID": "UR134449254", "Content": "Great hotel. Modern rooms and large bathroom. The double share rooms have the beds together, but separated by the bed sheets so you're technically not sleeping in the same bed. The hotel has small elevators, enough room for a couple people and a couple suitcases, so leave extra time during check-out times. The hotel had a really great pool. In order to use the pool or towels, you must leave a 10 euro deposit. Ensure you keep the tag so you can get your deposit back - this whole process seems a bit unorganized. The breakfast in the morning is really good - lots of hot and cold items to choose from, including fruits, cheeses, breads, etc. Was staying here as part of a tour group so not sure how the hotel price compares. The hotel was within walking distance to the subway which was handy as the hotel is not right in the downtown core. English is not their first language so patience on both sides in necessary!", "Date": "July 15, 2012"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Decent room, poor service”", "Author": "Ivan C", "ReviewID": "UR116468334", "Content": "My wife and I stayed at this hotel during our Contiki tour last week. We faced a few problems 1. There was no ramp or elevator to the lift. All of us had to haul our bags up nearly 2 flight of steps. 2. Total absence of room service. Our room did not have toilet paper, tissue paper and hand soap topped up. We were shocked to be told that there was absolutely no room service in this 200 room hotel after 10 pm. 3. Our bed had bed bugs. I had a terrible allergic reaction to bed bug bites as a result. Requested for a room change. The reception was totally unsympathetic and unapologetic. They displayed reluctance to change my room only after I insisted so. This hotel is value for money if u do not care about service. Otherwise at your own risk!", "Date": "August 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“DON'T STAY HERE: More old man's pub/ youth hostel than 3 star hotel”", "Author": "MishinLondon", "ReviewID": "UR10026028", "Content": "Do not confuse the apartments with the actual hotel bit. We had this hotel booked as part of a flight deal we got. We were told all along it was the Hotel we were in and when we got there we were booked in to the apartments. God save us. The place was a dive. The first room we got had damp all up the walls, smelt disgusting and had cracked walls, and a balcony door that didn't shut... We complained. The second room was a bit better - so we thought. It turns out we were obviously so relieved to be moved from the first room that anything would have temporarily seemed like heaven. When we got back to the hotel after a day out, we finally opened our eyes to the second room. Or should I say our sense of smell did. The smell was unbearable - like it used to be a pub and had never been aired or cleaned. In fact, that is too kind. My mother has asthma and I can tell you the room didn't go down so well with that. We didn't take our shoes off as the carpet was filthy, the decor was hideous, the curtains dusty and we both felt like we were being bitten. The staff were extremely unhelpful and only one member of staff could speak a little English, so when he disappeared I struggled! Now, for the general atmosphere. It was full off old men. It reminded us of the sort of place local councils house people in when they are made homeless - in this case, Spanish men who stared. I'm not easily scared, but I made sure the bolt was on every door and lock particularly when I inspected the balcony and discovered that you could easily climb over the balconies in to the neighbours one... They should have paid us to stay there - luckily we were only there 1 night as we complained to our travel agent and got moved to another 3 star (Hotel Puerta de Toledo) which was 100 x better!! It was on arriving at this hotel that the failings of the Tryp were even more apparent - such as not providing us with ANY fire escape information etc (On a good note: breakfast was not bad - but then people from the main Hotel bit use that and I had to ask where and when it was rather than being told on check-in.....)", "Date": "October 1, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Never again”", "Author": "A TripAdvisor Member", "ReviewID": "UR5234100", "Content": "Do you really want to have a list of the problems? OK then. -Reception: when we arrived the guy was a little drunk. -Parking: you have to pay for it...20 euros a day -Elevators: graffiti all over -Hallway: dirty wall and ruined carpet -Room (here we go) -Carpet never been vacuumed -Sofa: spills of who knows what (just disgusting) -Balcony: two dry pot with dirt (we couldn't open it -thanks God) -Drapery: smelly -A/C unit smell like vomit when in use -Bathroom: Clean but very old. -Advise from the reception, never mind....we had to walk close to 2 hours to find a place that according to our \"friend\" was just a block away. Unbelievable low for Europe!!", "Date": "May 30, 2006"}], "HotelInfo": {"Name": "Tryp Centro Norte Apartamentos", "HotelURL": "/ShowUserReviews-g187514-d296651-Reviews-Tryp_Centro_Norte_Apartamentos-Madrid.html", "Price": "$72 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Mauricio Legendre 16</span>, <span class=\"locality\"><span property=\"v:postal-code\">28046</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "296651", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/49/5a/495a7e4d3c058264f9225a46765e83be2large.jpg"}}