{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bae Colwyn", "Title": "“Still up to the standard expected? Certainly!”", "Author": "GJonesBaeColwyn", "ReviewID": "UR126930804", "Content": "Having viewed the very favourable comments about the hotel,I felt that for a short break in Paris, this could be a good choice of accomodation. I was certainly not disappointed. Walking to the hotel from Gare du Nord took no more than 10 minutes. The reception staff were professional and welcoming.The room was clean and stylish and slightly bigger than I had expected ( bearing in mind that rooms in Paris are reasonably compact, unless you want to pay significant amounts of money). The breakfast was more than acceptable with fresh juices, bread, croissants and pastries as well as a good choice teas and coffees. The recommendation of Trip Advisor guests was certainly justified and the hotel can properly be proud of the fact that it consistently meets clients expectations. Good value rooms, cleanliness and being close to the Metro and Gare du Nord and Gare d' Est allows the hotel to be proud of its \"Certificat D' Excellence\".", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Trip of a Lifetime”", "Author": "Patrick O", "ReviewID": "UR126177879", "Content": "Our stay at Hotel Soft was amazing. The staff were so helpful and friendly. We actually got engaged during our stay, and the staff went out of their way to make us feel special and welcome. Ahmed, one of the concierges, was especially gracious. The breakfast is delicious. The rooms are clean, comfortable, and stylish, and the location is excellent. The Canal is just a short walk away, and you can access all of Paris from Gare de l'Est, the Metro station near the hotel. I would recommend Hotel Soft to anyone traveling to Paris. With Hotel Soft's combination of facilities, staff, and location, you can't help but enjoy your trip. We truly experienced the trip of a lifetime.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grenoble, Rhone-Alpes, France", "Title": "“A rarity - Nicely decorated and clean.”", "Author": "ChristineAkerblom", "ReviewID": "UR126173313", "Content": "We went for one night to take the GMAT at the Pearson Test Center just down the street, so obviously the location (meticulously chosen) was perfect. We were pleasantly surprised with the overall cleanliness and nice decorations throughout the hotel. The staff was friendly and helpful, and the breakfast offered more than enough choices. It was also appreciated that the mini bar offered a good variety of snacks. We would absolutely recommend this hotel to friends and family.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tyne and Wear", "Title": "“A great 4 days a way”", "Author": "family14", "ReviewID": "UR125838678", "Content": "Great little spot, very handy for main train stations, Eurostar and Metro. Not the best of areas but safe enough and plenty of places to eat. Very friendly staff, spoke English, very helpful, great buffet breakfast, clean, comfortable room. Stayed in a lot worse of higher star ratings. Would certainly recommend.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A friendly, convenient,clean Small and personable hotel hotel.”", "Author": "Judithannewebb", "ReviewID": "UR125537978", "Content": "We have just returned from spending 3nights here on a Guardian deal with Eurostar. We found the staff extremly helpful, especially the lady who greeted us and explained the hotel, the area and best way to reach the centre of Paris.Eurostar was delayed so she helped us plan alternatives to our original plan. The room 205 was on the small side with only a small wardrobe and no drawers.however it was adequate and typical for the centre of Paris.very clean and had a big comfortable bed.The shower was hot and powerful.We were glad we had taken our kettle. The breakfasts were fresh and typical continental . It is in a pleasant area on we lays got a seat,just!!!some people had to wait but not for long. We found it very easy to get all over Paris using the Metro from either Gare de l'est or republic. We felt very comfortable here and would certainly stay again.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Almere, The Netherlands", "Title": "“C'est Magnifique”", "Author": "Jim1988", "ReviewID": "UR125495911", "Content": "My 24e birthday was coming up so i took my mother en sister to paris we stayed at the hotel soft. A super good hotel with verry sweet and help-full staf. we had two rooms next to each other, the were cleaned and the beds were made every day, the reception was open 24/7. I even got a little present on my birthday from the hotel all praise for this hotel and staff", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Romantic”", "Author": "southbank10", "ReviewID": "UR125283713", "Content": "Stayed here in December. Hotel was was warm & friendly & great base for the eurostar (5 minute walk from Gare Nord) The area was relatively drunk free too - which is unusual. Great decor in the rooms & whilst quite small had a lovely bed & en suite - also very reasonable prices too - breakfast not really worth the money so choose a parisian cafe instead!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sheffield, England, United Kingdom", "Title": "“Friendly, clean and well-located”", "Author": "Look_n_Wonder", "ReviewID": "UR124073149", "Content": "We stayed here as part of a Eurostar deal. The hotel has a clean, modern feel to it. It is easy to reach from the Gare du Nord (we walked straight there in 10 minutes rather than going two stops on the Metro). The hotel is on a side road off the main busy boulevard, but it was surprisingly quiet in the rooms despite being so close to traffic. The room was compact with an en-suite shower room, don't expect lots of space but what you do get is well laid out and kept very clean with daily housekeeping. Plenty of room for two suitcases and there was a handy safe in the room, too. There was a useful hairdryer in the bathroom, the only thing missing really was tea/coffee making facilities in the room, which you get used to having in the UK! Other reviewers have commented that the rooms are warm, heating in our room was controlled by a radiator and we were glad of the heat in sub-zero winter temperatures, but I could imagine it could be a bit warm in the summer. The breakfast is plentiful (it was included in our holiday deal) with lovely pastries and ham. I would recommend getting down to breakfast earlier rather than later, the waiting staff are very nice, but not very quick at clearing up the tables in the small eating area for further people to sit down. Staff were generally friendly and helpful, we were able to leave our luggage until 4pm on the day we left so that we could see a bit more of Paris. The night staff in particular are lovely. I can also recommend the bistro opposite the hotel - scrumptious food!", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barcelona, Catalonia, Spain", "Title": "“What you want from a hotel”", "Author": "Pavan345", "ReviewID": "UR123892760", "Content": "The look of the hotel felt very modern and clean which was a real plus point for me.After travelling so much it was nice to have a pleasant place to come back to and rest. The location was great and all the major attractions were accessible via the metro station which was just a couple of minutes walk from the hotel. The highlight of this hotel has to be the friendly staff. They spoke english(which is a huge help in paris) and would go out of their way to help you. This hotel was a perfect fit for me!", "Date": "January 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Friendly, modern hotel”", "Author": "ReneKruger", "ReviewID": "UR123343730", "Content": "Staff is extreamly friendly and helpful. Near the metro station. Rooms are small (bigger that expected) but sufficient. Two people with 2 pieces of luggage each fit in perfectly. Nothing more needed anyway. Decoration is nice and modern with flat screen TV. Not much channels, music channel can work. A bit far from the main attractions like the Eiffel Tower, which makes it difficult to get to the attractions. The metro is packed with no luck to get on on Friday night. It was not one of the cheaper hotels in Paris and would have at least liked some coffee and tea in the rooms. The area in which the hotel is situated was a bit shakey for me, so if you're female and single I would not recommend the area, although Paris is quite safe. I did not feel at ease to walk by myself from the metro to the hotel. A safe-box would have been good to store valuables but we did not have any hassles. I think the rooms can get a bit hot in summer but we tried to cool the room before bedtime. Bit of a noisy street in the early mornings. Otherwise the hotel is good overall.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Epping, United Kingdom", "Title": "“Very friendly modern hotel in Paris”", "Author": "johnmarilyn2000", "ReviewID": "UR123013099", "Content": "Very friendly and helpful staff. Convenient for arrival at the Gard du Nord and metro stations. Clean, modern facilities. Very good choice for continental breakfast. Bedrooms/ bathrooms a little small but well maintained and good value for money. Easy to get to all the tourist sites. We particularly enjoyed a walk along the local canal and The Marais district which are not on the usual tourist itinerary.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A fantastic, friendly, clean hotel”", "Author": "Mennie25", "ReviewID": "UR122188788", "Content": "Excellent value for money. Staff very friendly. Interior pretty and welcoming. Take a travel kettle as we missed cups of tea!!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Lovely hotel”", "Author": "Joe K", "ReviewID": "UR121951591", "Content": "Myself and my girlfriend checked into Hotel Soft on Friday 16th December after a trip on the Eurostar from London St Pancras. The Eurostar arrives at Gare du Nord, where we bought our metro tickets and headed to the Gare de L'est. Hotel Soft is only about 5 minutes from both the Gare de L'est and the Jacques Bonsergent metro stations, from these you can go anywhere in Paris very easily. The hotel is in a side street off the Boulevard de Magenta and is nicely tucked away and quiet without being miles away from anywhere useful. When we arrived we were greeted very pleasantly, and the receptionist offered to look after our cases so we could go out for a while as our room was being prepared. When we got back we took our stuff up to the room and were very pleased with what we got! Nice comfortable clean bed, spacious shower, fresh towels etc. Very nice. The view from our room (104) was quite literally a brick wall, but this really doesn't matter when you have the whole of Paris outside your door. We went out fairly late each evening, and even when arriving back at half 1 we were greeted with a smile. The combination of the curtains that blacked out the room completely and how quiet the place was meant a good nights sleep too. Breakfast was very nice, pretty much what you expect..good coffee, juice, croissants, bread rolls, ham, cereal, yoghurt etc. A good example of how helpful the staff were: when you wake up and want to go for breakfast, just press 9 on the phone next to your bed and ask the receptionist if there is a table for (in our case) 2. If there is then it's yours, if not then go back to sleep and they will call you back when ones free! And we never had to wait more than 15 minutes. When we asked about anything in the city, whoever was at the reception would take out a map and tell us everything we need to know, and on our last day, even though our train wasn't until 7.15pm they looked after our bags for us right up until we needed them so we could make the most of our last day. Would recommend to anyone and would certainly return.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bray on Thames, United Kingdom", "Title": "“Excellent hotel in the middle categories”", "Author": "Coppindm", "ReviewID": "UR121914854", "Content": "Outside the main areas but still within walking distance of the centre for the fit. Ideal location to see a different part of Paris and find some excellent restaurants at sensible prices. Hotel room was excellent with really helpful staff. Never got up early enough to try breakfast so cannot comment but just as easy to find a cafe and have a cafe/croissant. Would reccomend to anyone wanting value for money.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Clean, comfortable, good location”", "Author": "Barbara A", "ReviewID": "UR121891519", "Content": "This was a great find - I've been recommending it to everyone. It's a small, modernised hotel in a quiet street near the Gare de l'Est and Gare du Nord, and within a few minutes' walk of several Metro stations. At one end of the street is the Canal St Martin, really charming for walks. The area abounds in cafes, restaurants and quirky shops, and there are supermarkets too. We didn't have any problems walking around at night. The hotel staff are amazing, really friendly and chatty and helpful. Our room was VERY comfortable, with en suite shower room. The breakfast is a buffet, plentiful and tasty - especially the big flasks of coffee and hot milk, yum. Also, free wi-fi - one of the other reviews said they didn't get it in their room, well we did on the 4th floor, a good strong link.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brighton", "Title": "“Just what we wanted...”", "Author": "Andy T", "ReviewID": "UR121120278", "Content": "The Hotel is small but perfectly positioned near both the Gare du Nord and the Gare de L'est as well as the Metro. The staff were really friendly, spoke English and were always available all times of day and night. Wi-fi and breakfast were also a nice bonus. Overall the perfect hotel for an inexpensive break in Paris - I'd definately stay there again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Quiet, nice hotel, just round the corner from the Gar el est' train station.”", "Author": "MissMah", "ReviewID": "UR121072444", "Content": "It was a good stay overall. Near cheap Istanbul eateries and the train station. The toilet and room were cleaned daily. But the only thing I don't like about the hotel is the environment. It is actually very dark at night and not much people walking around at night. But the friendly staff more than compensated for the lakluster external environment. They were friendly and obliging - especially this middle aged gentleman who we complained to about our pillows being too soft. He also helped to carry our luggage on to the car transfer to the hotel. Thumbs up for the good service. If you don't mind a quieter environment at night, for the price you will be paying it's a good catch. Remember to catch the Mixed Grill at the Istanbul restaurant round the corner on the right - me and husband went back thrice in four days three nights. The uncle who cooked it looked like he is so experienced.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“great weekend”", "Author": "mindaugas k", "ReviewID": "UR120931548", "Content": "I was spending one weekend with my girlfriend at Soft Hotel. I made it for her birthday. Hotel was extremely clean and staff was very friendly. We felt like at home. Receptionist advised and made reservation for me at: \" La taverne de Zao\". We highly recommend this restaurant just 10meters from hotel. Ask at the desk for Amed if you need any information about sightseeing in Paris. I and my girlfriend were enjoying this beautiful area around the hotel that is called canal saint martin. It is a long and nice river with a very romantic bridge.It is a perfect place for a couple in love.i highly recommend this romantic hotel.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, WALES", "Title": "“Great little hotel”", "Author": "BNAUK", "ReviewID": "UR120810411", "Content": "We stayed at this little hotel back in March of 2011. It is a very nice place, with friendly staff, has clean nice but small rooms and also a decent breakfast too. If you are going to choose this hotel, which we would recommend for Paris, make sure you know your way from the airport. It is quite far, but not all that difficult if you plan clearly ahead. The airport bus will take you to the main station and the hotel is just a short walk from there. The bus does start from a different place when returning though. Paris is a superb city to visit, well recommended. Take comfortable shoes though if you like walking. The underground is very good and is just a short walk from the hotel. Enjoy. Before we booked for Paris people were saying how expensive the place is, and how arrogant some people were. We never thought it was any more expensive than London or Berlin, and the people were very nice. I suppose if you are polite then you should get it returned. Not like Rome. Can be proper rude!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hull UK", "Title": "“Excellent hotel”", "Author": "HullUKJohn", "ReviewID": "UR120582306", "Content": "Really enjoyed our stay in this excellent small hotel. All the staff were very helpful. Good rooms and very good breakfast in a friendly setting, close to a range of bars and restaurants on the canal. Close (10min walk) to Gare du Nord so very good for Eurostar. Many thanks", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great stay at Hotel Soft”", "Author": "Kelly A", "ReviewID": "UR120308721", "Content": "The hotel is very clean and comfortable. It is in a very central location close to many shops and restaurants. The staff is friendly and accomodatng. Perfect hotel for a wonderful visit in Paris!!!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Soft stay”", "Author": "Gslml", "ReviewID": "UR120221627", "Content": "Hotel location is very good if travelling by Eurostar. Close to station. Lots of bistro in the area and a canal near by. The room we staid in was a bit warm when the weather outside was rainy and a bit humid. Breakfast is nice. Good value for money for a short stay.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "bristol", "Title": "“Pleasant hotel, but....”", "Author": "cat-black", "ReviewID": "UR120027623", "Content": "I got the hotel at a very good price, but tight from the beginning we were plagued by mistakes and confusion on the booking. Upon arrival the receptionist was very efficient and helpful and checked us in quickly. when i got to the room I found that my window faced a brickwall of a very small and dirty courtyard, but you don't go to paris to spend your time in a bedroom so its not such a big deal. What was dissapointing is the size of the breakfast room. the brakfast room is in fact the lobby. There is not enough seats, I had to wait for quite some time, then I had to wait again for the wait staff to clear off the table only to find that there was no fruit left nor any croissants. My biggest complaint with this hotel was the person on the front desk. she gave us incorrect infomation about buses, metro and the sunday market. Then as we were leaving we asked where our taxi was and was told it was ordered, 10 minutes later we were told that the taxi was not coming. I asked her to phone someone else and she said they used that one firm. she did call another firm, but once again a no show. she then said it was because we were too close to the station which was our destionation. As my mother is in a wheelchair, this was very inconvient. So was I sorry I stayed there? no. Would I stay there again? no.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“Nice place in Paris”", "Author": "reslifedan", "ReviewID": "UR119376955", "Content": "I stayed three nights and found the hotel quite comfortable. The decor is casual contemporary and my solo room was decent-sized with a modern bathroom and both were exceptionally clean. The bed was quite comfortable and the hotel and streets quiet at night. Only disappointment was the free wi-fi didn't work in my fourth floor room. The two separate staff to whom I brought the issue did not seem surprised, or helpful, in addressing it. It worked fine in the lobby/breakfast room. Neighborhood was fine; everything you need, including Metro, within a couple of blocks. Nearby bistrot, sushi and tapas places all very good.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“A great little hotel”", "Author": "TMBGitw", "ReviewID": "UR119154142", "Content": "For the price, we really enjoyed this hotel. Of course it's not the Ritz, and it's not trying to be, but it's friendly, clean, and everything you need for the weekend stay.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Excellent stay”", "Author": "matei1550", "ReviewID": "UR119097690", "Content": "The hotel is conveniently located close to Gare de l'Est and Gare du Nord (very handy for EuroStar travellers). Our room was small but tidy. The bathroom was large and well-equipped. The breakfast wasn't anything special, but certainly tasty and good value for money. Staff were great, always smiling and willing to speak English (in response to our attempts at speaking French). In particular, the reception clerks were very helpful and got us to a great start on our first day - by pointing out the main sights. Room cleaning service prompt and excellent. Air conditioning (completely absent) would be great during hot days, but I guess Paris isn't the place to ask for that? All-in-all, highly recommended for short and medium stays.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rye, United Kingdom", "Title": "“One night stay in Paris”", "Author": "Paul P", "ReviewID": "UR118608333", "Content": "Hotel Soft is close to Gare du Nord. There was a friendly and helpful welcome at reception. The room was clean,quiet (at rear) and it had a comfortable bed. The room was small but well laid out with a good bathroom. We were able to check out, leave our bags and pick them up later and walk easily to the station. Good base for a short stay.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Stay elsewhere”", "Author": "lsickles", "ReviewID": "UR117569225", "Content": "The only good thing about the hotel is that it is very close to the train station. The staff service is inconsistent. Some are very friendly and helpful, others are not. The Internet service is very spotty and doesn't work in all the rooms, or reliably. It is located at a very loud intersection and you can hear traffic all night. There is NO AiR CONDITIONING. The rooms are extremely hot and stuffy. Hotter than it is outside. Difficult to sleep with the windows open because if the noise from traffic. There is not much open around the hotel at night. Do not waste your money on the hotel breakfast. You can get a better breakfast at most cafes around the city. You can even buy a few things at the store and the owner of the restaurant across the street will cook it for you. The rooms are clean, but very very small. The bathrooms are not dirty, but not cleanest either. There was mildew in our shower. Although the hotel is non-smoking, people still smoke. Our first room reeked of cigarette smoke. The walls are very thin. You can hear your neighbors clearly. The hallways are very small and difficult to navigate with luggage. Overall not a 3 star hotel. Much closer to an interstate rest area motel.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sacramento, California", "Title": "“Convenient location, small rooms, no air conditioning”", "Author": "WorldTravels365", "ReviewID": "UR117474739", "Content": "This hotel was a short walk from the train station, so was easy to find and convenient. Breakfast was an extra 9 euro charge, but was very tasty and a good value. However the rooms are very basic and small with no space for our luggage. Our first floor room had a view of a brick wall. When we booked the hotel online, the website said the rooms included air conditioning. However when we arrived we were told the hotel did not have air conditioning at all. So the rooms and lobby were very warm in august. Our room was so hot we could hardly sleep even with the windows open. It wasn't even that hot outside (mid seventies) With the windows open, there is a lot of street noise. When we took a shower, the room filled with steam as there was no fan. We did not get much sleep here and had to keep taking cold showers. Had we had known this, we would have stayed somewhere else. This was an average hotel that would probably be more comfortable in the winter. Next time I will probably look for something different.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Mixed feelings”", "Author": "TomHae", "ReviewID": "UR117261270", "Content": "First the pro's, Soft Hotel is fairly cheap for Paris standards. It includes breakfast which is ok: a traditional French \"Petit Déjeuner\" added with some cheese and eggs. We spent 6 days in the hotel, so we have a good idea how the hotel is run. The breakfast prepared by the first woman (first 4 days) was much better. She also gave us a warm welcome in the morning. The last two days there was another employee. She was much less nice, didn't care too much, was late adding food, coffee, ... to the buffet, was cool and uninterested. Same goes for the reception personnel. Some are really friendly, others are uninterested and busy on the computer doing who knows what. What could be better: we slept at the front of the hotel. It was hot and almost impossible to sleep with the windows closed. There is no airco in the rooms. The street is incredibly noisy: cars, scooters, people shouting, bars and restaurants, ... . The breakfast buffet was clean. The hotel rooms were ok, however are sheets were not quickly replaced. As it was warm, it would have been much more comfortable.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hexham, United Kingdom", "Title": "“Great location quiet & clean”", "Author": "Hexhamambyth", "ReviewID": "UR117166798", "Content": "We stayed at the Soft hotel on a short break. Rooms are basic but clean. Breakfast was better than expected with choice of fresh fruit, breads/patisserie ceareals cheese salami & Coffee & juice. No restaurant, but lots of nice places are close. The Location is great - easy access to Gare D'Lest & Gare D'Nord but on a quiet street near the canal down to Place de la Bastile. There is a great little bistrot opposite - we had our best meal in Paris here & the least expensive prices - Le Bistrot des Faubourgs - but it's only open Mondays to Fridays & closed at the weekend. Hotel service was great & we could store cases on the last day to pick up on our return to the Station.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Good Value for Money and Welcoming Staff”", "Author": "Brigham_11", "ReviewID": "UR116670666", "Content": "Stayed here for 5 nights with my daughter whilst visiting Paris. This hotel compensates for fairly compact rooms with the level of service provided. The staff are excellent. Nothing is too much trouble for them. The breakfast is excellent and terrific value for money. The rooms are clean and perfectly adequate for the bed and breakfast service offered. Top Tip..... Breakfast finishes at 9.30am, but make sure you are there by 9am when the hotel is busy as you may find that many of the items are not replaced. In our case, on our last morning we arrived at 9.25am and some items were finished. However, as a demonstration and lesson in excellent customer service skills that would be the envy of many a 5 star establishment, the receptionist / duty manager nipped to the local supermarket to purchase butter and orange juice for us.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Incredibly friendly and welcoming staff”", "Author": "HeatherMaybe", "ReviewID": "UR116359004", "Content": "A clean and modern hotel, very handy for Gare Du Nord, and the staff were so pleasant - I'd definitely go back just for the welcome.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great deal, great location and brilliant service!”", "Author": "happytraveller2121", "ReviewID": "UR116339450", "Content": "We stayed in the Hotel Soft for a long week end and had an excellent stay. The location is perfect for a stroll in the evening with several lovely restaurants (Marcel and La Marine were real highlights) interesting boutiques and lovely wine bars to enjoy. The staff were really friendly, especially at reception, and the room was very pretty despite its rather cosy size! Clean, comfortable, friendly and well-situated - we would definitely recommend this hotel for anyone looking for a well-priced but comfortable break!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hereford, United Kingdom", "Title": "“Great service made our anniversary weekend special”", "Author": "Worcesterwoman40", "ReviewID": "UR116159873", "Content": "We stayed at the Soft Hotel for our wedding anniversary weekend. Although the room was small, it was very clean and adequate for a short stay. The staff were extremely friendly and helpful. We had the buffet continental breakfast, which we found well worth the money. The hotel was in the quieter, 10th arrondissement, close to the Canal St. Martin, though the sights can be easily accessed with two Metro stations within easy walking distance.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“very mixed experience”", "Author": "MelissaDennison", "ReviewID": "UR115734471", "Content": "I had a very mixed experience with Hotel Soft. Some staff were great, some less so. My first room had some problems, the second was very good. The price is reasonable for Paris and for the quality of the room, but they nickel-and-dime you for breakfast, internet access and so on. The first room (007) was a good size and attractively decorated, but it had some significant problems. It was on the ground floor and the window faced into a courtyard that was the entry for tenants of the adjacent apartment building and where some small boys liked to kick a ball around. When you opened the windows, nothing separated you from the courtyard but an iron grille. It would actually be possible for someone to reach into the room. Not that anyone seemed interested in doing so, nor could anyone have reached in far enough to really do anything. But there was no privacy whatsoever - you could not dress, sleep, walk around naked or have a shag without shutting the windows and drawing the curtains every time (or leave them open and give the neighbours a show). Cleanliness was another problem. The bathroom had been cleaned, but there was a significant mildew problem in the shower, one that had been developing for at least a few months. There were a few sequins on the carpet that tipped me off that the room hadn't been vacuumed before I got there. A third issue is that the room was off a hallway that also lead into the cleaning staff's cupboards and the breakfast area. So in the mornings there was a certain amount of banging and clattering and noise from the TV. I was scheduled to stay from Thursday to Tuesday. On Friday night I asked at the desk about possibly switching rooms. A very nice staff person said they didn't have anything open until the Sunday night, but I could have a better room - actually my choice of rooms, since they had lots of openings - for the same price. Great! However, the story changed on Saturday when another staff person told me that she wasn't sure about the room switch anymore since they were booked up. By Saturday night the nice staff person was back on and I grumbled to him about getting the run around like this, and he promised me room 402. We also got into this odd discussion about how I originally got the crappiest room in the hotel because I booked through a online service, not the hotel's own website. That's not true, since I always book directly with hotels. I think Hotel Soft's website re-directs you to another service, in a behind-the-scenes sort of way. His printout of the booking looked quite a bit different from mine. So that's something to watch out for. I was annoyed that I had booked six months in advance and paid a 5-euro booking fee, only to get their worst room. However, room 402 was very nice - big, big bed, a bathtub. It faced onto the street so the view was typically Parisian (and so was the noise!). It seemed cleaner than room 007. I have no complaints about room 402. On the Sunday I tried giving Hotel Soft some customer feedback. This staff person (the same young woman who earlier told me that I may not be able to switch rooms) really couldn't care less. I told her that they should tell people who will get room 007 about the no-privacy thing when they book, since it is a pretty big deal. She told me that it is impossible to guarantee guests a specific room, they just assign rooms based on who arrives first, and \"that's how hotels work\". She also told me that this is just a part-time job for her and she is finishing a Phd, which I think was code for \"Hey this is just a money job for me so I don't care\". The morning I checked out, yet another staff person was on the desk. He seemed REALLY put out by having to deal with the transaction and I could tell he didn't like that I had been given a better room for two nights at no extra charge. I don't think he realized how close he came to getting nothing for those two nights, since I had already inquired at another hotel nearby. So, no, I wouldn't stay at Hotel Soft again - too unpredictable. However, I do recommend the area. It's not touristy, it's convenient for several metro lines and there are many restaurants and cafes.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Agree with favourable reviews of this hotel”", "Author": "EJBuen", "ReviewID": "UR115358293", "Content": "Clean, comfortable rooms, very comfy beds, friendly and helpful staff, convenient location next to Gares, safe neighbourhood. Only negatives: no airco, no coffee-making facilities in rooms.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“Nice hotel but suffers badly from absence of Air Con”", "Author": "PLomond", "ReviewID": "UR115355185", "Content": "Lots of pluses for this small hotel in the 10th district but the one big shortcoming was the lack of air conditioning. Warm evenings meant having to open the windows but the hotel is close to a main boulevard and the street/traffic noise from there and closer, meant too much noise for us to sleep. So the choice was open window with noise or closed window and sweat. This is a great pity because otherwise the hotel met all our needs. It is closest to Gare de L'Est railway and Metro (5 minutes walk), and there are useful bus services from the end of the street that get you lots of places easily (the Metro ticket works on the bus also). So getting around is easy. There are a number of bars and restaurants close by - on the same street are two we particularly enjoyed - Bistro des Faubourgs and Restaurant Le Bourgogne. Both authentic French and good English is spoken. Go for their 3 course menus at very reasonable fixed prices! The hotel has fast WiFi free of charge in all rooms: nice toiletries: comfortable clean rooms - but the rooms are small by international standards although typical of Paris. Breakfast was included in the room rate - a nice selection of cold items, cereals, cheeses, yogurts and fresh breads. Excellent coffee! The star of the show is the night front desk guy (Ahmed?) - charming, friendly and most helpful and speaks very good English. If the hotel had AirCon I would have given it a strong plus mark - even on reflection, I cannot say I would use it again for that very reason. I need to sleep comfortably after a day on the tourist trail!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montréal", "Title": "“did not disappoint.”", "Author": "K-MACH", "ReviewID": "UR115337174", "Content": "STAFF: Nice, friendly and helpful. This was the main reason I picked this hotel (based on reviews), and they did not disappoint. We arrived early on a rainy day, and really needed rest. Our room was ready within the hour. ROOMS: clean but small by North American standards. Furnished nicely in a modern style. Free high speed wi-fi with good reception in our room. The walls are a bit thin. LOCATION: It's not the best location to walk to the main tourist attractions, but has easy access to the metro and the train stations, which provides convenient sightseeing, easy day trips and a quicker access to the airport. BREAKFAST: French -- croissant, cheese, jam etc. It's more than adequate, but if you like your 3-egg omelette and bacon, you will have to go somewhere else. OVERALL: This hotel is a great deal for those who want a clean room on a budget with basic amenities and reliable service.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Great hotel for a short break”", "Author": "GazzaBoxy", "ReviewID": "UR114985533", "Content": "Hotel was small but was ok for our needs, could have been better with air conditioning as when we arrive dit was 32 and very hot, had to leave windows open at night and was very noisy. Breakfast room was very small for hotel and a basic breakfast. Hotel staff were very helpful and accommodating, we would stay again but in summer needs air conditioning without doubt, overall good for the money, as rest of Paris was very expensive.", "Date": "July 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Nice hotel with small rooms but in a good location”", "Author": "youngwilly", "ReviewID": "UR114412121", "Content": "Stayed here for 5 nights in June 2011, our ground floor room was very small but adequate, some repairs needed (wallpaper, curtains, cracked sink) and bed quite hard but pillows were soft! - also needed a chest of drawers for unpacking our clothes into. Window opened into a public courtyard at ground level so no privacy if opened for fresh air. Staff at the hotel are generally very helpful and mostly friendly, the continental breakfast was plentiful and good. The location is great for the metro station 5-10 minutes walk away. Based on this we would not recommend the hotel, but other rooms may be better.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "lancashire", "Title": "“excellent hotel”", "Author": "cazbarLancashire", "ReviewID": "UR114065772", "Content": "My granddaughter and I stayed at the soft hotel for 4 nights. Yes the room and bathroom was small but very clean and nicely decorated. We were disappointed that there wasn't a safe or any drawers and only 5 hangers in the wardrobe. When we spoke to a member of staff about it,he explained because the rooms were small they had made a decision to keep fittings to a minimum.They were happy to put our passports,money etc in the hotel safe. That said the staff could not have been more helpful.They told us what metro station and metro line to use.There were 2 stations within a few minutes walk (Gare du lEst and Republique) Also they were very happy to answer any querys that we had.Yes I would recommend the hotel.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Reading,", "Title": "“Excellent hotel; highly recommended”", "Author": "Kiel9495", "ReviewID": "UR113851738", "Content": "My wife and I stayed here for two nights in May 2011 - excellent hotel; rooms small but very clean, comfortable and quiet. Staff very friendly & helpful. Breakfast delicious. The hotel is a 10 or 15 minute walk from Gare du Nord, and just a 5 minute walk from the nearest Metro station. It is in a pleasant street off the main Boulevard Magenta, and just a short walk from the pretty area around the Canal Saint Martin. I would recommend this hotel to anyone. It is great.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "chennai", "Title": "“Home away from home”", "Author": "mridhangam", "ReviewID": "UR111239443", "Content": "Hotel Soft, a terriffic hotel in Paris is a very good hotel in Paris. One hour drive from the CDG Airport it is located amidst a beautiful french architecture. Stone throw distance is a delicious Indian Restaurant where we got very nice indian food. One of the best in this SOFT hotel is it is very centrally located and it is easily accessible and is surrounded by typical french architecture. A walk down the lane leads to a serene canal surrounded by trees on both sides. You can just relax by the canal side and enjoy the pristine purity of nature. The SOFT hotel provides free breakfast for all its guests, it has free WIFI, and the access to the rooms are controlled by smartcard and also it has camera surveilance for safety and security of the guests. The rooms are well furnished and the cleanliness is maintained in the rooms by daily duty staff.", "Date": "June 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great home away from home”", "Author": "tawnytresses", "ReviewID": "UR110993079", "Content": "I was highly impressed with the decor and cleanliness. Very friendly reception desk. I had a medical problem and they made a doctors appointment for me -it worked out well When I needed to send an email I found out all about the french keyboard-very complex! The breakfast was very good, coffee, juice, rolls, cheese, pastry, yoghurt and some fruit. It was not a seedy part of the 10th and the location was fine for me. .", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“hotel really ok!”", "Author": "Sara_Bellons", "ReviewID": "UR110132932", "Content": "Do clean hotel good location, near metro stop, restaurant, pharmacie, gare, etc... small room but clean and with beautiful bathroom", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barnsley", "Title": "“Great location”", "Author": "Poggers", "ReviewID": "UR109689872", "Content": "The hotel is in a good location for the rail and metro station, just a short walk past the cafes and bistros. Staff at the hotel are really friendly, nothing is too much trouble for them, especially Ahmed and the breakfast staff. The breakfast itself is of good continental style, sets you up for the day. The hotel is very clean and comfortable, a really good base for going to see the sights of Paris. Well worth a second visit. Had a great time!", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“really excellent”", "Author": "scuzz189", "ReviewID": "UR108615784", "Content": "Just returned from a weekend stay at Hotel Soft with my partner what a gem, location brilliant very close to all transport links but set on a quiet street away from the hustle and bustle. Had some lovely meals (Fuxia) and drinks (Le Cinquante) very nearby and it was only a short walk to the Canal and the Marais area both of which are absolutely teaming with life. Service in the hotel was well above average, the bag drop facility which is provided free of charge I was astounded by, most places would be cashing in here but they offer this secure service totally free of charge. Our room was surprisingly large, spotlessly clean and with a good sized bathroom. Would definitely return and highly recommend to others.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ZH", "Title": "“Good location and helpful staff”", "Author": "MunZH", "ReviewID": "UR107788430", "Content": "We stayed 4 nights at Hotel Soft. We enjoyed the good breakfasts in the Lounge area. The room was very clean, good beds and spacious enough. At the reception we got some good advice about several restaurants (for example Hotel du Nord). It's a safe neighbourhood. The location was perfect, near Gare de l'est for metrolines and in a quiet street. We had a great stay and would book here again!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Comfortable, clean, affordable hotel in Paris”", "Author": "zeta10", "ReviewID": "UR106665519", "Content": "We stayed at the soft hotel during easter weekend. We found the hotel staff very helpful, room nice and clean. The bathroom was a bit smelly, we think this was due to the lack of ventilation, so we just opened the doors and windows to air it out and a smell disappeared. We also booked breakfast, which we were very happy with. Good selection of hot drinks, bread, croissants, yogurts, fruit...The location of the hotel is OK, not in the centre though (which we knew in advance). We bought a weekend metro ticket for 20 euros, so this didn't cause us a problem. There is also a small shop very near to the hotel, where you can buy good quality vine cheap for your picnics. There are also little bistros nearby for evening drinks or meals if you dont want to go to the centre of Paris.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Soft like Soft”", "Author": "foodie274707", "ReviewID": "UR106314520", "Content": "We stayed in this hotel during our weekend trip .really cool place with excellent service and its almost in centre .very neat and clean .", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Very clean and convenient”", "Author": "david_mason66", "ReviewID": "UR103632381", "Content": "A great little hotel. Not bang in the centre of Paris but close enough to metro Jacques Bonsergent (and both Gare de l'Est and Gare du Nord) to enable you to reach all of the main sites quickly. Breakfast (included in the room rate was very good). Staff were very helpful and friendly. Make sure that you visit the nearby (five minute walk) Canal Saint Martin. On a sunny day take a picnic (or at the very least a cold beer) and sit at the water's edge and enjoy - the locals do!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“would definitely stay there again. It's a happy place to be.”", "Author": "kaz2277", "ReviewID": "UR101675948", "Content": "We found everything about this hotel really very good. The room and bathroom were spotlessly clean and comfortable. We loved the balcony windows! The staff were incredibly friendly and very helpful. Nothing we asked for was a problem. It really felt like they were happy to be there and to look after us. The receptionist advised us about possible train problems regarding our return journey to the airport and printed out information for us. We hadn't even asked! It saved us a huge amount of hassle. I've stayed in bigger hotels with more *'s but honestly preferred the Hotel Soft. Highly recommended.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect location”", "Author": "mrs_random", "ReviewID": "UR101576141", "Content": "Hotel was lovely on the outside and in. Rooms needed paint touching up a bit and some bathroom tiles had cracks in but other than that the rooms were lovely! Amazingly comfy bed need bigger pillows though also tea making facilities and some English channels on the tv would make it perfect. The breakfast was limited possibly could add a few more choices but everything that was there was very nice. Location was brilliant, right next to gate du nord and gate de lest and other metro stations which take you anywhere and everywhere!!! Staff at this hotel are all lovely and willing to help with everything from where the best shops were to route planning on the metro. I recommend this hotel for anyone that wants a nice hotel In reach of everything.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Location, location, location”", "Author": "Simontheeditor", "ReviewID": "UR99412976", "Content": "Small hotel ten minutes walk from gare de l'est and gare de nord in interesting area little visited by tourists. The hotel has recently been modernised and styles itself as a boutique hotel, although it isn't. Rooms are small but well furnished. Reasonable breakfast. Friendly and helpful receptionist.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cologne, Germany", "Title": "“Very friendlich staff, good breakfast & rooms”", "Author": "_mag0de0z_", "ReviewID": "UR90913788", "Content": "friendly staff, small but good and fresh breakfast because of its proximity to the gare de l'est the hotel is a good place for a sightseeing tour in paris The rooms are quite small but very comfortable (bed) next time the weather should be better :-)", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely staff, great location, beautiful wallpaper in the rooms!”", "Author": "aaplgreen", "ReviewID": "UR90080606", "Content": "We stayed for 2 nights at Hotel Soft and it was great, they serve a nice breakfast with pastries, cereals, yoghurts, cheese and good coffee, they have lovely friendly staff and comfortable rooms with good heating (much needed as it was snowing outside!) The concierge's recommendation of eating at the restaurant across the street (a name like Faubourg) should be taken up by everyone, they serve excellent, affordable, authentic french food. Best meal we had in Paris. Room maintenance is the only area where this hotel could improve - the lights above the bed weren't working in our room, and the bathroom fittings were a little tired.", "Date": "December 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Delighted!!”", "Author": "Robert190737", "ReviewID": "UR87278812", "Content": "We arrived last Friday 12th November and stayed for 3 nights- I had read reviews and as we had never been to Paris before I had made my mind up that as long as it was clean we would have to put up with any other shabby decor -but when my husband opened the bedroom door number 204 my first reaction and the one that initially counts was it was really bright and fresh- wallpaper blue/silver and white bedlinen spotlessly clean and I would like to think I am fussy when it comes to cleanliness.. Room was at back of hotel and I have to say i slept soundly from the first night it was SO quiet thank goodness. the breakfast continental comprised cereals/cheeses/yoghurts/ preserves choice of 3 /hardboiled eggs/ and to my joy toaster so you get piping hot toast everytime !!! Downside was no teamaking facilities in room. Location absolutely perfect loads of choices of restaurants closeby . Nice bright lobby and Reception staff most helpful we were able to leave our cases last morning while we spent time walking around Paris. We thought it marvellous value and will be booking to go again January 2011!!!!", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Perfect for a jaunt to Paris”", "Author": "EdwigeMattias", "ReviewID": "UR86344048", "Content": "Hotel Soft is just what I look for in a hotel—small, personal and located in a \"real\" Parisian neighborhood, but with a few interesting galleries and bookstores, cafés right around the corner. The hotel is on a quiet side street about halfway between Gare de l'est and Republique. There is a stand of Parisian rental bikes just a stone's throw from the hotel's front entrance. The interior is lovely, contemporary with a little Asian inflection to the décor—nothing cheesy, cutsie or intrusive done to the old building. And being one of the cheapest hotels listed on TripAdvisor, it has my whole-hearted recommendation. The staff are friendly, helpful and discreet.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not worth the money”", "Author": "lbyh83", "ReviewID": "UR85000457", "Content": "Not a great experience with Hotel Soft: - Our room was not ready for check-in - The wi-fi only works in the lounge area and not in any rooms other than the first floor. - Our bedroom light was broken. - The rooms are incredibly small and the wallpaper starts to bubble if you have a hot shower. - The toilet seat in our room was broken. - Housekeeping changed our bedsheets to ones with blood on them. - The walls are very thin: you can hear people talking, opening doors, taking a bath etc. - The room was very cold and the hotel would not turn on the heating. - The breakfast buffet is very basic (although the kitchen staff lady was very nice) - There is very little to do nearby the hotel. - Room service consists of soft drinks plus a 3.50 EURO charge. - There were no tea/coffee making facilities (i.e. a kettle). - The towels were small, smelt funny and left bits on your skin. Won't be going there again.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Boulder, CO", "Title": "“Is this really what you have to settle for in Paris?”", "Author": "wjgoodrich", "ReviewID": "UR83186000", "Content": "In looking for a hotel in Paris we assumed we would spend more than we wanted and get something smaller and less nice than we wanted. After searching for some time and finding that to be quite true, we decided to increase our budget a bit to see if we could get something moderately acceptable. That plan did not work. Our room at the Hotel Soft was about as small as a room could be and still contain a bed. The place was not really 'dirty' but it definitely did not feel clean either. The obvious recent update to an old hotel mainly consisted of putting a decal on the wall and a modern vase on the desk. The bathroom had cracked tile, there was no place to put our two suitcases, and there was also no obvious technique for maneuvering past one another through the space. All this coupled with the unseasonably warm weather and no A/C led to a somewhat 'less-than-ideal' place to stay in Paris. My recommendation would be to suck it up and pay *even more* money for your stay in Paris, or suck it up and stay in some kind of hostel-type place, which will save you a lot of money and provide just about the same quality. The two benefits of the Hotel Soft are the great staff and the location. The location is definitely a little edgy, but it's gratifying to experience a genuine Paris neighborhood not overrun by tourists. It's also convenient to the Metro and to both Gare du l'est and nord.", "Date": "October 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Comfortable, welcoming and good value”", "Author": "ar_curran", "ReviewID": "UR82769983", "Content": "My boyfriend and I stayed here for 4 nights in late September. We got the number 350 bus from CDG which departed from the same stop as thge Opera/Roissy bus and stopped at Gare de l'est and the hotel was just a few mins walk from there. The staff were very welcoming and friendly and our room, although compact, was very nicely decorated, bright, clean and really comfortable. The hotel was pretty much silent at night and we slept very well. The breakfast buffet, included in the room rate, consisted of tea/coffee, cereals, toast, pastries, bread, cheese, yogurts, fruit and juices which was a real bonus and seemingly unusual in most Paris hotels! We managed to get to a lot of the places we wanted to go to on foot as the weather was nice and we were in no rush, but there were also several metro stations nearby and although the area was not as busy and glitzy as the more central 'touristy' area of Paris, we felt quite comfortable returning to the hotel late on. There were plenty of places to eat and drink within 10 mins walk. We would definitely return to this lovely little hotel.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Daventry", "Title": "“Well managed and welcoming”", "Author": "Panteleon", "ReviewID": "UR82471130", "Content": "The hotel, like many others in Paris, is compact, but good use is made of the space, both in the foyer and the rooms. The hotel has a modern, well maintained decor and we were particularly impressed by the welcoming and helpful staff. The standards of cleanliness were very high throughout and the beds comfortable. The breakfast was served at a buffet and the quality was good, if a little limited in range - definitely a \"continental breakfast\". Location is a bit far from the major attractions but they were all reachable by foot or the nearby Metro. The area is not the smartest, but it was not threatening in any way and we enjoyed the illusion of belonging to a real Parisian neighbourhood! The actual location of the hotel is on a quiet side street, close to a wide range of cafes etc. We would definitely return.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Good location”", "Author": "EK103", "ReviewID": "UR77057497", "Content": "We stayed 3 nights in this hotel and would stay there again. It's 5-10 minutes from Gare de l'Est and only about 20 minutes to walk to the Pompidou centre so very central. The room was nicely decorated, clean and although not huge, it was plenty big enough. There was a buffet-style breakfast with bread, croissants, hard boiled eggs, cheese, preserves and yoghurts and good service. It's also close to Canal St Martin and you can walk along there which is nice. We saw lots of people having picnics in the evening by the canal. We went to a nice Thai restaurant about 5 minutes walk from the hotel, near the canal, and there were a few other restaurants and bars too.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "telford Shropshire", "Title": "“would stay again”", "Author": "magtot", "ReviewID": "UR76638177", "Content": "Stayed for 1 night and had 2 full days in Paris and this hotel was perfect. The rooms are modern and clean and that to me is very important. The staff are English speaking and the location was fab as the metro was only minutes away. The metro is definately the best way to get around, we did consider getting on a tour bus but it was very expensive and time consuming. We seen all the sights we wanted too and more and i must say the sacrecure, eiffel tower and the river seine crusie were by far the highlights! The only SMALL downside was that the area was not as great as expected come evening (eating out).... we went down to the canal as we were told theres plenty of restaurant and to be honest we struggled to find one as it seemed very quiet and a little uncomfortable with all the students drinking and lounging around by the canal. Overall i would stay here again and would recommend it to a friend.:) p.s no problem with noise or room temperature and in all fairness it was 28 degrees when we were there.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean, cheap, with very stuffy rooms.”", "Author": "wendy92", "ReviewID": "UR75472519", "Content": "Our stay lasted 3 nights. The hotel is situated down a quiet road which leads onto a much noisier main road; we heard traffic and sirens every night but were too tired to be disturbed. We were situated very near to the gare de est and very near to a metro, (the centre was only a short metro ride away). The room itself was very small (to be expected at such a price), but clean, but be warned, there is no air con or fan available within the room, which made for a very hot, stuffy and sweaty nights sleep. The flat screen television in the room was a real treat, although we could hardly hear it because the volume had been locked at a low maximum (I suspect to maintain the 'soft' atmosphere, they portray). On problem i encountered was the lack of seating space at the breakfast area. Only ten tables existed and we had to wait a considerable amount of time before we were able to eat. Breakfast was ample. Overall, the hotel was satisfactory, and good value for money for a budget holiday in paris.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kingston-upon-Hull, United Kingdom", "Title": "“Good Hotel - take a fan !”", "Author": "Goobs2010", "ReviewID": "UR74745290", "Content": "We read the other reviews before travelling on a Eurostar 3 nights for the price of 2 deal and took 2 fans with us to keep cool at night. Paris is warm in August. But we slept well even with a window onto the street open all night - perhaps helped by the fact we were exhausted from seeing the sights till late every day and having a couple of bottles of vin rose! Breakfast was busy around 8.30 to 9 but quiet after that. We ate at Le Moderne up near Gare De L'Est having the 2 course Menu one night (e9.90) then a steak another (e14.50). Bottle of rose e13.50. Large Kronenbourg e6.00. Also decided to stay in the centre one night to see the Eiffel Tower light display they have for 5 minutes on the hour when it gets dark (must see - think xmas tree with chasing lights) and ate at La Fontaine Italian pizza restaurant on Rue de Moliere. e11 for a big pizza plus e5 for 50cl rose wine. Plate of chips e6 though?! Get the L'Open Tour 2 day bus for e32 - it has 4 different routes. Also get a carnet of 10 tickets to save on the metro e12 instead of e1.70 per ticket. Get a Museum Pass e32 to jump queues and get in the 60 museums/monuments. Saw the queue at the Louvre stretching out of the courtyard and walked past to a side entrance and in the museum in 2 minutes. Bought Tour and Pass at Gare de L'Est tourist info office (closed Sundays). Plus did a 1 hour boat trip up-down the Seine paid for with Tesco vouchers! Eiffel Tour is e8.10 and a heck of a queue. Woud love to stay here again. Staff were very nice and the room was a reasonable size with a wardrobe but no drawers and had a bath which we were not expecting. Room was not ready for 5 minutes when we arrived and we were given a free drink whilst the cleaner finished off. Tres Bon !", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly, good value for money - would stay again”", "Author": "KimAllen19", "ReviewID": "UR74402684", "Content": "We stayed at Soft Hotel as part of a weekend Eurostar break through Guardian holidays. This hotel was one of about a dozen you can choose from and we are so pleased we picked it. Just 10 mins walk fromthe Eurostar station and located close to the lovely St Martin Canal, it is well located. A velib station is just outside - we used the bikes lots and would really recommend them as the best way to get around the city. The staff at the hotel were always friendly and helpful. Our room was a good size - Not a great view of some building work out the back but otherwise perfect - the bed was enormous and very comfy. We didnt make most use of the breakfast - there isnt a lot of space to eat it (in the main reception) so if you get there too late then you cant find a seat. But otherwise great. I would definately return here again.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“A lovely clean little hotel well worth the money”", "Author": "Lori077", "ReviewID": "UR72530199", "Content": "My daughter and myself are just back from a short trip to Paris and we thoroughly enjoyed our stay in the Soft hotel. The rooms were very clean, modern and well decorated far better than any smaller hotel that I have been in before in Paris. The staff are friendly and were very helpful and gave good advice about methods of transport places to go etc. Breakfasts were good not just your usual Continental breakfast of bread and coffee but cheeses, cereal, juices. I would certainly return to this hotel and it is well situated for metro and RER stations. Thank you for our enjoyable stay.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bedford, England", "Title": "“Good stay but very hot room”", "Author": "bedfordians", "ReviewID": "UR70932359", "Content": "We enjoyed our stay at Hotel Soft. Rooms are reasonably priced, well presented, clean and functional and the location is very good for access to most sights. We walked to most places and the hotel is near a lovely canal where many people were picnicking in the sun. However the room was hot, hot, hot! We couldn't sleep properly all the time we were there as there was no air conditioning and no electric fans. We did ask but they were not available. We were there during a heatwave but even so the room would be very hot on any summer day. We would definitely visit again but only in summer if fans were provided.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“The friendly staff made us feel like home...in Paris!”", "Author": "Therese013", "ReviewID": "UR68717673", "Content": "Ahmed and his colleagues took great care of us when we needed to change hotel during our stay in Paris. In the situation we were in, they did everything they could to help us. It can be described like a \"911-hotel-situation\" ;-) We were only hotel guests but were received like friends! Our room was one of the best we have ever stayed in, as well as the breakfast that was served by the friendly lady. The city centre is just a few minutes away with the Metro and the train stations Gare du Nord and Gare de l'Est is just a few blocks from the hotel. As we said, the quality of the hotel is great and the friendly and service-minded staff made it even better - THANK YOU for contributing to making our stay in Paris wonderful!", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“One of the best small hotels I have ever been to !”", "Author": "LesleyB140368", "ReviewID": "UR66087982", "Content": "The Hotel Soft is a fantastic little find, just 5 mins walk from the GARE DE L'EST, and 5 mins from METRO JACQUES BONSERGENT, 10 mins walk from REPUBLIQUE. The foyer is bright modern and very welcoming, all the staff we came into contact with were extremely helpful and very pleasant with good english, from the reception staff to the lady who served breakfast (who is very smiley and pleasant). The reception were able to lend us an adaptor to charge our phone as the one we brought would not work. On arrival they gave us a complimentary soft drink while we waited as our room was not ready. The breakfast was great, there were two choices of juice, cereal's, choices of croissant and pastries, bread and jams, yoghurts, fresh fruit and coffee, what more could you want! Our room (501) was overlooking the street, we could hear some street noise, but nothing too intrusive, I quite like the street sounds, you are listening to true Paris life, that's what you are there for. The room itself, although small, (which in my experience is the norm for Paris) was beautifully decorated with modern furnishings and en suite with contemporary glass wash basin and kept immaculately clean, we only spent three days there and had changes of fresh bedding, towels and complimentary toiletries. The area surrounding the hotel seems to be undergoing some regeneration, hopefully in a couple of years it will be really quite nice around there. We found and sat for a while in the local park just behind the hotel which overlooks the Canal St Martin and watched some local student's practicing a play on the bandstand. There are boat trips available on the canal, but we chose to walk as far down as we could before it disappeared beneath the city. There are plenty of restaurants in and around Republique - we ate there a couple of evenings and had a couple of evenings into the latin quarter which is easily accessible via the METRO from the GARE DE L'EST. So all in all, well done to the Hotel Soft keep up the good work and we have no hesitation in recommending this Hotel to anyone and would definately stay there again.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Excellent location for Eurostar, good service, very decent rooms”", "Author": "Di0nysia", "ReviewID": "UR63854315", "Content": "My rating is more 3.5 than 3 actually... We chose this hotel because it is very close to la Gare du Nord and we were travelling with Eurostar. It is a simple, cosy, good value for money, and well located little hotel (close to the canal St Martin, that is nice for a walk and an up and coming area). Rooms look more 'tired' than in the photos of the hotel website, but they are absolutely fine. Staff very friendly and willing to help. Breakfast could have been better but it is not expensive. Very close to the metro and, and if you like walking, central Paris in walking distance. Overall, a good experience and we would go there again...", "Date": "May 11, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "england", "Title": "“excellent hotel with friendly staff”", "Author": "pjmccona", "ReviewID": "UR61390847", "Content": "We stayed at the hotel for a 3 night getaway and arrived late at 11pm. The sta were extremely friendly and helpul in telling us where we were still able to get some food. When we got to the room it was clean and comfortable with everything you would need for a short stay. As this wa our 1st time in Paris the staff were excellent in giving us advice on metro stops an routes to find sites and this was no problem to them. The hotel is in a good location only a couple of minute walk fom the gard de l'est and about 10 mins from gare du nord. Both are easily alkable and gave excellent transport to all the major sites. The hotel made our stay extremely enjoyable.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“very cosy, good location”", "Author": "lyndsayloo", "ReviewID": "UR60613932", "Content": "Me & my boyfriend stayed for 3 nights...Very cosy little hotel, good value for money! It's a few minutes walk to the metro stations which more or less gets you anywhere you want to go! Loads of bars and restuarants up next to the canal in Gare de Est (10 min walk up the street) which we only discoverd on our last day! Turns out we were going the total opposite way! But anyway we did go for a lovely meal in one of the resturants up here which was brill! The staff in the hotel spoke good english they were very friendly and seemed helpful enough to give you directions to where you wanted to go. A small contininetal breakfast is available from 7am till about 9.30am which basically consisted of tea, coffee, croissants, cereal & hard boiled eggs. There are always loads of snack vans around for picking up a panini or baguette...which we did mostly or grabbed a mcdonalds in the atfernoon if we were hungry! Plenty of those around as well! I definetly recommend this place and look forward to staying here again in the future!", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montclair,New Jersey", "Title": "“What a lucky discovery!”", "Author": "psydiver53", "ReviewID": "UR57183887", "Content": "This was my first trip to France, and I booked the hotel sheerly on previous reviews, and the reasonable price. It turned out to be an excellent choice. For starters, it was conveniently located (less than a 5 minute walk) to 2 major transportation hubs. Among the predominantly non-descript budget hotels in Paris, this place was quite beckoning. The rooms were adequate size, meticulously clean, and the staff were friendly , helpful, and dependable (I got punctual wake-up calls, which didn't happen everywhere in Europe). Everyone spoke English well, and several were clearly fluent in several languages ( Ahmed, the night manager, heard me lapse into Spanish at one point, and seamlessly continued our conversation in Spanish). This was a great place to begin to know Paris.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Croydon", "Title": "“a great value hotel in a great city”", "Author": "GillyM2", "ReviewID": "UR56914496", "Content": "I spent Valentine's weekend in a very busy Paris with my mother- a joint treat. We stayed at hotel soft for 4 nights. Its a great hotel- the only drawbacks I could see were that the rooms have no drawers- only a wardrobe and no dining room- just small coffee tables in a breakfast/lounge area and the rooms have no view. But for £70 a night for a twin room including breakfast it's got so much to offer. It is so convenient for gare de l'est and eurostar, it is clean, warm and quiet, the towels are changed each day, the breakfast included hard boiled eggs, rolls, jams, compote, yoghurt, pastries, cereal, fruit juice, coffee, and English/herbal tea and was help-yourself and the beds were very comfortable so we often overslept. We even found a great restaurant called le moderne on rue de strasbourg opposite the gare de l'est with a pianist every night and a varied 3 course meal for 12 euro and 50cl good wine for 6 euro. For Paris that was a great deal so we ate there every evening.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London UK", "Title": "“Lovely, modern and great location”", "Author": "ScaryMole", "ReviewID": "UR56655786", "Content": "Spent a long weekend in Paris for my birthday at the end of June '09 we were recommended the Hotel Soft by friends. A great location, only a 10-15 min walk from Gare de Nord and Gare de Est (short enough to lug a heavy bag!) and close enough to several Metro stations, enough to get you to most of the major attractions. It's also a 5 minute walk from a canal which is a nice walk and lined with restaurants and bars. The hotel has been refurbished within the last few years and had nice modern decor and facilities, our room was fairly small but perfectly adequate. The only complaints would be that it was very hot when we were there (about 30c) and there's no air-con, also there was some building work going on next door which was woke us up early each morning. The room had free wi-fi and a TV, although the only English language channel was a slightly fuzzy BBC World. The reception staff were very helpful and friendly and spoke good English, they were a great help in advising on how to get to places", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“A lovely hotel with a great service!”", "Author": "Maria-Jocelyn", "ReviewID": "UR56229428", "Content": "A warm start of our citytrip! Thanks a lot - Marjolijn", "Date": "February 17, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Excellent value hotel near Eurostar terminal”", "Author": "A TripAdvisor Member", "ReviewID": "UR55018884", "Content": "We arrived at Gare du Nord and it was only a 10 minute walk to the hotel. We arrived at 1pm and were able to check in early which was great. Our room was 501. It was modern and comfortable. Very small with a tony en suite but big enough for what we needed. The shower is very good although the hairdryer was not very powerful. The hotel is well located. It is a few minutes walk to the nearest tube and only 15 to 20 mins walk to Pompidou. For 89 euros this place was great, just what we needed on our fairly tight budget.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Fine Hotel”", "Author": "Kimmie2408", "ReviewID": "UR54721461", "Content": "just stayed in this hotel for 4 nights with my mother. We liked the hotel very much. Nice employees. Clean rooms. Everyday you get clean towels. Breakfast is good. And the location is good. You stay in a quiet area and with public transport you are in like 10 minutes in the center of Paris. From gare d'est there is a metro direct to louvre museum and the center of Paris. Good cozy hotel good value for money!", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin", "Title": "“Good location”", "Author": "Dublin15chick", "ReviewID": "UR53834173", "Content": "We stayed here for the New year and found it to be very good. Hotels were expensive for this time period in Paris and the Hotel Soft was pretty good value, although not cheap. The rooms are smalll but clean and well appointed. The walls are a bit thin but I have to say this didn't bother us. The location is very good with some nice restaurants and bars nearby. The canal is lovely to walk along. And the bicycle stand is great. We hired bikes on New Years day and it was great. so all in all very good! Would recommend! High point would be the great helpful staff!!", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great base for Paris visit - good value”", "Author": "Atko73", "ReviewID": "UR52629344", "Content": "A Paris hotel is never going to be cheap - but this was certainly good value. Smallish rooms but clean and nicely, stylishly decorated with a friendly welcome from the helpful staff. Its well located for the Eurostar (10 mins walk to Gare du Nord and 5 to Gare D'Est), but well away from the seedier side of the station district. Metro station is 3 mins walk away There is a velib (bike hire) stand outside, great for beginning a bike ride along the nearby canal. The bed was comfy, the shower hot and the breakfast tasty (choice of cereals, pastries, bread rolls, yogurt, fruti juice and coffee or a range of teas). Small breakfast area which can get crowded. Free wifi too if you had a laptop or Smartphone. Would definitely stay there again.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "coventry", "Title": "“probably the friendliest hotel staff i've encountered”", "Author": "CoventryCavanagh", "ReviewID": "UR51151986", "Content": "nice little hotel with very helpful and friendly staff except the mature lady dealing with breakfasts. Room was small but clean. Good location near to Gard de L'est and Gard de Nord. Open top tour bus has a stop opposite L'est.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Excellent!”", "Author": "Honeyjj", "ReviewID": "UR50902722", "Content": "You cannot fault this hotel. It is cheap, clean, modern...the staff are very friendly and its only a few mins walk to the metro to get into the centre of Paris. Would definitely recommend !", "Date": "December 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "greece", "Title": "“Absolutely Perfect!”", "Author": "Lenia21", "ReviewID": "UR48542340", "Content": "We would like to thank everybody at the Soft Hotel for making our Paris vacation so wonderful. The hotel is very clean, quiet and friendly. The bed extremely comfortable, the bathroom clean and the room very nice decorated. The breakfast is basic but the breads and croissants delicious!!!! Very good location with many metro lines available at the Gare Est. The only bad thing I could say about Soft Hotel is that the lady serving breakfast was a bit rude but all the other people working there were so friendly and helpful ... Thank you all we'll surely recomend Soft Hotel to our friends!!!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "bonn", "Title": "“a soft experience in every way!”", "Author": "funtobewith", "ReviewID": "UR48286634", "Content": "the hotel was perfect! Soft price and extremely comfortable.Very clean white linen bedsheets...quiet and clean bathroom too! Lots of hot water to go with.I enjoyed every bit of my stay and there were lots of good eateries around...spanish tapas restaurant just next door though i had some north african food in another small restaurant nearby.I highly recommend it! Very peaceful too.Would definately go back again.The beds were very spacious.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester UK", "Title": "“Highly recommend”", "Author": "mabManchesterUK", "ReviewID": "UR47463418", "Content": "I stayed in this hotel for a week and could not fault it. It was clean, warm, unpretentious and Ahmed, in particular,was very kind and helpful. The breakfast bread was far superior to others I've encountered, with a wholegrain role being offered. Good tapas bar virtually next door and excellent base for getting round Paris.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "jad0reparis", "Title": "“absolutely excellent”", "Author": "jad0reparis", "ReviewID": "UR46963864", "Content": "We found this hotel to be an excellent base. Wonderful location - close to two metro stations and not too long a ride away from the main attractions; fantastic restaurants nearby with good prices and beautiful wine to go with beautiful food. Lovely, comfortable and very quiet rooms which were very clean and nicely decorated. Welcoming and very helpful reception staff - nothing was too much bother.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Lanskrona", "Title": "“... felt at home!!”", "Author": "pusspudding", "ReviewID": "UR41637929", "Content": "From the moment we arrived to the hotel and there was a problem with booking from agent - and it was solved in a couple of minutes - even if the hotel where fully booked, I knew I enjoy staying there. Room was the biggest, but comfortable enough and clean .. a bit of a problem to step in and out of the bathtub because of the shape, but we survived. Not any spring chickens - neither my friend and I. Breakfast was French with some add ons - perfect for us, because if you are in France we want to eat like the French. The staff are... the main feature!!! Outstanding, so helpful and nothing was a problem for them. Didn't matter what time of the day + everything was delivered with a smile. The lady that served the breakfast didn't speak a word of English, but she couldn't do enough and always smiling. The price was right too ... so we really felt like at home ... with everything. If we go back to Paris again ... we till be staying there.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Nice, Friendly and Clean Hotel - But : do not come by car !”", "Author": "JanDeconinck", "ReviewID": "UR37902935", "Content": "I decided to go to Paris with my two young children to give them a taste of what this city can offer. We visited the Louvre, the Eifel Tower, the Science museum ... It was a two day trip and so we only needed the hotel as a place to sleep for one night and recuperate for the next full day of walking and visiting. I was very impressed by the friendliness of the staff and the very clean and modern look of the hotel. Those of you who already have been to Paris will certainly realise how exceptional this is for a moderately priced hotel ;-) (I only paid 110 euros for three persons for one night !) The rooms were rather small but ok for us as we only stayed for a short while. I had ordered a triple room , but the hotel had changed this to a single and a double room. Once they realised that I was taveling with my kids they rearranged the rooms so that they were next to each other. Very good service. The hotel is situated in the 10th arrondissement (which is in the north), very close to both the north and east railway station and therefore very good access to the metro network . It is also very easy to reach by car. Their website indicated that there was a parking nearby and that you would get a prefferential rate if you stay at the Soft Hotel. The parking was indeed close by and easy to find. However it seems to be exactly the opposite from the hotel : shabby and unfriendly. When you first arrive you have to give your car keys to the operator and he will park your car and keep the keys during your stay. In return you get a receipt with time and date of arrival. This means that, although your car is parked nearby the hotel, there is no easy way to get to any belongings that you leave in your car. At the hotel they put a stamp on your receipt and inform you that this serves a paymentn for the parking for 24 hours. So far so good. Things went bad however when I went to retreive my car. I had arrived Wednesday at approx. 11 AM and retrieved my car on Thursday 11 PM. They insisted that I had to pay for two days as my car stayed for 48 hrs (which is not true ! do the math). This would cost me 80 euros. I indicated the hotel stamp on the receipt and said that this was valid for 24 hrs. They said no, only for one day (? ! ) which meant that I still had to pay for Thursday or 75 euros (???). After some hassle (remember they are holding my car keys !), I could get the fee down to 70 euros, which iin my opinion is still a rip-off and nowhere near the prices indicated. I thought that someone would then get my car and bring it to me. But no, I had to search for my car myself (I had no idea where it was parked). Upon reaching the car I then noticed that my car wasn't even locked !!! This is NOT the kind of experience I want to have at 11PM, tired from visiting paris and having two young children with me. The hotel is nice and friendly but the car park is a total rip-off. I would strongely urge the owners of the hotel to have a very long talk with the owners of the car park. The experience I had with the car park is for me enough NOT to return to this hotel.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Perth", "Title": "“Great location for Gare L'Est”", "Author": "Evergreen05", "ReviewID": "UR36945117", "Content": "Chosen because of proximity to Gare L'Est and price. Very clean, has lift, no small refrigerator and no airconditioning. Could be rather warm in July/August. The refit has been reasonably recent so it all looks good on the surface. Room adequate but quite small. Breakfast is extra - buy yoghurt & fruit instead. Cheap internet is available in the area, and that is often a guide to the suburb. We only stayed a night en route to the country. Desk staff very pleasant.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“a great location/great price”", "Author": "SheyBu", "ReviewID": "UR36387467", "Content": "Hotel Soft was great - it was exactly at the location that served us best., very neighborhood like, but still surrounded by romantic Paris. I wanted to be next to the Canal St. Martin, and it was a perfect two blocks from it. And the 15 min. walk to Gare Nord was also extremely practical, as we were arriving through there. Also, there is a super market down the road (a block away) where one can buy something if missed without having to pay extortion touristy area prices. Plus there are quite a few nice restaurants in the area itself and along the canal itself (try Hotel du Nord, Le Jammape). And its just a walk away from La Republique, then on to le Marais, Pompidou Center and and on and on. The hotel itself was great. The rooms were quite a good size for Paris standards and decorated with bright colours. The bathroom was also a good size, clean and quite modern. The bets thing in there were the pillows! I wanted to steal one :)! The staff were also very friendly and accommodating. I prefer staying in a place where we can feel like we are with a family style accommodation rather than by-the-rules stuffiness. The only thing is that there is no fridge in the room. But otherwise, I would definitely stay there again. Price and location were great for me!", "Date": "August 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "belgium", "Title": "“okay for it's price”", "Author": "veussel", "ReviewID": "UR35658349", "Content": "- location: a few minutes from gare de l'est, good location breakfast: \"french\": bread, cereales, jam, yoghurt,....simple but okay, staff very friendly room: as expected, good for paris standards bed: i had a good sleep bathroom: not so good. when they renovated it, they forget finish the details: cracks in the floor, brown marking in the shower(damp...) overall, 1 night is sufficient and this is a hotel for business travellers", "Date": "July 24, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Great location and staff !!”", "Author": "kiwigirltravelling", "ReviewID": "UR35348040", "Content": "Stayed there for a weekend family break, within walking distance from Gare du Nord - about 15 mins. Very friendly staff - especially the lovely Ahmed ! Nice street with the canal at the end and a small local supermarket. Bit noisy on one night with a few police sirens but thats Paris I guess - always busy.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“Great value for money - cool, minimal design and friendly staff!”", "Author": "cena67", "ReviewID": "UR34011407", "Content": "Soft Hotel would cost much more in a trendier part of Paris like Marais, making it good value for people less bothered by its slightly sketchy neighbourhood. Rooms are clean, modern, efficient and quite roomy for Paris. Staff are friendly and helpful. There was bit of a noise issue due to building works next door but nothing intolerable. I've stayed at countless Parisian budget hotels over the years, and Soft offers rare combination of cool, clean design (without tacky chintz), decent staff and good prices which are even cheaper via internet. Neighbourhood near Gare de l'Est is charmless and bit rough. but short metro to better areas. Probably best for experienced solo travellers, young couples and budget business travel!", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas Plains", "Title": "“Great value”", "Author": "MinnTex", "ReviewID": "UR31810801", "Content": "We stayed here with a group and the staff were very accommodating. Location is very convenient and in a decent neighborhood; it is not on a main street, so it is fairly quiet. (Hint: use the Gare de l'Est for your metro location; there is another station that is a 100 meters closer, but you will most likely have to change lines.) The breakfast has a decent variety--not fantastic but the café au lait is endless and the breads are very good.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edinburgh", "Title": "“Superficial decoration”", "Author": "Mansies", "ReviewID": "UR31773229", "Content": "This hotel is ok - the service and location are very good, but the decoration of the rooms is only superficial. The heater was coming off the wall, there were exposed pipes and a hole in the ceiling, cracked tiles in the bathroom and poorly aligned wallpaper. It was fairly quiet, with just a little noise from the street and some doors banging from other guests. I didn't eat the breakfast as there are plenty of local patisseries. The 'air conditioning' is a noisy fan that turns on in the bathroom when the light is turned on. I felt ok about staying here, but as it was my first trip to Paris I don't know how it compares to other hotels. On my next trip to Paris I think I will try elsewhere.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brazil", "Title": "“Nice, cosy, good cost-benefit”", "Author": "dilligevisfac", "ReviewID": "UR30581783", "Content": "The rooms are really small and the bathroom even smaller. But Soft Hotel is nice, clean, has a very attentive personnel and a decent breakfeast. If you want a hotel only to sleep at night after a busy turist day, Soft Hotel is the right place for you. An important note: rooms don't have frigobars, but they allow you to store one treat or two in the hotel refrigerator.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Ontario", "Title": "“Convenient and clean but not so safe”", "Author": "SarahSmileOntario", "ReviewID": "UR30089478", "Content": "We stayed in this hotel for 1 night before leaving Paris. The hotel was clean and updated. You can tell that they tried to make an old hotel modern but did it with the bare minimum. The bathroom had a nice new tub, sink and toilet but they were installed over old, dated, cracked tile. I believe that if you are going to do something, do it right. The bedding was nice but when I pulled back the covers they had an old tattered brown blanket which kind of creeped me out. On the taxi ride to the hotel we were shocked at the kind of people in that area - not safe looking at all. We went out for dinner early because we did not want to walk in that area at night. We were very surprised that when we went out for dinner the area had completely changed, there were far less people on the streets (5 pm). Then we realized that there were police on every corner (no joke) checking everyone's papers. Yikes. We walked 15 mins to the Rue Montorgueil for dinner where we felt comfortable and we knew that there were good restaurants. It was conveniently located 10 mins from the train station which worked for us because we had an early flight but I would not recommend this hotel for people staying in Paris and venturing out at night. Clean, comfortable, affordable and suitable if you are not intimidated by this type of area.", "Date": "May 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manila", "Title": "“Excellent hotel, cosy and chic!”", "Author": "nadz4nier", "ReviewID": "UR28626960", "Content": "Hotel Soft is situated in a quiet, peaceful neighborhood near two major metro stations which makes transportation very efficient. There are cheap and delicious places to eat right around the corner. The hotel room itself is very clean and pretty and looks exactly the way it is presented on the website. The shower is also very strong; we had no problems getting hot water. The free wi-fi in the room is also very convenient and a great plus. The staff is very courteous and friendly and all speak good English. All are informative and helpful concerning tourist matters, like how to get to the major attractions and the best deals for touring. We enjoyed our stay at Le Soft very much and hope to return on our next trip to Paris. Merci messieurs et madame! -Stephanie & Nadine", "Date": "April 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good value for a budget hotel”", "Author": "citizenDiego", "ReviewID": "UR28523692", "Content": "Stayed there for 2 days. The area surrounding the hotel is not what you expect from Paris but this is a problem of the city and not of the hotel itself. Its close to 2 metro stations and you can easily reach any part of Paris. The lobby and rooms were recently renovated. The room and toilet are small but just offers what you need, contemporary and \"new\" furniture. I think anyone can't complaint about the overall of the hotel. Another plus is the free wi-fi connection, fast enough. Breakfast is expensive but all hotels are the same. It's only lacking on details. 2 lamps in the room were not working and the toilet amenities are under expectation (if they spend money personalizing the remote control with the name of the hotel why dont they offer better selection of shower gel, soup, ...?) I would recommend this hotel and if I go to Paris again I would stay there.", "Date": "April 21, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Australia", "Title": "“Awesomeness”", "Author": "H38caKg0L", "ReviewID": "UR24436484", "Content": "The room deco is amazing - i mean, AMAZING!!11!one. Everything about the deco from the lights to the bed to the table and curtains and wallpaper just seemed to meld into one another with a hallowed chorus of \"...come stay in meeee!...\" I've stayed in 5-star hotels with worse furnishings, and the samsung flat screen TV just makes it so much better (didnt switch it on though). The lounge was still under renovation when i arrived, so hopefully finish that soon with the same vintage theme deco as exists in the rooms. Oh, did i mention that the room looked friggin' awesome? The concierge was friendly too. Only complaint was the unbelievably narrow corridors, and if the chambermaid leaves her trolley around, it blocks the entire corridor (and you've to do handstands and cartwheels and gymnastic doodles to get to your room). The lift is spacious for european standards, and it comes with a mirror for those who'd like to check their hair (ok that's irrelevant) Breakfast was simple but yummy, consisting of the usual croissants/ buns and cereal. Another complaint would be the random pipe running from the ceiling that makes funny trickling noises (would be a simple matter to plaster it off, I don't really care anyway, the deco was way too good). Overall 75 Euro buys you a small pretty room that's completely worth every cent.", "Date": "February 10, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "England", "Title": "“Hotel Soft”", "Author": "GGGGGB", "ReviewID": "UR23261239", "Content": "This small hotel is only a few minutes walk from Gare de L'Est train station. There are some lovely bars and restaurants near the canal. The rooms were brilliantly designed and very comfortable. The reception area is quite small, however, if you do not want to gather in this area you won't mind.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Loved the Soft Hotel Paris!!!”", "Author": "jasmine1London", "ReviewID": "UR22235618", "Content": "Arrived on the 14th of November 2008 (Weekend) with reservation made over the phone, and confirmed instantly by email by very pleasant and friendly Nathalie. Very clean, cosy ensuite roooms, regularly cleaned. Genuinely friendly staff (including the cleaners). Guaranteed noise-free good night sleep. High quality, high standard, friendly staff, 10/10. (Jenny)", "Date": "November 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“simple easy borderline chic paris base”", "Author": "gjs0987", "ReviewID": "UR21736719", "Content": "We just returned yesterday from our 4 night´s stay at Hotel Soft. This was my first time in Paris and my partner´s third. We are a young couple, 21 and 23, yet have traveled extensively worldwide and tend to prefer chic boutique hotels which are a bit more design conscious. Of course, at our age, that can often be impossible. I spent many hours searching for the perfect hotel because I have heard so many terrible things about Paris hotels. And I think for what I was looking for, this hotel had everything we were looking for. It was a weekend Thursday-Monday stay with a lot packed in and a busy schedule with friends in Paris and we simply couldn´t bear to encounter hotel problems. From the beginning, the hotel staff was extremely kind and helpful. They even made a us a reservation at a restaurant when we asked because our French is not so great. The lobby is not as nice as it is in the photos but in the end, the lobby is useless and serves no purpose after check in. We did not even purchase breakfast there which I think is a waste for 14 euros. There are great places around the corner. Anyways, past the lobby, the hotel itself is small and I love the way it is organized. The hallways are very narrow but long and well divided and everything is carpeted and dimly lit. It has more of an apartment feel or even fashion boarding house feel than a hotel. It´s exactly the ambience we like. We stayed in room 301 which was a cosy room. We had one of the pink rooms like on the website photos. I´m not sure how the other rooms look like, but I think they all come with flat screen tvs. I specifically emailed the hotel and asked for the room in the picture which I usually do to ensure the best. The room was quite large there was space for everything. Our room had a large window to the street which let in some light. During the summer I´m sure it´s wonderful as the window opens up entirely. Also the bathroom was great. Very very large and came with a bath. The sink, everything was very well decorated and it never really felt like a hotel. Everything was just so simple and understated and understandable. The carpet in the room was also very clean and comfortable. I read some other reviews which talked about thin walls. We didn´t hear anything but we also were only in the room at night and to sleep. Each floor only has 6 rooms. 3 on each side. So it makes it quite quiet I guess when people walk by. The lighting also was great in the room. The little complaints I have where the following. There were no drawers and not enough hangers. Silly things but I like to totally unpack my bags. There was a lot of floor space for everything but a little chest would have come in handy. Although the nightstands where great! And the toiletries were very minimal like in every hotel. But we always bring our own anyways so that wasn´t a problem. The location. The thing is we love to walk. And yes the hotel is not smack down in the center near the louvre. But you are 15-20 min walk to the marais which is a very nice walk, and metro is easy to get anywhere else because gare d´est is 2 minutes away. So if you´re worried about the location like I was, don´t be. Overall, great stay and I would definitely stay here again.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bethlehem, PA, USA", "Title": "“Hotel Soft is very good”", "Author": "smfBethlehem", "ReviewID": "UR21627494", "Content": "My colleague and I had a very pleasant week-long stay at the Hotel Soft. The management was very helpful for both business and tourist activities. They had a room available for us we arrived at 9 am from our flight from the U.S. The room, which was the largest they had, had a king bed and a small single in the corner. It was comfortable for two of us, although a little sparse--no drawers to put anything in--just a small closet. The free WiFi connection in the room worked better than that often found in U.S. hotels and was a great bonus for my work. The hotel's location is good since it is very close to Gard de L'Est, which allowed us to use the Metro easily to go to many tourist destinations. This is a fine hotel for its price range.", "Date": "November 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maidstone", "Title": "“Good base to explore Paris”", "Author": "Neil1982", "ReviewID": "UR20913500", "Content": "Booked this hotel to take my girlfriend away for surprise weekend. After reading the reviews I thought it was a safe bet and in my price range. We arrived at the hotel Saturday morning after getting the Eurostar to the Gard Nord, it's about a 20 minute walk from the station however Gard East is the nearest Metro. On arrival at the hotel we were told we couldn't book in until the afternoonm this wasn't a problem as there was a secure room where we could leave our bags. The receptionist was friendly and gave us advice on the local area and the metro. The hotel is about a 10 min metro ride to the centre of Pars on line 4 from the Gard East. Our room was very clean and tidy, not a bad size and had everything we needed. The bathroom was fine with lots of hot water. The only downside was the view from the balcony, which was a brick wall. We were on the 1st floor. We booked a bed and breakfast deal, the breakfast was nice, with a selection of bread, cakes, cereal, yogurts etc. Overall no problems with the hotel and it made for a great weekend. The area around the hotel is fairly nice, with the canel near by and lots of bars / restaurants. Would come here again, but ideally would like a bit more luxury next time, however for the price I couldn't complain.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Cosy, comfortable and convenient”", "Author": "Star102", "ReviewID": "UR20689966", "Content": "Our room at the Soft hotel was cosy, clean and comfortable. They are in the process of renovating the hotel completely and have clearly made the effort to go beyond the basics to provide nice decor, big comfy beds, thick windows to block out street noise and dark curtains to ensure a good night's sleep. The location is very convenient for arriving into the city at Gare du Nord and very close to the metro to get into the centre easily. Excellent value, I would definitely stay there again if I return to Paris.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect stay in the loveliest area in Paris”", "Author": "smeng78", "ReviewID": "UR20676153", "Content": "This is my second stay at Hotel Soft and as usual, it is lovely. The staff are extremely friendly and the rooms are lovely sized for Paris. The room decor and furnishings are nice and simple. This hotel is simply a bargain find in Paris and is certainly value for money. The breakfast is nice and filling. There's a bread basket, yoghurt, cornflakes, tea, coffee and juice. All good enough to start off your day. The area around Canal Saint Martin is really lovely and the road where the hotel is has plenty of nice looking restaurants to eat. Not to mention that the hotel is very close to Gare du Nord and Gare de L'est. If you're looking for a less than usual tourist experience and more Parisien, then this is the area to stay. I do think that given the rate of the rooms, the hotel is certainly deserving of full marks.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“Good Hotel, OK location”", "Author": "je55", "ReviewID": "UR20527777", "Content": "Liked the Hotel Soft - the rooms are reccently renovated, clean and a good size. The reception staff were very friendly and were able to provide maps and good adivce on how to get about. The street where the hotel is is nice enough, but I wasn't that keen on the general area. Arriving back to the hotel after 10pm, the streets didn't feel that safe but saying that, the hotel is close to several metro stations so getting to central paris is quick and easy.", "Date": "October 1, 2008"}], "HotelInfo": {"Name": "Hotel Soft", "HotelURL": "/ShowUserReviews-g187147-d296861-Reviews-Hotel_Soft-Paris_Ile_de_France.html", "Price": "$125 - $225*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">52 bis rue des Vinaigriers</span>, <span class=\"locality\"><span property=\"v:postal-code\">75010</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "296861", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3d/22/4f/hotel-soft.jpg"}}