{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location but tired..”", "Author": "Jez200London", "ReviewID": "UR127544933", "Content": "Really great location across from the beach. Rooms are reasonably priced but they are pretty tired and basic. Beds are very small (booked a double) and bathrooms are a bit too much like airplane toilets. Would benefit from a refit for sure. Downstairs bar is lively and decent plus the food is good. A touch on the noisy side at night.. even on the 3rd floor. Overall a decent stay for the money, especially considering the location.", "Date": "April 9, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Wagga Wagga", "Title": "“Great food, cold beer & great service”", "Author": "Lea-Anne M", "ReviewID": "UR126118150", "Content": "In February my husband & I spent a week in Bondi and found we were drawn to the Hotel Bondi by the large groups of people enjoying themselves there. We walk in to find it very clean and comfortable. We enjoyed a few cold beers then decided to have something to eat, well that was the best. They are very accommodating and friendly, the prices are also very reasonable. I would recommend the Nachos they are the best I have ever tasted. It is also fun watching everyone walking in the street and coming back from the beach. Fun atmosphere!", "Date": "March 14, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle", "Title": "“Cannot beat the location!”", "Author": "sandpailkids", "ReviewID": "UR125204179", "Content": "I came back into Sidney after a whirlwind around Australia before flying back to the US. My first time in Sidney I stayed downtown so this time I wanted to stay at Bondi Beach. I could not have chosen a better location! The hotel itself sits above a bar so at night it was quite loud but I was so exhausted from traveling and siteseeing that it did not bother me. The room was very simple...nothing fancy by any means but still clean and comfortable. The location was directly across from Bondi Beach and my room had a great view and balcony. The staff was very friendly and helpful and taught me how to utilize the buses and also arranged for my transportation to the airport. If you dont want to spend a fortune and want the best location then this is a great place to stay!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Family Holiday in Bodi”", "Author": "riabr", "ReviewID": "UR123288154", "Content": "Stayed for a week over xmas with my husband and daughter and was amazed by this hotel. It was very reasonably priced, right on the beach clean and comfortable. I was concerned when I booked that the room did not have airconditioning however our room was at the front of the hotel , on the third floor and had its own balcony. This let us keep the doors open and enjoy the cool sea breezes. Air conditioning was not needed. I noticed whenever we went down the street level it was much hotter. The location was awesome - opposite the beach and walking distance to everything needed. A local bus stopped right outside the hotel that took us to all the Sydney sights.The ground floor of this hotel was like any ordinary pub - it had a bistro, beer garden, bottle shop and pokies venue. One street away was the local IGA. The negative to this hotel was that traffic noise from the street did invade our room. Also because our balcony faced the beach sitting outside in the morning attracted sun glare. So my advice would be to request a room at the back of the hotel. If it is summer time make sure it has its own opening to the communal balcony. We did not have one negative experience from any of the staff members. Would recommend this hotel.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gosford, Australia", "Title": "“Better than expected”", "Author": "Laceytreigh", "ReviewID": "UR92945998", "Content": "Booked in here for 1 night on the Halloween weekend. We were going to walk the coastal walk to Bronte while the 'Sculptures By the Sea' exhibition was on. The room offerred during the booking process was at the front of the building with own section of balcony, but we asked for a quiet room at the back and got a deluxe queen which was 2 weeks old. They had turned 3 rooms into 2 with the middle room turned into 2 very nice private bathrooms. The brand new TV didn't work so we got a $20 refund the next morning. We bought a bottle of wine and sat on the communal part of the balcony and watched the passing parade of Halloween costumes, more entertaining than the TV anyway! Options for accommodation right in Bondi are few, so this was a good find. Ask for the deluxe queen at the back of the building and you should sleep well. We'd go back. All in all, better than we expected.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Just about perfect 4 the price”", "Author": "TEDSHAR", "ReviewID": "UR63603615", "Content": "We stayed for 5 days and even though the rooms are little dated it was the surrounding area we came for, not the accomodation. Room was cleaned every day, we had access to a balcony which was great in the mornings to watch sunrises, beer garden downstairs was a bonus (not far to walk home after a few drinks) All the restaurants we went to were great namely Nicks right on the beach and Hurricanes just around the corner bothe had the best steaks we had ever had. The walks were great to Bondi to Bronte is a heavenly one.Of coarse the best thing was the beach and being able to walk to Bondi Junction for great shopping. We are going back to do it all again this October. Only 2 drawbacks really low water pressure in the shower(no good for long hair) and the noisy construction we had to endure from 7 am on the last 2 days of our stay.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "montreal", "Title": "“good place on bondi”", "Author": "eaglenest", "ReviewID": "UR56706949", "Content": "I stayed at hotel bondi for 3 nights in february,i was in a single deluxe room,the room was small,with a fridge,and air con,very basic but correct for the price i've paid. The good part about it is that it's right on the beach an is close to all of what bondi as to offer,the bus stop is just in front of the hotel so it' very easy to cacth one,the gentlement at the reception was very nice and gave me valuable informations with a smile. The room is ok for just one person,not,more,there is just a single bed,i look at the bigger room and they seen pretty nice,especially the studio. Some peoples complaint about the noise at night,i myself wasn't bothered by any bar noise and went to bed by 10:00 pm without any problem. Final conclusion,good place to stay,basic,but affordable,and even if it's a old buildind it was well kept.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "malaysia", "Title": "“comfortable”", "Author": "ivedra", "ReviewID": "UR49540339", "Content": "stayed in hotel bondi from 7th to 8th nov 2009 with my cousins shan, jay, mal and dorie.had a comfortable stay.friendly staff especially mr.venkat.spacious room.facility in room excellent.nearby to beach.wonderful view from balcony.easy to get to hotel from the bus stop as we came by bus here from airport.transport easy, food plenty of choices.nice lobby", "Date": "November 19, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "europe", "Title": "“terribly disappointing”", "Author": "argly", "ReviewID": "UR17426013", "Content": "We've spend a night there, looking for a nice place close to the see but the only thing we've get there was a lot of noise.. the music from the bar 'till 4 Am and the cars and trucks in the street starting at 5 AM.Don't even think about going there if you need holidays..but if you want to drink all night, and being drunk enough it might be a go. service at reception vas poor as well... don't go", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Torrevieja, Spain", "Title": "“great views friendly staff”", "Author": "paulaph", "ReviewID": "UR13348313", "Content": "i stayed at the hotel for 3 weeks on and off in sept , Everything about our stay was fantastic, even bearing in mind we had previously been staying in 5 star hotels, this was a great place, so convenient for everything, beach, bars, shops etc and a great place to end the evening so as not to have too far to stumble to bed.The rooms are adequate and clean and value for money. The staff were extremely helpful at all times. We thought the food was good and not to pricey especially considering you are in the heart of Bondi. Only one slight grouse, kept having trouble with our key card. but thats just me being picky...", "Date": "February 7, 2008"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Meath", "Title": "“Dreadful servie - very average overall for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR5011219", "Content": "I stayed in Hotel Bondi for a total or 2 weeks in January this year with three other friends. Our stay was riddled with inconsistencies and the hotel reception staff,whom were extremely rude and had no idea what they were doing, with the exception of maybe two. Time after time my friends and I were left frustrated and in awe at the incompetencies we witnessed. Something as simple as getting a receipt proved a chore and we were even charged twice on one card, this, as you can imagine, threw the staff into total dissaray. The rooms themselves were very basic for the money paid and air conditioning seemed to be the luck of the draw, some rooms had newer machines that kept the rooms cool whilst others had more dated air conditioners that did little more than push the hot air that already made the rooms so uncomfortable around the room. For a hotel located right on Bondi beach, in the height of the Sydney summer, this was highly unnacceptable. The only pluses with the hotel were the convenient location for meeting friends for a few drinks or getting to the beach, literally across the road. Other than that, it had nothing going for it, the food was over priced and you could get the same dish yards down the street for a few dollars cheaper. If location is your only concern and being able to fall in and out of bed to the bar in a sweaty heap appeals, then this is the place for you. Anything else, avoid at all costs", "Date": "April 26, 2006"}], "HotelInfo": {"Name": "Hotel Bondi", "HotelURL": "/ShowUserReviews-g255060-d298403-Reviews-Hotel_Bondi-Sydney_New_South_Wales.html", "Price": "0", "Address": "<div class=\"amenFloat\">", "HotelID": "298403", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/4b/a8/hotel-bondi-thumbnail.jpg"}}