{"Reviews": [{"Content": "Horrid horrid horrid We stayed here in 2004 when it was a boutique hotel. It was tired but friendly then. Now it has been sold (and is for sale again) and is advertised as good long stay accommodation. I would not recommend staying here. We arrived after a 2 day flight from Canada to a dusty room which had never been cleaned, old used sheets on the bed, old food in the fridge, an uncleaned bathroom - I could go on. I went down to the shared kitchen and it was even worse - food everywhere, unemptied bins, completely frozen up freezer. Horrid, horrid, horrid. It is full of backpackers aged about 18. The place is completely disgusting. If you really don't care and want to be near Surry Hills, then great, but otherwise forget it.", "Date": "Jul 27, 2008", "ReviewID": "UR137325268", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "lparker"}, {"Content": "Park Lodge Hotel - Where's the Park? I would not recommend this hotel at all. I don鈥檛 mind an older establishment, but this place needs not only updating but a thorough cleaning. We had the King Superior Room, which included a private balcony which was an accident waiting to happen, overlooking a 6 lane highway that never stopped (not the sweeping park view as promised). From the moment you entered the hotel, you can smell a strong musty scent throughout the hotel and room. I thought the attendant was kidding when he said they charge $5.00 per movie from their ancient movie collection, but then I got in to the room to find they also charge you for the use of their room safe. In the past I鈥檝e never changed rooms on a business trip or vacation, but I couldn鈥檛 stay there and insisted they look into not charging me the cancellation fee. They charged me a fraction, which was OK with me, I just wanted OUT. We only stayed the night, only because I already paid and to secure another hotel near Hyde Park. The place gave us the creeps. And remember, we had one of their 鈥淪uperior鈥?Rooms.", "Date": "Apr 24, 2007", "ReviewID": "UR965451122", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "Pars97"}, {"Content": "This is not a gay hotel as advertised I booked to stay two nights at this hotel and stayed for about four hours.The place is totally run down. I have to agree with previous comments about it needing a makeover. Would probably be better to demolish the place.The place smells stale, the carpets furnishings and rooms are all totally out of date. Looks like they shopped at a yard sale to furnish the place.They have the nerve to charge for almost everything they offer, internet, breakfast, video rental. The place markets itself as gay owned and run. During the short time I was there I saw at least five straight couples. If you are looking for gay accomodation avoid this place at all costs. If i was gonna stay in a straight hotel I preferred an upmarket chain closer to the city. Finally when I checked out the woman on reception didn't seem that bothered that I had only been there four hours and didn't question why I was leaving. Which makes me think it must be a regular occurence.", "Date": "Jan 13, 2007", "ReviewID": "UR411210603", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "aquarius67"}, {"Content": "Park Lodge Good Hotel, not Great One! My partner and I stayed at the gay owned/operated Park Lodge Hotel for 7 nights in March/April '06. The hotel has a wonderful staff to assist you, is located in a nice residential neighborhood and was a good value for the money. The staff was great, very friendly and helpful. Pros: price, staff, generally comfortable, good heat and a/c, and in close proximity to restaurants, grocery store, laundry, buses. Cons: older hotel with dated furnishings in need of improvement and update/upgrade, cleanliness was avg, musty smell, charges for basic breakfast and internet usage, and about 1 mile to Oxford Street. If you are interested in seeing Sydney, we would recommend a hotel that is closer to both Oxford Street and downtown Sydney, such as the Comfort Inn Cambridge Hotel (adj to Oxford), or any hotel around Hyde Park (equal distance of 4-8 blocks to Oxford and the hub of downtown).", "Date": "Apr 16, 2006", "ReviewID": "UR782643381", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "Blondesteven"}, {"Content": "Really Friendly Probably the friendliest hotel I have stayed at in all my travels. I think the staff really enjoy working there and it shows. Highly recommended.", "Date": "Dec 25, 2004", "ReviewID": "UR739780580", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d298405-r18325348-Park_Lodge_Hotel-Sydney_New_South_Wales.html", "HotelID": "298405", "Price": "$99"}}