{"Reviews": [{"Content": "A regular for us. Amazing value. Our third stay at this hotel and it has never let us down. Great beds, great balconies, great breakfast, great staff, great location, great value etc. Fantastic pool. Amazing value for money.", "Date": "Jan 8, 2009", "ReviewID": "UR294629527", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "SR32"}, {"Content": "Loved the infinity pool at Kuta This was the hotel in which we spent our honeymoon. It's located in the heart of Kuta, Bali - right next to HRH Bali. Our trip there started with a welcome drink - a tropical punch of unknown origin. Rooms are smallish - we did pick the smallest room though. The best part was the infinity pool--- great for lounging away! A short walk in front of the hotel is the beach - good for people watching !", "Date": "Dec 13, 2008", "ReviewID": "UR246179803", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "peyter"}, {"Content": "average I would not stay here again. The rooms were ridiculously small as well as the bathrooms. A very old and small TV. The pool had a nice view however it was way too small for the size of the hotel and number of people. Not enough chairs for everyone to sit around. We stayed here for 2 nights and 1 would have been plenty. The location was really good for Kuta but I wouldn't recommend it.", "Date": "Dec 1, 2008", "ReviewID": "UR621188989", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "VancouverAfricana"}, {"Content": "Well Positioned Hotel with a really cool pool! It was a short 3D2N stay at Mercure Kuta. A first trip to Bali for us. What made us choose the hotel at first was the Ocean View Room. I wouldnt say its the best Ocean View we could get, but for the price we were paying, we reckoned it was reasonable. The view we got was the lateral view of the ocean. I am not sure but the way I see it, Standard Ocean Views rooms do not provide direct frontal views of the ocean.The infinity pool was definitely the highlight of the hotel. One could stay at the pool for hours and be mesmorised by the pool sea and sky in the same picture...Being pregnant, all we could do is to play and hang out at the pool area, which was pretty quiet with 2-3 japanese tourists suntanning by the pool side. Comparing toHard Rock, I am pretty satified with Mercure pool. I would say one would get the best of both worlds in the sense of serenity at the pool as well as the convenience as its well located at the heart of kuta beach.I too tried to ignore the reviews of the green bathtub. Anyway, who needs to soak in the bathtub when you have the nicest pool around :)", "Date": "Nov 30, 2008", "ReviewID": "UR127049021", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "moomooland"}, {"Content": "Loved it!       Bedroom", "Date": "Nov 24, 2008", "ReviewID": "UR330499995", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "rcmichels"}, {"Content": "Not a 4 Star but We Got Hooked Up Mercure is positioned as a 4 star. It is not even close to a 4 star. On a good day, its a 2 star hotel. The facilities are old, tired and just plain down market. Here is the rub...the rooms are TINY. I booked a Deluxe double room. It was literally the smallest hotel room I have ever seen outside of Europe or Japan. The 2 single beds barely fit into it. The room did not look anything like the pictures on the website or Tripadvisor. When I complained, they offered to put me in a larger Deluxe room with a king size bed but I declined since I was travelling with a buddy. Mercure did the right thing and upgraded us to 2 junior suites at a marginally higher nightly rate than what we would have paid for the Deluxe room. So in fariness to Mercure, the facilities are not very nice but the customer service saved the day. Also, they have a nice lap pool that has an unobstructed overlook of the beach. The location in Kuta is also excellent if that is what you are looking for. Said differently, if youre looking for a fairly economic 2 star in Kuta with a great location in the heart of Kuta beach, and dont mind tiny rooms, then Mercure is perfect. But if youre looking for a REAL 4 star, then this is not the hotel for you. Scooter rentals and surf school were also very conveniently located at the hotel.", "Date": "Nov 9, 2008", "ReviewID": "UR217355675", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "NYCGlobal"}, {"Content": "If you can afford to miss the great sunset view by the pool deck, stay elsewhere       Sunset by the pool deck of Mercure", "Date": "Oct 23, 2008", "ReviewID": "UR305394536", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "chie88"}, {"Content": "Great time We were recommended the Mecure by a friend and we were pleased with the choice. We had an ocean view room which was a bit run down and slightly dirty but otherwise great. The pool was the best feature of the hotel. Lying on a lovely deck chair under blossoming frangipani trees looking out over the vanishing pool to Kuta beach was one of the high points of the trip!The room service rates changed mid-way through our stay and were very expensive compared with other places. But there is plenty of places to eat near by.What ever you do DO NOT make an international call from the hotel. You are required to give your credit card number and we were charged $80aud for a 5-10min call home! Other hotels do idd for about $10-20.Over all we were happy with our stay and we would return.", "Date": "Oct 9, 2008", "ReviewID": "UR841950358", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "BrisbaneVincent"}, {"Content": "Off to a bad start! When we arrived at the hotel at 12 o clock we were told that our room was not ready. That was fine as we were aware check in was not until 2pm so we were told to come back at 2pm. When we came back at 2pm they said the room was still not ready. I wanted to confirm that we had an ocean view room as I had paid an extra US$20 to confir\\m an ocean view room having read on this website that the rooms next to the Hard rock could be a bit noisy. I was told that they did not have any ocean view rooms left and that they did not charge any extra for them although i clearly did on the ACCOR website! We were then asked if we would like to see the room we had been alocated insterad that had some ocean views. We went and had a look and it was still awaiting to be cleaned but we were now just getting desperate to get a room so we said it would be okay and to come back again in 40 mins and it would be ready. We came back again at 3pm and they said the room was still not ready! Getting frustrated i vented a bit and we were then tkaen to a different ocean view room which is what we had paid for in the first place!Rooms are okay but nothing flash, not very clean with alot of scum marks in the bath tube. The floors are a terrible green colour and di not look clean enough to walk around on with bare feet after a shower.Rooftop pool is nice with infinity edge looking out over the ocean across the busy street below. Breakfast was okay.Overall this is okay place to stay for a night or 2 but i think there is much nicer places to stay for an extended period of time.I think most of their problems with having the room ready when you arrive is that they have a check out time of 12noon. They slip a reminder of this under your door the night before you are due to check out. I think if people stretch this time alittle and they are at high occupancy there is not way they could clean all the rooms in 2 hours.", "Date": "Aug 12, 2008", "ReviewID": "UR313235198", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "Nick75Perth"}, {"Content": "the alternative you better not take       deluxe room", "Date": "Jun 19, 2008", "ReviewID": "UR910936741", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "28th_illusion"}, {"Content": "Its a BLESSING...       Bird eye view of HRH...", "Date": "Jun 10, 2008", "ReviewID": "UR318411842", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "lean26"}, {"Content": "Better than expected. So basically the Hotel is situated right across from the main strip of Kuta beach, this is one of few Hotels that have this sort of location. At the time I thought this would be a big bonus however, I found Kuta beach to be awful, not cause it was busy (I love Waikiki beach), but because its full of people asking you to buy stuff and its really not a great beach anyway. Seminyak much better. However the view at the pool is spectacular, can't be beat.I saw alot of reviews on here expressing disappointment in the breakfast. Not sure what people are expecting, but basically its got everything you would want and its all good quality. Fruit, breads and sweet breads, cereal, bacon, eggs, omelets, sausages, beans and a wide selection of Asian dishes. I thought it was pretty good. Not the best I've had but you certainly wouldn't complain about it.Rooms are average. Look a little cheap and basic but its modern, clean and functional. I didn't see a problem with air quality in the room and the air conditioner worked well. T.V had 55 channels but was a little outdated. My main problem with the Hotel would be the service. I asked several times for the safe in my room to be fixed. When I left after 15 days it was still not operational. Some of the front desk staff were very unhelpful. I was told there was no internet available in room despite the stand on my desk advertising the fact WIFI is in room. When I finally got someone to acknowledge that WIFI is available in room it cost about 13 dollars Australian a day to use or 8 dollars for an hour. A rip off in my opinion.The pool service was good but sometimes inconsistent. There were times when I couldn't get a beer for half an hour as nobody seemed to be around. Overall its a good hotel but not without its problems. If you want a nice quiet hotel in a good location I would defiantly consider this hotel. Feels very safe and secure but service does lack a bit.", "Date": "May 20, 2008", "ReviewID": "UR694386067", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Mr-Big-Cat"}, {"Content": "The best swimming pool in town! This was my first time in Bali and I booked this hotel through agoda.com; it said that the hotel was on the beach, close to all the action  had very helpful staff; all of the above was true. I was greeted on arrival with a welcome drink and the porter took our bags to the room. The room which was on the ground floor was ample in size with a fair patio area; even though its view was a wall, it could have done with a washing line of some sort just to dry out the towels at the end of the day. The bathroom was really nice with a powerful shower and all the mod-cons.The best bit about this hotel was the swimming pool and the best thing about Bali is the sunset so when you put these two together you really were in paradise - the pool is on the 4th floor of the hotel and is an infinity pool so it looks like its pouring into the sea and goes on forever. When I was there the pool area was always clean, fully staffed and quiet e.g. no pumping music and no screaming children. The food had a lot to be desiered however there are many bars and restaurants just outside the hotel where beer is as cheap as 50p a bottle!I paid 11pounds a night for this hotel, for me it was an absolute bargain and a pleaasure to stay in this hotel.", "Date": "Apr 1, 2008", "ReviewID": "UR764299995", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "paultsams"}, {"Content": "Experience of a LifeTime!       the Lobby", "Date": "Feb 24, 2008", "ReviewID": "UR114811323", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "diy7"}, {"Content": "it was excellent! It was my first trip of the year and was marvellous! I stay in Mercure Kuta for 3N. For those beach lovers, this is the perfect hotel to stay in. The location is definately the best of all; directly in front of the beach! Just gear on ur bikini  trunks  off you go. The hotel decor is also very cosy with majority of wood designs. Staff were all very polite too. Hmm...only one thing that is not so good; the breakfast. Not much to eat. Oh ya, almost forget about the pool. Wow, the pool is on the 4th floor and was facing Kuta beach and you can see the beautiful sea. It is indeed a good place to rest  relax there. I will definately go back to Mercure Kuta on my next trip. Cheers!", "Date": "Jan 19, 2008", "ReviewID": "UR508940262", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mercurekutabali"}, {"Content": "Great room, poor breakfast The room was clean and nice.Very beautiful swimming pool! But...breakfast just average....Not up to a 4 star hotel standard", "Date": "Jan 18, 2008", "ReviewID": "UR675291779", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "Bossing_wijaya"}, {"Content": "Brilliant Pool....       poolside", "Date": "Dec 30, 2007", "ReviewID": "UR891990841", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "rowanne82"}, {"Content": "14 trips to Bali and this was the WORST My husband and I went to Bali for Christmas and New Year (2006/2007) and decided to stay at the Mercure. We had stayed there once before and it was ok and reasonably priced so we decided to stay there again - The BIGGEST mistake ever. It was the worst of my 14 trips to Bali!!!I had e-mailed the resort prior to arrival and asked for a room on the opposite side of the hotel to the Hard Rock Cafe as we found the night club very noisy at night and then from about 5:30am there are loud speaker announcements every 15 mins. They advised me that they would make sure we had a room away from this. When we arrived we were given the exact same room we had last time. I asked to be moved and was told there were no rooms. I asked for the manager and was told there was not one on duty. That night in our room I was unable to sleep due to the Pumping and thumping music coming from the Hard Rock Cafe. At about 2am my husband went down to the front desk and came back 15 mins later with a bell boy to move us. Four hours earlier I was told there were no rooms but as soon as my husband produced his wallet and bribed the desk clerk he found a room.There are only 4 sun lounges in the sun, never anyone around for pool side food and drink and all meals were terrible.We had problem after problem for the 3 1/2 weeks we stayed at the Mercure. Never again.", "Date": "Dec 17, 2007", "ReviewID": "UR642268652", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MrsHand"}, {"Content": "Nice hotel, bad service SERVICE: I stayed 4D3N, booked through the hotel's own website, accorhotels.com. I called the day before arrival to confirm the booking, they said they didn't have it so I should call their Call Center to verify it myself, which I did and everything was fine. Despite this when I tried to check in the next day they still did not have my booking. I still managed to get checked in anyway after some hassle. In my short stay there, I visited the Front Desk 7 times and they still never found my booking. On my 2nd day, I spoke to their Asst Manager Oslan about the problem. He said that he would look into it the next morning because he was already finished his shift for the day--absolutely horrible service. 3-4 of their staff told me that my credit card had already automatically been charged, but their Asst Manager still made me pay by credit card when I checked out. So far have only been charged once for my stay, but their staff should be better trained so they don't give the wrong information.After all that trouble, I still had to ask if they could offer any compensation. They offered a free 15-minute ride to the airport which I had already arranged to begin with. After 45 minutes of discussion with this Asst Manager, his final offer was a discount on only one night of my stay.ROOM  VIEW: Aside from my horrible experience service-wise, the hotel is actually very nice and very new. One of the benefits of losing my booking was that they were full of the room I requested so I got upgraded to a Deluxe Room which had a view of the ocean (not very good though, trees and cables in the way). The room was really nice; small but still functional. No complaints about the air like some other reviewers.AMENITIES: Did not try the restaurants but there is a ton of food within walking distance to the hotel at far cheaper prices. The pool is definitely the absolute highlight of the hotel! So gorgeous.LOCATION  BEACH: Nice location, across the street from the beach, and close to shopping and nightlife. The closeness to the beach is a little overrated, especially because it's the most popular stretch of the beach which means that there are hundreds of peddlers who don't leave you alone so you can't really sit and just enjoy the water. If you want to enjoy a quieter beach, I suggest you stay somewhere like Legian area (which is actually just down the street from the hotel), or for private, gorgeous beaches with no peddlers, the resorts of Nusa Dua (which is about 20 min away from Kuta by car).COMPETITOR HOTELS: The Mercure is nice, however I must say that there are MANY other lesser-known hotels that are just as nice or nicer, in a similar location (maybe 5 minutes away) and cheaper. Check out some other hotels too before deciding to stay here. During non-peak season, you can get a good room at other hotels for under USD 50.", "Date": "Dec 12, 2007", "ReviewID": "UR744892053", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "5", "Location": "4"}, "Author": "glbtrottergal"}, {"Content": "Great priced 3* star hotel in central location.       Shower/Bath", "Date": "Nov 12, 2007", "ReviewID": "UR179767339", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "cabincrew"}, {"Content": "Perfect Place to Chill Lovely thatched roof accommodation with huge king size beds and balcony. The staff are exceptionally polite and they seem proud of their resort, constantly maintaining the tropical grounds.Disappointed with the restaurant so ate out at other places such as the Ming Restaurant and the Hyatt's plethora of eateries - both highly recommended.Beach is average but the pool made up for it - Nothing better than lounging round the pool ordering margaritas and the occasional, and delicious, Cheese Burger.Superb service and a professional massage spa - Try the 75 min full body with your partner - No 'extras' offered here, just divine relaxing massage. Avoid the hags on the beach !Go and explore the island on a scooter for around 拢3.00 a day, but take a good road map or hire a local to take you around.Would definitely go bac", "Date": "Oct 11, 2007", "ReviewID": "UR970890426", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "C&A_London"}, {"Content": "Good Location BUT ...       Mercure Kuta's Swimming Pool", "Date": "Sep 14, 2007", "ReviewID": "UR334106365", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "SnowyLC"}, {"Content": "Excellent location        Seaview room", "Date": "Aug 28, 2007", "ReviewID": "UR372945447", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "live&dive"}, {"Content": "Nice location, affordable but barely adequate rooms We booked three rooms at the Mercure Kuta for the period of 16-19 August (3 nights), which is at very high season due to a national holiday, for just IDR560,000 nett (around USD60) from a local travel agency. The good and the bad: Very cheap rate inclusive of breakfast, but beware, the staff is VERY prompt in clearing the breakfast buffet which is at 10:00 am SHARP - they even start before the hour. The best part about the hotel is the location just across the road from the very busy part of Kuta beach - lots of tourists and you can get a massage right on the beach. It is right next to the Hard Rock Hotel and on the other side is a small Circle K minmart. There is a small stall right in front of the minimart that sells very delicious brownies called fudgy brownie just for IDR4,000 or around US40cents. Finally, the shower is hot with plenty of water pressure, but we couldn't take a bath as the bath tub leaked and would not hold water. The towels look a bit old for my taste. More of the bad: The room is very small, and poorly designed and I banged my head several times on the light fixture near the table. Poor lighting in the room, but who wants to read in the room in Bali. The airconditioning was very cold and we could not turn it down. When we arrived the phone was not working, but even past midnight an engineer came and fixed the phone.Overall, I would stay there just for the location and if you like to sun tan the hotel has a nice edgeless pool overlooking the ocean.", "Date": "Aug 20, 2007", "ReviewID": "UR290210180", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "5", "Rooms": "2", "Location": "4"}, "Author": "SoutheastAsiaSusan"}, {"Content": "Small, smelly dingy rooms       Deluxe Room 2", "Date": "May 25, 2007", "ReviewID": "UR677519087", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "simonl00"}, {"Content": "Great hotel! We stayed at the Mercure Hotel Kuta for 7 nights and it was great! the location is fantastic with easy access to restaurants and shopping while still being quite tranquil. the roof top pool is gorgeous and the staff are extremely friendly.this property is great value for money I really couldnt fault it at all.we will be staying there again for sure!", "Date": "Feb 12, 2007", "ReviewID": "UR183996539", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "girl29"}, {"Content": "Mecure WOW WOW!!! This property was better than expceted, as atravel agent you sell alot of hotels and I would defintely rate this hotel. For one it has great views from the Deluxe rooms on Level 4 where the pool and the Alung Alung Restarunt is. Staff is great always say hello and always ready to help you. I loved the pool views of the ocean and is great for a tan", "Date": "Nov 28, 2006", "ReviewID": "UR130331304", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "HappyAgent"}, {"Content": "You pay for the location       bbq dinner", "Date": "Oct 30, 2006", "ReviewID": "UR915331418", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "akublues"}, {"Content": "Cramped, but centrall located       Sunset dinner at the Mercure Bali", "Date": "Jul 20, 2006", "ReviewID": "UR954296376", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "DNR"}, {"Content": "Simple and relaxing. I like the location. It's very easy to move around and to shop. The hotel room itself is a little small but I think it's ok. The facilities are good. The view from the roof near the pool was nice. The rate is affordable. I had a good stay!", "Date": "Jul 15, 2006", "ReviewID": "UR573910367", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "peseus"}, {"Content": "Reasonably priced hotel in Kuta       View from our room on the 4th floor", "Date": "Jun 6, 2006", "ReviewID": "UR174855462", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "asmSingapore"}, {"Content": "It is what it is: a mercure hotel The Mercure is located centrally in Kuta, near Kuta Square and next to the (more luxurious) Hard Rock Hotel. In the vacinity you will find two McDonalds, a Kentucky Fried Chicken and a Starbucks. The beach is just across the road. The busy nightlife of Kuta is a mere stones throw away.The hotel itself is NOT a resort. It is what it is: a hotel. Nothing fancy and nothing special. It has a rooftop swimming pool, but dont expect too much of it. It is also in need of re-tiling. The loungers are comfortable, but not easy to adjust. It is not a place to spent your entire day.The rooms are good, but not overly luxurious. The airconditioning is a bit noisy and just about sufficient. They have cable TV with a lot of international programs and movies. They have internet, but thats just via a stone age 28K8 telephone ISP. You still pay for the telephone costs (300 Rp = $ 0.02 a minute).The food is ok. The restaurant is nice, but the food at the poolbar is actually better.In short: dont go here if you just want to relax. In fact, don't go to Kuta if you want to relax. If you want to combine the best of both worlds, try staying in Legian. (Legian Beach is a perfect hotel! Don't confuse it with the far more expensive The Legian.) Or even better: Seminyak (hotels there are expensive, best choice is the Oberoi).In Kuta I would recommend the Hard Rock for the die hard party animal that also wants luxury. The Kuta Paradiso seems nice as well.Summary: the Mercure is a good deal for the price, but it's nothing special. For about $ 45 a night (package price) it's medium end price range. I would spent the extra $ 20/30 for the Hard Rock next time.", "Date": "May 15, 2005", "ReviewID": "UR279037687", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "Henkybaby"}, {"Content": "Would stay again and again I absolutely loved the Mercure Kuta.The location is fantastic and the standard of accommodation is second to none.I cannot see how you could class it 2 star rating.I have seen many hotels in bali and have falling in love with this one.If you want great value for money, great location, friendly staff and lovely accommodation than this is for you.", "Date": "Apr 1, 2005", "ReviewID": "UR942965310", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "銉愩儶鏈€楂橈紒   showReview(21745438, 'full');", "Date": "Oct 28, 2008", "ReviewID": "UR856622934", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鏈€楂樸伄绔嬪湴銇с仚銆?#x201d;   showReview(20687348, 'full');", "Date": "Oct 7, 2008", "ReviewID": "UR423966818", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "銇俱倱銇凤紮"}, {"Content": "Tres bon hotel   showReview(19696686, 'full');", "Date": "Sep 3, 2008", "ReviewID": "UR126955962", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "5"}, "Author": "petitdragonbleu"}, {"Content": "Mercure Kuta wird immer schlechter   showReview(16906912, 'full');", "Date": "Jun 13, 2008", "ReviewID": "UR359842476", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Flinxx"}, {"Content": "銉°儷銈儱銉笺儷銆€銈偪   showReview(19913842, 'full');", "Date": "Mar 29, 2008", "ReviewID": "UR349997515", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇亷銈勩亱   showReview(19913113, 'full');", "Date": "Oct 25, 2007", "ReviewID": "UR842769217", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉勩偆銉?#x201d;   showReview(19911333, 'full');", "Date": "Jun 15, 2007", "ReviewID": "UR282646942", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銇婂緱銇儧銉嗐儷   showReview(19911270, 'full');", "Date": "Jun 4, 2007", "ReviewID": "UR592313777", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鏍煎畨銉偩銉笺儓   showReview(19910984, 'full');", "Date": "Jan 24, 2007", "ReviewID": "UR697861390", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈偗銉嗐偅銉栨淳鍚戙亶銇с仚   showReview(19910959, 'full');", "Date": "Jan 20, 2007", "ReviewID": "UR572198128", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "瑕瓙鏃呰   showReview(19910947, 'full');", "Date": "Jan 15, 2007", "ReviewID": "UR807004749", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銉撱儍銈般偊銈с兗銉栵紒   showReview(19910919, 'full');", "Date": "Jan 7, 2007", "ReviewID": "UR525199724", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉°儷銈儱銉笺儷銈偪   showReview(19910709, 'full');", "Date": "Aug 18, 2006", "ReviewID": "UR461992654", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "绌烘腐銇嬨倝杌娿仹20鍒嗗挤...   showReview(19925941, 'full');", "Date": "Mar 17, 2004", "ReviewID": "UR721047531", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銇撱伄銉涖儐銉伅鐩伄鍓嶃伀...   showReview(19917665, 'full');", "Date": "Mar 13, 2003", "ReviewID": "UR547259376", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297697-d299592-r23385758-Mercure_Kuta_Bali-Kuta_Bali.html", "HotelID": "299592", "Price": "$122"}}