{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Perfectly situated, nice rooms, friendly service”", "Author": "DrRigga", "ReviewID": "UR126424821", "Content": "This hotel is connected with City Center Mall. The rooms are large, clean, and nicely decorated. The hotel has a nice bar and a great breakfast buffet. A great place to stay.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "karachi", "Title": "“city centre hotel managed by pullman”", "Author": "saadgarib", "ReviewID": "UR126171489", "Content": "very nice hotel. connected to the city centre mall which has nearly all the brands and carrefour as well. its also got a cineplex and is also connected to the dubai metro which you can take to the other malls like kempinsky ski mall and dubai mall(half hour via metro). must include breakfast in the package as you get to enjoy a very grand meal. the mall is one of the less expensive ones in dubai and has a good food court as well. location of the hotel is also very good 10 min from the airport and festival city which has an IKEA. would definately stay again.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Loved it, so convenient.”", "Author": "Megsie123", "ReviewID": "UR126160950", "Content": "My husband and I stayed here because I saw on the map it was convenient to the shopping centre. We enjoyed it here. The room was great, and had everything we could need. It was clean and comfortable and reasonably priced. It was so convenient as it was joined to the shopping centre so we didn't have to go out in the heat just to get a meal, and the large shopping centre had everything. The breakfast was very nice too. A buffet of everything. They had a room with computers for free internet access. Would definitely stay here again next time.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Hotel for the Money”", "Author": "Ingermany", "ReviewID": "UR125488438", "Content": "Yes, there is renovation going on in this hotel, but they do tell you this in the website. I will say, even with the noise, it was worth it. The new rooms that they are renovating are very nice and the best way to describe them would be to say that they are fully 21st Century rooms. That said, the internet is the best if have ever had at a hotel and this was most likely thought out in the renovation. I was getting speeds up to 10mps which is lighting compared to most hotels. The room service was OK, but the best thing is that the hotel is connected to the City Centre Mall, so your food options are wonderful. Good location, great internet, modern rooms and mall access makes this my new hotel while in Dubai.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“February TRIP”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR125217542", "Content": "Nice Hotel. Excellent location. There is extensive renovation going on which I suppose will further improve facilities. Cant say anything bad about the hotel. We had a small issue while checking in, Mr. Amjad of the hotel staff was extremely understanding and solved our issue immediately.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Damascus, Syria", "Title": "“Pleasant stay”", "Author": "Adonia2010", "ReviewID": "UR124054433", "Content": "My wife, daughter and I spent three days in this hotel. The location is superb and it's just 5 minutes drive from the dubai airport. Works on renewing the hotel are loud, but they start after 9am. This was not a bad surprise, because on the web page of the hotel it was mentioned. If you are planing to make a reservation in this hotel, try to have a room with city view not only for the beautiful view, but also because on the other side (view over the City Center Mall) it's loud day and night. Extremely useful is the direct access to the City Center Mall directly from the Hotel. Shopping and buisness can be well organized. Managment and staff were really freindly and helpfull. The king size bed in the new refurbished room was wide and comfortable enough for us three (our daughter is 6). All in all it was really a pleasant and relaxing stay.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Refurbished rooms make a difference”", "Author": "Moneyfools", "ReviewID": "UR123536448", "Content": "Stayed here previously in a pre-refurbished room which was mouldy and did not provide a good experience. This time stayed in a refurbished room and what a difference (see photos). However, room is dark and working at the desk could do with more lighting. Free internet available either hard wired or wi-fi in room. Clean bathroom but looked like it was designed by B&Q or Home Depot and done cheaply. Breakfast service poor with staff preferring to talk amongst themselves rather than serve. I noted all guests had to call a waiter for simple things like coffee. Better but with room for improvement for a great experience.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berlin", "Title": "“Nice stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122412240", "Content": "The Hotel was really nice. The breakfast was very good, unfortunately the choices for dinner were in comparison really poor. Only 4 fixed main dishes were available, all european style. In the morning was a compleate difference - regional food was available with different choices. That is what I expect during a stay in an non-western region.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt", "Title": "“Location perfect, nice rooms”", "Author": "hoodyni", "ReviewID": "UR122398970", "Content": "The location is perfect. Close to the airport and the old dubai. Metro station can be reached while walking to the deira city centre mall (which is attached to the entrance of the lobby) within 5 minutes. I recommend the newly renovated rooms which reflex the Pullman standards. Pool is not that so nice. We stayed just once for five days and experienced few problems with the hotel. Water was not running through the sink. We complained but nobody came to fix it. We called again and then in the evening it was fixed. On the second last day we came back in the evening and our room was not made. I talked to the manager and he gave us some \"goodies\" for compensation. I will defenetly go back again, as Im sure the problems occur just because of the renovation works and everyone deserves a second chance. Staff was very friendly , professional and pollite.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“brilliant service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122137184", "Content": "The service was brilliant, rooms were clean and food was superb. the location is really nice close to all the aminities. the only problem was that there were children (other lodgers) running on the corridor as late as 1-2 am. I would recommend the hotel to friends definately,", "Date": "December 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“The hotel is. Construction site”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122059957", "Content": "The hotel is going through an extensive renovation. it is basically a construction site between 10 am and 8.00 pm! I had not been warned of his until I was given my key to my room! How they not inform at the time of the booking that the premises is nothing but a construction site with an unacceptable level of noise throughout the day. I am in Dubai for two weeks on business but checked out of the hotel father 4 days of stay as the level of the notice was beyond tolerance. Nersi Salehi. A very unhappy client", "Date": "December 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tehran, Iran", "Title": "“good”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121969571", "Content": "- Overall it is a good hotel I am using mostly for its location! - Hotel was under renewation hence may be little undity and noisy - It is not nice to call for tooth brash, paste, combs etc... - sometimes to have a late check out for 1600 hrs may be considerate and gives your guest a kind of wanted; and not just for money!?? Otheewise, all OK and Thank you!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Alexandria, Egypt", "Title": "“nice place”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121956113", "Content": "too much noise because of renwing no one told us about that before I make the booking stuff are very helpfull no complain from the room or the facilities thanksssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss", "Date": "December 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“bad experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121951828", "Content": "Very bad experience , staff is slow, no one was there for valet parking when we arrived , i had requested room with a view and got worst room with roof view, website said that there is night club but does not exist. towels were worn out, mixers in bathroom were shivering, elevator was horrible, room was old , tel was dirty . Not worth staying at all Keep away", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Thanks”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121631733", "Content": "I thank Mr. Basem Hamdy Night Manager Which facilitated the stay at the hotel As for the rooms were at the top of hygiene The entrances to the hotel was easy Being in the middle of the market in the heart of Dubai", "Date": "December 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Doha", "Title": "“Very Bad”", "Author": "Yasser A", "ReviewID": "UR121184074", "Content": "Dear All, This apartment there is alot of cockroach & bad smell and old rooms & the mixers and pipes of the bath rooms is leakage. The reservation time and the communications with thier dealers very poor because of this I've stay in hall one & half hour with my family. thy are not helpful.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Tehran, Iran", "Title": "“What should I say”", "Author": "Yas007", "ReviewID": "UR120944207", "Content": "The hotel is next to Deira mall also near to metro station and has very comfortable beds, I think these are only positive points of this hotel .The hotel is under renovation so you will have some noise from 9-10 AM till the evening also everything looks old , toilet area, furniture, carpet,....The breakfast will not satisfied you cause you don't have many options. I have been in this hotel previously 3-4 times so I feel sad for it and I wish it could be fine again", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chandigarh, India", "Title": "“Good hotel”", "Author": "SANJEEVOHRI", "ReviewID": "UR119869075", "Content": "this hotel is a part if Deira mall and it is highly recommended to stay here.the team will never let u down", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“A hotel of good location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118784893", "Content": "Location is good. It is located right next to the Deira City Centre. The shops therein offer goods of good value for money. The \"Day to Day shop\" located located just opposite to the Deira City Centre is really a good place for buying souvenirs (at just 1 to 3 US dollars per piece only). The metro station is located right at the other end of the Deira City Centre. It will take about 7 minutes to walk there. Attitude of staff at lobby and restaurant is very good. When you look around, they will promptly walk to you and ask what help is required. The hotel is currently under renovation. Though the hotel says that the renovation work starts at 10 am, some noise is heard at 8:30 am. It did not affect me as I had already got off bed. I stayed at a room inside which renovation work had already been carried out. I think the doors and carpets had been replaced. The LCD TV set provided is \"Samsung\". But some stations could not be tuned in.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "beirut", "Title": "“worst hotel ever”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118719307", "Content": "this is the worst hotel i have ever stayed in . bad service and old dirty breakfast , bad receptionists. i have been deceived to book there cause i haven't been told there would be a renovation and also the manager sent me a letter of apology without addressing me as sir or mr and i replied him or her but no action from him or her .. worst hotel and shame on pullman to not be honest with costumers", "Date": "September 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“worst stay ever”", "Author": "MustaphaEido Posted by an Accorhotels.com traveler", "ReviewID": "UR118554751", "Content": "BEWARE OF THIS HOTEL Being an a silver a-club member I didn't have a special treat ....I stayed for two days , the receptionist were mean (her name was jane ) I asked for a nice room she gave me a room with a view of the roof of place full of air-conditins' ducts and lot of blockages ..and the room was old with no internet connection as they mentioned at the time of booking thru the a-club website .. the hotel was under renovation and the noise started from 7 am till maybe 10 pm , the lifts sometimes did not work or kept going from G floor to the Last floor without stoping on the 5th floor where I was staying . For using the wifi connection I had only to take my laptop to the lobby on the second floor where always noisy and couldn't work or concentrate .. now the breakfast is not at all acceptable for a hotel name like pullman hotel . Old food and the funny thing I showed the the waiter that the mushroom pie was from last day and I showed him that I marked it but he kept saying not it was not even that I proved him that the pie looked very dry in a part because it was old . anyway the area for the breakfast was closed and very ugly cause it was in a convention room . Most of the plates had black marks and scratches .there were no food variety and the frying egg station was very annoying for the smell cause there were no ventilation at all . by the way there also were about only 9 to 10 TV channels and the other were empty . When I asked for a late check out the receptionist (her name was dimi or midi or dim I really don't remember) she said the hotel were very booked and can't gave me ( I didn't care but I didn't like her way in answering me as if I was begging ) she was as if she owned the hotel and I was an employee at her hotel . this is was my bad experience at this bad hotel and otherwise was ok ...LOL", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“trip to dubai”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118094429", "Content": "location of the said hotel is very good , i like this hotel as this was not my first visit to this hotel, one should try this hotel at least once. this hotel is next to famous shopping center ''çity center'' . food court is very good with varity of stalls'", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "TUNIS", "Title": "“EXCELLENT”", "Author": "missangelina", "ReviewID": "UR115857697", "Content": "I spent five nights in this hotel with my family, everything was nice! The rooms were really big and renovated, the buffet breakfast was excellent it is located inside deira city centre which is perfect for shoppers!! Besides, the price is good value. I will certainly book there for my next trip to dubai.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Blackpool", "Title": "“Will be back”", "Author": "cindersBlackpool", "ReviewID": "UR115435234", "Content": "We love City Center hotel All the staff are so attentive Pool is super Beds comfy Rooms clean F&B suburb Location the best Love it Carol Frend", "Date": "July 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Dubai - June”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114965558", "Content": "The hotel is undergoing a major refurbishment. There was no evidence of the work - no noise, smells, etc. Staff kept guests aware of any changes. Can't wait until the executive floors back in operation.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location - refurbishment underway”", "Author": "Moneyfools", "ReviewID": "UR109595342", "Content": "Good points - hotel is well placed for airport. Business centre had about 5 PCs with free internet access and use of printers. Good breakfast. Linked to shopping mall. Churchills pub has good sports coverage. Very comfortable bed. Bad points - the ongoing refurbishment is badly needed. My room had mould in the bathroom, the a/c was freezing and couldn't be adjusted and the sliding window wouldn't shut properly and keep out the road noise. 'Free' internet in room didn't work.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuwait", "Title": "“Trip with my Son”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR105774484", "Content": "Hi The location is super, with everything under one roof !!! The rooms are comfortable but very noisy (never take the room nera the elevator). I would stay there again a but would ensure that my room is not near the elevator !!! anothe issue was that the AC cotrol was not working !!!!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Good location & staff but Ibis Hotel is better value and more modern”", "Author": "Ithinkthis", "ReviewID": "UR103952596", "Content": "Good location, near the airport and Deira City centre. Rooms are getting tied now. They are overdue for an update. Rooms are spacious and have a decent sized in-room safe. Limited channels available on the TV network but they do cater for five major languages. Can be tough to get a taxi from the front door at certain times of day. Breakfast buffet very good value, excellent range, top quality. Has a good quality gym; well equipped. Upstairs outdoor swimming pool is medium sized but often way to warm in the summer months. Staff are always very friendly and helpful. Business centre is small but functions well. Internet was appalling when I last stayed here. Wi-Fi free to use in the lobby area when it worked. Has an on-site bar, fashioned after an English pub which has stacks of TV screens, is visited by expats and locals alike and always seems to have prostitutes hanging out looking for their next trick. Worth staying in the hotel if your company is paying but I'll be staying at the Ibis next time which is half the price, more modern and just down the road.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Al Ain", "Title": "“Great Location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR102918976", "Content": "Quietly detached but directly adjoining the expansive City Centre shopping mall in Dubai, the City Centre Hotel Residence is perfect for the combination of relaxed indulgence and serious shopping. With no transport needed other than your own sweet feet, it is but a short indoor stroll from the lobby to the top brand names of the world. Expect friendly and efficient service, quality products and a very reasonable price.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great long weekend break!!”", "Author": "Jdale62", "ReviewID": "UR102895215", "Content": "I recently visited City Centre Hotel for a relaxing long weekend by myself. I have to say the check in was a breeze. I arrived at the hotel around 9.30am and waited for about an hour while they got a room ready for me. I didn't mind as check in was 3.00pm. The staff were very helpful and could not do enough for you especially concierge. One of the best thing about the hotel is the location, only 10/15 mins away from the airport. The hotel is attached to a large modern shopping mall which was fantastic. I had most of my meals there and there is a wide choice to choose from. There is a humungus supermarket where you can get everything! I did feel I got ripped off by the taxi from the airport to the hotel, 37 dhms as opposed to 16 dhms on my return! One tip on using taxis, I found it much cheaper getting a taxi outside the shopping mall than from directly outside the hotel. The gym was fantasic and one of the largest fitness centres I have seen. There is an executive suite where you can check your emails, (well delete all the junk mail) instead of dealing with that when you return home! I will most definetly stay at City Centre hotel again and hope to return very soon! Loved it!!", "Date": "April 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tehran", "Title": "“it was very good as before”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR101613226", "Content": "we reached to the hotel noon time and and our check in was very fast. hotel was very good as before. connection to city center was too easy and the location of the hotel is excellent. in one word, it was very good as before. I recommend the hotel to every body.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "greenville,sc", "Title": "“Excellent Hotel Experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR101489231", "Content": "The City Centre Hotel is conveniently located a short taxi ride from the airport or can be reached via subway. There is an inside connection into a very nice mall for shopping, entertainment, and dinning. The on-site restaurant had a good variety of selection and really great service. All of the staff were very friendly and helpful. Highly recommend this hotel.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colombo, Sri Lanka", "Title": "“Brilliant Location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR101325731", "Content": "An good property with a brilliant location. Shopping Mall and acitivities for children next door, literally in the same premises. The Metro station is just outside the Mall. Great place to stay with young children.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Aden", "Title": "“Service declined”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR100516604", "Content": "I stayed at this hotel several times since many years back. I noticed quality of service declined. Frankly speaking, I now book at this hotel for one reason only; LOCATION. I have nothing more to say.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kuwait", "Title": "“Nice stay (on budget)”", "Author": "TwiggyQ8", "ReviewID": "UR99808967", "Content": "Nice hotel called Deira city center hotel, that's the one connected to Deira city center mall, i hink it's a 4 star hotel, standard \"everything\" , you can tell it is aging a bit , about 10 to 15 yrs old probably. It is only 8 minutes from the airport, easy access to mall ( haz carrefour, zara, tommy hilfiger, la coste, burburry, ninewest, electronics, cinemas...) Has a metro station at the entrance of the mall", "Date": "March 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scheessel", "Title": "“Visit”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR96584161", "Content": "For myself i find the location very good, close to the Airport, shopping mall etc. I have been staying there for a number of years.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mauritius", "Title": "“Great Location”", "Author": "Bluesilverstar Posted by an Accorhotels.com traveler", "ReviewID": "UR94948198", "Content": "I stay at the City Centre Hotel twice a year. The quality has certainly been going down since I discovered it about six years ago but I always go back because it's location in the Deira City Centre Mall (and consequently in the middle of Dubai) is exceptional. Everything is just a short ride away and it's always so easy to get hold of a taxi outside the hotel. The room is good. Certainly nothing spectacular although the price should really give you something to shout about. Unless the mall is closed, do not order room service. The quality of the food is really poor. Go on the net and order from a take away instead. Internet (wired no wifi) is free but so slow. The liberal attitude of the hotel hasalso faded. Before, you could bring anyone to your room anytime, but now your guest needs to show original ID. Breakfast is boring run-of-the-mill stuff but you do have choice. I'd never slate this hotel because despite the defects, I still like it. Why? Location, location, location.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“City Centre Hotel Residence”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR92114837", "Content": "Good location. City Centre Mall and Carrefore Superstore are very handy and within a few steps. Residence flats are clean, spaceous and comfortable. I thought it is slightly overpriced. Breakfast was not a pleasant experience especially if you turn up late. Not enough seating and takes a long time to replace food in the buffet when required. Breakfast certainly not good value for money. Staff are pleasant but more staffing needed for the breakfast time.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“Extremely poor hotel”", "Author": "Nikhilt", "ReviewID": "UR90592294", "Content": "Apart from the location the property has nothing to offer. Its a No hotel, for everything there is a no. The room service and cleaning is one of the worst. You have to call atleast twice to housekeeping, front desk and than maybe if you are lucky you will get someone coming to your room. If you go be careful with the curtains you might cut your fingers. When we checkedin we got a room which was dirty. The carpets were stained yellow and brown in places. I came to know this is one of the oldest star rated hotel in dubai. Will have to say it shows. one good thing is taxi was available and the hotel staff helped. They were good with luggage handling.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Not as I expected.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90276487", "Content": "The hotel was OK - just OK. Not up to the standard of Accor Group I am used to. The service in the Restaurant was poor. I could not obtgain a newspaper for me in my room without asking! Service in the Business Lounge was also poor as was the decor and the seating (it was all 'grubby'). The best thing about the hotel was the promity to the airport. I shall try again on my next visit to see whether it has improved or not.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Mixed: Enjoy the good; try to ignore the bad.”", "Author": "Grundoon", "ReviewID": "UR89879665", "Content": "Good: Service. The staff remember you after the first day. The breakfast service was especially good. The laundry promised to have our shirts returned by 6pm of the second day; they had them finished by 6pm of the first day, for no extra charge. Bad: As noted by an earlier traveler, the shower's water pressure is weak and the temperature is variable. I tried Churchill's Pub more than once. The first time it was loud due to a live band, smoky, hot, and I was accosted by prostitutes. The second time it was loud but only because of recorded music, smoky, hot; but at least the prostitutes left me alone. I couldn't find a \"Welcome-to-Our-Hotel\" directory in the room; it was three days before I noticed there was a pool. Fortunately in this case, the good outweighed the bad.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Kuwait", "Title": "“Not recommended”", "Author": "Meshal", "ReviewID": "UR88059279", "Content": "Nice hotel, great location in Dubai center with direct connection to shopping mall. The room was spacious and newly furnished. The disadvantage is that you cannot control the room temp. and it is impossible to take a decent shower because water pressure was low and temperature was fluactioning between very hot and freezing cold.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saudi araiba Jubail", "Title": "“improvment”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR86263994", "Content": "hotel was not that bad BUT was not the best , service was Ok, check out was hard to stay more than 2:00PM?", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Macau", "Title": "“my trip to Dubai”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR85564942", "Content": "good hotel and very good location next the one of the biggest mall in Dubai. Easy accessibility to subway and outlets", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“In desperate need of a refurbishment”", "Author": "NJA1974", "ReviewID": "UR82600074", "Content": "This hotel feels like it is a few years past its prime. Don't be fooled by the Sofitel brand. It is tatty and need a freshen up. Pool on the roof is nice.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "west lancs", "Title": "“EXCELLENT LOCATION”", "Author": "walkerswestlancs", "ReviewID": "UR73992522", "Content": "Just spent 5 nights at this hotel. The staff and services was excellent. I wouldn't class it as 5 star. The bedroom was in need of an update but it was clean and had all the extras required. The breakfast was superb but make sure that you are in before 09.30hrs as it becomes very busy and you will have to wait for a table. The pool area is ok. The shopping centre attached to the hotel is very good and inside this is also a supermarket to stock up on snacks/drinks. Drinks in the hotel are very expensive. I would suggest that you take a taxi from the front of the shopping centre. If you get one from the front of the hotel they are twice the price as they are private taxis. We did the dubai bus tour which was a great way of seeing the rest of dubai. The wafi mall and festival city shopping were close by and worth a visit. Didn't rate the mall of the emirates. If you want beach holiday then the city centre hotel is some distance from the beach. If you want great shopping and a central hotel then i would recommend this hotel. It is also a very short taxi ride to/from the airport.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Very good hotel for first time traveller to Dubai”", "Author": "arisha-hamzah", "ReviewID": "UR71746549", "Content": "Elegent look and nice decor at the enterence. More than required service people all around. Room given to us was also clean and in good shape. Breakfast that was included in our room charges was excellent. You can't complain, no metter what kind of b/fast you like. Very close to airport and very good location to go around the city. Enterence to a very good mall direct from 2nd floor of the hotel. On each corner one of the hotel staff greats you to give you a good feel of improtance. Now some suggestion to the hotel management: Room cooling was some time at the night time found not so cool for the people like us coming from very cold areas of the world, so please take note of such travelers to adjust their need. To use my laptop i had an ethernet connection on the working desk in my room, however my lap top charger needed to be connected through an adaptor that did not fit the socket available close to the desk. It was availabe somewhere else in the room, i.e. i had to take my lap top somewhere else to charge and then return to desk. Wirelss was not available. Toilet flush needed few attempt prior it works. With so many extra service people and so much investement, i believe a fine tuning/training can take this hotel to the next level of Quality service. Overall, we had good time at this hotel and recommend it to all kind of travellers. It's good valued hotel.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Excellent hotel with attached mall as bonus”", "Author": "KeithB77", "ReviewID": "UR61003512", "Content": "I have stayed at this hotel about a 20 times on business over the past 3 years. It has never let me down in any way. Even during Ramadan they find ways to accommodate their Western guests discretely. Clean rooms and a friendly staff. Some tips: internet is free on the 9th floor and higher floors (not sure why). The attached mall has some coffee shops with free internet (Gloria Jeans) if you are stuck lower. The Carre Four grocery store (it's like a Super Wal Mart) that's in the mall has a great prepared food section. All hotel rooms have a refrigerator so you can buy perishables and store them during your stay. The Health Club inside the hotel is really nice. A lot of machines and it's very clean. An added bonus is there are two squash courts. If you've never tried squash, it's very much like racquetball... give it a go! Hotel guests can rent racquets and balls for $5. The court time is free! Bring your own eye protection! The new metro train stops alongside the mall that is attached to the hotel. The ride to the airport is about 12-15 minutes. Thumbs up on the Sofitel City Centre!", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riyadh", "Title": "“Great location as it is linked to Deira City Centre Mall and ideal to stay with children.”", "Author": "PashaFamilyVacations", "ReviewID": "UR60504192", "Content": "This is the old Sofitel hotel. We had stayed here twice in 2007 and we came back here again in 2010. In 2007, we had stayed in the hotel rooms but now we stayed in 2 bedroom apartment. Location was great. Hotel is part of Deira City Centre Mall which has Cinemas, Supermarket , Food court and most well known shops like Debenhams. We stayed in the 2 bedroom apartment which is in City Centre Residence. Hotel is located close to the Food Court side of the Mall. This is another advantage as our 15 year old son could walk to the food court safely. Mulitple Cinemas in the Mall was also advantage as we could go for late night shows and return back to bed within minutes without having to worry about transport. Another great advantage is the closeness to airport. We arrived late night and airport shuttle was there to pick us up. We were guided by friendly airport staff to the shuttle and were in bed in our room within few minutes. Hotel is just 5 to 10 minutes drive from the airport. Breakfast in City Centre Hotel was great with enough varieties and my children always enjoy the 5 star style buffet breakfast with variety of food. Deira City Centre Mall has Metro Station and so it was easier to just board the Metro and go to other Malls like Mall of Emirates. You can also go to Dubai Mall by Metro but we did not try it. We took the Metro to Mall of Emirates and this is the best thing to do. We also took the Big Bus for Cit y Tour. Big Bus also starts from Deira City Centre Mall. Thus the hotel has many advantages being part of the Deira City Centre Mall. The bed and pillow are very comfortable and cosy and it is best thing we can have after a tired day. Only negative that I can think of is that the bath rooms. The flush worked but it was always after couple of attempts. Carpets and Curtains also looked not very clean. It was all bit old and it will be good if hotel management can refurbish the bath rooms, carpets and curtains. There was a washing machine in the apartment which was good but there was no dryer. It will be nice if the hotel management provided driers so that we do not have to hang our clothes in the balcony to dry. Hotel staff were very kind from the start till the end. Special mention should go to Mr.Saji in the reception who was always very kind and had big smile for all guests. Just like we were picked up promptly in the airport, we were also dropped in the airport in a private car promptly and without any discomfort. I would recommend the hotel for any families travelling with children. It was a plesant experience staying here in this hotel and it made our holiday a memorable one.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Decent value for money”", "Author": "CanadavidTraveller", "ReviewID": "UR58053716", "Content": "I stayed at the City Centre hotel for 6 nights and had a reasonably good experience. From a location standpoint, it was great. Having access to City Centre mall till late at night and being close to the airport was nice. Breakfast was good and had lots of selection....not so much for lunch/dinner. The two bars/lounges did not serve much food, specially vegetarian. Service was an issue. Both the reservation staff and concierge were not very helpful. Check in/out took forever and the staff was not very friendly. I'd pick this place again only for the mall convenience and location. If on holiday, i'd definitely look for other options.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ORLANDO", "Title": "“Like walking into a Palace! Grand lobby entrance!”", "Author": "BASEBALLNUTS", "ReviewID": "UR54831705", "Content": "Having never stayed in the United Arab Emerit prior to this trip, I really did not know what to expect. I was nothing less than awe-struck when I walked through the doors of this world class hotel. The lobby is gorgeous, jaw-droppingly so! Just the entrance alone is palatial with ultra fine marble, bronze, large sitting areas, and such. The hotel staff are very friendly and especially helpful with helping visitors understand the local culture. My visit was during the first day of the Holy season of Ramadan, and it was very helpful for me to understand the \"do's and don'ts\" so as to not offend locals. The things we take for granted and do daily would be an insult to Muslims during Ramadan, so I appreciated the information, such as not to look anyone of the opposite sex in the eye, eat, smoke, chew gum, drink, etc, during the daylight hours; after dusk, you can resume eating, gum chewing, etc. The rooms are lovely, large and very comfortable. There bathrooms are large and feature a bi day next to the toilet. The rooms have great views of the city and the wifi was free! Overall, I found this hotel to be wonderful, and I wish my stay could have been longer!", "Date": "January 31, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Three Day Stay”", "Author": "EvDagobert", "ReviewID": "UR52515422", "Content": "Awesome hotel, very professional and the food was a delight. Connects directly to the mall solast minute shopping is a breeze. Would like to go again.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Australia", "Title": "“Convenient and that's about it”", "Author": "DameDuFerAustralie", "ReviewID": "UR38864761", "Content": "As I was landing early in the morning from Sydney in transit for 36hrs, I had booked two nights directly with the hotel - numerous emails to/from confirming everything was OK, and yes they understood I was landing around 5am and would require my room (night 1) immediately. Upon arrival at the hotel around 5am, I was told sorry there are no rooms available adn you'll have to wait in the lobby for 3-5hrs before room becomes available. I had a hissy fit, after 14hr flight!! and insisted on speaking to the hotel manager. I explained I had expressly booked and was happy to pay for two nights to avoid this very issue and where was my room?? He eventually \"found\" me a room about 45 mins later, after saying I could wait in the cafe, but hey, it's closed as it's too early and you can't even get a cold drink!. After about an hour in the room I realised the aircon wasn't working. Time to call an engineer in.......yawn. After all this stuffing about, about the most positive thing I can say about this hotel is it is conveniently located close to the airport and has direct access into the shopping mall if you need to while away a few hours in aircon. But that's about it. I won't be going back for seconds.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Business/Shopping hotel - no luxury”", "Author": "CorruptedSanity", "ReviewID": "UR34885617", "Content": "My wife and I spent 5 nights here early July 2009. I had a conference in the same hotel and decided to stay at the hotel as opposed to somewhere more fancier but would require me to drive in the morning traffic. The hotel is definitely 5 stars but the bare minimum. The hotel is old and it shows. The furniture and amenities are really basic. It would be perfect for someone wishing to spend a lot of time in the City Center Mall as there is direct access from the hotel. This hotel is not representative of the standard of hotels in Dubai now. There is broadband internet in the room via LAN (cable) and wireless is available in the lobby.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“A good hotel and great staff...!”", "Author": "Scottie_in_Saudi", "ReviewID": "UR34456965", "Content": "Like many frequent travelers around the world, I always check the reviews on this website to ascertain whether I’d be risking my health by staying there…! At first I was worried as a couple of previous reviews weren’t great and there were no photo’s of the place either…? Though I shouldn’t have worried, I was picked up from Dubai International via a free hotel limo and delivered to the hotel door. The hotel itself is welcoming and efficient, with check-in over in minutes, unlike some places I have visited. The rooms available were wide ranging for both non-smokers and smokers, though smoking outside of your room in the hotel wasn’t tolerated unless in the Churchill’s Bar. I had to settle for a smokers-twin instead of the king-size, but I couldn’t grumble as they were large comfortable beds anyway. In the room you have everything from comfortable bed, large LCD TV, mini-bar (chargeable of course), full internet services, free safe, basically everything you would really need. Also a nice touch I thought was the laminated TV listing to tell you the channels available and in what language. Breakfast was your standard business hotel affair of a buffet layout, I was disappointed with this though, as the sausages were beef and the bacon was veal. Having come from Saudi Arabia I was really looking forward to gorging on a plate of pork…! The hotel bar ‘Churchill’s Bar’ is going to be your main port of call and it’s a welcoming place with good staff, at this point I’d like to thank those staff – the beautiful Jessica & Maricel, Patrick, Menon, Dominic and the manager Othman, all were quick with smiles, laughter and the next round…! Thank you for making my stay so enjoyable. Also I’d to thank Martin the bar’s resident vocalist/singer and his friend Sean for a great night in Dubai and also the many Emirati patrons who frequent the place, who provided many memories I’ll never forget…! Further to the excellent staff was good food, though the menu is limited, it really is, I was recommended to try the ‘Bangers & Mash’ (which is not on the menu), and was treated to a fabulous pork delight, which I had many times. I’d like to also mention Mr. Bernard who was always courteous and asking if everything was OK. Other things to mention are ‘Churchill’s Bar’ has happy hour from 5-7pm, the hotel is connected to the City Centre shopping plaza, the place is huge on three levels you have every brand or name you would want, and was a real pleasure to tour. So would I recommend this hotel to others, Yes, very much so.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Nice hotel”", "Author": "monkey600", "ReviewID": "UR30280808", "Content": "Nice hotel - great spot to shop, great hotel with excellent entertainment - especially the English pub!!! Have to go back!", "Date": "May 19, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, UK", "Title": "“Fair enough for what it is”", "Author": "getdown", "ReviewID": "UR18931084", "Content": "Why do we come to Dubai? For me, it's business rather than pleasure and that's why I was booked into this Sofitel property. It's getting old, the rooms are unappealing and it will never be more than a business hotel, but the friendly staff and convenient location makes up for this somewhat. I arrived from an overnight flight and was keen to shower before going into meetings. The front desk kindly gave me access to the health club where I managed a dip in the pool as well as a shower. The pool itself, whilst not large, is well maintained and provides welcome respite from the heat. The health club was quite well appointed too, and the staff very friendly. The room was so bland that I can't think of anything to say about it, save to say that it was clean and the bed worked, i.e. I slept. The Churchill Pub downstairs offers the remarkable experience of Emiratis drinking pints and playing darts in their dish dash. The hote's attached to the City Centre mall if you wish to do some shopping or get reasonable chain restaurant food. In fact, with my offices in the same building I never left it's air-conditioned shell from arriving one morning to returning to the airport the next. You won't be upset staying in this hotel, I've been in plenty worse, but there are much better places to stay in Dubai if you have the money and are less concerned about convenience for the airport.", "Date": "August 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Italy", "Title": "“You get what you pay for.”", "Author": "Chrella", "ReviewID": "UR13650644", "Content": "We had an early morning flight so booked this hotel for our last night in Dubai as it's very near the airport. The reviews are very mixed here so didn't know what to expect but all in all we were quite happy with the Sofitel, it can't be compared to the beach hotels it's a business hotel in the centre of town. We paid 159Euros per room which isn't expensive by Dubai standards that's why I gave it an above average rating. We had dinner in their steak restaurant where the chef comes to the table & cuts the size of steak that you want he then asks you how much you think it weighs, if you guess within 10gr you don't pay for it, we managed to guess the weight of one to the chefs surprise so we got it free. I would definitely stay here again if I had an early morning flight.", "Date": "February 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Sofitel City Centre Hotel - great location!”", "Author": "Zezz", "ReviewID": "UR11277172", "Content": "We stayed at the Sofitel City Centre Hotel for 4 nights. After much consideration and choice of so many deluxe hotels, we choose this one due to the fact that it was close to the airport and also was attached to a shopping centre for convenience. This forum had some fairly poor report about this hotel so, I didn't have my hopes too high. I am happy to say that I was so glad with my choice. It was infact 5 minutes away from the airport which is great for early flights out. Also the best part was that being attached directly to the Deira City Centre Shopping Centre, after a long day sightseeing, we didn't have to catch another taxi out for dinner or for shopping. The shopping centre has a huge range of shops, restaurants, cafes, fast food outlets, a jewellery court, supermarket, cinemas, a play area called Magic planet for children. etc etc.... endless. The Hotel lobby was very classy, the buffet breakfast was great. The clientelle were business people and tourists. Flight crews etc. The rooms were spacious and to correct a previous post - they did have coffee and tea making facilities. They also supplied a bottle of water daily for teeth brushing. The room service was good and efficient. The rooms were fine , 4+ star. You are not paying for a resort on the beach , so don't expect it. The receptionists were very helpful and courteous and they had a money exchange desk that was comparable to the exchange on the ground floor of the shopping centre. Taxis from the Hotel to the Burj Al Arab were $ 22 Aus. Taxi from the Gold Souq was about $ 11 Aus. We did the Arabian Adventures City of Merchants tour and their Sundowner Dune Safari which were both great. Also Afternoon Tea at the Bur Al Arab was an experience....we had no time for the beach! We enjoyed our stay here immesnsely and would definitely stay here again on a short stopover. If you are staying longer and the beach is your scene, book a resort type Hotel.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Not a true Sofitel but still comfortable”", "Author": "shopsuey", "ReviewID": "UR10009244", "Content": "We travelled to Dubai for the first time in October 2006 and booked into the Sofitel. Being a Sofitel hotel we expected something quite 'flashy' unfortunately we were let down. The rooms, although comfortable and clean, were not of the standard we expected and were definately not what we expected after looking at the photos on the hotel's website. We suspect that the room photos shown must be the Executive Level suites. The rooms were large with plenty of space for the huge bed, eating area and desk. The bathroom was a good size with great water pressure and loads of hot water - something I am obsessed about when travelling. Our Emirates flight from Australia arrived very early in the morning and I would suggest if arriving this early (6.30 am) that you pay for the extra night so that you have a room to go to when you arrive. We didn't, so spent many hours sitting in the hotel foyer waiting for a room to become available. However we were supplied with complimentary drinks and were able to have breakfast even though we would be charged. It worked out well as we had breakfast included in the cost of the room and as we had an early departure to Paris we were unable to have breakfast on the day we left so in the end it cost us nothing. Also the hotel provides complimentary transfers from the airport which we weren't aware of when we arrived so we would suggest notifying them prior to arrival so that they are waiting, however taxis in Dubai are not expensive. Overall the service, particularly in the resturant, was excellent and the staff were very friendly. We had a few issues with the check-in staff but we feel they were the exception to the rule. We would recommend the hotel to others but if staying in the standard room we would suggest lowering your expectations for the usual Sofitel standard. We are booked in to the hotel in the next month for our second stay, mainly because we couldn't get our chosen accommodation elsewhere however we have booked an executive level suite, fingers crossed it will live up to expectations!", "Date": "September 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“Never book a triple at this hotel!”", "Author": "Tracy-Seattle", "ReviewID": "UR8136447", "Content": "Arrived at 1:00 am. Gave the front desk credit card information for incidentals as room was already paid for through travel agent. Was told that the electricity was not working and therefore they could not issue keys. Was asked to wait in the lobby. An hour later was told electricity was back on, but found that staff had not assigned a room to us. Took another 1/2 hour to get keys. When arrived at the room, no third bed was set-up! What had they been doing for an hour and 1/2? Once additional lumpy rollaway was added to room there was little room to move. Asked front desk to be moved to larger room in morning, was told that all rooms were the same sized. Advised them that they should not sell triples and was told, \"The travel agents know the room size.\" Found that this hotel and the staff had little customer service skills and less ability to anticipate the needs and expectations of guest. I've been told there are 30,000 hotel rooms in Dubai - pick another hotel for your stay.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Best shopping location”", "Author": "THOMOPOL", "ReviewID": "UR7769806", "Content": "I stayed with my wife third time visiting Dubai, while on our honeymoon. Even as classified as 5 star hotel is nothing special. Would do for a 4-star. We had our honeymoon at the desert, see my review for Al-Maha Desert Resort, and then we came back to Dubai for a few days shopping. Sofitel is Ideal for Shopping. Is in attached to the City Center Shopping Mall and you can shop until you drop. The hotel has a small swimming pool with no much of a pool bar, no fitness facilities, breakfast is average, rooms are okay, but because of the location we are thinking of revisiting. If you are not going to Dubai especially for shopping and you need business facilities and other luxuries this hotel is not for you. With less money you can stay in much, much better!", "Date": "June 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“Comfortable stay & good service”", "Author": "drmaniac", "ReviewID": "UR7757729", "Content": "I stayed there 3 days, executive floor (11) excellent service, good room service. Location, next to a huge mall, very practical when you need to shop. If you need to rent a car, go downstairs and negociate at least 30% from the book price. I have no regrets about my stay there, eventhough I left this hotel to stay for the last 4 days of my stay in so called 5 star hotel: One & Only Royal Mirage, horrible service and poor management. Room / price is very good at Sofitel !!!! Go there, you will enjoy :-)", "Date": "June 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Connecticut", "Title": "“Perfect hotel for transit”", "Author": "ConnecticutTravelfan", "ReviewID": "UR7280211", "Content": "The Sofitel Dubai City Center is the perfect hotel for short stays in Dubai. Only 10min from airport, has shuttle bus. The rooms are very quite but standard and all is in working order. Inexpensive Internet service for laptop avlbl. Nice roof top pool with snack bar. Excellent restaurants at reasonable prices which serve alkohol. Very well trained international staff that is friendly and efficient. Great hotel for business and transit passenger at a good rate.", "Date": "April 4, 2007"}], "HotelInfo": {"Name": "City Centre Hotel Residence", "HotelURL": "/ShowUserReviews-g295424-d299708-Reviews-City_Centre_Hotel_Residence-Dubai.html", "Price": "$142 - $257*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">PO Box 61871</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">61871</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "299708", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/37/33/3733dd4e8ce114f758a68a96f5347bad6large.jpg"}}