{"Reviews": [{"Content": "Quirky, budget place Had a great two night stay here. Rooms are unexpectedly well-appointed and sizable for the price (though prices are much higher if a trade fair is in town). Interesting look inside and out. Interesting location too, in Sachsenhausen, just South of the Main. Less touristy, with good restaurants and bars. The core of Frankfurt is pretty small, so if the weather is nice, it's a nice walk over the Main to the rest of town. And if it isn't, plenty of transit options nearby.Room was clean and the shared shower was too. Many rooms have their own showers, so chances are you won't be sharing it with that many people.Didn't try breakfast as it wasn't included and there were lots of great places nearby. If you are pregnant, disabled, or just lazy, this is not for you as there is no elevator.", "Date": "Mar 3, 2008", "ReviewID": "UR123399300", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "xeno111"}, {"Content": "Overall Good hotel The hotel was a great location. Beautiful bed  breakfast like place with artsy decor. I stayed in a class B room which was pretty nice; however, one incident sort of spoiled it all. One of the cleaners came in abruptly without knocking. Her demeanor was sort of off-putting. Overall, most of the people were friendly.", "Date": "Apr 24, 2006", "ReviewID": "UR908841537", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wonderfully eccentric hotel We thoroughly enjoyed our two nights at the Hotel Am Berg. It is located in an quiet, leafy street with easy access to transport. If one had a crazy, wealthy old granny, I imagine this is what her place would look like - an aging mansion with creative, old fashioned decor and a rambling garden full of flowers.The pricing structure is a bit complex as it depends on which wing you stay in and if you want your own or shared facilities. However it is good value for Frankfurt which can be very expensive due to the many conferences held there.The continental breakfast was excellent - huge and varied. The proprietors were friendly and helpful.", "Date": "Feb 12, 2006", "ReviewID": "UR395197849", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "enjoyed staying there Lovely hotel in a quiet residential neighborhood close to the subway and train stations. The room I got was on the top floor. It was large, had a high ceiling and was creatively decorated. The breakfast was too expensive, but tasted great.", "Date": "Sep 26, 2005", "ReviewID": "UR757956771", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "eugene_o"}, {"Content": "an oasis Great hotel in a old, beautiful mansion. Interesting interiors, garden. Car park. Quiet neighborhood, friendly staff. With or without breakfest, with your own or shared bathroom and toilet. Close to South Central Station and to a supermarket. Good value, good location.", "Date": "Aug 8, 2004", "ReviewID": "UR134045116", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel hogare帽o en un chalet/mansi贸n regentado por una familia   showReview(12299872, 'full');", "Date": "Jan 3, 2008", "ReviewID": "UR939874194", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Shaolin333"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d299998-r14020388-Hotel_Am_Berg-Frankfurt_Hesse.html", "HotelID": "299998", "Price": "$145"}}