{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great Option!”", "Author": "Nancy Q", "ReviewID": "UR125029862", "Content": "It was a very nice stay. It is very close to the Midway Airport and they even pick you up at your arrival. They have everything you need, plus the breakfast is included. The staff was very friendly, they even helped us to print our boarding pass at the end of our stay. Very recommended!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "australia", "Title": "“Very comfortable stay”", "Author": "brizzeyAustralia", "ReviewID": "UR124781966", "Content": "I stayed for one night before a very early flight out of Chicago. The staff were all very very friendly and efficient. There were cookies on the desk in the afternoon i noticed and the business centre was great. The room was very quiet and comfortable and also very very clean Nice bathroom I think they could do with some new pillows but it was still a very nice and comfortable stay There is a 24 hour free shuttle to/from the airport. Would definately stay again if flying out of midway. I didnt eat breakfast as I had a very early dept but the hotel is in a Hotel complex and there is a TGI Friday there where I had lunch/dinner All very very convenient and there are a number of restauran6ts that will deliver , menus are in the rooms.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Polite staff, Hotel quiet and clean.”", "Author": "Ohioillinois", "ReviewID": "UR123870192", "Content": "I think the best thing about this hotel is that I made the reservations through a third party and upon check in, weeks after the reservation, the charges were put through for the room. The staff said that they will accept cancelations! Also we parked a car there during a later stay, in January, when we flew out of Midway and had no problems with our car. The shuttle drivers were polite and helped us with our luggage.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“3 stars is being charitable”", "Author": "Papadoc1000", "ReviewID": "UR123852447", "Content": "The hotel and rooms are fine. Breakfast is adequate. The pool was greenish. Internet connection was lousy and we were near the lobby, so I can't imagine what it would be on the end. The rooms are quiet and spacious and the heat is easy to control. What was lacking was how customers are treated, and no matter how nice the hotel, being rude and the \"oops we forgot to tell you about the other charges\" way of doing business breaks the deal. First, they just kinda forget to tell you that their formerly free parking lot is now considered a revenue source. It is now $13/night to park your car. In my opinion, this amounts to false advertising and gouging. You aren't paying for valet service here, so why the charge? The lot is there anyway, it hasn't been charged for in the past, and this is one step short of charging your for your showers. Second, the staff is rude. When I asked why I wasn't told about the parking fees when I made the reservations, she said it wasn't her problem. If it wouldn't have just been shooting myself in the foot (they wouldn't have cared) and traveling with an 80+ yr old man, I would have gone elsewhere just on principle.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ATLANTA", "Title": "“AWESOME!!!!!”", "Author": "HASAN33", "ReviewID": "UR121505766", "Content": "I stayed here for one night on a last second business trip. The staff was great. The room was a nice size and clean. Great location. I will stay here anytime I'm in town.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Arlington, Texas", "Title": "“Holiday Inn Express, Chicago Midway”", "Author": "timinator2000", "ReviewID": "UR121228056", "Content": "Very clean hotel. Bed was excellent. Hotel staff was friendly but don't always take their advice on how to take \"The L\" rapid transit. Advice was confusing and inaccurate.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia Beach, Virginia", "Title": "“Nice hotel”", "Author": "Karo13", "ReviewID": "UR121174974", "Content": "Like this hotel, they have airport shuttle which means you can still explore downtown by taking the \"L\" into the city.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rothschild Wisconsin", "Title": "“NICE AND QUIET!”", "Author": "kitchenladymc", "ReviewID": "UR121071423", "Content": "We stayed at the Holiday Inn Express durint the Thanksgiving Holiday Weekend. We found it very comfortable and nice. The staff was extremely friendly and helpful. The breakfast each morning was terrific. We will be back during our next trip to the Chicago area!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Texas City, Texas", "Title": "“Bad memory”", "Author": "TheWiZEGUY", "ReviewID": "UR120440741", "Content": "The only thing i can remember from this hotel, was that a lady from the staff just shouted, hey you're drinking all the coffee, and serving all the food\"\"\". I was shocked to hear this and very disappointing since my family had barely started serving. Guests should be treated better!!.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dearborn, Michigan", "Title": "“Friendly staff”", "Author": "birdbear828", "ReviewID": "UR119398180", "Content": "Evalyn at the front desk was extremely welcoming when we checked in. After we checked out I noticed they still had a hold on my card even though I paid cash for the room. I called and spoke with Evalyn she was more than happy to help out, and never once was rude about it. I will go out of my way to stay in the 'burbs' again just because of her awesome customer service!", "Date": "October 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Hotel close to the airport”", "Author": "Karen J", "ReviewID": "UR118004623", "Content": "This hotel is located minutes from the midway airport. It is staffed by very friendly and helpful people. It was so nice to be able to start the day well rested and full. The beds were comfortable and the rooms were quiet. The breakfast was very tasty and had many choices.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“360 security cameras but otire are tire was stolen right there!”", "Author": "ClevAP", "ReviewID": "UR116391853", "Content": "We checked in and 10 minutes later front desk started calling. Credit card was maxed out and they called 18 times in 40 minutes!!! No matter I kept telling them I will be over with another card once I dry up, they kept calling. In the morning we notice the spare was stolen from under the car right in the front of hotel. Needless to say there are at least 10 hotels in this park, surveillence cameras and own security. Our complain was meet with lack of interest and not even an effort to check the tapes was made. As long as we were there the staff avoided us as the plage and the phone did not ring once to show some ridiculous concern. To this day we did not get any sort of news from the hotel or police. I'll never stay there again.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bedford Park, Illinois", "Title": "“Enjoyed our stay and will book here again when we return to Chicago.”", "Author": "AntiochTNVisitor", "ReviewID": "UR116089513", "Content": "July 28, 2011, The shuttle service was Excellent and provided good information regarding shuttle services and CTA public transportation. Firstly, I would like to compliment the front desk clerk Ms. Evelyn Martin on her friendly smile and customer service skills when we arrive. Our flight was early and she was able to accommendate our early arrival to the hotel. Secondly, the complimentry breakfast was good and the servers were friendly in addition to asking if we needed anything else. Made us feel like they were waiting on us although it was self serve. The staff was friendly and the General Manager greeted us each time we came in the hotel day or night. I was Very surprised by this, but I understand he takes pride in his responsibility to the company. The rooms were clean, smell fresh and very comfortable. TGI Fridays, Burger King, McDonalds etc, is in walking distance of the hotel. I recommend this location!!", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Outstanding Service”", "Author": "travelfamily34116", "ReviewID": "UR115894996", "Content": "My husband and I planned a very short stay in Chicago this summer. We booked this Holiday Inn location because according to their website they were close to both the airport and public transit. We found everything to be as claimed. The shuttle from the airport was great and when our flight got in earlier than expected we were very surprised to be able to check into our room - very early! The front desk staff both days of our stay were extremely helpful and courteous. We had never been to Chicago and their assistance in utilizing the shuttle and public transit was very helpful. Our room was very clean and provided everything that we needed for our short stay. The complimentary breakfast was great and the food service staff member was really nice and helpful as well. We have always found the Holiday Inn Express hotels to be a good value for our money and this location was no exception. We really cannot say enough about how helpful and courteous the staff was. We would certainly stay here again.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Pleasantly surprised”", "Author": "mille125", "ReviewID": "UR109385820", "Content": "I was pleasantly surprised. My wife and I are rather picky travellers and stay at higher end properties. We needed something close to Midway airport for an early flight. We werent expecting much but this hotel really surprised us. Stay in an executive room on the first floor. Staff at check in and check out were very pleasant. Room was clean including the bathroom. It did not have the usual amenities that we are used to but we didnt expect it. Breakfast was surprisingly good. This was a good stay and I would stay here again.", "Date": "May 22, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rochelle, Illinois", "Title": "“Internet Deal Looks good BUT the cheaper rate online does not include car parking that was EXTRA”", "Author": "Zhefamily4", "ReviewID": "UR109298329", "Content": "If you have an early flight out of Midway Airport. Stay at the motel but move your car to the Park and Ride it is secure. There are signs that state that the motels parking is at your risk. It would have been cheaper to do the one night stay and park and ride. Then to do the Holiday Inn deal, which we found out that my deal from the internet did not include parking and I had to pay more. Also there is more shuttles for Park and Ride than the Motels we had to wait 15 minutes for the shuttle to arrive and it was standing room only.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Bragg, California", "Title": "“Ok”", "Author": "mine2sir", "ReviewID": "UR99537427", "Content": "The staff was wonderful, but the room had a strange chemical smell to it, almost like it used to be a smoking room but they were trying to cover it up. Other then that it is not all that bad.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Smelly Carpet”", "Author": "benfen6293", "ReviewID": "UR79708059", "Content": "Upon checking in i was surprised to find my room uncleaned once I opened the door. I reported back to the desk and this was immediately addressed by the desk clerk. I was moved to another room on the second floor. The carpet thoughout the hotel had a smell of deferred maintenance and would not be first choice of hotels in future stays.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ORANGE COUNTY", "Title": "“Convenient Stay...”", "Author": "DD31", "ReviewID": "UR79087420", "Content": "Our stay was good. The room could have used better cleaning. The walls are thin so you can hear your neighbors (water flushing and so on). Room service was great but the food was not the best, gelato was yummy though. WiFi on floor 19th was not connecting so we had to go to the lobby in order to get connectivity. Pool area was nice and fun for the kids. Location is great if you don't mind doing some walking.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "mississippi", "Title": "“Over priced, loud ac”", "Author": "engineer64", "ReviewID": "UR68865611", "Content": "The hotel is within a cluster of hotels and all share the same shuttle service. The free shuttle was convenient and ran every 20 minutes. The HI Express was over-priced for what you get. I would suggest looking into the other hotels in the same group. The room was just OK and the ac was too loud to leave running at night. It was one of the old floor style units. The included breakfast was good. This place is OK, but, is priced $50 too much. There were a couple of restaurants in the group of hotels - but, I ate at the Hilton garden inn close by. If I return, I would look there for a room - it was newer and seemed a little better.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Madison, WI", "Title": "“Convenient to Midway Airport”", "Author": "Foodie20N3", "ReviewID": "UR52509568", "Content": "We are frequent fliers at Midway airport, but had never stayed at any of the nearby hotels. For our most recent trip it worked out that the \"Park and Fly\" deal at this hotel would be cheaper than parking alone at Midway. (14 days free parking at the hotel were included with a single night's stay.) We were glad we made this choice. As other reviews have mentioned, airport noise was not a problem. The room was clean, and the free breakfast was nice to have before our morning flight. The shuttle to and from the airport was also very convenient. The drivers were friendly, and we didn't have to wait long in the cold!", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kingston, Tennessee", "Title": "“5 blocks from MDW, walking faster than driving on Cicero”", "Author": "CaptainCoffey", "ReviewID": "UR47450013", "Content": "Stayed here Oct 20-22th 2009, with business about 1.5 miles away. Travel time was approximately 45 minutes on either Cicero or Pulaski in rush hour, so plan accordingly. Hotel is clean, in a complex of 5 or 6 other major chains. Basically all business travellers here, saw no families. no pool. Price runs about 50% over most HIE's I have stayed at, I would guess just for location alone. Some rooms have microwaves and ridges, mine did not. Parking is not free. You hear the low rumble of aircraft all the time, but the fan is loud enough that it covers them well. Room 105 stays nice and dark at night.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Fox River Valley, Wisconsin", "Title": "“Nice room, friendly staff”", "Author": "KokoMontoya", "ReviewID": "UR35781358", "Content": "King room was very neat, clean and inviting. There was good lighting, and the bathroom was roomy and convenient. A/C was on the loud side, and in my NE facing room could hear aircraft landing from time to time (though not much at night). Breakfast room was set up very well, and well-stocked with a variety of foods by a very friendly person. Conference Room was nicely appointed and staff who served us were great, as were the treats served. No staff person ever failed to greet me.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "USA", "Title": "“Haven't stopped itching either, disgusted!!!!”", "Author": "todah", "ReviewID": "UR30344810", "Content": "We stayed at this hotel last night and a few minutes after I got in the bed I started to feel itchy. Now that it's after dark I feel itchy and keep scratching an i have raised bumps all over I took a shower but will need to take another one I feel so nasty!!!!!!!!!!!!!!! We were too tired to tell the staff that night so we just all tried to cram onto the hide-a-bed couch without pillows & blankets because we didn't want them but left the sheets on. Told them this morning and they said they'd look into it. The staff/maintenance guys were changing out air conditioners in units and getting mad at each other I felt like I was in the way when I walked out of the room. I didn't see any bugs but I am still itching and I wasn't until I went to this hotel last night!! It's also kind of noisy/on a busy street.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Washington", "Title": "“Very pleasing accommodation at a good price”", "Author": "saratogaWashington", "ReviewID": "UR25763576", "Content": "Everything here was new-looking and fresh. The room was a standard twin, was spotless, nicely appointed and had a small desk. The buffet breakfast had a nice variety including an egg dish--but no make-it-yourself waffles. The staff was friendly and helpful, particularly the breakfast hostess Liz. Although very close to the airport, there was no aircraft noise. The hotel is in a campus, with a few restaurants and a Starbucks within a short walking distance. The price was reasonable, within Government per-diem.", "Date": "March 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winston Salem, NC", "Title": "“Excellent Airport Hotel”", "Author": "DeaconTraveler", "ReviewID": "UR23477623", "Content": "For being less than a mile from the airport I was very pleased with this hotel. Suite was huge and very comfy. Breakfast was like a buffet from a more upscale hotel. Free shuttle to and from the airport. The \"campus\" it is on is also very convenient for travelers with restaurants, Starbucks, etc.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Nice place”", "Author": "Mugsydogg", "ReviewID": "UR16549382", "Content": "I stay here for work, once a week. For an airport hotel, its actually pretty nice. The hotel/rooms/grounds are extremely clean and the staff friendly. I also like the new rooms and furnishings. Being close to the airport, you actually don't hear much noise. I would definatly stay here and recommend it to anyone needing an overnight accomodation near Midway.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfectly Decent”", "Author": "Beetlegorf", "ReviewID": "UR13077748", "Content": "Hotel was perfectly decent. Even at -20C the rooms were comfortable.", "Date": "January 28, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Benton Harbor, MI", "Title": "“Great staff, great stay!”", "Author": "gloriawo", "ReviewID": "UR7395657", "Content": "We had to find a hotel quickly for a sick adult relative departing from Midway. It was a flu bug but she couldn't fly out as planned that day. We drove around and got her a room at the Holiday Inn Express and proceeded to change her flight to the next day. The staff at the desk was quick, efficient and very accomodating. I have never had more professional, cooperative service at a hotel. The rooms were clean, quiet and allowed her to get much needed rest so she could recover. The staff graciously held her calls and ensured she would have privacy and peace for her respite. Kudos to the folks at this hotel for their fabulous service and fantastic attitudes!!", "Date": "April 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Daly City, California", "Title": "“Clean hotel”", "Author": "Rich16", "ReviewID": "UR5950806", "Content": "Nice and clean hotel, about an hour ride to and from downtown Chicago, taking the orange line... paid an average of $128 cause of the jacuzzi, really not bad at all...", "Date": "October 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Value": "5"}, "AuthorLocation": "California", "Title": "“Very Nice Surprise”", "Author": "bootsmuffin", "ReviewID": "UR5553341", "Content": "I was pleasantly surprised at how nice this hotel is. The lobby is warm and inviting and the rooms are very clean. The bathroom was large with a very nice tub. The included breakfast was excellent with wonderful cinnamon rolls. This is really a good value for a nice property.", "Date": "August 3, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Decent Stay but for God's sake speed up the internet in the rooms”", "Author": "hatlad", "ReviewID": "UR5431222", "Content": "Convenient, clean and quiet. Free breakfast is ok too with cereals, fruits, bagels and toastable items and hardboiled eggs. Not the hautiest of cuisine but good and fast enough and the price is right. Nearby Midway Airport has a terminal for CTA elevated trains or buses and is only a short walk away of a few blocks. A great way to get exercise on nice days. The Midway hotels complex also has a free shuttle 24/7 if you don't want to walk it or the weather's bad. Front desk staff was most helpful at check-in even securing our room much earlier than posted check-in time or they also offered the night before to secure our luggage until our room would be ready. As I said, we didn't have to wait as soon as we came over from the other hotel (had to switch for availability of rooms) and they had us a room right away. My only complaint about this hotel is the in-room internet service is sssllllloooowwwww!!! The wireless internet signal strength was always \"low\" and the ethernet cable thru the wall outlet was nothing better. Unfortunately, the front desk staff was clueless how to help this. I know it wasn't my laptop as I'd been using it at the hotel next door (wireless) just the previous 3 days before here and it worked fine. Works fine everywhere else I've taken it.", "Date": "July 6, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Nashville, TN", "Title": "“Decent stay”", "Author": "Kitikata", "ReviewID": "UR4738092", "Content": "For business travel near Midway, the Holiday Inn Express at the Midway Airport Hotel Complex was great! I noticed my room was clean, a roomy and clean bathroom, decent breakfast with cereal, yogurt, breads, milk and juice, well maintained business center with computer, gym with free weights and 3 exercise equipment, slightly loud HVAC but worked well, 24 hour coffee and tea self-service, and a 24 hr shuttle bus back and forth to Midway airport. My room was on the 1st floor, and I did not hear any airplanes taking off or landing. It was fairly quiet as hotels go. If you are worried about Midway noise, it seems quiet enough. For convenience, there are to restaurants in the Midway Hotel Complex, Dempsey's and TGIFridays. TGIF has free delivery to the hotels. There are a couple regional and delicious restaurants near this hotel. There is Tony's Italian Beef on 70th and Pulaski for lunch, and Mabenka's for home-made Polish on 79th and Cicero for dinner. If you want Chicago style deep dish pizza there is Giordano's a few blocks north on Cicero. To use the shuttle bus back and forth to Midway, you must have the front desk call it for you, and on the Midway side, use the courtesy phone in the baggage area. CTA, the Chicago subway, is right in the terminal of Midway, so if you want to go downtown from Midway, it is very easy. I did it multiple times, I had the front desk call for the shuttle, and the shuttle drive dropped us off at the CTA entrance. It beats sitting in Rt55 traffic! One way to the Loop is about 1 hr door to door.", "Date": "March 27, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Spring Lake, Michigan", "Title": "“nice place”", "Author": "traveler1974", "ReviewID": "UR4733116", "Content": "We stayed here for the park and fly package. The staff was very nice and helpful when we arrived, check in was a breeze. The room was clean, the only thing wrong was that the beds were rock hard, but other wise fine. We were only there for the night so didn't really care. The free breakfast was good and not very crowded.", "Date": "March 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Macomb, Illinois", "Title": "“Excellent Stay”", "Author": "hubner84", "ReviewID": "UR4603047", "Content": "Excellent customer service at front desk. Free shuttle to Midway. Rooms very clean and updated. They have free wireless internet and very nice shower heads. I would recommend staying here especially if your flying out of Midway.", "Date": "March 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Grand Rapids, MI", "Title": "“Security? You decide.”", "Author": "Let's_go_see_it!", "ReviewID": "UR3676228", "Content": "We left our vehicle for a week with their \"Park and Fly\" option, only to find our spare tire mount on my SUV cranked down and my tire gone. We were parked right beneath a light pole with a security camera attached to it. Security told us the lot is not patrolled between the hours of 3 AM and 7 AM. We will never stay here again.", "Date": "July 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Middleton, Wisconsin", "Title": "“Good value, clean, good service”", "Author": "TacoMel", "ReviewID": "UR2966239", "Content": "We used the park, sleep, and fly special at the Holiday Inn Express, since we had a flight out of Midway at 6:00 AM the next day. We were efficiently checked in and found the room to be clean and of sufficient size for a comfortable one-night stay. The wireless internet didn't work right but a call to the technical support got it working in about 15 minutes, but it was pretty slow. We took the shuttle to the orange line 'L' stop to eat downtown and were told by the driver just to call on the courtesy phone when we got back and they'd pick us up. We got back and looked all over for the courtesy phone. The CTA cop said that we were like the 4th people to ask for the courtesy phone and he had no idea what we were talking about. So we walked over to the airport terminal and found our way to the baggage claim area. We looked outside and saw a shuttle, flagged it down, and got a ride back. I still don't know where that courtesy phone is. The front desk and driver were also friendly at 3:45 AM when we left for the airport. Fresh-baked chocolate chip cookies were also placed on the front desk, and I assumed they were for the guests, and if indeed they were, then this was a nice touch. I understand that this hotel is the second cheapest in the complex, so if you're going to be flying out of Midway and you're looking for a comfortable night sleep before your flight, this is a good choice.", "Date": "December 30, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Southern California", "Title": "“Good Value and Service”", "Author": "Watergate", "ReviewID": "UR2608504", "Content": "We stayed here the night before our flight out of Midway airport. The front desk service was very efficient and professional. The hotel allowed an early check-in and offered a free crib for the baby. We had a clean modern room and expected amenities. We took advantage of the free shuttle to both the El and the airport, as well as the included continental breakfast. The shuttle is shared with the Holiday Inn Select and the Hamptons Inn, which are all next door to each other. I had considered the Holiday Inn Select but am glad to have chosen this less expensive hotel.", "Date": "September 29, 2004"}], "HotelInfo": {"Name": "Holiday Inn Express Chicago-Midway Airport", "HotelURL": "/ShowUserReviews-g35805-d299922-Reviews-Holiday_Inn_Express_Chicago_Midway_Airport-Chicago_Illinois.html", "Price": "$139 - $193*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6500 South Cicero Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60638</span></span> </span> </span> </address>", "HotelID": "299922", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b3/cc/b3cc9fc3e36d01792b44d5847cdf88d47large.jpg"}}