{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Horror Stay”", "Author": "margarets508", "ReviewID": "UR125534137", "Content": "We only had to spend one night - thank goodness - on our way to Bangkok. We were taken from Dubai airport to a seedy rear hotel entrance - we were tired after flying all night and knew we would have to wait until noon before getting our room.. OK we were allowed to leave our luggage and go for a walk to the beach - which was most uninteresting an then had to kill time. We were shown to the first room - which smelled strongly of heavy tobacco - we had to refuse as we had requested non-smoking. We then had to wait for another room which was not much better. It was freezing cod - like walking into a Cold store and had to open the windows to let warm air in. This is unthinkable in Dubai. We tried the lights and there was no masterswitch near the door. We then discovered it was at the side of the bed. Also there were wires taped up on the other side and we were horrified to think of the safety issues. We asked for the air Con. to be fixed and nobody knew how to fix it - so we switched the whole thing off. To have breakfast we requested for 4.30am and this was duelly delivered and was the best part of the experience. We then went on our way travelling. The pictures shown on the portfolio do not seem quite the same as they promise - and this hotel is very shabby.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good”", "Author": "bagin1981", "ReviewID": "UR123824228", "Content": "Location is excellent. Located near the center of Dubai, in the elite area. Relatively close to go before Nasser Square and to the main Mall (Dubai Mall, for example). There are shops on main street - Jumeirah. Located on the first line. Prior to the public beach within reach. Located across the street. Beach, in principle, net. Water is remarkable. Food so-so. Breakfast is standard. Bacon, sausage, sliced fruit, Chicken-nagetsy, vegetables, cakes, tea and coffee. No major complaints. At lunch and dinner the same menu - and so every day. Salads are very sour and spicy - a unique feature of Arabic food", "Date": "January 30, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Scotland", "Title": "“Good Location, shame about noise of restaurant!!!”", "Author": "Taliswoman", "ReviewID": "UR116575970", "Content": "Arrived at this hotel at about 1am, music was blaring from the resturant and our room was right next to it, although we asked for a quiet room! (???) really stuggled to get to sleep as it it continued until about 3am, the same happened the next night but as we were only there for 2 nights we just dealt with it!! Rooms were spacious and clean although the beds were like sleeping on a brick! Location was great, straight across from beach, if your looking for a cheap hotel and a short stay i would recommend it but for any longer i would defo pay extra for a higher star hotel!!", "Date": "August 11, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Globe", "Title": "“Card details stolen”", "Author": "Tvlller", "ReviewID": "UR115639755", "Content": "Beware! My gf stayed at this hotel for a week. I booked the hotel for her using my visa card. When she arrived there, she even didn't have the physical card with her, it was with me. During her entire trip in Dubai she never used this card at any business there. The only UAE business who knew my card number details was this hotel. A couple of weeks after her stay there, someone paid with my card for 5 different flights using my card details. All charges were in UAE dirhams (both myself and my gf were outside of UAE by then). The flights were booked with Emirates, Air Arabia and Air India. I wrote to the hotel telling them that someone among the staff has very likely stolen my card details but they didn't even bother replying. Waiting now on my bank to return my money.", "Date": "July 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "cheltenham", "Title": "“Not good,pay little extra go elsewhere.”", "Author": "welltravelled050", "ReviewID": "UR110138739", "Content": "On arrival receptionist very rude,Hotel full of Russians who were def the preferred guests,pool area filthy,rooms very dull and dark,and to top the lot got ripped of for 4 drinks we didnt have from the in room fridge,will not be back.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Great location”", "Author": "Glyn63", "ReviewID": "UR109757852", "Content": "Had a lovely stay at this hotel with my daughter. We wanted to get a way for a few days to chill out. The hotel beds are really comfy and clean. Breakfast was nice, not an amazing selection but enough. Very close to the beach where we spent most of our time apart from using the spa at the hotel which is reasonalby priced. Would use this hotel again.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kaunas, Lithuania", "Title": "“Really nice hotel”", "Author": "Tvixse", "ReviewID": "UR101534532", "Content": "Nice hotel with friendly staff. Excellent sleep in wonderful bad :) Nice small breakfast. Very good place. Really I love to come back there.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheshire, Connecticut", "Title": "“Wonderful Hotel in Dubai”", "Author": "Leonardas_P", "ReviewID": "UR94733433", "Content": "At the end of our cruise from Barcelona, we had the pleasure of staying at the Regent Beach Resort Hotel. It is a small hotel, but excellently located, on a quiet street in a residential neighborhood. It is right on the public beach, next to the Dubai Marina. The water is about 300 yards from the hotel, and is one of the cleanest beaches I have ever been to. The water is crystal clear, and the beach sand is fine and easy to walk on barefooted. There are also lifeguards on duty at the beach. We were fortunate to have one of the two balcony rooms facing the beach, so our view was awesome! The amenities include a small heated pool and an exercise room filled with equipment. The staff were very helpful and attentive, and absolutely a joy to deal with. The only drawback was that our room was right next to the hotel's Ali Baba Restaurant, and the restaurant rocks with middle eastern merry making until the wee hours. This made sleeping with the balcony sliding door open very difficult, and closing the door helped, but did not eliminate the noise entirely. Regardless, I would enthusiastically recommend this hotel, and would stay there again if we ever return to Dubai. I'm sure other rooms in the hotel are much quieter. It is a short walk from the Jumeirah Mosque, which is a must see! Four days a week, the Mosque invites non-Muslims to visit and learn about Islam. If you go there, be sure to participate in the ablution ritual washing. It will help you get into the spirit of the visit, and connect with the guides. The hotel is also a short cab ride from the Dubai Mall and the Burgh Kalifah, the tallest building in the world. Breakfast at the hotel is interesting, including a mix of local (french toast made from pita, Arab pancakes, Arab cucumbers, \"beef bacon\", hummus) and non-local (baked beans, scrambled eggs) entrees. We did not eat at the \"Alii Baba\" Restaurant, but would have if we had more time in Dubai. It has a mix of Lebanese and Moroccan food.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great location, give it a try”", "Author": "Lovinmambo", "ReviewID": "UR81067669", "Content": "We stayed for 6 nights on a bed and breakfast basis i will try and list information to make this review easier to read: Location: excellent right on jumeriah beach open road, the beach and sea were lovely village shopping centre 2-3 min walk where you could grab a coffee and a bite to eat also post office is located on the ground floor handy for sending postcardsback home Hotel Staff were friendly and helpful, there is a small holiday firm who work within the reception they had some resonable trips at a fair price we booked the dhow cruise with them and really enjoyed it. All public areas were well air conditioned and believe me you needed it, it was extremely hot when we went, the pool was clean and welcoming although a little on the small side. Rooms Spotlessly clean,beds really comfy,tea and coffee making facilities my only complaint was that the air con was really noisey and we were unable to switch it off this did disturb my sleep a bit. I would recommend the hotel to anyone wanting a beach location but not wanting to spend a fortune", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "England", "Title": "“Excellent hotel, great service!!!”", "Author": "Sarann", "ReviewID": "UR79944973", "Content": "When we booked this hotel we didnt expect very much as it was only £321 for the week for 2 of us, breakfast included. We arrived at 1am from the airport and we were showed to our room straight away, they followed with our baggage as their is no lift and we were on the first floor, we didnt need to ask for this, they insisted. The reception staff are very helpful and are there 24/7. Our room was very nice, clean and tidy, the bed was big and thier is a flat screen tv, the photos on thier website dont do the rooms justice, they are much nicer than they look, with loads of room. We ordered room service a couple of times which was very nice and quick. The swimming pool area is nice, not very big but it was never very busy as the beach is just across the road so we had it to ourselves when we were using it. The breakfast was good, lots of choice, including hot options, pastries, cereal, oats and a selection of hot and cold drinks. The location is good, jumeria 1, you can get a taxi right outside to wherever you want to go and the taxis are very cheap, to get to where the Burj Al Arab is it cost us around 35 dirhams which is about £7, and it takes around 20 minutes.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful Time”", "Author": "travelcompany29", "ReviewID": "UR47365696", "Content": "I stayed at the regent beach twice last year and thoroughly enjoyed both times. It is a 3* hotel with bags of character, not a 5* modern high-rise. The bedroom, and all public areas, had aircon. The large ali-baba tents added to the ambience. The staff were really friendly; the food was great; the room was large, clean and tidy. Not a bad word to say about it. The fact that it is across the road from the beach made the holiday even more enjoyable. There are quite a few cafes, restaurants and shops close to the hotel, but the best place to eat was the Automatic Grill which is about 4-5 minutes walk on the other side of the road heading in the direction of the Burj/Jumeirah Beach Hotel. The name doesn't do the food justice. Fresh salads, fruit and vegetables, flame grilled meats - at very reasonable prices. Roll on April when I'll be back there for another amazing holiday.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "READING", "Title": "“Fantastic Time”", "Author": "ANDREAGOULD", "ReviewID": "UR19072391", "Content": "I stayed at the regent beach twice last year and thoroughly enjoyed both times. It is a 3* hotel with bags of character, not a 5* modern high-rise. The bedroom, and all public areas, had aircon. The large ali-baba tents added to the ambience. The staff were really friendly; the food was great; the room was large, clean and tidy. Not a bad word to say about it. The fact that it is across the road from the beach made the holiday even more enjoyable. There are quite a few cafes, restaurants and shops close to the hotel, but the best place to eat was the Automatic Grill which is about 4-5 minutes walk on the other side of the road heading in the direction of the Burj/Jumeirah Beach Hotel. The name doesn't do the food justice. Fresh salads, fruit and vegetables, flame grilled meats - at very reasonable prices. Roll on November when I'll be back there for another amazing holiday.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Ideal for the beach.....shame about the rest.”", "Author": "Rascal3687", "ReviewID": "UR15586471", "Content": "We booked the hotel as it is close to the beach, yet close to the city. The problem with this hotel is it appears that it has lost it's identity as a hotel as it concentrates more on its restaurant custom. When we checked in we were told that we had been upgraded at no extra cost to a superior room on the understanding that if they needed the room we would have to vacate! It was very late and in order to get our heads down after a long flight we accepted. The room itself was a good size and very clean. Unfortunately however during our entire stay we were unable to open our curtains or patio doors as this looked directly out onto a table within the restaurant! I must point out that the photographs of the hotel on the website are not a good representation of the Regent Beach Hotel. The open communal area has been taken over by a large ‘Ali Baba’ tent which houses a smoking area and restaurant. It appears that the hotel has utilised every morsel of space which directly impacts on the overall comfort of the hotel. Where at one point the superior room would have had its own patio, this has now been utilised as part of the Ali Baba tent!! It wouldn’t have been so bad but Dubai is a fantastic place, it would just have been nice to be able to open the curtains in order to know whether it was daylight or evening....very disorientating. I found myself not wanting to go back to the hotel on some occasions as the ‘Tent’ area remained open quite late and it really did feel like people were in our room as we could hear their conversations perfectly!! To be fair, I can’t say it spoilt our holiday as I still made the most of it but I suppose forewarned is forearmed. With two days to go we received the phone call from reception....we need the superior room back, you have to get out. The receptionist was very matter of fact and basically told us at 9am that we had to pack and get out of our room ASAP. To be honest, due to the problems with the room we didn’t make a fuss and simply asked for the key to our new room. It was at this point that we were told that a bell boy would fetch our case as our room wouldn’t be ready until 3pm!! Enough was enough...we checked out.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good Hotel by Jumeirah Beach”", "Author": "SunnyKalsi", "ReviewID": "UR14002967", "Content": "We stayed there for 4 nights. For the cost it was a reasonable place, the room can be described as functional. The Hotel itself has a good Indian Restaurant, which I would recommend. And there is a Ali Baba Tent where Breakfast and the lunch buffet is served. The Spa within the Hotel was excellent, as it offered a range of massage (we opted for the Thai Massage). In terms of location, it's right on the beach near the port. There isn't a lot of noise and you can a nice range of locals and tourists. I think that makes for a nice change from private beaches! There is a pier, which was a fantastic location to watch the sun set, a memorable experience for us. Getting in to the city is affected by Traffic, but that's Dubai generally and there isn't much traffic around the Hotel. Also in walking distance is the Dubai Marine Resort with multiple bars and restaurants. All in all, a hotel that suited our needs and exceeded our expectations. The service was great!", "Date": "March 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good value hotel”", "Author": "Iantee", "ReviewID": "UR13765568", "Content": "We wanted a short break staying close to Jumeira Beach and a location offering good proximity to Dubai's other attractions. The Regent Beach Resort fulfilled this at an affordable rate compared to the other beach hotels. Although the hotel is not luxurious, it offers adequate facilities and an unobtrusive service. As an unmarried mixed race couple we were wary about being questioned about our status, given some other reviews on this site. However this was not a problem although we wore rings as appropriate. The hotel is a stone's throw from lovely quiet open beach. The breakfast had a wide spread; ranging from beef bacon to muesli to fruit. The hotel has two restaurants open to the public. We tried the Indian one; the service was pleasant and helpful and the food tasty. Note they also serve alcohol. The decor is a bit of a mish-mash, but has its own weird appeal as it's not too clinical. However if you want conventional luxury then don't bother. It's ideal if you are more concerned with getting out and about in Dubai.", "Date": "February 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "lincoln", "Title": "“I definitely would go back”", "Author": "brightwells", "ReviewID": "UR13346779", "Content": "I stayed at the hotel with my 3 year old son and it was perfect. The staff were really friendly and the room was very comfortable. It is very short walk to the beach which was quite quiet but maybe not as pretty as other parts of the beach which is the only bad thing i have to say about my stay.", "Date": "February 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "aberdeen scotland", "Title": "“Ideal Place”", "Author": "dubford71", "ReviewID": "UR7417757", "Content": "First of all ,first things first. In reply to all those negative comments and moans from previous posters, all i can suggest is that you dig a bit deeper in your pocket and spend some more money if it,s a top class hotel your looking for. Spent a week here in April and although it,s only a 3 star it makes up for it in 5 star service.From the bell boys to the hotel taxi drivers, they couldn,t be more helpful (can organize trips etc. for a decent price ). Right beside the beach which has police presence/life guard on duty and sunbed rental, there are also 2 refreshment kiosks, yes it it close to dubai dock area but not too distracting.(Go other side of promenade) Location of hotel means that a taxi to city sights i.e. gold souks / markets / sail on the creek etc. work out about 3 pounds sterling each way, opposite direction takes you straight down the beach road to other attractions (wild wadi / mall of emirates / madinet etc. ) work out a price with your driver, maybe 5 pounds . Hotel itself very clean and tidy , room cleaned every day, b/fast bar ok (omlettes made to order) internet access in reception and airport pick up can be organised. (our flight was over 1 hr late got in around 11.30 p.m. & still got welcomed with smiling face by driver.) Eating in the hotel could be quite expensive but only in line with other hotel eateries. Various shopping malls within 5-10 min. walk all with big range of cafes.one of the best is Tony,s New York Deli in the Village mall. Also McDonald,s right across the road for those on a bad diet. Could ramble on but can,t say enough good things about this place .For those not too bothered about 5 star hotels , suggest you try here ,unlikely to be disappointed.", "Date": "April 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bruxelles, Belgium", "Title": "“Overall an OK hotel but I would go elsewhere”", "Author": "bruges00", "ReviewID": "UR7402461", "Content": "This hotel is located between the town centre and Regent beach, one of the nicest beachs in Dubai. However, it is the beginning of this beach, near the port. The best part of the beach is farther away (near the Burj Al Arab and the Medinat), you need to take a cab to get there. Frankly, eveything looks pretty average in this hotel. Rooms are OK: large and well equipped (2 TV sets, fridge etc). However, the pool is very small and not refreshed, so during summer the water becomes so hot that there is no point to swim and bath in it. The fitness room is also very small. The breakfast buffet is OK but not more than that. In brief, if I were to go to Dubai I would not go there again, I would spend some money more and go to a nicer hotel.", "Date": "April 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Epsom", "Title": "“More Than Adequate !”", "Author": "NickNewmanEpsom", "ReviewID": "UR7284096", "Content": "Have just returned from 5 nights at the Regent Beach Resort and was very happy with it. It is not luxurious but what do you expect from a 3 star hotel. It was however very comfortable and the staff extremely polite and helpful. For me it is very simple, if you are looking to stay on the beach in a budget hotel then this is the place to stay. I had friends staying in Bur Dubai when i was out there and the RBR was in a different league for the same price.", "Date": "April 5, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“very disappointing and poor value”", "Author": "verasmithscotland", "ReviewID": "UR7276179", "Content": "We had been travelling in Australia and stopped here for 2 nights on our way home. We had stayed at 4* hotels which cost half as much as our stay here. The first room we were given was very hot, and the a c could not be adjusted as it was controlled from outside the room. We had to upgrade to a superior room. This room had a c that could be adjusted- so we were cool-, but the bathrom was dirty and shabby. I would never stay here again and would definately not recommend this hotel.", "Date": "April 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“You get what you pay for”", "Author": "bbossoxx", "ReviewID": "UR7198465", "Content": "The Regent Beach Resort isn't anything special, but it is clean, has comfortable beds (if not somewhat cramped rooms), has a clean pool, is across the street from the beach, has a decent restaurant, and has nice staff. If you want luxury, this isn't the place for you. But if you want value, then this is the perfect place. Go with an open mind, and remember how much money you are saving on your hotel as you shop til you drop in Dubai or otherwise indulge in everything that is awaiting you in this city known as \"Las Vegas on Crack\".", "Date": "March 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Middle East", "Title": "“Don't Waste Your Money!!!”", "Author": "MarriedWell", "ReviewID": "UR7161757", "Content": "I was suppose to stay in this hotel in Feb '07, but after one look at the room, I found other accommodation. The standard single room was the size of a closet! You have to leave the room to change your mind!! It was not at all what the hotel website portrayed! The location is the only plus, but the price that this hotel charges for such sub-standard rooms is a shame!! Don't waste your money!!", "Date": "March 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“PERFECT BUDGET HOTEL!!!!”", "Author": "Dubai-Mafia", "ReviewID": "UR7148434", "Content": "Well i heard about Budget Dubai hotels and was a lil worried however, i arrived about 12pm and my first impression was really good, it looked nice and everything, the reception is much nicer than pictures posted on the internet. The outside is really nice and does give you that arabic theme. My room was seriously perfect!!!! just like travel lodge in the UK. However the bathroom was not the best, it could of done with a upgrade badly but everything worked 100%. They had a pizza service sso every night i ordered pizza, drink, garllic bread and bbq wings to my room. Lots of english channels and very well decorated room, i have no complaints about the room. The breakfast area is really beautiful however the food i would rate 3 out 5 as it was lovly but could be better compared to other Dubai hotels i stayed at, but what was AMAZING is the view whilst you eat. Direct view of the silk sand beaches and arabian gulf, about 30 seconds from the beach, actually just cross the road and you are in the beach so i would say about 15 seconds????? lots of taxi's and everything great location, short drive to Sheikh Zayed Road and Port Rashid. Next to Burger King and shopping centre + a very british supermarket, in the sense that they sell a lot of british food, it is called Spinneys. Directly across the hotel is one of the most exclusive streets in the entire Dubai area where the rich of the rich of the world of arabs live. Spectacular houses, must be seen! Overall 4.5 out of 5", "Date": "March 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "britain", "Title": "“Cheap cheerful with a great beach location”", "Author": "sparks999", "ReviewID": "UR6894103", "Content": "Having stayed at the regent beach resort hotel in febuary 2007 I can say this was a very good hotel for the price. For a beach holiday its situation is great with a very nice sandy beach right outside the front. There are plenty of shops in close proximity and taxis are not expensive. The swimming pool was fine (a little cold)and if you wished to eat at the hotel there was a choice of Indian or Moroccan - I recommend the latter. The staff were always friendly and helpful. The breakfast wasn't much to right home about but edible. We did have to wait for our room having arrived early in the morning and we were put on the groundfloor without a view. Occasionally this was a little noisy from guests coming in late but on the up side we did not have any disturbance from the building work that is going on all over Dubai nor the planes as the airport is close. Cost in a metered taxi and from the hotel shuttle was the same for 2 persons (50 Dinars in total). Our room was cleaned every day and for us was fine in size with 2 large beds. The hotel is non alcaholic which may put some people off but you can get a drink at mealtimes. Here is a little tip for those that would like a refreshing beer/cider etc outside mealtimes. If you walk from the street down to the royal marine hotel (a 5 minute walk) right next door is a tex mex restaurant that sells all the usual lagers/beers/spirits. It has a great lunch special (29 dinars for food and a pint- just over £4) and has happy hour 1200 - 1900 during the week except fridays and 1200 - 2100 on the weekend. This was an ideal watering hole very close to the hotel. If you are planning any trips I would strongly recommend the dune safari. The drivers perform extraordinary skills to keep the 4 wheel drive vehicles going and not being rolled. A great adrenaline kick. This can be booked from the hotel along with other attractions. Overall I would definitely recommend this hotel to anyone who wanted to stay in Dubai close to the beach on a budget.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“OK 3 star hotel”", "Author": "mktraveller", "ReviewID": "UR6805408", "Content": "I stayed here for 6 nights 11th - 17th February 2007. Most flights from the UK arrive early in the morning in Dubai, and I arrived at the hotel by 9am. I had emailed for an airport transfer, but it never arrived. The room wasn't ready and it took a couple of hours before it was. I had a small, single room overlooking the pool. It was fine, a single bed that just about allowed the wardrobe door to open, air con that worked well, TV with many channels including BBC World. The bathroom was a little sparse and the towels had seen better days, but the water pressure was good and the toiletries OK too. The hot water was exceedingly hot, dangerously so I felt. My rate included breakfast, and the buffet looked fine, although the only day I ate more than cereal (I'm supposed to be on a diet!), the food was cold. The location was good and staff seemed very helpful, although I did have trouble on the last day. I had booked an early morning call for 6:30 and a shuttle to the airport for 7. The evening before I was asked to change my departure to 6.30 as another couple were leaving then. I agreed and asked for the call to be changed to 6. It arrived at 6.20, but luckily I had set the alarm on my mobile phone and was already up. When I got to reception I was put, alone, into a taxi and sent on my way. I never even saw the other couple! On the whole it's an OK, small 3 star hotel, something of a rarity in 5 star Dubai!", "Date": "February 17, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Poor Customer Service”", "Author": "j_stoichcox", "ReviewID": "UR6745973", "Content": "After booking two months in advance we were told upon arrival that we could only stay for one night and then would have to move to another hotel in the city, the Regal Plaza. We asked for an upgrade to a 5 star hotel as we could have booked into a 5 star hotel in the city for the same price we paid for the 3 star hotel on the beach. They refused this and then after three nights in the new hotel we were again told that we would have to move as there was no room for us in the Regal Plaza. At no time did they offer to reimburse us for some of our expenses or give us a token gesture as an apology, and were quite rude when we complained about this treatment. We were not the only ones staying there at the time that had customer service trouble and their tour sales person told lies in a bid to get you to book certain tours. The travel agent we booked through ([--]) have also been very unhelpful in answering our complaints.", "Date": "February 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Cornwall, UK", "Title": "“Disappointing.......”", "Author": "polly219", "ReviewID": "UR6699389", "Content": "Stayed at the Regent Beach Resort for one night one the way to Oz from the UK. Had spent a considerable amount to time researching a suitable \"budget\" hotel and was disappointed - despite being realistic about what to expect after doing lots of research! I was unable to find an email address to book the hotel mini-bus on the way out so paid for a taxi tout at a negotiated rate - the journey takes about 20 mins but can be much more if the traffic is bad! Utilised the mini-bus service going back to the airport the following day and it was very reasonable - 20Dh I think. I was pleasantly surprised to be allowed into my room at 10.30am and had prepared myself not to be able to get in until 2pm (arrived at 8.30am). I spent the morning asleep in one of the \"tents\" in the garden and wasn't disturbed which was a relief. However I was disappointed with my room - the carpet was dirty and the bedside lamp didn't work. Also the bedroom and bathroom were slightly below ground level which made the room very dark and if you wanted any privacy you had to keep the curtains closed as everyone walking by could look in (despite nets!). Furthermore the bathroom window vent (which was in the top of the wall) didn't shut properly due to an extractor fan and everyone in the outdoor reception area could look in and see/hear everything! Had a nasty shock when showering at 6am the following morning before going to the airport as there was only a very (very) limited amount of hot water....!! Not sure if i didn't get a better room because I was a single traveller and I was only staying for one night.....it's just something to bear in mind as the hotel didn't seem particularly full! However I didn't complain as I was just too tired and just wanted to sleep! The location was great for the beach - just a 2 minute walk away - across the car park, a small road and you are on the beach. Which was great to relax on before preparing myself for a 14 1/2 hour flight to Melbourne. Taxi's to and from the souks were reasonable and regular, it's not the law to wear seatbelts in the back in UAE however felt for my own safety that it was a wise decision! The staff were friendly (Indian), polite and helpful. However for £70.00 I didn't think that I got value for money! Probably wouldn't go there again or recommend to anyone, as I would be concerned about not having a better/cleaner room", "Date": "January 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Good location and value for money, but the decor is a little dated.”", "Author": "JamesChin", "ReviewID": "UR6606761", "Content": "We have just returned from Dubai where we stayed at the Regent Beach Resort. The resort is along Jumeriah open beach toward the city side. Location was good as it was closer to dubai city, dubai creek and old dubai than other upper-class resorts that are also along Jumeriah beach. There is tremendous construction currently underway all over Dubai. This means that the beaches may feel quite industrial, and this does apply to the beach close to this resort. The locations close to the 5 star resorts along Jumeriah beach had a lot more construction going on. The resort rooms were basic, dated but comfortable. The pool, sauna and steam room were also good but the pool may need a facelift in the near future. We found the staff to be highly professional and friendly. Overall: good value for money, good location, but remember that the decor is dated.", "Date": "January 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Very disappointing”", "Author": "Malady", "ReviewID": "UR6357420", "Content": "Our stay at this hotel was the only disappointing part of a 1 month holiday with my family. We had to pre pay through Emriates who arranged our booking. When we arrived in the middle of the night (we did confirm a few days ealier) we were told that one of our two rooms wasn't available! In spite of the fact that they knew when we were arriving, they only had the 1 room with one double bed in it and we had to wait for 1 hour while they dragged two more beds into the room. We eventually got to sleep at 4 am however it ruined our one day in Dubai as we were so tired. I did get the impression when we arrived that they really didn't care whether we were satisfied or not - they just shrugged us off and were not in a hurry to get us settled in. We were unable to redeem any of the cost for the two rooms - evidently four beds squashed into one room is the same price as two rooms! This was totally unsatisfactory to us and to top it off, it rained and turned cold during our one day there. I would definitely NOT recommend this hotel to anyone.", "Date": "December 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“best budget hotel in dubai...right on the beach”", "Author": "johnni_sarah", "ReviewID": "UR6185298", "Content": "Driving through Dubai, past all the amazing hotels and anticipating the arrival at ours, i was to be honest dissapointed when we pulled up to The Regent Beach Resort, it seems fussy and dated from the outside. When we entered our rooms we were pleasantly surprised, they were large and had high ceilings, which for 3 girls with plenty of shoes and outfits to unpack, made us feel like we had plenty of room, which we most certainly did! the staff are amazing, cant do enough for you, they give a 5* service. The hotel has a very small buisiness feel about it, giving a personal touch which you dont get from the huge hotels elsewhere in Dubai. The hotel is very clean, and has very very popular restaurants which locals swarm at the wkends which is always a good sign! One thing i will say is that the pool area is very small, but we prefer the beach so didnt cause any problems for us!", "Date": "November 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "North Carolina, US", "Title": "“could be a good hotel...”", "Author": "udegdeg", "ReviewID": "UR6154260", "Content": "After staying in Dubai for 2 months (in Bur Dubai and in Deira), my family and I opted for a one week beach stay and choose the Regent for its (relatively low) price. It is apparently the only 3 star on Jumeirah Beach - thus \"cheap.\" We were consistently disappointed by how good the place COULD be but was, unfortunately, not. Check-in was not handled well - there were many people who through early flights or for other reasons had arrived in the morning. Not only were rooms not available, and the tiny lobby (the only air-conditioned place - very welcome in August in Dubai) overflowing with unhappy people in every available space, the hotel staff did not offer any suggestions. We figured there had to be a restaurant and once we found it, we were able to wait there, drink a juice, and at least relax with a nice view of the ocean. The restaurant took us 15 minutes to find and no one offered any help. If the staff had instructed people to wait there if they liked (and, if the hotel had gone one extra step and offered people one complimentary juice) you would have seen much happier folks instead of the miserable lobby scene. We were eventually given a \"suite\" since there were no vacancies of regular rooms even later in the day, though we were told we would have to move \"in a day or two.\" As we were 2 adults and an infant who had been living in Africa for a year (and therefore, with a fair bit of luggage), this meant we couldn't really relax as we did not know if or when we'd be asked to move. If I had actually been paying for a suite, I would have vacated the premises immediately - while large, it was terribly shabby. The room we were eventually moved to was large and had a great view of the beach but smelled so toxic - not sure what caused it and, at that point, complaining didn't seem useful. The guy who helped us move our luggage (3 times that week!) was the most wonderful person. It seems as though someone decided to \"upgrade\" the hotel by spending too much money on plasma televisions which were tacked up in very awkward places in the restaurant. The most galling aspect, to me, was the junk EVERYWHERE - tucked in every conceivable corner. It was a veritable hazardous waste site just behind the pool with all sorts of chemicals, paints, cleansers, etc. jumbled in full-view. Broken washing machines around one corner, luggage carts left all over the sidewalk, cigarette butts all around the pool. The restaurant, where we ate our complimentary breakfasts, needed a good cleaning. The food was a disappointment too - especially after our previous hotel (the Hallmark) and it's excellent buffet. Instead of offering a whole range of local foods (cheap and widely available), they concentrated on bad \"English\" breakfast choices. Basically, this place needs better management. It's got all the right ingredients - great beach location, decent architecture, friendly staff - but whoever is in charge is doing all a disservice by their poor oversight.", "Date": "November 20, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belgrade", "Title": "“Nice, pleasant and quiet place”", "Author": "A,M,J.Dj", "ReviewID": "UR5956698", "Content": "We stayed in this hotel in August 2006. The staff and service was perfect as well as the location, so we recommend it to everybody who wants nice, quiet and pleasant place with exellent service and kind and friendly staff.", "Date": "October 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Absolutely fabulous”", "Author": "SKP1", "ReviewID": "UR5502399", "Content": "We have just returned from a week in Dubai and feel that the Regent Beach hotel must be applauded. The hotel location was fantastic, just across the road from Jumeirah beach and an approximate five minute walk from the bars and clubs! The staff were excellent, always willing to help with a smile, no matter what time of day it was. The breakfast buffet had a variety of choice, ranging from a fry-up to fresh fruit but i'm a simple person and was happy with a cup of tea and a crossiant. The pool area was great, there was always somebody around to help with the umbrellas, filling up the pool toys with air and also serving drinks. The hotel offers a complimentary beach towel service, so we had clean towels to take to the beach everyday. Staff are more than willing to organise taxis which was a great help as the taxi would be ready as soon as we were! Mercato mall is not very far and has good places to eat and fantastic fresh juice bars. Overall, being the only 3* hotel on Jumeriah Beach, they provided us with a 5* service. Will definitely be going back!", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Arbroath Scotland", "Title": "“Does what it says on the tin”", "Author": "Brian21", "ReviewID": "UR5431709", "Content": "The Regent Beach Resort Hotel does “exactly what it says on the tin”. It is a three start hotel nothing more and certainly nothing less. The hotel was undergoing some refurbishment and the first room we were in was quite small (especially with a king size bed in it), however after 2 days were moved into an altogether better room. So advice is if our first room was a Standard, go for the deluxe. The rooms were serviced daily with full linen change, and kept very clean. The buffet breakfast is Ok with a varied choice, with fresh fruits, breads, pastries, and hot buffet (do not expect bacon or ham). The pool area is Ok and in June/July quiet, and there is a very well equipped gym if you are feeling energetic. The public beach is located across the road, and actually gets very busy at night around 22:00 when lots of people go for a walk and a dip in the gulf. The parking area outside the hotel is public and gets impossible at this time, although a valet parking service is available. There are 3 small shopping malls within 10 mins walk with good restaurants and cafes (The Thai in the Village mall is very good), and a the larger Mercato is 1km away all on the main beach road.. As previous reviews have said there is no bar in this hotel, but you do have a fridge in the room so stock up at the duty free on arrival at the airport, beer by the case or ½ and wine etc is available. As regular visitors (twice per year) to Dubai we vary our hotels to meet our requirements; we have stayed in 5 star (inc the Burj Al Arab) both city and beach. On this occasion we were looking for a cheap and cheerful hotel. After reading what are mostly positive reports on the Regent Beach I booked it via the web for a week through a local Dubai travel company and paid less than £50 per night, what a bargain.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "dublin", "Title": "“Best value for money loved it so much”", "Author": "A TripAdvisor Member", "ReviewID": "UR5364113", "Content": "Myself and my boyfriend stayed here for 5 nights . we paid for a standard double and when we arrived we were shown to the deluxe room with a balcony and fresh fruit basket waiting for us at no extra cost ..We organised transport with the hotel so they would collect us from the airport...what a bargain 5 eur for the two of us...taxi's are so cheap in Dubai and fully air conditioned...when we got into the hotel transport we were given cold refreshments as the temp outside was 40 degrees at night...nice touch....all the staff in the hotel are so friendly and helpful and will do anything for you which in some of the other 5 star hotels you will not always find this...booked our tours in the hotel and these were chaper than what other people paid...you have to go to wild wadi and do the desert safai...its something that you will remember for the rest of your life and be warned it is bumpy.....the beach acroos the road is lovely but we used to get a taxi to jumerah beach park which was a euro in and had a beach hut which you can grab a bite to eat and drink also ....if you need any more info please email work.webmail@googlrmail.com oh and 200 cigs is 11usd....go to the dubliner pub in the meridian hotel beside the airport 5 eur in a taxi and the double decker on sheik side road....", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice place to stay!”", "Author": "Max_Norway", "ReviewID": "UR5313287", "Content": "When you visit Dubai, you are obvious not going to spend most of your time at the hotel room. Why use all your money at a five or seven stars hotel? This hotel have one of the best locations at this part of Dubai. Better than most five stars hotels. Regent Beach Resort is located not far from downtown (take a short taxi ride, not expensive), and next to a very nice secure public beach. There are even a small police station at the beach, and naturally a baywatch patrol. Guests at other nice hotels downtown, have to take a hotelbus to the beach - while you just have to cross the street (10 meters). The hotel staff is very friendly and service minded. They always said hallo or hi.. The room was all right, clean and nice size. The carpet on the floor could have been changed for some time ago, otherwise the furniture was fine. Cabel-tv at the room, and a DVD player. You can rent dvd movies at the hotelreception, or buy your own dvds at one of the shopping malls in the neighbourhood (walking distance). The beakfast was OK. Egg, toast, jam, fresh fruit, bacon (made of beef, since they don't eat pork there), baked beans, cornflakes, juice, milk, cafe, tea etc. They also have a Concierge Service at the recption. From there you can arrange different tours; ex. dessert safaries, lunch at Burj al Arab, Ballooning etc.", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“a very good hotel in a great location”", "Author": "r0sieee", "ReviewID": "UR5297812", "Content": "After reading some of the reviews on this site I was a bit apprehensive about staying at this hotel. However, I had a great time and was very sorry to leave. The staff were very polite and did everything they could to make my stay as comfortable and stress free as possible- nothing was too much trouble. I had breakfast every day and found it very nice although I am not really into cooked breakfasts so can't comment on whether the food was cold. I stuck to toast, croissants, fresh fruit and tea. The pool is a LOT smaller than it looks in the pictures but it is very pretty and well maintained. I didn't use it because it's a real sun trap and I found the beach (just accross the road) to be a lot cooler. The rooms are cleaned every day and are well maintained although some of the bathroom fittings could do with updating. I had a room overlooking the pool and was a bit worried about noise from the restaurants but I didn't hear anything at all; it was extremely quiet. the location is great; within walking distance of several malls and a supermarket although they are digging up the main road at the moment so crossing is a little tricky! There is a small mall about 5 mins away that has a great American style diner serving salads, paninis, pasta etc. The souks, creek , Wafi City Mall, Deira City Mall etc are about 30 mins away in a taxi which costs about 23 dirhams. If I were to go to Dubai again I would definitely stay in this hotel", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "uk", "Title": "“Good location”", "Author": "farnaway", "ReviewID": "UR5044849", "Content": "The rooms at the hotel were surprisingly larger than I had expected and very clean. The pool area is quite small, but well kept. The breakfast was not up to our expectations we only had 2 breakfasts on our 7 night stay, the food was cold on both occasions. The beach is just accross from the hotel, Its a public beach but well kept and very busy on Friday's. There is a life guard and security on all the time. There are plenty of eateries round and about and some lovely shopping centres very close. When all the pavements are finished it will be much easier to get around. The hotel runs a courtesy bus to the Rock Bottom Cafe in the city, this is a good place with great steaks and live bands, Oh and you can get a drink. All in all a well located hotel but remember it's a three star so they don't serve alcohol so pick yours up at duty free in Dubai airport.", "Date": "May 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Kent", "Title": "“Did exactly what we expected”", "Author": "iforres", "ReviewID": "UR5012946", "Content": "We booked the Regents beach resort based totally on price and location. We knew we booked a 3* hotel so we were not expecting the 5 or 7* treatment. The hotel had arranged to pick us up from the airport and we arrived in reception at 8.30am. We also knew that the room would only be available by 2pm. Lo and behold at 9am we were escorted to our clean room. We were travelling with a 9mth old baby so this was a huge bonus. Rooms were adequate for what we needed and were cleaned daily. We did stay round the pool for most of the duration and it was cleaned every day and we were happy with it. Not much space to spread out though. Towels were provided. Breakfast was plentiful and we found the food to be fine. We did eat in the restaurants a couple of times and again the food was good. Lamb chops were sublime. Staff were obliging and we had no problems during our entire stay. Do remember there is no bar, so bring your own. It is a 3* hotel and it does not pretend to be anything other than that, and it is better for doing so.", "Date": "April 27, 2006"}], "HotelInfo": {"Name": "Regent Beach Resort", "HotelURL": "/ShowUserReviews-g295424-d301532-Reviews-Regent_Beach_Resort-Dubai.html", "Price": "$82 - $490*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Jumeirah 1 Road Street 39A</span> | <span class=\"extended-address\">PO Box 27160</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">87075</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "301532", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/53/0b/530bb065fb7207697fa002924c4d08ad3large.jpg"}}