{"Reviews": [{"Content": "nicle nad dime The hotel and accomadation was outstanding, The staff were incredible. Cleaniness was superb. The food was a little high priced but it was fine dining. My biggest complaint was how the resort nickel and dimed for most everything. 1. had to pay for a cab from airport to hotel2. Shuttle buses not available to take you to different places.3. Only 3 bottles of free water available per day otherwise had to pay for extra.4. Had to pay for soft drinks. coffee and tea and water.5. Breakfast not included. The beach was fantastic and safe for families", "Date": "Jan 3, 2009", "ReviewID": "UR723044574", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "1", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "annieb58"}, {"Content": "Very Nice We really wanted to stay in this area and thought this hotel was better than the others in the area. This hotel is much smaller and less corporate than the other hotels in this bay. The service was outstanding. Although expensive, but cheaper than the other ones on the bay, our room was amazing-- very large, private, and stand alone. Once of the better rooms we had on the trip. Keep in mind there is no gym and limited business services. I wold stay here again and the fish stalls down the beach are incredible for dinner at sunset.", "Date": "Dec 31, 2008", "ReviewID": "UR494891040", "Ratings": {"Service": "5", "Business service": "1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "ediggidy"}, {"Content": "Honeymoon bliss!       Pool", "Date": "Sep 18, 2008", "ReviewID": "UR985381839", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Clara29"}, {"Content": "Stunning location        Eating at one of the fish restaurants on the beach a short stroll from the hotel along the shore", "Date": "Aug 31, 2008", "ReviewID": "UR333325613", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "trix4"}, {"Content": "perfect We were about to stay at the jimbaran between the 19th and 22nd of August, but due to a glitch in the reservation (which was not the hotel's but our agent's fault) we don't have our rooms until the 20th.The hotel handled it beautifully, relocating us to this resort only 50 metres from it, and ensuring us that we can use the amenities from both resorts (spa, beach, etc)When we finally got to stay in jimbaran, the experience was perfection.We got upgraded to a two storey family cottage with private pool, and i just fell in love with the way they decorate the place. The cottage walls were bright white, the tatched roof was light brown, and it really helped the overall ambiance (the resort we stayed the night before, the ahimsa, was very dark and gloomy with its ebony woods and black decor).The beach was private, which was good, (I hate large packs of tourists!) with white sands that was looked after and clean, and the ocean water was light blue! We had a free lunch that we made the most of (because of the reservation glitch) and the lobster was the best I had ever. The people at the hotel was super friendly-typical balinese-and really looked after our needs and looked like they were enjoying themselves doing it. I'm going back to bali on march and I'm for sure will stay at the jimbaran again.", "Date": "Aug 24, 2008", "ReviewID": "UR233760747", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "cendut"}, {"Content": "Perfect, private place to stay We walked into the Jimbaran Puri Bali on the offchance they had available rooms, we were so pleased that they did. The little private rooms with an outdoor shower and private garden are idyllic. The pool is great and views better. Definite recco", "Date": "Aug 4, 2008", "ReviewID": "UR603977673", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Hollydrinks"}, {"Content": "Paradise - but with the builders! This is a very well appointed, small and exclusive property with some superb rooms. We had a two storey villa (no 41) with its own pool and both floors are huge. The rooms are serviced 3 times a day, but never obtrusively with water, fresh fruit, tea and coffee and bed- time herbal tea are all provided. The staff could not have been more friendly and helpful. There is also a library and wi-fi in the lobby by the pool. The beach is one of the best in Bali and great for bodyboarding (provided free) or kayaking (also free).Staff were very good at organising taxis (very fair prices), trips to Ulu Watu temple (likewise), snorkelling trip (recommended) and transfer to Ubud. Very easy to get to Kuta for shopping and night life.2 things to watch out for - they are building some more villas and have the builders behind the property until the end of 2008. Well screened off ,but It meant we could not use our private pool or garden between 10 and 5pm, but they made up for this with free breakfast for 7 nights. Second is that the excellent restaurants are very overpriced - but you can eat really well from a multitude of beach places 5 mins walk along the shoreline.example live lobster in hotel R102,000 拢5.60) per 100g - same live lobster on the beach its R170,000 拢9.40) per kg!The local dance event though was fairly priced.Overall though we would highly recommend and its streets nicer than the Four Seasons or the Intercontinental on the beach.", "Date": "Jul 13, 2008", "ReviewID": "UR667802131", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "deskjet2"}, {"Content": "good       puri bali", "Date": "Jun 17, 2008", "ReviewID": "UR712548146", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "2", "Rooms": "5", "Location": "3"}, "Author": "zanda18Birmingham"}, {"Content": "Fantastic if you want to splurge a little       morning view of pool", "Date": "May 20, 2008", "ReviewID": "UR401974749", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "2005travel"}, {"Content": "Beautiful       bungalow nr 17", "Date": "Mar 7, 2008", "ReviewID": "UR281443788", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "LindaNorway"}, {"Content": "not that nice... i wont agree with all i read... it is actually too expensive for what it is. it is a nice hotel but not worth the price. you get in bali much nicer hotels for half the price. also, i was there right between Christmas and New Year's eve. we had booked 7 nights, and as it was raining so much, we decided to leave the hotel the next day. they asked us to pay 7 nights cancellation fee, which i found not fair at all coming from a big nice hotel.the hotel itself is nice but still, the entrance lobby is very poor, the road leading to the hotel is horrible. Breakfast is poor and way too expensive. next time i would better stay in Ritz or go to Novotel Benoa...", "Date": "Feb 25, 2008", "ReviewID": "UR824739578", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "SamTParis"}, {"Content": "A dream Hotel with Amazing Smiley Staff!!       Our Room", "Date": "Nov 1, 2007", "ReviewID": "UR864004964", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "georgiosr"}, {"Content": "Amazingly relaxing What a fantastic place. We went for our honeymoon and it lived up to all expectations. The staff were friendly, attentive (without being pushy) and very helpful. We had a great laugh trying to learn a few words of Balinees from them. The hut was spacious and airy with all the facilities you would expect from this standard of resort. It has a great pool area and location right on Jimbaran beach. The beach comes alive at about 5ish with locals playing football and generally having fun. Walk down the beach towards the airport and you can watch them launching the fishing boats and visit the local fish market. The food in the hotel restaurant is much more expensive than the places on the beach, but they are two different styles of food. The beach food is simple freshly caught bbq'd seafood which is very cheap and delicious. The hotel food is much more what you would expect in a decent restaurant and as such not expensive for what you get. I would recommend trying both. Great place and one I would definitely recommend to others.", "Date": "Sep 19, 2007", "ReviewID": "UR217093335", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Brooksietravel"}, {"Content": "Paradise       Lilly pond", "Date": "Sep 4, 2007", "ReviewID": "UR799178448", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "SheldonB14"}, {"Content": "Very nice rooms, lacking first class quality service. We stayed in this hotel for 2 nights, before staying for 10 days at the Oberoi Hotel. Before I stayed in private villa for 2 nights. The rooms are fantastic, as already described in other reviews.The beach is nice, though boring if you would like surfing or bodyboarding. Beaches in Semyniak are much more impressive I think.I was a bit dissapointed in the stay though, mainly because we didn't feel treated like you expect to be in a first class hotel. Service is very average, especially compared to the service in other first class Bali hotels. It are details, but it distinguishes a hotel. Also, (this may be snobby, but it is just the way it is) the clientele was fairly average and unmannered.Except for the rooms, the hotel is no way near the first class hotel experience the Oberoi, Four Seasons or Ritz will give you.", "Date": "Aug 1, 2007", "ReviewID": "UR421221358", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "charly3"}, {"Content": "Not enough superlatives to describe this hotel!       Sunset", "Date": "Jul 1, 2007", "ReviewID": "UR402986252", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "teppy83"}, {"Content": "A Relaxing and Convenient Overnight Stopover My husband and stayed only one night after a long overseas flight at this very stylish boutique hotel. We really enjoyed our stay even though it was very short (we were in transit to another part of Indonesia.) It is close to the airport (10-15 min by taxi), and made a convenient overnight stopover.The hotel is done in the traditional Balinese style. The resort has a very serene and peaceful atmosphere and is located on a nice beach. The grounds are lovely. The rooms are private and comfortable with beautiful wood and tasteful accents. The beautiful pool fits in perfectly with the ambience of the resort. It is large, inviting and warm -- perfect for either bathing or swimming laps. We enjoyed the beachfront fish restaurant at the hotel for dinner. It was considerably less than what we would pay for an equivalent meal at home, but may be more expensive than the local restaurants. We thought the beautiful setting and attentive service more than made up for the higher cost. The spa was nice and the Balinese massages were relaxing and reasonably priced.The atmosphere of the hotel is best suited for couples. I wouldn't recommend it for families.", "Date": "Jun 28, 2007", "ReviewID": "UR591387137", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "FreqFlyer23"}, {"Content": "Great Hotel but............. Jimbaran Puri Bali is set on pretty quiet beach. The best hotel to access the beach. It is so peaceful. The sand is soft and white and the hotel keeps it clean. The sea water is not aqua and it is not clear. It looks brown because of the back wash. At around 4pm all the village folk come to the beach to swim and play ball and the beach begins to light up with people and pretty tables lit with candles. The hotel looks beautiful at night with all the candles lit and very romantic. Really special. The best thing about the hotel is the cottages because they are private, so you have your own garden on the one side and on the other side a patio which isn't private. I think this is the saving grace of the room. You don't get conditioner in your room so bring your own. The bed is good and comfortable. There was blood on our sheets when we arrived but they changed it immediately. On closer inspection of the room you will notice that it is almost in need of a face lift. The woodwork in the room looks tired. Outside the deck is rotting. They don't provide mosquito repellent and they charge you for internet usuage. They do give you a hat, bag and slops to use while you stay there. The staff are on the border of being unfriendly, they actually look like they dislike their jobs, so i think that is the vibe you end up picking up on. We were really bothered by the ladies that do massages for the hotel on the beach. They are pushy and try to get you to commit to having a massage when all you really want to do is just chill on the beach. They also have a little business on the side and bug you to come and look at their hats, bags, bikinis etc. It got to the point where we opted to lie at the pool to avoid them. We ate at the hotel and the food was above average. Breakfast is terrible. At the prices they charge the meals should have been excellent. We are major fans of the Mandarin Oriental Group and always stay at their hotels, that is why we stayed here, but this hotel somewhat dissapointed me and i feel its not a true reflection of the Orient Express Group. The staff need the most work because this hotel is a gem but in my opion, not managed well. If they up their game by 100% i would even be willing to pay more to stay there.", "Date": "May 19, 2007", "ReviewID": "UR164642230", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "VernaCapeTown"}, {"Content": "Heaven is Jimbaran Puri       lovely Jimbaran Puri bungalow", "Date": "May 16, 2007", "ReviewID": "UR867177270", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "glampuss"}, {"Content": "Gorgeous grounds       best pool ever!", "Date": "Jan 7, 2007", "ReviewID": "UR742146769", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "2", "Rooms": "5", "Location": "5"}, "Author": "Carruth"}, {"Content": "Holiday in Paradise We stayed at Jimbaran Puri Bali for two weeks at the end of September, beginning of October and it was the best holiday we鈥檝e ever had.The resort is just the right size: there are enough people to feel like you鈥檝e got company, but not overcrowded like the Intercontinental next door. The grounds are impeccable and all the facilities are well maintained, show no sign of tropical wear and tear.The cottage was a perfect place to relax in, spacious, with wonderful furniture, creating a really calm environment. The bathroom was the perfect size and both the sunken bath and the rain shower were fantastic.The beach was good, however at certain times it was a bit dirtier than we would have liked (plastic bags, clothes floating in the water). The staff told us it was due to the much heavier storm activity at sea. Otherwise the beds were comfortable, there was never any problems at getting a bed at the sea side or next to the pool.We've enjoyed the sunsets most nights from the beach side bar, followed by the stunning food in either of the restaurants. We can highly recommend the sea food restaurant, as its food was some of the best we've ever tasted. Its definitely one of the highlights of the hotel.", "Date": "Dec 17, 2006", "ReviewID": "UR221587646", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "zachy"}, {"Content": "beyond my expectations       entrance  restaurant", "Date": "Dec 1, 2006", "ReviewID": "UR162085191", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "worldsoundwalker"}, {"Content": "Wonderful setting       Sunset cocktails on the beach", "Date": "Dec 6, 2005", "ReviewID": "UR704976564", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "TheSKIers"}, {"Content": "The pix speak for themselves       does life get any better than this?", "Date": "Dec 1, 2005", "ReviewID": "UR732602970", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "vlmonahan"}, {"Content": "Perfect Bali Beach Hotel   showReview(4036746, 'full');", "Date": "Oct 19, 2005", "ReviewID": "UR165083211", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "PassionateTraveller1"}, {"Content": "Fantastic hotel   showReview(4004881, 'full');", "Date": "Oct 10, 2005", "ReviewID": "UR860752889", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wonderful place       plasma TV screen", "Date": "May 24, 2005", "ReviewID": "UR848823789", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Doctor_X"}, {"Content": "Blissful Bali   showReview(3469160, 'full');", "Date": "May 13, 2005", "ReviewID": "UR534105205", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A treasure   showReview(2832166, 'full');", "Date": "Nov 18, 2004", "ReviewID": "UR669559297", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Genial lugar de Relax   showReview(23138265, 'full');", "Date": "Dec 31, 2008", "ReviewID": "UR187898528", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Torpeduco"}, {"Content": "Extraordinaire   showReview(22911353, 'full');", "Date": "Dec 22, 2008", "ReviewID": "UR373411096", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "thelastone"}, {"Content": "Mediocre       Piscina", "Date": "Nov 23, 2008", "ReviewID": "UR295703252", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "pichi-puchi"}, {"Content": "Super hotel en bord de mer   showReview(21817007, 'full');", "Date": "Nov 13, 2008", "ReviewID": "UR762029302", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "indiabali"}, {"Content": "traumhaftes Kleinod   showReview(21543179, 'full');", "Date": "Nov 4, 2008", "ReviewID": "UR686926860", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "bimeyer"}, {"Content": "J'adore !       la psicine ... de jour", "Date": "Oct 28, 2008", "ReviewID": "UR544781001", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "sylvieandco"}, {"Content": "Bel h么tel de plage   showReview(20699399, 'full');", "Date": "Oct 7, 2008", "ReviewID": "UR602878627", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Berthe"}, {"Content": "La grande classe       La plage", "Date": "Sep 26, 2008", "ReviewID": "UR686213784", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "KaRbOuiLLe"}, {"Content": "No es un hotel de cinco estrellas   showReview(19004034, 'full');", "Date": "Aug 16, 2008", "ReviewID": "UR990020754", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "3"}, "Author": "vietnam48"}, {"Content": "Expectacular       piscina", "Date": "Jul 22, 2008", "ReviewID": "UR636761059", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "majorSantCugat"}, {"Content": "Bel hotel   showReview(15668954, 'full');", "Date": "May 5, 2008", "ReviewID": "UR232511690", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "ParisRobert"}, {"Content": "銇熴仩銇层仧銇欍倝闈欍亱   showReview(19169439, 'full');", "Date": "Mar 12, 2008", "ReviewID": "UR235884122", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "tr猫s bel endroit       La plage", "Date": "Mar 5, 2008", "ReviewID": "UR396573226", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Margaux-Paris"}, {"Content": "Sehr angenehmer Aufenthalt!       Strand", "Date": "Jan 28, 2008", "ReviewID": "UR933229143", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Sasse"}, {"Content": "El paraiso existe en el jimbaran puri bali       playa del hotel", "Date": "Dec 14, 2007", "ReviewID": "UR614535498", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "jabali"}, {"Content": "Un endroit de r锚ve 脿 Bali   showReview(11293512, 'full');", "Date": "Dec 7, 2007", "ReviewID": "UR631803131", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Virg17"}, {"Content": "Magique !!!   showReview(8659040, 'full');", "Date": "Sep 5, 2007", "ReviewID": "UR541668391", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "emi92390"}, {"Content": "Excellente adresse       notre chambre", "Date": "Aug 26, 2007", "ReviewID": "UR231867227", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "crounious"}, {"Content": "鍒ヤ笘鐣?#x201d;   showReview(19163429, 'full');", "Date": "Aug 23, 2007", "ReviewID": "UR809008793", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Le vrai luxe   showReview(8434759, 'full');", "Date": "Aug 16, 2007", "ReviewID": "UR319964789", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "docmesa"}, {"Content": "Tranquilidad al lado del mar   showReview(7988844, 'full');", "Date": "Jun 25, 2007", "ReviewID": "UR120413664", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "aquaGirona"}, {"Content": "La classe !   showReview(7323717, 'full');", "Date": "Apr 10, 2007", "ReviewID": "UR786288752", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "joligathor"}, {"Content": "銈搞兂銉愩儵銉冲湴鍖恒伄銇欍仸銇嶃仾銉偩銉笺儓銉涖儐銉仹銇?#x201d;   showReview(19160062, 'full');", "Date": "Jan 22, 2007", "ReviewID": "UR738309759", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Jimabran Puri Fantastic       Piscina", "Date": "Dec 12, 2006", "ReviewID": "UR504031384", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Baliamor"}, {"Content": "銇倠銇广亸鏃ユ湰浜恒伄灏戙仾...   showReview(19922508, 'full');", "Date": "Oct 29, 2003", "ReviewID": "UR752138115", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297696-d301739-r23233286-Jimbaran_Puri_Bali-Jimbaran_Nusa_Dua_Peninsula_Bali.html", "HotelID": "301739", "Price": "$331"}}