{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tehran", "Title": "“Great business hotel”", "Author": "Amiralij", "ReviewID": "UR128318429", "Content": "Excellent property and there is nothing to complain. I stayed there for 6 nights and it was quite comfortable stay however this has to be kept in mind that this hotel is excellent for business travelers and is far from tourist attractions therefore can be boring for those who are there for vacation.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent and good food”", "Author": "timetraveller64", "ReviewID": "UR127872796", "Content": "i stayed here one night on a business trip. good size rooms, excellent wifi and the breakfast was superb. only down-side was that i had an executive room which has access to the corporate lounge which I used in the evening, however, when i wanted t have breakfast next morning they told me the whole lounge was bookd for a private function so i had to take breakfast in the main restaurant, not a trainsmash but annoying. good location as well.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Deserves 5 star? Not sure”", "Author": "doliche", "ReviewID": "UR127419099", "Content": "Rooms are relatively small comparing with other 5 star hotels of istanbul. Besides, it is noisy, you hear every noise from next room and from upper floor. Everything is excluded from the room price, including tea bags. Best thing is the location, very close to metro station and easy access to Taksim. Not value for money.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tehran", "Title": "“A Levant located business center Hotel”", "Author": "Hamid F", "ReviewID": "UR127031174", "Content": "My second time stay in this hotel was longer than first one, so I could find time to use the facilities in this hotel such as smwimming pool, Barber, tea and... Serve center corner and a lot of other as well. Overally hotel is very suitable for business trip. I have been in another Hotels in this street which is not very touristic region of Istanbul, I can say it is also one comfortable to stay, specially when you want to access other parts of city by metro. The rooms are clean, Service is very good, Spa center is nice.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent!”", "Author": "Khaledmarei", "ReviewID": "UR125933217", "Content": "The Moevenpick Hotel Istanbul is excellent especially for business travellers as it is located in Levent, the business hub of Istanbul. The rooms are great, food is excellent and there's an underground station right around the corner. I strongly recommend it.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Best Business Hotel”", "Author": "PicaLebanon", "ReviewID": "UR125778790", "Content": "The best business hotel, best location very convenient and accessible, rooms are very spacious and clean, employees are very well groomed and helpful, swimmimg pool is so clean, very wide variety of international food in breakfast.free internet, i like this hotel and will definitely visit again.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Superb business hotel”", "Author": "Nicolas M", "ReviewID": "UR125606236", "Content": "Rooms are as expected for a Moevenpick-hotel. What needs to be highlighted are: - the very stylish swimming pool area with its jacuzzi - outstanding breakfast with so many different specialities as it is not located in the touristic areas of Istanbul, it suits more for business trips.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Delhi, India", "Title": "“Business hotel”", "Author": "Rahuld74", "ReviewID": "UR125192814", "Content": "The hotel is located in Levent , where most of the business district is , so if you have bank / corporate meetings it is a good location. The hotel is right on the metro station so thats great because you can go out in the evening to taxim without worrying about the traffic times. it has a nice spa/gym/pool also which appeared quite reasonable but i did not have the time to use the facilities. Breakfast was nice but quite predictable and they used to have the same menu ( more or less) , however they would make eggs cooked to order so i did fine. The bar is great for a evening drink and quite reasonably priced. In stanbul english is a bit of a problem as not many people know english properly so even when you go out you should know where you are going as difficult to communicate. Overall dont stay here if you want to be near the sights or entertainment as it is quite a dull hotel in the evening and nearby also i could not find any entertainment. Its near to Metrocity mall so thats one advantage. People talk about the noise from the main highway and i would say if you are on a higher floor then its not really bad. The option to upgrade to exec is good as internet is seprate and if you add internet cost to room cost then the difference of upgrade was just 20 TL a day", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“Excellent hotel in business area”", "Author": "Skuatakin", "ReviewID": "UR123742636", "Content": "Very good hotel, excellent service. Rooms are very clean and neatly decorated, spacious enough. Shower is in the bath tub, which is not so convenient. Very good bed, a choice of pillows available on request. A Nespresso coffee machine available in the room, but coffee capsules not complimentary. Apart from a shopping mall nearby, not much tourism in the vicinity of the hotel. Main attractions are far away. Viem from the hotel is over a busy highway or industrial buildings. This unpleasant environment is not a problem if on business and you are close to your meeting point. But it costs this hotel its 5th star.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Modiin", "Title": "“Very comfortable rooms and beautiful hotel”", "Author": "Avargasil", "ReviewID": "UR123733466", "Content": "The hotel is good, the level of service is high. Im always hungry when getting to the Hotel, the room had a selection of fruit and chocolates that was very welcoming. I had also complementary internet, and a variety of nespresso fine coffe selections (not free). The Spa had a small gym and beautiful pool, the pool water was quite cold. The restaurant is good, they had only one vegetarian course, it was excellent, but a vegan like me has not real food options. The personnel was fine, some very welcoming, some cold. The main entrance is small so getting a taxi may be difficult if there are several persons waiting.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Business hotel with a nice Swiss touch.”", "Author": "jnp79", "ReviewID": "UR123704094", "Content": "Breakfast was great by demanding standards. Rooms impecable All business facilities. Go for it on business. For couples better to elasewhere in a more charming hotel as this one is a big tower", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Town, Western Cape, South Africa", "Title": "“Good business hotel”", "Author": "David H", "ReviewID": "UR123594753", "Content": "Large hotel with good facilities. Busines centre, Gym e.t.c. Its in a good location for a lot of the business' in Istanbul. Make sure you book an exectuive room as you then get use of the business loounge on the 20th floor for free. Food is good quality and service also attentive. This is now my hotel of choice for buisness in Istanbul.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hilversum, The Netherlands", "Title": "“Great hotel close to malls and metro”", "Author": "Linda P", "ReviewID": "UR123246327", "Content": "The Moevenpick Hotel in Istanbul is a great hotel away from the hassle of the central tourist area. The traffic is very busy during the rush hour every morning and evening, but if you are not afraid to travel by metro, you are at Taksim square in no time - there is a station right next to the hotel. Also right next to the hotel is the newly opened Sapphire Mall with many great stores. A little further is the Kanyon Shopping Mall which includes a big, modern cinema and then there is also the Mall Metrocity another 400m further. So even when you don't feel like sightseeing, you won't be bored. The staff was always smiling, friendly and helpful. Their friendliness really made my day. Also, we never had to wait anywhere, at the reception, in the restaurant or in the lounge. The view over the business district is great. You really feel that Istanbul is an unbelievably big city. Even though there is a major road next to the hotel, this didn't disturb me while sleeping. But maybe that was because the bed was so comfortable! Just like the armchair, my personal favorite. The bathroom was also nice and spacious, with lots of amenities and a cute yellow duck, apparently the special touch of every Moevenpick Hotel. The glass window between the room and bathroom was also a funny touch, but luckily we could close the blinds. It was always very clean and the towels were replaced every day. It is a shame if you have trouble eating in the morning, because the breakfast is very extensive and delicious. Either way, you will get your fair share of vitamins without any trouble. Fresh juices and different types of fruit are always ready - peeled and sliced. A great start of the day! On a less healthy note, I also really loved the chocolate fondue, only available in the winter time (until the end of February). This was definitely worth its price. Though overall, the prizes for food, drinks and services are on the high side. This was the only downside for me.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Great hotel but not so great location”", "Author": "Susannah M", "ReviewID": "UR122923298", "Content": "Great hotel - friendly service, good food, clean bedrooms. But location is not that central - you need to get a taxi and the traffic is always terrible, especially if it is raining or there is a football game on as you are right next to the football stadium.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“Good location, nice hotel”", "Author": "zkashan", "ReviewID": "UR122607043", "Content": "My wife loved that it was \"Movenpick\" we order their ice cream and enjoyed breakfast. It is close to a move and right on top the train station. But we warned, You'll have to take three trains, thus pay thrice to get to Sultanahmet. On may day taxsim station en route was closed, and we had to get ouf the station mid way kind of at a random stop which led to nowhere. Neverthless hotel was luxurious, albeit we requested a high floor multiple time - which they never had during our stay.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Used to be great, gone downhill.”", "Author": "SergioRiodeJaneiro", "ReviewID": "UR120908090", "Content": "I often stay at this hotel but this trip the staff all seem demotivated so Im not sure what has gone wrong but in a 5 star hotel, its the staff and service that make the difference not another pillow menu or complimentary fruit basket! Will try somewhere else next time.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Weybridge, United Kingdom", "Title": "“Impeccable Service”", "Author": "Hellimli", "ReviewID": "UR120418962", "Content": "We had the chance to spend a lovely weekend away in Istanbul and chose Moevenpick after reviews. We were welcomed by the guest relations lady who was brilliant to answer our questions on what to do where to go in 2 days. The reception staff were truly professional and when we arrived in our room it was well appointed and stocked with all those little things that matter that you forget to take with you on a trip. Perfect. The wi-fi worked well and put us in touch with family and friends back home. The hotel is right next to a metro station and so convenient to travel on to go to the old city and Taksim square. There are a couple of modern shopping malls around the hotel as well. The breakfast at the hotel was plentiful and delicious looking which we (well mostly my better half) enjoyed. On day one, I could not find alternative pastry or breads or lactose free / soya milk due to my lactose intolerance but once mentioned the guest relations made sure it was provided the next day. Impeccable service at a top notch hotel.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Perfect for business trip”", "Author": "romandavydov", "ReviewID": "UR120360672", "Content": "I like it very much after short stay for business event in this luxury hotel. Room was nice, clean and modern. All the amenities you need during business trip. Few malls outside. Far from historical center of Istanbul, but in business part of the city. Nice view from upper floors. Located in few minutes from station of metro. But far from the airport, about 50 TLR by taxi (about 50 USD).", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Zurich", "Title": "“Good choice for business”", "Author": "lacadu", "ReviewID": "UR120299545", "Content": "Great location for business. Rooms are always clean, bathroom spacious too. The breakfast area is a bit cramped and selection OK (have seen better) and fresh fruit always available. Waiters always around to ensure quick in and out if necessary. Trained and efficient personnel at reception too. Very Heavy traffic at times so plan journeys carefully especially at rush hour.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Amazing luxury hotel”", "Author": "Catherine H", "ReviewID": "UR120174677", "Content": "We had an amazing and luxurious weekend at this lovely hotel. The room was gorgous with everything you'd expect from a 5* hotel: amazingly comfy bed/pillow, brilliant bathroom, lots of free extras (toiletries, drinks etc.), many TV channels, DVD player on request (although the DVD selection was quite limited and old), sound-proofing, and all-round excellent service and facilities. Food at the Moevenpick was all delicious, filling and high qulaity. The breakfast was to die for! With both Western and Turkish tastes catered for. We also had cake and coffee in the lobby, the coffee was great and the chocolate cake melted in the mount. We had room service too one night; it was quick, hot and really good. They even included a couple of complimentary desserts for us. The use of the leisure facilities was included: the swimming pool and jacuzzi were both lovely and very quiet. No screaming kids which was great for a couple's break. Best of all was the view, I think we were maybe on the 10th floor and we could see over the whole of Istanbul. Very romantic! another nice feature for couples is the glass window between the shower/bath and the bedroom. A fun feature and there was blind you could easily close if you preferred privacy. The only drawback was the expensive price of everything in the hotel, but that's what you expect from a 4/5* hotel. Although the price of internet in the room was extortionate and when we got the bill they tried to charge us for a week internet pass which we definitely hadn't purchased. But as soon as we explained this they removed the charge without a problem.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely hotel in the middle of shopping area and business district”", "Author": "safaricakes", "ReviewID": "UR119613028", "Content": "I stayed in the hotel with my other half for four days and enjoyed everything about it. The rooms are nice with new furniture. The gym is lovely, the spa area is superb, the beauty salon is very good. The top floor bar shuts a bit early, I must admit, but the bar downstairs is nice. The hotel is located just behind 4 Levent metro stop, a minute away from Sapphire shopping centre. You can walk (takes about 10 minutes) to a bigger shopping mall - Kanyon shopping cente (or take one stop by metro to Levent metro stop). Overall, I've enjoyed my stay at the hotel and would be happy to recommend Moevenpick to anyone.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "virginia", "Title": "“Very Good Hotel”", "Author": "firemanstep", "ReviewID": "UR119573919", "Content": "The hotel is in the business district, I was there for work. I stayed 7nights. Its kind of weird, there were no troubles or anything like that, the food was GREAT but there is where it stopped. Now dont get me wrong, its a very nice hotel. The Staff are wonderful, The foood was GREAT, but it stopped there. The hotel is in very good repair with all the things you will need, but it just did not hit the 5 star for me. I cant explain it either. The lounge that serves the executives was closed almost every day I was there for a private event, and the times they listed for the events were not even close. I would stay there again with no problems though. Oh and if you leave the breakfast buffet hungry, its your own fault, you will not be dissapointed with the quality and service of the foodies...", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago,Illinois", "Title": "“Leasure trip at the Moevenpick...”", "Author": "Jett_Travel", "ReviewID": "UR119527254", "Content": "The Moevenpick is what you would expect from a 5 star hotel. We stayed 3 nights during a leisure trip and had no problem using the fantastic metro system which has a stop right outside the hotel. Within 15 minutes you were in Taqsim and within 30 minutes (and 2 trains) you were in Sultan Ahmet. After staying in the tourist crazy Sultan Ahmet area the first part of our trip it was a treat to be able to get away to our little Istanbul oasis which was the Moevenpick. You have a bar, pool and courtyard to enjoy some private time away from all the craziness. Service is not a issue here... A great example...Breakfast ends at 11:00AM everyday and at 10:58AM a family of 4 shows up all late about it. Even though the staff had already broke down the buffet they proceeded to restock the entire buffet just for this truant family. It was a great choice by the staff and they should be reconized for it.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "oxford", "Title": "“Good Hotel In Business District”", "Author": "davidhynd", "ReviewID": "UR119469319", "Content": "Large hotel with good facilities. Busines centre, Gym e.t.c. Its in a good location for a lot of the business' in Istanbul. Make sure you book an exectuive room as you then get use of the business loounge on the 20th floor for free. Food is good quality and service also attentive. This is now my hotel of choice for buisness in Istanbul.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Very pretty hotel a couple of tube stops from Taksim”", "Author": "yellowduck", "ReviewID": "UR119400285", "Content": "Stayed here with my boyfriend for a weekend. The hotel rooms are quite spacious and nicely decorated, the bathrooms are very modern, the service is discrete, polite and good. Breakfast was amazing. Lots of choice. Downsides were the noisy slamming doors (you can everybody and anybody leaving and entering around you) an overly busy breakfast room (it was impossible to find a clean table when we got there), and some errors in the bill (which were immediately corrected without any discussion) -- still, despite all this I would rate it very good.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Chatham Township, New Jersey", "Title": "“great business hotel...a bit far from city center”", "Author": "Barbarita58", "ReviewID": "UR119263636", "Content": "Was on an escorted tour, guaranteed deluxe hotels throughout, but did not realize that these delux hotels would be half an hour from city center, then with traffic in istanbul, at the end of touring all day, took forever for the bus to return us to this hotel...I understand that you would have to take two forms of public transportation to get to the Movenpic from Istanbul.... The service was wonderful, the rooms were fantastic, all was great, wonderful outdoor covered seating near restaurant and great breakfast. They also had an incredible concierge floor, with access to a magnificent rooftop bar with incredible views, serving happy hour. would definite recommend, but you just have to keep in mind the distance from the city...its ONLY drawback.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paducah, Kentucky", "Title": "“Very pleased”", "Author": "Worldtravel769", "ReviewID": "UR119151322", "Content": "I had the pleasure of staying at the Movenpick Hotel during a business trip to Istanbul an was quite pleased. The front desk staff was helpful, but not overly personable. The lady at the concierge desk was very personable and quite helpful with any questions. The staff in BarAdoX were very friendly and quite a pleasure to talk to after the long flight from Chicago. Breakfast and supper in AzzuR Restaurant was very good. I cannot remember the name of the host at supper, but he took a personal approach to making everyone feel welcome as did the waitress. I was thoroughly impressed with the selection and quality of the breakfast. As for the room, it was quite modern and simplistic in accordance to Swiss style. The room along with the hotel was immaculate. Overall, this is an excellent hotel that I look forward to staying with again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Incredible service”", "Author": "stevenekuhn", "ReviewID": "UR119027686", "Content": "I was called to Istanbul for a short business meeting and was put up in the MÃ¶venpick hotel. I know them from Germany and they are a medium service category...NOT IN ISTANBUL! Not only was I personal brought to my room, I received an upgrade and many free services for which I would usually have to pay: Free water, WLAN etc. I went to have a late dinner upon arrival and to my surprise there was a Tai Food buffet as well as other goodies. I thoroughly enjoyed my stay and was ever impressed at the level of service, but more impressed with the attitude to go above and beyond the normal level of service. A great stay, a pleasure to speak with the staff and a wonderfuly beautiful hotel.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice business hotel”", "Author": "caddoboy", "ReviewID": "UR118930274", "Content": "Good hotel if you are in town on business as it is close to airport and several large shopping centers where you can walk and get dinner. The old city is quite far by taxi, but still worth the effort. Best place to go nearby is Reina (nightclub and restaurant) on the Bosphorus....only a 20 TL cab ride away.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Really wanted to click the 'good' button as missing a few personal touches!”", "Author": "meellis_7", "ReviewID": "UR118562746", "Content": "From never having visited Istanbul to have now come back to this colourful city twice in one year was quite exciting, as my close friend was getting married this time. The actual bride (my g/friend) actually selected this hotel for us so thanks Nikki!! as all in all it was a good experience. The general manager was kind enough to take time out and talk to his guests which is a great personal touch, it was just a shame that this type of hospitality does not disseminate down to all hotel staff, ie. my boyfriend sat in the garden for nearly an hour and no staff approached him to see if he wanted any refreshments, so off he went to the shopping mall nearby and grabbed himself some lunch!. When we did actually dine in the hotel the food was generally good, but again its that little attention to detail that for me lets this hotel down, for example if you order the mixed grill with a trio of sauces..don't forget the sauces pls and don't bring it out when you are reminded that you have forgotten the sauces near the end of the meal!! The only real bug bear for me was the wifi didn't work in the room and there was no sense of urgency to addresses this, which to me wasn't helpful as I needed to finalise some work and therefore couldn't relax at the beginning of our mini break!! Location was good for where we needed to be for the wedding but it is slightly out of the way from the heart of the city (unless you are visiting for business and then it is perfect being right in the centre of the business district). Rooms were spacious and interior was excellent. Question is would I comeback again, probably yes but won't rely on the wifi in the room!!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poland", "Title": "“Excellent for business travel”", "Author": "memo000", "ReviewID": "UR118475815", "Content": "Stayed 2 nights on business. Room is nice, the window to the bathroom is an interesting accent. Good gym, somewhat small but 6 or 7 treadmills, so you can still run since running outside in Istanbul is a challenge to say the least. Breakfast was good, with good selection of both hot and cold food. Location is good too. Kanyon shopping center is a 10-minute walk, with a couple of good restaurants there.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Perfect for Business Traveler”", "Author": "Goldi2011", "ReviewID": "UR118396656", "Content": "The room is spacious and quite clean. Well furnished with non old furniture. Room is equipped with complementary 2 water bottles, water boiler with tea/coffee amenities. I stayed only for a single night because they wanted to increase the rate to almost double my corporate rate, thus I did not have the chance to try the hotel facilities such as the pool or the spa though they seemed okay. Hotel location is close to Istanbul's commercial center and there is a metro station just beside the hotel entrance. I also heard there are two big shopping malls close to the hotel. Bottom line, I would come again whenever visiting Istanbul for business.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“higly recommended”", "Author": "kopicka", "ReviewID": "UR118097971", "Content": "The rooms were very nice, the beds comfortable and the staff very friendly.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Friendly, professional, comfortable, close to subway station”", "Author": "Fabness", "ReviewID": "UR118000808", "Content": "The staff were very friendly and the security was pretty good. They were knowledgeable and seems eager to help you at all times. Beds were really comfortable and the hotel overall looks quite new. Either that or that they maintain it really well. The subway is located just behind the hotel (Levent station), and there are lots of cafes, mini marts, and stores behind the hotel. Difficult to fault this hotel!", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good Hotel... 7 star service”", "Author": "AR_itani", "ReviewID": "UR117879573", "Content": "I have stayed in this hotel 4 times before and I have to say the rooms lost some of there charm from a couple f years ago. You feel the hotel is slightly coming to age would say a very small refurbishment is needed. The room I was in was spacious but the bed sheets had a stain the AC had a small leak. Nothing too serious that would ruin a stay. On the positive front the service was amazing the staff couldn't be more friendly and tier advice to get around Istanbul made this stay enjoyable. All there recommendations were spot on. My view of its ur first time in Istanbul that is tbe place to stay even if it a bit far which can be sorted by the 1 min away metro station or cheap cab fairs. I know that next time I am in Istanbul would stay there as value vs perks is worth it. I just hope they do a small room fix to bring it back tot he level it was 2 yes ago.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cairo", "Title": "“nice business hotel, close to many big malls”", "Author": "ssjordan23", "ReviewID": "UR117808722", "Content": "very conveniently served for business meetings, especially hi level with limited participants to 10 executives. nice treatment, handy business hotel. dont be misguided by the surrounding nearby, this place is very hot with all top companies of Istanbul. You can enjoy and head on to the beautiful nightlife without spending hours in the traffic. 30- 45 minutes away from the famous Istiklal boulevard next to Taksim square by taxi, only 15 minutes by the metro, 30 minutes away to hottest night clubs of Istanbul situated by the bosphorus. You dont pay zillions uf usd to jump into the city and the nightlife, quite handy and worth the money. dining is extremely elegant and they dont rip you for the famous Turkish cuisines. Gorgeous vies on the roof bar...", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Doha", "Title": "“Fantastic hotel!”", "Author": "Rosalee P", "ReviewID": "UR117391524", "Content": "Had a great time for 4 nights at the hotel, clean surroundings, friend staff especially at the restaurant - they attend to the customers very well. Food was really good, and the service - really the best! Will definitely come back!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Very good hotel , good location ... but wifi problems”", "Author": "BOnTheG0", "ReviewID": "UR117024763", "Content": "I stayed at the Istanbul Movenpick for 16 nights (for business). The location is good, 2 minutes walk from the main metro line. Breakfast was incredible, everything so fresh and service perfect. The only down side is the wifi service that is really expensive ( and I think that today , in 2011, a hotel of such standing has to offer wifi for free) AND the signal from the bedroom was so low that is was imposible to connect properly.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tehran, Iran", "Title": "“Highly Recommended Hotel”", "Author": "triplovers2012", "ReviewID": "UR116811934", "Content": "Hotel review in glance :*good location* very very very friendly and helpful staff especially reception and restaurant *very clean * well decorated * real five star hotel* good location * 2 minutes to metro station* near one of the best mall in Istanbul*delicious food, fantastic tea and baklava(turkish delight)", "Date": "August 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Good value”", "Author": "LeDave", "ReviewID": "UR116126014", "Content": "Stayed there for one night only. The location seemed decent, the room was nice and clean. The only negative point: for a high-value business hotel I expect to have a decent internet connection. At this price for the room internet must be included. Anything else is backwards. And the connection must be faster. It was so incredibly slow that I could not really work.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“A good business hotel”", "Author": "Philip J", "ReviewID": "UR115947095", "Content": "I visited the Movenpick in Istanbul in June 2011 for a steel conference. I had booked an executive room due to shortage of regular rooms, and upon arrival I was upgraded to a suite. The room was spacious and very clean, and the view was quite good. Service overall was up to standard, even though there were many people at the hotel at all times due to the conference. Breakfast was excellent, with a wide choice of European and Turkish foods. There is a wonderful garden to walk around, with tables for coffee, perfect to have meetings or to relax after one. Location could have been better for the tourist, as the hotel is not located close to the center and the main attractions, however, being a business hotel, this doesn't really matter. Overall a good choice for a business trip, and I would definitely visit again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“we'll be back”", "Author": "hafizm", "ReviewID": "UR115705041", "Content": "i have stayed for 4 nights in this beautiful hotel, the size of the room was great, children are free of charge, free baby cot, free extra bed when available, breakfast was great, sapphire mall is just beside the hotel ( very nice mall with food courts and supermarket ), they don't charge anything until the check out, i think this is one of the best hotels in Istanbul, i loved it", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Baku", "Title": "“Great Hotel!!!”", "Author": "PickyYay", "ReviewID": "UR115166267", "Content": "I have only and only great memories about this hotel! Istanbul is huge and location depens on your activities. If you came for a shopping then this is the right hotel. It it very close to main shopping malls - Kanyon, Metro city and it is not far to Istinya park. The hotel was close to our office so agency chose it. Rooms are great and pretty big! I really liked the bathroom with the window into room. It is very clean, calm and nice! There is everything you need in a mini bar. The breakfast is very good. Everything was fresh and tasty. The restaurant itself is very light and with lot of windows, even open-air terrace. So you can have breakfast outside as well. I have very good positive feeling about this hotel and will definitely come back!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bromley", "Title": "“Fabulous hotel but a way from the action.”", "Author": "BromleySimon", "ReviewID": "UR114807195", "Content": "Stayed at the Movenpick Istanbul in June 11. The trip was a leasure one and it is easy to see why this place is such a hit with the business community. It is very efficient and professional. The rooms are very comfortable and the facilities are superb. I would go so far as to say it is one of the better hotels I have ever stayed in. It could be perceived by some as being too sterile but it is a personal taste. I prefer that rather than a place that wants to be too \"familar\". The only drawback, and it is a big one if you are staying as a tourist, is the hotel's location. It is a long way from the old city. It involves getting 2 trains and a tram (if you don't want to get a cab every time) and takes between 45 mins and an hour. If you are only going to Taksim, it is only 1 train and about 15 mins. The metro station is very close to the hotel and Istanbul's public transport is exemplary. Very clean and efficient. As is the airport (Sabiha Gokcen) which is again a bit of a distance from the City. As a weekend destination, Istanbul is wonderful. The Movenpick is a wonderful hotel but as a combination, maybe not the best combination.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hillerod, Denmark", "Title": "“My best recommendations”", "Author": "HenrikRJ", "ReviewID": "UR110667046", "Content": "Loved it. It is a little away from the tourist sights, but if you have busines in this area or don't mid 5 stops on the underground it is a very nice choice. Room was nice and bed was very comfortable. Great bathroom. And the best part: Breakfast, one of the nicest breakfast buffets I have encountered.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "athens", "Title": "“Should not have to apy extra for internet and tea.”", "Author": "hillwod", "ReviewID": "UR100239036", "Content": "The location suited our business purpose. Good spacious room although a bit on the pricey side. Objected to having to pay 20 euro per day for internet access and for tea. Drinks at the bar were also pricey. It left me feeling rather neutral and I will be staying elsewhere for any future business trips to Istanbul.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Full of Eastern Promise ........”", "Author": "Neptune24", "ReviewID": "UR97068385", "Content": "The hotel is situates in Levent which is the more modern part of Istanbul's European side. It is located by high rise offices, banks and apartments. It is close to the newly constructed metro line and close to verywstern shopping malls such as Kanyon. The hotel has an impressive lobby and large breakfast room. The rooms were well appointed. One of the best features of the room was the extensive coffee and tea selection available. The bathroom had good toiletries and had a bath and overhead shower. The room was a good size and comfortable. The TV had a wide selection of channels too. We had bathrobes, slippers and fruit bowl in the room - nice touch. Only once did we get the turn-down service at night. The internet was expensive. There was a swimming pool and spa etc but we had no time to use it in our hectic schedule. The top floor had good views if there was no cloud.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hove", "Title": "“Fabulous time in Istanbul”", "Author": "MonicaW_8", "ReviewID": "UR87521856", "Content": "Istanbul is amazing, and our stay at hotel moevenpick was EXCELLENT, the Suite was really comfortable and beautifully done, we loved all the touches in the room, and being on the 13th floor it had the best views over the City. Excellent bar, delicious breakfast and excellent room service dinner. The staff were really sweet and every one was really helpful and really made us feel welcome. The bar staff are really brilliant, and not just bog-standard robotic as i found in many other places. Short taxi ride to the sights and seaside. Weather was amazing and we were able to sit in the garden for breakfast which was super. Had a peak at the pool and gym etc, which looked great, just didn't have a chance to try it, because had so many nice things to do! We LOVED it! Thank you very much everyone at Hotel Moevenpick", "Date": "November 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Great Hotel in Istanbul for Business”", "Author": "busstraveler85", "ReviewID": "UR81563955", "Content": "I just stayed at the hotel last week with a few of my colleagues and have to say, I was pleasantly surprised. We had been looking for rooms in Istanbul for about a week and all of our regular hotels were overcapacity (Four Seasons Bosphorous,Kempinski, Swissotel, etc..) We all happened to be staying in Executive rooms which were nice and spacious, with a living room area, etc.. Although we were only at the hotel late at night after a long day's work and early morning for breakfast, the hotel was great. It's clean, in the business district, cabs are available on the spot, and the doormen were extremely helpful. Highly recommend this hotel for anyone in Istanbul on business.", "Date": "September 30, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Woking, United Kingdom", "Title": "“Great stay”", "Author": "jayandpen", "ReviewID": "UR80511749", "Content": "We stayed in June, when the weather in Istanbul was unseasonally wet! The hotel staff were very helpful and allowed us to view three rooms before we chose the one that suited us best. We wanted a non smoking floor and we got one but be aware that customers do not always obey the rules. Occasionally the corridor smelt of tobacco smoke. The waiting staff in the restuarant were always very friendly and welcoming. We loved the turkish tea served in Turkish tea glasses. The doorman gave us helpful advise as to how to get around the city and ehere to visit. Generall we found the people of Istanbul ppolite and helpful to tourists We would definately go back to Istanbul and to the Movenpick.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“A good hotel in the business district”", "Author": "sibinatenein", "ReviewID": "UR77648371", "Content": "My colleagues and I stayed at movenpick for a month long business trip last Mar-Apr, 2010. The location was very convenient, as the office we were working at was only 10mins away by walking. The hotel is very near the MTR station, so there were no problems in public transportation, cabs are also readily available, the hotel staff can help tranlate to the cAB driver where you want to go. food at the hotel was ok, although if like us, you are staying with them for a month, the food gets old really fast! there aren't that many restauants around the area either. but all in all, finding a place to eat in the area is not so bad. there's mcdonalds, dominos pizza, kosebasi and venge nearby. hotel staff are friendly enough and most of them speak good english, which is a big plus! i guess the biggest UGH moment i had was with the hotel housekeeping staff! they kept moving my toiletries around, so i couldn't immediately find what i wanted when i needed it. also, after 2 days of stay, they took away the hotel robe, which i had to ask the front desk to send back to me. other than that, our month long stay was convenient enough. i almost forgot, internet at the hotel is NOT FREE!! =(", "Date": "August 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Perfect Stay”", "Author": "DELETE1642", "ReviewID": "UR75868758", "Content": "I had the chance to stay at the Movenpick Istanbul and I was thoughly impressed with the overall Quality of the hotel. From the check In to the Check out all staff where very helpful and friendly.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“A very pleasant surprise”", "Author": "Little_Elv", "ReviewID": "UR67990604", "Content": "We were planning a weekend getaway to Istanbul when a friend suggested the MÃ¶venpick. We shopped around and realised we could get a good deal for the weekend. As we know Istanbul a bit, we decided that even though the hotel is not near the main tourist attractions, the deal seemed pretty good and booked it. The experience was above our expectations in all aspects! The hotel is impeccable. Service, quality of rooms, attention to detail is all you would expect from a 5 star hotel, and more! The size of the rooms in particular (we stayed in a superior room) should satisfy even the most picky traveller. As it turned out, the hotel is located in the business district. However, with the metro (there is a stop at the hotelâ€™s doorstep) we could get to Taxim probably faster than from some hotels claiming to be in Taxim! Also, it turned out that the area was very convenient to go to some of the gems of the Bosphorus, such as Bebek. We didnâ€™t use many of the hotelâ€™s food facilities, as we were mainly eating out. We did have our dinner in the hotel restaurant on the first evening though. The food was excellent. However, the place seemed quite empty, and the atmosphere was accordingly quite toned down. The only criticism one could have would be the lack of complimentary in-room coffee and tea, and possibly the fact that there was a (rather steep) charge for internet access.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean but there are better in Istanbul and I object to paying for a teabag in room!”", "Author": "Kentish", "ReviewID": "UR63559385", "Content": "Positives - as expected with this brand, immaculately clean, comfy bed, quality finish and gadgets in room. Business district (and easier for the airport), but tram stop very close and the quickest way if going right into town rather than taxis, but no wait for a taxi when requested. Breakfast buffet good selection. Small but tranquil basement pool, jacuzzi and sauna, open until 11pm. Negatives - could still hear traffic noise from the 19th floor, Nespresso machine in room for extensive range of teas inc herbal and coffee - beware as these are all charged for. I expect either for free in my room or a room service charge for a tea/coffee delivered if no own facilities at 5 star, was very surprised and disappointed by this and would not have realised but for looking at minibar price list and eg the per teabag charge is unobtrusively at the bottom. Also beware the promoted Bar Happy Hour - 50% off a second drink. What they fail to mention is that it is per person, not per round of drinks. Misleading ambiguity once might be forgiven but twice suggests deliberate. \"Club\" package pushed at check in was just to cover cost of breakfast and extortionate internet package, not lounge or room upgrade and was declined. Nothing special about this hotel, better competition in Istanbul and won't return given a choice.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Terrific address for business travel in Istanbul”", "Author": "thielees", "ReviewID": "UR53587650", "Content": "This hotel really works, right down to the discreet \"Swiss\" atmosphere of polite distance but very reliable service. The hotel is modern and beautiful. The reception and lobby are done as a granite arcade, the restaurants, bars, and rooms are done in an adult contemporary style that leaves no detail neglected. The immediate surroundings of the hotel are not brilliant, it's on a busy avenue with office buildings all around, but a 5-minute walk takes you to the Canyon shopping center, and another five minutes from there is a friendly neighborhood with plenty of shops and restaurants to choose from. The metro is also within minutes' walk. One touch that I really appreciated was the superb shoe-shine service (the male equivalent of a manicure). The first decent one I've had in Eurasia... it was a relaxing and professional job that left my tired shoes looking better than when I bought them. Give it a try.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Asia", "Title": "“Great Hotel- don't mind the staff at the reception counter”", "Author": "MamamiaAsia", "ReviewID": "UR51364302", "Content": "i suppose this is a business hotel, the staff are not very helpful with extra information. They are efficient with check-in, check-out, exchange rate etc. The hotel is really good,by my standard. Equivalent to the Renaisance class. You get rooms in clean condition, whatever that is suppose to be in the room, is there. An extra mention, the waiter at the breakfast lounge was great. He's always serving with a smile, not discerning. -We obviously r not businessmen, with kids in tow and cashual dressing etc... he's never given the look. Anyway, the experience is great....", "Date": "December 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Tehran", "Title": "“Beautiful and Charming”", "Author": "ysn59", "ReviewID": "UR37036175", "Content": "I have been to Istanbul several times and I stayed in other hotels.I am really impressed by Movenpick decoration and beauty.I also enjoyed the meals and restaurant. Unfortunately some reception staff are not friendly and helpful.Another weakness is elevator which need room card for operation.It makes trouble when one stays in room and other one goes out! There is no access by stairs to rooms.Internet access is not free which is big weakness for a 5 stars hotel.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“Great pick for Istanbul”", "Author": "JPAtlGA", "ReviewID": "UR36932771", "Content": "Stayed at this hotel with my teenage daughter in July 2009. I thought the staff and service were both excellent and would definitely stay there again. While not in the heart of the city, the location is easily accessible (train to Levent II) and taxis are EVERYWHERE and cheap in the city.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bad Windsheim, Germany", "Title": "“Very nice hotel but pricey”", "Author": "ruandrettert", "ReviewID": "UR33561194", "Content": "I have been on a business trip in Turkey for 2 days. As there are construction works on the bridge between the continent, we stayed on the European part in this hotel. We did not try the food (except breakfast) nor the bar or any other facilities so I can only give my opinion on the room and the staff. The rooms were spacey and comfortable. The bed was nice and big, the bathroom was excellent. There is a window in the bathroom through which you can see your living room area. You can of course shut the blinds of the window but I find this a nice gimmick. The minibar has everything you need, you even have a Nespresso coffee machine to make your own coffee. The TV has many stations, there are local, Arabic, Japanese, Russian, German, English stations and more. The staff was always friendly, also breakfast was nice and had a huge variaty of choices. All in all the hotel is a good choice but has a relatively high price.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Just ok”", "Author": "sti5brigade", "ReviewID": "UR32784323", "Content": "Out of the way Rooms ok, small nothing special Location poor, it was near my offices but you dont stay there as a tourist. If you want a good location stay at the W Quite expensive, one of my colleagues was staying at the W and it was cheaper and in a better location Breakfast poor........ dont cater for Western travellers - very localised, I didnt recognise most of the food Wouldnt stay again but ok if you are staying a night and going from the office to the hotel I guess", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Fantastic, but a little bit overpriced”", "Author": "ACampos", "ReviewID": "UR26613559", "Content": "I have stayed in this hotel six or seven times, and I will stay there again on my next visit since everything in this hotel is flawless. THe hotel is new, reason why you will find everything in perfect conditions. Rooms are large, with nice badrooms, and fantastic beds The staff is very helpful all the time The breakfast buffet is very good, however dinners \"a la carte\" are very expensive, although the food is always great. My recommendation would be to definitely stay there, have the breakfast in the hotel, but do not have dinner there, unless is absolutely necessary, there are a lot of better options in Istanbul.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great deal during promotions”", "Author": "Mindtrust", "ReviewID": "UR25648460", "Content": "We took advantage to live here during new years when they had a special promotion since they had no business guests during that time the price was more then ok. Our room was big, modern, clean and had everything you need and the breakfast was really great with lot's of choices and the staff was friendly and their pool and sauna was more then ok also. I would recomend this hotel if you don't want to live in the middle of the tourist area, it's easy to get to taksim with the subway which is just infront of the hotel and from there you can go on to see all of the local attractions!", "Date": "March 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Athens", "Title": "“Would not go again”", "Author": "voyageuseAthens", "ReviewID": "UR22604133", "Content": "I travel a lot for business and I always stay in 4 and 5 star hotels. I was very disappointed by certain things in Movenpick, which in my opinion are unacceptable for a hotel of this price range and reputation. Firtsly, the staff spoke little english, it was hard to communicate. Secondly, it was extremely overpriced. One bottle of water in the mini bar costs 7 euros! And finally the level of cleanliness was unsatisfactory. I would not recommend it", "Date": "December 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Stockholm", "Title": "“One of the best in Istanbul”", "Author": "saffa_al_khalili", "ReviewID": "UR20896743", "Content": "Hi I'm a frequent traveler, and have visited Istanbul seven times this year alone. The last five times I have chosen \"The MÃ¶venpick\" for its outstanding excellence. The Hotel is fault free in my opinion. The fantastic breakfast. Tthe really good service; always with a smile. The clean spacious rooms with the great bathroo. The many facilities offered and the exceedingly helpful valet service. Not once had I noticed, any of the staff trying to get a tip or even waiting for one. I advice everyone to stay at this Real 5 stars Hotel, when they are in Istanbul. By the way, the Metro station Levent 4 is less than 5 minutes walk, and the frequent trains take you to Taksim in less than 15 minutes. I've been living in Sweden for more than 10 years and highly appreciate good living, and this hotel does it's best to offer that. The only negative things I can think of is the small TV, and the local area behind the hotel, and that adds a little colour to one's visit to this great city.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Carlisle, United Kingdom", "Title": "“Almost - but only almost - perfect.”", "Author": "Heavenl1y", "ReviewID": "UR17833088", "Content": "This hotel is fantastic. From the welcoming staff in immaculate uniforms, to the valet parking service, to the smart and clean rooms, to the key operated lift - everything was as you would expect from a 5* swiss chain. We were disappointed, though, to find that not everything was perfect. On our second day, the mini-bar was not refilled, and it took 2 requests to housekeeping before we were brought the wrong items: and a further 20 minutes to get the correct items. There is a pillow menu in the room, but having a different pillow delivered also took 2 requests and 24 hours wait. The restaurant food is superb, outstanding and reasonably priced. The service staff tend to be a little over-powering in their desire to please, but I'm not sure that's really a complaint! However, the weekend is quiet in the hotel, and with an empty restaurant the quality of service drops dramatically. It took 2.5 hours for a 2 course meal - which is stretching one's patience a little! Having said that, when we mentioned our concerns at check out, we were dealt with quickly and efficiently. We were invited to a conference with the duty manager, chef and F&B manager who listened with genuine concern. They were apologetic, friendly and seemed keen to know how they could improve. Unlike some hotels, I really felt that they would actually take notice. I didn't feel as if I was being 'fobbed off'! They also didn't offer discount on the bill which is so often the easy option in hotels of less quality. Overall, I'd recommend it. The location is great, and whilst it is expensive, it's worth the money. It's not perfect - but it's trying very hard to be.", "Date": "July 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London", "Title": "“Bad location for sightseeing”", "Author": "adamandterri", "ReviewID": "UR17784204", "Content": "This Hotel is located in the financial district which is 20 minutes by metro to Taksim, the main shopping and sightseeing area. This area is currently being developed, hence there is a lot of building work locally. There is one good shopping mall, Kanyon Mall 10 minute walk away which contains several shops and restaurants. We found nothing else in the area for tourists. Hotel is situated on a very busy main road and prices in the bar were extortionate. Staff were helpful and friendly.", "Date": "July 11, 2008"}], "HotelInfo": {"Name": "Moevenpick Hotel Istanbul", "HotelURL": "/ShowUserReviews-g293974-d301906-Reviews-Moevenpick_Hotel_Istanbul-Istanbul.html", "Price": "$183 - $369*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Buyukdere Caddesi</span> | <span class=\"extended-address\">4 Levent</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34330</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "301906", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/ee/7deefe12a128f0b5ba634f9ad8f2fb3b4large.jpg"}}