{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Average Hotel for Business Visits”", "Author": "GaryWalter", "ReviewID": "UR139900699", "Content": "Regal Hotel in Causeway bay is a reasonable business hotel. Its nothing great, but for Causeway Bay, it is way better value usually than the other \"5 star\" hotels in the area. None of them really rate 5 star. Regal is awkward to get to from taxi point of view, and has way too many loud tourists often in the lobby area, but general facilities for business are ok, the Internet has improved a lot, used to be poor, the general restaurant is very average and noisy, the expensive one is so so, and the gym is a bit pokey and stuck away at the end of a hall in B3 level, no windows, but ok equipment. I have tried cheaper...they are all definitely 3 star levels, I have tried more expensive, and they just are no different, so overall the Regal remains pretty good value for money for the area, just keep your expectations in the middle.", "Date": "September 10, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Enjoyable stay”", "Author": "dentalbuddy", "ReviewID": "UR139618467", "Content": "I make it a point to check tripadvisor before we book into a particular hotel. The reviews for this hotel were generally good but everybody commented on the long waiting time at the front desk for checking and checkout. We arrived on the 31st August and expected a long wait. But, to our surprise, we were shown our rooms in less than 15 minutes after all formalities. The friendly lady at the front desk was very cordial although I can't quite recollect her name. The other staff are not always smiling though and could don a smile when they recognize hotel guests.. The room was very clean and big enough for HK standards. The outstanding thing was the room was nicely laid out and very inviting. The bed was even more comfortable giving a good nights rest after a hectic days shopping. Tried the Wifi, but had to pay for it and I took the 24 hour option on the advice of the front office staff based on their reply that the 24 hours is not 24 hours from the time of first login but will be based on usage. Unfortunately, exactly 24 hours later, my login expired. Check out was equally fast needing less than 10 minutes flat. This hotel is within walking distance of Causeway Bay MTR, Jardine's Bazaar, Times Square and lots of malls. Will definitely stay here the next time around too!", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Service, location good, kind of pricy”", "Author": "lenkay", "ReviewID": "UR139600130", "Content": "everything was good hotel has smoking and non-smoking spacious rooms and amazing bathrooms kind of pricey but if you can afford it go ahead :) don't go for the buffet breakfast...its not that good for the money you pay MUST TRY: this dumpling restaurant in the hotel building..it's amazing!", "Date": "September 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "La Quinta, California", "Title": "“Tired Hotel - Exec Lounge very disappointing”", "Author": "Ross W", "ReviewID": "UR139428728", "Content": "Exec floor was a waste of money - lounge poorly run. Wine and appetizers were not good quality. Lounge manager had very poor attitude. She did not think we spoke Cantonese - very naive. They way she addressed her co workers (who are all younger) was appalling. My customer asked for an umbrella sleeve (it was raining hard outside) and she complained that she would have to call housekeeping. Wifi was free in lounge but had to pay in room (unusual for exec floors where you pay more) No reason to stay at this type of hotel any more with all the boutique hotels in HK where service is prompt and professional. Seemed like a mainland chines tourists were in house - poor combo for business travelers! Great location - but that is all this hotel has going for it...........", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Wonderful experience, Hong Kong Regal”", "Author": "Paul B", "ReviewID": "UR138836244", "Content": "My stay at the Hong Kong Regal was one to remember. Beautiful room, elegantly furnished with all the facilities that one could want. Breakfast, cocktail hour and a 6pm convenient check out included in the price! Situated in the heart of Causeway Bay with MTR just around the corner, everything so convenient! Angela Mak, The Executive Club Manager, was very helpful and cooperative during my stay and made me feel so welcome. A hotel experience to remember!", "Date": "August 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice Location but So so Service”", "Author": "Gim Hoe K", "ReviewID": "UR138688609", "Content": "It is located at Causeway Bay, which is the shopping paradise in Hong Kong. The hotel was packed with guest from China and when a hotel is packed with China guest, you will need to have extra patient as you juz gotto wait for everything - check in, lift, check out etc etc. When I entered the room after check in, around 3pm, not even 5min, the housekeeper opened the door without knocking the door, and luckily I yet to remove my clothes for shower and she apologized and told me that the room was yet to fully make up. I juz wonder how could the hotel allowed guest to check in when the room is not ready. I was then tried to access the paid internet but failed. I called for help 2x, 1st time the front desk told me they will reset the password but it did not work, 2nd time the front desk even asked me to settle it at the front office which I find ridiculous to request an in-house guest to settle it at the front desk, I refused and insisted her to solve the problem, guess what, she said OK then hung up my call, she seemed to be frustrated with my calls. I then raised the complaint and problem solved in between 30 min. Room wise it was a little old but still clean. You will find mirror everywhere in the room which I find a little discomfort for having too many mirror. Overall experience was below expectation due to the service.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Location, location, location”", "Author": "speeddolphin", "ReviewID": "UR138608851", "Content": "I recently spent a night here with my husband and our 4 year old son. It's a nice hotel - not fantastic, but certainly not lacking compared to the other hotels in Hong Kong. What you get, though is great location. It's close to the MTR, right in the middle of good shopping malls (where you can get basic amenities), plus great little eateries around the area. There are good dessert places for the evenings (mango pudding, mango sago pomelo and ice cream, you name it!) and late night snacks (HK-style fish balls, beef balls in spicy sauce) within walking distance. In the morning, a short walk down the street will get you great HK porridge with deep fried dough sticks (you tiao).", "Date": "August 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“First visit to HK”", "Author": "Jasmin M", "ReviewID": "UR137734196", "Content": "Nothing to write home about - it says the place is five stars but our stay at the hotel wasn't all that memorable. The best thing about it was that it was close to the station and relatively central. In terms of things to be aware of - the service is hard to comprehend, maybe it is just the way things are done in HK but we were hoping for international quality. We had free shuttle service to and from the airport included in our room rate, yet we were told on arrival to the airport that the service is booked out and it was first in, first served. After a difficult and partially lost in translation conversation to the concierge at the hotel, there was a spot on the bus found for us. When we finally got to our room at the hotel, it turned out to be a smoking room. I was surprised no one double checked this with us. Being a non smoker, it was intolerable to be in the room. In addition, traveling with a friend, I have requested two single beds configuration but the room we got had a double bed and we were told there were no other rooms available until the next late afternoon. The guy at the reception asked me if i would mind to share the bed with my friend! We got a fold out bed in the end (at 'no extra charge!') and were relocated to a different room the next day which was good I suppose. We didnt use the restaurant facilities in the hotel - it didn't look or smell that appealing. The roof top pool was basic but ok and so was the gym in the basement. It could do with a little more air conditioning - with three other people working out, it was quite stuffy. All in all - the place in convenient but don't expect international quality of service and even reasonable requests re the beds,, shuttles and a couple of other things were a struggle.", "Date": "August 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“convenient hotel to Times Sq Hong Kong”", "Author": "HV G", "ReviewID": "UR137172392", "Content": "i found it to be a very nice hotel. they provided everything i needed. there is free wifi in the lobby. i visited this past july when we were caught in a typhoon rated 8. there was a lot of rain and wind. hotel was still standing. tree on the street next to it fell. hotel was very accomodating in trying to find out the status of our flight at 05:30 am. we we informed that flight was not canceled. since there was no taxi; we took shuttle bus to the airport express. and made it to the airport. plane finally took off after a 2 and half hour delay. all in all i enjoyed my stay at the hotel.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“amazing experience at Hong Kong with a nice GM Mr Alex and Club Floor Manager Angela”", "Author": "Stuart B", "ReviewID": "UR136546699", "Content": "I enjoyed coming to this hotel, it is my home away from home. Thanks to all the friendly staff in particular Miss Angela Mak! You can even speak freely with the GM inside the elevator, or anywhere else you meet him, and still feel part of the family. Well done guys ! Strongly suggest to book a Club Room or even upgrade frequent viistors to the Club room so they can see they are missing. Suggest even bringing guests to the Club lounge, even though you pay it is still good value and great atmosphere. Looking forward to a wifi upgrade free for guest no.1 and 2 Many Thanks Stuart Ballantyne--CEO Sea Transport Corporation([--])", "Date": "August 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Shanghai, China", "Title": "“Mmmm... not really that good for a 5 star”", "Author": "Pavel P", "ReviewID": "UR136038217", "Content": "Okay, my experience with this hotel was sort of disappointing. 1st of all a LONG queue for checking in, which obviously couldn't be handled by the staff. Which made me wait. Then go to the nearest Starbucks to take a coffee. Then wait again. And so on. Overall it took about 2 hours just to check in. Well... I've seen better. Anyways, the windows in my room overlooked neighboring house and underwear dryer. Ok, no big deal, it's HK and we have curtains. Quite a problem to get a taxi from the hotel, there is always a big queue for that as well. Generally my whole stay was about different queues. Apart from that - it's a decent hotel.", "Date": "August 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Perth, Australia", "Title": "“Only four sun lounges, a lift that takes forever and poor service”", "Author": "happyaquarian13", "ReviewID": "UR135585499", "Content": "My introduction to this hotel was via a phone call to the Sales and Marketing manager Mr Stephen Tse, he was rude and arrogant and I should have taken warning then that if head of sales could be so rude to a potential customer it wasn’t a good sign for the hotel and its staff. We arrived late at night from a long flight, being in Causeway Bay means it is quite a journey from airport even if you go by MTR and taxi, for a short stay Id definitely stay Kowloon side. Our room was ready and we were surprised at the size for a four star in Hong Kong. We particularly liked the long window seat which was a perfect place to put our suitcases. Nothing else was terribly spectacular about the room , though I was also pleased that we had a separate shower. Everything was clean and in good condition except the air conditioner, the noise was dreadful. We tried turning it down but it made no difference so we turned it off all together which then meant we woke in the middle of the night boiling hot, we turned it back on and just had to put up with noise. The other negative we discovered was the lift, how slow can a lift be? We wasted so much time waiting for a lift. To get to the pool you had to take two lifts, one to the Clubroom floor and then change to take another to the rooftop where the pool is located. As pools go in Hong Kong this is a nice one with no high rise blocking the sun, but what lets it down is the lack of service and the pool furniture, four sun lounges and two tables total !! When we got to the pool at 9am two of the sun loungers were being saved , which seemed ridiculously unfair that the pool guys allowed this, when clearly there is not enough lounges to service guests. We stayed by the pool all day enjoying the sun but not the service. The two pool boys did nothing all day, they didn’t even check the water as they claimed to do every two hours. The two sun lounges being saved were unused for 3 hours whilst other guests had to sit on the concrete, this is outrageous. At every other hotel we have stayed at in Hong Kong pool staff come out regularly with cold towels, and cold water, no such service here. There is a water fountain inside the pool reception area with paper cone shape cups, that is it. Alternatively you can do the long wait at the lift to go down two floors to wait for another lift to take you to your room to get a drink and then do the waiting for lifts to get back by the pool, very poor. At lunchtime we wanted to order some food, we had to go searching for the pool attendants as they were sitting inside doing nothing, certainly not being proactive in offering menus to guests at lunchtime. Then when we made our choices we were told we had to phone ourselves , seriously what were those two pool attendants being paid for , certainly not service. Foolishly we ordered chips with our meal because obviously they had to do the long wait in the lifts and so were stone cold when they arrived. As there are only two tables in the whole pool area and both were being used some friendly guests allowed us to share their table. The dirty plates were still piled on the table from the previous diners, no one had moved them , so we put them on the floor to make room for our plates. When we left the pool area 3 hours later all those plates were still on the floor and piled on the table, such dreadful service, still it was marginally better than the gym which has no service Again after a long wait for the lift heading the other direction to the basement this time, you get to the gym. Access is by keycard and whilst there is a long list of gym rules, including no children under age 12 without supervision and guests must wear appropriate gear this didn’t stop 5 kids obviously under the age of 12 in thongs using up all the cardio equipment for a bit of a laugh leaving serious excercisers wanting for a machine. Once on the cardio machines the tv monitors needed rebooting but of course because there was no one supervising no one knew. We went to the gym on four occasions and every time it was unsupervised and the tv monitors didn’t work. One night we ordered room service, whatever you do, do not order the bolognese sauce, the chef clearly doesn’t know that Bolognese means a tomato based sauce.. this sauce had no tomato and was grey but worse had been flavoured with chinese five spice..served with pasta it was inedible. We wouldn’t stay at this hotel again, besides the fact Causeway Bay is not the best location to stay with little decent shopping around, limited restaurants and devoid of any atmosphere that is Hong Kong or Kowloon the hotel just doesn’t provide any service, where so many others in similar price bracket do. Throw the ridiculous lift system in the equation , the lack of pool furniture , the loud air conditioning and the dreadful food why would you go back?", "Date": "July 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Has enormous potential, but poorly managed....”", "Author": "travelprincess004", "ReviewID": "UR133955419", "Content": "We recently had 9 nights on the Club floor. We felt the price was good, however you get what you pay for. The Club Manager (Angela) would scream to her staff in the next room, everything for her was a huge effort. Lucky Andy was there with exceptional service to help make up for the downfall of his superior! The breakfast and afternoon tea on the Club floor was minimal, with no option available to attend the main dining room as an alternative - in fact, they are inflexible on everything. They had a charge for an airport shuttle on our bill in the middle of our stay - the staff do not have the authority to fix this on the spot, so it took some time and phone calls to have it removed. Our room was spacious and clean and we enjoyed the nespresso machine in our room. Our room was quiet even thought it was near a lift. Would I go back? No.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "byron bay", "Title": "“Good choice for a stopover”", "Author": "jimmybyron", "ReviewID": "UR133699152", "Content": "I wanted something mid range for a 1 night stop over on the way to europe , the regal was up to my expectations for the price range. I booked a room on the business floor ( 32 ) room was fine , of course decorated in a more 90's style asian way, great bed. Some slightly disturbing stains on the lounge chair in the room,,,not sure what they were and can't understand why they would not have cleaned or replaced . it did let the room down a bit. great view and location. One big positive was the nice pool on the roof a little haven away from all the hustle and bustle. I probably would stay here again and if i wasn't so tired from the flight i would have asked to change rooms due to the lounge.", "Date": "July 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“Excellent family choice for central Hong Kong”", "Author": "Shones123", "ReviewID": "UR133470863", "Content": "Choose this hotel if you are staying in Hk with a family!! Finding a hotel in Hk where the rooms are large enough or with enough beds to sleep a family of 4 is tricky. We travel to the city a lot and usually struggle to find a hotel for this reason or we have to make compromises and put both children in a single bed or have our youngest sleep with us which makes for a poor night's sleep as he wriggles so much. I wish we had discovered this hotel before. You can request a room with 2 double beds which is prefect. The hotel also has a great roof top pool which the kids loved, has a great location on the edge of Victoria Park and with easy access to shopping and the metro. At check in the staff were extremely helpful. We had arrived early and, although our room was not ready ( the hotel only has a limited number of rooms with 2 double beds), the staff were willing to offer us another room to rest in until they could move us to our room. We also arrived on a day where there was a large political protest taking place nearby and the staff advised us of this and told us to avoid taxis because of the impact on the roads and where not to go. The only downside was that our room was on a smoking floor but the room itself was great and you could not really tell it was on a smoking floor once inside.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“forced to stay here by airline cancellation”", "Author": "haroldHood", "ReviewID": "UR132470170", "Content": "internet did not work, room was not clean, service was rude, bed was hard as a rock,", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Another Winner”", "Author": "Kwan_NYC99", "ReviewID": "UR130854978", "Content": "I stayed at the Regal Kowloon on 5/4 and has a excellent experience. Since my meeting the next week is at the island, I decided to try Regal Hong Kong. I am glad to report the Hong Kong property and staff are as good as the one in Kowloon. Room is clean, service is excellent. I have signed up for the Regal reward program and I checked in via a separate seat down area. The young lady at the reward desk was professional and friendly, I do not remember her name but she's definitely care about what she's doing and it shows. I would rate this as a 4-5 stars property and look forward to use them again.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Well priced & perfectly adequate”", "Author": "LondonCityAM", "ReviewID": "UR130725538", "Content": "A friend had described the hotel as 'faded elegance' so I was expecting the worst. However, I was pleasantly surprised - my room was large and quiet and had all the essentials. Room service was fast and efficient and everything worked. The gym in the sub-basement level was functional - just a pity it was in the bowels of the hotel. The lack of any bar area other than the stark and brightly lit lobby was a pity - but didn't ruin my stay. The neighbourhood is good with a good selection of shops and restaurants within a few minutes walk. The roof top pool was quiet on both visits and a nice place to escape for an hour over the weekend. Other than breakfast I didn't eat at the hotel but the restaurants seemed permanently busy drawing a lot of local business - so I assume that the food was pretty good. Overall pretty good value especially if you're happy to trade of a larger room for some 'faded elegance'. Would I stay again - yes.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Castro Valley, California", "Title": "“Value!”", "Author": "Turtle T", "ReviewID": "UR130708448", "Content": "I travel to Vietnam numerous times a year, and like to stop for a day or two in Hong Kong. Its on my nickel, so I visit the various discount travel sites to find a hotel in the under $125 range. The same five hotels seem to always pop-up: Regal, Hotel Bonaparte, Cosmopolitan, Cosmo and Charterhouse. All are in the Wan Chai/Causeway Bay Area. The Regal is by far the best value of these five. It has a very nice lobby, the rooms are VERY spacious, and the service is exceptional.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Unfriendly staff and poor services.”", "Author": "Jy850922", "ReviewID": "UR130708031", "Content": "I believe thar Hotel industry is a services industry, although this us needless to say but I have doubt that Regal Hotel understand this. Despite the recent and on-going refurbishment of the hotel the service is rather disappointing. First of all, the lady that helped to check us in showed us with very unpleasant face as seems we are unwelcomed, there was no single gesture, facial expression or even word of welcome. As we arrived early around 1230pm, the lady told us that the check in time is 2pm and we have to come back at 2pm to check in, she gave us a note with hotel room number and informed us that when we're back at 2pm we can just show it to the front desk again to get the room key. So I came back at 2pm sharp and had to queue at the front desk again and passed the note to the front desk after 20mins queue and the person who attended us (another person, next to the lady who attended us earlier) said that it was a wrong room assigned and gave us a different room (not the one given by the lady earlier) which is at lower floor. The front desk also seemed as sales desk to me as we are checking in the people kept selling us extra services which of course needs money - wifi or LAN cable in room (was very surprised the hotel room doesn't even have LAN cable, in which era are we in? Moreover in such developed country like HK?), you need to pay HKD170 per day for Internet, breakfast, room up grade and etc. I was just thinking if the front desk are trained to welcome the guest by selling more and more they could. If you have better room that vacant and no one is taking it up, either you offer it free to hotel guest or just don't mention it. I don't think we need to know how much to upgrade to each room type as we could check it online. The worst happened during my last morning that I checked out (8am), the bell boy informed us that the shuttle bus to HK station is on 20mins interval, and the shuttle bus to airport only arrives in an hour. So we opted for the bus to HK station and transfer to airport express train. To my very disappointment, we waited for 40mins and there wasn't any bus!! I think the hotel should aware that hotel guests are in need to arrive at the airport on time and missing flight is the worst to happen for any traveller. After 40mins (I was kind enough to gave them double of the time interval promised) and I went to the bell boy and asked is he aware that the bus is coming soon? He just replied with very rude face\"I don't know\".", "Date": "May 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pilipinas", "Title": "“Causeway Bay Good Choice”", "Author": "pinayflashpacker", "ReviewID": "UR129683100", "Content": "Requested for a change of room bec. initial room had dirty carpet (1516). Next room (1806) was a renovated one, a bit modernized. Very spacious with 2 beds w/c you can push together, bigger than a king bed. Beds and pillows were soft. With tub and separate shower plus toiletries. With safe, coffee&tea, desk. Views are of buildings, Victoria Park and harbor. Cleanliness wasn't up to standard. Hairs on both shower and tub. AC was kinda loud. No help from bellboys to get taxi and to load bags into taxi. Convenient location.", "Date": "May 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland Region, New Zealand", "Title": "“Does what it says on the box”", "Author": "Kiwi_acct", "ReviewID": "UR129437479", "Content": "Stayed fo four days at the Regal Hong Kong wile in town for business. Overall i was happy with the experience I had. The room was ok, it was kept clean and made up in good time daily. I had no problems with reception staff and most of the other people at the hotel. The only place I did have difficulties was the restaurant on the first floor that is used for breakfast. Staff here were not very nice, verging on the rude especially when seeking a signature for the breakfast docket. The gym was good with very few people using it, so it was easy to get on machines. Also it is open 24 hours, useful if your body clock is out of whack. It is well located in Causeway Bay, close to retail options. It is also close to the MTR, as well as on the tram line. So apart from a couple of sour staff it was overall an OK experience.", "Date": "May 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "tsgbhalf", "Title": "“Good, but with challenges”", "Author": "tsgbhalf", "ReviewID": "UR129413600", "Content": "Service was inconsistent. Some excellent (Bono, the bellman is unbelievably good), some average. Checkout process seems slow. Not a lobby type hotel with chairs, couches etc. Fitness center was dirty. My room was quite clean. Meeting rooms were clean and well serviced. Meeting room food was good.", "Date": "May 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Regal Hong Kong Hotel”", "Author": "Catherine C", "ReviewID": "UR129152849", "Content": "Modern and spacious room, location near Sogo and Time Square shopping centre. Nearby area many HK cafe and other eating place etc wanton noodle house and porridge. Very unfriendly Lobby area no sofa or chairs to rest or sit for family with children's or infant while waiting for check in or check out. Taxi to Disneyland HK 200 dollars around 45 mins or Ocean Park HK 60 dollars 20 mins.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Detroit", "Title": "“The worst and most overpriced Hotel in the WORLD...”", "Author": "mlmcasual", "ReviewID": "UR129025422", "Content": "In all my travels abroad- This is by far the Most overpriced, worst hotel I have ever been to IN THE WORLD. 300$ USD a night, beds that are hard as rocks, small old rooms, internet costs 20usd and up, The hotel's restarurant charged 45$ USD for a crappy salad and soup. This place is the beggest EFING Joke I have ever seen. It's so bad it's like a parody from an SNL skit on absurdly crapy overpriced hotels. It's unreal how bad this is.", "Date": "April 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“great pleasure”", "Author": "cardioswiss", "ReviewID": "UR128519587", "Content": "We stayed for 4 nights with a baby ( 18 months). We had great pleasure in this hotel. When you come in, there is a very comfortable smell of a fresh parfume in the lobby. When we arrived, there was no queue and could check in very quickly. The room was nice with an outstanding bathtub in the bathroom ( round and very big). I enjoyed it particulary. The location is also very good, in the heart of the very animated Causewaybay, with lots of restaurants and shopping in the neighbourhood. We had breakfast everyday in the coffeeplace in the lobby ( we had no breakfast included), with very kind staff, especially with our baby. We did not test the pool because of the weather.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "IL", "Title": "“No service, no understanding”", "Author": "xplorer37", "ReviewID": "UR127956449", "Content": "I woke to find no hot water in shower. No apology, not sure if they have fixed for tomorrow. \"free Internet\" in lobby is only free for 2 hours total from the time you first access it. If you are there 4 days & access when first arrive, no free Internet for the next 3+ days! When it doesn't work don't think they will waive fee for room access, the Mgr showed no concern at all for the lack of the lobby Internet working, forcing me to use the paid service for a few minutes. He refused to take charge off, even knowing from employee I complained to & showed the service not working. Another note, the food in this hotel is mediocre for a high price. The area of Hong Kong offers little so if you want shopping or dining, try another area. Will update further when I try to get I Prefer & American Airline credit for my stay. Overall I will avoid all Regal properties in the future based upon my experience here.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Good but not exactly 5-star quality except for the Club Rooms.”", "Author": "AileenSingapore", "ReviewID": "UR127814477", "Content": "The moment I arrived at the Regal Hong Kong, I was overwhelmed with the crowd at the lobby. Boy, was it crowded and noisy! Thankfully, I was booked on the club floor so i was immediately guided to the private check-in on a different level. I felt like I entered a different hotel altogether. The floor was more tastefully decorated and all the staff were extremely attentive and helpful. The room was a good size given that this is Hong Kong and the hotel is located at Causeway Bay! Bed was very comfortable. Location is excellent as the hotel is located just about 5 minutes walk to the main shopping belt in Causeway Bay. Food is never a problem with many cafes and local eateries around the hotel. For the Karaoke fans, there is a huge Karaoke just across the hotel to croon your night away! If you plan to stay at the Regal Hong Kong, go for the Club Rooms!", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“my home in HK”", "Author": "Robert A", "ReviewID": "UR127108190", "Content": "A perfectly located hotel with an excellence of service. Specially recommend staying at the fabulous executive floor rooms! You will have a very preferential service and their manager Ms Angela Mak is the most helpful and efficient person you will find in the business. Excellent views from the rooms as well as from their Zeffirino restaurant. She go extra miles to show me the Suite and bok thru Regal web is good price. Thanks", "Date": "April 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, UK", "Title": "“GUEST INJURED - 1Star Treatment by supposed 5Star Hotel”", "Author": "SEABoys", "ReviewID": "UR126365710", "Content": "I stay in Hong Kong regularly and the standard of hotels is excellent. Personnel in Hong Kong hotels can never do enough for you. However, at this hotel I sustained an injury by falling in the shower. The floor of the shower is not suitable for the purpose it was designed - extremely slippery when wet. They do provide a small bathmat that is inadequate for the area of the shower floor. As a direct result of the hotel's failure to secure the safety of the shower for their guests, I fell and severed an artery in my wrist (I am only 34 years old so this is not expected). The injury was of a serious nature and all Duty Manager’s showed concern and agreed taht the bath mat was too small for the shower area when they inspected it. I had to attend the hospital and a Doctor gave me stitches and presented me with a bill for 7600$. I then gave this to the hotel, given that the staff had admitted liability. However, when I met with the VP for International Sales, he refused to accept the liability that his staff had already admitted and refused to pay! Just to add insult to injury, the hotel delivered additional 4 mats to my room to cover the whole area, 2 days after the fall and 1 hour before I checked out! A sure admission that there is an inadequacy in their bathroom set up (see attached). I was astounded. 5Star hotels build their reputation on caring for their guests. My bill for the room was double the cost of the hospital bill (I was staying in their Club Floor) and yet the person at the very top of the Regal Hotel group does not live by the standards set by the industry. Super disappointing and totally out of character for the usual high standards set at HK hotels - in fact 5Star hotels internationally. There is something terribly wrong when the person running the hotel and the group does not live by the 'Your Satisfaction Is Our Goal' mantra that is posted in their email signature. Shame on you Regal Hotel and I feel sorry for your staffs that were undermined by your arrogance and inability to handle my case fairly. Your staff showed genuine concern and apologized while you were too scared to admit your faults. There are so many EXECEPTIONAL hotels in Hong Kong and this hotel is relatively expensive given the facilities available (rooms are tired and I had to request a re-clean when I arrived). Stay anywhere in Hong Kong, but do not stay here. Enjoy true hospitality and excellent service elsewhere.......", "Date": "March 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Pay and pay”", "Author": "Robin T", "ReviewID": "UR126311389", "Content": "This hotel is about pay and pay! I booked with a early check in option and arrived from US a the hotel around 10am, and had to wait at the lobby until 2 pm to be able to check in. Internet access, have to pay extra I took the shuttle to airport on return, I have pay extra 130. Because I booked the room with 3 people, I got one with king size bed, but the shuttle say the room is for 2 people, so had to pay for another head to take the shuttle.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Pleasant (timewarp) Hotel”", "Author": "coober", "ReviewID": "UR126118918", "Content": "Stayed five nights on a business trip/convention. Arrived early and got the upgrade to the Exec. Floor/Room. So I could get into my room a little earlier. Good size room & bathroom (for Hong-Kong). Had all the bids and pieces You would expect and it all worked. The décor is very interesting, Some of the best quality vinyl seats (lounge and lobby) I have seen In years, that combined with the décor of tons of marble, crystal chandeliers etc.. makes this place somewhat funky – Retro. Anyway the staff at reception were typically efficient but cold (check out the painting of the hunting scene at reception that might explain it) The upstairs Exec. Lounge served coffe and drinks, day/night, basic but nice view ( I liked it) The breakfast, included with the Exec. Upgrade was very good and served in a Lovely room with a view. Very good location, close to transport, shopping, Restaurants and Convention center. I do have one complaint, the security staff refused to Let anyone Sit in the lobby unless you bought coffe and cake. What is that?? Lighten up or provide alternative seating for your guests.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Cigarette butt and turd got us a free upgrade...”", "Author": "Dyl82", "ReviewID": "UR125640423", "Content": "Friendly staff. Rooms feel quite cramped. We got upgraded because of the prob mentioned in title. I was at a loose end and needed to use the Internet... Which costs 15 euros (170HKD) just to connect!! It's ok... But I wouldn't recommend it given the wide range of choice out there. It was ok value for money because we only paid about 75 euros a night - and for an upgraded room. Any more than that and I'd say \"bad deal!!!\"", "Date": "March 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“One of the staffmember fooling me while I wanted to extend my room”", "Author": "Joeoej", "ReviewID": "UR125551591", "Content": "First, I am little bit disappointed, because of the chorus of praise for the staff members which you can read here. Most of them are really friendly and helpful, but what I find out today I never seen in a 5 star hotel before. While wanting to extend my hotel room for another 7 days in the executive lounge as a executive member, the lady on the front desk asked me for the room number and checked my status, seeing I was booking with an travel agency, she didn´t know exactly what to do, so she asked a lady sitting not at a front desk but two seats beside of me, I think she was one of experienced staff doing a break, this lady doesn´t even talked to me, instead of it saying something on Chinese to the front desk lady. So the front desk lady told me I would better book with the travel agency or on internet. I told her I prefer to extend the room here and not on internet because I want to pay in cash, meaning I don´t want my creditcard to be charged. Now the lady two seats beside of me starting to say something in Chinese again and laughing at me stating, how I can pay cash to the internet. So I need to explain here again, that I want to pay in the hotel and not with the credit card via internet, she just continue talking in Chinese with the other statt members. The other staff members tried to me friendly meanwhile. Anyway I don´t think thats how hotel visitor should be treated like.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Taunton UK", "Title": "“Excellent service”", "Author": "Alan B", "ReviewID": "UR125435070", "Content": "I am disabled and have found the staff of this hotel very, cheerful and helpful they are only too willing to be of assistance. I must say also my stay at the hotel was very pleasnat and would recommend it as a stop over for travel as I used it.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Handy Hotel”", "Author": "VivecaSingapore", "ReviewID": "UR125208677", "Content": "Whats good? The staff were fabulous. I loved my glorious room (but not the location). I will be back and have learned which rooms not to stay in! (not right next to the lift) Whats not so good? Long check in and out. The internet was pricy when I only used 3 hours of internet. I think they should have an hourly rate. My room was right by the lift and the local chinese speaking ladies were shouting in the corridors at 3am at the top of their voices without a care for other sleeping guests. (although I realise that the Hotel cannot be held responsible for the inconsideration of some people)", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great choice whilst on business”", "Author": "adzbee", "ReviewID": "UR124851109", "Content": "Stayed in October last year for a week. Have been travelling to HK for 4 years on business, usually staying in Wanchai, was looking for something less central and better value. Regal Hong Kong was a great find. Location, service and the executive club facilites all exceeded expectations. I have already booked again to stay in April and will likely stay here again whenever in HK.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SANTA CRUZ", "Title": "“PERFECT”", "Author": "sammy778", "ReviewID": "UR124497423", "Content": "We only stayed one night, but the staff was very helpful and the room was great. The small portions restaurant down stairs was world famous. We love Hong Kong a world class walking city, I miss it already", "Date": "February 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Trying hard”", "Author": "Amac27", "ReviewID": "UR124368666", "Content": "I arrived after a journey of almost 24 hours and just wanted a shower, a change of clothes and something to eat. It took about ten minutes to check me in even though I had booked and they kept trying to upsell me to a more expensive room, made me sign about four different credit card vouchers and took about five minutes just to explain how to get the internet to work. All of this when I was so tired I thought I might fall asleep before the process was completed. I ended up going for the upgrade and am not necessarily sure it was worth it. My view was of the boring (ie mountain) side, the free breakfast was pretty pedestrian and the waiter gave away my table while I was waiting for them to fix the coffee machine. When I brought this to his attention he invited me to go and sit in the lounge until somebody else finished enjoying the view. The room was fine, but I was unfairly comparing it with the stunning suite with a view I had the last time. Also minor details such as the presence of gin but no tonic in the minibar were frustrating when you arrive with your body clock messed up and just want one drink before bed. The location is fun with all the sights and sounds of Causeway Bay close at hand. The staff are well-meaning but need to be told exactly what to do rather than anticipating what you might want or need. This place could be great but somehow there is just something lacking.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Katherine, Australia", "Title": "“Nothing special”", "Author": "Skiier404", "ReviewID": "UR123581543", "Content": "Breakfast was good so book with this included! Uprgrade definately not worth it.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "sydney", "Title": "“Very comfortable and enjoyable”", "Author": "spj709Sydney", "ReviewID": "UR123324555", "Content": "We recently stayed here on a business trip in a club room. It was very comfortable and enjoyable. Breakfast was quiet good, though the club room was very basic at night for a drink and service was slow. Overall though we very much enjoyed our stay.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Taipei", "Title": "“2-min walk from metro station”", "Author": "willwu2000", "ReviewID": "UR122563566", "Content": "1-block away from Causeway Bay station. relatively large room and bathroom for hong kong. very well maintain. clean. staff helpful despite being very busy that weekend. good sound barrier, can't hear outside traffic nor hallway conversations. same building as Din Tai Fung restaurant, one of the best restaurant in hong kong famous for their steamed buns. very close to shopping areas. in center of hong kong. would stay again. good hotel choice for family, couples, business, or leisure.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Great location, excelent services, nice room.”", "Author": "Stevie S", "ReviewID": "UR122402033", "Content": "The hotel is near to 2 malls, a lot of local restaurant, MTR station, free internet access at lobby, delicous breakfast and the room's perfect. It's very convinient", "Date": "January 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "shanghai", "Title": "“To be avoided!”", "Author": "cedshanghai", "ReviewID": "UR122074316", "Content": "1/ Front desk over selling for an upgrade 2/ Location very noisy 3/ Room very 80's 4/ Internet connection not working but charged! 5/ 20 min hard negotiations at the check-out to get compensated 6/ Curtains in the room must have been hanged 20 years ago 7/ TV light was heavily aggressive and could not be switched off 8/ mouthwash being charged at HKD 18, for a room of HKD 2,450 a night!", "Date": "December 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangalore, India", "Title": "“Cost effective and convinient”", "Author": "AlbeeTheOne", "ReviewID": "UR122061118", "Content": "I stayed at the Regal hotel for business, and found their website very easy to navigate and book a room. I chose the hotel since it was close to my client, and the Causeway Bay MTR train stop helps in terms of connectivity when you feel like a tourist. The hotel is across the street from Victoria Park, and has a north view towards the Harbour. The room was small, but so are most of the rooms at the HK rooms that I stayed previously. The staff was courteous, and the check-in/out process was well managed. The hotel serves a nice breakfast buffet. They have a pool at the rooftop, and a gym in the basement. They have a small business center too for use.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Nice causeway bay location, beside the tram stop”", "Author": "HappyHomemaker", "ReviewID": "UR122032616", "Content": "Stayed here for a week in Nov11. Room was clean and bright, though a bit small. Just 2 hiccups after we got to the room - the safe did not work, and the toilet seat did not stay up. We had 2 staff come in to repair these, the safe was fixed after 15 min, while the toilet seat would not cooperate even after around 30 minutes of being taken apart, hammered, poked, etc. other than that, housekeeping staff were very friendly and helpful. Check in and check out was very quick and efficient. Best part for me about this place is its location. Its a very short walk to sogo, windsor house, the mtr and victoria park, and around 10 min to times square. It is also right beside the tram's causeway bay terminus and 2 minutes from the general tram stop. When travelling with young children, i would take the tram over the mrt as it is less crowded and less distance to walk. Of course, this is only true if you are going around the tourist spots on hk island, as the tram network is not as extensive as the mtr. Breakfast at the hotel is so so, but there is a good congee and rice roll shop if that is your thing, a few doors from the nearest 7-11. You can also get good beef and pork jerky from the bee cheng hiang across sogo. Would also recommend that you try din tai fung in the same building.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Good location but service lacking”", "Author": "2plus1", "ReviewID": "UR121970610", "Content": "Booked with Wotif and paid an extra HK$990 for an extra bed. Correction, it's a plywood board with a 2 inch mattress on it. They ran out of rollaway bed that night. Asked housekeeper to put another 2 layers of the same type of mattress but she refused to comply. She can add only more blankets to cushion it. We had to speak to manager (Edgar) whom we must appraise him for making an effort to search for a proper rollaway bed. Room is extremely small and as there's no other bigger room for that night, we make do with it for a night since they are changing room for us the next day. We are pleased with a more decent-sized room but again, the 3rd bed is missing. Here comes the housekeeper again with her plywood board and 2 inch mattress. We were so fearful of going thru' the hassle all over again. She recognized us and promptly replaced with the rollaway bed. Beware! What type of extra bed they give you. Plus point of this hotel is its strategic location like what others had reviewed. However, the circular overhead bridge accessing the hotel is probably the favourite gathering and picnic place every Sunday for foreign domestic workers.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Location~ 5* Staff @ Reception~ 2*”", "Author": "leongkat", "ReviewID": "UR121876835", "Content": "I checked in this hotel on 15 Dec and checked out on 18 Dec. The location was wonderful with a food street nearby, metro in 3 minutes walk and Times Square just across the road. The room given to me was great too! Huge and comfortable. Only flaw, but disturbing, was the super slow reception service. Despite only a few of us in the queue at 4ish pm om a Thursday, I waited close to half an hour for my turn to check in. And to my horror, I was told the room was not ready. No apologies and no explanation. I was told to go for my shopping and returned later. Worst still, they didnt seem to smile at all. I didn't expect Disneyland service, but sometimes a smile was all it needs. I was half joking to my sister, perhaps the company is not paying any bonuses or has a budget cut on training. Last thing, no mention about free WIFI in the lobby. I was told when i asked the reception I need to log in using my room number. And boy, i need to pay! This was my only experience in past half year that no free WIFI in a 5 star hotel..", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent service, location and value”", "Author": "csttoronto", "ReviewID": "UR121568171", "Content": "I stayed at the Regal Hong Kong for 8 nights at the beginning of November. After arriving on a 15 hour flight from Toronto I used the Air Express train to get into the city then connected to a free shuttle bus for the 10 minute drive to the hotel. Everything worked seemlessly. I was so pleased at first with the ease and gracious check-in, then with the large and well appointed room, One of my pet-peeves about hotels is guest rooms with windows that do not open. After inspecting my room, I noticed that the windows could open but were locked. I contacted the front desk and within 5 minutes staff were unlocking the windows. The hotel is well located near the Causeway Bay underground station and on the main tram line. The surrounding area is filled with restaurants, shops and shopping malls. It is a 5 minute taxi ride to the new Conference Centre or a 15 minute walk. I took my breakfast in the main restaurant on the 2nd floor. It is a bright room and the fairly priced breakfast buffet has a generous selection of North American, European and Chinese items. There is a One Star Michelin rated Chinese restaurant on the 3rd floor and an Italian restaurant on the 37th floor, alas I did not dine in either. During my stay, I always found the room well cleaned upon my return each day, The concierge staff were very helpful arranging tours and transfers. Check-out was quick with no concerns with the final billing. When I am next in Hong Kong, I will likely stay at the Regal as it is CLEAN - CONVENIENT - COST-EFFECTIVE", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Good location!”", "Author": "ChicChik", "ReviewID": "UR121538935", "Content": "I like the fact that it is close to all the buzz of shopping havens! Nothing less for ChicChick! The hotel provides a free shuttle service to Hong Kong station where you can check in your luggage. One negative point is that the shower stall pools up. And I noticed a strand of hair stuck on the wall -- this shows that the housekeeping is not as thorough as what it's supposed to be.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Perfect location, and comfortable”", "Author": "Basquiatlim", "ReviewID": "UR121441887", "Content": "I just returned from a 7 day stay at this hotel, and I can recommend it. The location is almost perfect. It's a 10 minute walk to the subway stations, 2 minutes to the trams and 2 minutes from lots of eating places, and shopping. I highly recommend taking the Trams as they traverse the length of Hong Kong island and are amazingly cheap at 2.30 HKD which is about 30 cents US (!!) and offers a slow, relaxing view of the city. The tram stop is just outside the front door of the hotel. The nearby area is very busy at all hours of the day and is, I suppose, part of the Hong Kong experience. If you prefer Starbucks or McDonalds, they are also closeby. A public sports field and the Hong Kong Central Library are about 5 minutes away. There's a jogging track at the sports field which has a soft surface and is good for joggers not wanting to run through the streets of Hong Kong. The hotel provides a shuttle service to and from the airport which is very convenient though travel time is long--about 1 hour 30 minutes as it makes stops at other Regal Hotels and has to make it's way through Hong Kong traffic. If you decide to take the MTR from the Airport, you get off at the Causeway Bay station. On my departure I decided to try the MTR Airport Express which was also very easy to do and took maybe 30 minutes. I didn't try any of the restaurants, gym or pool facilities as I was busy shopping, eating and sightseeing during the day and even evenings. Our room was spacious, well-appointed, beds were comfortable. An electric kettle was provided and the bathroom provided a shower and bathtub. There's a refrigerator which contained drinks and snacks. An in-room safe deposit box was available for use and it was large enough to fit my 11.6 inch laptop, other electronic gadgets and valuables while we were out. Our room was quiet and I slept well. There's also large screen TV. The hotel was well maintained and the lobby area is quite pretty. The christimas decorations are now up and are quite beautiful. I would certainly consider staying there again.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "USA/Cambodia", "Title": "“Definitely not a 4/5 star experience.....”", "Author": "Mike__R0ss", "ReviewID": "UR121183621", "Content": "This hotel, like most of Hong Kong, is bustling and not friendly place, even the concierge seems to be rushed and have not time to make a person feel comfortable in HK. The rooms are very small and all services, including food, are very expensive. Room was freezing cold and it took 4 hours to get a portable heater. The floor butler did not speak english and was of no help. They charge $20 for wi-fi and the service was impossibly slow speed. The front desk manager was not helpful when I tried to change my reservation. About the only positive things I can say about this hotel is that it is in a decent location and the room was clean. I will not return here.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Caring hotel and GM, friendly staff, highly recommended”", "Author": "Eric L", "ReviewID": "UR120378419", "Content": "My wife and I decided to choose Regal Hotel Causeway Bay this time instead of Excelsior to feel a difference on this trip, we read the comments here and was so worried as we wanted to enjoy ourselves and when we come back from our day out, to rest and enjoy the evening together. Mr. Farmer is an excellent host with a strong team in the executive club, special praises to Angela Mak, Minah, Andy, Oscar, Billy and Edgar (very good man - made me felt so welcome with a phone call and then setting up the wifi booster for us) and the rest of the team that made our stay so warm and friendly. We really felt at home with a lot of support and help from the team. The rooms are being refurbished, so there will be noises. When we checked out, the room next to us was having its carpet changed, and this means that Regal is upgrading as much as they can to make it a great stay. The toilet paper is thin but then again you can ask for more toilet rolls, not a problem. The water pressure was good, although we could not adjust it and the room was cosy. Whenever we had problems, we called housekeeping or reception and was always provided a quick response. well done to the team. Swimming pool looks nice we didnt swam but the view from the roof you can take good pictures of the stadium. Great View! We were provided Room 1910 during our stay from 30/10/2011 to the 3/11/2011. I feel very strongly that this hotel has a very good future and is blessed with a caring GM. We spoke to the GM when he was in his rounds one morning at the breakfast lounge on 31st floor on the bad internet connection and in the evening, we were provided with a booster and we had no problems connecting after that, too bad it happened on the day before we checked out though. However, we had dinner at the chinese restaurant on the 3rd floor on our last night and we just wanted to note that the welcome letter should be worded better as we thought the entire meal would have been the 15%-30% discount but we found out that only selected dishes was discounted, therefore the fish we had was not.. we didnt really mind but wished in future that on that welcome letter, to have it worded better to ensure there is no confusion. One thing we did pointed out to the lady taking comments on the 31st floor breakfast time was the lobby reception, at times it was like walking into a police station or igloo as the staff there could give you the coldest stare, as if we are not welcome even when they open the door for us to go out. This is subjective but I felt a bit uneasy every time we went downstairs and wish that the people was just a bit friendly. A smile is very important as most people is paying a lot of money to stay at the Regal, at least a thank you smile to say hey thank you for choosing Regal. We really want you back, I think a suitable customer service training will be good for the lobby staff, some of them do look like security guards, which is good, in a sense. , All in all, our next trip to Hong Kong, we definitely will come back to Regal. The beds are cosy, the room is large enough and you get good views from your room. If you are not happy when you are there, just speak to Mr Farmer, and as you can see from the replies, I believe he is making a lot of good things happen at the Regal. One last thing if you could let Andy from the 31st lounge know that we will hope he will be able to show us where is the special roasted goose he is telling us about. (he says it is as good as yung kee at central) It is always good to get a local to tell you where the good food is, Too bad Andy told us on our last day when we waiting for our shuttle bus to the airport, and Angela if you see this, thank you for all your help and concern, you work really hard, we appreciate it! Hope you guys enjoyed the cookies :).", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wicklow, Ireland", "Title": "“Great hotel in a fantastic location”", "Author": "Pamela028", "ReviewID": "UR120225454", "Content": "Ok... So I'm just back from a two day night stay at the Regal and despite all the bad trip advisor reviews I read before my stay I must report that I was not only surprised with the hotel but was absolutely delighted with it! First of all the hotels lobby is lovely and I was impressed the moment I entered the hotel doors, then after an easy checkin I made my way to the room where I opened the door to what was simply a gorgeous bedroom - very 5 star indeed. There was a plate of complimentary fruit and chocolates left for me too which was a nice surprise also. The next morning I used the roof top pool which boasts great views of the city. The pool area isn't massive with just a few longers so it I could imagine it could get very busy in the summer months. Its probably important to mention the rate I paid for the room- i paid €100 per night. I booked online... I actually think this was a deal to support the fact that they were laying new carpets in the hotel. I was on vacation in the city so this sort of thing doesn't bother me one bit. The only main dissappointment I had about the Hotel was the Real Palace restaurant on the 3rd floor. The food was very average and the staff werent helpful or even that nice either. Our table was wonky in that it was sloping to one side(my glass of wine almost fell on my lap) when I pointed this out to the staff they simply mOved the table around in the middle of my meal and werent very apologethic.they charge 10% service charge to the bill which to be honest I felt the meal wasn't worthy of.... Also the restaurant room itself is also very open and bright which results in a very clinical atmosphere, not the kind of ambience you'd expect from a find dining restaurant. The hotels located near the busy causeway shopping area... Just a two minute walk. The MRT is also close by as is Starbucks, McDonalds, and 7 Eleven is name but a few handy shops on the hotels door steps. Ultimately the restaurant is very disappointing but the hotel is fab and located on a brilliant area.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Hong Kong, China", "Title": "“Disgusting Hotel - maybe 2 stars”", "Author": "G O", "ReviewID": "UR119732943", "Content": "I wouldn't come near this one, there is no way on earth this is 5 star! My shower was full of black hair and shampoo lids. Obviously had not been cleaned in a while. The carpets are stained and dirty and the whole hotel is in need of a massive make up. I would certainly never stay here again and oh internet is HK$170 per 24 hours - crazy rate. I am really annoyed I have even paid for this room at all. You can feel the wires on the bed mattress.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Service lacking”", "Author": "GodofGamblers", "ReviewID": "UR119715551", "Content": "Stayed on 34th floor club floor included breakfast. Booked online for discount. From arrival to checkout service is horrible. Everyone is rude here. I have stayed here many times always on club floor because regular rooms stink and are dirty. Do not book club floor because breakfast is horrible as well. There is nothing to choose from. I keep coming back because I can find a good price online but every time I stay, it pisses me off how rude the staff are, especially on club floor. This is the only hotel in hk that I know of that charges you for an adaptor. Shower has no water pressure. Staying on club floor requires u to exit on 31st floor and take another elevator to 32-34 floors. In the second elevator you have to swipe room card to use elevator, it takes an average of five swipes to register. Very annoying. Oh yeah, the toilet paper they use, I fold twice so there is four layers, it rips very easy. You will end up with crap on ur hands if u r not careful. Went to Italian restaurant for late night snack. Ordered a duck pasta dish, pasta tasted store bought and not fresh and duck taste was so overwhelming, not what i would expect after spending nearly 300 hkd (40us) on a single dish with a serving the size of a regular rice bowl. I really don't know what positive things I can comment about this hotel.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent Hotel with exceptional service”", "Author": "Peter A S", "ReviewID": "UR118586831", "Content": "The Regal Hongkong Hotel provided my wife and I with the best experience that we have had in 40 years of International travel. The staff were really well trained, very attentive and helpful. We witnessed them handle two very difficult guest related problems during our stay and did so in a very professional way with minimum disruption to other hotel guests. The Club Lounge staff - Andy & Akeibu were extremely helpful and did a terrific job looking after the guests during both disruptions. The Executive Club manager - Angela was exceptionally good. She resolved both disturbences in a quiet, plesant yet forceful manner. What an asset for anyone in the service industry. Thank you all for a very memorable stay.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Somerset West", "Title": "“Disappoining!”", "Author": "LaurentPerrier", "ReviewID": "UR118299437", "Content": "I recently stayed in this hotel during a business trip. My colleague booked me a room on the eight floor, which is the first floor with rooms, as I want to stay as close to the ground floor as possible. Other members of our party slept on the top floor. Checking in was very difficult as the receptionist wanted us all to check The room was small, dark and very smelly because of years and years of accumulated cigarette smoke. It showed its age and was screaming for a renovation.The carpet was stained.The bathroom was also small with only a bad (and cheap curtain), basin and toilet. Breakfast in this hotel is even more disappointing than my room was. I opted for an Espresso together with a doughnut. The espresso turned out to be a huge cup of normal coffee, while this was my first doughnut ever without any taste whatsoever.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not recommended”", "Author": "ChicagoTrav", "ReviewID": "UR118199621", "Content": "I agree with another review that this is a nickel and dime hotel. There is a fee for mouthwash - very tacky. Why even offer the mouthwash in the bathroom if it's not for free? Also, there are only 2 power outlets in the room, which are located next to each other in the corner of the room by the desk. They are 3 prong outlets that my universal travel converter would not fit (and it fit previously that week in another Hong Kong hotel). They have an adapter FOR SALE in the room. Housekeeping had to bring a black box converter, the size of a shoebox, for me to use electricity. It's a joke that it is so challenging for me to just recharge my phone. I would not recommend this hotel for business travel. The rooms are clean and basic, but I think the hotel considers itself a top Hong Kong hotel, which it is not.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "", "Title": "“Beautiful Building - Unbelievably Poor Service”", "Author": "Contraidentukl", "ReviewID": "UR117940113", "Content": "I am not sure how this place is rated at 5-stars. I booked and prepaid for a room through booking.com. When I arrived at the hotel, I was greeted by a receptionist who was quite rude. On booking.com, I had booked a room for two adults with a request for a third bed. For an unknown reason, there was confusion between booking.com and your sales/reservations office. The receptionist told me that I had not booked a room with two beds, nor had I booked a room with a third bed. I tried to explain to her the type of room I booked, the third bed I had requested and prepaid for, and the total US Dollar value I had prepaid - in order to explain that I had already paid for three bed accommodation. As I tried to explain this to her, she interrupted me several times, and her body language made it clear that she was not listening to a word that I was saying. I felt like she believed I was lying to her. Further, as I was trying to explain to her what I had paid for and the accommodation I was expecting, she asked me how much I had paid. I told her I paid somewhere in the neighborhood of $611. She then had the audacity to take out a piece of paper, write down the rate in HKD for each of the three days, add the numbers together, and ask me what USD/HKD exchange rate I would like to use. Then, she told me that the value was nowhere near $611. This was pretty demeaning - implying either that I could not do basic arithmetic or that my short term memory was insufficient. The receptionist then told me that my room was not ready (it was 6PM) and that I would have to pay (for a second time) for a third bed, unless I could produce a confirmation from booking.com. I asked her if I could sign onto the internet to show her the receipt on my email account, but I was denied. She told me if I wanted to pay for the internet, I could show her the confirmation, or I needed to go find somewhere with free wifi to download the form to my iPhone. I was disappointed in the events that transpired. First, I was disappointed that a room was not ready at 6PM for check-in. Second, I was completely taken back at the way I was treated by the staff. Not only was the receptionist rude and offensive, but the doormen and the concierge were also not interested in customer service and friendliness in general. Third, I could not believe that the burden of having to work out the problem between the Regal Hong Kong sales office and booking.com fell upon me. Booking.com is the Regal Hong Kong's sales partner, and I believe that any discrepancies or issues should be worked out by the hotel staff and management, and NOT by the customer. If you stay here, don't let the staff ruin your visit. It might be a good idea to phone ahead a day or two to make sure that they have you in the system correctly.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "HK", "Title": "“Ok experience with not so friendly staff”", "Author": "almansor11", "ReviewID": "UR117254307", "Content": "It was very busy travel season in HK and this hotel was no exception. Check-in was slow as the line was long and room wasn't ready at 5 PM. Took us 30 mins to get the room. Room features were within our expectations, and room itself was clean. Staff was not friendly, I suppose this is because they have to deal with large crowd of travelers. Other than that, everything else is fine.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Fabulous”", "Author": "TK1956", "ReviewID": "UR117166783", "Content": "Stayed at this hotel with my wife for 3 nights from 17/8 based on a recommendation from a friend. Booked an Executive clubroom via the hotel website. This deal included airport transfers, breakfast, free in room wi-fi and club lounge facilities. The airport transfer runs on a schedule with the 1st bus at 7.45 am which when you arrive at 5.30am means a fair wait. Whilst the transfer was fine we opted for the airtrain for the return journey as the return schedule meant sitting around the airport for far too long. We arrived at the hotel at approx 9am to be advised that our room would not be ready but we were offered access to the gym to change and then our bags were held pending our room availablity. Plentiful ideas for a local area exploration were offered by the staff. We returned at approx 11.30 to be greeted by the news that our room was ready. The room and its amenities were superb. We used the roof top pool which was a great way to cool off from the HK heat. The breakfasts were superb with many options from hot food to pastries to fruit to cereals. No complaints here. The best part of the whole deal was the use of the Club Lounge magnificently hosted by my new mates, Andy & Aki. If someone from the hotel reads this these to fine gentleman deserve recognition. They were very friendly, attentive and knowledgable about HK with many suggestions for our stay. When offered free drinks on the 1st evening they did not have my wife's favourite drink, Jim Beam. Guess what, it was there the next night. the local area has many shopping options including SOGO and Time Square. The MTR is approx 200 mtrs away and offers great transport option for HK. So cheap, clean and regular (I think the longest wait was 4 mins). Many local eateries are in the neighbourhood. there is also a large park over the road which is great for a walk around. Anyone who likes Rugby should consider this hotel as we could see the stadium from our room. Would be excellent for the 7's. We loved this hotel and would return in a heartbeat.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Delhi", "Title": "“Too gaudy for my taste but some great eating places”", "Author": "skywords", "ReviewID": "UR117109259", "Content": "I must qualify this review by saying that my opinion was hotly debated by my colleagues. Still, it is my opinion! The hotel is done up in Traditional Chinese style but is over decorated with Red and Gold. The check-in staff weren't the most friendly I've met and while the rooms were spacious and comfortable, the taste in decor was consistent (gaudy). There was also this annoying music that was in a loop from the elevators as well as in the room until I figured out what caused it. The fitness room was tiny. Breakfast was rather ordinary by any standards. Now the good parts: Room service was terrific; the food was awesome. There's a great ice-cream cafe in the hotel itself and a fabulous dim sum restaurant in the hotel complex. They also have lovely banqueting facilities if you can grow to appreciate the style. While there was nothing wrong from a service perspective (the check-out was friendly so it could have been that I chose a bad time to check-in) I didn't find too much here to make me want to choose it again among the several properties available here. It is five star and in a good location so don't expect a \"great deal\" either.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Great hotel, great location, great food!”", "Author": "Toetjesfreak", "ReviewID": "UR116959558", "Content": "The title says it all: great, great and - once again - great! Some minor points for improvement would be check-in time, the front desk would give us the room key before 2pm (we arrived at 1.15pm) and told us to come back later. Also the choice of dumplings for breakfast was a bit limited, as was the rest of the breakfast buffet - especially compared to the JinLing hotel in Wuxi, China, that we just came from. Other than that the hotel is just good, albeit on the high side of the price range. Then again, the location is great and the rooms are clean and comfy, so all in all a good stay.", "Date": "August 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice hotel but Poor service”", "Author": "Rogtan", "ReviewID": "UR116612504", "Content": "Great location with lots of good food and shopping around the Orel. Easy and convenient to get to from the airport. Just take A11 Airbus and it stops just opposite the hotel in less than 60 mins. Paid HK$40 one way. Hotel also provides free shuttle every hour or so. All these were marred by poor and inflexible service. Booked a deluxe room for two with free breakfast. Upon arrival, told that breakfast only for 1 pax?!? Asked for two card keys as I need to work while my wife goes shopping. But the front counter would only issue 1. Could not explain why not two keys. Overall nice hotel but poor service.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Milano, Italia", "Title": "“Amazing view in luxury”", "Author": "TeoLinuX", "ReviewID": "UR116597834", "Content": "Rooms above 31st floor are suites with exceptional view and a lot of space (compared to HK standards). One entire side of the room is a glass wall that faces Victoria Harbor. Personnel is caring , kind and always willing to help you. Bed are enormous, the bathroom mixes design with functionality. The entrance hall of the hotel is spectacular. Silence is perfect.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Luzon, Philippines", "Title": "“Price is right”", "Author": "Solotraveller888", "ReviewID": "UR116369517", "Content": "The hotel is always priced lower than nearby Park Lane hotel. During peak season I usually stay here as the other hotel gets pretty expensive. My room is nice and clean and quite big compared to Excelsior nearby. Near Sogo dept store and Time Square . Restaurants are abundant. There is a michellin rated restaurant beside the hotel", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Paris, France", "Title": "“loved it but ...”", "Author": "sabrina-pauliano", "ReviewID": "UR116322761", "Content": "After just a short time of waiting for check in, we saw the receptionist. Totally cold and rude person ,she took my credit card away, she said that she would charge me fully of i can't remember how many days does she mentioned , as a guarantee. she seems like she was busy doing things here and there.....anyway that is not the mean problem ,well the problem was comunication me and my husband got poor english as we are from France,we asked her does any one speaks french ,and she said we should wait and after an half hour she came back and said \"no one can help you everything was in chinese or english\",si we called my friend( in paris) to help us for check in by phone because no one could explain us in french the rules that was disapointiing from a 5* hotel ,about the room attendants they were nor friendly and even they couldnt speak simple english it's was not lucky actually ,our first stay in hong kong was in sheraton which has a french speaker as a room attendant that was very sympathic . The room was clean at standart level,the food is great,we planing to visit hong kong at least once for a year,we love to travel and to stay in a warm place as hong kong ,and we would like to invite our friends too but this time we must find some one who could speak french . we will come back for sure a' bientot", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Petersfield, United Kingdom", "Title": "“Pleasant hotel, conveniently situated on Hong Kong Island”", "Author": "KJC55", "ReviewID": "UR115643456", "Content": "This is a pretty good hotel in a convenient location. Room was reasonably spacious, clean and tidy with all the necessary amenities. Mr room rate included free internet use. Staff are attentive and helpful without being over the top. Pleasant area for breakfast and lounge area close to lobby.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bangkok", "Title": "“Excellent stay at the Regal HK, Causeway Bay”", "Author": "GeraldJBangkok", "ReviewID": "UR115525842", "Content": "We had a great stay at the Regal Hong Kong, Causeway Bay on our recent trip to Hong Kong. The hotel is a very busy hotel in a very busy area of Hong Kong, and was very convenient to the MTR Subway, restaurants and shopping. The staff was mostly very friendly and helpful, which is easy for me to say since we were upgraded to a 32nd floor executive floor room with a harbor view. The rooms and lobby are a little gawdy for my tastes, but definitely very clean, roomier than most HK hotels with a gorgeous bathroom with separate shower and bathtub. In the same building of the hotel is a Din Tai Fung Restaurant, which has received a Michelin Star and rated by the NY Times as one of the ten best restaurants in the world. We ate there twice and was very impressed with the food, prices and very friendly and helpful service. There's almost unlimited choices of other restaurants within easy walking distance. The hotel is also served by the Airport Rail Link Shuttle buses, and you can get a door to door free shuttle bus if you take the Airport Rail Link into the city from the airport. I would definitely stay at the Regal again. It's very good value for the money with a great location.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "cooper city", "Title": "“Will definately be back!”", "Author": "garasr", "ReviewID": "UR115221695", "Content": "We have traveled to Hong Kong many times and decided to give the Regal a try due to the value for the money. After having read the mixed reviews for the Regal, we were a bit nervous about our reservation. We fortunately only experienced a very positive situation. Our check in on the Royal Lounge floor was immediate and our room (as promised) was renovated and had a beautiful view. The bathroom was completely redone, with a \"rainfall\" stall shower and new bathtub. The staff, especially Angela, Flora and Sam were extremely helpful and nice. Oh, almost forgot, the rooftop pool is quite awesome. We look forward to our next trip to Hong Kong and staying at the Regal.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Great location. Struggling to update and modernize. Amazing pool”", "Author": "jvanyc", "ReviewID": "UR115081000", "Content": "I stayed at the Regal in 94 when it was probably a year old and much more up to date at the time. That said this hotel is in a fantastic location and even the standard rooms are large and not cramped. The downsides of the Regal I would say is that it is in the midst of trying to better itself. One afternoon in dire need of a jet lag nap i discovered that the room above me was having it's floors drilled or something. A call to the manager had them stop work there and he even offered to move me to another room for my nap ( I wouldn't have had to move rooms just nap somewhere else which I thought was a creative solution) I echo the comments made by some others, the non-updated floors have that musty smell that happens in the tropics when the carpeting has been around too long. My biggest complaint with the place however is probably something that has to do with the owners or main managers. There just doesn't seem to be that level of service for a hotel of this caliber that you get at other hotels in Hong Kong and Asia. In the rooms are no fewer than 10 different cardboard advert tents cluttering up the room and bathroom. It feels like the hotel is really just selling you a room in order to sell you more stuff. It is very off putting. Also the wifi issue, horrible and expensive. TV too, they have what look like nice flat screen tvs but the signal and channel selection is really bad. It just seems that there a too many places they are trying to cut corners and it ends up landing in the lap of a less than great experience. If the management got their priorities corrected and put the guest first and not their desire to get into the guest wallet they would probably be able to charge more and get more from customers. One imagines the owners running around demanding answers from staff why they are paying for curtains to be cleaned or why is it costing $x to have a shower fixed instead of pointing in a corner demanding to have things polished better or insisting that carpeting with stains and smells be replaced immediately. You can just feel the cheapness of the owners in the hotel. I wouldn't not stay here again but i'd only be staying if I found a great deal on the room rate. The dumpling restaurant outside the main lobby btw is fantastic. Really great soup dumplings.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Quezon City, Philippines", "Title": "“Wedding anniversary trip !!!”", "Author": "stylishtrvler", "ReviewID": "UR114962875", "Content": "We just got back from a trip to HK. This time we tried staying at a diff hotel for our anniversary trip. I wrote in advance to inform the hotel about it but didn't get a reply so I thought the email didn't go thru. We requested for a renovated room and was gladly given one. They even provided fruits and chocolates just not sure if it is a common practice or something special due to my previous email. I assume they read the email and acted upon my request. Didn't try the internet cuz I find 140hk quite expensive. The rooms are big and bed comfortable. Overall it was a nice stay. Will definitely stay here again. had room service at 1am. Service was fast. There are still some renovation work going on at the top floors, but we were informed thru a letter in the room that there might be some noise from 10am to 6 pm. I only noticed some noise past 10am. If you don't plan to stay in the room the whole day, I don't think the noise from renovation work matters. July 1 was a holiday and streets were blocked off. The hotel also sent a letter a day before advising guests leaving for airport to take necessary adjustments.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Enjoying our stay, hotel is wonderful!”", "Author": "alisoninoz", "ReviewID": "UR114825929", "Content": "We are in the middle of our stay at the Regal, the hotel is lovely, our room is very nice, fittings and furnishings are good quality. The only down side for me was the lack of information of where the local attractions are and how to get there!!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“A very disappointing stay, will give this hotel a miss in future”", "Author": "atina2090", "ReviewID": "UR114698568", "Content": "Have travelled to HK many times but this was the first (and will be the last) time we stayed at The Regal HK. We only chose this hotel because of the swimming pool and close proximity to Causeway Bay shopping district. While the hotel is in a convenient location with tram stop out the front and short walk to MTR, this is probably the only saving grace. Hotel is in dire need of refurbishment and this extends to the rooms. The hotel is suppose to be 5 star - perhaps back in the 1980's given the mirrors, glass, marble and gold/brass fixtures and fittings now bordering on tacky. Our experience was more like 3 stars. We had pre-booked and paid for a 3 night stay in a non smoking deluxe room which we had subsequently confirmed by emailing the hotel. When we arrived we were told that there were no deluxe non smoking rooms available - and to compensate the hotel would be upgrading us to a suite - but only for one night which meant repacking our bags the next morning and changing rooms. After advising the hotel this was extremely inconvenient and our preference was for a deluxe room for the entire stay rather than have to shift rooms mid way, we were advised we could remain in a suite for our entire stay at no additional charge. The room was spacious but the fixtures and fittings very dated and whilst the hotel tried to compensate for this with the replica Florence Knoll sofa and armchair, there is still much work to be done. In terms of cleanliness, the carpet was stained and dirty. The bathroom had a very unpleasant odour and we were forced to keep the bathroom door closed at all times. The hairdryer did not work and when we notified housekeeping, rather than sending up a portable hairdryer immediately, they attempted to fix the existing hairdryer. It was was almost 30 mins before I was able to dry my hair (using the portable hairdryer). Floor is supposed to be non smoking, but the guests in the room next to ours were smoking. This became problematic as the cigarette smell was seeping into our room through the gap between floor and door adjoining the two rooms. To rectify this we needed to complain to reception. Hotel is suppose to have WiFi in rooms but the reception was extremely weak. Unlike most other hotels, the Regal HK did not offer free WiFi access in the lobby. Additionally, the cost of WiFi was on the expensive side with room WiFi being the same price as that in the lobby. Whilst the lobby did offer better reception, there was nowhere for guests to sit and relax without being obligated to purchase a beverage, as we were told the lounges were only for use by hotel cafe/bar patrons (and there would be a minimum charge of HKD $40 for use by hotel guests) You could probably describe this as a hotel popular with business travelers and large tourist groups from mainland China. The personal touch and customer service orientation were literally non existent. There are a number of hotels in the same area and whilst a swimming pool might be lacking, they more than compensate for this with features and benefits, contemporary styling and customer service.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Surabaya, Indonesia", "Title": "“Never Ever Stay in The Regal Hong Kong!!!”", "Author": "XoMartel8", "ReviewID": "UR113569900", "Content": "We regretted every second since we stepped into this hotel, we booked 2 rooms and planming to stay here for 3 days 2 nights, and our stay was started with rude treatment  and totally unprofessional local hire. We arrived at the hotel at around 2:45 pm,and our room was not ready, the late check out time was at 1 pm and in 1 hours 45 minutes of cleaning time the room was still not ready. So they made us linger in the lobby, unfortunately,there are no seats for us to sit on and wai t for the slowww service, there are empty chairs in the lobby lounge but the sitting hostess said that we cannot sit there unless we consume, which i think is so dumb, they have a group of waiting guests (waiting for their slow housekeeper to clean the room) and we are not allowed to even sit on their chair. After 30 minutes of waiting time, the receptionist informed us that it will take them another 45 minutes to get both room ready,that means the rooms were not ready until 4 pm. After complaining, They offered 3 free drink vouchers for 4 of us at the lobby lounge which is the only seating area in the lobby (oh yeah, it's that area where we cant sit unless you consume). We finally got the room, it was small, old, and definitely need to be spring cleaned real bad. Lack of power outlets for us to use, they offered travel adaptor for A price.  To make matter worse, they are having construction work done right above of our room, they were drilling holes all morning, they started at around 10 and yes we were still in the room and even maxing the tv volume doesn't even mask the noise a bit. We finally complained to the receptionist to make them stop for a while or at least work on something else less noisy, the rude receptionist persistently said no we cannot do that because they need to continue working till 6 pm. Breakfast was bad also,not enough selections for this type of hotel,it seems that they are just taking advantage of their location being close to the shopping district thus they can take it easy on service and products. We should have just stayed at other BETTER hotels nearby. WE ARE DEFINITELY NOT COMING BACK!!! And we believe to save your money, you shouldnt also..... Take your money some where else guys....they worth more at other place...Better Service, Better Product DEfINItELY NOT  the regal.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice Friendly Hotel at Causeway Bay Area”", "Author": "SiaoLan", "ReviewID": "UR112667431", "Content": "The price for the room is at HK$1500 per night with breakfast and Internet, I find it reasonable for what I am getting. Room is comfortable clean and coz we have 3 pax, it has enough space for me to add an extra bed and don't find it too cramp. The staff that we encounter were friendly and helpful. The chef at the cafe was nice and detail. When I order a scramble egg, he actually check how well done I want it to be. Not much chef does that when they do your egg. Just opps you have Windsor shopping mall and near by SOGO, of coz near to Causeway bay MTR IF there is an event at the Victoria park, you just have to cross the room and you are there. There are enough eating place from good restaurant to simple cafe that you can have breakfast for HK$70 for 3 pax. (of depend on what you order) So if you don't mind paying HK$1500 for a room/ night, I think is a good hotel to consider.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“I will never stay here again”", "Author": "KarenB08", "ReviewID": "UR112495719", "Content": "On checking in, staff insisted on charging 2000 dollars for incidentals to my credit card - that worked out at 500 dollars per night. I was told it would not be charged to my card. On checking out, I was told they would refund the money they had taken from my card. What did they think I was going to do? Steal the television?", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Chennai", "Title": "“Regal - Small & beautiful”", "Author": "Essquare", "ReviewID": "UR111279832", "Content": "Was on a holiday in May 2011 with family. This one in Kowloon city was quite far from the airport. took around 1.5 hrs to reach there.Check in procedures were cordial. Helpful staff. \"Always on the move\" housekeeping. - do not spend time with you much to answer any questions other than the one you had called them for. Good location with easy access to banks, restaurants, etc. one problem faced was the usual one in some developed countries.Good food with a decent variety - Some cons - No lockable doors for the attached baths- just a sliding glass door and a curtain--- gave a shock initially!!! Restaurant - The indian one did not have any fruits - only juices. Too small rooms. A small lobby for the no,. of rooms available People from INdia need to carry adaptors of mobile phones/laptops etc. as the sockets are all pin type and not the round type ones.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Suffolk, Virginia", "Title": "“Decent Hotel-Lousy Wi-Fi”", "Author": "ChipSaunders", "ReviewID": "UR109736978", "Content": "The hotel overall is a very nice hotel and it is located not too far from the Metro. The rooms are fairly small but aren't too bad. My main complaint is the internet. The wired internet runs around $150 HKD and the Wi-Fi runs at $170 HKD. If you need internet go with the wired, because the only place the Wi-Fi works is in the hotel lobby. In the rooms is a different story. I called the front desk and they patched me through to a tech who basically told me to refresh my computer. Clearly its the rooms if my laptop can hold the signal in the lobby but FAILS when you get back to the room.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Shanghai, China", "Title": "“Brutal”", "Author": "LloydsPants", "ReviewID": "UR103994734", "Content": "First time writing on trip advisor but had to give an update on this hotel. Stay in Causeway bay at least once a month and have stayed here numerous times. Bottom line is this hotel is dirty and has terrible service. If your desire is to wait in line at the check in counter for thirty minutes plus or clean your bathroom upon arrival then this is the place for you. One of the positives is the price, which is reasonable for the location. Noticed they will be doing some remodeling soon, but that will not fix the service level at this place. Best bet to stay across the way at Lanson Place Hotel or at the Crowne Plaza.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“OK”", "Author": "Jane_Nasution", "ReviewID": "UR100333469", "Content": "It's my 3rd stay in Regal Hong Kong. It's close to everything and good for shopping as it's in the heart of causeway bay. Only one thing as a turn off is the hotel interior. It's a bit too garish for me, with its european style. However, it's very spacious, especially for HK standard. With 2 single beds, you can still have an extra bed and space to move. It's a little too pricey for me, so it's always be my last choice when I run out of options with my other favorite hotels.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen", "Title": "“You should stay here”", "Author": "keithwilson30", "ReviewID": "UR97954693", "Content": "I travelled to Hong Kong with a booking at the Regal Hong Kong Hotel. I had booked for 13 day but changed it to 5 as some of the ratings here were not good. What a waste of time as I was to discover the hotel is wonderful, clean, very helpful staff and very good rooms. The difference from the reports is incredable as I can say nothing bad about the Hotel. it is well positioned to have access to the metro system and has wonderful local eating places close by with good shopping areas around the hotel. This Hotel is so good I am going back 0n the 27th feb after a few days in Macau. Keith Wilson", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "northern ireland", "Title": "“friendly staff make this hotel a pleasure”", "Author": "fjno1", "ReviewID": "UR97916117", "Content": "I travelled to Hong Kong as my daughter was having surgery there and had a few reservations as the reviews were a bit critical. I found that this hotel was lovely and in a great location. The staff are a credit to management with perfect English, enthusiastic smiles and great attention to detail. On day one the maitre d' in the restaurant asked why my child was on crutches and we explained that she was having surgery, so on day 3 when we returned for dinner he immediately asked after her and made a real fuss of her. She was thrilled. The rooms were spotless, beds and pillows comfortable. I'll definitely return soon. Also to any fitness addicts like myself the gym is great - all well maintained machines and plenty of choice.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beijing, China", "Title": "“good quality hotel for the rate i got, not international 5 star level, horrible elevators”", "Author": "sternenklar", "ReviewID": "UR96576467", "Content": "This is a hotel in Causeway bay in HK island. The location is near the subway station causeway bay and they offer a limousine service from the airport which i found very convenient. staff is eager to help and attentative, but could speak better English. Although the hotel claims 5 stars, this is in no way in the league of an international 5 star hotel. the breakfast is very nice and sports a large selection of dishes. the other restaurants however, are not worth going there. the hotel is mainly populated by chinese people (mainland and HK). the elevators take ages to arrive, it drives you mad. once inside you are tortured by generic music that makes you go crazy. the rooms are average. size is nice for HK but they could be more modern. we had a meetinroom booked too. service there was ok but some of the equipment they provided did not work on the first day and had to be replaced. there are some nice shopping areas nearby the hotel and dinning in the area is good (from Asian to nice steaks you can find pretty much everything). disillusioning was the fitnesscenter, which they packed in the basement without any windows and hard to find. it isn't equipped very well (only 2 treadmills) but since hardly anybody seems to use it, i never had to wait. In the basement you can also find the business center, which is small and as usual with these things overpriced, but the ladies of the business center wil ldo everything they can to help you with what they've got. there is a bar on the 31 floor. it's nice and will make ok drinks, but Aqua in TST will be more fun. One remark... as in most places in China you can smoke nearly everywhere in the hotel (including aparently the elevator)... just something to consider. They do however offer non-smoking rooms. Would I stay there again? Maybe if I'd get a really good rate. On full rate.. probably no.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“Don't stay here.”", "Author": "wendy9145", "ReviewID": "UR93807075", "Content": "While the location is fantastic - close to tram, MTR and shopping centres, the hotel is awful. For starters, the toilet was filthy - like a public toilet at the end of the day. After having that cleaned, I then found belongings of previous guests under the bed, in the cupboard. The internet for my stay of 10 days cost more than if I signed up for a 2 year plan with one of the local phone companies. It was also sooo slow (about 1-2 secs to type each letter). Everything is extra whereas in other hotels in HK (where I travel 1-2 x per year), there are little things such as newspapers, internet, laundry breakfast included. I had pre-paid my stay and was unable to move. Not good value for money and staff seem unconcerned with rectifying any deficiencies. My advice - stay away!", "Date": "January 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sentosa Island, Singapore", "Title": "“value for money with good location”", "Author": "winterprincess_10", "ReviewID": "UR91362296", "Content": "booked 2 superior rooms / Check in : 16 Dec 2010 stay for 3 nites. Despite poor comments on this hotel, decided to book as found it good value with good location. Was given connecting rooms. Service staff at the reception counter was good Rooms are bigger than usual Hongkong room Room serivce was good - had put up the DND sign through out my stay, they left slips under my door informing us to contact them should we need any service from them as they could not clean up our room since the DND sign was on. Concierge staff need much improvement, could not provide good knowledge on travlling option when we approach them for help.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Four star hotel that failed to stay up to it's name and standard”", "Author": "ridewell", "ReviewID": "UR90759764", "Content": "Duration of Stay (28Nov - 01Dec2010) Room No.1614. Twin room with a roll- away extra bed. Paid for rate at HK$1702.25 nett per room night. Upon arrival, bell boys were very friendly and helpful. Check in by Mr Herman of concierge, but he doesn't seems knowlegable and pro in his job, but was friendly. Housekeeping needed much improvements, we were given only 2 sets of towels daily with 3 of us staying in. Have to ask for extra set everyday. Ask for razor from day 1 but was never even there till check out. Asked for tissue paper replacement, but don't see it after 2 days later. we were given a fairly good extra bed from 28 - 30Nov, but only that i realized after when I settled my full payment of my total hotel bill on 30Nov morning, my roll-away extra bed was changed for no reason into a piece of mattress with springs protruding all over when i came back late night of 30Nov, thus resulting in my sleepless night. When confronted the front desk duty manager Ms Fiona on the day of checking out(01Dec) for an explanation, she simply utter a word of \"sorry\" without sincerity. She immediately made a phone call to her housekeeping department and ask if they're running out of beds. Never did I expect such bad experience could happened at a four star hotel that carrys the branded name REGAL.This is a lesson learned that you should not pay your room bill in full before checking out or you'll be given this standard of services.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kingston, Canada", "Title": "“Nice facilities - lousy service and greedy charges makes this a bad choice”", "Author": "udo_schuklenk", "ReviewID": "UR89217401", "Content": "I stayed for 3 nights in this hotel. It's an odd mix of good value for money (ie the room, location), but then the staff stuff up everything. My aircon didn't work oroperly for three days, yet there was no serious follow-up. It was either freezing cold or boiling hot, but no chance to adjust the thing. At the same time they blast you with advertisements, for wrongly priced - but useful services - like their airport shuttle bus. They advertise it on their house TV channel at 65HK$ (max), when really the charge is 120 HK$. Despite prior booking you can't be certain whether you'll get on the bus you booked, because they overbook the bus as they see fit. I was on a trip where the luggage blocked emergency exits as well as the driver's sight. In case of an emergency we would not have been able to evacuate the bus quickly because all exits were blocked. They charge a breathtaking 170 HK$ for wireless internet access. That alone is a good reason not to stay in this place. Unlike other reviewers I did like the tacky interior design. It is tacky, but not in a cheap way. The pool is small but perfectly located on the 34th floor. Great views from up there. Bottom line, DO NOT stay in this establishment. You might enjoy it, if you're lucky. The moment there is a problem and you rely on the hotel staff acting on it, you're lost.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Would recommend this hotel”", "Author": "Cas001_10", "ReviewID": "UR89048094", "Content": "I stayed here with my husband and 3 year old in Nov 2010 and would stay here again in future. Pros: - clean room/bathroom - 5 min walk to Times Square, Sogo etc and eateries - close to Victoria Park which has a great playground for kids and running track - courteous staff - nice rooftop pool, however water is not heated so was a bit cold for a swim in November. - good value for money We requested for an extra single bed for our son, and it was provided without any extra charge. This hotel seems to be a popular place for tourists from China and also airline pilots and the lifts may get a bit busy, but we were on a holiday and not on a tight schedule, so didn't mind the wait.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Best location and value for money”", "Author": "MT168", "ReviewID": "UR88492423", "Content": "I stayed there in August and September on my business trip. Located in Causeway Bay next to Jardine crescent, I reckon that this is one of the best tourist shopping spots in Hong Kong. It is about 5 minutes' walk from the Causeway Bay MTR station. I come to this hotel by chance. I actually booked Regal iClub hotel in Wanchai but was given a transfer because the rooms at iClub were under renovation. Since then, I grow to love it. I especially like the airport shuttle service. You can board the shuttle bus at the Regal Airport hotel which is within a few minutes' walk from the airport terminal which will run through a route to Regal hotels in Hong Kong and Disneyland Hong Kong. You can save about HK$600 on taxi fares for a two-way trip to and from airport. The hotel staffs are generally friendly when you approach them. The rooms are quite clean and spacious. The rooms come with broadband access which is a must on my business trip. I booked the room through the official hotel website. Book the rooms early to enjoy better rates. You won't be able to get good rates if you book late.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Salt Lake City", "Title": "“Pretty good for the price, and not as bad as other reviews led me to believe.”", "Author": "maverick83617", "ReviewID": "UR86249334", "Content": "I spent a few days at Regal Hong Kong. I booked for value then saw some bad reviews on this site after booking, so was prepared for the worst. Turned out that my internet was free unlike reviews claimed, guess it depends on the rate. Also breakfast was free and very nice. No smoky smell in my room. The location isn't great for me although if you like shopping then it is good. Room was a little small, but bed was fine, bathroom was clean and all in all a good room. The gym is 24 hours which I find essential, and was decent with weights not just some bikes and treadmills. Free shuttle from the airport is long as mentioned in other reviews, but they also have a free shuttle from the airport express station if you want to speed things up. Staff was kind, also found them above average for Hong Kong.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "singapore", "Title": "“Good location, poor service with no smiles”", "Author": "Jesstravelling", "ReviewID": "UR84862174", "Content": "Despite the many negative reviews I read, we still went ahead to book this hotel because we liked the location. And now I regret to confirm that the reviews of poor service are all true. I've not experienced such cold and unsmiling service at the reception desk of a hotel for a very long time. Every simple request we made was met with confused and annoyed looks. There seemed to be no understanding nor desire to provide service that would make guests feel welcome and taken care of. I would definitely not like to return to this place at all simply because of the bad service.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Montreal", "Title": "“horrible rooms, way too expensive!!!!”", "Author": "yanick1510", "ReviewID": "UR84578225", "Content": "I booked this hotel through internet with a fixed rate prepiad....that's what I thought until I check out. I booked for 140$ a night and then they said they had to charge 10% more + romm fees + mini bar that I didn't use at all (8$ us for a coca cola X 6 = 48$). wifi was 25$ us per mobile and per laptop for a total of 100$ more per night. Furthermore they charged even for laptop that I didn't use. Not possible to talk with the reception at any time. the pool was close for no reason. the rooms were in a horrible condition. leaking shower, small beds, broken windows, etc. I don't recommand this hotel which cost me the double of expected!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice location - disappointing hotel”", "Author": "Vin09", "ReviewID": "UR83875973", "Content": "The location and appearance from the outside are nice but it was downhill after that. My complaints include the fact they bill you TWICE for the internet if you access it both from your computer and phone. - Each device gets charged (and it's not cheap). The room was showing a lot of age. The bathroom needed a serious renovation and the bed was very uncomfortable. About my only positive comment for this hotel was their restaurant, Zeffirino, which has a very good Italian chef.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Very efficient”", "Author": "Lizzir", "ReviewID": "UR83432978", "Content": "This staff at this hotel were very friendly and efficient, they were very accomodating and good for tourist information. The hotel rooms were very floral and old school decor but still very comfortable and clean. In the toilet you can have the option of the lift music playing whilst your in there which is always novel, pan piped westlife anyone? Room service was very quick and tasty I had the japanese meal which was gorgeous, but if you are after a quiet room then think again, you can hear the taps from other bathrooms and people in the surrounding rooms above and below and you cannot turn the air con off and it is very loud in the night. The hotel is in the heart of the designer shop area and there are many shopping centres surrounding it. The hotel is very close to the world trade centre and MTR stations. There are also good links to kowloon, however the hotel airport bus does take a while and would advise that you check with the hotel to see roughly how long it takes to get to the airport so you don't miss your flight by choosing the wrong one...all in all a very good hotel to stay at.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice hotel.. greal location - right in the heart of Causewaybay”", "Author": "karanrm", "ReviewID": "UR80536556", "Content": "I recently visited Hong Kong, and was having problems finding a hotel which fits in my budged due to some Jem and Jewelry fare going on in HK.. Most of the hotels only had premiere and executive rooms available, which were priced really high. Then I went through my corporate travel agent, and managed to get the superior room at Regal Hong Kong hotel at a decent rate. They had a free shuttle service from Airport to Hotel which was very convenient.. though it took like 1.5 hrs to reach Regal HK hotel as it visited all the other regal hotels (kowloon and city) enroute, and dropped/picked other people. Once we reached Regal hotel, to my surprise, I was upgraded to Deluxe room which was wonderful. I was taken to 31st floor where they have a personalized concierge and visitors desk, and my check-in was a breeze.. My room was on 23rd floor and decently sized.. I had to rush to office immediately, so didn't explore other amenities much.. and once back from office, I was mad tired so hit the bed which was very cozy and comfortable, and the linen was clean and thoroughly washed.. I had a very sound sleep.. but next morning, I heard some banging going on outside which was quite persistent.. so I called the reservations desk, who said that there is some renovation work going on.. and they apologize for inconvenience.. I told them I can't sleep with such sound.. and after 10 mins or so, the asst manage (Ms. Karen) called me and she upgraded my room to a premiere room, and shifted me to 27th floor.. This room was pretty much the same as Deluxe room, except, it had a better view and a slightly bigger bathroom.. Since then, I had no issues with any renovation sound or anything.. They have a swimming pool at the top floor (34th floor), which is really wonderful. I just used it once, but the water quality was great, and temperature controlled.. They also had a gym, but I never used it.. The food at the hotel was great.. they had like 3 restaurants, but I only went to one of them on Sunday for the lunch buffet, and it was great food.. The room service was a bit sluggish, and once you order something, it took about 15 mins to get it delivered.. and the lifts too were a bit slow, but this could be due to the full occupancy and lot of people going up and down.. And the best part was that the hotel is right in causewaybay, which is the heart of HK, and a great place for all the shopping freaks.. Overall, I had a great stay at the hotel, and would surely stay here again during my next visit", "Date": "September 22, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Regal Hong Kong”", "Author": "KanaeS", "ReviewID": "UR79879712", "Content": "It's old building but staffs are nice and room is comfortable. I've enjoyed staying there.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colombo, Sri Lanka", "Title": "“BEAUTIFUL HONG KONG”", "Author": "PRABHU60", "ReviewID": "UR79452157", "Content": "Regal Hong Kong hotel is a business class hotel for the executives. Excellent rooms, good food. Service is very good. It is close to many big suermarkets and can do a quick shopping too. Cabs are always available and the bell desk is ever ready to assist.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“recommended for location & convenience”", "Author": "nick_ng", "ReviewID": "UR77428178", "Content": "I stayed here for a few days last week & found this place conveniently located. The train from the airport took me to the HK station terminal where I caught the free shuttle bus to the hotel (just look for the H2 signs for the free shuttle leaving every 20 minutes). The free shuttle bus also took me from the hotel to the HK station terminal. There's renovation going on so there's hacking, drilling & loud noises but I wasn't in the room long enough to be bothered (you encounter such things from time to time). My room was clean, comfortable, bright & spacious enough. Sogo department store is only a 2-minute walk to the left & across the road. The Causeway Bay MTR is also very nearby (different exits dotted around). And there are lots of eating places to choose from.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Shanghai, China", "Title": "“Horrible and overpriced”", "Author": "bananjana", "ReviewID": "UR74534756", "Content": "I really had a bad experience in this hotel. Starting with the longest check in time ever... ... then that strong cat smell of an extra old room... ... one bathroom towel per guest... ... a duvet with a sheet on top and another one underneath instead of a decent cover... ... a hair in my bed... ... slow room service... We chose this hotel because of the location and that is true if what you intend is to shop all day long. But if you wish to visit the City center, Kowloon, go to Macao or any other activities, other areas are much better than this one. Conclusion: I would never stay again in this hotel.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancovuer", "Title": "“Good Location - Smells like Mothballs”", "Author": "get0uttat0wn", "ReviewID": "UR69137568", "Content": "I recently stayed here during a business trip. The hotel is very close to the Causeway Bay MTR station and is a few blocks from Times Square Shopping Centre. The Airport Express bus stops here and provides easy access to the express train. Overall the hotel was a bit dated and smelled very strongly of mothballs. The bathroom was a bit musty. The staff was friendly and all spoke English. Overall I would stay again.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "philippines", "Title": "“The only Hotel supplying coplimentary drinks for only one person”", "Author": "antoniophilippines", "ReviewID": "UR68435941", "Content": "The provision of shuttle service is convenient The location is okay The charge for third person riding in the bus cost $110, too expensive This is the first time we experience limited supply of coffe, teas, just one pack each The showeroom is a bit small but everything quite okay", "Date": "June 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Good value if you can get a good online deal”", "Author": "Liz_and_Fadi", "ReviewID": "UR67647415", "Content": "I booked this as a secret hotel on \"Wotif\". Based on this price, the hotel was great value - the location is one of the best on the Island - especially if you like shopping. The rooms are very richly furnished and seemed very clean - my only complaint would be that the non-smoking floors are quite clearly not non-smoking. My room smelled strongly of smoke, and one of my pillows was so pungent I couldn't use it - out in the hallways the smell of smoke was quite bad. The staff were fairly attentive, but overall it's the location that would make me come back to this hotel. It's just a short walk from the MTR, and close to all the great shopping areas of Causeway Bay.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Nice hotel, but hard beds”", "Author": "Dae_77", "ReviewID": "UR66580331", "Content": "This is a good hotel located close to lots of shopping. The buffet breakfast was nice and the room was clean. I found the bed extremely hard and I do have a firm mattress at home. Also, the in room safe did not work. Everything else was good, and service was friendly.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Absoloutely Brilliant!”", "Author": "Berry88", "ReviewID": "UR66324526", "Content": "This hotel was absoloutely brilliant. We had initially booked into the airport hong kong by mistake (which was in the middle of nowhere!) but the hotel was kind enough to help us transfer to the Regal HongKong which was perfect. It was walking distance from all of the shops and Time Square which was a great place to go and eat. Service was amazing and staff in the lobby were so helpful with recommending places to visit and giving directions. Taxis into the city were really cheap and available right outside the hotel if you don't fancy walking. And there is an underground station located within walking distance to go to kowloon (or you can get the star ferry, an lovely experience!). They also had a free shuttle bus to the airport which was fully air conditioned. They had a rooftop pool and jacuzzi which was quite small but in the evening the views were amazing. I would definately stay here again, location and service was perfect!!", "Date": "June 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Macau", "Title": "“Just okay.”", "Author": "Venezuela11", "ReviewID": "UR65474712", "Content": "We booked this hotel at the last minute through Wotif and got a good deal. We paid 880 Hong Kong dollars which is a good value for this hotel. Had we paid more, I'm not sure it would have been worth it. The hotel is dated and parts are somewhat tacky. The elevators, for example have sculpted carpet on the walls. The rooms are of an average size. The bathroom was really showing wear and tear. The TV in our room did not work but several phone calls and visits by two different repairmen finally got it working. There was no apology or compensation given by the staff for this inconvenience. The service was not what one would expect from a five star hotel. A sign in the room warned guests not to drink the water, yet the room did not come with any complimentary bottles of water. A bottle of water for 83 Hong Kong dollars was available for purchase. We were told that the room came with wireless internet. It did, but at a cost of 160 Hong Kong dollars per day. We asked the reception questions about the business center. They answered all of our questions yet they failed to tell us that it was closed during our stay. Duh. I thought the bed was comfortable but my partner thought it was lumpy and did not have a good sleep. The room was quiet. I thought the room smelled like cat pee but my partner didn't. What I loved about the hotel was the rooftop pool. Albeit a bit small, the views from the rooftop pool was amazing. It was a great place to relax. There is a newish gym in the basement but unfortunately one of the major pieces of equipment was broken. The gym did not look like it was being cared for. The hotel is well located in Causeway Bay.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A busy hotel”", "Author": "Shawny_K", "ReviewID": "UR65025917", "Content": "The bad: 1. The checked in area I find it rather messy. There is only one queue for both check in and check out. Thus, when the check out counter calls, guest standing at the back for check out is always been seen as cutting queue when the front guests queuing are all checking in. 2. The lobby is always very busy and filled with people. 3. MTR need to walk a bit 4. Price might be a bit steep The good: 1. The location is good for shopping. Short walking distance to Sogo and Times Square. 2. Airport bus stops outside the hotel 3. Staffs are rather helpful 4. Room size is decent", "Date": "May 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“Great location, but tired hotel”", "Author": "SJBangkok", "ReviewID": "UR60602530", "Content": "We got a great deal on thid hotel during a holiday period ... so it feels unfair to say anything negative. The hotel is in an excellent location for shopping & sightseeing. Level of service is acceptable. However the entire hotel is past its best and looking tired. The rooms are what you would expect from a two or three stae hotel. The hotel seems to specialise in tour parties, particularly from China. These guests seemed to get particularly poor service from the hotel staff. However we were our sightseeing all day so the quality of the rooms was not a major issue. I would not recommend this hotel if you value a high quality room & high level of service. I would recommend it as an inexpensive night time spot after a long day of sightseeing / shopping.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Four star hotel?”", "Author": "WYL", "ReviewID": "UR60543762", "Content": "I was on business trip on 24-27 Mar 2010. This hotel was chosen because my usual hotel ( Excelsior Hotel) expecting full occupancy … there is a Ruby Seven during this period. The hotel offered free airport transfer . This is a good point if the traveler has spare time to spare to wait for their van set off at fixed scheduled. The trip from airport to Kowloon took 1 hr ( stopping by Regal kowloon) There were 2 staff attended at the Reception.. resulting a long queue in checking in . We waited for almost half an hour because the staff s were frequently interrupted by guest queries. We wondered how the hotel operates with only 2 staff at the reception. As we booked the deluxe king room, it come with a big bath tub and a small shower room. The toilet provide essential soap , shower gel ,shampoo toothbrush etc. But some things like cotton bud, iron and ironing board are missing. The housekeeping is also quite sloppy . I found my hair in the toilet for 3 days. Unsure whether they sweep it every day. Though I did not place the card to request them to change bed sheet , they still change.The taxi queue in the morning is long if you arrive after 8.30am. The hotel is next to jardian street –which is popular with shop selling fish ball noodle etc. For me, I did not spent a lot of time in the hotel because I need to work during the day. But the nearby eatery is a plus because they operate until 11pm. Regal Hotel ,pls brush up on your reception!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Perth", "Title": "“Great service, convenient location, all around great trip”", "Author": "dandy1983", "ReviewID": "UR54555304", "Content": "We were in HK with a family group of adults from Dec 09 - Jan 10. We stayed at the regal for 2 weeks and found it a fantastic hotel in a great location. It was decorated beautifully for Christmas and the New Year. It was an easy walk to the MTR station (causeway bay) and surrounded by some nice authentic local eatteries, as well as it's fair share of 7/11s! Taxis were always at hand and easy to get to. The staff were very helpful, especially the room service staff. We ordered room service on a number of occasions and it was always prompt and tasty. Twice we ate the buffet breakfast downstairs, which was a fairly standard breakfast buffet for asia although still nice. The pipe duct replacement didn't bother us as we were usually out in the daytime, although we had one small issue with the bathroom roof leaking quite badly towards the end of our stay. Maintaince came and fixed it promptly however. We had three rooms booked as part of the group we were with. The room my fiance and I shared was tasteful (seemed to have been recently renovated) and not nearly as 'over-the-top' with gold gilt as the other rooms had. Rooms were on the small side but clean, and housekeeping was excellent.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Great location, great service”", "Author": "Parisglobaltraveller", "ReviewID": "UR54291564", "Content": "The location is great if you're on a business trip like I was, good service, friendly and warm overall. Hotel looks a bit tired and could do with some make up/refurbishment. Would recommend the hotel to any business travelelr and would return.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Singapore", "Title": "“Beds are uncomfortable, location is good though”", "Author": "PlasticTrees", "ReviewID": "UR53730674", "Content": "I was upgraded to the executive room on 32nd floor as the hotel was full and I stayed with my spouse who was in HK on a business trip. OK I don't normally complain on this forum but let's start with the things I didn't like about this hotel : Firstly, the hotel design is flashy and overly ornate without taste - think mirrors on every conceivable wall surface, chandeliers hanging from all ceilings, elaborate \"baroque\" carvings on cornices and columns, and gold paint on everything else. There is a general muskiness in the air and the hotel seems dated (though clean). My room, despite being an executive room on one of the highest floors, was rather small with a queen sized bed, small work desk and cupboard and a 42 inch flat screen tv. The whole room somehow looked ridiculously yellow due to the copious amount of gold used on all walls and even the ceiling. Ceiling was high and there were nice views from the full height window - you could look out between some buildings, to the harbour. The bed was one of the most uncomfortable I have ever slept on, save for my backpacking days way back then. The mattress is shockingly hard and thin - it feels like you are sleeping on a wooden plank with a thin layer of sponge laid over it. The pillows lose their shape once you lie on them and after a couple of minutes, you will find they have been compressed to the thickness of a pancake. I asked for a \"deluxe memory foam pillow\" from their \"pillow menu\" in hopes of a better sleeping experience. This \"deluxe\" pillow turned out to be as hard as piece of plastic, I kid you not - I must have misunderstood their description or maybe they have a different idea of what \"deluxe\" means. That said, the room, despite its awkward lack of aesthetics, taste, overall comfort and general sense of muskiness in the air, was clean and properly maintained with relatively new fittings. Service was acceptable, with prompt responses to some small requests, but there was nothing that really made you feel extra special as a guest. The good points are : The location - very conveniently located within comfortable walking distance (3 min walk) to Causeway Bay station and a busy shopping node. Lots of shops and local eateries in the immediate vicinity. Free shuttle bus to Hong Kong station (to get to the airport) which departs every 10 minutes. But be sure to jump onto the bus once you see it - if the driver is late on his schedule, he will just shoot off after waiting for just 5 seconds. That happened to me and the hotel manager just looked haplessly on. Free internet. Apparently they have a really fantastic Italian restaurant on the 31st floor but I didn't try it. Overall, I would not recommend this hotel because of the uncomfortable bed and the musky over elaborate design. The bed is really a dealbreaker for me because I think it's important to feel rested and fresh for your day of sightseeing.... Unless you get a really fantastic price for this hotel compared to Excelsior or ParkLane which are also in the vicinity, and you are only staying for a few days OR unless they do something about their beds and mattresses, I wouldn't stay there again.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "reise999", "Title": "“Dirty room, unprofessional staff”", "Author": "reise999", "ReviewID": "UR53141463", "Content": "I stayed this hotel in Jan 2010 for two nights. The room is ok on a first look. But you find very soon how poor the cleaning standard is. I spotted precious gusts hair on the room floor, bath room and the window area. I wonder whether they even vacuum the room floor after every check-out. The front desk staffs are not professional. They speak in such a manner that they are just there to finish the task. They seldom smile and seem not at all to be ready to help you. The hotel pretends to be a good or great hotel. But it is a third class hotel with old facility.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "4.0", "Rooms": "2", "Location": "1"}, "AuthorLocation": "mumbai", "Title": "“good city hong kong”", "Author": "abhishek94", "ReviewID": "UR50946938", "Content": "Our stay in the hotel was comfortable . The room was not quiet big but very cozy for two people but it cant accomodate children .The scene from the window was not very encouraging as it was in the main kowloon market area. the rates were bit high compared to the quality .", "Date": "December 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oz", "Title": "“Regal Hong kong is a top Hotel in a very good area.”", "Author": "nuages", "ReviewID": "UR47834423", "Content": "The Regal hong Kong is well located in Causeway Bay, close to MTR, Harbour, shops, markets etc with easy access to many attractions on the island. We took the Royale Platinum option which includes an extensive range of add ons including, free airport shuttle, free late checkout, breakfast, afternoon tea, cocktail hour, executive floor, dedicated checkin etc. very good value.", "Date": "October 26, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Australia", "Title": "“Convenience to shop around”", "Author": "xaustralia", "ReviewID": "UR36232792", "Content": "I was impress when I check-in, The girl at the Reception desk Panffy (not sure) with big eyes gave me a warm welcome with smile, after checked-in she gave me a map to show me where is the best place to shop. My room was on the 28/F facing part of the park and part of the harbor. What a view.......", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“excellent value and comfortable”", "Author": "poidog7", "ReviewID": "UR33108808", "Content": "While not disagreeing with some of the negative comments in recent reviews, I give this hotel 5 stars because it is a very comfortable hotel that can be had for a reasonable price. If you reserve a room on the internet, you can get a spacious, clean, quiet room for about 1,100 Hong Kong dollars. We had absolutely no problems during our stay. The staff was attentive and very fast. We put the \"do not disturb sign\" on our door whenever we were in the room to avoid room checks whereby someone might open the door at anytime. The decor of the room and the hotel does not suit my taste, but it wasn't enough to bother me. The room was very clean and comfortable. By reserving the room on the internet, the internet access was provided at no extra charge. Both ethernet and wireless were available. If you are forced to pay for it, it will be HK $6/min. or HK $170 maximum for 24 hours. Thus it's best to get the free internet if you can. The location is great-- lots of shops in Causeway Bay and near all manner of transport, including the subway. The chinese restaurant on the third floor was absolutely first rate, but expensive. Recommend trying Mak Noodle shop nearby for unbeatable won ton noodles (ask the concierge for directions). There is a complimentary shuttle bus to and from the airport. Call ahead for directions and times-- you have to go to the Regal Airport hotel, which is next to the airport and about 5 minutes by foot. The bus runs on a fixed schedule and is a good way to see the city.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“I loathed this hotel - but it was good value!”", "Author": "poppag_girl", "ReviewID": "UR32977293", "Content": "My real issue with this hotel is a matter of taste. Dated 'Renaissance' isn't really my thing and I found the whole decor an affront to the senses. So if you like this style - you are much more likely to like this hotel. In terms of pros: the hotel is in a good location, close to the MTR, has decent sized rooms and is clean (housekeeping were lovely), safe and was really good value. On the negative side - there is no bar; nowhere to relax unless you are in the 'club floor' (which didn't seem worth the bother to me); the wi-fi didn't work in the room; the internet was expensive (in many hotels internet is free nowadays); the toiletries are minimal (I spent the first few days going out to buy basics); the bathroom grout needed re-doing; the 'free' newspaper was indeed a free newspaper (the one you get at the MTR station); the door staff only ever opened the door near them (not the one I was going out of); the coffee shop looks like a gilt version of a staff canteen and the decor (personal taste, I know) is utterly vile. Oh & the pool is pretty crap too. So if you don't mind the decor and you need a room for the night - it is a good bet. If you are there for 3 weeks and are interested in Interior Design, run for your life.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thane, Maharashtra", "Title": "“Nice experience”", "Author": "Championofchampion", "ReviewID": "UR32090805", "Content": "It was my second stay in Hotel regal hongkong. It was nice experience.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florence", "Title": "“Very good”", "Author": "bambino68", "ReviewID": "UR30066628", "Content": "We liked it very much, service was very good, rooms big and clean, location super many shops, restaurants, and metro near by. Convenient bus from airport to hotel.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delhi", "Title": "“Great Location”", "Author": "Kamishdelhi", "ReviewID": "UR28466978", "Content": "On the new business side of Hong Kong it has a great accessible location. We were a part of a large group visiting Shanghai and HK and so stayed for 3 nights and were able to do all sight seeing and even go kowloon easily from here.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“My first stay”", "Author": "Henny_Smith", "ReviewID": "UR28147360", "Content": "Hotel is located in down town, I can see part of the harbour from my room. I got a warm welcome by the Bellman when I check-in, staff at the front desk are friendly and helpful. Worth trying", "Date": "April 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Two star service at a Five star price.”", "Author": "JohnsonJ", "ReviewID": "UR22934534", "Content": "After having to endure a half-hour wait to even approach the check in counter, we found ourselves confronted by possibly the slowest and most frustratingly inept staff in all of Asia. No mean feat given the competition for this title on the Chinese mainland. The English spoken is pidgin at best, the staff have no consistency whatsoever as regards upgrade fees, etc (it differs depending on who you speak to), the simplest of requests or questions are met with baffled silence, and the manager is harder to pin down than Spring-Heeled Jack. For the price paid it was altogether a disappointing experience.", "Date": "December 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Good Hotel”", "Author": "specialk8", "ReviewID": "UR21482554", "Content": "We stayed in this hotel for one week and very much enjoyed our stay. Staff were pleasant and friendly. They had already arranged a late check out for us as we had a late flight home. We also ate in the two restaurants and thoroughly enjoyed our meals. We also had breakfast one morning and the buffet was out of this world. We were unfortunate in that we only got 3 days of good weather and so only managed to the rooftop pool once. My one criticism would be that while we were there, men were working at the poolside and made me feel slightly uneasy. Other than that the location was great and we would happily stay in this hotel again.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent hotel”", "Author": "Nickray1", "ReviewID": "UR21400250", "Content": "Very nice, tidy hotel. Very centrally located and only a 5 minute walk to timesquare. Unfortunately it was cold when I was in Hong Kong so it to cold to take a swim in the pool which is situated on top of the hotel. The view however from the top is amazing! The only small problem I had was when asking for an aspirine (tough night in the dragon-I club). Hotel staff could not get me one.. :-( Other things which I can recommend is going to a place called Stanley (only 20 min by taxi). Close to HK but very peaceful and beautiful. Remind my of Mallorca in Spain.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Great Hotel”", "Author": "Jaguar08", "ReviewID": "UR19370777", "Content": "A very comfortable hotel in a good location. (a) Service Without exception the staff of the hotel were friendly, helpful and responsive. Check-in was fast and efficient, check in staff provided information on hotel facilities, found an available room to meet our requested configuration, and were professional and friendly. Concierge provided us with good recommendations for restaurants, shopping and information on surrounding area. F&B staff were attentive without being obtrusive. Housekeeping provided us with extra towels and made-up room on request. In fact, I have never stayed at a hotel where housekeeping responded as fast as at the Regal Hong Kong (and I stay in hotels around 45 days a year). (b) location In Causeway Bay the hotel is located near MRT stations, shopping centres, and markets. Many local chinese restaurants provide ample options for meals at very very good prices! Sogo Department store, local shops, and up-market boutique's all in easy walking distance. (c) Ambiance Whilst the decor may not be to everyone's taste (see website for photos), the hotel was neat and spotlessly clean. The rooms (Deluxe) were good size with good sized bathrooms (including separate bath and shower). The view from the 19th floor was of surrounding high-rise buildings with a small glimpse of the water through a gap between the buildings. Room included table with 2 chairs, a king-sized bed (good support, not too soft), a flat-screen TV, and a couple of mirrors. (d) Facilities A roof-top swimming pool provided excellent views of the surrounding area. We did not have occasion to use other facilities.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Love the Club Floor Room!”", "Author": "mensuno", "ReviewID": "UR18381364", "Content": "Reached hotel at midnight due to my flight. The check in was a breeze and the counter staff who assisted my check-in took less than 5 mins to settle me to my club floor. Before I left the counter, he assured me mine is facing a seaview. The hotel lobby looked ok to me, not that bad after all when I was walking towards the lift. It is indeed the old european style but I think it is still acceptable for Hong Kong standard. The Club floor is from Level 31-35, where level 31 is the club floor lounge area. I was pretty impressed as they have 2 exclusive and private lift access to club rooms. You will require a key card to go to your floor, unlikely the rest of the non-club floors. I presume they have renovated fully their club floors as the carpeting and lighting are different from the rest of the floors. Of course, it smells so much pleasant. When enter my room, it is full of mirrors all over with high ceiling. It is trying to make the room looks bigger but i guess even without it, the 29 sq ft room still acceptable for me. I was pretty impressed with their amenities. They have ipod system, DVD player, coffee blender and a large 42 inch LCD TV. They have all I want to have in this room for a relaxed holiday, apart from shopping of course. Their bed is queen size, though at the hard side, but it is still ok for me. Most interesting for me, is that they have a pillow menu! You can choose different types of pillows for your stay. This is definitely a plus point for the hotel. The bathroom is equiped with a rain shower (quite strong) and a triangular shaped bathtub, interestingly they have included a rubber duck and bath salt for you to soak your body and enjoy it. There is no lock as the shower cubicle and bathroom door are glass walls. You may feel uneasy if you are sharing with friends, but couples or families are fine. They provided a digital weighing machine, and it can also measured your BMI, etc. This is so cool. As for the breakfast, you have a choice of taking at the lounge (with spectacular view while taking breakfast or teabreak) or the cafe. Both are equally good, so you do not worried about it. The cafe design, again it looks tacky, but still it is their style of the hotel. I just concern about their food, which is good enough for me in Hong Kong, though the main good food in Hong Kong should be their local delights! In addition to all, they provide free internet access, 2 PCs for you to use at their lounge, free rental of DVD, free shuttle to certain places such as airport, disney, their regal group of hotels, etc. in hong kong for hotel guests. Not to forget, their roomtop pool was recently renovated and oh my, the view is needless to say, breathtaking with the whole view of Hong Kong island city skyline... what else you need other than a soak in the pool side enjoying the wonderful scenery? Location is undoubtly one of the best in Hong Kong island where it is just near to any part of Causeway Bay. Overall, this is a very good hotel for me during my stay using their club floor facilities. Despite the checkout is a little longer, but it is still manageable with 4 front desk staff to take care of, as long as your time is not their peak period. I will definitely to stay here again straight away if I have gotten the same good deal I have gotten. Highly recommended.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“An average hotel for business travel”", "Author": "SixContinents", "ReviewID": "UR16747564", "Content": "Stayed two nights for business in Hong Kong. Overall an older property with older bathrooms, OK for a business trip but probably better suited as a tourist hotel, with a its great location in Causeway Bay. Pros - Fitness center has new equipment, is reasonably sized for a hotel and has been recently renovated. Includes 3 treadmills as well as other cardio equipment and some free weights and machines. - Bell service efficient for arrivals and catching taxis. - Served by airport express bus from Central or a HK$40 taxi ride from the airport express train station at Central (at HK$100 the airport express is generally the fastest way from Hong Kong airport compared to HK$400 for a taxi). Regal also has a bus direct from the airport but that only runs every 60-120 minutes and can take over 90 minutes for the trip. - Good breakfast buffet with a selection of hot and cold western breakfast items plus some asian food choices. - Housekeeping was prompt when an iron and ironing board was requested. Cons - Didn't find the bed that comfortable, and despite air conditioning the room was humid in June. - No complimentary bottled water in the room and tap water not recommended. Instead hotel minibar charges HK$45 for a 500ml bottle of Evian (by comparison, HK$6 will buy a 1,500 ml generic bottled water at the local Wellcome grocery store a 5 min walk from the hotel). - Hotel laundry is also expensive, at HK$75 for a shirt. With the humidity,if you wash anything yourself it may not dry in 24 hrs. In summary, hotel somewhat overhypes itself on their web site and reminded me of an older, somewhat tired out Vegas hotel. That said, for the price of the room it can be a fine stay in a great location on Hong Kong island.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durham", "Title": "“Excellent location, strange decor...”", "Author": "Saking", "ReviewID": "UR14341071", "Content": "We stayed at the Regal Hong Kong hotel for 5 nights in March and paid £58 per night with BA holidays. At the time most of the 4 star hotels were at least double this price. After reading the tripadvisor reviews I was a little unsure of what to expect but as the price was so cheap I decided to go ahead with it. On reflection I was pleased I did. The staff on the reception was polite and friendly, but apart from checking in and out I didn't have any need for any dealings with them. I'm not sure if it's general hotel policy but upon checking in I was asked if I wanted to upgrade to a suite for approximately £50 extra per night. It provided numerous extra benefits such as the suite (!), free Internet access, buffet breakfast and a shoeshine service (!) amongst other things but I'd prefer to spend £200 in Hong Kong rather than the accommodation so declined the offer. The hotel room was very clean although a little on the small side. However, it contained a large en-suite with a big circular bath. Mini bar, safe, air con with controls and the usual other facilities were present. There were also bottles of water and other snacks in the room but these were ridiculously priced (as an example a bottle of water was about £4.) Internet access is available within the rooms but again this was quite pricey and only available with a laptop i.e. no TV Internet access. The location of the hotel is excellent. It is close to the Causeway Bay MTR and has plenty of places to eat surrounding it. There are also loads and loads of shops in the surrounding area and plenty of malls. In fact, if you like shopping it's an ideal location! The hotel contains several restaurants. However, we only ate at the restaurant on the first floor and although the food was very good it was quite expensive. There are plenty of other decent and cheaper restaurants in close proximity to the hotel. Being really picky, the only negative I could mention is the strange decor throughout the hotel and the rooms. After reading the reviews I expected the worst but I was pleasantly surprised by the hotel, and would not hesitate to stay there again when I return to Hong Kong.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“There are better hotels at better prices”", "Author": "Lock_yan", "ReviewID": "UR12971162", "Content": "Service is awful. Housekeeping sends extra pillows and doonas without their cases or separate from their cases. Takes them about half hour to get these things to you. They also have a tendency to go into your hotel room everytime you leave it. Checking in took a long time. Cleaniness is average. Spa tube in the room needed to be recleaned before we could use it. Rooms are older than what they look on websites etc. Does not live up to the number of stars it claims to be. There are much better quality hotels at lower prices in Hong Kong.", "Date": "January 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Japan", "Title": "“Great Location!”", "Author": "ErikaSawajiri", "ReviewID": "UR11582423", "Content": "I stayed at Regal Hong Kong Hotel with my family for our vacation in Hong Kong last week. The hotel is conveniently located in the heart of the city and is surrounded by a number of shopping malls, which is the reason why I made my reservation as both myslf and my wife love shopping. We were offered a newly renovated room with a great view of the harbour. Unfortunately the swimming pool was under renovation otherwise it would be a perfect stay!", "Date": "December 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Sydney", "Title": "“Louis XV meets chrome”", "Author": "JohnSSSydney", "ReviewID": "UR11277041", "Content": "This is one of the strangest hotels I have stayed in. The reception is a disaster, incredibly busy and shambolic. The decorations are flamboyant to say the least - think Louis XV meets the 1980s. I arrived at midnight to check in and waited fifteen minutes before being seen. I then had to sign an acknowledgement of a change to room rates. My agent had advised it was a flat HKD1500 per night but the rate changes were all ofver the place for the two weeks that I was staying. I agreed to the rate changes since overall they worked out to be HKD1500 per night. To my room, the swipe card didn't work so again down to reception to face more chaos. The room itself was great. Quiet, good bath but the internet didn't work despite not being free. The breakfast buffet is extensive and offers good quality food but the free paper was a local freebie and fairly trite. Then the phone messages began: would I accept a rate change for two nights? I agreed. Then the next day, another phone message from reception, another rate change, this time more expensive. I refused and got the travel agent to take over. The same rate change game happened to a work colleague of mine. After two weeks I was glad to check out. At reception I was told I had watched fee paying movies and would be charged HKD196, trival in comparison to the HKD21,000 bill but I refused. the receptionist immediately lowered the cost to HKD98. Again I refused and after 20 minutes of arguing, the receptionist advised I was the type of guest who caused problems. Definitely stay in Causeway Bay but avoid this hotel; stay in the nearby Lanson if you want a peaceful stress free stay.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Comfortable hotel in Hong Kong”", "Author": "Labeep", "ReviewID": "UR8103554", "Content": "Regal Hotel was a good experience. It was part of the package we bought along with the tickets, to save some money (and spend it shopping in Hong Kong!!!) Located in Hong Kong island, next to Victoria Park it was comfortable and clean. The location was very close to trams and subway station ( Causeway Bay ). Causeway Bay is a very animated area, plenty of buzz, shops and restaurants. The hall was grandiose, a little on the tacky side, with chandeliers and always buzzing with activity. Allow me to invent a word \"Trumpesque\" (I have been a tad too much in Atlantic City, I am afraid...) The staff was friendly and a lot of different services were offered, like massage and fitness center, as well as a terrific swimming pool in the last floor with a great view of Hong Kong! They had a good buffet for breakfast with Cantonese and continental food, from noodles and dim sum to cereal, fruit, bacon, eggs and omelettes cooked on the spot with the toppings of choice. Our room was big enough to be comfortable for two weeks, with a desk and extra seat. In the bathroom, we had a nice round sunk bathtub where I took a dip as soon as I arrived ! :) So, overall, a good experience for a stay of two weeks :)", "Date": "July 11, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "1.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“WARNING \"IN ROOM MINI BAR / EVIAN MINERAL WATER\"”", "Author": "khuranaa", "ReviewID": "UR7188604", "Content": "As a business traveler who aways travel staying at the different hotel around the world this case is the worst. I have just returned from REGAL HONG KONG after checked out I return to the reception desk for some inquiry where I was told, there is mini bar bill that has not been paid. I was quite surprise as I didn’t touch anything, but I was told that I had open two bottle of EVIAN WATER and the bill is around HK$120. I asked whether I can see the actual bottle that I was accused of opening. For the second time I was shock to see two bottle of EVIAN still “FULL” BUT THE SEAL CAP WAS ALREADY BROEKEN. was speech less. This scam made me look like a fool or a low life who drank the Evain water and have it filled back with tap water. After a long battle with the reception employee I was told that I don’t have to pay, which surely I won’t. But anyway, it had made me look very low life in front of the people nearby. WATCH OUT!!!!!!!", "Date": "March 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Good location, easily to get food and shopping till late...”", "Author": "travel:)hippo", "ReviewID": "UR6731017", "Content": "My sister and myself stayed for 5 nights in this hotel. Despite the hiccup during the check-in process, we got a nice room that is quite large (by HK standard) with a queen's bed. It is definitely a plus with the free shuttle service thru/fro HK International Airport. The location is great as it is within 5 mins walk to MTR and along the way and within the vicinity (if you do venture/circle far), you can easily find food and they are quite reasonable. We tried breakfast, lunch, dinner and supper (~ 10pm) there and truly enjoyed them. Our varities range from porridge, egg tart, dim sum, noodles to goose meat rice! Most, if not all, shops surrounding the area opens quite late into night, so you can do late night shopping too, however this depends what you are looking for. Surely recommend staying here if I visit HK again.", "Date": "February 2, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Singapore", "Title": "“Very 80s in feel”", "Author": "velvetcrush", "ReviewID": "UR6051423", "Content": "Bad idea to visit Hong Kong during the convention weeks, where hotels were either fully booked out or charged exorbitant rates. I stayed for a week at the Regal Hong Kong hotel at Causeway Bay, due to the unavailability of the very highly rated Conrad for a business trip at the end of October. Plus point: The hotel is situated conveniently near the centre of the Causeway Bay area for a variety shopping and dining options. It is about a 5-minute walk along Yee Wo street which was filled with characteristic local eateries to get to the middle of the action. The size of the room is definitely bigger than some of the Hong Kong hotels I've stayed. Minuses: This is subjective, but the Parisian-inspired deco makes one feel like being back in the 80s (crystal chandeliers, orange lighting, classic-looking room furniture). Definitely not my type of hotel. I was also quite bothered to find that the room was carpeted, smelt musky and the bath towels were soiled. The pillows were also too soft for sleeping. However, it also appears to be tremendously popular with the Asian tour groups so valet service tends to be either lackadaisical or you won't even be noticed as you enter the hotel lobby. Unfortunately, I would not return to stay if I had a choice, due to the overall unpleasant experience. Try Lanson Place or Jia which is just across the road and is possibly for people who prefer new modish rooms at approximately the same prices or just by paying a bit more.", "Date": "November 3, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Tatty around the edges”", "Author": "Cowombat2", "ReviewID": "UR5889582", "Content": "I am staying here as I write. My local secretary booked this because all desirable hotels were booked out this week and I gave zero notice of coming. This place is tatty. It tries a baroque'ish style, but then has items in the room that try to be 21st C modern in design - eg the room service menu stuck in a holder. While it has been repainted etc, there are many shortcomings such as getting into the lift, and the light on the button for my floor doesn't work, the cracked tiles in the bathroom, no phone on the desk, safe deposit box doesn't work, ac which is turned up to 26 degrees on the display, but is really about 17 degrees in the room. I tried the gym yesterday. $50 HK entry fee for a tiny room with 6 machines, one of which was broken. I tried a treadmill, but the controls seemed not to work. The attendant had no idea how to program it, so it also was unusable. At HK$1600 for an executive room incl internet and breakfast, this is way over-priced. For this money I expect reasonable decor and facilities that work properly.", "Date": "September 28, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Gravely under-par”", "Author": "yrtx4e", "ReviewID": "UR4896626", "Content": "Regal Hong Kong situated at the quiet end of Causeway Bay, a major shopping area on the island. It's 10-min walk through elevated footbridge from the subway station. The room is standard and the room is kind of worn out. Our room had a dampen odor which we gathered is from the carpet. It claimed to be a 4-star hotel, at most I can rate it as a 3-star judging from other high quality 4-star hotels in other Asian cities that we visited. The grave disappointment was their flagship restaurant --Zeffrino on the top floor. We treated friends from California who stayed at the Hong kongPeninsular Hotel for lunch there. The restaurant is extremely short of staff. We arrived at 12:25pm The restaurant was 1/3 filled with only two servers running around as reception host and servers. No matter how competent the two servers were, many guests were receiving inadequate service. The lunch menu was disappointing comparing to many lunches we had at other 4 or 5 star-hotel restaurants. We had to entice our guests to choose from the more expensive a la Carte menu instead. Fortunately, two management staff were crusing in the restaurant, I approached them and made a courteous complaint. I was astounded to hear the defence from the Accounting Director. I was told there was a private function at the other end of the restaurant that rendered the short of staff!!! I wondered how come they didn't close the restaurant to cater to that private function rather ignoring the restaurant patron at large!!!!! I found that discriminating explanation hilarious for a renowned Regal chain in Hong Kong!!!. At around 1:15pm, the peak of the lunch hour, we saw a few more servers, a reception hotess and a gentleman who possibly be the Maitre d'hotel gradually phasing in. We were pretty embarrassed to treat our friends there with such under-par service. There are many choices in Hong Kong for quality accommodations and gourmet cuisine. However, Regal chain may not be our choice on our next trip.", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“okay..not great...”", "Author": "annika59", "ReviewID": "UR4559778", "Content": "Stayed here because most of our other regular hotel choices in Hong Kong were not available. Overall the hotel was alright, the location, as was mentioned early was excellent. Just a stone's throw away from the Causeway Bay shopping district, there were also many excellent local food outlets nearby. One main gripe about the hotel is the decor. I got the whole idea of the \"Regal\" hotel, but the decor was a bit too much to take. There were simply too many paintings hanging around--both in the corridor and in the rooms. One thing the rooms could have done more with was lighting. The room did not have a central light, so even with all the lights on[foyer, bedside, table and standing lamp included], the room was still rather dim. The hotel room is also covered with mirrors--just like the hotel lift--you don't have to worry about whether your hair is out of place because there are plenty of opportunities to check yourself before stepping out of the hotel. The staff at the hotel was thoughtful though--we were 3 to a room and they brought 3 sets of everything without our asking. I'm not so sure about how clean the room is though, the room slippers(provided by the hotel) that we used remained in the exact same place before and after the room cleaning. Overall though, the hotel felt clean and and more or less felt like a 4* hotel, albeit one on the lower end of the spectrum.", "Date": "February 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow, Scotland, UK", "Title": "“A good standard hotel with excellent location.”", "Author": "Glasgowtraveler_79", "ReviewID": "UR4108528", "Content": "Being a well travelled travel agent, I have stayed in some of the best hotels in the world. For example, the last two times I was in Honk Kong for work, I stayed in both the Shangri La and the Peninsula. I moved to the Regal after being displeased with a previous hotel for a 4 night stay, and although its not anywhere near the standard of some of the other higher rated hotels, it is still worthy of its 4* status. The location is excellrent, within easy walking distance of Causeway Bay. The gym is need of a little work but I have seen a lot worse. The rooftpop pool is very pleasent. The decor is not old-fashioned, it is in a 'Regal' style. It is the way they want it to look and I felt that although it was nice, it was trying to be a little too opulent for its own good. I don't know about what type of room the previous reviewer stayed in because my room was very large, with two double beds, floor to ceiling windows and a very spacious bathroom, which had a corner bathtub and seperate shower. Apparently each room has a huge individually commisioned painting above each bed, above ours was one of a butterfly, which at first I thought was a little garish but grew to rather enjoy it. If I was travelling on a budget, or if I couldn't get into the nicer hotels then I would stay here again.", "Date": "November 13, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“This is never a 4* hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3985163", "Content": "We visited The Regal Hotel in Hong Kong in February and thank God it was only a short stop on our trip. The Hotel is rated as a 4* hotel but I have stayed in better hotels that were only rated with 2*! The decor is so terribly out of date, the rooms are incredibly small and every time we turned the lights on they blew. The gym was located in the basement of the hotel and was in a tiny room that consisted of about 4 machines. In fact every aspect of this hotel was old, grubby and needs a huge overhaul. The only positive asecpt was the staff, they were friendly, polite and extremely helpful. I would never stay at this hotel again.", "Date": "October 3, 2005"}], "HotelInfo": {"Name": "Regal Hongkong Hotel", "HotelURL": "/ShowUserReviews-g294217-d302174-Reviews-Regal_Hongkong_Hotel-Hong_Kong.html", "Price": "$183 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.88 Yee Wo Street, Causeway Bay</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "302174", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/26/7d/267d63b5f104e6e3ef2038f10f3009325large.jpg"}}