{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Better for businessmen”", "Author": "JazD32", "ReviewID": "UR139430708", "Content": "Our first impression of this hotel was not a good one. It looks nothing like the photos and it took over an hour to check in as they had trouble with our reservation and were quite rude. We were then placed in a terrible smokers room that resembled a cave that needed a good clean. After being upgraded we were then placed on the top floor which had a nice view of the construction works happening across the hwy. The location can only be described as inconvenient for anyone wanting to see any sights of Kowloon/Hong Kong. The hotel has no real facilities other than for businessmen so I advise that you should only stay here for business purposes. I will say that the buffet downstairs was amazing for any meal however the restaurant on the top floor was really expensive and truly disgusting.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great sleep but average hotel”", "Author": "AspasiaM", "ReviewID": "UR137847272", "Content": "Beds are really comfortable and the hotel is very quiet at night so we got a good sleep. Was not that happy to have people smoking on the non-smoking floors. Free wi-fi in the lobby is also very temperamental and will only work occasionally. Service was good and breakfast was nice. The location is very interesting, you get to see a different side of Hong Kong compared to being on the island. Would recommend it for a short stay.", "Date": "August 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“Wonderful repeated stay in Kowloon City”", "Author": "Samliketravel", "ReviewID": "UR137219289", "Content": "Not the first time to stay in this hotel within two years, booked it in hotel website and got a special offer including free Wifi, breakfast and airport bus. value for money!! The reception staff was very professional and offered me choice of beds in our room, two queen beds or three single beds, we picked a room with 3 beds since we are family of 3, the room was very spacious and modern, bed was comfortable, unlike the other hotel with two beds plus one rollaway bed. I told her we got a afternoon departure flight, without hesitation, she allowed me stay in room till 2pm instead of 12noon The lady cleaned our room was very polite and efficient, she always greets me with smile, Last day I saw her, she even carried the luggage for me to the lift. breakfast was good with some typical Indian and Oriental dishes but most of them were Western, love the fruit, very juicy and fresh. Although there is no MRT station near hotel, public transport are convenient, there are bus stop near hotel which brings you every where like Mongkok, Tsim Sha Tsui and even Ocean Park, I also tried HK MRT, I must stay taking bus is more comfortable and the ride is more interesting as there are much to see.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "", "Title": "“Terrible !”", "Author": "puja_gupta18", "ReviewID": "UR137032427", "Content": "I stayed for 2 nights , hotel is TERRIBLE .The roadside noise doesn't let one sleep all night . Bed is full of mosquitoes . Staff is very very rude .Room is TINY , no space to move around in the room . WC stinks of some terrible toilet cleaner . Breakfast is terrible , waste of money , please don't ever never stay !", "Date": "August 13, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New Delhi, India", "Title": "“Far Away from the city!”", "Author": "Ananta_Baheti", "ReviewID": "UR136363001", "Content": "Regal Oriental is located at the end of Kowloon island and is not well connected to the MTR. The hotel offers decent sized rooms.The rooms are nice,clean and comfortable. The breakfast layout does not have much variety and service is really bad. They take a long time to refill the dishes. The reception took a long time to hand over our keys and tired us more after an overnight flight.The person at the reception provided us wrong information about the Sky Observation Deck which was in Kowloon and he said it is in Hong Kong City.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Nothappyjan”", "Author": "Champs12", "ReviewID": "UR135500264", "Content": "My husband and I stayed at this hotel for 10 nights as part of a group booking. After requesting a non-smoking floor was allocated a room which was clean but definitely could smell cigarette smoke on entry. Thinking it would clear, settled in only to find it got worse through the night and could smell waves of smoke coming in through air conditioning. Had sleepless night and next day requested to be moved to another floor with no smoking. Staff were professional and friendly, however we had to wait most of the day for another room to become available. When it did we inspected it and although it was a downgrade we were happy enough. Through the day though we noticed the toilet wasn't flushing properly and at 4.00am it backed up, crap and all, it started to overflow, and was coming from along the system! On complaining, was attended to promptly but had to request that mess on floor be cleaned up which was done by wiping up with towels, no disinfectant or anything else! But that wasn't to be the end of it, there obviously was something fundamentally wrong with the whole plumbing system on floor 6 as it backed up each day we were there and we noticed plumbers unblocking toilets in nearby rooms, so an overhaul is obviously needed. As well as this there was a musty smell about the air conditioning which I suspect could use an overhaul as well. I would not stay there again, but I do reiterate that the staff were friendly and attended to problems promptly.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "AGRA, INDIA", "Title": "“WORTHY PLACE”", "Author": "BRIJESH67", "ReviewID": "UR135270229", "Content": "This hotel is located near old Hongkong airport and may seem to be little bit distant but in practical terms it is very conveniently located and is worth every penny. Hotel does not have any MTR station nearby but has a direct bus from hotel entrance to Kowloon Tong station. The rooms are big enough from HK standards and price point of view. Rooms are very well maintained and are provided with all possible facilities . The WIFI is expensive but I was told by reception that if booking is done directly through their website, it comes free. One drawback from my point was non availability of Indian restaurants in nearby locality and for that I was supposed to go to TST every time. Software content available on TV was more than satisfactory. In nutshell this place deserves a repeat visit and will definitely stay again.", "Date": "July 24, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Reasonable hotel if you get a deal”", "Author": "Nzkop", "ReviewID": "UR134876564", "Content": "I stayed at this hotel as it was an offer on a 'Mystery Hotel' deal and I was on my own for just the one night. Check-in was very quick and professional and the entrance was well laid out. The room was huge (enormous by Hong Kong standards) and reasonably clean with a good sized bathroom and a very comfortable bed. The tv and signal were poor. Decor was dated AND retro which didn't work. The door to the adjoining room meant you could hear the occupants next door. Location is away from the main tourist areas so you have to bus/taxi everywhere. For a holiday or longer stay, this hotel is too far removed from the bustling centre of Kowloon to justify its full rate. I have stayed in Kowloon many times. Hotels around Tsim Sha Tsui/Nathan road are your best bet.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane", "Title": "“Get rid of the smokers”", "Author": "CathG73", "ReviewID": "UR134343921", "Content": "Hotel is being renovated but older rooms are fine. Staff are extremely helpful. The stench of cigarette smoke however is horrible and we left with it in our clothes, bags and unfortunately our lungs. We had one room change for this reason and were on a non smoking floor but this didnt help. Non smoking is a joke as I had to walk past a man draped in nothing but his towel smoking in the hallway one morning - the poor housekeeper was left coughing as she walked past with her trolley. This hotel is away from the tourist areas however public transport and taxis in Hong Kong are cheap and excellent.", "Date": "July 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“What you see is not what you get”", "Author": "onemoremoondance", "ReviewID": "UR132695917", "Content": "I assumed that the photograph of the room on the hotel's website was representative on the room that we would get. Having paid for a Deluxe Suite we were excited by the prospect of a week in the funky room. Doh! The room was nothing like in the photograph. As in, not renovated. Not funky. Not anything. I should have realised at check in that all was not as it seems when the receptionist filled in 21 breakfast vouchers by hand, keeping us waiting while she laboriously hand wrote on each one. When we got to our room, I was so tired, and so didn't want to start an argument after ten hours travelling. But there was no extra bed, in spite of us requesting that. And a distinctly un-funky room. I could go on about the coffee machine that didn't work, or being billed for two coffees that Housekeeping tried to make to test the first coffee machine, but failed, but suffice it to say that it was only after our second day that we found out that our room entitled us to access to the iClub lounge, with complimentary breakfast. And free wifi. If the receptionist had explained this, instead of individually annotating 21 vouchers that we didn't use, the first impression might have been a bit better. My advice is this; this is a tired hotel, out of the way, and if you are planning to pay extra, make sure that you are certain that what you are getting is what you expect. treat the photos on the hotel website as a fantasy that the designers once had, rather than a realistic impression of what you will get. And make sure that the receptionist spells out to what is included in your package on arrival. Or stay somewhere else ;-)", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“wonderful hotel”", "Author": "siddharth d", "ReviewID": "UR132084360", "Content": "i stayed at the oriental with my wife and daughter for 4 nites and was really impressed by the warmth and the hospitality of the staff. the front desk and the concierge were very helpful;the buffet breakfast was excellent and a lot of local chinese eating joints nearby.most of all we liked the helpful attitude of the staff and taxi rides to other locations were not that expensive. will definitely stay there again", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Xi'an, China", "Title": "“Dated but Decent”", "Author": "sschirmer330", "ReviewID": "UR132064095", "Content": "The hotel is an older Hong Kong hotel outside the main tourist area, which I prefer. I've stayed in many hotels in Hong Kong through the years and have mixed reviews on this one. Pros: The staff was very courteous and their English ability was very good. I had no problems communicating with them at all. The price was great for Hong Kong. The room was big and I could fit my whole family of four in the room, each of us having our own bed. The beds are clean and comfortable, not like the super hard beds I've had elsewhere which is normal for Asia. My room had double windows which kept all the noise outside, which was very nice. The location is great to be able to see local Hong Kong culture without a bunch of foreigners running around like myself. It's located in Kowloon City which is a nice area. Cons: The rooms are dated. They said they gave me a non-smoking room although it had 2 ash trays and it smelled like smoke. I can safely say, it was NOT a non-smoking room. The bathroom, under the sink, and parts around the window in the bedroom had mildew which seems to be a common theme among many of the reviews I read before. The fridge barely cooled anything and stunk so we decided not to buy our kids any milk for the morning time to place in it which meant I had to go out every morning to buy some fresh milk. Internet in the room was about $20 USD per 24-hour period which is too expensive and not worth it. You can buy roaming hot spot connections in Hong Kong, which are convenient to use for less than that for a whole month's use. Conclusion?: I'm not sure I'll stay here again. There are much cleaning (referring to the mildew) hotels out there in areas just as far from the tourist places that are newer, same price and in better condition. So I'll probably go back to those. I didn't have a horrible stay but I think I can find better. I might be up for trying out the Regal Hotel in Kowloon next time to see what that Regal hotel has to offer.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Bengaleru", "Title": "“Its far from Downtown but splendid : Book ur stuff in advance .Its nt Bad as it appears here on reviews”", "Author": "Surendra P", "ReviewID": "UR131728265", "Content": "A good stay in Regal Oriental and a great travel package by Antilog Vacations to Hongkong .Their rates are the lowest and services very good for Hongkong and Macau tours in general.Now , The Regal Oriental Hotel in Kowloon, Hong Kong whilst being very comfortable, this hotel ha s a lower review because of its remoteness to most tourist hot spots. So keep that in mind, if you are visiting for the first time. Its relatively cheap but not close to the major shopping centers in HK. You have to take their shuttle or taxi yourself.However we had all our tours booked in advance so no problems really. Breakfast is impressive, there's American, Indian and Asian food available and its quite good.The's room in itself is good, nice clean bathrooms. But I was on a low floor, at highway level, so it was loud all night long. So request a high room. The staff were friendly but not knowledgeable nor very helpful on local tours or the surrounding area. A surprising turn was that just outside the hotel, there is a bus stop for bus 25 - this is about 5 mins ride (HKD$4.90/person) to the nearest Kowloon Tong MTR station. In the vicinity of the hotel, there are many small shops for herbs & good/cheap dim sum eating places - people are very friendly and will go the extra mile to just help you with a direction. The Bar was also very good with they showing all the BPL matches and the lobby is very big for visitors and persons waiting for thier tour guides friends etc. There is wi-fi facility, which was convenient but it is charged with the number of port connections, so if you have two devices you will be charged twice. This hotel is very good, clean and service was great. The hotel was well air-conditioned. The only problems was from the pictures it shows on the hotel web site are incorrect as the hotel faces the other direction so don't over look the bank of China tower and the fact that its away from the main locations. Should be fine if you know the place or the local language.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Santa Monica, California", "Title": "“Decent Place to Sleep”", "Author": "Elisabeth22_10", "ReviewID": "UR131096383", "Content": "My trip to Hong Kong was as busy as can be. I was there for a big event in Kowloon Bay, so Regal Oriental was chosen for it's location. The price was pretty good and for my event I was easily able to grab a taxi over to the International Trade & Exhibition Centre for roughly 45 yuen, about seven American dollars. The service at the hotel is great. It is a little strange that you check in and out on the third floor and not the lobby, but once I knew how it worked, it was no problem. Everyone who works there speaks English and was very helpful. There was a terrible smell in the bathroom when I first arrived, a little like sewage. I reported it and wanted to change rooms, but I had very little time. They sent someone to check on it and clean it while I was away and it did help. I never did move rooms and the smell never completely went away, but I kept the bathroom door shut and when I was in the shower, I couldn't smell it. My room was nice otherwise, I slept soundly which is what I really needed it for. Our group used their Oriental Ballroom for the last few days of our event and it was lovely. Overall, it is well worth the price.", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hyderabad, India", "Title": "“CLASSICALLY BEAUTIFUL AND HOSPITABLE HOTEL”", "Author": "saroshsb", "ReviewID": "UR130988213", "Content": "This Beautiful hotel which is slightly off the tourist beaten track in Hong Kong but is situated in the ethnic city of Kowloon is a wonderful place for a traveler to explore Hong Kong away from the glitter of Central district. Its location in the middle of the Thai Ethnic part of Kowloon City within easy reach of the Big Mac and other Indian and other eateries make most foreigners at home. Its ambience is beautiful of an old world international class hotel with all the glitter and brass around. Their staffs are also helpful and hospitable. Wonderful value for the money no doubt.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "South Pasadena, CA", "Title": "“OK stay”", "Author": "WWLL", "ReviewID": "UR130710481", "Content": "Regal Oriental Hotel, Hong Kong When I first came to Hong Kong sixty years ago I lived a stone's throw away from the site of the Royal Oriental, in an area then not reached by the Royal Hong Kong Police. For the next six years I lived within a half-mile. The Regal Oriental had its heyday when it was the hotel nearest to the Hong Kong Airport. Since the Airport moved away in 1997 it has had serious decline. It is now being renovated in anticipation of the opening of the Hong Kong Cruise Terminal to open in 2013, within sight of the hotel. I got a room on the third floor. The windows looks out but is blurred. The room is irregular in shape. There is a circular mirror in the ceiling but not over the bed. Everything works. The bed is soft and comfortable. Lighting is great. For the first time in many years I had to request a power strip for my CPAP. Internet is HK$5/minute in the room. Each guest gets 2 hours of internet use in the lobby. The Airport Bus A22 makes a stop near the Regal Oriental. From the Airport the stop is about 200 meters walk. To catch the A22 to the Airport requires a seven-minute walk, down a tunnel underneath Prince Edward Road, a major thoroughfare. The immediate neighborhood of the Regal Oriental is not upscale. It is full of motorcycle and automobile shops. Above these shops it is residential. As they were directly in the landing path nobody wanted to live in this area. Now that the airport is gone this area should receive some development. I did not try the restaurants in the Regal Oriental but had a discovery. Ever since the Michelin Red Guide gave one star to Tim Ho Wan, a dim sum place with 24 seats, imitations have sprung up. Karful is such a place. It is about 50 meters from the Regal Oriental. It has about 35 seats. You will have to share a table. They will even move you around to accommodate other customers. The dim sum is first rate and freshly prepared. My friend who used to run banquets for major hotels thinks this is a good place. Top price is for siu mai, HK$22. Most items are HK$16 to 18. Tea is HK$2 per head, not the HK$ 8 to 16 at some of the names. Karful is at the Prince Edward Road end of the one-block long Kai Tak Road. The two roads do not intersect. The gym is tiny.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Madrid, Madrid, Spain", "Title": "“Internet is NOT FREE”", "Author": "Gualterio P", "ReviewID": "UR130074487", "Content": "The hotel description says: \"free high speed internet\". Well, it is NOT free. almost 20 euros / 24 hs. Hotel is fine, but I really don´t like when I have to pay for ammenities that were included in the room price at the first time.", "Date": "May 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dover, United Kingdom", "Title": "“Fantastic Hotel....”", "Author": "Emma t", "ReviewID": "UR128870385", "Content": "After arriving at the airport with 2 small children (2 and 6) and bags and bags of luggage! a kind man pointed us in the area of the regal stand in the airport! fab! Shuttle service to the hotel not very expensive for the 4 of us and (2 year old Free) they allowed us to use the conecting regal hotel play room which can only be descibed as amazing!! kept my 2 amused for ages! Shuttle bus to the Hotel this did take 45 mins as they pick up and drop off at other hotels and Disney but great for sight seeing! Hotel staff all spoke english to an exceptional standard, taken to our rooms, very nice rooms very modern and spacious couldnt fault, checking out was painless and staff again able to help with the shuttle bus back to the air port would highly recommend to anyone travelling with children!", "Date": "April 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“The good, the bad, and the ugly-by samflyer”", "Author": "samflyer", "ReviewID": "UR128579401", "Content": "The Regal Oriental (Kowloon) is located in central Hong Kong. For Americans, the quality is comparable to a Ramada or a Motel 6 (no offense to these hotels). It is located in an area that is near the old Hong Kong Kai Tak airport, it's not the best area in HK, restaurants nearby are mostly local Chinese street type. The views from the hotel are of the dirty buildings across the street. Internet is nicely priced at $23 USD...HUH? And lastly, the neatest metro station is a 20 minute walk, yep, 20 minutes. That's why there are numerous buses queued in front of the hotel. The rooms are dated, however the one I stayed in was acceptably clean, however the age of the hotel and rooms are evident. There is a restaurant on premises, it's American type fare, highly priced for the quality (or the lack thereof). The good: 1. The price? My room was covered on a business trip, however if the price is clearly lower than all others and you don't mind the neighborhood, perhaps this might work for you. The bad: 1. The price of Internet ($23 yikes!) there is free wifi in the lobby 2. The surrounding area leaves lots to be desired, lack of quality restaurants, and shopping. The ugly: 1. No metro stations within 20 minutes walking.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kowloon Hong Kong", "Title": "“Excellent Service from Sammy Yip ( Senior Rooms Manager )”", "Author": "Regnig22", "ReviewID": "UR128504636", "Content": "Excellent service from Mr Sammy Yip here who as Senior Rooms Manager went out of his way both before and after our arrival at the hotel. We have stayed 4 times at this hotel now and although quite a way from the main tourist area it has proved to be a most suitable choice. Not a 5 star, but the room was superb with a view over the proposed site of the new Ocean liner terminal. Complimentary breakfast and daily newspaper also much appreciated. Shall definitely stay here again. Keep up the good work Sammy From your Favourite Air Force General.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Cairns", "Title": "“Isolated”", "Author": "Jocy_12", "ReviewID": "UR128144205", "Content": "We stayed here for 3 nights (husband, me, and 2 kids (14 and 10). We were in a quad room which was a normal (small) room with 4 single beds jammed in. Other reviewers mentioned that this hotel is isolated to which we definately agree - it is located adjacent to the old airport (nothing there now), against 2 expressways (although the room was quiet). Taxis to town or Nathan Road area are plentiful, quick (20 min) and cheap (approx $HK60 each way). It is however a low cost option for a family and it came with a basic buffet breakfast and shuttle from the airport..", "Date": "April 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Not ideally situated for main town”", "Author": "Chander_62", "ReviewID": "UR128006787", "Content": "Reasonably Ok hotel. A little far from the town but bus no 9 and 1A from accross the road takes you to town at a cost of about $6. We booked in advance through Agoda and should have had vouchers for breakfast but the hotel staqf not prepared to accomodate.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Chennai (Madras), India", "Title": "“First Visit to Hong Kong”", "Author": "Anand0511", "ReviewID": "UR127275012", "Content": "Stayed at the regal oriental from 25'th to 29'th Mar '12. We were booked into this hotel by a travel agent. Overall for the price it was a good experience. We travelled by a regal shuttle service from the HK airport to this hotel. We had to wait for an hour for the shuttle as they departed at specified times. We were checked in to a room in the top most floor. The rooms were clean and so was the bathroom. The carpet though smelt of smoke and we requested for an air freshener. A person was promptly sent to our room and it was taken care off. The hotel staff were friendly and helpful. We did try to connect to the internet in the lobby and had some initial difficulties on the first day ( the problem could have been on our side). Also another tip donot use internet in your room as you will be charged for it. The other point was that the bed was a little hard, but i prefer a hard bed so that was not a problem for me. The room was in oriental style and cosy The hotel breakfast was ok but it had some vegetarian indian Options also which my wife enjoyed. It was decent overall could have been better with some fruits though. The disadvantage of the hotel is that it is located away from the MTR station you have to take a cab if you wish. Alternatively a bus can be taken. We travelled from the avenue of stars in Tsim Sha Sui back to the hotel by bus No. \"5c\" it costs about 6 HKD and was fun. Alternatively taxi costs about 53 HKD which we took while going there. The hotel staff were prompt and friendly they were helpful and overall it was a good experience. I would recommend the hotel to anybody visiting HK though i would probably also tell them they would be better off staying near an MTR station like the Holiday Inn or Shangri La in Kowloon. For the price the hotel is decent. Hope this helped.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Orange NSW", "Title": "“Great value for money”", "Author": "LucyOrangeNSW", "ReviewID": "UR126526897", "Content": "I stayed here with my parents in October last year. This was our first trip to Hong Kong and the room was booked through a travel agant. We stayed for 6 nights The rooms were clean and very nice with an oriental feel. The rooms were also quiet large. Breakfast was buffet style and had a good selection daily Originally we were concerned it was too far away from the city but it turned out it was great. A taxi to the city cost around 50HKD. The area was more of a local than tourist based, we had a great time exploring the local makets and we also visited the Kowloon Walled Park which was in walking distance to the hotel.", "Date": "March 23, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Auckland NZ", "Title": "“No free lunch.......”", "Author": "derrickbAucklandNZ", "ReviewID": "UR125692201", "Content": "Unusually, I am writing a review of a hotel that I have never seen and not stayed in. Why? Well, a short story. I am planning a 2 night stopover in Hong Kong in a couple of weeks time and looking for a good deal, I looked on \"Wotif.com\" for a reasonably priced hotel. It didn't have to be on the Golden Mile - I know HK fairly well. I travel between home ( New Zealand) and Europe twice a year, and fly on Cathay Pacific when practicable. Wotif had a \"mystery deal\" for 725$HK per night for the stay. so I booked. To my dismay, this hotel were offering the same room, for $625, two days later, including shuttle to and from the airport and internet in the room included. I complained to Wotif - the answer - sorry, thats the rate. We have contacted the property and that was the rate on the day you booked\" They contacted the hotel. \"Upgrade\", they enquired. No chance. \"Cancellation? \" No chance. So muggins is paying considerably more, for paying and booking in advance. Not a good start. Ill review the hotel later. Best of luck with that. OK, it's not a fortune ( and to be fair, I was happy with the rate, until it could be got cheaper) oh, and by the way - Wotif are offering it today at $660 - still more than the property's direct price !", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Bologna, Italy", "Title": "“not so good but not so bad.”", "Author": "Luca C", "ReviewID": "UR125645174", "Content": "The hotel is in the high part of Kowloon. Rooms are not big but, compared to chinese standards, reasonably clean. The personnel is nice and smiling, instead. At lease so has been with us. The main problem of this hotel is the position, very far from the nearest metro station and so reaching any place in HK takes a lot of time. Is true that taxies are indeed cheap and this solves partially the problem.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Livingston, NJ", "Title": "“Stayed 7 nights. Good experience.”", "Author": "WingLivingston", "ReviewID": "UR125572850", "Content": "Stayed 7 nights in a Quadruple room (#513) at Regal Oriental Hotel, Feb 19 - 26, 2012. Don't understand how other reviewers rated this hotel so badly. We enjoyed our stay. The hotel was recently renovated, and well maintained. Staff was friendly and helpful. Room: We checked in late, and our room (513) was ready. The room was a bit stuffy, but once I got the A/C cranking, the room was comfortable after a short while. Had to keep the A/C around 20 C as it was unusually humid during our stay. Our room was not as big as it was on the picture, but it was adequate as there is a limited number of hotels in HK that can accommodate a family of four. Transportation: Closest MTR station is at Mong Kok. You can catch a mini bus outside the hotel to Mong Kok & switch to the subway. There's a bus stop outside the hotel, as this is by the old HK airport. Ask the Reception desk for local map. One side have restaurants, shops, banks, etc, the back-side have bus numbers and locations. Safety: We felt safe at this hotel, as HK is a pretty safe place. I'm a smoker so there were several nights that I smoked outside the hotel after midnight and didn't feel unsafe. We would go back to this hotel the next time in HK.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bangalore, India", "Title": "“Decoy photographs, unfriendly staff, bad food...”", "Author": "NSNMURTY", "ReviewID": "UR125221861", "Content": "We relied on the hotel pictures and also reviews on tripadvisor to book this hotel and stayed for 3 nights. I had terrible first night, where the wallpaper was peeling, you can see aluminium box behind the bed that was for wires!!! (never in my life I have seen this kind of stuff - not even in the serviced apartments). For other travelers and also for Tripadvisor - there are several facts, that are not correctly mentioned in the reviews below - This hotel photographs are not real, the harbor water view is miles away....cannot be seen at all - The staff is very rude and unfriendly - The rooms are just average any Indian 2 Star Hotel rooms will be much better - They don't even provide water in the room...don't even have an option to buy it - In the middle of the shopping/ mechanic area....this is really far away from all the good locations - Very noisy and badly maintained - The breakfast is very bad, for HK$140 per person - you literally get peanuts! - And above all if you are vegetarians then you have starve....the room-service people don't understand english at all. The only good thing is the concierge, they are helpful", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dumfries, United Kingdom", "Title": "“I really liked this place. An elegant hotel at a good price.”", "Author": "UkBill", "ReviewID": "UR125037444", "Content": "This is a really pleasant hotel. The area in Kowloon isn’t wonderful, there seem to be dozens of car repair shops in the local streets. And the view from my room wasn’t anything to write home about. Just building works and scaffolding, and countryside in the far distance. However Hong Kong transport systems are excellent, it’s easy to get to anywhere in HK by local bus for very low cost, day or night. The hotel staff are all really pleasant, the room (I got room 1149) was large, well furnished, and very clean. It was a cold period in February, the air conditioning had trouble making the room warm, but within minutes of reporting to reception, I was provided an electric heater. There’s an excellent large ground floor bar area, and the food in the 3rd floor restaurant is good. I went to see the skyview lounge on the 14th floor which looks impressive but didn’t sample the food or drink there. The hotel provides free in-room security safes, and there’s free wifi in reception. There’s a daily restocked minibar in rooms, the prices are actually less painful than one normally expects in nice hotels. This is, as I’ve said, a nice hotel but it’s in Kowloon, maybe 30 minutes bus ride from central Hong Kong. But they offer excellent pricing, great rooms, good service, a friendly bar, and welcoming staff. I’ll return there.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Close, clean and functional”", "Author": "mkf49", "ReviewID": "UR124843949", "Content": "Having stayed at Regal Hotel Hong Kong airport a number of times over the years, I have always found the staff helpful and efficient. The rooms are clean and generally quiet and it is only some 200metre walk from the from the arrival/departure hall. There is a selection of restaurants available at the hotel or if all else fails plenty of eateries available airside. The gym is spacious and well equipped. If you have time to spare downtown HongKong is easily accessible by the closeby high speed train. An added bonus is that TV's in the rooms has a channel listing all departures and arrivals of flights", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“One night Experience at Regal”", "Author": "Sunil P", "ReviewID": "UR124251010", "Content": "I just stayed for one night at this hotel, but it was a very clean and beautifull hotel. A bit away from the action and city you need to take a taxi or transport to reach and MRT. ONLY ONE BAD THING ABOUT THIS HOTEL WAS THEY DID NOT EVEN PROVIDE 500 ML COMPLIMENTARY MINERAL WATER. They provide you with free 2 hr internet at the lobby which is very good. Rooms are clean Bed is soft. Staff are friendly The price was reasonable", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chico, California", "Title": "“A little far from all the action, but a great hotel for the price!”", "Author": "Katandcoot76", "ReviewID": "UR124090939", "Content": "My fiance and I traveled to Hong Kong for Chinese New Year. Most hotels were already booked and or tiny tiny rooms. The Regal was an excellent price and a nice spacious room! We were looking for a non-smoking room and one with a view of the city/harbor. They were able to accommodate us with no problem, and we even got an upgrade for no extra cost. If you book thru the hotel website, free wifi and fitness room usage is included, so I recommend booking this way. After researching we found that the price was the same anyway. The location is a bit off the beaten path, but there is a bus stop right out in front of the hotel, that you can hop on & for just $5 you can get all the way down to the ferry stop and everywhere in between. you could also have the bus take you to a stop thats about a 10 minute walk to the closest MTR train station. We found it to be quite easy & convenient. The staff were extremely helpful and had no problem directing us to the correct buses when we had questions. There were free cookie refreshments at the reception counter every day when we were there & i appreciated that touch. Our only gripe is that the mattress was pretty hard, that seems to be the case in Asia we discovered. Despite that, we would not hesitate booking this hotel and location if we ever return to Hong Kong!", "Date": "February 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Very small rooms”", "Author": "Gottoholiday", "ReviewID": "UR123551503", "Content": "Very small rooms with bad service staff. The location an view are also not great! The check in and check out at the reception is and cannot understand English properly. Not recommended For a long stay.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Quezon City, Quezon City, Philippines", "Title": "“A worthy place to stay”", "Author": "Ramenologist", "ReviewID": "UR123426369", "Content": "First of all, I got a voucher from Agoda.com for this hotel, so we got a cheaper deal compared to their normal rates. So this review is pretty much biased because of the cheaper price. AHhaha! Anyway, I'll try to be fair. This is a pretty good hotel. We got the QUADRUPLE room with four single beds. The room was spacious and very well lit. There's a tub in the bathroom and kept very clean too! Our voucher didn't include any breakfast so we had to visit nearby stores like McDonalds for breakfast. PROS It is very near the bus station, so transpo is easy. They have shuttle buses too, but are quite pricey. you're better off getting a cab, and follow your own time. You'd want to get buses instead of cabs, they charge really high! Their staff are friendly, and they give you directions pretty well. Rooms are very clean, and the streets outside are tourist friendly. CONS They charge 100HKD for wifi. WHO DOES THAT?! Go to McDonalds for free wifi, it's just a few blocks away. ahaah! Overall, I'd highly recommend Regal Oriental for family trips, and small groups. They have a very beautiful lobby, classy!", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Nagpur, India", "Title": "“Big Hotel, Old Values”", "Author": "pankajsapate", "ReviewID": "UR123398677", "Content": "its remote to most tourist hot spots, not well connected with airport transports, very less options of eating points,This hotel is generally book by Indian travel agencies, Indian breakfast is available", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kochi (Cochin), India", "Title": "“Budget hotel ?.Folks, It is better than Indian 3 star hotels”", "Author": "Gemini G", "ReviewID": "UR123298724", "Content": "For an Indian American with little money, this was the hotel i stayed while i came to hongkong a month back. The Regal Oriental Hotel in Kowloon, Hong Kong whilst being very comfortable, this hotel has a lower review because of its remoteness to most tourist hot spots. So keep that in mind, if you are visiting for the first time. Its relatively cheap but not close to the major shopping centers in HK. You have to take their shuttle or taxi yourself & taking from hotel wud be a big mistake as it is too costly.Around HKD $ 20 one way + Extra 20$ per hour..i dunno how meters run here My Journey a Business + Leisure trip last month was executed to almost perfection. Courtesy The Hotel staff & I am obiliged to write a good review.So here , I am Breakfast is impressive, there's American, Indian and Asian food available and its quite good.The's room in itself is good, nice clean bathrooms. But I was on a low floor, at highway level, so it was loud all night long. So request a high floor room. The staff were friendly but not knowledgeable nor very helpful on local tours or the surrounding area. A surprising turn was that just outside the hotel, there is a bus stop for bus 25 - this is about 5 mins ride (HKD$4.90/person) to the nearest Kowloon Tong MTR station. In the vicinity of the hotel, there are many small shops for herbs & good/cheap dim sum eating places - people are very friendly and will go the extra mile to just help you with a direction. The better way is to take a package for sightseeing , stay & breakfast.I took it from --------------------- & got a good deal saving me almost 200 USD with the group deals on hongkong.So that is definitely one of the things u can do The Bar was also very good with they showing all the EPL matches and the lobby is very big for visitors and persons waiting for thier tour guides friends etc. Drinks start from 10 HKD.There is wi-fi facility, which was convenient but it is charged with the number of port connections, so if you have two devices you will be charged 2 times. This hotel is very good, clean and service was great. The hotel was well air-conditioned. The only problems was from the pictures it shows on the hotel web site are incorrect as the hotel faces the other direction so don't over look the bank of China tower and the fact that its away from the main locations. Should be fine if you know the place or the local language.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Hong Kong Experience”", "Author": "mumbaisds", "ReviewID": "UR122498796", "Content": "We had booked the hotel through a travel agent .We found the rooms allocated to us had fungus in the furniture and a bad smell. It was very diffuclt to convince them to change rooms and this was done only after our agent called them up so check in took a long time and a lot of arguments. The rooms then alllocated were good and we had a comfortable stay.Vegetarian food has very few options but breakfast is manageable with fresh fruits toast and cereals available. The room had a traditional look which was pleasant and made us feel that we are really in China.The room and bathroom were clean and well maintained.The business center was well equipped , also useful and we could use the internet for our further travel confirmations at a nominal cost.The business center staff was polite and helpful.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“A bus too far?”", "Author": "Globet2", "ReviewID": "UR122357371", "Content": "On the map, it looks a bit far off from the main MTR and hence the cost is lower. Counter staff are friendly. Booked a quadruple room for a family of 4 - it is actually not a good idea as this is really a simple room with 1 queen size & 1 single bed. There was not enough walking space if one wants to add the 4th bed! Did asked for a change & was given the same size room except the arrangement was for 2 Queen size beds... in retrospect, i should have asked for 2 rooms with a connecting door instead. But my earlier experience with a quadruple room in Bangkok was different - spacious & fits more than just beds - the room came with 2 toilets - so it was quite a disappointment with this hotel with regard to room size. Nevertheless, the staff were friendly but not knowledgeable nor very helpful on local tours or the surrounding area. A surprising turn was that just outside the hotel, there is a bus stop for bus 25 - this is about 5 mins ride (HKD$4.90/person) to the nearest Kowloon Tong MTR station. That is convenient. And this is where one finds Oriental Regal is still convenient to come back to from the main shopping belt. Similarly, after a hard day shopping & tour along Nathan Road - the cost of taxi is no more than HK$50 (or as low as HK$32 from Prince Edward) back to hotel. In the vicinity of the hotel, there are many small shops for herbs & good/cheap dim sum eating places - people are very friendly and will go the extra mile to just help you with a direction. Hong Kong is one of the most friendly and heartwarming place to visit. Family had a very good experience, except for the room size. From the airport at Terminal 1, we got onto A22 bus that brings us just 50m from the hotel. The cost is HK$39/person. When leaving hotel for the airport, just go along the same bus stop just outside the hotel, and cross a short tunnel to the other end - the bus stop where A22 takes you back to the airport Terminal 1 or 2 for the same cost HK$39/person. Very convenient & low cost hotel.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tolkamer, The Netherlands", "Title": "“To cold in the room”", "Author": "Jacob_Nu", "ReviewID": "UR121848504", "Content": "I have been here for one night but I was not so happy. Room is ok. A lot of mirrors but ok that is a style I am not fond off but that is a matter of tatste. For the rest the room was clean and nice. I missed a botlle of water that in my opinion should be standard in hotels in Asia. The room temperature was much to cold and the heating did not work at all. So it was not nice to spend time in the room. I did eat in the bar what was a nice and positive experiance. In general the hotel is ok but not very special.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "SHANGHAI", "Title": "“Very disappointing experience”", "Author": "dmtl28", "ReviewID": "UR121788652", "Content": "False advertising, I don't know who fault the hotel or wotif, when I booked it. It was deluxe room 7 days in advance. My booking have this written on it \"Book Deluxe Early Bird Specials to get EXTRA 5% OFF, FREE Breakfast and Internet! Check it out NOW!* Full payment will be charged upon reservation. Non-refundable. No cancellation and amendment are allowed\" The hotel said I only made a superior room booking, which has no breakfast and internet. They are purely irresponsible bunch of people and very disrespectful.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Bologna, Italy", "Title": "“Old.. Worn out..”", "Author": "Bentatravels", "ReviewID": "UR121295629", "Content": "I've stayed one night at this hotel. This was a very popular Hotel once the HK Airport was in Kai Tak in the Victoria Harbour. Since then, they have refurbished the hall but very little has been done to the rooms. I got a free upgrade to a very large room (actually, to be honest this was the LARGEST room I've ever been to in HK). Apart from that, the bed wasn't comfortable and the bathroom was soo tiny compared to the room. It wasn't very clean either. So I would not reccomend this hotel, I'm sorry... To be honest I chose this hotel only because it was the cheapest one on that period of time.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Awesome Hotel”", "Author": "GlobetrotV", "ReviewID": "UR121189159", "Content": "This hotel has great service and i was pleasantly surprised by the chic style of the room. My booking was a last minute deal, as this was a spur of the moment trip, but this hotel met all my expectations. Although the hotel is a bit out of town, there is a great bus service and a 5 minute ride to Kowloon City by Taxi. The staff were friendly, and very helpful by getting us a bus route map, explained how to get around, etc. Will definitely go back!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hinderwell, United Kingdom", "Title": "“Pleasant experience but way out of town!”", "Author": "sallymarch", "ReviewID": "UR121113286", "Content": "This hotel was booked by our agent as a stop over en route to Sydney where we picked up a cruise. Whilst very comfortable, this hotel has a lower review because of its remoteness to most tourist hot spots. There is a very good local bus which runs from just around the corner from the hotel, but it takes around three quarters of an hour to get to Star Harbour. That said, the room was comfortable, the breakfast (which we tried once) was a generous buffet with some interesting items and there is a pleasant roof top bar too. The hotel was very efficient in arranging transfers using their own shuttle but the driver drove hell for leather (not at our request) and my nerves were in shreds when we got there! If you have time early morning, make sure you walk to the former Kowloon walled city, now a park, which has an interesting exhibition on what the 'ghetto' used to be like but is now a very tranquil place with many groups doing tai chi, yoga or dance practice early morning. Beautiful.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“comfortable & friendly”", "Author": "hcw092011", "ReviewID": "UR120952630", "Content": "The hotel staff are polite and friendly and had a comfortable stay there for a week. There is wi-fi facility, which was convenient. The hotel was well air-conditioned.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“For budget travellers”", "Author": "GourmetTravel", "ReviewID": "UR120844114", "Content": "We chose this hotel because we were specifically visiting a friend who lived nearby. The hotel is old and the walls are rather thin. Thankfully, we were upgraded to a suite, which meant an extra living area and TV. The ceilings are low however and we could tell that this is an old hotel, so don't expect it to be 5 star. The bathroom is old too, but it is clean and if you are not staying in the room all day, this hotel is good value. The MTR station isn't walking distance away, so you need to be familiar with the minibuses. We took a taxi which is cheap and abundant in HK. There is lots of food in the area though, and there is lots of Thai food in the area as I'm told its the \"little thailand\" of HK. There are many mainland Chinese staying at this hotel, and as we are told by HK friends, they are not very well liked. We spoke English to the staff and the service was acceptable, even though they were very busy at times and swamped with hotel guests. We also paid extra for access to the Executive Lounge and had our meals there, which was fresh, though the selection isn't very wide. If you are in HK however, there is an abundance of local food and you probably wouldn't want to eat much of the hotel food anyway. The Lounge was quiet and away from the hustle and bustle of the hotel restaurant.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Bad Service Standards - rest Average”", "Author": "Vinodn76", "ReviewID": "UR120775934", "Content": "The concierge service needs training on customer service. Boys employed in Concierge are specifically very rude and very unfriendly. The housekeeping staff is also very RUDE. My family was upset. the food options are Indians are very bad. There is only 1 Indian restaurant - The Indian curry king (good food & friendly staff) around the hotel. The streets around the hotel are very dirty and old. The hotel amenities are good and the room size is adequate though. Rooms have fixed and opaque windows. The reception staff was good and quick but unfriendly. The Management needs to upgrade its service standards surely.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Noida", "Title": "“Reasonable & Really Nice”", "Author": "AnujaSawhney", "ReviewID": "UR120556427", "Content": "Regal Oriental is a really nice place to stay in Hong Kong .. It is an extremely well maintained, reasonably priced hotel in quite a central location. The rooms are well furnished and very well equipped. Each floor has security like I've never seen before , You need to punch in your resident card for floor validation at night before you do the same to enter your room .. safe place to be ..! The breakfast buffet is planned to cater to people from all over the world - with a good balance of different cuisines. Bus stops are a stone-throw distance and the concierge is a total 'no fuss, all help'. We had stayed with Regal Oriental in Oct 2009 and will be with them January '12 again. Have also enrolled for the Regal Hotels Worldwide membership ..", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Irvine, CA", "Title": "“Straightly for budget travel and for someone who knows how to move around HK”", "Author": "SamTheCalifornian", "ReviewID": "UR120499596", "Content": "Used to be the airport hotel but the Kai Tak airport has moved more than 10 years. Now it is in the middle of Kowloon City. Has a free shuttle to pick up from the new airport (each way is about 1 hour) but go to all the Regal hotels. Relative cheap but not close to the major shopping centers in HK. You have to take their shuttle or taxi yourself. Rooms are not big, not really recommend the breakfast package since you can get food anywhere close by the hotel. They have a MacDonald closeby, or DIm Sum restaurant 5 minutes walk away. Also close to supermarkets. Has wireless internet in room. This hotel is straightly for budget travel and for people who know how to move around HK. It is straightly for sleep but does provide shuttle to and from the airport.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Port Coquitlam, Canada", "Title": "“Talk about a shoebox!”", "Author": "Jim L", "ReviewID": "UR120315813", "Content": "This was the smallest hotel room I have ever seen. The room was 6 feet wide where the queen size bed was, which was against the wall on one side. It did widen to 7 feet for other parts of the room. We spent 6 1/2 weeks travelling in Asia, and this was the only hotel that charged for internet ($100 HK dollars/day), as well as the only hotel that didn't supply bottled water. The room was decorated in early tacky, including a mirror on the ceiling above the bed, and a totally glass walled bathroom, including the toilet area. The floor was scratched and soiled heavily, and when I dropped an item that rolled under the bed, I hate to tell you how gross that was! The check in made me feel like I was inconveniencing them, in a very tight area, and the paid for hotel transportation takes patience, as you have a long hike through another property to get to it at the airport, and it stops at all of their properties. Wake me up when we get there. The location is poor, as it is near the old airport, which is now out of the way and a definite taxi ride to get to any reasonable shopping areas or tourist attractions and restaurants. I wouldn't recommend this hotel, as it is pricey for what you get. Pay a little more and get a lot more elsewhere. Oh, did I mention the highway noise or the filthy windows.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Menlo Park, CA", "Title": "“Internet charge per connected PC/tablet/phone”", "Author": "BobD2H", "ReviewID": "UR120119836", "Content": "First the good: Breakfast is impressive, there's American, Indian and Asian food available. Notable is the hallway furniture (room floors). Chairs there look like they came out of Alice and Wonderland. Now the rest. The hotel is located far from the Metro, a 10 minute cab ride. The local \"mini bus\" never came. The rooms reminded me of a Japanese businessman's hotel.There's room for a bed and a bathroom, not much else. I was on a low floor, at highway level, so it was loud all night long. Request a high room. Internet charge is by attached computer (pc, tablet, smartphone). Beware! If you connect your laptop and iPad to wi-fi you'll be charged for two times the daily Internet rate. I challenged them on this point, and they printed out that I had connected \"two computers\" because there were two different MAC addresses on their log.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Average * Hotel”", "Author": "Haresh W", "ReviewID": "UR119518091", "Content": "Nice good size rooms, very clean. Good clean toilets and bath room. room has all basic amenities. Decent quality food and drinks but expensive. Location is good. Staff, some courteous and helpful while some other not that courteous and helpful, both in reception and in concierge. Tariff seemed a little on higher side.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "India", "Title": "“a nice hotel far from everything in hongkong”", "Author": "TouristerIndia", "ReviewID": "UR119281660", "Content": "hotel is nice as for the courtesy of staff, amneties etc. i was booked in without breakfast but i got the breakfast coupons, i thank the hotel admin for that. but weak points are many, view from room is very bad, of some cheap residential apartment. no ocean or no view of city etc. and this hotel is far away from every attraction in hongkong. though transportation network is good but spending time on commuting is an evil while on a holiday. plus these cabbies in hongkong are not helpful at all, first, no one would understand english plus they'll take u on a long ride. a hotel near tsim sha tsui will be the best bet for tourists. everything like, ferry terminals, peak, madam tussaud, nathan road, temple street, transportation to disney, macau, hki airport is very convenient from tsim sha tsui. everything is at a walking distance !! dunno what was the problem with hotel walls, even slight talks could be heard through the room.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Townsville, Australia", "Title": "“Out of the Way”", "Author": "Maz092", "ReviewID": "UR118473564", "Content": "I stayed at this hotel for 2 nights. I found the location of the hotel to be a problem. The hotel is located away from major shopping and sight seeing areas. Public transported can be obtained directly in front of the hotel. Booking in was hassle free. Rooms were comfortable and the bathroom clean and functional. Breakfast was excellent presenting a large selection of Asian and Eastern meals. An unusual feature of this hotel is the large amount of mirrors on the walls and on the ceilings. I found this a little disturbing watching myself sleep on the first night. The hotel does not provide a free Wi Fi, only on your second visit. Breakfast was impressive with a large selection of Asian and western foods. The hotel is of good standard. The only problem for me was the location of the hotel.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thailand", "Title": "“Good stay”", "Author": "Thanos P", "ReviewID": "UR118377994", "Content": "Rooms are large, beds I found quite comfortable and the air-con was fine. The hotel is linked to a shopping mall which is of course great for those who just cant get enough of the shops! Plenty of eating places with the mall if you don't want to eat at the hotel. We took a quick taxi ride down to the shopping area.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Sydney", "Title": "“DO NOT STAY HERE!”", "Author": "devildude", "ReviewID": "UR117122335", "Content": "Our stay was absolutely horrible & one of the worst I have encountered in a long time. The hotel is located opposite the old airport & is lit up in flashing neon. Note that Kowloon City is not Kowloon & is HK$60 in a cab to Nathan Road. All the taxi drivers tried to rip me off going around in circles (no lie). Save yourself the hassle, stay closer. One trip cost HK$170. The hotel does not look like the photo with trees, there are NO trees. The staff hardly ever open the door & the hotel is dated in 80’s glass & mirrors & in a dirty street. Got an “upgrade” & view was awesome but well-worn. Bath blocked, bed hard as a rock & no cover on the doona/duvet. Maid only made bed & towels, did not empty rubbish. Concierge/s had no idea even about cost of tourist pass on trains or would find out. (HK$55 by the way for 24 hours) Wanted a bus tour, “is it a good tour?” Yes… wait… nothing else. I felt, can you go away now! Paid HK$180 PER DAY for unlimited internet, at check out, got charged HK$495 because 2 iPhones connected. WTF! Wanted an extra hour for check-out, NO! Old hotel, bad location, bad service, bad room (great view), over-priced, ripped off!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "penang", "Title": "“Just okay.”", "Author": "koolcatPenang", "ReviewID": "UR117083457", "Content": "Got a chance to stay here. Location is away from the busy Temple Street. Rather quiet place but the hotel have a poor view to the back of some low cost flat. The check in counter staffs is great but not the doorboy. Rude and not helpful. Grumpling lot! The room is nice not too small or big. Room service is not good and housekeeping is slightly above average. Look out for the minivan driver. Just keep speeding at every turn. Cant even ask a decent question. Should attend some refresher course on courtesy. Without passenger they may not make a decent living.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Jhb", "Title": "“Nice little find”", "Author": "QOD_SA", "ReviewID": "UR116108275", "Content": "Although a little out-in-the-sticks, there is easy access to the city and the airport. The service was efficient, friendly and helpful and the rooms were clean, spacious and well appointed. I would recommend this hotel for the \"Hong Kong suburban\" experience!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Torrance, California", "Title": "“I'm going to try this with my family...”", "Author": "tentaclet", "ReviewID": "UR115906352", "Content": "The Regal Oriental is a very nice hotel located away from the hustle and bussle of the tourists, but only minutes away from everything via mini-bus.So Location is a plus and a little minus. I travelled with a couple of friends who had made most of our plans, they kept apologizing for some of the accomodations (size and space seemed to be the issues), although I was never too uncomfortable nor did I ever feel cramped. I was told that the Iclub level was nice and that, should I return, I should get a my rooms on that level. Problem I'm going to have is that I will be travelling with my family (8 of us) and my budget may not allow me the luxury of an Iclub level room, but I do hope to stay at the Regal Oriental this December with my family...", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Best Value hotel in HK”", "Author": "lontay", "ReviewID": "UR115383046", "Content": "Excellent service, with very friendly, helpful staff. Great location with easy Airport access via A22 bus . Plenty of local shops, goods are cheaper than in the more touristy areas and great local restaurants. Bus links to everywhere in HK just by Hotel. There is an MTR station but it's about 20min walk through Kowloon Park. Rooms much larger than usual HK standard. Not much nightlife nearby for those who want to party but at only HK$45 for a taxi from TST after buses stop running, it's very cheap to get back at any time. Am a regular visitor to HK and have tried many other Hotels but now always return here as it gives the best value for money.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Hotels is good just slight challenge with the shuttle operators at the airport\"”", "Author": "Krockz77", "ReviewID": "UR115087438", "Content": "had a 4 days 3 nights trip in Hong Kong. Quite sceptical upon reading all the previews of this hotel. contacted few of the revieweres and thks fr the personal tips especially on the muslim food :) just got back few days back :) All in all, the hotel is actually a good place to stay , agree that its quite far from the happening town but as one of the receptionist told me.. take the 25m mini bus and stop at kowloon tong MTR.. and there u go..travel in HK is easy as ABC using the MTR :) halal food is approx 2 blocks in front of the hotel on the left side. Staff at the hotel is good except i think bad recommendation for the Regal Shuttle operator that recommened us to take a cab instead of paying HK330 for 4 people using the shuttle to the hotel. becos of that we were robbed HK980 just for the cab alone from airport to Regal Oriental and none of the hotel staff assist us to explain why is this ?! that is the saddest part of this HK trip.. All in all, for my next trip i will recommend friends to stay at this hotel though.. and thks to this 1 particular gurl at the reception who gave me a tip to use the 25M bus instead of cab for my town trip the next day..", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Australia", "Title": "“nice hotel at reasonable rate”", "Author": "JonBrisbane", "ReviewID": "UR114585032", "Content": "we went to Hong Kong last year for a family wedding and stayed at the Regal Oriental Hotel for 6 days. it was nice and the room we had was functional, for a small charge, we got an transfer from the airport which was very acceptable, Like any hotel in Hong Kong, the rooms are not big unless you are prepared to pay for it. Why pay large rate to stay when you can use that money to shop and eat! This hotel really is fine, staff was friendly and helpful, ye sit is a little way out from Nathan Road, taxi is everywhere and so cheap! use it and treat you trip as a sightseeing experience. There are also a lot of nice Thai Restaurants nearby, cheap too! Much cheaper than if you went into the tourist hub like Nathan Road or Central Areas. Will stay there again in future.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kota Kinabalu, Malaysia", "Title": "“Regal Oriental Hotel, Hong Kong.”", "Author": "Voohonmin", "ReviewID": "UR113014798", "Content": "I had very nice experience staying in this hotel. Their staff are helpful and polite, even all of them are quite good looking too. As a Muslim traveler, its good to found 1 very good halal restaurant (HK Muslim Kitchen) a couple of block from this hotel. Maybe its good for the hotel to put a 'qiblat' sign in the hotel room, its might very useful for muslim guest.", "Date": "June 13, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "india", "Title": "“nice rooms but far from the city”", "Author": "ilovetravelling123", "ReviewID": "UR108737895", "Content": "The hotel was nice but it was too far from TST or even MTR. We had to spend a lot on taxi going to various places. It is surrounded by nice thai restaurants and even one very good indian restaurant, Indian curry King which serves delicious indian food at reasonable prices. when staying in Hongkong Kowloon, look for hotels which are near to TST station or Mong Kong station as they are the happening places.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Nice hotel but terrible location”", "Author": "daydreamer95", "ReviewID": "UR108220576", "Content": "The hotel itself is nice once you get inside and we were grateful for the very early check in (5am!) however after a long and extremely expensive car journey to the hotel we were disappointed with the location. Had we known that it was away from everything there is to do we would have looked more at other options instead we spent the entire time walking around the small shopping area as we had spent all our money on the car journey there which cost a few hundred pounds (GBP)! Once inside the hotel however it was very nice, the staff were really friendly and helpful and the hotel was immaculately clean apart from a cockroach making its was across the floor during breakfast which the staff simply avoided. The room was clean and cosy but way too cramped with the double bed pressed up against the wall and no desk or other chair and the tv placed high up on a ledge as there was nowhere else for it to go. The view was also quite non existent unless we wanted to see what the neighbours were doing. Personally we would not revisit this hotel but it would be ideal for travellers with their own car who want to stay somewhere upper class and away from the tourists.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not so great first time lets see how it goes on the second.”", "Author": "3GTBlack", "ReviewID": "UR106322045", "Content": "The Good I stayed in this hotel in January of 2011 right after new years and i had no trouble checking in (although there were no smiles). The older doorman was always brilliant and ran to the door to have it opened and even at times got the elevator for us when he noticed me/us coming back. The bar manager was pretty friendly and recommended their lovely Angus burger and had a bit of a chat with me. Even though the cleaning staff woke us up to make the room up at 8am one on morning and can be pretty loud outside your room they were reasonably helpful when i needed an iron and such (and no i can't speak Cantonese). If you love to venture and enjoy some real chinese and thai cuisine you'll find heaps of restaurants to your liking at amazingly low prices so i have no qualms about the location. Taxis are in abundance outside no matter what time of day and minibus that brings you to Kowloon Tong MTR comes frequently as well. Having the gym was a definite plus. The Not so Good The first problem came about when we realized that our upgrade to Club room left us with half the space and 2 single beds for some reason instead of a larger deluxe room with one large bed. The room had a very unique design to it with lots of mirrors but the toilet was clogged up and refused to flush properly so that had to be dealt with and took about 1-2 hours with us sitting up until almost midnight instead of immediately moving us to a different room even though we had informed them about the toilet situation before leaving to dinner. My partner and i had to sleep on separate beds or squeeze on a single bed at times because the female receptionist at the front desk told us that the other rooms were taken up, that all their rooms were the same size and proceeded to show us that we actually had a more expensive room. There was no desk to work at so i had to resort to doing a lego arrangement on top of the adjacent bed with my luggage and laptop. Also there was barely any space to place our luggage so we kept tripping over our own bags. The in-room wifi price is a little on the high side and if you're staying for 5 nights they have a week's package which is cheaper although you have to inform them that you want the package or else you'll just get billed on a daily basis for every 24hr period that you log in (~HKD $180/24hrs). I was nearly billed for stuff which i never saw in my toilet (mouthwash). Receptionist from business centre Overall It's a nice and simple hotel but they need more English speaking staff at the front desk and the level of customer service could be well improved. Definitely should inform guests about their wifi plan for a few days instead of allowing them to use 5 nights of daily usage which costs more than their weekly plan. I'd recommend this hotel more to people who are more adventurous and don't mind not being in the central/TST areas and enjoy local delights.I'll be making a second trip to this hotel (with wifi included in my package thankfully) this month so hopefully it'll be better and will write a second review then. P.S. It's great to see the GM taking initiative in responding to reviewers and i look forward to a better experience the second time around. Cheers.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Nice hotel”", "Author": "Unitedflyier", "ReviewID": "UR105918256", "Content": "I had a very short stay at this hotel. I arrived late after a long flight and an immediate business meeting. The staff we friendly I was upgraded to a larger room. There wasn't much of a view, just the busy road below but any noise didn't bother me. I had two double beds which were surprisingly comfortable and softer than some Asian hotels. There were lots of light switches which did take some figuring out. The bathroom was totally glass. The walls and around the shower too. It looked very nice but I suggest you draw the curtains around it at night or you could walk into a glass wall if you need to get up without turning on the lights in the room. The menu looked good and reasonably priced. Unfortunately I had a breakfast meeting and didn't get to try anything out. They do charge for internet, which worked well. There were lots of cheap local places to eat and bakeries close by.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "", "Title": "“\"Hard to find Indian Restro near by\"”", "Author": "kripanshu", "ReviewID": "UR104214915", "Content": "The hotel is a 3 star property, with a friendly staff but they hardly understand English. Very difficult to find Indian Restro near the area. The only option is Mc. Donald's. Apart from that, the Hotel is in the Kowloon area, so you have to spend around 70-80HKD to reach a Nathan road, Hongkong.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Mumbai", "Title": "“Avoid this hotel as Hong Kong as much better options at the same price”", "Author": "DebuDeb", "ReviewID": "UR103434864", "Content": "I stayed at Hotel Regal Oriental (Kowloon City) from April 4th – April 8th. It took me about 40 minutes from the airport to reach this hotel by a hotel limo for which I paid $650. I understand it takes around 90 mins if you take the hotel shuttle bus which leaves from the airport. My other friends who availed this bus told me that the shuttle bus from the airport very inconvinient as it meanders through number of location before reaching the hotel. On reaching the hotel I found grim faces welcoming me. I reached the front-office wherein I lady (looked very hassled) told me that I would need to check at the 3rd floor as I was booked in a deluxe room. Well, the check-in process in 3rd floor was satisfactory but I did not find the executives across the counter having the courtesy to tell me how I could reach the room. I found the room (was staying in 711) to be a bit cramped. While all required items was found in the room, the room did not have a chair across the table. It had a stool which had to used while working on the table. I found this also to be very uncomfortable. The plug point for the Coffee Maker also did not show (shows quality of housekeeping). However, the quality of bed and pillows were good. While the hotel has 3 or 4 restuarants, I just visited the coffee shop called Café Neo for breakfast and dinner every day. The service levels are just terrible. The staff members are very indifferent towards guest. Their breakfast starts at 6:30AM. One day by mistake I reached the coffee shop at 6:25AM and this Captain by the name Ashley made such a dirt face. I think he could have been a bit more polite to convey this to me. One of the greatest problem with the hotel is its location. There is no subway (metro) station nearby which makes going around the city very difficult. The only option is availing the taxi which is very expensive. Also, there are NO good malls / marketplaces nearby. I would never stay in this hotel again as Hong Kong provides many option.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“VALUE FOR MONEY”", "Author": "jatin_Desai", "ReviewID": "UR103031366", "Content": "I had a sudden trip to hongkong. so just about 3-4 days before going I went online to book this hotel, on one of the websites. i booked this hotel as it was one of the cheapest ones being offered. i got it for only 70 USD. i read negative reviews about it, so wasnt expecting much. but when I reache the hotel, i was surprised, it was a extremly good place. it was farily crowded with lot of student who were appearing for TOEFL or some similar exam it seemed. the rooms were extremly good, comparable to REGAL KOWLOON, TST. overall, i was very satisfied as it was a very GOOD VALUE FOR MONEY. i would advice anyone to get this hotel over YMCA or YWCA, if you are on a tight budget.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Excellent hotel to stay in, the service is one of the best i have stayed in ,friendly place to stay,”", "Author": "rayabound", "ReviewID": "UR103013305", "Content": "i found this hotel online and i am glad ,my stay was excellent, very relaxing and quite,i found the service excellent , the rooms cleaned with professional touch , the staff very helpful,stores where nearby ,the entertainment was great of a night , i did not have to go very far from the hotel if i needed anything, i had room service one night the food was excellent , good work all of the team in the Royal hotel cheers Ray, Foster", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Friendly and Welcoming”", "Author": "186258sunshine", "ReviewID": "UR102156597", "Content": "This hotel was booked for us by our travel company and having looked on trip advisor beforehand was a bit concerned regarding a number of indiffent coments. In the event we found the hotel very welcoming . The room was appointed to a high standard and the level of cleanliness good. All of the staff were very helpful especially those in the conciege section who took great pains to point us in the right direction for sights of interest and in arranging the shuttle back to the airport. We'd have no hesitation in staying here again.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bohol Island, Philippines", "Title": "“Pretty good.”", "Author": "iluvmyboyfriend", "ReviewID": "UR100963529", "Content": "We stayed in this place for 3 nights together with my cousin,aunt and a family friend. Staying in this place is quite pretty good. We arrived there at around midnight and the concierge welcomed and help us with their cute smile which it adds point. :) Checking in and issuing our rooms is not a pain and so we get into our room and put all our stuff and went out check out around the place. The place is not really in the city and is surrounded by many local stores and restaurant and we had fun walking around the place. The location is good for us and if you need to go somewhere, taxi may easily found outside. The seats on their lobby are cute..., the place is not noisy and not to make it too long, it makes me nod. :) Cleaning service is good and we never found any that dismay us. And oh, their shuttle service are coming on time. (Before we came there, I filled out on their online concierge and in few hours of waiting, their informative feedback knocks on my mail and that feels me, ooiiiiiii ;)) Its a good service guys! See you next time for the free internet...;)", "Date": "March 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Hong Kong, China", "Title": "“Do not stay in this hotel”", "Author": "international_guy25", "ReviewID": "UR100691891", "Content": "This hotel location is a nightmare! Unless you have a driver to pick you up and take you around whilst you stay there is fine. But if you need to be close to MTR then avoid this place at all cost! The taxi ride was $45 HKD from Mong Kok east station but it’s a real hassle to get to the station from central. At there at 2.40pm after 3 hours trying to locate it, the room was still not ready took them 30mins to check me in. right! Internet is $180 HKD per 24 hour that’s a real rip off even HK central hotels only charge $120 HKD the most. The hotel is not like the photos on their website; it’s all air brushed and shiny when in reality it’s a dump and not 4 stars they claim to be. I say 3 at the most. The room I was checked in had a mouldy smell the furniture and décor looks like its was done back in 1970 and not been up-dated since (that would explain the smell) All in all I would rather pay the extra $200-500 HKD to stay in a more modern and new hotel that’s also centrally located near a MTR. So do not book this hotel unless you have too!", "Date": "March 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Folkestone. Kent.UK", "Title": "“Good Hotel, Good Price,Good Staff”", "Author": "peter006", "ReviewID": "UR100481164", "Content": "Located in Kowloon City, part of old Hong Kong that is unique, lots of quaint shops and everydays small busineses in the area ,minutes from a lovely park, good shopping mall nearby. Downside if on short stay abou 20 minutes to Tsim Sha Sui (Star Ferry) plenty of buses from opposite hotel, 1A or 9(use underpass) buses go to Mon Kok and Nathan Road return bus stops outside hotel, Taxi costs about 65-70hkd . Hotel: tripped and fell as entering the hotel, my fault, the staff rushed to my aid, assisted me,to a chair offered me medical assistance I had a badly bruised knee so top marks to the conciege and porters. All the staff I spoke to had a reasonable if not good command of English, so no problems. Reception was fine I had Emailed the Hotel asking for a smoking room, again no problem, exchanged some money and got a good rate, also booked a trip to mainland China, concierge very helpful,also recomended hopital for my knee x ray. Room: large by Hong Kong standard, I got an automatic upgrade to deluxe with my booking, clean, flat screen television, huge bed, tea and coffee facilities, bath shower, weighing scales, iron and board, linen changed when requested, bathrobe and plenty of nice fluffy towels, very happy with the room for my ten nights. Food: I don't eat breakfast so can't comment on that, I had a few meals in the Pub and they were fine, the Patissere cakes were superb and the coffee great. I dined out of the hotel with Chinese friends but the Hotel has plenty of discounted offers for residents", "Date": "March 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice, big and cheap room, expensive internet.”", "Author": "henning_risoy", "ReviewID": "UR99486755", "Content": "the rooms were big and nice and not expensive. The location is not very good (you have to take a minibus to the MTE) and the interenet were quite expensive.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New Delhi, India", "Title": "“Small but comfortable”", "Author": "megh29", "ReviewID": "UR98488758", "Content": "The hotel is a small property but is comfortable. The room sizes are not big, unlike the ones we see in Delhi, but it has all th basic amenities. The best part was that bathrooms had glass doors. So, its cool for couples. The view was not too great but most of the shopping malls were nearby. taxis are easily accesible so travelling is easy. The staff is supportive though one may face language problems. Now coming to the food, buffet break fast is not too great for vegetarians like me. You will not get good options except hash browns and breads. Still, i would rate it as 3. Reasanable - paisa vasool", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Shanghai, China", "Title": "“Not too bad, at least worth to stay”", "Author": "Jeffreyhonghong", "ReviewID": "UR95018924", "Content": "The hotel is not with any MRT, but taxis and bues are easy to take, staff are willing to help for any tourist informations, Concierge are friendly when they are not busy, otherwise you have to wait, thats okay. we are relaxing. some of them are very warm and asked me how was the place he recommended me to visit, toucing isnt it? small hotel has this kind of gesture I believed. There is a distance from hotel to nearest 7-11 make sure you buy enough, you dont want to walk few times there. Room is nice and quite, they said it was the old airport hotel, so sound proof is good. beds and bathroom are not Four Seasons standard but I have no problem with that. Floor maid are friendly eventhough hard to communicate in English. Go to reception if you want some extra things in room, they are willing to help. this is in residential area, so you could find some local taste food at a good good price. overall it is a good place to stay, one little thing be aware of internet charge it is too costly", "Date": "January 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "vancouver", "Title": "“If You Are An Adventurer”", "Author": "samikDallas", "ReviewID": "UR94558660", "Content": "This hotel had its glory days in the old Kai Tak Airport in Kowloon. Stay away from this place if you cannot read or speak chinese because you will be frustrated. The housekeeping dept needs fine tuning as they don't clean the rooms properly most of the time. They replaced stained and soiled towels or bed sheets from your used one and it occurred more than twice during my 8 nights stay there. Stay away from the lower floors as the hotel reserve these rooms for the MC (Mainland Chinese) group. These people usually are lack of etiquette, loud and boisterous and you will have a tough time to sleep well at night. The concierge and bell boys are \"window dressings\" and they are not helpful most of the time. Do not eat in this hotel because they can't even cook Chinese food. Don't try to use the internet unless you have a deep purse. They charge you by the minute. The upside is, the hotel rate is reasonable in comparison the same class hotel in the tourists trap areas. If you really wish to get the taste of how people live in the real world in HK, you will get the first look and a pleasant surprise in this neighborhood and this is priceless. There are hundred of eateries in and around this hotel and they are tasty and dirt cheap. Stay away from the mini bus shuttle to transfer you to the MTR. It is time consuming and cost you time and money. Run across the street from the hotel and the buses in different routes will take you anywhere in the city and attractions you wish to go and it takes no time. I recommend any adventurers young and old to stay here. Otherwise, fork out your $500 us and stay in the Peninsula", "Date": "January 27, 2011"}, {"Ratings": {"Sleep Quality": "4", "Overall": "4.0", "Rooms": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“disappointment with class”", "Author": "Elvis_tonight", "ReviewID": "UR94453040", "Content": "although this was not the airport hotel we thought we wanted (as it was near the old airport and not the international one we needed), we were very well assisted by the management to make us feel comfortable. First, we wanted to change but when this was no longer possible at such short notice, we decided to stay and got a superb room. maybe we got a free upgrade because of the disappointment that we did not book the right hotel. anyway, this i-club executive room/suite is a pearl of interior design as you might see from the hotel pictures. I would certainly book there again in that type of room just to enjoy the feeling of wellness in the room with the tub in the middle.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Noisy, Stinky and unfriendly”", "Author": "mollieitem", "ReviewID": "UR92925979", "Content": "Stayed at this hotel on our way back from Europe. Pictures in brochure misleading so beware HongKong firstimers! 1. Check in was cold, there is no hospitality. the simply ask for passport and credit card and send you off. The girls there need to smile or put more staff so she doesnt over work. No offer for help with luggage. Had to ask and landed the $4/piece cost. Stuff that! 2. The room was very small to our liking. We stayed on 3rd floor, very noisy from the traffic despite the double glazing windows. Even at 4am it was really noisy i.e. HK doesnt sleep. Our room overlook the old airport of the unassuming mass land. 3. Our room is an apparent interconnecting room. We notice on the second night we have a neighboring guest. He watched TV till late at a medium vol and snores when he slept. We could hear everything despite the concrete wall. All the noise travelled from the thin door which we had no control. We rang reception for room move and they simply said no room available! - tough. GM you need to have double door with good seals. 4. Room service menu looked very appetizing dont let it fool you. They offer late supper with plenty of choices however the only serve hot dogs, pizza and premade stuff. Due to jet lag we were awake and hungry at 4 am and couldnt eat greasy stuff all we wanted is fruit plate from the menu. Their excuse when we rang: we had emergency meeting this early morning? what sorta emergency that no one can cut simple fruits! 5. You could hear anybody who walk outside your room 6. mouldy bathroom and fault toilet 7. unfriendly concierge. It was raining on Friday. Asked if we can rent umbrella before we finished they abruptly interrupt me with buy only! no rent! guessing he's busy! GM need to look at staffing 8. Key card. Stupid rule that you allowed only 1 key/room. i'm not sure who's bright idea is this! GM you will definitely need to review this! my wife had to accompany me at late night to buy some water!. Conclusion >>>>> will definitely not come back. Go to tsim sha tsui/mongkok if i have to advise anybody. This hotel is located next to the fly over in old kowloon city and you can see the area is desperate for tourist, run down and smelly. Spend another $50 and dont waste time and energy you deserve value for your money! <<<<<<<<<", "Date": "January 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "India", "Title": "“Good value for money”", "Author": "Angel84India", "ReviewID": "UR90466528", "Content": "Nice clean rooms though the rooms are very small. all basic utilities are provided in the rooms. the hotel is clean and well maintained. the breakfast spread is good with Asian and English spreads. room serivce is prompt. The staff is communicative. There is gym as well though i understand it is restricted to special guests. The concierge desk was helpful in directing us. The porter service is charged here.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean and comfortable but expensive and a long way out”", "Author": "HKT0urist", "ReviewID": "UR89766410", "Content": "The room was fine - we had a twin and each bed was queen size. It was clean and tidy and relatively quiet. But it is quite expensive, particularly given its location (not near the MTR and a taxi ride). However taxis were quite cheap (about £6 to the harbour in Kowloon). We had the buffet and some drinks in the hotel and they were all very expensive. And even in the self service buffet and in the 'pub' you are charged an additional 10% service charge on top of your bill.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Awful customer service”", "Author": "B-HNL", "ReviewID": "UR89495205", "Content": "I had read several reviews of this hotel before my holiday and I was slightly aprehensive of previous comments. Upon arrival I wanted to phone back to the UK, my mobile wouldn't connect so requested the reception for an IDD this cost HK$50 + HK$1.90 per minute. I decided to have a meal in the hotel \"Coast Pub\" consisting of a Salmon Fillet - when I cut into the fillet it was not just undercooked but UNcooked, I sent it back for a replacement. I requested my bedsheets to be replaced on three seperate days and there was no change, I requested to see the General Manager and all he offered was excuses for the cleaning staff NO apology to myself the paying customer. There was constant noise in the corridor every night from other guests (ie no sound insulation for the room). When I checked out the staff did not ask if my stay was pleasent. I will return to Hong Kong again in about 18 months but I must confess this is the worst Hotel experience I have ever encountered.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“NOT THAT gr8 CHOICE”", "Author": "AkkshayJain", "ReviewID": "UR88988953", "Content": "We had gone as a Family of 8 persons... When booking was done the pictures of the hotel seemed to be good. But on our visit it was not the same. The staff over there were friendly but the rules & system was not that friendly. On arrival i asked the bell boy to take luggage to our room, & I was turned down by saying \" We would charge 4HKD for each baggage\" (We had 17 bags, & so we lifted them by ourself to the rooms). Also we requested to give the rooms nearby, but our room were in 4 different corners. On entering the floor to open the door of outside the lift access card were required & then only we could enter where are rooms were located. They provided only 1 Key to room, that means if we have to move out of the room we both have to move out or else i have to call the other person & then he will give access. I Found this a foolish system. Also, the rooms keys were plain white card, No name of the Hotel, etc This created a bad impression in our minds. The food & Decor of the Hotel was good. Negative point The Hotel was not equipped with Swimming Pool Plus point, it was very near to all the shopping malls & markets. Moral: Hotel was not good, location was good, price was good.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Great deal”", "Author": "220v", "ReviewID": "UR86454312", "Content": "Great price for Hong Kong! The hotel is very nice, lare room and great service. Not central, maybe 20 min bus to downtown, easy to take the bus because the bus-stop is named after the hotel.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Lancashire", "Title": "“Good Hotel but away from the main areas”", "Author": "mih1954", "ReviewID": "UR83953511", "Content": "Good value hotel when booked through a broker. Both of our rooms had 2 double beds. Eateries were a disappointment and poor value for the money. One of the nearest tube station was Diamond Hill , but you still needed a cheap taxi to the hotel. If you don't mind being away from the centre and want a quiet , clean place to stay then I would recommend this hotel but dine out.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "4.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Nice Hotel”", "Author": "computer48", "ReviewID": "UR82846821", "Content": "This is a lovely hotel. Clean and the staff is so helpful. Kelly has been so nice she is so patient with us Americans who do not speak the language. I love being in Hong Kong.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Regal iClub looks great”", "Author": "Fretraveller_10", "ReviewID": "UR81433889", "Content": "I stayed at Regal Oriental Hotel for 3Nights. Great value. I stayed at 3/f, it gives you access to the Regal iclub Lounge which has 3 PCs, a bunch of magazines and books, TV, and some light refreshments. I enjoyed reaching this lounge to grab a fruit juice or two and chat with others. Check-in and Check-out was fast and with no hassle. Breakfast is included in my rate. Nearby you can find restaurants of different cuisine such as Thai food, indian food, typical Hong Kong snacks. You can get good advise from staff there.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "hong kong", "Title": "“Good choice - value for money”", "Author": "Samliketravel", "ReviewID": "UR80789739", "Content": "not expensive, but trurly good value, room was clean and tidy, room maid are very cheerful and helpful. Although not near to subway train, buses, mini bus and taxi are not difficult to find HK is a small place and easily access. also many asian food outlets around and it was no boring. one last thing, staff there were very informative and can advise on everythings", "Date": "September 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“non recommend hotel - regal Oriental”", "Author": "DAVEVE1191", "ReviewID": "UR78080556", "Content": "Hotel is located in Kowloon City, when I get in the Hotel, that's make my feel uncomfortable, In case i am a traveler and carrying thousand of luggage with me, but the bell boy Nick just stand like a tree and not welling help me till i call for help. After I get to the reception counter, lady are wearing smile through the check-in process. but the check in process it take for too long time, must have many rooms to improve. About the room 1.lighting is too dim 2. The \"King Bed\" is in single bed size 3. View is terrible", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "india", "Title": "“Superb hotel with great ambiance”", "Author": "ardeshir46", "ReviewID": "UR78072350", "Content": "Hotel in it self looks majestic with a grand entrance . It looks stunning at night as it is all lighted up and it looks just great! Location is good to all shopping areas and restaurants but it is far from the main downtown area.Rooms are very spacious with all modern amenities.Good room service also.Staff are very polite and go out of the wat to help you out. The hotel lobby is what I liked the best as it was roomy with different types of furniture with different shapes. Great food with a huge selection of food.Quality of food was exceoptinally good. A great hotel to stay and enjoy!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Location is a negative...but value for money”", "Author": "rahulzz1983", "ReviewID": "UR76661661", "Content": "Stayed at this hotel in May for 4 days. Althought the hotel is not close to MTR or major tourist attractions, it is easily accessibly using bus 25M to Kowloon Tong MTR....and where most tourist locations are close to Central Hong Kong or Tsim Tsa Sui, travelling upto Central is just 20 mins MTR ride. Size of the room was decent compared to similar priced hotel in any other location closer to Central HK. One problem I faced is the availability of vegeteriaan food. Not much vegeterian food options on the menu but there is an Indian restaurant at walking distance from the hotel. All in all....good value for money....", "Date": "August 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "New Delhi", "Title": "“Bad Location and run down hotel”", "Author": "madsethi", "ReviewID": "UR69432701", "Content": "We were in Hong Kong for couple of days in April 2010 and were booked at the Regal Oriental Hotel in Kowloon. We had booked for deluxe room. On check in we were taken to a room on the 3rd floor and got the shock of our lives. We have travelled all over the world extensively, but have NEVER ever seen a room like one. The room was literally 8 feet by 6 feet or so with the bed stuck next to a small window and a tiny little attached bath! Was this a deluxe room??? We left the room and went down to the reception and confronted the girl there regarding what we had paid for and what we were getting...To cut a long story short we finally got a room on the 13 F - and a very nice one at that! But not after the hotel had tried to palm off a cubby hole to us. The location of the hotel was bad - nowhere near a metro station - had to take taxi or a bus to get to the nearest one! Staff was indiffrent, the buffet breakfast was mediocre. Will we ever stay there again or recommend it to anyone? I don't think so!", "Date": "July 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "singapore", "Title": "“terrible stay 3 days 2 night”", "Author": "kl0900", "ReviewID": "UR68931461", "Content": "i'm student, in 23 JUN-25, the hotel let us later check in( after 4-5pm). and my friend stay other room like check out room, not clean room. my stay room look very clean, but in the bed that is terrible for me, the bed inside have bedbug, let me 30 bite in my body, firstly i think is mosquito, my friends told me may be the bed problem, because the crowded of bite. i never want try again this hotel.... 我最近才住过那酒店··住的4楼·哪里房间不干净，有些 房间有臭虫，我住了2天··全身30多个包··刚开始我以为 是蚊子，结果有些房间 和我一样，咬的包是在一起的，我的右脚 就有20多个。。", "Date": "June 28, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manila, Philippines", "Title": "“awesome!”", "Author": "DaxIbero", "ReviewID": "UR67555369", "Content": "one of the best rates in town. . .i got to choose my room with a great view of the old airport. . .it's location is perfect for travelers who wish to sink their teeth into just about anything. . .", "Date": "June 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Syracuse, New York", "Title": "“Fair hotel- would probably stay again”", "Author": "bLueMnM", "ReviewID": "UR66824993", "Content": "I stayed at this hotel for 3 nights and 4 days. I would give it a 3 star rating. Positives: Room was clean. The concierge was friendly, helpful and understood English very well. Negatives: Small rooms, probably because of the space issues in HK. I found the receptionist to be very unfriendly. Far from the airport (about 45-1 hr ride to the airport). No free internet. Very expensive. Tip: The 25 bus is right outside the hotel and will take you to the Kowloon MTR station (15-20 minute ride for about 5HK dollars - VERY cheap). From the MTR station you can literally go anywhere. It's quick, efficient, easy to learn, and much cheaper than taxi. It's dirt cheap. If you are coming from the airport, I would book a shuttle with the hotel. Do not take a taxi (expensive) or go by public transportation - too much of a hassle to drag your luggage. Also, walk around outside the hotel. There is a nearby shopping mall which you can buy good gifts, probably at a cheaper price than haggling at the night markets.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "mumbai", "Title": "“Excellent Hotel”", "Author": "devonsb", "ReviewID": "UR64694595", "Content": "I must say we were very impressed with the hotel and room interiors. However for someone who wants to go with children; i must warn you that the rooms have glass walls in their bathroom which make it a little inconvenient with family. Rooms are decently spacious. Our room did not have any view though. Hotel was conveniently placed from most of the shopping destinations in kowloon. overall happy with our stay and would recommend this to all.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Black Country", "Title": "“Interesting hotel”", "Author": "NbyNWalsall", "ReviewID": "UR64418469", "Content": "We stayed for 2 nights as our flight was cancelled and our previous hotel priced themselves way out of the market, so for £50 pn we got the Regal Oriental. In some ways it had it's hayday as the old Kai Tak airport hotel and now seems stranded, far from the centre. The room was big, clean, a little 1970's but ok, the kids preferred it to the Novotel where we had previously stayed. The concierge staff were helpful as were the business centre as i was trying to book flights out of HK, at a price of course. We had breakfast at a nearby Mcdonalds and there were plenty of local restaurants, particularly Thai, the locality never felt unsafe or oppressive, just really vibrant. We got around by taxi, about £4-5 to TST which was reasonable as six of us crammed in. The nearby Kowloon City Park is excellent, great for the kids. The hotel shuttle bus was useful to get to the airport without the hassle of taxis or the Airport Express. Probably won't stay here again but theres really only the location against it.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Macau", "Title": "“Clean Hotel... Not central but great staff”", "Author": "Cotai_Traveller", "ReviewID": "UR64277362", "Content": "I have stayed at this hotel for a whole week... I was taking some exams at a close by examinations centre...and for this reason decided to stay in the Kai Tak area. First note that the hotel is right next to a high way,,, so if you are staying at a room facing the highway be prepared for a noisy night... For this reason, have asked to change the room and the staff, who was very kind (unlike HK style) got me an upgrade to another room... The hotel overall is good... not great... but since for HK it is considered cheap... i would recommend for those who are staying in the kowloon area... the trip to Central would take around a 10 minutes walk to the MTR station and then 30 minutes by MTR.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bath", "Title": "“Brilliant hotel”", "Author": "Ellie654", "ReviewID": "UR60183312", "Content": "Ignore the negative reviews. If booked through an agent, this hotel is very good value for money. It's very clean and the rooms are well equipped with free tea and coffee and a mini bar. Others have mentioned that it's not in central Kowloon. As a 19 year old girl travelling for the first time i did not once feel threatened in the area despite being in the minority as a westerner. Also there is a MTR station about 15 minutes walk from the hotel which can take you to Hong Kong Island for about a pound. Also, the hotel runs a courtesy shuttle bus to and from the airport and also takes trips to the centre and to disney land. Overall, a very good hotel which i would reccomend to anyone.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good standard and friendly service”", "Author": "LondonSenorita", "ReviewID": "UR59484720", "Content": "The Hotel is in Kowloon which is about 20 mins by taxi to most places about HK$70. The area is the old airport which is being rebuilt into a port. Lots of places to eat and shop in the vicinity of the hotel and the number 6 bus outside takes you to Ladies Market (MongKok) and to the Star Ferry terminal. Worth upgrading to a premium room with breakfast included. Restaurants in the hotel are pricey but the cafe in the basement has a good selection. No pool or gym. I booked the tourist excurtions with the concierge and well worth it for a quick visit to this city. Would not recommend the night cruise with lights -- better in Shanghai. Visit the old gardens short walk from hotel, really tranquil.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hyderabad", "Title": "“Excellent stay”", "Author": "savindrasingh", "ReviewID": "UR58867352", "Content": "I went there with my colleagues for bussiness trip. We stayed there for 15 days. I found the hotel staff very professional. Room service was excellent. Rooms were very clean and tidy. Restaurant have all the menu options available starting from western, Indian, and chineese. Food quality was very excellent. The person cooking Indian food was a Punjabi person from Indian origin and was a very good cook. The hotel have a very good transportation service available. They also provide mini bus service for the groups.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Mumbai", "Title": "“Decent Place”", "Author": "josh4amit", "ReviewID": "UR58280438", "Content": "Hotel Regal Oriental is a great place in Hong Kong. Apart from its location, which is quite far from the main city and its attractions, one will admire everything about the hotel. The Hotel has its own Charisma and the staff is quite co-operative as well. The size of the rooms are also decent. Added attraction is a Indian Restaurant very nearby. The worst part of the Hotel is that it is not at a central location and a little far from the City attractions like Avenue of the Stars, Disney, etc. The food is below average and not recommended for Vegetarians like us. Even the buffet breakfast is not worth while. Overall, it is a decent place to stay if the transportation and meals are managed properly.", "Date": "March 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“If this is all you can afford, stay home.”", "Author": "cjoshm", "ReviewID": "UR57133938", "Content": "It's very difficult to determine which is worse: the location, the service, or the rooms. This place is a dump, and the people who work there do nothing to improve the experience. I've stayed in every kind of hotel around the world, and this is the worst.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Frankfurt", "Title": "“Better than expected”", "Author": "dimsum31", "ReviewID": "UR54654159", "Content": "Regal Oriental Hong Kong is the old Kai Tak Airport Hotel; facing a huge unused piece of land which used to be the old Hong Kong airport. The hotel itself underwent a recent refurbishment and has decent room sizes (much better than most HKK hotels). Room windows are double glazed and therefore very quite. Can't really confirm other readers negative comments about poor English of staff and low service standard. I thought the front desk staff was very friendly with a good command of English. The location is not bad, just 5 minutes by minibus to Kowloon Tong MTR or by bus 20 min to the star ferry.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chennai", "Title": "“Terrible Staff”", "Author": "TravellingTarun", "ReviewID": "UR53992391", "Content": "In Hongkong English speaking is an issue with majority of the locals, they can not speak or understand it. Moreover the receptionist of this hotel when told this got rude and replied \"I lend inklis in inland\". The reception staff including this boy and the girls are really a pain as a customer support. The other staffs in the front office are also in the same league. Its a shame for a cosmopolitan city this star rated hotel is recruiting bad apples, which definitely spoils the taste. The girls sitting in the front ofice on the 3rd floor are pathetically un-courteous. They have yet to learn the skill to be polite and helpful to the customers.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“A new lease of life for a classic hotel”", "Author": "sweetyoungthing", "ReviewID": "UR51248109", "Content": "Twenty years ago this was The Hotel and once the new wharf area is in operation it will thrive again. Lots of work has been done in the cafe/restaurant area and 3rd floor and new rooms are updated all the time. After several weeks in Africa I was looking for the white fluffy towels and comfy bed, a real shower and all the extras.........I wasn't disappointed. This is great value for money. Some of the room may be small (you can upgrade to the 6th floor) but they have everything you need for a relaxing break. It's in Kowloon so you need to take a little bus (HK$3) to Wong Tai Sin shops/temple then board the train to Central (HK$11). Have a drink in the 14th floor bar and watch the traffic...see how many privately owned cars you can spot........in a city of 8 million people the have there transport worked out beautifully.", "Date": "December 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mumbai", "Title": "“good room size”", "Author": "bhavna4v1", "ReviewID": "UR50553428", "Content": "Good sized rooms, very comfy beds. service was not so bad.. most of them didn't understand english though. but the hotel was well decorated.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "fatchance1234", "Title": "“In the middle of nowhere, Overpriced”", "Author": "fatchance1234", "ReviewID": "UR49089754", "Content": "I got this hotel in a Wotif Mystery deal. My first surprise was that it's in the middle of nowhere to the east of the actual downtown area. You need to take a bus or taxi just to get to the actual city. One of the amenities listed was free broadband access, when I got to the hotel they did not have this for my room. Even though it clearly stated that it did. I was forced to upgrade to a premium room 130$ more. Rip off, this hotel is not worth it at all. STAY AWAY. Also something smells funny in this room, I am still trying to look for it now.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Perth, WA", "Title": "“Lovely hotel, helpful staff...what more can you ask for!!!”", "Author": "NirvanaPerth_WA", "ReviewID": "UR46421554", "Content": "We loved our stay at the Regal Oriental hotel, the rooms were a good size by Hong Kong standards and were very well fit-out. The staff were extremely helpful and polite. I would recommend the restaurants as well, the food at Cafe Neo's buffets was very good and special mention has to be made of their chinese restaurant the Regal Seafood restaurant as the food there was to die for, especially the chef's special- beef and asparagus in wasabi sauce!!!!!YUM!!!!!!!", "Date": "October 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“A Generally Nice Hotel”", "Author": "Pinktulip75", "ReviewID": "UR45559653", "Content": "The concierge, reservation service and cleaning staff were generally good overall, and their exchange rate is definitely better than having your money exchanged at the Australian Airport. Our only little whinge about their room itself is that they don't provide enough sugar for coffee nor do they provide an iron/ironing board for use. We would've liked to have been given the option of a smoking or non-smoking room to begin with so we didn't have to ask to be transferred. But once we got our non-smoking room, we were very happy. Although the hotel location is a little far away from the main happenings of the city, you only need to take 20 min bus trip (Bus Nos. 1A or 9) to travel directly to Tsim Sha Tsui, where all the major shopping centres and eateries are. But definitely check out the Mongkok markets for discounted bags, jeweleries and clothes, which is only 15 minutes away from the hotel using the same bus route. Also, ladies...after all that shopping, you're going to need a very relaxing foot massage, and I highly recommend going to the one directly opposite the hotel - its a must!", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ann Arbor", "Title": "“Wow Experiance”", "Author": "MiSola", "ReviewID": "UR39030513", "Content": "I don't usually review hotels, but this one is exceptional. 1st night in Kowloon was a wash at a well known hotel in a popular area of Kowloon. Luckily, I found this hotel and decided to stay in Kowloon a few more days. Booked on-line for about 340 HK, when I arrived, the staff was actually smiling, polite and welcoming. For no apparent reason, I was upgraded into a suite 4x the size of the room in the other hotel. Then offered a package that included unlimited in-room internet, free breakfast (good , fresh hot, food) etc, for Less then I booked the room for on-line. Maids are well trained and cheerful, then a manager checks the room afterward. She noticed a loose shower knob and soon a maintenance man had it fixed. So it takes a few minutes to get to Mon Kok etc. Taxi's servicing this hotel are honest and cheap, quick and the walk around here is nice, with the walled city park is a block over. I'm thrilled there aren't masses of cars and people right outside the entrance. Value, Value, Value. That's my experience here.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "delhi", "Title": "“Good Rooms, Bad Location !!!”", "Author": "shalink01", "ReviewID": "UR32956069", "Content": "We were on a family holiday with a child of 3 years. The rooms are good value for the money but then again the location is really sad, there's absolutely nothing close by, its actually in the middle of nowhere !! The rooms are really neat and clean and so is the bathroom with all basic amenities. Excellent value for money. The sightseeing's and nightlife are way too far.... its actually the other side of Kowloon and far from tshim sha sui !!! Avoid this hotel of your looking for convenient access to major areas. At easily walking distance of 15 mins you will find one Indian Restaurant, A Good Thai Restaurant and a Seven Eleven store for convenience.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "PHILIPPINES", "Title": "“Very satisfied, will stay here again....”", "Author": "PINAY09", "ReviewID": "UR32853827", "Content": "All the negative reviews I've read were put to rest. We had a grand time at the Regal Oriental Hotel. I booked for 2 rooms (triple sharing and twin sharing). The rooms are beautiful, modern, spacious, clean. The bathroom has a bath tub. The hotel staff are friendly and helpful. We were pleasantly surprised as we did not expect the rooms as well as the hotel itself to be this beautiful. By the way, we booked our hotel thru Octopus Travel. We plan to go back to Hongkong in the future and we will definitely stay at this hotel again.", "Date": "June 22, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Mumbai", "Title": "“Budget Hotel - Close to Flea Market and Fake Market”", "Author": "siddharthsahi", "ReviewID": "UR32581753", "Content": "Regal Oriental is a average 3* hotel with no frills. The Hotel staff is courteous at the reception but room service is sad. Food is highly overpriced. Markets like Nathan street are 20 mins drive away. Nathan street is close to the electronic & fake market for purses. Negative point about hotel: No water in room. Each 300 ml bottle costs 25 HKD!!! So when thirsty go to the vending machine outside the hotel and take water for 6 HKD. remember to carry change", "Date": "June 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“fine for a transit stay”", "Author": "gaurav_barjatya", "ReviewID": "UR32427730", "Content": "The hotel is located centrally in Kowloon .. the rooms were decent but the service was not up to the mark .. basic thing like water was not available in the room and you could buy a bottle for $ 25 !! The plus point is that the shopping markets are not very far from here . . overall just about fine for people in transit and want to stay for a night . .", "Date": "June 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Singapore", "Title": "“Gone with the days”", "Author": "QCInspector", "ReviewID": "UR27787109", "Content": "I was rather hesitant when I made my reservation with Regal Oriental. Frankly, being a seasoned traveller, I know I should not trust everything on the hotel's website... the clean and spacious room... the modern design. Unfortunately, I was proven right when I checked into Regal Oriental Hong Kong. First, if you think you are going to get one of those rooms that were shown on the website... think again... not unless you are checked into the Executive floor on the third level (OMG! Which hotel has its executive rooms on third floor???). Least did I expect when I asked for a high-floor room what I've got is a themed Chinese decor room. I was shocked! The room resembled a Chinese restaurant in the 1980's. For one moment, I thought I was the star of a chinese porn movie! Having got used to clean and well-design hotel rooms, this really topped the list for being the worst hotel. The furniture was old and worn out. And I had so many issues with the bed! Don't expect a good night sleep if you are sharing the bed. I was woken up whenever my partner made a slight move. The bed is not firm at all! The bathroom is worse. The fixtures are old, tiles are old and worn. The toiletries are not even comparable to that of a 4-star hotel! The towels??? Torn and old. I was told by the receptionist that all the rooms were renovated (since when???). Other than the modern rooms at level 3 (the so called executive floor), the rest of the rooms are themed Chinese or Arabian... hmmm. If you are into kinky rooms, then this Regal Oriental is definitely a good choice for you. The only good thing about the hotel is the gym. Although I didn't use it, I did have a look at it. I must say that the gym is much better than what I've expected. It's small but it has the basic equipments and most importantly, it's clean and modern. The hotel is definitely out of any action. But taxis are easily available. I took a cab to the nearest MTR station (about HK$40) and transferred to the subway whenever I needed to go to Hong Kong island. But if you are looking for action and fun, then this hotel is definitely not your choice. It's too out of the way. On the whole, this hotel is good for the budget conscious crowd. I would say... it's great for backpackers. I'm not going to return to the hotel... that's for sure.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cangothere", "Title": "“Intriguing en-suite”", "Author": "Cangothere", "ReviewID": "UR24251011", "Content": "My husband was in Hong Kong for 18 months when he did his National Service many years ago so this was a nostalgic visit. We had a lovely room on 3rd floor which had obviously recently been refurbished. The en-suite was all glass which we found very novel and the shower was excellent. Coffee/tea making facilities were provided which is quite unusual in a foreign hotel. We found the staff helpful and the breakfast catered for every nationality and was more than adequate. The surrounding district is a bit run down but there are lots of inexpensive authentic restaurants and the busses are cheap and frequent. We got the A22 bus from the airport as our pre-booked transfer did not turn up, I think it cost 69HKD each and the stop is just round the corner from the hotel. Senior citizens get to travel free on the Star Ferry and there are quite a lot of other concessions if you are an OAP so don't forget to ask. We had lovely weather and had a terrific trip especially as we caught the end of Chinese New Year. (If you cant find the hairdryer it is in the drawer in the en-suite.)", "Date": "February 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Quite nice but a bit off.”", "Author": "Mats_Stockholm", "ReviewID": "UR23788961", "Content": "This hotel is quite nice and feels fresh. Our room was rather newly renovaited. We got a room on the 14th floor with a view ower the old airport and could see a little of the harborough. Comfortable beds, coffeemaking facilities, flat TV, sitting area and a beautiful chaineese dekoration at the wall ower the bed. The staff werer very friendly and helpful. Mabye the reception isn´t so great, feels a bit streange. The problem with this hotel is the location. It´s a bit way out and a bit too far from the city. We took the local doubbledecker bus just outside the hotel. It din´t even cost a dollar. It took a while to get down to the city of Cowlon but on the other hand we got a nice sightseeing tour. Around the hotel you find a lot of genuin small local restaurants, small shops and also a quite interesting local marcet. The hotel is quite alright but the location is not. Mats and Lasse, Sweden", "Date": "January 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Can be good value if all you need is a clean room”", "Author": "L00ps", "ReviewID": "UR22495545", "Content": "I lived in HK until my early teens so I remember this hotel, which is located right next to the old Kai Tak Airport. Then, it was a classy 4 star joint. Some 15 or so years later, it has not changed that much. The lobby is renovated but the room decor is exactly the same! But don't get me wrong, I was on a personal visit and only needed a clean, decent room so for the price I paid, which was inclusive of airfare, the Regal Oriental worked out pretty well. I didn't expect frills and did not find any. It would have been better, though, if more attention is paid to the decorative conditions in the bathroom. The bath tap and showerhead have seen better days. Everything worked, though. Seals do need to be scraped out and redone. In terms of transport links, the buses are very good though of course only if you know how they work! The A22 Cityflyer takes you directly from the airport to right outside the hotel and costs far less than the Airport Express. There are direct buses outside the hotel by Sung Wong Toi bus stop (cross the road by subway) which take you to TST, Jordan, and Central (9, 11 and 101/111). For the budget conscious traveller, it would be possible to do lots of homework beforehand online and on arrival at HK International Airport, buy an Octopus Card from Airport Express's customer service desk and put money on it and off you go! The Octopus Card is used on all public transport as well as for small purchases from snack machines and such like so it is worth getting. I would mention that the hotel is in the \"Kowloon City\" district as in the old \"walled city\" which was grazed down. There is a park nearby which, I believe, has a small museum about the walled city as it then was.", "Date": "December 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Inconsistent”", "Author": "Miffy123", "ReviewID": "UR21584380", "Content": "Not all the rooms in the hotel have undergone renovation, so beware when booking a Run of House room from travel agent. Stayed here on two separate occasions, and the quality of the rooms varied significantly. The level 11 room was spacious, freshly refurbished, with comfortable beds and a LCD TV. The level 6 room was spacious but old, with hard beds, worn-out furniture, stained carpets and a mouldy smell. For both rooms, the bathroom was dated and quality of the towels ranged from fluffy to well-worn. We were also shown a newly renovated twin room on level 3 with contemporary furnishings and a modern glass bathroom, but the size of the room was extremely tiny. Service was also inconsistent, ranging from extremely helpful & polite staff to apathetic & gloomy-faced receptionists. The hotel is still undergoing renovations, and the view from the hotel rooms were of bamboo scaffolding and the concrete wasteland of the old HK airport. Location-wise, the hotel is not in a touristy area and is not close to a MTR (subway) station. However, outside the hotel there is a taxi stand (reasonable price, but not for peak hour traffic), as well as a mini-bus station (ask receptionist to change your notes to coins as the bus only accepts exact fare). Airport shuttle bus provided by the hotel was very useful.", "Date": "November 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great Inexpensive Hotel”", "Author": "hatster31", "ReviewID": "UR20653976", "Content": "This is a great hotel if you are looking for something inexpensive and am willing to travel via bus to places. This used to be a solid hotel back when the HK airport was in Chep Lak Kok. I was able to book a room for USD $75 a night via gtahotels.com, and there were many other websites that had the rooms under USD $100. The room and hotel are very clean. However, do not expect too much luxury. The hotel is also undergoing outside renovation on the outside walls, so there is not much of a view. The room is very quiet because of the double pane windows, so you hear no street noises. To travel around, there were always a lot of taxis outside the hotel. You can also take the 25M bus to Kowloon Tong MTR station. The stop is right outside the hotel, and you can ride it all the way to the end stop. Just make sure you get exact change or an Octopus card. You can also ride the green mini bus to Mong Kok. When you get off at the end station, walk to the end of the street and turn right and there is the Mong Kok MTR station. There are also multiple buses within a 3 minute walk. Just ask the front desk. The bus has route info, so you can see exactly where the bus goes and where to get off. So, this is a convenient location if you know where you are going. There are also many restaurants close by, but not too many with English menus or English speaking staff.", "Date": "October 6, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Guwahati, India", "Title": "“Didn't like the view form my window”", "Author": "Sudeepto", "ReviewID": "UR17925476", "Content": "The room was ok but very congested. The view from my window was terrible as there was scaffolding all around because of some construction going on at the hotel. The service was terribly slow. I had to call Housekeeping twice and wait for more than an hour to get an adapter attachment for plugging in my laptop. The worst is, most of the Housekeeping staff who came didnt understand English so whatever I use to say or ask, they will ask me to phone the Reception. The buffet breakfast (that was complimentary) was most boring. I stayed for 3 days there and I ended up almost bored with the same breakfast laid (without any variations) every day in the morning. The location is very far from the main tourist places & shopping areas. So, if you are going to Hong Kong as tourist and shopping, then Regal Oriental is definitely not your best choice.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London", "Title": "“Disappointed”", "Author": "cookie8", "ReviewID": "UR17185528", "Content": "We were booked into this hotel as an add-on to a tour of China. We checked it's website & it seemed fine apart from being outside the main Hong Kong attractions. There was some refurbishment happening when we arrived, lots of noise & dust, but the major disappointment was the room. Our room 347 was a furnished corridor! The room was approx 8 feet in width with 2 single beds squashed up at the end of the room. It had the feel of a room in a university hall of residence. We were there for 2 nights, our room wasn't made up after the first night either. Due to the builders we had to keep the curtains drawn as they were wandering about on the scaffolding outside the window. There are much better hotels to choose from in Hong Kong so my advice is steer clear of this one.", "Date": "June 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“nice affordable 3 star hotel”", "Author": "tqlagold", "ReviewID": "UR16694725", "Content": "I booked the hotel thru HKHA (Hong Kong Hotel Association) at the airport. They offered a really good rate including airport transfer (to the hotel and to the airport). The bus ride to the hotel from the airpot took only 45 minutes, but going to the airport from the hotel took about 1.5 hours because we stopped at another Regal hotel to pick up more people. But overall, the complimentary airport transfer is great. The location is not so great, it takes one bus ride and MTR rides to get to go tourist attractions (TST, hong kong island, etc). The bus ride is about 15-20 minutes, and MTR takes a second. For 4 days I was there, i bought a HKD150 octopus card, and still have HKD30 left. And I take MTR everywhere (including Tung Chung to go to Big Buddha), I didn't even ride on a taxi at all while I was there. The room is spacious. We actually got a sitting area. The mattress is hard, but I think it's normal in HK. We got a view of the Prince Edward Road from 12th floor. Concierge staff is very helpful, reception staff are friendly. They charge HKD50 for half hour internet use on 3rd floor, not bad. There are a lot of thai and vietnamese restaurants around the corner. The neighborhood seems pretty safe to walk around at night. We were jetlagged, so we walked to 24 hour McDonalds at 4am. The only bad thing is, the hotel doesn't have a pool. I had never stayed at a hotel with no pool. It rained a lot when we were there, and an indoor pool would be great when we're stuck in the hotel.", "Date": "June 5, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bristol", "Title": "“good value (because of the area)”", "Author": "Arthawk", "ReviewID": "UR15752393", "Content": "Located in Kowloon City (not Kowloon Tong), and trade has passed on with airport relocation. It really is a long way from the HK action. Other than the small historic Walled City Park and the multitude of Thai and Chinese restaurants in the little enclave around the corner, there's nothing to see or do here. The upside of that is, as soon as you leave the hotel on foot you are unlikely to run into any other tourists. It's a working class HK neighbourhood which can be fascinating until you realise that the way people hang their washing out is pretty much the same all over the world. But if you've been to HK many times and always stayed in tourist-infested Central or Tsim Sha Tsui, it's an interesting experience for a couple of nights.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Antwerp", "Title": "“chinese logica”", "Author": "Cats9000", "ReviewID": "UR15607739", "Content": "When arriving it has a regular three star entrance, the service is a bit chaotic, sometimes they open the door for you, sometimes they just stand there. They let you carry the luggage inside, after they take it to the bell desk. Check-in was not heartwarming. After check-in nobody was there to take our luggage up, so we unlocked it from the wire they put around our suitcases and carried them ourselves. Surprisingly while the hotel is mainly in old brown classic Chinese decor, the third floor-the Regal I-club where we stayed, was ultramodern and design, the rooms were equipped with a transparent wall-bath room and a big mirror on the ceiling that gave a bit of a love hotel impression. The Regal I-club has its own breakfast area at the same floor with a service counter, but the breakfast downstairs offers more choices. It's located close to bus stops, but rather far from the subway station. Good and cheap restaurants are on walking distance.", "Date": "May 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Beijing", "Title": "“The worth hotel !”", "Author": "Jambs39Beijing", "ReviewID": "UR14315609", "Content": "The good point first : None The bad point : Room small (even when I was student without a peny my room was much bigger) Basically, there is place for the bed, 1 small lugage and...that's it. Transfert from the airport to the hotel : stopped at 11:00 pm...noone informed us, even if we have warned on our late arrival... Transfert from the hotel to airport : 2 h with a ... bus, instead of 30 mn with a car Basically I would not recommand at all this hotel", "Date": "March 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Regal Oriental Cheap and Convienent”", "Author": "Abdul_R", "ReviewID": "UR11206877", "Content": "This hotel is located in Kowloon Tong where the old Airport and use to be the closest to the airport. Ok now for no one whom has been to Hong Kong I have stayed at this hotel twice already this year. The hotel is about 15 minutes cab ride from Kowloon Tong Metro station which is about $30 HKD during rush hour. (There is also a massive shopping mall attached to the station) If you wanted to you could always use the public light bus which costs $4.00 HKD either cash or Octopus (equivalent to a Oyster card used on London transport) normally it is bus number 25M when you come out of the hotel and turn left that you would one to catch to Kowloon Tong plus you can’t miss the stop on the 25M as it is the last stop on the bus. Myself and a college was there for business and leisure the area we thought was very safe as we would be out at 3.00 o’clock in the morning. A cab fair from Lan Kwai Fong which is the club district for Hong Kong and which is on Hong Kong Island is about $100 HKD but make sure to state Regal Oriental old airport hotel as they have a tendency to go to the Regal riverside hotel. The hotel for its price is brilliant and I personally thought it was perfect to move around the whole of Hong Kong. The hotel was brilliant you couldn’t go wrong soon as you land at the airport there are direct connections via there hotel shuttle bus to the hotel the shuttle bus also servers Disney Land Hong Kong. The staff at the hotel are brilliant they have are very proficient in English rooms are extremely clean the view is brilliant. The rooms are modern and have a very elegant feeling and we where staying in a deluxe room the bathroom was amazing with a marble effect wash basin shelf with a massive mirror and hair dryer the room we where staying in also was equipped with a mini bar and a safe . I would say after having a look at the business rooms the deluxe is a lot better. There is access to a Wifi internet connection in all the rooms at a charge of $350 HKD for 3 days and about $100 HKD for 24hrs. They have a small business centre as well which offers printing, fax, scanning and photocopying the rates are reasonable. I would recommend this hotel to anyone without hesitation. The Hotel is also situated very close to the Hong Kong Baptist University Hospital which has an Accident & Emergency department.", "Date": "December 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Too far out from anything”", "Author": "FamilyOnVacati0n", "ReviewID": "UR10932387", "Content": "This hotel is not convenient from anywhere of interest to a foreign tourist. It is NOT near an MRT (subway station) and there is NO easy bus lines to an MRT station. You either have to take a taxi OR if you are chinese and adventurous you can be like a local and flag down the \"right\" green mini-bus from the side of the street (2 blocks from the hotel, NO station, the destination sign in chinese) to take you to the nearest MRT station (Wong Tai Sin station). The hotel itself looks nice but the rooms, although VERY nice, are very old. May be they are going for the \"retro\" look. I ate at the roof top restaurant/bar (very nice and EXCELLENT night view) but, I was the ONLY guest the whole time I was there. I just get the feeling that this hotel was once great but now it is \"left behind\" by the changing time. I loved the bed and the bedding, it has one of the best blankets and pillows that I have had in a 3 or 4 star hotel. The flat panel TV is good too. The bathroom is nice. This hotel was one of the best priced 3 star that I found for November. In summary, the accommodation is GREAT but the location is terrible for a tourist.", "Date": "November 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good value, but inconvieniently located.”", "Author": "APGUK", "ReviewID": "UR10914089", "Content": "Good sized room (upgraded for small fee). Staff very friendly, didn't eat in the evening, but the breakfast was good. The only bad thing about this place is the location - don't stay here if you need to pop back throughout the day, as it's a 20 minute (very cheap £3.50 / HK$50) taxi down to the Star Ferry. If you're going to be out all day and not need to pop back to your room, then this is a pretty good choice. They had a small gym and a free 3 PC internet room, but didn't use either.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Great Staff, Great Hotel”", "Author": "ChinaBest", "ReviewID": "UR10086770", "Content": "The Staff here were fantastic, very attentive and caring. we became members of the Regal Club and it made a difference to our stay for sure. The hotel weekend buffet was terrific. Very clean hotel, and close to downtown via short bus ride (10 mins). Plus the buses run very frequently so you never have to wait more than a couple of minutes until the next one. We would definately stay here again when we are next in Hong Kong.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vienna, Austria", "Title": "“Are all rooms SO small?”", "Author": "isiaVienna", "ReviewID": "UR10040698", "Content": "We have booked for one night only for 3 persons. The room was really VERY small. Normally it should be the room for 2 persons not for 3 ! One night for arrival after midnight and depart before breakfast (flight very early) - is ok, but not for longer stay. Location ok. Room quiet. Staff very friendly.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Cincinnati", "Title": "“Very Nice Hotel for the $$ but not convenient for tourist”", "Author": "DougMCincinnati", "ReviewID": "UR8608782", "Content": "This hotel must have been one of the closest and most disired hotels for the old HK airport, literally overlooking it. The staff was friendly and helpful, very much making you feel like a valued customer. Our room was clean and comfortable. The breakfast buffet was good. Our rate was terrific we thought for HK but now we know why. It takes 30 minutes to get to the Harbor area from the hotel with good traffic. If you're willing to sacrifice your time to save some money then I do not think you will be disappointed. Watch out the upgrade selling when you check in. The only one we took was free airport transportation combined with the breakfast buffet. My advise is to call them directly to make your reservation and get them to include it up front for their usual price if possible.", "Date": "September 2, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Cebu, Philippines", "Title": "“What a memorable vacation it was...”", "Author": "ChrissyAC", "ReviewID": "UR4831199", "Content": "I recently went to visit Hongkong with my family and it was our very first trip to other countries. We got to stay for 5 days in the Regal Oriental Hotel. And I have to say that all of the hotel staff were very polite & helpful. Especially since we didn't have an agency to assist us with our trip. Our trips to Hongkong's tourist destinations would not have been made possible if not for the assistance by the hotel staff. We were able to visit Kowloon Hotel & Holiday Hotel. And frankly speaking, I prefer the Regal Oriental Hotel better because of its cozy atmosphere in the hotel lobby. The room that we got had 3 beds. The space was quite adequate since there were only 3 of us. We have brought and eaten food inside our rooms and we have never seen any insect crawling. Our room was kept well & tidy by the hotel maids every morning. So by the time we return to the hotel in the evening, it makes it easier for us to lay down immediately and sleep. One flaw of the hotel is their water system. During our entire stay, they were doing some maintenance & repairs to it. It didn't affect us though since we are already gone by the time they cut-off the water. And we have already arrived by the time the water system is being resumed to normal operation. One important thing is that they never fail to give out announcements to all hotel guests about the water interruptions.", "Date": "April 3, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Goodbye Regal Oriental”", "Author": "A TripAdvisor Member", "ReviewID": "UR3439678", "Content": "Regal Oriental used to be the renowned 4-star Airport Hotel in Hong Kong, that's why before I move in, I don't have any doubt on its quality. Unfortunately, the hotel's golden days have gone, following the removal of Kai Tak International Airport to ChapLapKok...... 1. The room size is alright, not small at all as compared to many other 4-star hotels in HK, however, all the fixtures and fittings are very old that you suspect the hotel has ever done any upgrade since its establishment 2. There is very strong smell of \"artificial fragrances\" throughout the public areas and elevators of the hotel 3. A small cockroach is found inside the room when we wake up in the morning 4. Internet access is equipped but you need to buy a HKD150 one-day access card. However, the card is out of stock when we want to buy one at the reception. Nothing can be done because it's out of office hour by that time. We end up to go somewhere outside the hotel to get internet access as we have a business conference the other morning at 8:30am! 5. I really want to say some good things about this hotel as it's sad to see a used-to-be international airport hotel to go far below the market standard. However, I can find nothing to praise......maybe the hotel staff there are still friendly. Management of the Regal Hotel Group should think about this as it's not fair for their staff. To them, the product itself is fatal, no matter how friendly they are, the customer expectation still won't be matched.", "Date": "May 5, 2005"}], "HotelInfo": {"Name": "Regal Oriental Hotel", "HotelURL": "/ShowUserReviews-g294217-d302180-Reviews-Regal_Oriental_Hotel-Hong_Kong.html", "Price": "$93 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.30-38 Sa Po Road, Kowloon</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "302180", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c5/d9/ed/hotel-exterior.jpg"}}