{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bacolod, Philippines", "Title": "“Small but nice”", "Author": "jpamacio", "ReviewID": "UR139798208", "Content": "Our room is small but nice. I love the interior. It has 2 beds 1 double and 1 single. Worth it. Has a lot of cheap resto just outside the hotel. Our room is small but nice. I love the interior. It has 2 beds 1 double and 1 single. Worth it. Has a lot of cheap resto just outside the hotel.", "Date": "September 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "pattaya", "Title": "“second stay”", "Author": "terry r", "ReviewID": "UR138941743", "Content": "although my first stay was almost 8 years ago , I returned last week on business room was clean and comfortable , evreything worked and even though I was only ther for 3 nights , I was very happy. Hotel has good selection of in house restaurants (avanti pizza was excellent) . Location is a little remote from \"downtown\" Kowloon , but hotel has free shuttle bus to nearest rail station and free shuttle to airport . Good shopping mall on 5 minutes away by taxi . The quality of the hotel is not reflected in room rates . only 2 min walk from local shops and restaurants where local food is served . highly recommended !!!", "Date": "August 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“A GOOD HOTEL CHOICE”", "Author": "resortmanSingapore", "ReviewID": "UR138279098", "Content": "Decided to give this hotel a try regardless of other reviews by Tripadvisor forum contributors. Landed at HKIA and went to this hotels counter at the airport. It would cost us HKG$200+ per person to arrange Hotel transfer to the Hotel in Shatin. Very helpful Regal staff directed us to take the A41 express bus which costs HKG$22.90 each (or so) Bus stopped near a subway and the hotel was just in front of the other side of the subway.Tell the bus driver and he will alert you as to where to get off. Check in was efficient and took less than 20 minutes. Room was nice and clean and all modcons worked.Just be aware that if you do your internet in the room..you will be charged. Free wifi is only in the lobby or the poolside. Had Tim Sum lunch in the hotel's restraunt. Good. A bit pricey.Check your bills before you pay. Had two additional items in ours which we did not order or ate.Amicably settled with Captain. Place was full, maybe thats why the confusion?Next table had about the same problem. Management should look into this. Buffet breakfast was reasonably good if you do not have to eat it 5 times over.Menu should be rotated. Management should look into this also. Acessibility to ALL over Hong Kong and Kowloon places very convenient by Bus or MTR. Hotel provides a shuttle every 30 minutes to Shatin Station.Lots of buses from just out side hotel to Shatin Station.Good to take a stroll along the river thats just in front of the hotel. Staff in all departments we encountered were service oriented and pleasant and informative.Check out took a little longer, about 40 minutes.A bit too long.They have a holding adjacent room for Groups but the floor staff did not attempt to\"herd the sheep\" The check out area was swamped by the groups cheking in and checking out. Maybe Management may consider using the 15th floor Regal Club for FITs to check in and out during peaks? A good value for money hotel indeed.", "Date": "August 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“The last hotel I would stay in Hong Kong”", "Author": "Marketing87802000", "ReviewID": "UR138271176", "Content": "The airport desk of hotel try to surcharge me 3rd person for airport pick up while the reservation dept. already arrange complimentary shuttle for 3 of us, by the time I checked in, the front desk chewed gum and no smile or greeting to guests, the concierge kept me waiting for over 10 minutes and did service to other guests by the time she promised to check the restaurant for Yam-Cha, the free wifi or internet only in Lobby, the poker faces of most of Front Officers in hotel stop me to stay afterward.", "Date": "August 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Referred by friend!!”", "Author": "Honey425", "ReviewID": "UR137309814", "Content": "I had a friend who stayed at this hotel a few months back and she said it was one of the better hotels in Hong Kong. She mentioned that the staff is really friendly and the rooms are super clean. On her recommendation I have booked my stay here on sep 23. I am looking forward to my stay there, hopefully it will be as great as everyone else's. She mentioned that I should ask for a room specifications before going for my stay, however unsure how to do so as I booked through Priceline.com ( tried to book through the hotel Website directly but they wouldn't accept my credit card when the same card worked on Priceline... Bit of an irritance but hoping that trip will be much better)", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wenzhou, China", "Title": "“Great experience”", "Author": "James T", "ReviewID": "UR137083240", "Content": "The hotel was packed! Great experience, breakfast buffet is a great deal for the money. If you book online, you get free internet and free shuttle between hotel and the airport. If I can make any gripe about the hotel, the elevator is odd. We had to wait at times 20 + minutes before the elevator would arrive on our hotel then it would have to stop on EVERY floor. Sure that engineering and proper programming will fix this problem. If we weren't on the 13th floor, we would have used the stairs.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“very good hotel but go for the higher floors”", "Author": "4kiwis2011", "ReviewID": "UR136550792", "Content": "We ended up here for one night because we were stuck at Hong Kong airport. They gave us two rooms on one of the higher floors and those rooms are really great. Fantastic view, great bathroom and comfy beds. We really rested and enjoyed a very good breakfast the next morning before resuming our travels. Even though we were only there for one night, we appreciated the staff helping us out in the middle of the night, arriving very tired and with two children. We were happy that we had chosen to continue our journey only in the afternoon so that we could sleep in and enjoy the breakfast. Would recommend this hotel to business travelers and families alike.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amritsar, India", "Title": "“nice place to stay”", "Author": "goldenticket_travels", "ReviewID": "UR136466442", "Content": "Amazing place to stay.... helpful staff and nice service...The restaurant of the hotel is beautiful and the waiters are very friendly..i really enjoyed my breakfast as it is the most crucial thing to rate the hotel's food... the only problem is its very far from the airport...but the location is good..", "Date": "August 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Australia", "Title": "“'Far from the best'”", "Author": "Sue T", "ReviewID": "UR136256476", "Content": "We spent 10 nights here, 1st mistake. Not that you should have to, but ask to be shown to your room, as it is very confusing & you could find yourself looking for an hour. Our first room was river front with lovely views, but as this was not a smoking room (Like we booked) we were moved the next day, the new room although no river view was bigger & still had good views. Breakfast had a good variety of food, BUT all the hot food was not kept hot & was cold. Location is a bit far out from Hong Kong Central, but public transport is easy to use & the bus stop is just outside the hotel...The hotel has shuttle buses, but only 1 of them is free, the other (Kowloon Shuttle) is not but the hotel doesn't tell you, also check weather as no buses run if Typhoon warning gets to Catergory 8, which the hotel also neglets to tell you, so you could find yourself stranded & having to pay for a Taxi + danger money. This happen to us, but after some strong conversation with Management they reimburssed our Taxi fare. All in all this hotel looks nice but really has nothing going for it...", "Date": "August 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Depends which room you get”", "Author": "Birdie56", "ReviewID": "UR135032461", "Content": "I stayed at the Regal Riverside with my dragon boat team when in Hong Kong for the 2012 Club Crew World Championships. There were 27 in my group, plus we heard feedback from other teams. The quality of the rooms varied greatly, even on the same floor. Some had very modern and well-appointed rooms while others had ageing rooms that were badly in need of refurbishment. On the 15th floor, the rooms were were very bright and comfortable but quite narrow. They had mirrors everywhere, including on the ceiling, possibly to help them look bigger. Rooms on floors below 15 were bigger but were not as modern. Some of the rooms on the 9th floor seemed to be in bad shape - some were even smelly. In the worst cases, my team mates requested (and received) a room change. On the other hand, one of the best rooms was 901 which is a corner room with views over the river and the hills. There was a lot of inconsistency between rooms in what was provided and whether electrical fixtures worked. However the staff were very friendly and acted quickly when issues were pointed out. I should add that the room rate we received was good value and the breakfast buffet had a good selection of Asian and western food. The location at Shatin was great. It was close to two MRT stations and a bus to Nathan Rd stopped right outside the hotel. It was an easy walk to the Shatin shopping malls and the hotel provided a free shuttle bus to the Shatin Centre and MTR station. There were numerous local restaurants behind the hotel and many more in the Shatin Centre - or you could eat in one of several restaurants in the hotel.", "Date": "July 22, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Canberra", "Title": "“Horrible worst hotel ever”", "Author": "Haze95", "ReviewID": "UR134957540", "Content": "My daughter stayed at this hotel as part of a sporting tour and when we visited her 2 days into her stay we found the toilet shared by 4 girls had never flushed, the girls had to travel down to the lobby to use the bathroom. We complained to the desk staff and the toilet was cleaned but not repaired and during there 7 day stay was NEVER repaired. We later found all the girls rooms were the same. We moved her into our hotel the outstanding YMCA. The management may well make excuses regarding this but as they told us we will fix it but it seemed they never will.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Chennai", "Title": "“Away from City. Ok place”", "Author": "sand1977", "ReviewID": "UR134812236", "Content": "I do not have any complains about the hotel and its facilities. The rooms are big the food is big they also have free shuttle bus to main downtown and even the Metro/Subway is near by. There is a wonderful river in front and a very nice food street behind the hotel. But it is too far from the down town. Only reason I stayed here to save some money as other hotels were very expensive.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "City of San Fernando, Pampanga, Philippines", "Title": "“Highly-recommended”", "Author": "Nina T", "ReviewID": "UR134325602", "Content": "Great location, right in the middle of a self-contained area. Everything was within easy reach - restaurants, shops, jogging path, MTR station, etc.). We had an excellent view of the Shing Mun River. Restaurants (Chinese, Japanese, Thai) offering yummy fare at reasonable price were a few steps away from the hotel. We did not have time to enjoy the complimentary breakfasts because we had to leave early each day of our stay - an hour or two before the Moon River restaurant opened. Our room was clean and well-appointed, as accurately described and shown in the hotel's website. Hotel staff was courteous and well-mannered. The hotel offered complimentary shuttle service to various points (e.g. airport, Kowloon area, Disneyland). We initially had a problem with the toilet bowl but it was fixed immediately after we reported it. It was our first time to visit Hongkong but it felt like home to us. Highly-recommended!", "Date": "July 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Close to the border and Shenzhen. Lots of cultural things to do in shatin. They ptovide free shuttle to airport, disneyland, sha”", "Author": "VillaBianco", "ReviewID": "UR133972381", "Content": "I stay with my company on a regular basis. I don't pay so don't actually know the room rates but what I would like to comment on us how great the staff are. The shuttle is great as well. The rooms overlooking the river are \"out there\" tiled floors, modern but kinda soulless I prefer the carpeted rooms.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ahmedabad, India", "Title": "“Value for money”", "Author": "HarshShukla", "ReviewID": "UR133410560", "Content": "I travelled to Hong Kong with my family in May-12. The hotel is value for money. It is situated in a good place from where you can get any vehicle to go to the City. The rooms are just good and the service is also ok. The only problem you will face is the language. The just dont understand our accents so dont be surprice if the caretaker comes with a blanket instead of the soap. Do enjoy the spa after travelling the whole day, it is the best place to visit. The Spa is relatively cheaper than other outside outlets. American Breakfast is also good.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Unsatisfactory room service and facilities, average stay”", "Author": "Paul F", "ReviewID": "UR133175862", "Content": "My family stayed at the hotel for two weeks and was disappointed by their housekeeping service. Response to our requests took much longer than we expected. One night when our kid was in the shower, he realised there was no shampoo in the bathroom. Apparently it had been missed out. We called housekeeping to request the shampoo. They said they would bring it over. We thought the housekeeper was on their way so asked our kid to wait for a while in the shower but it was after half an hour when the housekeeper finally arrived with the shampoo. We had already asked our kid to forget about the shampoo so he resorted to using the bath gel to wash his hair instead. Another instance of poor housekeeping was when they forgot refilling the minibar with drinks, we called, but we had to wait for one hour. We only had the drinks brought to our room after making a second call. That was again far from satisfactory. A few other times we also had to call housekeeping to request for items they had forgotten to provide us when making our room. Despite the above disappointments, we would say the staff were courteous and respectful in general. On the other hand, the hotel provides convenient shuttle bus service to the town centre, airport and other places. The only thing I have to complain about the shuttle bus service is that the airport bus advertised a 'Free WiFi' on-board the bus. There was none. The new iClub room we stayed in had a nice modern design but was a bit too small for a family. There is barely enough room to walk to the other side of the room and we tripped over the bed a couple of times. The distance between the bed and the wall is only about a foot wide. The room also did not have a proper sofa and coffee table area for us to sit down and relax. There was only one small desk and one chair for three of us and that's all. The bathroom with a glass wall and a glass door looks modern but the drawback is that it does not provide enough privacy. The television was a pain. Due to the limited space, it is installed on the ceiling meaning we had to look up to watch TV. Our necks were sore after a couple of days! There were not enough power sockets in the room (only three with one already taken by the alarm clock) meaning we had to take turn to charge our electronic devices. Also, one of the power sockets in our room was dangerously loose. The WiFi service in the room was pretty good except for the fact that only one device could access it at a time making our Internet browsing quite inconvenient. The iClub buffet breakfast provides good food but is almost the same every day making it very boring as our family stayed at the hotel for two weeks. Despite the above disappointments, we would say the staff are courteous and respectful in general. On the other hand, the hotel provides convenient shuttle buses to the town centre, airport and other places. The only thing I have to complain about the shuttle buses is that the airport bus advertised a 'Free WiFi' on-board the bus. There was not any. The rooms facing the river provide spectacular and breathtaking views. The location is very convenient as it is located near restaurants, bus stops and shops. It is near walking and bike paths which can be an alternative route to the town centre apart from the shuttle bus. In conclusion, our stay at the hotel was average as it had its good and bad sides. In the future we may consider staying in another hotel.", "Date": "July 1, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Hong Kong, China", "Title": "“HORRIBLE. WORST EXPERIENCE. STAY SOMEWHERE ELSE.”", "Author": "Donna C", "ReviewID": "UR132310193", "Content": "This is the worst hotel experience that I have ever had and I have stayed my fair share in hostels in third world countries, which had far better service and cleanliness than this one. Nothing compares to this horrendous experience at this supposed \"4-star\" hotel. If it means anything, I am writing this right now in the lobby of this hotel (still with a few days to go in this hellhole) because it is just this bad. Allow me to elaborate thoroughly: On our first day upon arriving... 1. The one thing we noticed right away was that all the sheets had this unbearable, musty smell. It was clear that the sheets on all three beds were not cleaned thoroughly but instead smelled like the odors a previous person left. 2. Halfway through a shower, one of the bathtub faucet knobs fell off, rendering it useless. 3. Halfway through watching TV, the sound automatically mutes, then unmutes a few minutes later, only to continuously repeat this pattern. 4. The air in the room would sometimes smell like urine when no one had used the bathroom. If you can believe it, THIS ALL OCCURRED WITHIN THE SPAN OF THREE HOURS. Needless to say, we requested a new room. But to no avail. In our new room... 1. The sheets continued to smell HORRIBLE. Imagine if you had to sleep in sheets that somehow made you feel like a sweaty, stinky person had just slept in those sheets. 2. The cleaning lady never cleaned the bathroom properly. There was always grimy dirt that was visible behind the toilet and hair on the floor. 3. We came back one day and noticed that we did not get shampoo, so we called reception to request some. A housekeeping lady came knocking and told us, word-for-word, \"Sorry, we ran out of shampoo. So, please just use water to wash your hair.\" There was nothing else. No effort, no mention of when there might be shampoo or offering to get it some other way. With regards to other things... 1. They charge a ridiculous amount and have needlessly complicated system for wifi in the rooms. 2. Sitting in the lobby using their free wifi, I have seen two people yelling at the employees because of inefficient service, with one taking his entire family and leaving the hotel. There was absolutely no effort on the staff's part to reimburse, apologize, or try to stop this man from leaving. From a \"4-star\" hotel, this is just bad service. 3. There are people crowding the lobby at all times of the day. Which isn't so annoying, until you've spent a night sleeping in stinky sheets with faucet knobs falling, crappy service from staff, and realized that you paid way too much for this hotel, if you can call it a \"hotel.\" CHOOSE ANOTHER HOTEL LIKE YOUR LIFE DEPENDS ON IT.", "Date": "June 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“First trip to Hong Kong”", "Author": "Locutus233", "ReviewID": "UR132199453", "Content": "This hotel was very nice and the service was great. When we arrived the hotel had doorman who was waiting at the door and helped us with our bags. He asked us if we were checking in, and unloaded our bags from the cab allowing us to check in and then brought them up to our room. The check-in experience was great, no deposit required, credit cards accepted. Provided us with everything we needed. I think we ended up with an upgrade room as we were in a regal iClub room. The room looked nice from afar, however when you got up close the white leather they used for the furniture was not completely clean, probably not the best choice of colour for hotel room furniture. The AC worked too well, and had to be turned off at night, it apparently ran during the day preventing the windows from fogging up due to the climate in HK. Which meant the room was extremely cold when we came back at night. The room has a mini bar fridge this stopped worked about 2 days before we planned on leaving for home. The hotel also had a self service laundry located on the 8th floor, it requires $15 in coins per run. The machines are Japanese. You can buy soap at the corner store down the block but its expensive, like $40. In addition to run the dryer at at a lower temp I had to run two cycles to get my clothes dry. (from what I understand, in HK and Japan you can only use certain types of laundry soap, most North America soaps are probably too harsh for the water system). Like most of HK this Hotel has a salt water toilet flushing system, but with a western style toilet. The bathroom had a weird layout, no shower curtain just a piece of glass on part of the bath tub. The bathroom looked the most dated part of the room. This could just be because of the materials chosen. The bathroom completely fogs up including the mirror when you take a warm shower. There isn't too many places to hang things in the bathroom. We used the pool a few times in the hotel and had trouble finding a place to hang all our swimming gear to give them a chance to dry other than above the toilet on the towel rack. The humidity in HK is very high so drying things takes a long time. This hotel also has lots of tour groups mostly from mainland china. They seam to be contained to the lower floors, but tended to hang around the lobby in the morning and evening and clog up the elevators at times. They also hog the 2 computers with Internet access. Speaking of Internet, you cannot sign into the wifi in the lobby after 9pm for some weird reason. We were not able to use the wifi in the rooms, i think you need to be a regal rewards customer for that. Because of the tour groups there often isn't a place to sit in the lobby to surf the internet during the evening or morning either. One odd thing I noticed was the fire doors are made of wood in this hotel and I was walking between different areas on our floor and someone was eating or had Durian fruit in their room on the same floor we were staying on, the doors kept the smell contained, but the smell carried in this containment area and was not exactly pleasant when passing through this area. The hotel has a pool which is not heated but it was quite pleasant to take a dip in the cold water in the pool when it was extremely hot outside. My son spent hours in the pool. One of our visits to the swimming pool was a little entertaining, we watch both life guards have to jump into the pool to rescue 2 different Chinese tourist who tried to swim in this pool, but couldn't. The pool is only a maximum of 1.85M's deep. I suspect they were just doing it to make the life guards work for their money. I found it more funny then anything else. But the pool was fun. There is a shuttle service between the hotel and the Sha Tin MTR station, it usually runs every 20 minutes, its a first come first serve, i have seen it leave with people left behind a few times. Taking a cab from the MTR to the hotel is only $20 and less than 5 minutes.We have used this when we were tool lazy to wait for the next shuttle. Its about 20 minutes walk between the hotel and the 2 close MTR stations. The hotel is located about 1/2 way between two MTR stations.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Well-appointed Room”", "Author": "travelbuddyfun", "ReviewID": "UR130780484", "Content": "Stay in this hotel for the first time for 7 nights. It is a spacious room with 2 beds and a sofa bed for our family 3 facing the garden side with schools and apartment blocks view. I believe we were upgraded. Room is clean but the drawers inside the closet are a bit small to put our clothing in for an extended stay. The down side of the hotel is its indifferent noisy tour groups from mainland China and $6 charge for each local call.The lobby is unbearably crowded and people are screaming to each other. On the non-smoking floors, smoking smell was there in some wings where the Chinese tour group was placed. We are fortunately located on the quiet side of the floor. Overall, our stay was very pleasant. There are many bus routes, eateries and laundromat close by. Will definitely stay there again,", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“My permanent address in Hong Kong – Wonderful Place to Stay !!!!”", "Author": "Rulem", "ReviewID": "UR130386585", "Content": "Initially I booked a different hotel that offers Bed & Bath at a very low cost– just what I need as we will be out the whole day, then I realized that after a tiring day it would be better if we can rest in comfortable place – with hotel amenities, after all I am with my family(2 adults, 3kids). I booked this hotel because they offer family rooms and the rate is OK with all the amenities I need and space is bigger than most of the other hotels. I know that in-room wifi is not included in my rate so didn’t bother to ask for that, and that’s not one of the priorities at that time also if ever you would need one there’s free access at the lobby area – which I used on my last day just to communicate to the person who will pick us up from the airport. I would say that the reviewers from this site and other hotel booking site has taught me a lot – prepared me on what to expect from this hotel. Example as are as follows: 1. Mouthwash – It was perfectly labeled that it cost HK$20 not misleading at all even if it is placed together with the toiletries provided by the hotel. If you think this is expensive there are 7-Eleven and other stores just around the corner. 2. Room Scent – I requested for a non-smoking room beforehand and made sure this is available as I am very particular to it. The room assigned to us was very nice including the view. I think this is one of the newly renovated rooms on the 10th floor. I have booked different hotels in HK before and even in their non-smoking floor it smells like cigarette smoke. This one has a very clean scent. 3. Location – I think the location was great, we we’re in the middle of all the places we planned to visit(Airport/Disneyland/Ngong Ping/ Citygate Outlets ) will take about 30-45mins. (Ocean Park/Victoria Peak) will take about 45mins-1hr depending on the traffic. Lots of options on public transportation which is also very efficient and easy to follow. We took the hotel shuttle to Disneyland & Airport and took Bus 170 directly to Ocean Park. Took MTR to Central on our way to Peak Tram. Very accessible – make sure you research you options beforehand just like what I did. 4. Concierge – Book your Airport Shuttle with them in advance as this is a first come first served service. Shuttle to MTR is also available – but if you can’t wait for the 20mins interval you can just take the taxi for only HK$20. 5. Booking – book directly if you can – they have more freebies if you do so. Unfortunately I wasn’t able to because of the initial booking I made with Agoda on the other hotel – and used the credits to book this hotel Overall I had a really wonderful stay in this hotel – will definitely come back and stay here again, as I have said this is going to be my address in HK every time I visit. And will also recommend to friends, colleagues and family (one of my brother is now planning to go to HK and stay at this hotel). Thanks to all hotel staff who made it a very pleasant vacation for me and my family. We appreciate the welcome fruits and the complementary birthday cake for my son. Thanks to to Tony Chan, Queenie for assisting us during check-in , Canattie & Edith during check-out , Doris for the tours/shuttle, Allen and Philip of concierge. To the housekeeping team for a quick response on our request for extra towels. And of course to Josef Halbherr – Thank you very much! More power to all, Keep up the good job!!!", "Date": "May 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“Memorable Stay :)”", "Author": "jeannybaby", "ReviewID": "UR130333070", "Content": "My stay at Regal Riverside Hotel is really nice, I stayed there from May 16-19. I read most of the reviews before staying at this hotel so I knew what to expect about certain things such as to watch out for the noise, etc. But surprisingly it wasn't so bad! The repairs were done at reasonable hours, I wasn't woken up by noise at all. And anyway we leave the hotel and go out around Hongkong and by the time we come back there aren't any disturbances. Hotel Transpo / Wifi - There's a hotel shuttle that picks you up from Airport to Hotel and vice versa; and a shuttle to take you to the nearest MTR, or all the way to Disneyland! So it's pretty convenient. Wifi is not free in the rooms, but there's free wifi in the lobby; just ask the concierge for a password. Location - Okay, it's not the closest to the city. But I'm more of a suburbs person so while I do like to go around the bustling city, I like to go home to quite a relaxing place, and Sha Tin is the sort of place that feels really comfortable, with a lot of open spaces and parks; it's where you can breathe. Anyway we just take the MTR; it's really convenient. We never took the taxi or city bus at all. We even went on a day trip to Macau coming from Sha Tin. Room - We got a room at the 12th floor, facing the river! The room is spacious, clean, with elegant interiors, and the bathroom is clean as well. The bed is comfortable enough. We have an amazing view, facing the river, very nice and relaxing. It's a big change from the view of narrow buildings from the city. There's a park there by the river where you can go jogging if you want. Nearest Shops - I know that there's a nearby shopping mall there but my boyfriend and I sometimes go to Home Square / Ikea to have lunch, it's just a short shuttle ride away from the hotel. There's free wifi at the ground floor of Home Square! There's cool stuff there if you're into furniture or novelty items. If we really want to go shopping for other things we just go take the MTR to go to Causeway Bay and other stations. I definitely would recommend this place to couples especially :) I would probably go back here again.", "Date": "May 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Calgary, AB", "Title": "“Room in fridgid condition; construction above room very noisy”", "Author": "Shop_Montana", "ReviewID": "UR130305519", "Content": "Just checked in the hotel last nite for 5 nites so far the experience had not been present. Room temp. Thermostat was not working properly and kept at 19c although adjusted to 22 a few times. Too cold for toddler travelling with us. Cleaning staffs were a bit noisy outside the hall way. As well we can start hearing renovation noise on above floor at 10, 10:30am and it is still going as we speak. The on duty mgr agreed to switch room for us this morning so hopefully the rest of the 4 other nite experience will be better.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“My favorite hotel in Hong Kong”", "Author": "Rosanna90049", "ReviewID": "UR129734514", "Content": "I like to stay in this hotel because the location is pretty good. I can go anywhere by bus or the MTR since the bus stops are located in front of the hotel. The hotel provides free transportation to the Shatin Train Station too. Overall, the employees of this hotel are very friendly. Whenever I called the housekeeping for service, he/she will show up within ten minutes. I broke my ankle at the last three days before I returned to the States in March. The manager asked the housekeeping to change the shower faucet with a handle for me so that it is convenient for me to take bath. I am touched by her kindness and consideration. I will stay in this hotel when I visit Hong Kong again next time and I will recommend this hotel to my friends too.", "Date": "May 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Houston", "Title": "“just okay”", "Author": "Filter188", "ReviewID": "UR129355350", "Content": "The Regal room that we stayed in is very big however, it is very old and dated especially the bathroom. The bathroom door panel/paint is peeling off, not much of a shower curtain, the toilet flush is finicky. Slippers are provided along with two complimentary bottles of water. Beware of the mouthwash in the bathroom sitting along with other complimentary amenities (ie, toothbrush, combs, etc) there is a charge of HK 20.00 for that. The bed is very uncomfortable, mattress is old and you can feel the mattress spring on your back. Our TV was not working and we had to get them to come fix it. The only plus side is that it is quite convenient traveling to/from airport with bus A41. We exited at the side of the hotel and walk half a block up to the A41 bus stop for the airport ride. Fare is quite cheap at HK 22.30 per person paid with octopus card or exact change. Hotel also provides free shuttle bus to Sha Tin MTR station. The hotel lobby is always busy and packed with tour groups. There is free WIFI but need to wait quite long to get a hold of the concierge for the password. Overall, it is okay if you are not looking for anything fancy or close to the city center.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Good location, lots of food around”", "Author": "mtntraveler412", "ReviewID": "UR128956023", "Content": "We stayed two nights at this hotel, just for the location. The bed was not that good, and the room was about as nice as lower priced hotel in the US. There were many things that should have been maintained better. The shower curtain really needed replacing, and it didnt look like they had vacuumed the room very well. Some of the outlets didnt work, and they pre-set the A/C to not go below 21 degrees celsius. Will not stay there again.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "riyadh/manila", "Title": "“nice and pleasant stay :)”", "Author": "NoViCeForNow", "ReviewID": "UR128642069", "Content": "even though we just stayed for about few hours in the hotel because our schedule during whole HK tour was hectic it was nice and cool. Thanks to trip advisor, they really helped us! Our stay was beyond our expectations. Friendly staff, although they cannot communicate well in English, but it was ok, sign language helps (i think it is universal now). It is a bit off the downtown HK, but then again it is still worth the pros than the cons. Early morning, the view from the river was refreshing. just a few jog from the hotel, away from the hustle and bustle of the city. The place has nearby 7-11 and food stalls. Definitely will come back, imagine that for just a 3 star hotel", "Date": "April 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Guangzhou", "Title": "“convenient & comfortable”", "Author": "jennymoney", "ReviewID": "UR128586346", "Content": "I stayed there for 2 nights. The bus stop is nearby. we took the bus for the city tour. 7-11 and various kinds of restaurants, Japanese, Italian, Viet, Cantonese, satisfied me. I can also enjoy the beautiful view of the canal. The bed is soft and big. The room is spacious and neat. There is a hair dryer , an adapter, two more pillows and quilts in the room. We feel comfortable in it. I like the hotel. I would like to go next time.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "tauranga", "Title": "“bad plumbing”", "Author": "bonnie2603", "ReviewID": "UR128498432", "Content": "We chose this hotel as little family accommodation was available when we travelled. Only stayed one night and were pretty disappointed. The room was ok in terms of size, 4 single beds as requested but all very hard. The main let down was the poor plumbing. the toilet flushing mechanism broke after only 1 use. On complaining someone was sent to fix it but no offer of a better room was made-this was 11.30 pm at night and we all desperately wanted some sleep. After a long repair job the mechanism broke again, we gave up and used the lobby facilities.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "no where", "Title": "“Needs renovation”", "Author": "lalalatracy", "ReviewID": "UR128317983", "Content": "Stayed here for 1 night as Royal Park was fully booked, Regal Hotel is really old, reception/lobby area is very busy, complicated & wifi is not readily available, a password is required from the concierge, but concierge always seems busy. The room & bathroom is really big but it's so dated & old, however it is clean & comfortable. Most amenities are provided incl slippers, but there are no dressing gowns etc. Hotel is in a pretty bad location so hotel provides a free shuttle bus to the shopping mall/bus/mtr station which is handy but I didn't use. All in all, hotel is very good value for money, however if you want to stay in this area I suggest Royal Park hotel, this hotel is good for 1 night only", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Good value for the price”", "Author": "foggycity", "ReviewID": "UR128153363", "Content": "We stayed there 3 nights. The room was large and clean. We also requested and received a room facing the canal. From our window, we admired the huge sport complex across the canal with 6 outdoor swimming pools of different sizes and tennis courts. We also enjoyed seeing the colorful lights of the billboards at night as well as the view of the hill. Not very expensive comparing to the hotels in the city of Kowloon which we did not care to stay because it is just too crowded with wall to wall of people. We enjoyed the walk along the canal under the trees across the street from the hotel and the local parks where there are groups of retirees doing their Tai Chi exercise and dancing. There was also an occasional biker on the bike lane along the canal walk. The hotel is located in a quiet residential area. There are shops and restaurants a block behind the hotel where local eat and shop. The hotel provides free shuttle bus to/from the train station/mall across the canal. Or one can take a pleasant 20 minutes walk there by crossing a bridge left of the hotel. There are many restaurants in the mall and the connected buildings. The A41 airport bus from the Hong Kong International airport deposited us right across the street of hotel. We were at one of entrances of the hotel after we walked under the tunnel (instead of crossing the street). $23 HKD was deduced from our octopus card for the hr long bus ride. Octopus card is a prepaid card which can be used for bus, train, trolley, metro rides and food as well. You can buy it at the HK airport or any 7-11 store. We would not mind to stay there again.", "Date": "April 19, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Adequate but no free WiFi!”", "Author": "Jackie C", "ReviewID": "UR128015593", "Content": "Room was clean and adequate but a bit shabby. Curtains falling off the rails. WiFi in rooms but too expensive. I'd expect it to be free in a 4 star hotel. Only place to plug the kettle in was on the floor. Shuttle bus to centre was good and main bus route runs from right outside so very accessible. Needs refurbishment but would stay there again if I could have free WiFi.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Nice room for our family (after we asked to change)”", "Author": "Steve L", "ReviewID": "UR127502715", "Content": "As a family we're always looking for good quadruple room options, and Regal Riverside is one of the few 4-star hotels in Hong Kong to offer them. I booked online. We weren't too impressed when we first saw our room: the quad rooms (4 single beds) turned out only to be available on the smoking floors in the old part of the hotel. There was no safe box in the room (pretty essential when travelling with family with passports, money, Ipods etc) and no minibar (I like to have a fridge to keep our own supplies cool). But to give the hotel its due, they agreed without argument to move us up to a room in the renovated non-smoking floors of the hotel, this time with two double beds, safe box and fridge. The room was clean and well laid out, with reasonable-length beds, by HK standards. So we had a great stay after that. The location of the hotel is pretty good for anyone who knows Hong Kong already, and doesn't want to spend all their time in Central district of HK Island. The A41 airport bus stops right outside the hotel, as does the 182 bus to Central (and this is a lot less hassle than going to the MTR). So does the 299 to Sai Kung, a prime area of Hong Kong countryside ideal for walking and seaside views away from the city. Just round the corner from the hotel is a stop for the 170 which will take you to Ocean Park. There are plentiful local eateries just behind the hotel, and smarter ones (and lots of shopping) at Newtown Plaza, which is 15 minutes walk across the river, or around HK$3.5 on the bus.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Shenzhen", "Title": "“nice rooms, but what a service!”", "Author": "kappe63", "ReviewID": "UR126660212", "Content": "A good location in front of the river, a very nice environment and a big room, even if the shower is placed too low for a western and it is difficult to fit under. Everything is clean and the bed comfortable. The service is terrible: I had to wait 15 minutes to get my room, even if I already paid the full amount on line, there is even a valet to keep you on line... They pick up my luggage from the taxi, without giving me a receipt, so after I had to call first, than to go to the concierge to look for my luggage, that it seemed to be lost. They found it only one hour later, even complaining because I was talking to them too Loudly, making the other guest understanding that they lost my luggage. None did speed up to search for my luggage, I lost the beginning of the meeting I went to Hong Kong for. For that price I would aspect ed a much better service, certainly not so careless. I went there twice: the first and the last.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "singapore", "Title": "“one of the few hotels that offers quad rooms”", "Author": "orson_y", "ReviewID": "UR126381603", "Content": "This is a long overdue review. Stayed July 2011 for 5 nights on a quad room. We arrived around noon, and found the room not available (official check in is around 2pm), so we went to the shopping center to have lunch. Directions were given by the helpful guys manning the concierge desk. When we finally got back to the hotel, we were efficiently given our rooms. Unforutnately i requested for double beds during reservations and even told the lady handling our checkin, but was given 4 singles on the lower floors instead. No reason given, not sure if she was not conversant in English, but she did not seem to feel like talking to me. What really surprised me was when i asked for an extra card key, she just dismissed my the request. just like my request for double beds. No reason given why i could not be given an extra room key with 4 people staying in the room. This was not a good start of our stay. when we reached the floor of our bedroom, i noticed that a wing was under renovation so it was very dusty and noisy going out from the elevator. good thing my friends and I are heavy sleepers so no worries about noise, but the dust was creeping out of the plasic curtains that they setup. so when you are waiting for the elevator you would get a sniff of the dusts. not sure if they advertise free wireless, but it did not seem to work, i had to plug the cable to get internet. the shampoo/conditioner is the dispenser type, they offer a couple of toothbush for a room meant for 4. and the small mouthwash cost 10$. toilet and bathroom are dated but reasonably clean and functional. one of the four single beds was pretty worn out - it was extra soft with no support. our rooms were not facing the river, what we see out the window was the scaffholding and the nearby school. not really a concern for us. but having booked for 5 nights, i would have thought that a better room could have been given. One of the promotion they offered was free minibar (softdrinks/water), unfortunately i think housekeeping was not aware. i called them the first night, the lady on the line just said yes but nothing happened. the second night, also the same thing. the third night, i had it and went down to reception. i got scolded by the receptionist that there was a queue of people waiting to checkin. i told her that was not there to checkin but to complain for the lack of service. it was then that she changed her tone and offered me the complaint / feedback form. i told her, i didn't need it, that i want the problem to get resolved. i suspect there's just a language problem as the housekeeping ladies seems to be pretty efficient in their jobs. Most probably, they never understood what i needed. but these things should never happen in a 4 star hotel. pool was closed during our stay, the fitness center was pretty decent. a huge choice of restaurant is available, if you're on a budget a good selection of hawker food is there at the back of the hotel. no need to speak the local dialect, just point to the food you find interesting. pizza hut just a short walk away. they seem to cater to mainland chinese tour groups, so it could be busy at times. and maybe that's where the attitude comes in. i would say this is a value for money hotel. but they really need to fix the attitude or language problem of the staff otherwise vacationing guest will just remeber the bad stuff.", "Date": "March 20, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Expensive and and uncomfortable”", "Author": "YanFav F", "ReviewID": "UR126306997", "Content": "Spend 2 night in this hotel, price changing everyday if not booked before. 2100 hkdollar first 1350 second day. Ask for third night 2100 hkdollars Bathroom dirty Nice vew on the river and mountains on the 11th floor. Breakfast only to 10 on Sunday. Nice buffet Third extra bed very hard and uncomfortable but free...", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Its great, don't listen to the whiners”", "Author": "Kelvin S", "ReviewID": "UR126170283", "Content": "I Stayed at the Riverside Hotel in early Feb. Although Check in took a bit long, i was served by one of the most beautiful girls on earth (perman) so i couldn't complain. I booked the most dirt cheap basic room i could find online and they upgraded me to one of their best. There was some noise as they were renovating rooms this was done between about 9-6pm which is fine cuz thats the time when you should be out and about... I dont understand and can never comprehend travellers who complain and whine about TV's in bad positions or they cant find a mall or a little noise...if you want your PERFECT little world where everything is just how you want it...dude...stay home and stop traveling. The staff were very friendly, the room was perfectly clean, there is a HUGE mall just 5 minutes across the river...how another guy on this website missed it is BEYOND me, his eyes must be painted on or something. The mall has the MTR within it...and its just a short trip into the heart of downtown HK. The Wifi was not the fastest on earth but again..if you are sitting in your hotel all day surfing the net...STAY HOME..why bother going anywhere! Its plenty good enough to check your emails and facebook and chat for 10 minutes before you head back out to see the world. ill be going back to HK later in the year and ill be staying there again for sure.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Vicenza, Italia", "Title": "“Far from hongkong and no wifi”", "Author": "Giuls77", "ReviewID": "UR126126117", "Content": "The room was nice, new forniture and clean. The breakfast was ok but there were no wifi connection and to use it you have to pay 500hkd a day!", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "tokyo", "Title": "“Be careful, Room No.15001!”", "Author": "addkei2009", "ReviewID": "UR125981792", "Content": "The room NO.15001 have a nice view, but it will be water leakage on the floor of the toilet. Maintenance staff recoverd the tank every night when we stayed, but next morning again it leaking. I think it is not caused from a tank, but the piping under the floor is broken. Unless fundamentally repair, the toilet is permanently waterlogged. There is no solution otherwise.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Your experience might be based on which room you get.”", "Author": "Hannah W", "ReviewID": "UR125688117", "Content": "Was on a family trip from 26-30dec 2011. The rooms on the lower floors were rather outdated however the top few floors had already been renovated to a modern concept. At first, we had requested for a non smoking room but the only Quadruple Rooms (1 queen and 2 single) were on the lower smoking floors. Being unable to bear the stench, we requested a change and the hotel provided us another room with 2 queen beds on the 14th floor. This room was a little smaller than the one on the lower floor however its design was sleek and modern. We loved the room. The only problem was that the toilet door was broken and there was just an empty space in place of the door. To make it worse, the whole toilet was see-through glass, making it really inconvenient as i was with the family. Service provided was not bad. Nothing much displeased me and the staff around were helpful with all the directions and activities that I had enquired about. Location of the hotel is near 2 MTR stations. Sha Tin and Sha Tin Wai. However, there was only a shuttle bus to pick guests up at Sha Tin station. The shuttle was usually on time as well. The station is about a 20min ride away from Mong Kok; not far and yet not very near either. There are stalls near the hotel that opened till late and so midnight snacks and supper wasn't a problem. Had a pleasant time there but would try out another hotel the next time im there.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Mixed feelings, probably stay elsewhere next time I go to Hong Kong”", "Author": "Pumbainjapan", "ReviewID": "UR125539687", "Content": "I have mixed feelings about my stay in this hotel. As I arrived, I was received without a smile or any interest whatsoever in whatever my needs were. The important thing for the person at the reception was to deal with me as fast as possible so that she could handle the huge amount of paperwork that she had in front of her. My idea was that the reception was understaffed. When I asked for the internet, I was given wrong instructions which I only solved after spending almost one hour in the elevator coming up and down from my room. This was solved after talking with some other member of the staff that told me a very simple set of instructions that had nothing in common with the instructions that others at the reception had given me. Of course, during this hour I was in tremendous amount of stress to check the e-mail because I needed to confirm several issues regarding scheduled business meetings. The sort of unclear and contradictory information and procedures would occur frequently. On the first day I went to have breakfast and it was free, the second day, I had to pay for it, and on the third day it became free again. The friendliness of the personnel would also vary substantially, from receptionists that would ignore you, to others that would know what they were doing, to the very nice and helpful concierge and cleaning ladies. The room was cozy, modern looking style and comfortable. It was also clean and since I was in the 14th floor, I had a nice view of the river nearby the hotel. The bed was quite comfortable as well, and I slept very well in the various nights that I spent there. The hotel has some good restaurants where one can relax on its own or have business meetings, which are not affected by the usually noisy and hectic lobby. The hotel is situated at a walking distance from the Sha-Tin MTR station (the subway station in Hong Kong), but it will take you almost one hour to get to central Hong Kong, so if you want to be close to downtown this should not be an option. Overall, it is a good option to sleepover, but honestly, I was not overly convinced about the hotel and most likely the next time I go to Hong Kong I will stay elsewhere. The location and particularly the fuzzy rules and behavior of the staff does not seem to correspond to an hotel of such category.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Booked deluxe room, but got a dirty bathroom”", "Author": "Muijui", "ReviewID": "UR125114286", "Content": "Travel all the way from England with 2 children, would expected a clean room, but the carpet was filthy, bathroom floor had stains, and the bathtub had previous hairs in it, went down and complain and want to change room, instead I got a cleaner to rinse the hairs away with just water, and the floor I ended up clean it myself. My room didn't get mineral water everyday or slippers as my sister room did? Why is it because I complained? My daughter age 10 was terrified because of the dirt that she couldnt sleep, and keep saying I want to go home, I just have to say I will have to consider if I want to stay here ever again.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Perth", "Title": "“\"Just checking if everything's ok...\"”", "Author": "Lelanderer", "ReviewID": "UR124945208", "Content": "Checking in took a very long time but it's understandable in this kind of hotel. There is virtually nothing around the hotel. I spent the most of Feb 13 looking around for cards and flowers for my wife for valentine's day and couldn't find any. Concierge counter was always empty and it took me a few days to realize it was a concierge counter (bigger sign?) Queenie at the desk was helpful and drew me train maps and mall directories but the places to get flowers and cards were too far away I couldn't be bothered. She called us everyday to make sure we were ok and thank us for choosing their hotel... Problem is that the calls were around noon, I was sleeping and had a do-not-disturb sign on the door - the housekeeping staff could've communicated with the front desk. Nice touch but slightly excessive... ;)", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brighton", "Title": "“Clean, modern and pleasant.”", "Author": "BobBrighton_9", "ReviewID": "UR124788249", "Content": "Stayed here for a couple of nights. Its a very large hotel, but the receptionist was friendly and helpful, and the room was a good size, and the bed comfortable with those lovely crisp sheets. Tea and coffee, complimentary bottled water, and a mini bar were there, and of course a safe. (no extra charge) The bathroom was a good size and toileteries were provided. The loo even had a blue flush. We had views over the river from the front. It was a bit of a walk to the underground station, but the hotel provided complimentary mini-buses every 20 minutes. There was also a mini bus to its sister hotels, so you could get to kowloon on that for free. We got a one day (24 hour from time of issue) travel pass on the trains which cost $55, and found that very useful. When we came back late by train, a taxi was only $22 HKdollars (about £2) on its meter to the hotel. We did not use any ot the hotels facilities so cannot comment on those. All in all a good stay and would certainly stay again.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Auckland, NZ", "Title": "“Regal? I don't think so!”", "Author": "tracenjimmy", "ReviewID": "UR124466190", "Content": "Why any one would stay here I do not know. I unfortunately had no choice as this is where my company has decided to keep us in Hong Kong. The rooms are old and need of renovations. The last renovations seem as though they have just given everything a paint over. The bath is dirty and mouldy and the phones are terrible, I could not have a conversation with family as there was a continuous delay. As mentioned before do not book an i-club floor room. Ugly decor , cold floors and no room. Hotel lobby staff do not have a good command of english, had to ask three people before I got an answer to my questions. Do not use the wi-fi as it constantly drops out and the connection is dial speed slow. If you are a chinese tour group from the mainland then this would be Regal indeed but for me this hotel needs some major work.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Not for people expecting western-style hotel standards!”", "Author": "Aussie-Banker", "ReviewID": "UR123971852", "Content": "Booked by my company for a business trip. The hotel staff are not great with English, it took forever to checkin. Do not EVER try the i-Club rooms on the top floor, they are so small and with terrible cold tile floors and revolting decor.. my room was painted electric pink. No bath, mouldy shower. I asked to change, the lower floor rooms were larger, but with 1970's decor, and seemed very dirty. The area of the hotel is boring, with little except street-stall type restaurants, no coffee shop/ Starbucks etc available near the hotel. There is a large mall a bus ride from the hotel, the only sense of civilisation near the hotel. Getting into the city is either a cramped bus ride, or an ordeal with many changes on the MTR. The hotel caters mainly for mainland Chinese tour groups who are very, very loud (at all times of the day and night). The cleaning staff in the hotel are also very loud, constantly screaming at each other down the hallways and slamming doors/ banging things in the room as they clean. Room service was of a poor quality, and internet was very expensive for that level of hotel. Overall, unless you are on a group tour from Chinese mainland, I would never recommend staying at this hotel. A very low quality hotel. But if you want cheap in Hong Kong, and are willing to put up with the location and the noise... good luck to you!", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mexico Beach, Florida", "Title": "“Interesting Team”", "Author": "Leo G", "ReviewID": "UR123788955", "Content": "I've come across staff of all different levels of English during my 3-day-2-night stay. The housekeepers were not very capable in handling my requests due to the language barrier. They have very impressive staff at the concierge and were very helpful with the street map and bell service even their English was limited. As a workaholic, not very often do I get approached by staff without getting defensive and feel like they are wasting my time. I am especially impressed by an amiable worker who came to me to do this review, her English was very fluent and was very good at keeping the conversation going in a relaxed atmosphere, which was surprising to see in 4-star hotels. Very diversified and interesting team with lots of potential they have at Regal Riverside.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“Comfortable stay away from the City”", "Author": "Kay629", "ReviewID": "UR123726336", "Content": "We stayed at the Regal Riverside hotel for 13 nights while my husband was attending a course at the Chinese University of Hong Kong. The website does not say much about the hotel but it turned out to be an excellent find for us. The hotel is 5 mins away from the HK MTR which is the lifeline of HK and the hotel provides shuttle service every 20 mins to and from the MTR station. The hotel has a few restaurants and a fairly large newly renovated swimming pool. We were put on the 11th floor corner room and had a beautiful view of the Shatin River. The 11th Floor was newly renovated with off-white interiors and was a fairly large room with amenities such as a small fridge, tea and coffee maker, large wardrobe etc. The staff at the reception were not very helpful which is why I did not rate the hotel a perfext 10! They were rude and we had to wait for almost an hour before we were checked- in into our room. The hotel is quite crowded and the reception desk is always busy. All in all, our long stay was very good. There are a few grocery stores and a Seven-Eleven down the road for any daily requirements. I would recommend this hotel to anyone who would like to live away from the humdrum of the HK city.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“A Renovated Room in a Great Hotel”", "Author": "thevagabondo", "ReviewID": "UR123686141", "Content": "We were visiting Hong Kong as part of a conference group. The price for our hotel per night was surprisingly cheap (for Hong Kong) so we were expecting cheap. Our renovated room was smallish but well designed. Very clean and very comfortable! The hotel has many, many rooms but the front desk are efficient and one of the 5 restaurants will suit any budget (local restaurants are good and just around the corner). An easy trip on the metro to anywhere in the city. What is not to like!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“excellent”", "Author": "VINCENT T", "ReviewID": "UR123242978", "Content": "The service has improved a lot comparing to before, all staff have a very positive work attitude. For in house guests, there should be free parking for visitors instead of having to pay $50 per hour or there we'll have to park in the streets. An advantage of the Regal iClub and Regal Rewards is to be able to check in individually. I hope the best for Regal Riverside Hotel.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bhilai, India", "Title": "“great view”", "Author": "sushil93", "ReviewID": "UR123237415", "Content": "lobby view is great and our period was during christmas month so decoration ith christmas tree was very scenic.rooms were scenic due to proximity of hotel with river.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Wenzhou, China", "Title": "“Value hotel”", "Author": "James T", "ReviewID": "UR123137136", "Content": "Good value for money. If you just need a good hotel to stay, willing to be a little out of the way then this hotel is for you. They have a shuttle service between the hotel and the MTR station however it starts and ends during peak hours. Internet fee and business center fee is expensive and feels like gouging however no pay no play keeps hotel stay more affordable. Travel agency in the lobby has great service. Highly recommend for China visa service.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Modest Hotel but Clean and Good Value”", "Author": "BrentTravel", "ReviewID": "UR123054484", "Content": "I stayed here because I did not want to pay high price for Central located hotel. Overall its a nice hotel and comfortable beds. Bathroom is a little small and a rain shower (vertical shower) would have been much better than standing in the bathtub to take a shower. I tried to rent a movie but could figure out how to do that - very unclear and not much selection. But overall a good pick if not paying more than $125US per night. Can take shuttle from HK aiport for $130 HK Dollars and it takes 40 mins..it was fast with no other stops. Go to Regal Riverside desk at HK airport to get shuttle.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A very rocky start”", "Author": "Lemonp", "ReviewID": "UR122878887", "Content": "For the past 5 years my wife and I had always stayed in Shatin every time we visited Hong Kong. We love the location since it is not too far away from all the activities and yet we get to enjoy the quiet and peaceful side of Hong Kong. At first we were very reluctant to book the regal riverside since their reviews from tripadvisor had been average and additionally we are regulars at the hotel across the river and were very pleased with their service but they did not have any rooms. At the beginning we were less than pleased with this hotel ,we had booked a room with a king size bed and a view facing the river, but when we arrived, the lady at the front desk told us they did not have any more rooms with king size bed and can only provide us with two single beds, but after searching for a few moments on her computer, she found us a room on the 15th floor. When we got to our room we noticed that our room was facing the garden and was not the river. We immediately went over to the business center and spoke with a lady over there and told her that when we booked online that we requested a room with a king size bed and a view fronting the river and what we got was a downgrade. She was very helpful and got us a room with both a king size bed and a view front the river in room 15001. The view was beautiful and we enjoyed the rest of our stay, we even book an extra night. A word to other travellers, this hotel has a lot to offer but you may have to check with the business center, such as : airport shuttles, which we took advantage of since it is free and save us close to 300 bucks HK dollars. We would consider coming back.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Very Poor service”", "Author": "rabselyong", "ReviewID": "UR122625109", "Content": "Check in and out took so so long, very small lobby. Buffet breakfast was lousy, not much choice, service staff very rude, never seen any smile or greeting from them at all. Took Very long to refill. Full of noisy group tourist. Avoid this hotel if u wanna hv a pleasant trip.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“A good place to stay in HK”", "Author": "volunteeringTrinidad", "ReviewID": "UR122444284", "Content": "We stayed here for 4 nights. Our room was incredibly small. The bed was literally attached to the wall under the window. On the plus side, we had a great view. There is a lovely promenade to walk on right across the street. You can walk along the river for miles. The buffet breakfast was good and included Western food. There is am Italian restaurant called Avanti in the lobby. The food was not great, and it is very pricey. I would never go back again. Head out the front doors and turn right and go to VI. This is a great Thai restaurant. Food and service is amazing! This restaurant is still attached to the Hotel, and you get a discount when you mention that you are staying at the Regal Riverside. The pool was closed when we stayed, so can't comment on it. Would stay here again", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Improving service at I Club floor”", "Author": "audrey-Tam", "ReviewID": "UR122403786", "Content": "Recent stay with family at Regal Riverside Hotel -I club lounge floor at 17/F. Personally found that their service provided was improved and the room was quite this time as located at 17 th floor. The lounge located at 15th floor and it may possibly causing a bit nosiy. The variety of food provided in the lounge increased and the room was clean & tidy. Overall, the quality of service was improved than before(stayed for 4-5 time between 2009-2010) Particular the room service and the service at reception.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Woodridge, Illinois", "Title": "“Ok hotel room but slightly outdated”", "Author": "yuchung5", "ReviewID": "UR122224844", "Content": "Ok location, 10 min walk to shopping mall and MTR station Room, especially bathroom, is slight outdated. breakfast was average in HK hotel, but sometimes were crowded. ok location. 10 min walk to new city plaza shopping mall and MTR Sha Tin station. internet is very expensive. a night.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Adequate”", "Author": "SHA001P", "ReviewID": "UR122132502", "Content": "The hotel is quite huge. Lobby quite overwhelming however the have a staff member directing guests to keep flow moving. We arrived and as we had booked the iClub we were usher to the 15th floor for check in. This was very nice and it was where buffet breakfast (great waffles) was served each day, as we had very small children this was a nice quiet place for breakfast the staff there were lovely we could also access free WiFi from this location. We found our room tired and in need of a make over however was clean. We found the beds hard so not conducive to a good nights sleep, luckily we were exhausted after our busy days, We love the view of the river, quite spectacular. We didn't use the shuttle as it wasn't convenient we also found it easier to use taxi as we had our pram. New Town Plaza was in walking distance (10 min) and quite a pleasant walk if you don't mind walking. This was an enormous shopping complex with plenty of food outlets, we enjoyed window shopping here. Whilst the hotel is quite a way out it is easy to access Kowloon, Hong Kong island and other tourist attractions easily by taxi and not too expensive...easiest way to travel if you have kiddies.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Hangzhou, China", "Title": "“No frills for mainlanders”", "Author": "Abramis", "ReviewID": "UR122024179", "Content": "I did spend one night here. Location was convinient regarding my agenda + places where I usually stay had inflated prices due to ongoing expo. The pros - Location in Sha Tin between central HK and mainland border - Hotel is walking distance away from Sha Tin centre, MTR station and main shopping centre - They have free shuttle bus The cons - Anemic room, it was really basic - Bad layout (e.g. practically no window thanks to beds blocking me moving) - I felt the hotel room was built mainland Chinese in mind (materials, easy cleaning etc.) - TV was up in the corner (I had to kill some time in my room and got my neck tired) - They had lot of mainland Chinese tourists (noisy, lack of proper behaviour) Giving Regal Riverside 2 stars is the best I can do. No frills & no second visit.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Nice renovated rooms, super river view, excellent italian pizza but a bit pricy.”", "Author": "YoteChusoipin", "ReviewID": "UR121968690", "Content": "Went there on a trip to a friend's funeral. I booked the smoking renovated 3 persons family room and another regular superior room. The view ws magnificent. Italian restaurant was great. What we paid was a bit pricy though, probably due to high season in hong kong. I wish there were more local restaurant close by, instead we had to walk 20 minutes to near by complex to get local Cantonese food. Beware, new rooms are smaller and pricier than old rooms.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "tehran", "Title": "“comfortable hotel”", "Author": "negin k", "ReviewID": "UR121753715", "Content": "The hotel is comfortable and clean but the room is small. It is far from the center and metro station but it has a free service every hour that takes you to the center of the city. The best way for traveling between airport and hotel is the bus NO 41 which takes you directly to the hotel and vice versa with just 23 hong kong dolar. You can take the same bus to go to big budah and the disney land although you should change the bus or take the metro. The breakfast is very good and the personnel are polite. Dont use the telephone, internet and the minibar, it is so expensive. At the reception you should pay 1000 Hong Kong Dollar, the time that I left the hotel they just turned me the 300 of it for 1 telephone call abroad, using internet for two hours and two bottle of water.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Quad rooms - Just the basic”", "Author": "ChooKF", "ReviewID": "UR121685614", "Content": "This is one of the few hotel in Hong Kong that have Quad rooms - room that can accomodate my family of 8 with young children and old parents. The 2 Quad rooms that we were given were basic - 4 beds - exactly as shown in the hotel room picture for quad room. Unfortunately, we were allocated in a \"smoking\" rooms and our view were the two schools beside the hotel. The power to the TV (and the power plugs) in both rooms shorted frequently and we are unable to watch TV or charged our portable devices at times. The toilet bowl (in both rooms) choked easily and we have to control or managed our flushing... The shuttle bus to the ShaTin MTR is very convenient and can be packed at times. Don't try to take the hotel shuttle to the Airport, Disneyland and other attractions. It cheaper to go by taxi and timing is more controllable. The restaurants and the shopping around the hotel and ShaTin MTR station is good. Branded goods and cheaper stuff are all here - just have to explore which plaza is for which kind of buy in the Plazas next to Shatin MTR. You can also buy your \"grocery\" from the neighbourhood (and 7-11) stores around the corner of the hotel. The few attractions near the Shartin MTR station is worth a visit (10000 Buddha Monastary and Heritage Museum) If you stay in this hotel, you have to factor in the travelling time (on Taxi or MTR) to all the attractions. There is no free WiFi or Internet access - in the rooms or the lobby.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“Could have spent more for better location hotel in Kowloon.”", "Author": "Wong3Sun", "ReviewID": "UR121623932", "Content": "After much time and money spent in traveling between the hotel and the places I visited in Kowloong and Hong Kong, I should have spent more to get a hotel near the central area. The location of the hotel is so inconvenience for people like me who like to go in and out few times within the same day. For people who like to have relaxation and fresh air during the stay, this hotel could be a good choice.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Austin, TX", "Title": "“I would not stay here again. Rude checkout staff, non-functioning heater during chilly December night.”", "Author": "playblast", "ReviewID": "UR121618818", "Content": "I selected this hotel based on Tripadvisor rating. The location is far from central Hong Kong, airport. Unlike the other member's review, the hotel is far away from the MRT station. You really have to walk more than 20 minutes at Sha Tin Wai MRT station. The hotel site says 5 minutes but not true. Most of all, the check out staff didn't know how to say \"thanks\" after I paid my bill during check out. Front desk is total chaos in the morning. My room had non-functioning heater during unusually cold December night. They charge HK$150 for VERY slow internet connection. I will not stay here again.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "richmond bc", "Title": "“Vacation”", "Author": "Sabra B", "ReviewID": "UR121531182", "Content": "We booked this on line through hoteltravel.com. Hotel is very clean,we were really impressed with the cleaniness. It is far from the airport costs about 200 hk dollars back and fourth. Staff is very polite, and helpful. All our needs were met. Close to the station and all buses systems. We felt pretty safe there. They offer a two for one breakfast we were glad we accepted. Excellent breakfast, you have to get there early otherwise they run out of things and don't replace it. Room size was good but beds are terriable. We first got two single bed rooms then we asked for kingsize non smoking but terriable beds. Very uncomfortable sleep.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "SG", "Title": "“First 4 star hotel in residential area”", "Author": "sammie_lee_kw", "ReviewID": "UR121490093", "Content": "It is very far from shatin mrt and shatin shopping malls but there free shuttle bus. Highly recommended is to try hotel cafe's food. Huge and luxurious room. Seems this hotel is popular with china tourists", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“A different perspecitve - the New Territories”", "Author": "Gulf-Neil", "ReviewID": "UR121179120", "Content": "The Regal Riverside Hotel in Shatin is one of a small group of hotels in Hong Kong. I lived near the hotel for many years & ate there regularly. I have also stayed in the hotel on several occasions. LOCATION: Hong Kong is divided into 3 areas; Hong Kong Island, Kowloon & the New Territories. Most tourists only visit Hong Kong Island &/or a small part of Kowloon. However, the New Territories is larger, quieter and greener. Shatin is the largest town in the New Territories & the hotel faces the Shing Mun river & is located in a suburban area. GETTING AROUND: The hotel has a shuttle bus to its other hotels around Hong Kong & the airport. A taxi costs about HK$15 (bus HK$4) to get to the town centre although you can walk it in 15 minutes. At Shatin town you have a wide range of parks, shopping & restaurants & the trains that will take you to the northern New Territories/ the border with mainland China (c20mins, HK$25) or south to Kowloon & Hong Kong Island (c10 - 30 mins, HK$5-25). RESTUARANTS: All the restaurants are of good quality & I think reasonably priced. My favourites are the Japanese restaurant (if you think you don’t like Japanese food, try this one, they have many dishes you just don’t see in the high street Japanese eating places). My other favourite is the bar on the ground floor. It comes alive at about 8pm but never gets crowded. If you step out of the hotel, there are small shops & eating places, a bowling alley & a ballroom dance club within a 2 minute walk. ROOMS & FACILITES; I found it true that some of the rooms need renovation but they are always clean. The front desk was happy to change my room when I had a complaint. The pool & gym are fine, not 5 star but clean & perfectly acceptable given the price.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Convenient, Clean and Friendly”", "Author": "fedelaney", "ReviewID": "UR121107908", "Content": "A perfectly serviceable hotel in Sha Tin very convenient if your business takes you to Fo Tan. The riverside promenade is safe and lovely for a morning run, stroll - or tai chi. An easy walk to the Sha Tin Wei station - but this is NOT in the heart of Hong Kong. Personally, I liked being in a more residential community and seeing the real hong Kong at work and play - taking their kids to the nursery school across the greenway or riding their bikes in the evening. The staff are very helpful - especially Frankie at the front desk and they will do anything for their guests. Just understand many of their guests are busloads of chinese tourists and you need to be flexible as a western visitor. I will return again in January.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hyderabad, India", "Title": "“Good for the price”", "Author": "ajsiromani", "ReviewID": "UR121010344", "Content": "A good property with spacious rooms but not well maintained. Quite far from the city. Have to take the shuttle and MTR. Trains can be quite crowded and uncomfortable at times. Staff were very unhelpful and quite rude at times.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good but far from central HK”", "Author": "hotelhopperlee", "ReviewID": "UR120932221", "Content": "I stayed here for 3 days with my fiance. The room is clean and cozy. We had a great view of the river across the street. The only downside is that it is far from central HK and breakfast options are limited.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“\"3 star - was more like a dirty youth hostel\"”", "Author": "Laura C", "ReviewID": "UR120745122", "Content": "We spent 4 days out of the 10 days in HK. We booked the hotel after seeing good reviews online however, we were very disappointed. We spent the first 45 mins waiting in a queue to check in with large lugguage and no one to help. Once we got to the check in desk - I speak catonese and was thorough appalled at the staff's manner - they were NOT helpful or friendly and nothing like what I would expected of a 3 star hotel. They did not tell us about the times for breakfast or show us where we could find the gym or swimming pool. All they did was give us took our credit card details, the electronic key cards and pointed us to the lift. Once in the rooms they are a nice size, however very dated. The bathroom suite was very old and we found hairs in the plug hole and noted that the wash basis had not been cleaned. It was absolutely appalling. We complained to reception and they offered for a cleaner to come up and clean the room. That night we also went to the skybar and drinks were a rip off price - we got 4 drinks and paid over $200 hong kong dollars for them! I ordered a manhatten cocktail and it was more like drinking off whiskey and ice. My sister ordered a glass of white wine and you could tell the white wine had been corked/ open bottle which noone has drunk for ages. The staff found it difficult to understand us when we ordered in english. Breakfast the next day - offered a lot of choice however, the food was often cold and staff were really unfriendly. We also used the internet connect which they charge at a daily rate and for each IP connection. The connection was very slow and very expensive. Do not go on the internet is my advise. Also went to the swimming pool, which they do have a lifeguard however, he was very unfriendly and did not understand the concept of a locker room, until I spoke catonese. By the end of day 4 we had had enough and decided to opt for another hotel. Do not be fooled by the low prices they are not worth it.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Doha", "Title": "“Reasonable..... for the price!!”", "Author": "Husain A", "ReviewID": "UR120703748", "Content": "Lets start with the positives :- 1. Really huge hotel with over 1000 rooms. Rooms are spacious for Hongkong standards (atleast the one i got was big enough). 2. Good transport system of the hotel. Provide shuttle to the airport (though they charge for it), Disneyland, Downtown Kowloon & Shatin MTR station. 3. A good number of restaurants within the hotel premises offering a wide range of delicacies. 4. Staff was reasonable. Room service was fine. Drawbacks :- 1. Really far from the city (Kowloon & Hongkong island). 2. Wifi is expensive. 3. Can improve on the buffet breakfast. 4. Need to control the swimming pool temperature (i had chills down my spine due to the ice cold water).", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Recommand a good hotel in Hong Kong , Chian”", "Author": "Kenneth C", "ReviewID": "UR120476773", "Content": "Good location , easy to arrive everywhere in Hong Kong . Good communication and front desk service . Good room facilities .", "Date": "November 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Some kind staff, most surley, poor food & service”", "Author": "Anthrotravel", "ReviewID": "UR120309623", "Content": "Do not be fooled by low pre-booking rates. They do not compensate for cold eggs, chilly breakfast meats, dirty coffee cups, and grouchy, overworked staff. Do not suppose that your pre-booked room might be changed or refunded. Do not try to share your internet connection with colleagues with whom you work (you will be cut from the Internet). Do not try to use the phone from the desk (it won't reach). Do not expect the bell staff to do anything other than pick their teeth when you arrive laden with luggage at midnight to find that your booking has vanished and all hotels are full. It is hard to find a decent hotel in Hong Kong, and the New Territories are indeed a pleasant alternative to Central or Kowloon. We can hope that smaller boutiques with better service will replace poorly managed behemoths like this.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Beijing", "Title": "“More relaxing than Hong Kong”", "Author": "Frank P", "ReviewID": "UR120072884", "Content": "The Regal Riverside looks like any other hotel - big and lots of facilities; but it has the great advantage of being situated on a river with a quite amazing park on the far bank. The hotel is about 45 minutes by bus (the very convenient, and cheap, 81C from just outside the hotel costs about 35 eurocents to get to the centre of Kowloon for the Star ferry to Hong Kong island). Restaurants in the hotel are \"western\", but outside we ate in (or rather, outside) chinese restaurants catering foir locals at a fraction of the price. The hotel offers all normal, Western facilities - the annoying exception, charges for WiFi internet were overcome by walking over the river to the park to use free WiFi courtesy of the HK government! This was a great place for us to stay for the three nights in Hong Kong - it also had a free shuttle bus to and from the airport, providing you weren't flying too early!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Bad service”", "Author": "GT T", "ReviewID": "UR119898805", "Content": "I visited the hong kong on the 24th Oct with my 2 sisters and had already pre-booked a room with 3 beds. We were only staying there for 2 nights. I decided to try this hotel as I was told that the hotel was new. When I arrived to check in I had to wait almost 30mins to check in. They did not bother to open a new desk to serve there customers. we had to pay $500 deposit and should get it back when we check out. Ok after checking in we waited to see if anyone was going to take our luggage to our rooms but in the end no one did. We later went to our rooms and already we noticed some sort of stain on the duvet. Not a good start really. As we came from the Uk we were jet lagged so at night we decided to order room service where we were told that we could pay straight away or have it taken for deposit. The room service for the first night was ok. The second night we decided to order room service again and again paid for the food straight away and even gave the guy a tip! We checked out in the morning and again we had to wait even though it was 6am. At the check out the woman was ok except we were given like $300 instead of $500. They decided to take out the money from the 2nd food room service even though I had paid for it already and gave the guy a tip. We told them we had an early flight so need to live asap. It took them a good 20 mins to find the order which my sister signed for. I told them that we had paid for it already. The manager then decided to look for the guy who gave us our food. In the end the manager did manager to find the guy and I was told that the guy does NOT RECALL us paying him. In the end we were told to leave our credit card details where they could charge us if it was found we didnt pay. I told them no and in the end after much arguing they decided to give us our $500 back. They made it seem as though we were cheap for not paying food. The money was not the problem but a matter of principle. Also to mention, the hotel was pretty far to the main shopping centre. Had to take a taxi to main MTR sha tin station which was pretty troublesome as there were not many taxis around.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "wooloomooloo", "Title": "“The good, the bad, and the ugly”", "Author": "dr_iggy", "ReviewID": "UR119776893", "Content": "The good: roomy rooms; great food in the hotel restaurants; lots of green spaces around the hotel. The bad: out in the boondocks, in what appears to be a rundown (though not unsafe) area; LOTS of tour groups, so expect to do a bit of waiting and queuing; renovations. The ugly: a definite institutional feel to an uninspiring, communist-style building; shape of building means that if you are facing the pool, you will hear it; male staff at the checkout desk extremely surly and unfriendly, leaving a poor lasting impression.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "BANGALORE", "Title": "“Very good Hotel”", "Author": "kmupadhya", "ReviewID": "UR119707753", "Content": "Rooms are spacious, Bathrooms are good looking and well maintained, break fast is fentastic.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“Good stay, inconvenient location!”", "Author": "Caris25", "ReviewID": "UR119480819", "Content": "The hotel a modern building located in Shatin on the bank of a river, has a large amount of rooms and caters mainly to Chinese Groups. I took the complimentary hotel shuttle from the airport to the hotel and vice versa. As a business traveler I did not realize until I got to the hotel as to how far it was from Central where most of my business meetings took place (two MTR train changes that took 45 minutes to one hour). The room was renovated with a comfortable mattress and linen, excellent shower pressure, blackout curtains and beautiful views over the river and the public pool on the opposite bank. A small selection of TV stations offered. Service was mediocre. Excellent value for money for a Hong Kong Hotel!", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kempton Park, South Africa", "Title": "“Good family vacation at Regal Riverside Hotel”", "Author": "Andre-Antoinette", "ReviewID": "UR119217591", "Content": "We stayed from 4-7 October 2011 at Regal Riverside Hotel and had a good family vacation. The hotel was good and we enjoyed the swimming pool and the free shuttle bus to the New Town Plaza mall. We like to thank the manager of the hotel Mr. Josef Halbherr for refering our booking to Mr Vincent Chiang who on his part went out of his way to confirm our hotel stay at the last minute - a real gem. Another thank you is to Mr James Ken who really tried his best to give us a room that satisfied us - as we were celebrating our anniversary the 3 single bed room did not please us and he really went out of his way to try and help us, as the hotel was quite full. He is a good ambassador for your hotel. If you are willing to pay a bit more I would suggest the Regal iclub rooms on the higher floors. We only had a quick look but will next time definately book them if we can get a special rate.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We enjoyed our short trip in Regal!”", "Author": "Travelcouple201", "ReviewID": "UR118967306", "Content": "We booked the last mintues deal in September for 2 nights. We decided to treat ourselves and booked the iClub room. We took the free shuttle from airport to hotel. As soon as we arrived the hotel and saw the queue, we thought we had made the right decision. We went up to the 15/F directly to check in. It was a nice VIP area and the girls were friendly and nice. We got a room on 11/F immediately though we arrived at 11am. The room is clean and hugh (compare to those hotels rooms in Kowloon side)! After we sorted ourselves out, we took the free shuttle to Shatin and did a bit of sightseeing. Since we have been travelling, we had an early night and we both had a very good sleep. The next morning we had breakfast in the VIP lounge. The breakfast was good and sufficient for us in the morning. Since we had a late flight home, we asked for late check out. Amazingly we were given 6pm late check out! We were so delighted as we can still go out and enjoyed Hong Kong but did not have to worry about packing our stuff in a rush! Again, we were glad that we booked the iClub room for the stay!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Bargain price with free shuttle and internet!”", "Author": "Beautytraveller2011", "ReviewID": "UR118874064", "Content": "We booked the hotel room through their official website and got a bargain price. We also got free shuttle bus and free internet which saves us a lot of money. Checked into a spacious room on 10/F overlook the mountain. Nice room! We also went to the Chinese restaurant with the $50 dollar dining coupons and had a delicious meal there. Overall all staff in Regal are friendly, especially concierge, reception and the chinese restaurant! Thanks Regal and we will definitely come back on our next visit to Hong Kong!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Disappointing”", "Author": "Alles_19", "ReviewID": "UR118685328", "Content": "We stayed at Regal Riverside Hotel from 22 September 2011 to 25 September 2011. As I booked online, I was entitled to the free airport transfer from the airport to the hotel directly. Our flight got delayed and I missed the bus which I initially booked, which is at 10.50am. I went over to the hotel counter and was informed that I can take the next shuttle bus which is at 12.20pm. We didn't know where the shuttle bus is actually waiting at, almost missed the bus because we couldn't find it till we asked a staff at the Regal Airport Hotel and he told us that it is at the hotel lobby. Our trip to the hotel from the airport took about 30-40mins. First impression of the hotel was good as the lobby is quite spacious looking. At the front desk counter upon my check in, I was informed by Sylvia that the room which I booked is not available. (When i paid for my rooms online through the hotel reservations, I requested for a king size bed and a non-smoking room with early check in) Sylvia told me that all the rooms are fully booked and there are only twin size bed rooms available or if we want a king size bed, we are supposed to downgrade to a room that is very much smaller than the room I initially booked. After I insist that I do not want to downgrade to a smaller room, she then mentioned that there is another room with a king size bed and another single bed in the room as well, but the room is smaller than what I booked as well. I then told Sylvia that I requested and paid for this particular bedroom very much in advance and I shouldn't be facing this problem at all during my check-in and it is ridiculous for me to be downgraded. She then went to ask for help from another staff, Debbie. She then look through their system and told us that if we want our room, we have to wait for 40mins as the guests have just checked-out. I told her that this is not acceptable as well as I first of all requested for early check-in, If i got on to the 10.50am shuttle bus and arrived much earlier at the hotel, am I supposed to wait for hours for my room? I then requested to speak to their manager and the manager didn't apologize to their mistake and just told us to wait for 30-40mins for our room and he offered to let us wait at their i-club lounge. We went up to the lounge and he told us to help ourselves with drinks but we sat there for 30mins and none of the staffs came and asked what do we want to drink. Oh and not to forget, the guest that was queuing behind us during check-in, I overheard that his room was not available as well. Finally, we got our key card and went to our room. We got upgraded to the Regal I-Club room, the room is spacious and beautiful. The bed is big and comfortable. Our luggage took 1 hour to be delivered to our room. I had to call the front desk to ask where is my luggage and the concierge was rude as well. All these encounters leave me with a bad impression about this hotel. I believe that first impression really counts and I will not come back to this hotel ever again. That aside, the shuttle bus to the nearest MTR station (Shatin) comes every 20mins and there are public buses around the hotel to go to various parts of the city. There are also cha chan teng around and supermarket too. The hotel 24 hour restaurant, moon river, is affordable and serve decent food. Room service is efficient but there are no smiles from the staff. During my last night, I went to the front desk to ask about buses to go to the ferry terminal, I stood there for 10mins, shouted out a few excuse me to the staffs at the front desk and concierge, all of them just continue doing their own things and never bothered about us. One of the names we noticed is Kenneth. It was only until Debbie walked past us and asked how can she help us. I really don't understand where is the service of this hotel? There are so many hotels in Hong Kong and there are so many other hotels which may be better at the price which we are paying. So, I guess Regal Riverside Hotel, you need to improve on your customer service and maybe properly maintain your reservations system.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bromley, United Kingdom", "Title": "“Very clean hotel, big room, attentive staff”", "Author": "MrsP0508", "ReviewID": "UR118363046", "Content": "My husband and I have been to HK on a few occasions, and this time round we decided to stay at the Regal Riverside for the first time. It really did not disappoint! As we only went for the cheapest room (Superior), and have seen some pictures of some really tiny rooms at the hotel, we were a little apprehensive. But when we checked in, we got a very spacious room, with a comfy queen bed overlooking the hotel pool! It was a pleasant surprise :) There was a free shuttle van from the hotel, available every 20mins, taking you to either Tsim Sha Tsui or Shatin New Town Plaza (which was great for connections to the rest of Kowloon). The hotel also offered transfers to the airport for a fee, but you're best bet is probably getting on the A41 bus; $26 HKD or so (one way), approx 45mins max journey and the bus stops only about a few seconds walk from the hotel. Staff were very polite and helpful; i.e. I was unwell halfway through our holiday and had to call an ambulance from the hotel. Staff were very helpful and even rang our room later that evening to check that we were OK. Location of hotel was very good; only a short walk away (approx 20mins) to Shatin City One, which is basically a small district with shops and restaurants, also a laundrette that charged by weight (if like us, you didn't want to pay per sock you wanted to wash at the hotel). If you didn't get the free hotel shuttle, you can easily get the 86k buses or various other choices to Shatin New Town Plaza - buses came very regularly and was literally just outside the hotel. Costs approx 50p for a journey to the Plaza. We have read that you can walk from the hotel to the Plaza, which we think is very doable, but under the blistering mid-30c heat we didn't get a chance to this time round! Down points though: costs of using wifi, pool wasn't overly clean as there were always little branches or leaves in it when we went although the poolside staff did seem to try and clean it out daily, and expensive hotel restaurants (although the food quality was really good). With local amenities so good outside, it's better to venture out and eat local.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "new York", "Title": "“Hotel that needs improvement considering the rates”", "Author": "oxjohnnysangelxo", "ReviewID": "UR118102697", "Content": "Pros: Friendly and English speaking staff Easy transportation. You can take the public bus system which is right outside the hotel on the side with the Avanti Restaurant. fridge/hairdryer/toiletries complimentary bottled water every day AC worked well HUGE bed - even more than a king size Cons: Although we received some food vouchers for their restaurants it was not valid on the first evening which made no sense considering you get one for your final day (however it isn't applicable on breakfast and if check out is at Noon it wouldn't really make sense). When we asked the reception and then the manager if we could change the voucher for our final day to our first day so we can take advantage for dinner they said they could not due to the accounting dept. This just aggravated me and so we had dinner elsewhere. It's such a simple and small thing to do to welcome a guest and if it really is this case that the accounting team has more pull than a manager for something that the reception level should really be able to do then there are bigger problems. No free wifi or broadband. My husband and I are currently traveling extensively and this is the 15th hotel we've stayed at in a row - this is also the most expensive hotel (even more than London and Paris). For the amount of money we paid per night for our stay, it is an embarrassment to the hotel that there isn't complimentary internet services included in the rate. It's not even affordable and when we spoke to the manager he said that the hotel has been actively negotiating with the internet provider to offer better rates. We stayed over a weekend and checked out on a Monday - the construction on our final day was so LOUD. It felt like it was inside my head. There was no way to drown it out - you couldn't hold a conversation even while yelling. If we had stayed there during a weekday we would have had to listen to this every single day. That is COMPLETELY unacceptable. The pool was supposed to have been completed, however it was not and this was a big disappointment. The other thing to note is when you walk up the hotel you'll see \"SOHO Shatin\" if I remember correctly. We passed it twice not realizing that these hotels technically share the lobby and it says Regal Riverside on the other side. This was a bit annoying as it was evening and we had taken public transportation. The location is a bit far from the central area, however I found the public transit and the shuttle bus sufficient.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Boracay", "Title": "“Had a fantastic family HK vacation thanks to Regal Riverside.”", "Author": "Vegascomber", "ReviewID": "UR118090368", "Content": "I've booked our room directly online with Regal Riverside's website and got a great deal with their Deluxe Business Package for three days in late August. From the moment that they confirmed my reservation, communicating with the hotel was easy. Katie LUI the hotel's Guest Service Supervisor answered all my questions and requests promptly and she even adjusted the price of my package when I found out that the price dropped one week before my arrival. Our round trip airport transport were free for my family and wifi was complementary. I requested an extra bed for my child free of charge and when we arrived they upgraded us to a 2 queen size bed corner upper room with a fantastic view of the river. Too bad the airconditioning was not working properly so when they could not fix it they moved us up one floor with the same type of room but not the river view room. It was ok with us because the room was big and we loved the 42 inch lcd tv. and the mountain view. We loved the service and the pool was fantastic with two lifeguards on duty. We also like the location because there are a lot of open space around the hotel and many local restaurants. Going to Disneyland took us about one hour by MTR from the New Plaza Mall which is about 10 minutes via the hotel's shuttle bus. Oceanpark is also about one hour by bus which we got on from the bus stop down the street from the hotel. We enjoyed their buffet breakfast because it was basically complete and free for two of us. Finally on our last day we were given a late checkout because our flight was at night. Hopefully, I will get the same fantastic deal and good service from Regal Riverside when we go back to Hong Kong next time. Thank you Katie! Sincerely, Mr. Abriam", "Date": "September 13, 2011"}, {"Ratings": {"Location": "1", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good Hotel, location is problem”", "Author": "Jeganarayanan", "ReviewID": "UR118089377", "Content": "We stayed in the Regal Riverside Hotel during Mar 20 to Mar 23,2011 in a Standard room. The room is really big and having all the facilities. The location is really not bad, just opposite to the river and the view is very good. We took direct bus from the airport to the hotel, advisable to buy the bus card for unlimited travel. moving after 10 pm is not good since the area is very far from the main attractions.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dublin", "Title": "“Good for the price, depends if the location suits you”", "Author": "Alekito", "ReviewID": "UR118075495", "Content": "First the positive: Large rooms, good bathroom, good pool and quiet. Beside the river and near to most of what you want to see in Sha Tin. If that is what you want then it's ok for you. The main problem is that is it not near the metro - about a 15 min walk. Ok, that is not a huge issue. There is a shuttle bus but it's very 2 hours. Every hour would be much better. But the room rate is reasonable. I didn't have the breakfast. I stayed here and at the Hyatt in Sha Tin. The Hyatt was obviously better but it was almost twice the price. So for the money I was not unhappy with this hotel.", "Date": "September 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Markham, Canada", "Title": "“Our First Visit to Sha Tin, HOng Kong”", "Author": "piggylyew2", "ReviewID": "UR117953568", "Content": "On June 12, 2011, we flew for 15hrs from Toronto to HOng Kong. We booked online 30days in advance and got a special rate of $80 per night for 5 days for 2 rooms. We had family to visit in New Territory so we chose Sha Tin which was accessible by the hotel's shuttle bus to the train station. We often went to the Sunshine Plaza ( Ma Ah San) The hotel provided us with hotel restaurant coupons which we used twice for breakfast and also a few times at the Regal Terrace Cantonese cuisine. This coupon was $50 for dinner. We tried the Peking Duck and it was quite good, the hotel restaurants are a bit pricey but with the coupons, it worked out reasonable well after a long and tiring day of shopping in NIght Market ( Temple Street), Lady Market in Mong Kok, Sai Kung Harbour etc. The hotel was always busy and abuzz with activity and tourists checking in/out. When I needed more toiletry, I asked the cleaning lady pushing the cart outside my room for more soaps and she was always willing and friendly. Good service !", "Date": "September 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Average hotel, terrible location!”", "Author": "amandaclaydon", "ReviewID": "UR117945964", "Content": "Hotel facilities and rooms are ok - nice pool and middle of the road restaurants - location is terrible. Staff are ok.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "travelling", "Title": "“Inconvenient location...”", "Author": "W-Voyager-128", "ReviewID": "UR117927764", "Content": "You get what you pay for. Hotel is dated and the interior of rooms can use some renovation. However, room we got assigned was huge and comfortable. We encountered some friendly staff as well as rude staff so it is a hit or miss. Many big tourist groups from China are staying here so it is always very busy and noisy at the lobby area. At times, also very loud in the corridors. There is some renovation work going on outside the building and we could see workers just outside our window but that did not bother us. We just closed the curtains. The down side is the location, It is far away from any tourist activity and you have to take a (shuttle) bus to get to the station. From there it is easy enough to get public transportation but the journey to go to the city would easily take 1 hour. Bear this in mind if you decide to stay here. It is a long trek everyday and very inconvenient. Food is not up to standard so better to take your meals elsewhere. Breakfast had sufficient choice but quality of food is not good. We all had minor stomach problems after eating the breakfast. All in all, an OK hotel if you are on a budget and don’t mind the inconvenience of traveling.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Hertford", "Title": "“Reasonable, not fantastic.”", "Author": "nathanl1192", "ReviewID": "UR117542632", "Content": "I have stayed in this hotel on a number of occasions, and plan to again, however do not recommend it for the average traveller. When in Hong Kong, I need to travel daily to far North , right down to Hong Kong Island multiple times a day, so this is in a perfect location, but for those wanting to stay in the centre of everything, there are many better hotels, just a few train stops down the line. Despite this, this hotel is good value, and superb for those on a budget. It also does have a bus stop, directly outside the hotel, which can take you into Tsim Sha Tsui quickly and cheaply. Rooms are not spotless, however linen is usually fresh, and the bathroom is average. Stained carpets are in need of replacement, or just a good clean. Service is not too friendly, however is acceptable, and rooms are made up to a good standard daily. For those looking for a reasonable hotel for a good price, this is recommended, but I recommend looking for hotels around the Mong Kok area, which are also sometimes well priced, and more conveniently located.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Sydney", "Title": "“Hotel was O.K but you are Such a Long way from the City ......”", "Author": "F_B_SSydney", "ReviewID": "UR116599025", "Content": "On my first stay at the Regal Riverside hotel I must say at first sight the Hotel looks like a Bird's nest .....They are renovating the hotel and it is completely covered in bamboo and green mesh ....Not at all impressive .......The Hotel looks quite old and run down and certainly looks like it needs an Interior renovation as well ....Having previously stayed at the Regal Airport Hotel Which is in very good condition as a Comparison .................................The staff are quite friendly in the Hotel however this Hotel is a HUGE TREK from the middle of town and a MAJOR inconvenience if you are wanting to go into Town and do some shopping .....I also ordered a Pizza from Room Service and it was Stone cold ...To be fair they did send another one up but it was Very Poor by world standards in Taste and Flavor and I would not do that again .......", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Quezon City, Philippines", "Title": "“Great view at a great place for a great stay!”", "Author": "Cesar S", "ReviewID": "UR116596436", "Content": "I selected this hotel since it was one of the hotels conveniently located close to the Hong Kong Institute of Education and economical as well. The ride from the airport took about 40 minutes. The staff at the hotel smiled and greeted us upon entry and led us to the queue for the front desk. They were polite but firm when approaching customers who break in the line. English spoken by the front desk staff was sufficient to make a good transaction. The room given to us was located at the 17th floor and had 2 twin sized beds, 1 chair, 1 desk, 3-tiered drawers, side table, 1 flat screen tv, minibar with small refrigerator and a closet integrated in the wall. It was very small but the design of the room had mirrors and a big bay window that the room \"seemed\" spacious and bright. The tv was placed at the top corner of the room where you'd feel comfortable watching while laying on the bed or viewing it from one of the numerous mirrors. The bathroom was small but felt adequate (Asian-size). There's a shower enclosure (no bath tub) glass counters and a sink. The walls of the bathroom are made of glass to be able to see the great view from the window whether in or out of the bathroom. There are thick curtains, however, that can give you some privacy, although the only locks for the bathroom are the sliding glass door and the curtain's velcro-fastener. Best to consider the persons you'll be sharing the room with when staying in this type of room. The greatest thing about the room is the view window. We had a spectacular view of the river, the street below, part of the mountain side, the community swimming pool across the river and the floating restaurant. In the morning you wake up to the view of river where you may spot a sampan going by, row boat racers practicing, and tall buildings against a green mountain background. By nightfall, you'll see colorful lights along the riverbanks, streets and the establishments in the vicinity. Depending on your preference, you can use the screen or the heavy curtain to diffuse or totally block out the view. The hotel has a free shuttle service that can bring you to the MTR station in Sha Tin, the hospital and back at regular intervals. Just coordinate with the concierge for the schedule and bookings. Also, the hotel is located close to a bus stop. Across the street is a walking/jogging path and a separate bicycle path along the riverside that you can access by using the pedestrian underpass coming from the side entrance (near the bar). On the other side (near the cake shop) you can see small parks with lots of plants, flowers, small trees with benches or provisions to sit and rest. As you wall to the right, you'll see several restaurants selling live seafood, groceries, laundry shops, hardware stores and other establishments. Elevators were fast and quiet. Employees were very courteous and helpful. Wi-fi is available in the hotel but signal may vary depending on your location in the hotel. LAN connections are available in the rooms for a fee. On the whole I'd like to stay in this hotel again. My only concern is that it can be far from the some of the destinations tourists usually visit and may take some time and more money to reach places like Central, Causeway Bay, Tsim Sha Tsui, Admiralty, Stanley, Mong Kok, Disneyland, Tung Chung, etc.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Surrey", "Title": "“Average room, Good value for money....”", "Author": "BelgiumSurrey", "ReviewID": "UR116549115", "Content": "Having stayed here for the third times, I know the area very well. Especially with the eating places close to the hotel, we love it. The restaurants open till about midnight and 2 am in the morning, very needed for when you're suffering from jetlag. This time round the room facilities have been updated, so much better than previous stay. shame with the pool, as it was under renovation, so with the hot weather, I can only see the functioning public pools across the river in Shatin, which I suppose I can make use of if I was desperate.... In the day, u can stroll along the river, walk or run... very good, glad I done the walk, very relaxing. Thou, this time round, we found the hotel shuttle bus which takes u to the nearest train station, very helpful. Especially, with people like us, who uses it few times in a day, money saving hey! Will stay here again...... as it is very value for money, some nights of our stay only cost £53 a night. By the way, the bed was too too hard to sleep, so didn't sleep well at all here, the only downside.....", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“OK hotel...nothing too great about it...”", "Author": "bigford", "ReviewID": "UR116515727", "Content": "Regal Riverside is one of the budget hotels, first thing you should know about this hotel is that it is very very far off from the city. Second thing that you should note about this hotel is that it is very close to Shatin MTR station and Shatin shopping district. Rooms are not that great, and give you the feeling of a remote hide out of a fugitive who is on a run; there is little or no décor in the room, bed is made up of 2 big mattresses piled on top of each other. Day one I was quiet depressed, however by day two I started liking the simplicity of the rooms. It’s a budget hotel to the “T” no second thoughts about it, each room gives a kind of sordid view of the river which is always stationary and never flows, so it wont be wrong to say that the view is of a canal with arrested water. The service is OK, I did not have any bad experience, do not have too much expectations and you would feel satisfied. The TV is also paid, so if you want to see any channels you first need to pay. They have put jammers on each floor so you cannot use the wi-fi of any operator, you need to compulsorily buy the wi-fi service from the hotel. Please note they say they have a swimming pool, but when you ask them you would be told that its under renovation for almost a year now", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Excellent, but shame about the pool”", "Author": "Neil B", "ReviewID": "UR116208422", "Content": "Stayed at the iClub, and I was glad I paid the extra. Very pleasant and helpful staff at the small and quiet reception area/lounge on the 15th floor. Breakfast was fine for me, but others may feel the choice is limited. WiFi internet access was good in the lounge area, but poor signal in my room. Free access to a PC and printer was useful as I could print my boarding pass for my return flight. Unfortunately, the pool was closed, which was a big disappointment as I love to lounge by a pool with a drink and I had also promised to teach my friend to swim. I think some compensation should have been offered.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Happy and harmonious”", "Author": "ianmorrisontowncrier", "ReviewID": "UR115928226", "Content": "Slightly out of the way but with HK's excellent underground, it made getting to Shatin just outside of the main drag of Nathan Road. Very helpful and English speaking, the staff checked us in with lots of unextected extras. The breakfast was excellent with many different choices with world newspapers available for browsing at leisure. Very clean and well organised, the connecting shuttle bus got us to the local sites quickly without any fuss and was always there for the return trip. Externally, the hotel is being given an uplift which will make it an even better desitination which we would like to return to in the not so distant future.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Value for money if you are not after a 4*+”", "Author": "goodfoodfanOZ", "ReviewID": "UR115703825", "Content": "This is a very big hotel with more than 1000 rooms and package tours are constantly coming and going, making this hotel a very busy place. We decided to book a regal I-club room which made our stay a whole different story. Tucked away on one of the club floor levels, our stay was relaxing and comfortable and certainly value for money. The rooms are spacious with a very good oversized king size bed. Bathroom is small and outdated and if possible avoid a room with an interconnecting door as noise from the adjacent room clearly gets through. The club level offers a reasonable continental breakfast with a number of hot dishes and the Regal house red/white wine, beer, spirits and soft drinks and some hot/cold canapes for cocktail hour. Club level also includes free airport transfers (45 min from airport to hotel), 20% discount on a number of things incl. their restaurants and a 6.00 pm (!) late check-out. The Thai/Vietnamese restaurant is quite good and reasonably priced and with your 20% discount and a 100 HK$ voucher they give you on check-in you can have a nice meal with wine and beer for approx. 25.00 A$ per person. Staff is very friendly and efficient. The hotel itself is being renovated outside at the moment (obviously this has been going on for the last 2 months and is still not finished). So be aware that there is scaffolding all around and the pool is still closed.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“My Kids Love Regal Riverside!”", "Author": "ravismum", "ReviewID": "UR115421741", "Content": "It was my first time to book a hotel accommodation online and I was pleasantly amazed at how easy the online booking at Regal Hotel website was. However, just to make sure, I emailed and telephoned the Reservations Officer to know the inclusions (free shuttle service to nearby MTR station, from/to airport) and Ms. Katie Lui was very helpful. She also informed us to proceed to Counter B02 for the free shuttle service which we did. It was a breeze getting to Regal Airport Hotel where we waited for our ride. My 4-year-old daughter was able to enjoy the Kiddie Play Area during the wait. When we got to Regal Riverside, we went straight to Check-In where our reservation document was verified. We requested for an early check-in but since the room was still being prepared (it was around 11:30am), we were told to come back after an hour. We were already given the room card key jacket plus HK$400 worth of food vouchers which we can use in any of the 10 restaurants/bars of the hotel. This was an unexpected blessing. And so off we went to Avanti and ordered Four-Cheese Pizza which we found delightful. An hour later, we got our room at the 9th floor, with 2 single beds and 1 double bed and, of course, as we requested, a stunning view of the river. It was bigger than the hotels in Kowloon where we used to stay during our previous trips to Hong Kong. The bathroom was clean and well-supplied with fresh towels and toiletries. We had complimentary bottled drinking water and coffee/tea which were replenished daily plus a working safe, too, where we tucked away our passports and jewelry. We were also very happy with the Tours Desk personnel, Doris, who gave us options and valuable information on tour packages. We didn't have to go out to get our tickets for Ocean Park and Disneyland...they were available at the Tours Desk in the hotel lobby. This was really fantastic. We even got complimentary Disneyland umbrellas which we used during a rainy morning at Disneyland. The complimentary shuttle service was very much appreciated. We tried going to Sha Tin MTR station (which was about 3 minutes from the hotel) and walked just a bit to Grand Central Plaza to visit IKEA. Our first day was very enjoyable. Going to Kowloon was never a problem because there was a complimentary shuttle service that was bound to Regal Kowloon Hotel (about 40 minutes ride). The Moon River Restaurant became our family's favorite for late-night cold drinks (my daughter fell in love with ice-cold Ribena while the boys were overjoyed with the milk tea and soya milk) and breakfast. I particularly adored the turnip cakes and wonton noodle soup, shrimp flavor. We also tried a very interesting dessert, peaches with sago and grass jelly, which was worth the wait. The only problem we had was during our third day when we were so tired and we couldn't enter the room because the card keys didn't seem to work. My husband went down 3 times to the Concierge at the ground floor to report that we couldn't open the room. First, they sent someone from Housekeeping who also failed to open the room. Then we waited for the Manager to look into the door locking system himself. My kids and I were already seating on the carpet floor with our shopping bags and all as we waited. Then they called Engineering who took out the electronic lockset and repaired it on the spot. The whole process took more than an hour. It was a bit frustrating when all we wanted to do was to have an early night in preparation for our Disneyland tour the following day. Naturally, our room was not fixed while we were out, but Housekeeping replaced our towels and gave us our daily bottled water ration. Checking out (around 6am) was uneventful. We waited for the complimentary shuttle service going to the airport which arrived on the dot. We had a grand time staying at Sha Tin and I have already started recommending Regal Riverside to my friends and coworkers who are planning to visit Hong Kong this year. We will definitely stay again in this hotel when we return for our next Hong Kong family vacation.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "USA", "Title": "“Beautiful hotel, excellent location”", "Author": "Texas06", "ReviewID": "UR114837772", "Content": "We spent one night at this hotel and wished we had more time. Loved the location in Sha Tin across the river. There is a nice walkway along the river and we would have loved to walk alonng it if we had the time. Check in and out was fast and easy. We had a room on the 12th floor overlooking the river. The room was large, clean and well laid out. The bathroom was clean, a bit small but efficient. The hotel pool was closed since it is being refurbished. There are several restaurants. We ate at Avanti Pizzeria (a bit overpriced) and Moon River (a small cafe style restaurant). In the evening we enjoyed a drink at the Scene bar, sitting outside on the sofa looking at the river and street was a fun experience. From the airport you can take bus A41 which stops just across the street from the hotel. The hotel also offers a free shuttle to the Sha Tin metro station and to their other location in the Tsim Sha Tsui area which is very convenient. From there you can see the HK light show at night and enjoy the sites and shopping in the TST area. Will definitely go back to this hotel if we go to HK again.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rajkot, India", "Title": "“Wonderful Hotel, Wonderful Service”", "Author": "hitendraparmar", "ReviewID": "UR114823327", "Content": "Hotel Regal Riverside Hong Kong China It was a wonderful experience to stay in Hotel Regal Riverside at Hong Kong. We, i.e. my wife Sushila & my sons Jigar & Sagar, had stayed this hotel in Feb. 2011. We were in a group. When we reached at hotel, it was crowded because of the Chinese New Year festival. However, within 10-15 minutes we had received our room keys. We had been allotted room on 16th floor. We found the room was neat and clean. Everything like tooth brush, shampoo, toothpaste, towels, match box, shaving kits, tea & coffee maker, safe, cupboard with hangers, mineral waters bottles, Hair dryer, intercom, bathrobes, Napkins, Handkerchief, shoe cleaner, slipper, music system, T.V. etc. On ceiling there was mirror which gives a soothing & comfortable feeling. When we settled in the room after taking tea, I remembered to recharge my mobile. I found that my charger had round bar whereas the hotel room plug was square. I called the housekeeper and within few minutes an adopter was provided to us. I also made some ISD calls using the room phone. The room consist of large bath room, spacious bed comfortable for two with enough space to move around. The rate is also reasonable around 350 Hong Kong dollars. I marvelled at location of Hotel and our room in particular. It was on the road side in front of which a river was flowing. There was a five large swimming pools, 6 lanes roads. So, we have Views of River, roads, swimming pools, jogging tracks, cycle tracks, gardens (from our Balcony), and greenery every where. We used to seat in the window side at least 1 hour every day when we woke up taking stocks of all these beautiful scenes. Next day we locked the room and went for morning breakfast. While passing through the lobby we noticed a lady was replacing towels & other toiletries in other rooms. She smiled sweetly and wished good morning to us. We also reciprocated. The restaurant was on 3rd floor. We have been provided passes for breakfast. The restaurant was beautifully decorated. The food varieties were enormous. There were vegetarian and non-vegetarian items. They were nicely placed, neat, clean, appealing, and fresh. The waiter promptly and speedily picks up the used dishes so that no dirty plates remain at sight. I asked about vegetarian food dishes. She did not understand. However, she called other guy who understood my English and cared to explain and direct me to the various vegetarian dishes quite cheerfully and politely. There was a swimming pool adjacent to restaurant so we took our plates and enjoyed food seating in front of swimming pool. After breakfast, we returned to our room and noticed that the lady was attending our room. She came out and apologized saying also that the room would be ready within few minutes. When we entered the room all mess we did in hurry for breakfast was gone and the room was again nice and all the necessities were replaced and placed in proper way. Next day was Valentine day. Wow!!!, the decorations, lightening, the valentine tree etc. were fabulous. I also would like to mention largeness of Hotel. I think the hotel had more than 500 rooms, which includes budget room, suits, honeymoon suits, etc. It had also specious parking place. It is in proximity to Metro, Bus service, Market etc. We found no threat, insecurity of any kind during our stay. So, in nut cell our experience about Hotel Regal Riverside is happy because of: 1) Convenient Riverside location, peaceful and serene environment 2) Spacious room at reasonable rate. 3) Cleanness, neatness and prompt service with smile. 4) Quality of food and services are excellent. 5) Decoration done by Hotel 6) Availability of all miscellaneous services related sight seeing, money exchange, laundry, travels, ISD etc. 7) Helpful and friendly staff", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "perth, western australia", "Title": "“Solo Adventure”", "Author": "owls9383", "ReviewID": "UR114290083", "Content": "I'd like to be honest and state that this review is actually way overdue. Date selection above stopped at July /2010. but my stay was in February 2009. It was a fact as I've written and rave about the Hong Kong Heritage Museum in Shatin in my review of october 2009. It's up to Tripadvisor if they wish to print this review.. It was my first trip to Hong Kong and I was pleasantly picked up in a 8/10-seater van prepaid on the internet. Lovely 1/2 hour drive later, arrived at hotel. Can't see main entrance from the road as it's kind=of undercroft. However foyer was spacious, bright and welcoming. Checking in was friendly and quick. My room (with a small view of the river) was very spacious, clean and luckily near the stairs (i.e. less noise). Adjoining bathroom/toilet was also clean with little amenities provided. I was told by the concierge (whom I refer to quite a bit regarding sightseeing, etc) that a part of the hotel was being upgraded. Room service and housekeeping were faultless. Tried one of their buffet style dinner and just a little disappointed . Although not in TST area, transport was easy. Little feeder buses stops regularly just round the corner from the hotel and it'll bring you to the the MTR station. This station is also in the basement of a huge shopping centre with some brand label outlets and restaurants/fast food joints (must visit the top floor for a little 'sweets outlet' which served fantastic durian mousse of some sort). The Royal Park Hotel also in the same complex. Another 20min on the MTR and you're down in TST. Alternatively, take the MTR and venture out to the little suburbs. For those not in a hurry (like me), I walked from hotel, crossed bridge, walked alongside river and enjoy the lovely outdoor setting of the park (seniors doing taichi, others exercising). Very relaxing as early February's weather was perfect and cool. To explore the countryside from a good base, I will definitely return.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ahmedabad", "Title": "“Good Stay”", "Author": "bhsnice", "ReviewID": "UR114125786", "Content": "I stayed in this Hotel with my family (2 Adults & 1 Child) in a room allotted. Rooms are spacious & good for staying family of 3 in a room. We had breakfast in their coffee shop and there were no indian items served in break fast but upon asking one or 2 indian items were made available. Staff doesn't understand english and have to talk with the person from staff who knows english. Although I had little difficulty in language but still Overall Experience was good.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Suitable for conference delegates or those on package tours”", "Author": "Maysze", "ReviewID": "UR110522658", "Content": "I stayed at the regal riverside as I was attending a conference at the prince of wales hospital and this was the conference hotel. I was upgraded to the club floor, and when I checked in I asked about having breakfast on the club floor but was told my room rate did not include breakfast . I then paid the extra amount for breakfast and was told that there was a better spread on the third floor. On my second morning, it being Sunday, I decided I did not want to face the hordes of tourists on the third floor and wanted to use my iPad, the wifi in my room being very intermittent ( another downside) so I asked the receptionist if I could have my breakfast on the club floor but was told I had to have it on the third level. After I pointed out to her I was paying more for less of a spread and that there was absolutely no one there at the moment they merely looked away ,so I took that as consent and sat down to have my meal on the club floor. Another grouse is that having paid for the use of the wifi the reception was intermittentv,and to add insult to injury, when I logged in once on my iPhone I had to pay a second charge for that", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Disappointed”", "Author": "LadyGodiva1981", "ReviewID": "UR109818753", "Content": "I stayed at the hotel with my husband and two children. There were problems from the word go. We were given the wrong room, the replacement room was on a smoking floor, when we were finally allocated the 'correct' room, the toilet didn't flush properly, the shower had a fault with it, the deivce in the bath for bringing the plug up and down didn't work. On one particular ocassion when I was using the hair dryer, it suddenly made a loud BANG and it let off a big spark. I was so scared that I dropped the hair dryer straight away. I even had some scorch marks on the hand that I was using to hold the hair dryer with. My husband called reception to locate the manager in charge. Five minutes later and still no one showed, then he called again. Only then did the assistant manager come up with maintenance and a couple of other men. Although the assistant manager was very apologetic, all he offered was breakfast for the remainder of my stay (3 days). The hair dryer was immediately removed and a replacement was put in the bedroom. The gym is very outdated. There are lots of machines that have seen better days. Some of the cardio equipment have been spray painted to cover up the rust which has formed. The ceiling in the gym is what would be classed as a health and safety hazard in the UK. There were boards missing, water stains, pipes were exposed. The complimentary breakfast we were given was appalling. From the pancakes which were from a packet to the jaw numbing chewy and tough bacon. Do not pay extra for breakfast if you stay at this hotel. You can find cheaper, more authentic, freshly prepared food located close by. The only redeeming feature is the free shuttle bus which we took on a daily basis to get to Sha Tin MTR station. The shuttle bus from the airport is not free and we were quoted just over $200 for the four of us.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Great business facility”", "Author": "Elizabethr02", "ReviewID": "UR109153224", "Content": "I have stayed in hotels with a business floor before but they are not always well staffed or well equipped, they do it really well here in Hong Kong and especially this hotel. No hassles with connections the business lounge is always staffed, immaculately clean with food,snacks and drinks always available. I am accompanying my partner on a business trip and not feeling so guilty about leaving the office as there is a great environment to work. Not too much though I am off to check out the spa and if it as good as the business lounge I will give it 10 out of 10! Uk hotel chains please take note!", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "SINGAPORE", "Title": "“Nice Stay~”", "Author": "JOSEPHINEEEE", "ReviewID": "UR106880135", "Content": "Stayed at Regal Riverside hotel at Shatin for my 8days trip. We stayed on the 14th floor and the room was fantastic. The hotel is convenient for those who wish to visit shen zhen via MTR for a day or two. It just a few MTR stations away from Luo Wu Station. Hotel provides shuttle bus service to Shatin MTR and airport as well. Love the hotel, though is a little far from the city, but still a nice hotel facing a river. I experience a diff hk there...is a nice town~ there are a few malls and a huge ikea in Shatin. Price was reasonable for me, cost me abt SGD$100-$130 per night for 2pax. Dun mind gg back to the same hotel my next trip~~", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“A very enjoyable stay”", "Author": "Angie_BLondon", "ReviewID": "UR103088056", "Content": "I stayed at the Regal Riverside for two weeks in March, and had a very enjoyable stay. I stayed in one of the iclub rooms on the 13th floor, and was able to make use of complimentary wi-fi, which was great as I was staying on business and needed to be available by e.mail, as well as free use of the fitness centre, complimentary drinks every evening, and discounts in all of the hotel restaurants (more on them later). A complimentary shuttle trip from the airport got the visit off to a very good start, although I was less impressed by the welcome from the staff in the main reception on the ground floor. I didn't feel that they were interested in customer service at all, and while I appreciate that they were very busy when I arrived, the attitude seemed to be the same throughout my stay, whether they were busy or not. Fortunately I was directed to the 15th floor for the iclub check-in, and the staff there were lovely - very friendly and helpful. The room was very big, recently decorated in light colours, and the bed was extemely comfortable. I have only two complaints about the room: firstly the fridge didn't work, so if I had been tempted to use the mini bar, the drinks were all warm, and secondly I couldn't find a way to switch off the light in the wardrobe at night without switching the master switch by the bedroom door off, meaning that the bedside lights were inactivated, and so as a consequence I had to sleep for two weeks with the light on. Fortunately it didn't give out enough light to disturb my sleep, but it was still a bit annoying. The bathroom was adequate, could have done with some redecoration to take it up to the standard of the rest of the room. Air-conditioning worked well, I was happy with the temperature of the room. The iclub breakfast was good, although there was not much variety, which was noticeable after two weeks. As for the other restaurants, they were reasonably priced, particularly the Moon River restaurant, where you could eat dishes such as Singapore laksa with seafood for just 35HKD! I particularly enjoyed the food at Vi (a Thai/vietnamese restaurant), but the service was not that great, whereas the service was excellent in L'eau and the Avanti restaurants, but the food wasn't so good. I didn't go into the main bar, as I was travelling alone, but it was quite quiet, from what I could see, apart from on the last coupleof days when it livened up a bit. The shuttle bus to the metro wasn't a good option for me - it didn't start running until 11am on Sundays, and finished at around 7.30 every day, which is nowhere near late enough - but the walk to the metro station is only 15 minutes or so, and the route felt quite safe, even after 11pm, travelling alone. The journey to Hong Kong Island or Tsim Sha Tsui was about 40 minutes in total - living in London I can't complain about a 40 minute journey really, and it was ideal for work at the nearby hospital. The nearby shopping centre (New Town Plaza) is huge, and it is also very easy to get to the lovely fishing village of Sai Kung by bus, and out to the national parks for some lovely walks. The fitness centre was very good - could do with turning the air-con up, but other than that, the reception staff were friendly, there were 5 treadmills and most of the weights and other equipment that you could want. The jacuzzi was far too hot (I couldn't get in) but the sauna was lovely (and empty most of the time!). It was a shame that the pool is shut until April, but I can understand that it may have been a bit cold to make it worth keeping an outdoor pool open during the winter. There were a couple of occasions when the other guests were very loud (I was woken up at 4am by someone very clearly drunk and making a racket), but during the week it was always quiet. Overall I think that the hotel is definitely worth 4 stars, and was good value for money. I would probably not stay in this hotel if I was in Hong Kong purely for sight-seeing, but if they could move it closer to Kowloon I would definitely return (although the location is probably what keeps the value so good).", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "singapore", "Title": "“nice hotel in Hong Kong”", "Author": "ssgill", "ReviewID": "UR103045121", "Content": "Even if this hotel is in Shatin it is actually closer to the airport and Disneyland. Also a free shuttle service is provided to this two locations. There is also a free shuttle service to the Regal Kowloon Hotel @ TST (Tsim Sha Tsui). It cost much less to stay here rather than in the city (Kowloon or Hong Kong) yet, we did not feel we were living far away from the city. With a group of 4, we could share taxi to harbor city witin 20 min. it cost us abt 90 HKD. Divide the fare with 4 people, that 20 to 25HKD per person; abt 3.50 to 4 Singapore dollars per person. Also there a lot of neighbourhood food places around the hotel. breakfast was deliciious here. MRT ride is a little tiring as you would have to make 2 to 3 train switches. Overall good value for money. Just make sure you get the room you asked for when doing the booking. i asked for a none-smoking but got assigned to a smoking floor :(", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Comfortable and met expectations”", "Author": "aussiefred", "ReviewID": "UR102842955", "Content": "We were given a room on the 17th floor (iclub floor I think). Room although not huge was very modern and with carefully placed mirrors making it seem larger. Bathroom was definitely a highlight. Very large double shower and plenty of space. Bed comfortable and TV in a great position mounted on wall. Service at the front desk efficient and friendly. Plenty of restaurants to choose from and prices are pretty much like Western hotels. The only thing you need to be aware of is that noise travels easily in the corridors and if people are arguing (had a few who did that), can hear every word until they get into their room.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Singapore", "Title": "“Poor Service and Even Poorer Facilities”", "Author": "PooPoo84", "ReviewID": "UR100775993", "Content": "When we checked in, the counter staff STEVE was very slow and was seemingly unhappy to serve us. To make it worse, he told us that our triple room was still being prepared and asked us to wait 30 mins at the lobby. Fortunately we did not listen to him and went straight to our room and found it ready to use. There were quite a few problems with the room. For instance, the toilet bowl was weak in flushing. There were quite a few stains on the bathtub, bedsheets. And the remote control for the tv was so weak that i have to literally stand next to the tv to change the tv channels. Only positive side about this hotel is the elderly bald manager in the lobby. He helped me to call the local tour agency as the bus to the airport was late. He could remember the number by heart and helped to contact them. Also, the location is somewhat faraway from the train station. It is best to take the free shuttle bus that comes every 15-20 mins.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“average hotel”", "Author": "ric78", "ReviewID": "UR99823481", "Content": "the hotel is quite average for the standard. the bathroom looks old and needs renovation. the room is gloomy and probably needs some redesign. the room TV was placed near the window and not in the centre of the room. everything seems werid", "Date": "March 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "1", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Hong Kong", "Title": "“The breakfast is good”", "Author": "Ivanng2011", "ReviewID": "UR99610426", "Content": "the breakfast is good, the location is not next to the main station but the distance is acceptable", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Great room and views out of Kowloon”", "Author": "LondonHigg", "ReviewID": "UR98473652", "Content": "My wife and I stayed during Chinese New Year and chose Regal mainly on price. We were happy taking MTR into town each day and liked the quietness of Sha Tin. We were given a room upgrade and enjoyed the use of the gym and room service. Decor was modern and service high quality. If you are a runner the river towpath was awash with exercising locals. Do not be put off by how far the Regal is away from town, using MTR have the traveling fun and the money saved on accommodation got spent on entertainment.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Go to Hong Kong but avoid the crowds in this good Hotel.”", "Author": "Mart2011", "ReviewID": "UR98380226", "Content": "For the price concious traveller this hotel is a good bet. Very comfortable large rooms, in a quiet location. Lots of local walks nearby, without the crowds. Get to know the bus stops outside the hotel, they can whisk you into kowloon, or the island quickly and cheaply. The Moon River restaurant is another opportunity to keep it cheap, its open 24 hours a day, and offers very good value breakfasts and main meals. The only downside was the high price for internet access, hopefully they will fix this.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Shanghai", "Title": "“Once of the worse hotel ever stayed”", "Author": "Alex3004", "ReviewID": "UR97069499", "Content": "Stay in this hotel just because my company book this every time. And every time is getting worse and worse))) last time stayed in February. Starting from front desk - people are not nice at all. Even when there is nobody in the que - they ask to wait in the que even if you have crazy urgent questions (maybe im dying or need urgent help)))) It was crazy cold in the room. After asking warming system - they bring old, badly working heating machine, which sound is like airpline's engine))) There is ony 1 plug in the room for electricity - so if you have more then 1 mobile device 0 charge this before you come))) Price - supposed to be 3,5 hotel normal price) but if you take Internet (I always thought it is normal)) and breakfast - automatically it double your price) And this is not all - you can have a lot of surprises in your bill after checking out) Internet connection - IS HORRIBLE))) it was so big probem to get second connection in room. Staff spent 1,5 hours to do it. And finally 1 computer worked ok. Another - HORRIBLE) and for 1 computer you pay 180 HKD per day))))) If speaking about pluses - creative rooms, not so bad ocation if you travel often to Shenzhen, friendly staff, not bad breakfast.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Pompeii, Italy", "Title": "“An excellent hotel out of the center of the city”", "Author": "ilias34", "ReviewID": "UR95549539", "Content": "The hotel itself is modern and excellent. 5-stars service. Take the iClub rooms, which are much better than the normal ones, and not very expensive. The doors of the toilets in the iClub rooms are quite transparent. A good stay, and the staff are extremely nice and professional. It's in Shatin, so 20 minutes far from the center of the town.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Montr/eal", "Title": "“DOCOMO INTERNET IS TOO BAD”", "Author": "IsmaelM", "ReviewID": "UR93854266", "Content": "I got this hotel for the quality of the Internet in Hong Kong. I was staying in China for the week and I was getting some speed problem at night. But this Hotel Internet is worst than any Internet you could find in your life. Even worst than my EVDO mobile phone Internet in Canada in 2004. Also, the shower water could not get out of the shower so it was filling the bath really fast. I called DOCOMO Internet to get some help, they reset the bandwith but I never got any results. I am still staying at this hotel and I may ask for refund. But I am stuck since there is no more hotel in Hong Kong.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Helped out in a jam”", "Author": "radicalseven", "ReviewID": "UR92715250", "Content": "Some really good people here who were helpful when we hadcto stay here because my daughter came down with severe food poisoning after the flight from Sydney and is hospital nearby. Food in the restaurants is average and not welcoming to a solo westerner, but the management team couldn't have been more sympathetic", "Date": "January 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“A massive disappointment”", "Author": "Ms_C24", "ReviewID": "UR91918887", "Content": "I stayed at this hotel for the first four days of my trip to Hong Kong with my friend. I was not happy with the hotel at all and doubt I will stay here again. I booked a superior twin room but it was certainly not superior to me. I was fine with the location of the hotel, as the MTR is very convenient and cheap in Hong Kong (just get an Octopus card). Likes - Large spacious room and comfy bed - Complimentary toiletries and slippers - Large bathroom with bathtub - Free gym which was pretty well equipped - Free shuttle bus to the Shatin MTR station (New Town Shopping Plaza is attached to the station). If you do not want to wait around for the shuttle bus then you can take the bus (very frequent) or walk (around 10-15 minutes). - Nearby seafood restaurant was fantastic and cheap - Nearby small supermarket was great too Dislikes - Booked a twin room but they gave us a double bed instead. This is unacceptable as we booked months in advance. - Shuttle bus to Disneyland was not free but costs HK$ 140 (return) if I remember correctly - Our room and bathroom seemed quite dated (both rooms definitely needed refurbishing) although they were both clean. Towels were not great either, they were acceptable though. - The curtains were stained and would let in a lot of light in the morning. - The flat screen TV was slightly blurry. - Terrible service. Was kept waiting for ages for the simple requests that we made. I really did not expect this since most of the reviews here about the service are wonderful. Firstly, we waited ages for people to pick up the phone (I think they were screening our calls because we had called so many times about the heating problem before), waited almost an hour for the hotel engineer to come over to check our heater (after a 3 minute inspection he told us what we knew already, it was broken) and finally we waited around 40 minutes for the heater to be delivered. I accept that they are busy during the festive period and that our requests might take a little longer than normal to be looked into but they took ages! - The new temporary heater that they provided us with seemed really old. It would turn itself on and off, so in the end we had to switch it off as the noise was too much even though the room was really cold. - The shower was really weak. - Internet was not free. It was very expensive - Check in/ check out took a while as reception was always busy although this was acceptable as they did not keep us waiting too long. Also, my sister and brother stayed at this hotel at the same time as us (on the same floor too) but they were much luckier. They did not have any issues with the beds, heating or TV. Their room was also slightly bigger which does make a small difference in my opinion. They did not have to deal with housekeeping much (if ever) so they had no problems with their service. They said they would be more than happy to stay at this hotel again. What can I say? Maybe we were just extremely unlucky?", "Date": "January 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Hong Kong", "Title": "“Non Existent Service!”", "Author": "NotHappy005", "ReviewID": "UR91369973", "Content": "Firstly the hotel room rate was really expensive for this location. We were asked to switch rooms after the 3rd night as they could not give us a suite. I waited almost 2 hours for the other room to be ready!!! Called Reception many times but nobody wanted to help! There was a very long queue at the check out counter and other people were complaining of the long wait! I checked out and went to another hotel because of the lack of service. However, I want to say the treatments int the spa were absolutely out of this world!!!! When I tried to order Room Service on my 2nd day no one was picking up the phone!!! Waited at least an hour to order some food!", "Date": "January 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Luzon, Philippines", "Title": "“Convenience transportation and location...nearby shopping centre...”", "Author": "Fong_123", "ReviewID": "UR90516420", "Content": "Overall, everything in this hotel are good and fantastic....especially their club lounge....peaceful environment with nice view.....nice food and nice service.....staff are very nice and provides warm smile and greeting............", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ipoh, Malaysia", "Title": "“good :P”", "Author": "sammy855", "ReviewID": "UR90485919", "Content": "the rooms were spacious with comfy beds and clean bathrooms... the downside was that this hotel was really far from the city. fortunately, there were free shuttles to the nearest mtr station. we also enjoyed the local delicacy at nearby coffee shops/restaurant. the staffs were great as they were understanding enough to allow me to get refunds for the unused bus tickets to disneyland as my brother was so sick that we can't visit disneyland that day...", "Date": "December 22, 2010"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "India", "Title": "“Fantastic hote,l”", "Author": "Mjgomes", "ReviewID": "UR89630503", "Content": "Would recommend. Gfor a conference rooms good with all facilities for Indian groups hotel must provide Indian meals or allow to carry Indian chefs from India will have breakfast tomorrow and offer suggestions mention Gomes travel consultant best of luck rgdshu", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Taiwan", "Title": "“Totally fanstic”", "Author": "Oceanplanet", "ReviewID": "UR89058399", "Content": "Love everything here, staffs are nice to us. We are very surprised to stay here with many free amenities, Foe example free afternoon tea time, breakfast internet & magazine etc.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value for money”", "Author": "YeaHohoho", "ReviewID": "UR88996047", "Content": "Great value for money. Good choice of restaurants. Staff more than willing to help. Only negative is room walls are rather thin and so could hear neighboring rooms.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Jakarta", "Title": "“Satiafacfory”", "Author": "Irianto_gunawan", "ReviewID": "UR88921019", "Content": "Hotel is good. Room is clean. Fos is good. Staff are firiendly and helpful.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bangalore", "Title": "“Terrible”", "Author": "giji365", "ReviewID": "UR87566097", "Content": "I was totally upset with the quality of room, bathroom and beds offered. The room was not well cleaned. Stains were visible on the carpet. Toilet was very small and it was tough to stand and bath in the tub with out getting my knuckles hitting the wall multiple times. They service was good, as they rushed a plumber to the room when we complained about the toilet flush not working and when we asked for an iron box. The coridoors were stinking. Only good thing about this hotel was the breakfast. Dinner was horrible!", "Date": "November 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Manage your expectations!”", "Author": "IamWhoIam_SG", "ReviewID": "UR84745055", "Content": "I chose this hotel as it was close to the venue of the event I was attending and this also happened to be reasonably priced. To be very fair, I would say that you get what you pay for. While the room was in a good condition, good service was non-existent. One would have to put up with with limited & impatient front desk staff and noisy guests.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Phil", "Title": "“Awesome place to stay”", "Author": "ceeejaay", "ReviewID": "UR84385191", "Content": "We (6 of us) stayed here for 5 days for a tour .. staying in this hotel was nice and wonderful, although we check in at 2am, and the person at the front desk didnt bring us to our room, but we managed by ourselves.. the room was big, the food (breakfast) was marvelous, and we had a very good sleep.. although it was a little bit far from the central yet its easy to locate.. the personnel were accommodating, if ever i come back to HK, ill stay here again..", "Date": "October 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel clean quiet and full 24 hour service excellent value”", "Author": "TravelWorkAndPlay", "ReviewID": "UR82852063", "Content": "I stay here often when in Hong Kong, it's the most convenient if you have business / relatives in Sai Kung, easy bus ride from outside the hotel into Sai Kung centre or 20 min walk to the main railway station, the decent sized rooms are cleaned daily, with new towels daily, big screen t.v,s in all rooms, gripes...internet is quite expensive, 'complementary' does not mean free, mini bar is way too expensive, just take everything out and pop down to 7-11 (right next door to hotel) apart from that, usual freebies soap, shampoo, toothbrush...but no razor!. For those of you that like to exercise there's a great riverside patch stretching for miles and the fitness centre has all the usual facilities.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Shenzhen, China", "Title": "“Newly renovated room with good price”", "Author": "Cancyl", "ReviewID": "UR69829557", "Content": "10mins walking distance along the river to Shatin New Town plaza. It's actually nice to walk if not in the hot summer. Newly renovated room with modern urban look. I personally like it. We booked for twin room but we've got triple room instead. Check in was slow due to travel group was in front of us.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "", "Title": "“My stay was enjoyable.”", "Author": "travelingcebuano", "ReviewID": "UR68791144", "Content": "I enjoy booking at different hotels when I travel to HK, whether it is a business trip or a leisure trip. Of course, I try to travel with a budget, so looking for a hotel for on a smaller budget is always a challenge. I found this hotel to be worth the money spent. Though it may be extremely far from Kowloon or Central, the free shuttle service was quite efficient (just remember to bring a copy of the bus schedule). The breakfast had a good variety of choices and it was quite good. There were tons of guests, but the staff managed quite well with the huge numbers. I was very impressed with how friendly and courteous the staff were. I didn't get to enjoy the pool but it certainly looked inviting. The shopping areas and subway station were not as far, but it was a bit of a walk. There is a free shuttle to the train station, so best to ask the front desk. All in all, for the price I paid, I was satisfied with the Regal Riverside hotel.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Nagpur", "Title": "“Value For Money”", "Author": "AshNagpur", "ReviewID": "UR67147282", "Content": "One of the very good hotels at Hongkong......Great house keeping staff & always pleasant... Rooms are spacious....Far away from busy city.. Charge for internet is very high", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Asia", "Title": "“not that bad, but very far from everything and ridiculous internet-charges”", "Author": "EurasiaVoyager", "ReviewID": "UR65818598", "Content": "due to the Rugby-7's-tournament, which was not the purpose of my stay, all hotels in HKG were full this time or charged ridiculous rates, so i decided to stay in the new territories for the first time, cause rates were still acceptable there. the hotel is easy to reach by airport bus, but be on alert where to get off, as - believe it or not - there is no sign or name of the hotel on the building on the roadside-front. i almost missed the stop. I was upgraded to newly renovated executive floor (\"i-club\") which was nice of course, but maybe that was due to the fact there was construction work going on on the floor above my room from early til late. maybe that was the reason why they were so \"generous\". those executive-floor-rooms are decorated in modern \"minimalist\" style, which i liked, though I still puzzle about which features makes them actually so \"executive\". internet is ridiculously expensive at 180 HKG$ per 24hrs for the Wifi. they have a free shuttle to their downtown property \"Regal Kowloon\", which i made us of. if you intend to go to mainland China (and that was what I did) after ur stay in HKG, the location might be less inconvenient, as there is a free shuttle to the MTR station (about 1 km away from hotel), from where u r already half way to the Luohu checkpoint. all in all, the hotel is not bad, but who, except tour-groups \"bussed in\" from mainland China (and I am very sure this is their main guest clientel), would want to stay so far out of town. not me. next time i will stay in Kowloon or HKG Island again, certainly not at the new territories. and I will make sure my itinerary will not collide with any major event that causes the room-rates to skyrocket. sorry, no pics from this one, left my cam on an Indonesian domestic flight few weeks later, as already mentioned in my other reviews..... sob sob sob :-(", "Date": "May 30, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "everywhere", "Title": "“quiet and away from the busy city”", "Author": "hothotelbunny", "ReviewID": "UR58855449", "Content": "stayed at this hotel for approximately 9 months from june 2008 to march 2009. pros: -great housekeeping staff. always helpful and very pleasant. -rooms are clean and quite spacious by hong kong hotel standards. -easily accessible. hotel has shuttle bus to kowloon and hk island, as well as the mtr stations. -malls available within 10 minutes walking distance. -convenient stores aplenty just outside the hotel. cons: -quite a distance from the city (kowloon/hk island) -rooms on lower level are a little tired, though there are newly built rooms now on higher floors. i would recommend this to any long stayer in hk who is looking for a quiet stay, away from the busy city. if you're in hk for less than 7 days, try looking for other hotels in the city..", "Date": "March 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Saratoga", "Title": "“not again”", "Author": "chansy", "ReviewID": "UR58696774", "Content": "Selected this hotel because of some positive reviews at this site and also because of its location. Very convenient to get to from the airport on the A41. Reception service was adequate and in general solicitous. We liked the size of our upgraded room and that is about all we liked unfortunately considering our reservation was upgraded to a deluxe room. On entering our room there was always a musty or unpleasant smell only somewhat mitigated by the air conditioning. We endured unchanged sheets for at least 3 nights out of the 4. Did not pay attention the 2nd night. In all fairness I believe we had fresh towels daily. There was a refrigerator and complimentary tea/coffee bar and facility for internet and wireless. Unfortunately, the prices for the internet were exorbitant. The furnishings were well worn and the mattress spongy. The carpet in the room had seen better days, not to mention the stains in the carpet in the hallway. The total ambience of this hotel left much to be desired. It had the quality of a grand central station quite unsettling to say the least. We did not bother to check out any of the other facilities.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "uk", "Title": "“Basic, comfortable stay- quiet location”", "Author": "upg_uk", "ReviewID": "UR55480410", "Content": "We stayed at this hotel in Jan10 for 4 nights and had a comfortable stay with no problems at all. This hotel is located 20mins by MTR from main HKG in ShaTin area which is very quiet and on the river. They have basic and club rooms to suit every budget. Our rooms were basic but clean, hygienic and had a river view that we loved to wake up to. It is very easy to move around from this hotel using train on octpopus card that is accepted by trains, buses, ferries and even cafes. There is a shopping mall close by and has a variety of restaurants and cafes inc Mcdonald and Pizzahut. The staff was polite but always in a hurry since they were always busy and the language can be a barrier sometime. After the hustle and bustle of main HKG it was nice to come back to this hotel for a bit of peace and quiet and loved to walk by the river, This place is very safe day or night and would recommend to anyone. Its good value to money.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "England", "Title": "“Why choose this !?”", "Author": "Englandtravelgal", "ReviewID": "UR55320527", "Content": "This hotel was absolutly terrible, it smelled really bad we only booked rooms, no food, We went around the hotel and there was really cheap resteraunts around that we ate from. you could buy breakfast from a convenience store which was much cheaper then the hotel.The swimming pool is absolutly filthy, in our room we looked down at it and there was a brown swirly thing in it , we didn't even go down to the pool. We stayed out of the hotel as much as we can, the extra bed made my brother sick and he cried all night. It is very polluted here, humid hot and sweaty. The shopping is alright Nathen road is where we always went and somtimes went away from there. The hotel is very far from the shops, and the octopus passes are expensive because it cost so much to get away from the Hotel. Waiting at the bus stop was aghony, it smelled liked sweat and more worse SEWAGE absolutly terrible never want to go back !", "Date": "February 6, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice Hotel but far away...”", "Author": "Mmonkie", "ReviewID": "UR53161537", "Content": "Recently stayed at the Regal Riverside in Sha Tin, Kowloon, HK. twice in as many months. I have had the opportunity t stay at both the iClub rooms and the regular rooms. Personally I prefer the normal rooms. The new rooms are nice but have a love hoel feel with mirrors on the walls and even on the ceiling. That was ok but everything else was white, it gave the room a, IMO, a cold sterile uncomfortable feel. The normal rooms are massive, enough space for 2 beds and still space for a couch, coffee table and a chair. In terms of comfort, maybe 'cos its still new, the bed, pillows and comforter in the iCLUB rooms are great, very very comfy nights sleep. The downside. It is in Sha Tin which is in the middle of nowhere. Its HKD100 to get to Tsim Sha Tsui. The last hotel shuttle to the hotel leaves the city at 10;15pm. So you ahve to plan everything to fit the schedule. To tke the trains = 3 trains and a taxi ride from the city. Another downside is that the hotel caters to mainland chinese groups, unfortunately this makes the hotel very noisy. My pet peeve was the constant shouting in the hallways and the constant knocking on my door, they seem to always find the wrong rooms. If you dont mind the travel and its isolated location, the Regal Riverside is actually a nice comfy hotel. But if I was on a short trip where every minute s precious wuld choose a location closer to the city.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Midrand, South Africa", "Title": "“Great Startingpoint For our Hong Kong Holiday”", "Author": "GrAv3n", "ReviewID": "UR51039357", "Content": "We Stayed at the Regal for 5 Days. The Reseption were always great, They all spoke English well and was always availble to help and give direction. The rooms were of a good size and very clean, a bit old but still fine. The hotel is within walking distance of the New Town Plaza and Shatin MTR and Bus terminus. The busses and Taxi's Stopped infront of the Hotel and there is a shuttle service available. The Hotel is great value for money.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Vancouver", "Title": "“Great Value Hotel”", "Author": "nacnud88", "ReviewID": "UR49085840", "Content": "This HK hotel warrants a 4 star rating for service, facilities and a nice large well furnished room. Paid $600HK for room including Internet and return airport transfer. The MRT is about 15 minutes walk and breakfast is readily available nearby. Not as convenient as downtown Kowloon but the value and comfort of the hotel is unbeatable.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Newly design room”", "Author": "FAJAHK", "ReviewID": "UR38780852", "Content": "Good location, easy to access different transportation e.g. A41 airport bus, free shuttle bus service from hotel to Shatin Railway Station. 10 minutes walk to Sun Tin Wai Railway station. Surrounded by plenty local chinese food shop. Cyber feel newly design room with plenty mirrors and semi-see through glass enclosed toilet inside. Romantic for couple but inconvenience for visitor or tourmate", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Yardley, PA", "Title": "“nice but not first-rate”", "Author": "DrGoldin", "ReviewID": "UR30529421", "Content": "This is a perfectly acceptable hotel but not by any means one of the most comfortable in Hong Kong. Also, it's pretty far away from the main tourist areas, so unless you have reason to be in Shatin, this isn't the best location for you. The rooms are spacious and have everything you need (including a wired and wireless internet connection, available for HK$150 or 180 per night, respectively). Also a minibar with a small assortment of overpriced beers and soft drinks that's more or less replenished every day. The bed is new and quite comfortable (for those who like solid back support), but the furnishings are starting to age. The plumbing looks at least a decade old. Breakfast consists of a buffet that doesn't change from day to day and isn't really a bargain.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Awful smell and awful customer service”", "Author": "travelchick000", "ReviewID": "UR23934723", "Content": "I stayed at Regal Riverside with my family last year and had never been so happy to leave a hotel. The corridors smelt damp and musty, and the room furnishings were old. Furthermore, our kettle was so old that flecks of metallic paint were coming off the inside of it so we were drinking water contaminated with metal for 2 days, before we noticed the problem. We then reported this to the staff who were extremely unhelpful and did not offer any apologies or discounts or refunds. They simply changed the kettle and, although the night duty manager promised to talk to us personally about it, he/she never turned up even though we waited 2 hours for him/her. The only good things about this hotel were the king sized bed and the convenient location in New Territories (where we were visiting friends). However, if it's your first time in Hong Kong, this hotel is not centrally located at all and I'd recommend that you try one of the better hotels on Hong Kong island.", "Date": "January 27, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Canberra, Australia", "Title": "“A nice hotel with reasonable price”", "Author": "Dodo88", "ReviewID": "UR23651006", "Content": "It is a nice 4-star hotel with good price. The location is not very good and the hotel is a bit old. But the room is really big and comfortable, with large king size bed and bath tub. The service is also excellent. They upgraded us to deluxe room because we booked by Amex. There was not much view, as we expected, but the comfortable large bed and clean beddings were really a pleasant surprise.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Loved the room, hated the renovation”", "Author": "landsurveyor", "ReviewID": "UR22570333", "Content": "I was there with my wife and 18 mth infant on holiday and to visit relatives nearby. The room we got was fantastic. It was huge by HK standards, with tub and king sized bed. Foodwise, it is a 2 min walk to some diners and a mini market. Plenty of buses and cabs. Lovely river across the road for nighttime walkabouts. However, they were doing some renovations that was very noisy during daytime. Luckily I was out most of the day. Cost was about HK$700 per night.", "Date": "December 9, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "LONDON", "Title": "“no sleep”", "Author": "TILA_8", "ReviewID": "UR20560447", "Content": "We stayed for 10 days in this hotel. I was totally dissatisfied with it because of the building work that was going on, I did not get much sleep because of hammering and drilling. They did agree to change rooms, but it was not much better. I was not aware of the building works when I booked and If I knew there would be building works I would have definitely not stayed there! The only compensation we got was a bowl of fruits that had seen better days! The atitude of the front desk staff was very poor. Tim, UK", "Date": "October 2, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Auckland", "Title": "“Hotel Inspection”", "Author": "meowmel", "ReviewID": "UR18968164", "Content": "Location Shatin, Close to the Shatin Racecourse (Official Racecourse for the Olympic Equestrian Games) 10 min to stadium where Rugby 7’s are held and horseracing 20min to Kowloon by MTR (station within walking distance) HKD16 approx to Central Kowloon in a taxi Rooms Spacious basic furnishings, slightly dated décor but clean and tidy, shower over bath Superior and Premium: Difference between this and a superior is the level (Premium starts from the 10th floor) Deluxe: We saw the newly renovated ones (make sure you ask for this as only half the rooms have currently been done) Double/Double bedding , all River facing, Can get adjourning rooms in this grade only Triple and Quad Rooms: We saw a Quad room, it was huge would defiantly recommend for a family or group of friends travelling as all fixed bedding Family rooms: One double bed and one single Suite: Separate bedroom with king bed, ensuite plus other bathroom, lounge (with foldout sofa) No Disabled rooms available **Renovations till March 2009, done 9am-5pm, one floor buffer between guests and renovations** Comments/Recommendations This was a really nice property with almost a resort atmosphere. The lobby was really light with funky, modern furnishings. Wireless internet is available though-out the whole building, and they have 5 restaurants located at the property (2 Chinese, 1 Japanese, 1 Italian, and 1 seafood) and 2 bars.", "Date": "August 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Worthing, West SusseX", "Title": "“If you want to sleep past 8.30 am DO NOT GO HERE UNTIL END OF JAN 2009”", "Author": "Jacquesmeister", "ReviewID": "UR14756900", "Content": "This hotel is nice inside and pretty much quite posh to look at. If you'relooking for something near to the centre of Hong Kong then don't go here as you are really just in the middle of the suburb Shatin. The main disappointment was the noise we had to put up with. We were using this hotel as a stopover between UK and NZ and we couldn't sleep in any longer than 8.30am as there was ridiculously loud building work going on on top of the roof of the hotel. It was banging of hammers, pneumatic drills and shouting. The manager of the hotel said he had placed us as far away from the noise as possible, but it seemed that the hammers were banging directly above us. We were informed 3 days before our arrival to this hotel that the building work was going on so we had no time to change or get a refund. Nothing was offered to us in any form of compensation and I was thoroughly disappointed and VERY tired! NB the pool is also going to be closed until January 2009.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Milton Keynes, UK", "Title": "“Nice hotel, make sure that the location is suitable for you”", "Author": "SuppersReady", "ReviewID": "UR13486739", "Content": "This was the second time we've stayed at the Riverside as it's handy for visiting my wife's family in the New Territories. The hotel itself was pretty good and exceptional value compared to hotels in Kowloon. The room was immaculate and unexpectedly large. It's easy to get to from the airport (the A41 bus stops right outside) despite being out of the main tourist areas. However, if you are thinking about staying here there are two things that you need to consider. First, if you have a basic room only package then paying for other things at the hotel can work out quite expensive. The restaurants appeared comparatively pricy (especially for breakfast) and, as has been writen previously, they will charge you 70HKD for an hour's internet use in the hotel business centre. Secondly, the location. It's a 15 minute walk to the KCR station and the interconnected shopping plazas at Sha Tin. Although it's not an unpleasant walk, it does add significantly to the time taken to travel around. If you don't want to eat in the hotel there are many restaurants in the Sha Tin shopping malls and in the local area close by. However, unlike previous posters, I didn't see many English menus in the smaller, and better value, restaurants (these places are, quite rightly, geared to local customers so there is no reason why they should have them) and would have missed out on a lot of delicious food if not for the fact that my wife is Hong Kong Chinese. If time is tight in Hong Kong and you need to be closer to the main attractions then the Riverside mightn't be the best bet for you. However, if you enjoy being in an area that is probably more representative of typical Hong Kong life than Kowloon, then you could do much worse.", "Date": "February 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Excellent breakfast”", "Author": "mightymonkey", "ReviewID": "UR8449024", "Content": "We just spent two weeks at the Regal Riverside Hotel in Sha Tin, and were really impressed with it. First of all, I would recommend that you shop around for the best price. I found the best price on asiarooms, and that was about 45GBPounds per night for a twin, including buffet breakfast for two. The shuttle bus from the airport costs 110 HKDollars one way per person, and the bus leaves about once every 75 mins. If you miss a bus and have to wait around, that doesn't matter, because there are plenty of shops and restaurants at the airport, and then you walk over to the Regal Airport Hotel (2 mins) to wait for the bus in air-conditioned comfort there! Once on the bus, it takes about 40 mins to get to the hotel. I wondered about getting public transport to the hotel, but having taken the shuttle bus, I would recommend that others do the same. It's hassle-free and the airport express train plus a bus/taxi/KCR, would cost more or less the same, if not a bit more. So, for convenience and time, the bus would be the best bet. I emailed the hotel two days beforehand, and my name was put on a list at the Regal Hotels airport travel desk - very easy to find as soon as you come through the arrivals gate. Coming back to the airport was the same - we booked it a day before, and it was a stress-free journey from hotel to airport. Incidentally, the shuttle bus also stops at Disneyland between the airport and the hotel, so this would also be convenient, if you chose to go there. The hotel itself is fine. The room was cleaned everyday; notices were often put under the door to notify you of fire alarms, telephone checks, extreme weather warnings (in our case, a Level 8 Typhoon!) etc; we had a variety of TV channels, including about 4 English ones and all the usual that you would expect from a hotel. We didn't have a room overlooking the river, but that didn't bother us, because the view was pretty nice anyway, especially at night when all the lights appeared. During the day, there was a lot of cloud, but we could see a high school and green hills. There was a swimming pool, but we didn't use it although we had our swimming gear with us! It's surrounded by rooms, and a restaurant, so those less self-conscious might be happy to use it - I wasn't! We did have a massage, which was excellent, and just what we needed. An hour cost about 300HKD. The breakfast was excellent. It catered to all tastes. There was (prepare yourself) -fried rice, baked beans, ham, sausages, hash browns, spring rolls, samosas, miso soup, fresh made-to-order omelettes, toast, patisserie goods - mini croissants etc, juice, cereal, tea, coffee, broth/congee and extras, dim sum, fruit, salads.. and maybe more that I can't remember! I was highly impressed, as I wasn't sure what to expect beforehand. It's worth paying the extra for the breakfast, unless you are willing to wait until you get to New Town Plaza everyday and look for a cafe or bakery to get something. The New Town Plaza plays a major role in any stay at this hotel. It's just across the river, so a 10-15 min walk, or a 2 min bus ride. Jump on any bus which says 'Sha Tin Town Centre' or 'Sha Tin KCR Station'. Depending on which bus you hop on, it can cost 2.50-4 HKD. The smaller buses are cheaper, I paid 4 once on a fully air-conditioned double decker bus. If you take 299 or 284, it costs 3.10 - either pay by swiping an Octopus (travel) Card or with the exact change, which you throw into the metal money box. You can buy an Octopus card at the KCR station - the staff speak good English. We walked a few times - at night it was warm and breezy, so it was OK, but to be honest, we were so wiped out by the heat and humidity, we mostly took the bus. Mostly a bus would come along every minute or so. We barely had to wait at all. To get back to the hotel from the bus station on the ground level of NTP, take 284 or 299 and it's the second stop. I think 284 goes more often. The Plaza stays open until very late; getting in at 9pm or so, all the shops are still open and the restaurants are full - the place is still buzzing with people. The KCR station is very easy to find in the Plaza. In terms of food, if you can speak a bit of Chinese (I never heard them speak English, and the menus were all in Chinese with no pictures), there is an excellent and cheap restaurant about 20m away behind the hotel. A bowl of noodles costs 18 HKD after 2.30pm! Otherwise, go over to the NTP - plenty of restaurants with English menus. I wouldn't go for the hotel restaurants myself. Apart from the breakfast, I thought they were overpriced. For those on a real budget, there is a 7-11 just behind the hotel as well! We also went to Ocean Park, which was a huge tourist trap. There were soooooo many people there, and there were huge queues for everything - even just to get drinks, it totally put us off going to Disneyland. In Sha Tin we went to the Heritage Museum, which was a bit disappointing. It's a lovely building, but we spent less than an hour there. Maybe we weren't in the mood. The museum shop was really random: it felt and looked just like a UK gift shop, with nothing in it that was related to the museum itself. However, the tea rooms have a set menu everyday for 40 HKD, and we both agreed that it was probably the cleanest place we had eaten all fortnight! Despite my happiness with the hotel and its location, I wouldn't recommend it to people who are mainly going to be visiting Hong Kong Island, Kowloon etc. For us to get to Central it took about an hour (maybe a bit less) and so if you are planning on going to Lantau Island, with the KCR, ferry etc, there and back takes quite a chunk out of the day. Personally, I know that if I return to HKG I will stay at this hotel again, because it is well placed for going both north and south, it was clean,the breakfast was good and it was a decent price.", "Date": "August 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "england", "Title": "“lovely place to stay recommend it definatley!!”", "Author": "recommend-2NE1", "ReviewID": "UR6055049", "Content": "what a lovely place to stay we have a large room over looking the river which is beautiful at night as you can see the gorgeous lights, good room size as we had a double bed and to singles a lovely walk over the brigde to the kCR at night or you can save your legs and it would only cost a pound to the station for 4 ppl which come in handy if you was tied at the end of the day or you wanted to say your legs at the start of the day. the hotel has brillant facilities to use the gym lovely size a sauna a steam room a jacuzzi and a lovely swimming pool.. there is a light show at the harbour lookin over at hongkong island where they do lights from the island evrey night 8 oclock hongkong time. you can go to hongkong island for the day by ferrie or by under train and at hongkong island u must go up the peak lovely view and can either go by tram or bus... bus is really long so i would advise you not to take that and its really rocky aswel lol there is many more to do and i think a week and a half should do it..if you decide to book into this hotel make sure you book a room over looking the river!!!! recommend it to any 1 x x", "Date": "November 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Rochester, Michigan", "Title": "“Shatin hotel”", "Author": "sndaily", "ReviewID": "UR4774279", "Content": "Just returned from a 4 night stay in Hong Kong with our kids. We only booked a week before, so had a narrower choice of hotels - would have stayed at the Salisbury YMCA hotel. Decided to stay out in Shatin as we were planning a Sunday at the horse races anyway (only to find out at the track that kids under 18 are not allowed). The Royal Park was booked so we went with the Regal Riverside. The hotel was fine - a little older, but large connecting rooms overlooking the river with nice comfortable beds - king in one room and 2 twins next door. The hotel staff had upgraded us to the Regal floor and threw in a free bus tour of Hong Kong which we didn't think we'd use at first but came in very handy on a rainy Monday! The location wasn't perfect, but it was only a 5 minute walk across the river to the KCR station and an easy 15 - 20 minute journey to Tsim Sha Tsui. The A41 airport bus goes right to the hotel which was another plus. The hotel gave us a free shuttle back to the airport. Going in and out of the city became a little tiresome but for the price I couldn't find a similar quality hotel closer in (we paid HK$ 850 per room per night.", "Date": "March 30, 2006"}], "HotelInfo": {"Name": "Regal Riverside Hotel", "HotelURL": "/ShowUserReviews-g294217-d302178-Reviews-Regal_Riverside_Hotel-Hong_Kong.html", "Price": "$91 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">34-36 Tai Chung Kiu Road</span> | <span class=\"extended-address\">Sha Tin, New Territories</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "302178", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/92/76/9b/filename-regal-riverside.jpg"}}