{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“good all rounder”", "Author": "leyton2002", "ReviewID": "UR137483744", "Content": "Ive stayed at this hotel quite a few times in the last 5 years as recently as July 2012 and will be going again January 2013. The reason I stay here is that it is a good all rounder. The location is great in the heart of Wanchai, its opposite some good pubs/bars so if nightlife is your thing you couldn't stay in a better location. Despite this I have never been disturbed by noise from the street apart from when the rugby 7s is on which unless you are there for the rugby I advise you to avoid Hong Kong at this time. There are numerous convenience stores within a 2 minute walk also kebab, pizza, Thai and subway takeaways again less than 2 minutes walk away. At the end of the street (50 meters) there is a \"pacific coffee\" which is a starbucks style coffee shop which is great for morning coffee and croissant.Dont be put off by wanchais reputation as a red light district its hardly noticeable unless you go looking for it and very tame (look out for ladyboys outside 7/11 after midnight ) The rooms as in most of Hong Kong are quite small but functional on my last stay we were on the 17th floor and seemed like the room had been renovated it was in good condition and clean but I cannot vouch for all floors as I have had rooms in the past with stained carpets but possibly the whole hotel has been renovated. We are a family of three and there is space in a double room for an extra bed which the hotel will happily provide . Didn't get charged for the extra bed on my last visit but have in the past in fact as we were checking out there were some Irish ladies complaining about the fee for the extra bed so a bit hit and miss. Getting to the hotel is simple from the airport. Catch the airport express from the airport to hong Kong station in 25minutes cost HK$100. Catch a taxi from station to the hotel in less than 10 minutes and cost less than HK$30. The MTR station is only a 5 minute walk from the hotel great for getting around Hong Kong. If fashion shopping is your thing then Wanchai doesn't have much to offer but does have a decent street market which is worth a visit and the wanchai computer center above the mtr station and 24hr mcdonalds is great for geeks(sorry) My only negatives about the wharney are that the room service menu is very limited to Asian dishes and expensive but as mentioned there plenty of places to eat on your doorstep from traditional pub grub to delicious thai restaurants. Also the tv choice for english speakers is limited to Sky news,cnn and national geographic channel. recommend this hotel and can be had at a good price most of the year through BA.com", "Date": "August 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Asia", "Title": "“convenient location but thin walls”", "Author": "pte-traveller", "ReviewID": "UR137046349", "Content": "Convenient location with lots of eateries, popular wanton noodle shop, egg tarts shop and convenience stores just minutes away. It is also 5 minutes walk to the MTR station. However, no fashion retail shops or malls nearby. This hotel is located in the red light district but the crowd is not rowdy. Although there could be some noise coming from the bars during the weekend, we were not disturbed by the noise as we were located on a high floor and facing away from the main road. However, as this hotel caters mainly to tourist with kids, we were frequently disturbed by the hotel guest shouting at each other across the rooms. The thin wall of the hotel room made it impossible not to be disturbed. If you can bear with the noise from your neighbour in the next room, this is a “value for money” hotel, which is conveniently located near amenities and transportation. Service staff are always polite and ready to help.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“Clean, well located hotel in Wanchai, Hong Kong”", "Author": "MEGATLX", "ReviewID": "UR136723780", "Content": "My wife and I lived in Hong Kong for 20 years from 1984 to 2004. We go back from time to time to visit friends. We like to stay in the Wanchai area because that was our old stomping ground and we know the area well. This year we stayed at the Wharney for several reasons: 1. Good location. 2. Most reasonably priced mid-range hotel for the dates we would be in town. 3. We had stayed there before and found it very nice. We were not disappointed this year. Our stay was from August 7th to 9th (2 nights). We were in room 1821. We paid for a \"standard\" room but were assigned a room on an executive floor. We requested and received a non-smoking room. One bed, also as requested. There had been some comments regarding free Internet. Our reservation through ORBITZ clearly indicated free internet. This was honored by the hotel. WIFI speed in our room was excellent. The room size is relatively large for Hong Kong. Bed, desk, lounge chair left sufficient room for our luggage. Closet space is acceptable for a short stay for a couple. In room safe nice to have. Mini-fridge (very mini). We took out the soft drinks and other items and were able to put in 3 oranges and 3 pears. That was about it. They supply two bottles of water (380 ml) per day of our stay. Nice touch. (Be careful-the water bottles in the mini-fridge are chargeable. The ones on the night table are free.) Bathroom is small. The wall to the room is glass (see through) but there is a curtain that comes down from the inside for privacy. Toiletries including toothbrush, razor, soap, etc. are supplied. Nice touch. Flat screen TV. Limited English language choices. Many restaurants, fast food, 7-11 stores, banks, etc. in the area. Short walk to MTR (subway) station. There are lots of \"girly\" bars in the area but that does not bother my wife or myself. Just \"walk on by\" if you are not interested. Pool and gym available. We did not use so I cannot comment. Front desk staff very friendly. We took the AIRPORT EXPRESS bus from the airport to Central. Then took the A1 free shuttle from the train station. It stops right in front of the hotel. Did the reverse returning to the airport. Shuttle bus runs every 20 minutes (or so) most of the day. Check schedule if your flight is very late or very early. Overall we would highly recommend this hotel. Check around for best price at various web sites.", "Date": "August 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tilburg, The Netherlands", "Title": "“a good place to stay”", "Author": "TravellerNLTilburg", "ReviewID": "UR136024884", "Content": "It was a good decision to stay at the Wharney Guang Dong Hotel during my 7 day trip to Hong Kong/Macau. The location was perfect, close to the nightlife of bustling Wanchai and fairly close to all kinds of public transport connections. The hotel room was small, but this is the case in most hotels, as space is at a premium in Hong Kong. The only thing which disappointed me was the fact that WiFi access was not free.", "Date": "August 2, 2012"}, {"Ratings": {"Overall": "2.0", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Not For The Faint Of Heart”", "Author": "abberley887", "ReviewID": "UR135126893", "Content": "I booked my stay without knowing that the hotel is smack in the middle of the red light district. Not a two minute walk, but in the middle of it. Be prepared for the shock (and do not bring your kids... or your wife). The room was small but adequate. Check in was an unpleasant affair.", "Date": "July 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Excellent location bad about the wifi”", "Author": "8leung", "ReviewID": "UR135112097", "Content": "I stayed at this hotel for nearly 3 weeks in July, very good location and many restaurants nearby, nowadays most hotels in Hong Kong and China provide free internet access but this one charges you and it cost me around £45 (HK$500), a bit of a rip-off.", "Date": "July 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Convenient location with reasonable and clean rooms”", "Author": "Schaible", "ReviewID": "UR134740971", "Content": "I was staying at the Wharnley Guangdong Hotel for four nights during my last Hong Kong visit in July 2012. The location is fantastic: in the middle of Wanchai, walking distance to the next subway stations, major business areas are not too far away and in the heart of the nightlife district. The reception team is doing their job quick and efficiently despite a small lack of hospitality attitude. During my stay the daily room rates changed due to the hotel´s revenue management policies. I paid between HKD 900 and 1400 per night. The concierge/bell service was perfect: helpful and prompt. I stayed in room 1319 which was good and quiet. The rooms in Hong Kong hotels are generally speaking much smaller than in mainland China but it was fine. The housekeeping did their job well. Wireless internet was for free and the connection was fast. Breakfast was not included in my room rate. There is an option to have it for HKD 98 per person. The buffet is nice but not outstanding in terms of quality and quantity. The hotel has an outdoor pool and gym which are situated in the neighbouring building and are nice but not top of the range. I can recommend this hotel to all travellers who want to stay a bit away from the classic American and European hotel brands but still have some expectations. The location is convenient for starting your sightseeing tour from: just nice for first time Hong Kong visitors.", "Date": "July 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“If you get the right price, deception in last visit”", "Author": "Pierre-Marc L", "ReviewID": "UR132852476", "Content": "I have been to this hotel 4 times, its major plus is clearly its location, since it is in the heart of wanchai action, close to bar and pubs ( it's also 2 mins away from red light district so some could not like that fact, but its a clean and vibrant area of Hong Kong). It is also close to wanchai subway station and close to central. The room themselves are okay, bed are a little hard even by Hong Kong standard but room are large and always clean. This is one of the few Hotel in Hong Kong where I never had one word to say against cleanliness. The problem with this hotel is that its price varies alot and sometimes it just get to pricy for what you get. This is a nice clean hotel, but still as mentioned beds are hard, decoration is dated a little so over USD 125 per night I wouldn't go for it. My last visit was a deception since I had book the executive suite and when I went there I was told they only had two single beds. I asked if I could get large bed in deluxe room and get some kind of refund and was told no. I asked if I could cancel booking and was told no. I understand sometimes you can get only twin bed in a regular room, but seriously if you book an executive suite you expect to get a large bed. For me as a customer who went there 10 nights in 2 months I expected more service and didn't get back. But still its great place if you can get it for the right price.", "Date": "June 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Manila, Philippines", "Title": "“Average service”", "Author": "Chloe27_12", "ReviewID": "UR132308291", "Content": "Wharney Hotel is located in one of night hot spots in Hong Kong. There are a lot of girlie bars around it so not a good place for family with very young children. Room's size is not big, just right. No free wifi. Expensive for its price. Staff are just ok. Located near an MTR station.", "Date": "June 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“hello sailor”", "Author": "do_i_snoredoris", "ReviewID": "UR131490275", "Content": "great location - surrounded by bars and nosheries. Room was fine, no view but not needed. Staff very helpful. good value. easy for train line or tram and $20 gets you to the ferries. My son and I ate lunch a few times at Hay Hay just across the road to the left on the corner. Full of locals but heaps of good food at local prices. Take it for what it is and enjoy. Spring Deer in Wody Rd Kowloon still worth booking for. Yeung Kee in Central (Wellington St) a must. The OLD CHina bar was good a bit further along. The sailor connection - the US navy was in port so, given you are on the edge of the red light area, there we lots of Toms in town, which is always good fun to watch.", "Date": "June 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“Good location, suprising neighborhood”", "Author": "OljaExplorer", "ReviewID": "UR131037727", "Content": "Stayed here for 4 nights and had a nice and interesting experience. The location is very good, in the middle of Wan Chai, good chinese restaurants, shops with fresh fruit and Mac Donalds are nearby. Walkable distance to the Exibition Centre, to old part of city and,hotel Peninsula, Hong Kong Ferry... When we arrived and cheked in, we were all surprised: we were in the heart of Red Light District . A Malesian girl with her client from Europe were in the elevator. We were asked by the travel organizer if we wanted to change our hotel. There was no need for that, because we spent little time at the hotel, only for nights sleep. The room was average, the breakfast was poor, but the staff were very friendly.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seoul, South Korea", "Title": "“A good option if you get the right price.”", "Author": "BlackadderIII", "ReviewID": "UR130829098", "Content": "Stayed here for two nights after a friend's recommendation. Location is in the heart of Wan Chai and the free Airport Express shuttle bus stops right at the front door. Staff were very friendly and eager to please. The Scottish restaurant in the basement is one of my favorites in the SAR. My room did not face Lockhart Rd. which gave the room much needed quietness. I did not use the pool so I cannot comment. Wifi was included in my room rate.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "TRICHUR, KERALA, INDIA", "Title": "“Good location, excellent service”", "Author": "CLASMOTS", "ReviewID": "UR130156930", "Content": "We stayed there for 3 nights 4 days a family of 4 with extra bed thrown in... happy with the service especially of Arjan who was the Sales manager. The Hotel located in the middle of night life...with lot of bars, 7/11 which provide good break fast in the vicinity. walkable distance to Wanchai MTR station", "Date": "May 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good, above average for busniess”", "Author": "Bleehk", "ReviewID": "UR129907650", "Content": "Nice hotel, well located for busniess - They increase the prices quite substantially during the trade fair but i guess thats HK for you... Good rooms, comfortable beds, clean and staff are pretty good (they wont go out of their way for you) but again... thats HK for you. Only downside is you only get 1 WIFI password, if there is one more person you have to pay extra, quite a ridiculous policy, considering the prices they charge during fair time - I wouldnt bother having breakfast at this place, go to \"flying pan\" right next door... amazing! All in all satisfied and would go back...", "Date": "May 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“convenient location but not for rest”", "Author": "loyloy", "ReviewID": "UR129673472", "Content": "The hotel is location along the main Lockhart road in Wanchai. Make sit very convenient for food as well as the busy night life of Wan Chai.But it is not the place you can expect to rest early at night. The crowd in the streets does not quiet down till past 2am in the morning. Clean and reasonable well eqiuipped rooms.", "Date": "May 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Would Return”", "Author": "Kevin M", "ReviewID": "UR129620774", "Content": "I had a bad start to my stay at the Wharney, I had booked a double bed ..... so I thought and received a twin instead. After arguing about the internet options when booking the hotel I told the staff it was not good enough and I was checking out tomorrow. In fairness they went about finding me a double and called me back about 30 min later and switched my room. The girl on the desk was very helpful. The hotel is very modern and well kept. The location is right in the middle of the pubs and clubs if that is what you are looking for and MTR station is a few minutes walk.There are some good places to eat nearby. The beds are pretty hard though, if you don't like a hard bed then this is not for you.The rooms are a decent size for Hong Kong standards. Just be sure to stipulate in the comments field that you want a double bed. I think this really should be a option on their website. I don't know about others but a double bed is make or break for me when staying at a hotel. In short I would return to the Wharney.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sharm El Sheikh, Egypt", "Title": "“Nice Hotel Close to the action”", "Author": "marktrueblue", "ReviewID": "UR129465417", "Content": "Had no problem with this Hotel .Nice room small roof top pool was fine .Good scottish bar on the basement level1 the Canny Man try the Haggis Burger mmm also right in the heart of the Red light area so if you are looking for company ,its not to far to look try the junk pub round the corner from hotel great pub Ex- Pat meeting place loved the place will be back", "Date": "May 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Terrible customer service”", "Author": "alex t", "ReviewID": "UR129131253", "Content": "All i can say about this hotel was that the location was right next to the mtr, but however staff/customer service was really appalling, was really disappointed that staff behind the desk were really unfriendly, i asked for them if they could ring up to my room when the cab arrived to take me to the airport,and they could not even do that...they simply answered,we dont do that!!!! how awful....another time i was woken up through the night with children running down the corridors slamming the doors, again staff did not do anything,but simply asked me to speak to the people in person, which i did and it stopped!!! all round i would not recommend this hotel to anyone", "Date": "April 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york/beirut/dubai", "Title": "“Good value”", "Author": "jc_path", "ReviewID": "UR128802567", "Content": "Every review I have read, both good and bad, are generally accurate about the Wharney Guang Dong Hotel. It is right in the heart of the red light district of Wan Chai. The staff are quite businesslike and straightforward (they wear yellow 'smiley face' buttons to remind them to smile!). The rooms are old, as are the bathroom fixtures. The rooms are also loud because of the windows over a busy street lined with bars and clubs. The beds are firm. BUT...the hotel represents good value. For under US$ 200/night it is not easy to find a well-located, serviceable hotel in Hong Kong. The rooms are clean. The WiFi is free and works well. The air conditioning worked well. There was good water pressure and hot water. The subway is a block away. There are plenty of restaurants and pubs within walking distance that are good, informal places for a drink or a bite to eat. The Exhibition Center is close by. It is an easy 30-45 minutes from the airport by train (no hotels in Kowloon or Hong Kong are any closer). The hotels nearby, the Metropark, Sofitel, Luk Kwok, and Empire are all 'nicer' and certainly more modern. They are also more expensive. For a budget conscious traveler who wants to be in a good spot without paying exorbitant prices, Wharney might be the place to choose.", "Date": "April 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good Hotel Good Location”", "Author": "Kappalyn", "ReviewID": "UR128473319", "Content": "Stayed there on business trip to visit a trade exhibition. Very convenient location within short walking distance to the convention centre, although it is in the redlight area and my business colleague was constantly accosted by the local ladies. Breakfast was included with the accomodation and it was very good with wide variety of offerings, both hot and cold. The service rooms and cleanliness were all very good standard. Would definitely stay there again.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bracknell", "Title": "“Good Location”", "Author": "saramog", "ReviewID": "UR127957144", "Content": "We recently stayed here twice - once for 3 nights and then 1 night before our flight home. We had a twin room the first time then a double. The 2nd room was better but both were adequate although if you are lower floor & facing the front there will be noise until early morning! It is in a great area & handy for all amenities but near the red light district so be prepared for questions if you have children. We didn't have breakfast included so didn't eat in the hotel but did in the Canny Man which is the pub in the basement. Very good & a nice place for a drink although does get very busy at weekends. The swimming pool had just been opened again after the winter season & we found this clean if not a little bit cold. The only down side was that the free wi-fi was very patchy but apart from this we had a very pleasant stay.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "University Place, Washington", "Title": "“Convenient & Comfortable,”", "Author": "feltisjs", "ReviewID": "UR127857072", "Content": "I enjoyed my 3 day stay at this hotel. The price was reasonable by Hong Kong standards, and the room wasn't cramped. There's a great basement pub that I'd highly recommend (fantastic hamburger and fries)! Walking distance to the metro, buses, attractions, etc. Do be aware it's situated right next to the red light district, so you will probably be hit upon to \"have a drink!\". All in all a great place if you want to save some money. English speaking front desk too!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vitoria-Gasteiz, Spain", "Title": "“2nd Business visit”", "Author": "Mbil10", "ReviewID": "UR127676061", "Content": "It has been the second time in the Wharney Guangdong hotel and again everything was okay. On the executive floor you can have your private breakfast (simple but comfortable), free wifi and newspaper make your business stay complete. The room is quite large for Hong Kong standards and the location in Wanchai is only a 10 minutes walk from the Exhibition and Convention Center. Another important detail is the gym and changing rooms which become handy when you need to change cloths after checkout before a transatlantic flight.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi", "Title": "“Great Place but service could be better”", "Author": "ANKMukherjee", "ReviewID": "UR127472684", "Content": "The hotel is well situated in the heart of the town and is surrounded by pubs and eateries and is close to where the main action is. The facilities in the hotel are good but service could be much better. We arrived in the morning but check in took eternity and we had to go out for an unscheduled trip to the town. On our return a couple of hours later, rooms were still not ready. When they finally were, the front desk people told us that since there was some government work on, there would be no water. Worse, they had no idea when it would come. The bellboys were least cooperative and extremely rude when we went looking for our luggage. No one came forward to take our luggage to our rooms. The rooms however, were neat and facilities were good. Despite being bang on the road, there was no noise coming up to the rooms and sleep was sound. We found water in the rooms though, so the front desk had no idea about what was going on. Breakfast buffet in the morning was good but not exhaustive and choices were limited. We were happy to leave the hotel after one night.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Walton on Thames, Surrey", "Title": "“Disappointing ...”", "Author": "Lynn P", "ReviewID": "UR126771617", "Content": "First appearance lobby was smart, the rest was disappointing, staff were not very helpful when we asked for some help with restaurants as we discovered the hotel is in the red light district which made for an interesting walk back in the night, I did not think it was a good idea for my husband to go out for coffee at 4.00am (we were jet lagged) in case he was kidnapped.. Location is good and it is easy to get around from here just as a base, but would not use it for anything more.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“Good for party, but below average for comfort and good feeling”", "Author": "thoschdo", "ReviewID": "UR126721454", "Content": "probably the best of this horel is its location; if you like many entertainment locations next to the hotel. Than this hotel is OK. But the staff is slow, the rooms small and old, the bathroom cant be smaller. The breakfadt is in the dark furnished japanese Restaurant for some 90HKD; fresh fruits and Western and Chinese breakfadt makes it OK for that price. If you like it a bit comfortable and good feeling in your hotel, you should check for another one.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Horsham", "Title": "“Stay away! Rising damp?”", "Author": "TomHorsham", "ReviewID": "UR126702272", "Content": "Very disappointed with this hotel. Smart lobby but that is as far as it goes. On exiting the lift on the 7th floor there was a distinct smell of damp, which was also present in our room the whole night even though we put the air con on, which as mentioned in previous reviews was stuck on one setting and didn't seem to do much. Very dated bathroom with mould and broken ceiling. Toilet flush hardly worked and shower difficult to control. In the bedroom décor tied and carpet did not appear clean. Incredibly hard beds - like sleeping on a lump of concrete. Did try to communicate the room smelt to reception staff, but they had no interest. The only good thing about this hotel is that it is near the MTR station, which allows a rapid escape!", "Date": "March 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“Decent hotel with good value for money”", "Author": "ryanbryan", "ReviewID": "UR126504663", "Content": "Got this hotel at pretty much a bargain price, and was pleasantly surprised by the bright and well-furnished lobby, which is a bit of an oasis in the middle of what is essentially a red-light district. Location-wise, it is well-situated about a five minute walk from Wan Chai MTR station, though very much through a dense array of strip clubs and other night clubs, which was somewhat off-putting at times. I was on the fifth floor, and there was some street noise audible from there, but that kind of thing doesn't bother me - though you may wish to request a higher floor if you're a light sleeper - they did give me the option. Service at the hotel was generally pretty unfriendly otherwise though. The rooms themselves are pretty sparse in terms of features, but look like they have been recently refurbished. Mostly only channels of Asian interest on the TV as well - a reflection that this hotel seems to generally cater to an Asian clientele. Pretty much never turned the TV on again after having an initial glance. Bathroom was a little old, but fine. One thing of note - the beds are very hard, especially for Western tastes. They were actually pretty ok to sleep on, but not the sort of bed you could just throw yourself on to and relax. Again, very good value for money, but the kind of hotel that doesn't really make you want to spend any more time in it than you have to. I should also commend the hotel for being very accommodating with my early checkin and late checkout.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Good value for money”", "Author": "Madhurrao", "ReviewID": "UR126274347", "Content": "We stayed at this hotel for 6 nights. The location is close to the MTR and all the eating joints. The best thing about the hotel is that you have plenty of options to try out different cuisines in the restaurants near by (in case if you don't eat at the hotel restaurants). The hotel is right in the middle of the nightlife and clubs (possibly not advisable for family with young kids). The other good thing about the hotel is that rates are very competitive and you can manage to get a good rate if booked early. (We booked through www.booking.com, two weeks before our trip). The concierge were very helpful and gave us good advice regarding how we should go to different places that we intended to go.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Central to Great Nightlife”", "Author": "mishous", "ReviewID": "UR126113202", "Content": "This hotel is right in the heart of Wanchai, and is surrounded by night spots, so expect lots of people out drinking in the street as smoking is banned in bars, and clubs. I generally stay here for the convenience and locality. It's can be reasonably priced if you book in advance and in a slower season (if there is any such thing...Winter?). Be warned this hotel is in a red light district so it may not be suitable for young families that may want to venture home after dark. My room was the executive room and was not much bigger that the superior room that I have also stayed in nor different. However I found it slightly more comfortable especially the bed. The room was clean but being that it was actually cold a heater would have been nice! They claim to have heating in all rooms but believe me that heating system would not have melted ice. I ended up having to buy hot water bottles as it was sooo cold. The shower was almost impossible to regualate too. A 5 minutes shower would take 30 mins just to get the water right. Infact it was so hard to regulate that it was a little dangerous to shower as scolding was a regular occurance. The water pressure however is quite good and the towel are a good size. My room was on the 18th floor on the opposite side to Lockhart Road. Let me tell you I think it was louder on that side than the room I had last time which was on a lower floor and on the street. Maybe I wasn't as tired this trip so noticed the loud music playing and noice so much more. I would lay in bed and hear the breaking of bottles and music playing a 4am....... There is a great Irish bar in the basement called the Cannyman Bar. There is a great little 2 man band playing on Friday nights, which ends up being an open mic night (karaoke). The hotel is only a short walk to the MTR and is surrounded by life. If you like hussle and bussle then stay here you wont be dissappointed.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Port Dickson", "Title": "“Good Hotel”", "Author": "warriorPortDickson", "ReviewID": "UR125835611", "Content": "Stayed at this Hotel 5th/8th March. The reception staff are very friendly and competent. Cases taken away as soon as you arrive, to be brought to your room, in my case, within 5 minutes of reaching my room. Breakfast was buffet style, and in the Japanese restaurant, but Western as well as Asian items available. Again staff are friendly. Rooms are clean, reasonable large, and the rooms are made up quickly each day, and on occasions checked later by supervisor to ensure all was correct. I have stayed at this Hotel on three occasions will continue to do so. Small drawback, its on quite a busy road, day and night, and due to number of restaurants and bars in locality, some may wish to request a higher floor, or accept the local atmosphere.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Beijing", "Title": "“Stay Away”", "Author": "olympics2008", "ReviewID": "UR125831516", "Content": "Stayed here before many years ago and because of the great location chose it again, also for some reason it had rooms available when many others didn't. That should have been the first hint. Reception and response from staff was good/ok but the rooms are beginning to look tired. The bathroom would be suitable for a no star hotel. A question of cheap rust in the false ceiling and the tempermental shower which was hard to control in terms of getting a constant temperature. If you are on a low floor you will hear the noise from the various clubs and bars that go on through to the early hours of the morning. I suggest staying at the Metropark which is around the corner but of a similar price. I paid for breakfast which was not very good. Save your money and go to the building next door 3rd floor to the Flying Pan which serves breakfast of a much better quality.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beijing", "Title": "“Not Worth the Price”", "Author": "hyuan", "ReviewID": "UR125117684", "Content": "I had a reservation for a King size bedroom. They didnt bother telling me they were out of those upon checkin. When I arrived in the room I phoned down and they only then did they apologize but didnt offer any solution. They re-did their pipes recently too so the entire 12th floor I was on smelled like toilet. My toilet also was loose too and the room was really dirty. So finally they changed my room. After the room change things were a bit better. but really not worth the 1000plus HKD.", "Date": "February 24, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Delhi", "Title": "“Not Good”", "Author": "Adigoel", "ReviewID": "UR125069099", "Content": "Stayed here for 4 nights. No heating during cold HK days. Rooms quite ordinary. I got the fourth floor and the noise from the street (from the party goers) disturbed me as well.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Not Great”", "Author": "sc0tmum", "ReviewID": "UR124796263", "Content": "Stayed here for 3 nights in January 2012 for Chinese New Year. The hotel has a very nice foyer etc but the room we had on the 15th floor was average but had several annoying things about it. The weather in Hong Kong was freezing and there was no way to turn on the heating. Try as we might to get heat the air conditioning unit was set to 30 degrees but nothing was coming out of it and we literally chittered all night. Condensation ran down the windows but there was no means of opening a vent or anything and even the wall under the window was soaking in the mornings. We had to leave one of the keys in the lighting thing to keep the bathroom blower going to try to dry off the room for the next night. This was not peculiar to our room as our family had 3 rooms in total. Beds were like sleeping on a marble slab. Breakfast was OK but most of the dishes had gone cold apart from Chinese food which was in bamboo steamers. It was not a particularly cheap hotel, in fact not much cheaper than the Harbourview which was far superior when we stayed there. I would not return in a hurry! On the plus side it is conveniently placed for bars and eateries hence the 3 stars.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bondi Beach Sydney", "Title": "“Perfectly adequate”", "Author": "andrew_hayes70", "ReviewID": "UR124500537", "Content": "In the centre of the storm on Lockhart Rd in Wan Chai the Wharney is surrounded by bars and restaurants. Its close to the convention centre, MTR, shopping in Causeway Bay and Admiralty, and 2 stops from Central Hong Kong. The room is very typical of a 3 to 4 star hotel. Beiges and cream interior, ok bathroom ,desk chair and flat screen TV with some cable and pay per view movies. Breakfast buffet is an ok with a mix of Chinese and western choices.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beaconsfield", "Title": "“Overrated”", "Author": "Gunner47Beaconsfield", "ReviewID": "UR123826370", "Content": "Supposed to 4 stars but would probably give 3. Rooms tiny, 2 single beds in room but one is pushed up against the wall. Clean enough but looks tired. Asked for a higher floor to avoid the noise below which they did however the room had a connecting door to the next room locked obviously but quite noisy. The area is in a club area but not really seedy just brash and noisy. Good restaurant across the street Tsui Wah a chinese diner good reasonable Asian food. One of the worst things for me is they want to charge 20 HK dollars for an hour for wifi. This is just a rip off.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oxfordshire", "Title": "“Good value hotel”", "Author": "LSC22", "ReviewID": "UR123778980", "Content": "A very good value hotel situated in a colourful part of town. Our room was on the 17th floor and did have a rather strange lay-out. The double bed was situated against the wall and so this did present some difficulties. There was clearly enough space for the bed to be placed within the middle of the room, this would be our only criticism. We enjoyed excellent breakfasts and would certainly recommend this hotel.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cape Town - South Africa", "Title": "“Great Business Hotel”", "Author": "Travelocity2", "ReviewID": "UR123653540", "Content": "I stay here often as I attend the Fairs at the HKTDC complex. Its a 5 min walk (almost completely under cover for those rainly Hong Kong days. Central enough if one wants to get out and about, surrounded by great convenience stores, deli's and fast food for the Foreigner who wants to eat something other than local cuisine. It has a health club and Pool annex, which is adequate. Great Free Internet and rooms service. Breakfast is buffet style Asian and European, so something for everyone. Its small but clean and recently renovated.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Hong Kong Sevens”", "Author": "Melb_Craig", "ReviewID": "UR123629179", "Content": "I go every year to the HK 7's and every year I plan to stay at the Wharney. It's a mix of location and entertainment with a good supply of ear plugs. Situated on Lochhart Road the whole area is bars and restaurants and so each Friday and Saturday night the whole area is party central, add an influx of 20,000 rugby fans and it gets really busy. The staff have always been very helpful and it is just a 3 star hotel, but worth the stay if you want to have some fun. There is a MTR station just down the street and HK$20 from \"Central\"", "Date": "January 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Very Poor..”", "Author": "Keith R", "ReviewID": "UR122916467", "Content": "Firstly I'll start by saying this hotel is not all bad.. Its very central. Close to the Mtr.. And the lobby looks good. When you get to the room you'll find its very basic. The bathroom has a grubby and old look to it and the beds are hard as rock.. I like a firm matress but this one was like trying to sleep on a coffee table.. We had a problem with our shower The water coming from it was very brown in colour and it seemed not to have a cold feed going to it. I will give them there due.. After reporting the problem it was sorted out within a few mins. What they couldnt help us with was the Loud music that just seems to come through the seeminingly single glazed windows till 6am.. When I told reception about this problem they seemed to just chuckle at me.. Yes I know I stayed in a noisy area.. But you think the windows would be enough to block out the sound.. Especially on the 6th floor? To sum Up.. I wouldnt stay here again if they Paid me too..", "Date": "January 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Location great, the rest very average”", "Author": "Mikecoss", "ReviewID": "UR122811274", "Content": "It seems that most reviews i read on this hotel were fairly accurate. The bed is as hard as rock, the room small with basic bed linen. The service was poor and the staff seemed decidedly sullen. The hotel was very busy and i assume this is sue to it's location. The location is great for those wanting to be in central Wanchai although there are other hotels that are in close proximity that i will try next time eg: Novatel. At just over 1000 HKD per night i would have expected more. There ia also no traditional breakfast on offer and only a japanese and Chinese restaurant on the 3rd floor. To summarise i loved the location but despised the service and amenities. Next time, another hotel.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Good Location, Small Room, Front Desk Service can be better.”", "Author": "PACSingapore", "ReviewID": "UR122241408", "Content": "The locaton is great. But the front Desk service there are room for improvement. Not every can speak english fluently and tends to be a bit messsy though there may not be a lot of customers there. I have book 2 executive room and stayed 4 nights there. The Room are relative small as compared to the normal room (which I happened to have access to it) and does not look like what is in the pictures for executive room (though room is clean and neat). As such I felt that I am being short changed especially when I paid a higher price for executive room as compared to th normal room (I happened to have access to it as someone I know stays at the normal room at the 6th floor). The Amenities in the room are quite ok but the 3 hotel lift needs works. The lift overload alarm bell sounds everyday durig the peak hours though it was not carrying at its full capacity. The Japanese restaurant is value for money. The contenental breakfast is fine but the 2 room is a bit small to cater for all the people there.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Westbury England", "Title": "“Okay but not great”", "Author": "SAXONY", "ReviewID": "UR122060343", "Content": "We stayed in this Hotel for two days and were pleased it was no longer.The reason was the bed was rock hard and the noise coming from outside throughout the night made it difficult to sleep having said that the Hotel is clean and modern but space in the room was limited.We did not eat in the hotel but found a good place for breakfast one block away called the Pacific Coffee Lounge The location is cental for most places so it really depends on whether you are stopping off on route The first room we were given was on the 20th floor and one side of the double bed was against the wall which is not good We asked to be moved and the room on floor fourteen had two single beds with bedside tables", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chonburi", "Title": "“Location at a price”", "Author": "Sedang_Farang", "ReviewID": "UR121789693", "Content": "Per most other reviews, this hotel is well located for both business and pleasure with ease of access via train to/from the airport IF you do not have too much luggage. My trip was at very short notice and I paid an exorbitent price by any comparision to other major asian cities for a room (breakfast not included) that was just your average HK hotel shoe box. The staff where efficient, the condition of the room was well maintained and very clean.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“ok hotel, great location!”", "Author": "mheeaad", "ReviewID": "UR121189935", "Content": "awesome location for bars and nightlife and perfect for the hkg 7;s", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Rennovated reception, old room furniture, dirty swimming pool, but good location”", "Author": "Diana S", "ReviewID": "UR121004679", "Content": "This hotel has perfect location, it is on the main street in Hong-Kong where all the night life takes place. There are many restaurants, bars, clubs, shops and markets around. Hotel staff was very nice, but concierge quite confusing rather than helpful.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hanoi, Vietnam", "Title": "“Great value for money...”", "Author": "phnhaque", "ReviewID": "UR120837332", "Content": "One of the better deals in Hong Kong and great value for money. Central location in the entertainment district of Wanchai, within a few steps from the MTR, efficient service and free internet/wifi. Have stayed there on several occasions and was never disappointed and hence will be back again.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zhongshan, China", "Title": "“good price/value ratio”", "Author": "china_funshine", "ReviewID": "UR119030206", "Content": "They Wharney is mainly interesting as of it's great location close to the Wanchai MTR, Star Ferry, and just a 15min walk to central. Its a great spot for going out in HK's red light district. Rooms are quiet and are equipped with free WIFI. On the downside the mattresses are pretty hard and not very comfy.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Farmington, Connecticut", "Title": "“Good location”", "Author": "Novacus", "ReviewID": "UR118912055", "Content": "Hotel in a good location. Room was bit tired but good value for money with nice pool. Very busy in the night time with many bar, restaurant and nice shopping around. The hotel staff was friendly and helpful. Good for young people would like to have life night. Not recommend this hotel for family with kids.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Low level Hotel located in party central”", "Author": "Sagee S", "ReviewID": "UR118363913", "Content": "This was my first time in Hong Kong. To anyone who has not visited yet, you gotta get over here. Its the city of the future. My business partner chose the hotel and as you will see, did a terrible job with that. Hotels dont come cheep in Hong Kong but there are plenty of choices that offer a better value than this place. The rooms are tiny and run down. The bathrooms are old and moldy. I have seen the cleaning staff put in a lot of effort in the daily cleaning, but this hotel is just too old and the rooms have not been renovated in ages. The worst part is that the hotel SMELLS of SMOKE!!!! This place must date back to when smoking in public places was common practice. I am not sure how long ago that was, but the smell is just unbearable and its everywhere. If you are at all sensitive to odor, you will not be able to stay here. Also, bring your own shampoo and conditioner. Its been a while since i have been to a hotel that does not provide those small soap and shampoo bottles. Whats worse is that they had a soup dispenser in the shower, similar to the ones they have in public bathrooms. Dont know about you, but i dont like the feeling of showing in the public bathroom. The one advantage of this place is that its right on a very hot bar scene. If you are looking to go out, this hotel is right in the middle of the busiest bar scene in Hong Kong. That reminds me, dont get a low floor, or the bar shouting will keep you up late at night ;).", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Shanghai", "Title": "“It's alright”", "Author": "Toujours_plus_haut", "ReviewID": "UR118294108", "Content": "Let me start of by saying that I try to be as accurate as possible when giving my ratings, and I struggle to call this hotel anything but average. That doesn't mean that it doesn't serve it's purpose in a satisfactory way, it just means that it's not as great as the Marriott or the Peninsula. I ended up at The Wharney because my mate who I travelled with was booked in there by his business client. For a \"lad's weekend\" in Hong Kong, I don't really worry too much about having the luxury of a 5* hotel, so for this purpose The Wharney is good enough. The Wharney's lobby area is bright and clean, and the staff were efficient and friendly when I checked in. I was on the 8th floor, in a non-smoking room. The hallways look a bit dated and dark. The room itself was of decent size and had a kingsize bed. The interior looks perhaps a little dated, but you have everything you need there. The bathroom had a shower-over-bath arrangement, with good water pressure and hot water. There is a small safe in the closet for you to store your valuables. Most important for me though, the rooms were clean and made up every day, and there is free WIFI in the rooms and in the lobby area. The hotel is located in Lockhart Road, one of the main streets of Wan Chai. The area may look bland during daytime, but after dark it comes alive and can be quite intimidating for first time visitors to Hong Kong. The area is full of friendly bars, some of them with even more friendly female clientele. Although there are many places to go for a beer without getting accosted by the ladies of the night, I wouldn't recommend for anyone on a family break to stay in Wan Chai. Pay a bit more and stay in Central, or stay in Kowloon. If you're looking for something fairly cheap and cheerful, and don't mind staying in a lively area, then The Wharney is an ok choice. I would consider staying here again if I'm in Hong Kong on a \"boy's weekend\", but I'd opt for something a bit more classy if I was travelling with family or someone you want to impress :)", "Date": "September 19, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“suprisingly good”", "Author": "traveller_au97", "ReviewID": "UR118145619", "Content": "My initial reaction when I heard I was booked into this hotel was shock and surprise: 1. I do not normally stay in 3 star hotels 2. I heard the location was in the middle of an \"entertainment\" area or red light district but close to Star Ferry and MTR When I actually got there, it wasn't so bad. The location is actually quiet good and it is easy to drop in to a expat pub for a beer, it is a fairly noisy street yet the rooms are quiet and they are very comfortable. I only stayed there for 2 days,1 night on a work trip and I was very impressed. Rooms are good sized and I did not feel I was cramped, bathroom was clean and it is on the route of the H1 bus (I think). A lot less impressive was the breakfast offered by the hotel, it was basic and I probably would have been better off eating under the golden arches but overall it was very very decent. The free wifi was a great thing, especially as I had just bought a galaxy tab at times square and was eager to try it. I would stay there again..it was good value for money.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stockton, UK", "Title": "“Fantastic location at a great price”", "Author": "mackyUK", "ReviewID": "UR117898976", "Content": "Like some of the other reviewers this hotel came recommended to me when booking my flights with BA and what a recommendation it turned out to be because for location you won’t find much better for your money. The first plus about the hotel is the free transportation from the MTR station which only took about 20 minutes. The second plus was the hotel itself, OK the rooms are on the small size but they have all the basics all of middle-to-upper class hotel with a powerful and much needed air conditioning system. Breakfast in the hotel was good and the Canny Man pub had a large range of food and drinks at reasonable prices. The location of the hotel is brilliant – walking distance to the nearest MTR, the Star Ferry and bus stops. Lockhart Road has a wide range of places to wine and dine and don't be put off by the working girls because they do not bother looking for business with families or couples.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane", "Title": "“Very Good as usual”", "Author": "Brisflip", "ReviewID": "UR117771160", "Content": "Many people stay where the sites are and pay slightly more for the choice. I stay at the Wharney across from Kowloon at Wan Chai where the service is equal to many hotels in kowloon that you would pay double for. MTR and Star Ferry at your doorstep and all tours pick up and drop off from the Wharney. The service is very good at the Wharney with the rooms cleaned daily (very well) and good management and assistance if required. Would recommend the Wharney to anyone that is travelling to Hong Kong and dont be offended by the girly bars (not my cup of tea)and ignore them and move on by.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York, NY", "Title": "“could be great, but some serious shortcomings”", "Author": "newyoika", "ReviewID": "UR117515824", "Content": "im sorry to say i can't recommend this hotel. with a little more effort it COULD be the perfect place to stay, but it has some real problems. i wanted to give it 2.5 stars, but 3 stars felt like too much. the room was actually not as tiny as i'd expected it would be. the wifi was free and worked well (but only allowed to connect one device at a time, and sometimes it randomly makes you re-login). i was worried about noise from neighbors when in the hallways but upon entering the room, the walls actually block a lot of it out. the bathroom was actually really clean & modern & spacious. i was on a non-smoking floor, but there was still a little smell of cigarettes. staff wasn't particularly helpful or friendly, but i can't say i had any problem with them either. now to my 2 real concerns & the reasons i wouldn't stay again. the room was relatively clean (furniture upholstery & decorative pillows had some minor stains like most hotels), BUT the refrigerator area was totally still stocked with the previous person's leftover food & beverage items when i arrived. an open/used container of hotsauce, a half-eaten package of candy, 2 open beverage containers, some bags of instant noodles. that was really gross & made me wonder if the linens had even been changed since the previous guest. the worst of all is the \"beds\". i read the reviews of \"firm\" mattresses but i couldn't have conceptualized what that meant until i stayed here. we are talking SLABS OF MARBLE. it's almost like laying on a block of concrete, and im not exaggerating. yet somehow the springs managed to stick through as well!!! i would have been more comfortable sleeping on a wood floor. i had a room with 2 single beds, and will admit 1 was slightly worse than the other, but both unbearable. i stacked both duvets on one bed and lined it with the 4 thin pillows provided. it was uncomfortable & lumpy & still hard, but the best i could do. location is great, very close to metro. had i not arrived to someone else's half-consumed food & beverage items, and had the beds not felt like rocks, i would say this would be the best hotel in HK in its price range. unfortunately because of those things, i wouldn't stay again. that being said, if you DO end up here, you will survive. but you probably won't sleep well.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London", "Title": "“Okay, but would stay else where.”", "Author": "don_dukes", "ReviewID": "UR116593425", "Content": "Stayed in this hotel for 4 nights in August. I booked this hotel through a well known British Airline website, which gave it 4 stars. I wouldn't really give it 4 stars but more 3 stars. It's great to just dump your bags, shower go out and rave, sleep and do the same again. Comfort wise I found the bed a little too hard, and I like hard beds. WiFi wasn't free i'm afraid, it's about HK$300 for 3 days. The room was clean-ish, I think the carpet could have been given another vacuum and would have been nice to have some English speaking channels, I think the only ones were the news and adult ones (not that I paid for that...). The bathroom was okay. I got the breakfast with my stay and it was good: western breakfast as well as Asian (rice, noodles etc...) Hospitality wise it's a good hotel to just dump your stuff and go out but I wouldn't expect to indulge in here. I was facing the main road (Lockheart Road) so got a traffic and noise coming through the window. As it's in the thick of Wanchai I wouldn't recommend this place if you were bringing your kids/younguns with you as it's next door/across the road/round the corner from massage parlours and lady bars: loadsa expat Brits trying it on with the girls, but if you're in to that then whatever!", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gdynia, Poland", "Title": "“Very good place to stay in HK”", "Author": "KamilK", "ReviewID": "UR115108381", "Content": "Clean, comfortable, with good meals. I little loud neighborhood, however does not bother you that much if you take Upper floors, close to the fair center and MTR.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "asia", "Title": "“Conveniently located HK hotel for business and leisure travellers”", "Author": "frappeo", "ReviewID": "UR114866261", "Content": "While the Wharney Hotel is not a new hotel and has undergone a couple of management changes, it has been recently renovated, with compact rooms typical of Hong Kong. I find Wanchai centrally located in between the business districts of Admiralty/Central and the perpetually overcrowded Causeway Bay shopping district. In short, Wharney Hotel is in very conveniently located for business or pleasure travellers, though it is tucked amidst seedy night clubs. If you've impressionable kids travelling with you, then Wharney Hotel may not be suitable. Our room (#1207) was tiny but kept spotlessly clean and well equipped with hairdryer, kettle, bar fridge (empty for you to stock your own refreshments), with towels, coffee/tea and locally bottled drinking water replenished daily. The beds are a little hard but it is not so bad that you can't adjust to it after a night or two. Sleep quality depends on the room you're assigned. We didn't have any problem with street noise in bustling Wanchai, though we could faintly discern a pub brawl going on in the wee hours of Friday night/Saturday morning. What I like best is the blast from the rain shower in the really tiny bathroom. The tub is clean but somewhat redundant because bath salts and foam bath are not supplied. There is a wall-mounted, multi-purpose liquid soap dispenser, so be prepared to bring or buy your own toiletries if you're fussy. Ditto for razor/shaver. If you need to do your own ironing, be prepared to wait for the equipment to be sent up to your room. Wharney Hotel is easily accessible from/to airport via the affordable Cityflyer (double decker airbus) at HKD40 for a one-way trip, vis-a-vis HKD100 for the Airport Express. Except during rush hours on weekdays, the Airport Express train is not much faster than the Cityflyer because one needs to transfer to a shuttle service from the express train terminus in Central District to reach Wharney Hotel in Wanchai. MTR and the cheap but slow tram are just steps away, as is the bus stop; it is easy to flag down a metered taxi too. In short, you've plenty of transport options; likewise for F&B options. There are plenty of affordable eateries and pubs around the hotel so you're literally spoilt for choice. There is a casual al fresco Chinese eatery 'Hays' just across the street from the hotel which operates 24/7 which serves excellent roast duck, crackling pork and barbequed pork with al dente egg noodles which are perfect anytime one feels peckish. In sum, I would recommend the Wharney Hotel on Hong Kong Island, which is affordably priced when there are no trade events at the Wanchai Convention Centre in its vicinity. In other words, you can get a good rate if you're not visiting Hong Kong in April, Sept, Oct and during the Rugby Sevens (last weekend in March). The Hotel runs a weekend shuttle to Causeway Bay; there is an on-site registration counter and a shuttle to the Wanchai Convention Centre when there are trade shows going on. Just be prepared to pay more when your travel dates coincide with trade shows.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Fantastic Location , Great Nightlife”", "Author": "RajeshGMumbai", "ReviewID": "UR106680750", "Content": "this hotel is just 5 minutes walking distance from the Hong kong Convention center , where all the exhibitions are held , so if you want to attend any exhibition there as a exhibitor or as a buyer , you can choose this hotel , as is very near & there are many resturants & cafes near by", "Date": "May 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Basic Business Hotel, only if you want to be in Wan Chai”", "Author": "alokjainhk", "ReviewID": "UR99344598", "Content": "Very basic hotel. My room had a funny smell. The faucets in bathrooms were not working properly. They tried fixing but it was not perfect and did not offer a change in room because the hotel was full. The service was also very basic. Staff were more interested in tips then providing the service. Food choices are also limited and more focused towards chinese tourists. I would have been happy to pay a little bit more and stayed in better hotels nearby.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Decent place on the Island side.”", "Author": "Vgaxyz", "ReviewID": "UR98738918", "Content": "The Wharney hotel is in Wanchai district and is within walking distance to the Convention Centre. It is absolutely on the main lockhard road and very easy to spot. To reach the hotel, I generally take the Airport Express to the Central station and then Airport express shuttle bus, which directly halts at the Hotel. It is in the middle of bustling nightlife spots. There are lots of restaurants nearby including Indian, Italian, Arabic. The hotel is very close to the Wanchai MTR station (Exit C2). The hotel is well maintained. The lobby and reception area is pleasing to the eye. The rooms are decent sized, linen clean and the bathrooms clean and well maintained. The rooms do have minibar and tea/coffee making facilities. Internet is available on payment. Have stayed only in the superior rooms and haven’t stayed yet in the Japanese styled room. Rooms do have a safe and iron and iron board. There is a paid movie channel as well, which has a variety of old and new English movies along with Chinese and Japanese ones. The Gym, Sauna and Steam rooms are nice and use of which is complimentary for the guests. There is a tiny little swimming pool, which is hardly used though. Good security in the hotel as well. Local sightseeing tours can be arranged from the hotel itself. The breakfast is decent (not included in the tariff and found it a bit expensive). I have not tried the Chinese or Japanese restaurant in the hotel yet. On the whole a good hotel for business as well as travelers with families, being in the heart of the Island side. Good for short stays and has good connectivity with the Island side, causeway bay shopping district and with the Tsimtsatsui side as well. A word of caution though- the whole lockhard road is lined with dance bars, and the street scene does gets a bit noisy on the weekends.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portsmouth", "Title": "“Nice hotel, great location”", "Author": "Southdown_Man", "ReviewID": "UR96331186", "Content": "This was a British Airways recomended hotel and certainly can see why. The location is great. The free bus to and from the airport express train stops outside the door. Wan Chai MTR station is a two minute/one block walk away. Bus and tram stops one or two blocks, no more than three or four minutes walk. Really central. Ideal for business or leisure Standard and Executive rooms are well appointed with the usual amenaties. Beds are a little hard, but clean. Limited TV channels in English, Sky News only. Internet wi-fi cheap, one hour $20 with cheaper longer rates. Buffet breakfast taken in one of the hotel's resturants, the Japanese fusion. Its a bit dark but comfortable and the selection is quite adequeate. There is also a Cantonese resturant. There is a basement \"pub\" called the Canny Man which has a Scottish theme of Haggis burger and other delights. Reasonably priced, ample quantity, good quality and good service too. There is a discount for hotel guests of 10% but can't be charged to your room.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Surprizingly good Wharney”", "Author": "saundm", "ReviewID": "UR93176148", "Content": "I booked through Agoda and rate was very good, I found the hotel surprizingly good, rooms werer small but perfectly adequate and clean. Easy to get to from the Airport Express on free shuttle bus.Staff very friendly and helpful.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Excellent location”", "Author": "sarahclark117", "ReviewID": "UR92216879", "Content": "We stayed here for 2 nights and really enjoyed it. The hotel is clean and comfortable, good facilities and perfect for short stays. Having been to Hong Kong before and knowing the area well this hotel could not be better located in Wan Chai right in the heart of Lockhart Road. Great selection of bars and restaurants on the doorstep, MTR stations and harbour only a short walk away. Will stay here again next time we visit HK!", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary, AB", "Title": "“Have stayed here many times before, and will continue to do so”", "Author": "Ft_Garry", "ReviewID": "UR91969924", "Content": "This was the 7th trip in last 5 years to Hong Kong, and all but one time I stayed at the Wharney. I travel here on business, and now request to be booked into here. I find the staff very friendly, I speak no Chinese but they have no problems helping with tourist information or giving taxi drivers directions. It is well located, very close to the MTR. Multiple bus stations right close, as well as the tram. There are lots of good restaurants nearby, and good pubs/bars if you want to have a cocktail or more. As mentioned in other reviews, you are in a sort of 'red light' district, although I don't find them very obtrusive and it's not very showy. Rooms are not overly roomy, as expected for the locale. They are clean, and comfortable. The Lockhart Road side can be a little loud at times, I am usually there over New Years Eve and people like to party well into the night. If you're not on Lockhart side though it is fairly well shielded from noise. It must be mentioned again how friendly I find the staff, above and beyond.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "glendale, california", "Title": "“Nice 3 star hotel by HK standards”", "Author": "blubs99", "ReviewID": "UR91580046", "Content": "Usually stay in Marco Polo or Langham or Shangri La but happened to be in HK new year's eve unexpectedly and everything was sold out. This property is actually convenient to central and CWB on HK side (10 minute walk or 1 minute subway) and only two stops to Kowloon. Having bars on the streets nearby didn't bother me and there are some great restaurants within 1-2 blocks (Uno Mas Spanish restaurant is great and right across the street). Breakfast buffet in the Japanese restaurant was average for a 3-star hotel, but the Executive Lounge is useless unless you want a banana and coffee in the morning or tea in the afternoon. Health club didn't seem like it was in the same building. Service from the staff was pleasant and the room was clean, although small. On the 18th floor I heard a little New Year's eve noise from the street (until 4 am) but not loud enough to bother me. Wifi in the room was free and very fast!", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“good value”", "Author": "angela7", "ReviewID": "UR90764146", "Content": "Although this hotel is in Wanchai, in the red light district of Hong Kong, it was good value for money. It is a modern hotel and the staff were extremely helpful and pleasant,,The rooms were spotless, and best of all it is five minutes walk to the tram and the metro. There is a Pacific Coffee a few doors away and in the immediate area are all sorts of decent restaurants. The one thing that sticks in my mind ....the exceptionally helpful and pleasant staff from check in to housekeeping. Very competent. No complaints at all.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aberdeen, Scotland", "Title": "“Great location”", "Author": "ExiledinAberdeen", "ReviewID": "UR88062441", "Content": "Stayed here for 6 nights. Great location served by the HK public transport system. Bus/MTR/trams minutes from the door. Wanchai has the reputation of being the wilder side of HK. If you want enjoyment in any area of HK then this is the place for you. Many bars/clubs etc. of all kinds. There are \"lady bars\" in the area but you don't get pestered as you walk by. The hotel itself is very good, I had a very good room, good service by the staff, generally a good hotel I would recommend to friends to use.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Bad location”", "Author": "Popcorn17", "ReviewID": "UR87562399", "Content": "This hotel is located right next to red light district and you can see the hookers is standing or sitting there waiting to get hook even in the daytime, is very near to Wanchai MTR like 5mins walk but in order to get to the hotel you have to walk pass the bars and its not so healthy when you have family with young children. In the night, when you are in the room you can clearly heard the noise from the bars, sound proof wasn't good. The housekeeping didnt even remove the previous used towel. I spent $20 1 hour for internet, but the connection was poor, can't connect at all. Overall the stay in the hotel is real bad experience, is not recommended to stay in this hotel.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hobart, Australia", "Title": "“Good value, good location but maybe not for families”", "Author": "Theaveragetraveller", "ReviewID": "UR86807257", "Content": "Actually stayed here prior to December for 3 nights on business. The hotel is very close to the exhibition centre and not expensive, hence the choice of staying at this property. Found out very quickly we were in the red light district, however it was not in your face offensive and there are plenty of other bars in the district as well. We were fortunate to have a Hong Kong expat in our group who could also speak the language and we were able to visit some very good local restaurants tucked away around the area. Also went to Lamma Island for diner one night, a good experience if you get the chance. Any night ferry ride will give you a good view of the lights of Hong Kong. The hotel itself was not expensive, nice foyer, very friendly staff but not a lot of English spoken (hmmm, foreign country, maybe sould expect that). Rooms are not big and the bed is a little hard, but more than adequate. And they are clean and quiet, or at least mine was. No complaints about this hotel. The room was not expensive, good location for what we wanted and anyone going to an exhibition or conference at the exhibition centre, I would recommend this property. Didn't use the restaurant, gym, etc as we were out for all meals and really only used the hotel for sleeping. I'd probably not recommend for families given the proximity to the red light district.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Location...But...”", "Author": "mundo61", "ReviewID": "UR84008525", "Content": "We stayed at the Wharney GDH and quite enjoyed, the location is good, right in the middle of the Wanchai entertainment district, with an abundance of bars and restaurants nearby. The hotel is comfortable enough but the rooms are small and the beds are hard (some of the hardest experienced anywhere). The staff are friendly but english is limited and it can be difficult to be understood. The lifts are the smallest I have been in and hold a max of 4 or maybe 5 people at a squeeze. Being charged for Wi-Fi internet is also a pain but at HK$20.00/hour is not overly expensive. The building is old and has been refurbished, but may be due for another bit of work soon", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Luzon, Philippines", "Title": "“Have nothing to criticize about”", "Author": "pink_marjory", "ReviewID": "UR78240939", "Content": "We stayed in this hotel for 4D & 3N... and it was the best. My family & I didn't know that we were booked in the middle of a red light district, until we came back late on our first night... The hotel was nice, cozy and is near to a lot of establishments (Subway,7-11,bars,etc). The room has complete amenities like, TV, ref, hot&cold shower, comfy bed, towels, good room service etc. The staff we're accommodating, especially the UW, even though they can hardly speak english. Too bad, we haven't explored the hotel that much since we only stayed there just for the purpose sleeping& taking a bath.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth WA", "Title": "“Great Price Great Location”", "Author": "megsyj", "ReviewID": "UR76739364", "Content": "The hotel is located in Wan Chai on the Hong Kong Island, which is the redlight district of HK. That being said its really only one street of girly bars that you have to deal with, otherwise its all traditional expat bars and funky new bars and heaps of great restaurants. The street behind the hotel has a restaurant to cater to nearly every taste! The hotel itself is clean, tidy and comfortable.. in short there is nothing wrong with it. The gym and pool were great too! Its only a 3 min walk to the MTR station and your only a stop away from the interchange that takes you to Kowloon. Plus the staff were really helpful booking restaurants too! Its a great price for a great location.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kaohsiung, Taiwan", "Title": "“Good value for money”", "Author": "linhmc", "ReviewID": "UR71584181", "Content": "The hotel is quite clean, the staff is quite nice, right in the center of the red right district in Hong Kong which I didn't know when I booked. However, it's not so noisy at night. It's very close to a subway station, just 5 minute walk - and close to The Pacific shopping mall. There are some local restaurant serving local food for breakfast so it is quite interesting trying.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Pretty decent place”", "Author": "featuredteacher", "ReviewID": "UR71321336", "Content": "Stayed here for two nights with a friend. We were there (basically) to sight see and then go out in the evenings. We got the room at a pretty reasonable price over the internet. For the price, the hotel is in an excellent location on HK island near a lot of the good bars. The area is probably not suitable for families with children, though, as at night its filled with drunks and hookers. The room was fine - small but decent. Quiet, beds comfortable and a nice bathroom. Staff were efficient for check in and check out and the basement restaurant/bar does nice pints of real ale and isn't extortionate. Basically, if you're looking for a cheap-reasonably priced hotel on the island and you're wondering whether there's anything wrong with this one - there isn't. Its a fine place to stay and should give you no problems. The only note is that the beds are a little hard. I live in China so I'm used to this - most people in China consider it preferrable to have a slightly harder matress, but it didn't give my friend any hassle who was new to China. Unless you are the princess from 'the princess and the pea', you'll probably survive just fine.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "India", "Title": "“Well located, comfy compact rooms”", "Author": "JabberwockyIndia", "ReviewID": "UR68647814", "Content": "Located right in the center of Wanchai, the rooms at Wharney are compact, comfy and clean. It has the usual refrigerator, washroom with complimentary toiletries, tea/coffee maker, safe, cable tv. Breakfast is not complimentary (costs about 100 HKD) in the Japanese restaurant - good fare - with continental and Cantonese items. The dumplings were especially tasty. Unfortunately the restaurant is in all shades of dark brown and black - not the best sight to start the day with! Internet (charged) is good and fast.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Düsseldorf", "Title": "“Decent hotel in the heart of Wanchai”", "Author": "chsintl", "ReviewID": "UR68569470", "Content": "Decent hotel with nice rooms and surprisingly nice bathrooms. Stayed at a high floor room with all ammeneties you'd expect. Location is hard to top in this price segment: in the heart of party district Wanchai, famous bars and pubs are just outside the lobby. Friendly staff, good service - great stay. Probably not the best place to stay for families looking for a quiet stay!", "Date": "June 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ekeren", "Title": "“My Regular Hotel”", "Author": "Siyaaarya", "ReviewID": "UR67204811", "Content": "It is my very regular hotel in Hong Kong.. I stayed here few times every year and very good location and also offer best rate..", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“well worth the money”", "Author": "StuartKatz", "ReviewID": "UR65250046", "Content": "this is not a high-end hotel but you get your money's worth. the staff were courteous and helpful. if you are looking for a shiny new hotel with all the luxuries i suggest you try the Grand Hyatt. if you want to do a lot of sightseeing and only need a hotel room to sleep in and bathe, then this place is perfect. you get what you pay for and this place is worth what you pay. i used their fitness center and it was very clean and had everything i needed.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“nice hotel for business”", "Author": "siper", "ReviewID": "UR57779714", "Content": "Nice, clean hotel for business travelling. Room was not quiet big, but cosy. Stuff was pleasant, helpfull and polite.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "leeds", "Title": "“good value”", "Author": "kevandebs", "ReviewID": "UR52425356", "Content": "first impressions of the hotel lobby was very good but when we got to our room we smelt the damp and it was quite grubby but we got what we paid for which was two hundred english pounds for five days thanks for the free slippers they provide we did not eat in hotel at all but always ate at pubs there is plenty to choose from it smelt of damp but i put it down to poor ventalaton because you could not open the windows therefor keeping all the steam in the district we stayed in was a red light district but we had no trouble at all from the ladies outside of the bars in fact we had some jokes with some of them getting around hong kong was very esy on the mtr and buses just ask your hotel and they will direct you to the nearest mtr or bus stop and it is so cheap as well in all a very good stay and we will be going back to this hotel if ny body requires more informaton then please email me", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, no problems, would use again”", "Author": "MHBA", "ReviewID": "UR51217811", "Content": "Just got back this morning from a long weekend in Hong Kong. This hotel is really good value for money, so I really can't see why people are whingeing about this hotel. I was on the non smoking 12th floor. Room was immaculate, yes it was a smaller than normal but adequate, but welcome to Hong Kong The bed was very firm but it suited my back and slept fine after a 13 hour flight. Bathroom was modern and shower was great, with complimentry tea and coffee in room, Sat TV, air con and safe all worked well. Didn't have hot water on arrival, reported it to the desk and was up and running by the time I had got back in the room after a night out. I did pay for breakfast but next time I wouldn't bother as there are a lot of bars and a couple of 7 elevens across the road and around the corner form the hotel also with a McDonalds 100 metres away. Staff in the hotel are very effecient so no complaints. Yes there are lots of bars around this location with girls who dance or whatever they do sitting outside and they do keep asking you to go in but a polite no does the job. Tip when you arrive at HKG airport is get a return ticket on the airport express train which is located inside the terminal just a short walk away from the arrivals area. You buy your ticket to Hong Kong Central just after you collect your cases at HKG$180 which includes free return bus shuttle from the station, which runs about every twenty mins, and drops you off right outside the hotel. All in all, good location as taxis and trams/and buses are cheap so you wont go far wrong for what you are paying at the Wharney. Will stay there again. Not worth paying Excelsior prices for a short trip only if you have the money to waste.", "Date": "December 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Watford Hertfordshire England", "Title": "“Not the best choice you could make”", "Author": "trucker2010", "ReviewID": "UR49464606", "Content": "I should have read these reviews before booking this hotel. The rooms are small and the matresses are comparable to a park bench with no give in them what so ever. the bathrooms look to be an add on which has made the rooms smaller and the deccor is looking qute tired The location is far to close to the red light area which is not nice to walk through. We stopped for 2 nights bed & breakfast. The breakfast was fine with all the usual international options no complaint there. The staff were freindly and helpful and as our flight wasnt until midnight they gave us a late checkout (4pm instead of mid-day) for no charge. The really annoying thing about this Hotel is an instrumental version of \"unchained Melody\" which runs on a continuous loop (24 hrs a day) in all cooridors restaurants and public areas you can even here it from your bed if your struggling to sleep and to think I used to like that tune. My advice to anyone planning a liesure stop in Hong Kong to stop in \" The Exselsior\" it looks a lot better and any trips that you want to go on the pick up and drop offs are done from there. the traffic is so bad in Hong Kong they won't go to all the hotels.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Surrey", "Title": "“good very central”", "Author": "cmcl2490", "ReviewID": "UR44223427", "Content": "we stayed here for a week, hotel is nice had a bit of hassle checking in as we had a late check in 5 pm so we ended up on smoking floors 5 and 17th they changed us the next day. bar downstair is nice friendly, do not eat in the japanese restraunt in the hotel if you are not local as you are treated badly, they totally ignored us and put is in a very dark corner no other europeans in there and i woul dsay it is due to the hospitality hotel in a great place for gettin around to all the various areas, the girls outside are a pest after a few days when you have men with you as they want work!!! english bar across the road up a lift the trafalgur pub very very good went there 3 times as the service was so good, went to the buddah def worth seeing, also went to lamma island but was a bit disappointed as not kept very well alot of ex pats live there although very nice small fishing town, ocean village def worth seeing and discovery bay is the best place for peace and quite nice beach and very very good food, hong kong is a very very clean place and we never had any problems whatsover out there mtr easiest way to get around, temple street worth going ot see. rooms are not updated, but i do have to say the concierge that was on night shift is a very nice guy and helped us the whole week", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thane", "Title": "“Great value, great location”", "Author": "JustShiv", "ReviewID": "UR39431761", "Content": "This was the fourth time I have been to Hong Kong over the last ten years and on each occasion I have stayed in Wanchai hotels. Wanchai is really convenient for accessing Central, Causeway Bay and Kowloon. A year back, I stayed at Wharney on Lockhart Road. The hotel offers really good value for money spent right in the center of business and pleasure activity in Hong Kong. The hotel is just around the corner from the Convention Center and post meetings there is a range of good places to relax. You may need to side step some of the neighborhood's night-time activities on the way to the hotel, but that's really a part of the overall ambience of Wanchai. Good fun! The rooms are pretty good and comfortable and the USP is their size, the largest of any hotel I have used in HK. The hotel was recently renovated last year, all staff was courteous and really you couldn't pinpoint any issues even if you went looking for them. All in all, the best your money can buy in HK.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Broome", "Title": "“Top location”", "Author": "ReeB73", "ReviewID": "UR37886266", "Content": "Great hotel in a great location. Many restaurants and bars close by. Close access to the rail line and shops.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Yeovil, United Kingdom", "Title": "“Good location for nightlife and sightseeing.”", "Author": "PSAG", "ReviewID": "UR35958095", "Content": "Hotel is located on Lockhart Road in the centre of Wanchai nightlife, and also within walking distance of star ferry and MTR station. Public area's of Hotel reflected its the Star Status . Booked into a standard room on the 17h floor overlooking the road. Despite what is said on the website - this room had not been renovated - however was clean, everything functioned, a room safe was provided, the bed was comfortable and the room was serviced properly everyday. No problem with noise from outside. Room adequate - but not say ideal if you wanted to spend a lot of time in your room. A friend was in a renovated Standard Room - and there is a noticeable improvement in bathroom fittings etc. Didn't use the Restaurant, Business Centre, Gym or Swimming Pool - but all looked ok. The Canny Man is a themed Scottish Pub located in the basement - and is accessed direct from Hotel lobby. Good expat surroundings - with an expat menu for food with scottish theme e.g Haggis..Staff very friendly and efficient - made you feel at home Wanchai is Wanchai so you either like the nightlife or you don't - none of it is aggressive and there is a good range of fun bars and clubs around. Lots of eating places of varying levels and price. Hotel is well located for sightseeing with easy access to MTR , Bus or Star Ferry at Wanchai Pier. Reception Staff efficient and helpful - but can get confused if English conversation strays too far away from Hotel Business. Plenty of management staff in eveidence, and a security guard on duty at all times in lobby. Good place to stay for short leisure visit", "Date": "July 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The Wharney represents great value for money”", "Author": "gringo68", "ReviewID": "UR34120522", "Content": "I recently had a brief stay of one night, on my way home from Macau. I got an unbelieveably great rate through Agoda. No complaints from me. Great location, great price, great stay. Mind you, I only slept for 45 minutes, but this was by choice. Recommend.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City", "Title": "“Great Location and Price in Hong Kong”", "Author": "Lazla", "ReviewID": "UR32851462", "Content": "I was attending a conference in Hong Kong and found this gem of a hotel downtown. Location is very convenient to the convention center and many choices for meals afterwards. Upon arriving at the HK Airport you take the Express Train to Central HK. There are free shuttle buses to the hotel (L2 bus if I remember) which make it very convenient. I stayed in an upgraded room giving me access to a lounge area on the 19th Floor with continental breakfast. First off, the rooms are comfortable having king size beds and a nice size for Hong Kong. They did not feel small which can be a problem in HK. The room had Internet (for a fee $120 HK/day) that worked well. The advertised lounge on the 19th floor was a joke. It was a small room 4 tables, a computer to use internet and some small food items left out. The 'lounge' looked like an afterthought in that they had an extra hotel room or storage room and they modified to serve as a lounge. Not worth the upgrade for th lounge. Do the upgrade for the room but not for the lounge access. Hotel is smack middle in the middle of the Wan Chai entertainment district, so you can expect a lot of people milling about going from bar to bar at night. I would recommend this hotel to people. My first choice would be the Eaton Hotel (half block away) and then the Wharney Guang Dong Hotel. Eaton Hotel had a little nicer rooms.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Porto", "Title": "“Bad hotel”", "Author": "OtaPorto", "ReviewID": "UR32023895", "Content": "Central location but in a street in night clubs and prostitution. Very small rooms, a bathroom with rudimentary shower . Breakfast totally chinese, without ocidental food.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Tauranga, New Zealand", "Title": "“Get the wireless sorted..”", "Author": "mount1", "ReviewID": "UR32013964", "Content": "Well located, good price, friendly enough staff BUT they need to get the wireless internet sorted. I stayed six days; it took 4 days for a technician to reset the wireless unit on my floor so the signal would hold stability. Business travelers rely on internet and don't mind paying HK$20 per hour for good stable wireless access.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chennai", "Title": "“Trip to Hong Kong”", "Author": "ArindamDas", "ReviewID": "UR29134075", "Content": "I stayed at Wharney Guangdong for 2 days while attending a conference in Hong Kong. Pros: 1. Location of the hotel and access to transport / shopping Cons: 1. Rooms are not spacious.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“Good hotel but not for the shy!”", "Author": "toptotty66", "ReviewID": "UR28061948", "Content": "Stayed here from the 9-14th April. paid £58 per room via BA stf Holidays. Location is Wan Chai which is the nightlife/red ligth district. very close to the MTR (train) which will take you anywhaer you need to go, the night market/ladies market/kowloon etc the trains are very quick clean and safe. The hotel room was big compared to othe HKG hotels i have stayed in. we had a double bed and a fold away bed 4 cases table chair and still had room. Our room was at the side of the hotel which was quiet, the front matbe noisy due to the main road and the clubs/bars and ladies of the night! Do not feel frightend or intimidated by these ladies and their madams. they are harmless and are just having fun and earning a living.... great for you guys out there! Myself, husbad and young son had no problem, they ended up saying hello to us as we had to walk past them every day to get to the hotel. The hotel staff are friendly, there are taxis everywhere and you can even store your luggage at the hotel after checking out if you have a late flight. There is a macdonalds and 7/11 on every corner. you will not go hungry here. All in all a good hotel, great location and will stay here again", "Date": "April 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Nelson, New Zealand", "Title": "“Good enough - great location.”", "Author": "NinNelson", "ReviewID": "UR27885150", "Content": "Ticked all the boxes, showing its age, (carpet very stained) but over all clean and tidy. FAntastic location near MRT. Tip - free internet available down first level of MRT (once you have gone through the turnstile) - usually did not have to wait to use one of the three available. Great for checking your email. DO; the bus trip around to Stanley Bay (sit at the top, its a cheap thrill!). Cafe Deco up the Peak is surprisingly affordable (by HK standards) and great view and yum food.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“Could have been better”", "Author": "verena_amber", "ReviewID": "UR27267258", "Content": "Period of stay: 21-26 Feb 2009 The MTR station (Wan Chai) was about 7-10 minutes walk away, which was convenient if not for the numerous bars and pubs that I had to pass along the way, which made the area a tad complex and sleazy. The hotel wasn't top-rate, but for the price that we were paying, I wouldn't expect anything more. The room I had was not too small or large, acceptable for a local Hong Kong hotel, but I was assigned a room that had a bit of a weird musky smell, with stains in the carpet and upholstery of the armchair in my room. Thankfully, the bed sheets seemed clean enough and did not give me any trouble, although the mattress was a bit hard. Even with the room airconditioning off, the room was unbearably cold, and walls were rather thin, as I could sometimes hear the TV of the room next to mine. The corridors were dimly-lit and an odour lingered in the air, which suggests that they could probably do with some maintenance. The buffet breakfast was rather limited, so after 2 days I skipped it totally even though it was included as part of the room rate. Service of the hotel staff was generally ok. Check-in was pretty prompt, although I had to wait about an hour for my room to be ready. Other than that, I think the staff are quite professional and efficient.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "australia", "Title": "“Great hotel, Perfect Location, No problems!”", "Author": "andrewdias", "ReviewID": "UR15133430", "Content": "I stayed at the Wharney between Feb 14-19 2008. At first i was a little unsure, because of some of the negative reviews i'd read on this site. When i got there i was greeted by very friendly staff, and the check-in process was quick and simple. The room was a good size. the double bed was a little firm, but wasn't a problem, i had no problems sleeping. i can't beileve people who complain about the beds being too hard - they must be serial whingers! there was also no weird smells in the room, or stains on the carpet, as per previous reviews. There is a small bar fridge and the usual mini-bar stuff. but i would not recommend any of the stuff on offer. just go across the road to the 7-11 and buy whatever u need for much cheaper. The bathroom facilities were good. My room was located on the 11th floor, which is a non-smoking floor. The location of the hotel itself is perfect. Only a couple minutes walk to the MTR (underground, and the best way to travel), and about a 10-15 minute walk to the city centre (Central). When i was there, i NEVER had to take a cab anywhere. the hotel is located in Wan Chai. There are no problems from the red-light district scene. People will ask you to go into their bar, but all you have to do is politely decline. They will not hassle or harass you. I am a single guy, so i got asked quite a bit, but had no problems at all. It is a very safe place, so you don't need to worry. i had breakfast at the hotel restaurant, and it was buffet-style. Very good quality in my opinion, and it cost HKD$100. If you want more breakfast options, there is a 24hr place called the Flying Pan, about 30 seconds walk from the hotel - they do pancakes, omelettes, and things like that - also very good. I will definitely stay at the Wharney again and I hope this review will be of use to you.", "Date": "April 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“The very last time we stay here”", "Author": "Lucyboom", "ReviewID": "UR15083289", "Content": "My partner and I have stayed in this hotel three or four times usually for about a week. We most recently stayed in December/January with my partner's parents and grandchild. I was really dissapointed at the room they gave my partner's parents and grandchild. Three single beds shoved into a tiny room, not room to walk around any of them and no room to sit down, other than on the bed. Their luggage was stacked up against the wall and it was just terrible. I know the rooms here aren't huge, I just expected when they booked a triple room there would be space for a chair and to walk around the beds (I mean these people are in their 70's!). I really felt bad, as it was my idea to stay here and I'd had previously okay experiences. Having said that, they still don't acknowledge the fact I have stayed here previously and the staff are pretty unhelpful, they are never able to recommend restaurants or shops and I don't think I will stay at the Wharney again.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pinner, London", "Title": "“You'll love this location or not.”", "Author": "DL_Pinner", "ReviewID": "UR14632866", "Content": "I would class this hotel as 3.5*. I was on a trip with 3 other friends from London and stayed here for 6 nights. It was easy to get to on the Airport Express as following taking the Train from HK Airport, we took the Tourist Shuttle Bus H2 from Airport Express Station at Hong Kong to this hotel. For HK Island and the MTR this hotel is very well located, as Wanchai MTR is a 2-3 minute walk away. We paid GBP40 per night on the BA Holidays Website for room only, which is a bargain. Breakfast was copius and cost HK$98 per head. Never used the hotel restaurant but enjoyed many a good evening in the Canny Man Bar in the basement. The rooms are medium in size, unfortunately the beds are very hard and I found it difficult to sleep. Aircon was good. The bathrooms were small but clean. We stayed on the 15th floor. There is small but good steam room sauna adjacent to the hotel to enjoy. The greatest surprise was that this hotel is slap bang in the centre of the \"red-light\" area and this can be uncomfortable for couples or family groups. The hotel turns a blind eye to clients bringing women (mostly Philipinos) in with them. So beware. Also 15 metres from the hotel main door are \"girlie-bars\". But also there are good pubs and clubs, reataurants. In summary if you are on a boys trip and want a good location for HK touring then the Horney Hotel (sorry Wharney) hits the bullseye - otherwise there must be better choices!!.", "Date": "March 29, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Canada", "Title": "“What a RIP-OFF”", "Author": "Frequent_Traveller58", "ReviewID": "UR12761498", "Content": "The staff are very unfriendly and rude. This is definitely not a four star hotel as rooms are too small and hallway looks dirty and worn out. I booked this hot via online and paid a total of CANADIAN $ 264 for three nights, which averaged out to CAN$88 per night. However, i made a mistake a counted one day less without realizing. On the day that i was suppose to check out, i returned to the hotel in the evening to find the room was locked. After speaking with the receptionist who was very rude, i realized that i had miscounted the days and missed one. I then asked her to extend the stay for an extra night...for that i was charged CANADIAN$260 for the room for a night. I stayed in a superior room and they have charged me the posted rate for the deluxe room even though i never upgraded. On questioning them, they claimed that at different senario, they can charge a different price. I have never felt so rip-off before. The location itself isn't the best as there're many prostitutes and rowdy drunk bars hoppers hanging around every corner. I didn't feel save even to walk down the street at night. I do not recommend this place to anyone.", "Date": "January 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "California", "Title": "“Good Location, Small Room!”", "Author": "mpeter", "ReviewID": "UR11267428", "Content": "I stayed in this hotel for just one night for 110$ USD. the price was great, the location is good, but the rooms are really small. Definitely not a place to stretch out in. Please notice in the pictures of the hotel that everything is shot with a long lens to make it all seem bigger. The Lobby is nice and the staff is quite attentive, but be prepared for a cell sized room and very very hard beds! Its serviceable for a short trip if you are on a budget. Only a 3-5 minute walk to the wan chai train station and the neighborhood though near a 'red light\" district feels quite safe and well lit.", "Date": "December 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“Ok - just”", "Author": "steve_ben2004", "ReviewID": "UR11071934", "Content": "The Wharney is listed in some guides as a 4* hotel. It is certainly not so. The room i was in, 1016 was very small - ok for one person, certainly not large enough for 2. The bed was very very hard and the bathroom was tiny. I am by no means tall - about 5ft 10 at a stretch and there was no way I could sit in the bath. When I arrived at the hotel I was given a very tatty room overlooking the back, despite having previously requested (and been granted) a renovated room, facing Lockhart Road. I managed to get a room change from the second night onwards. The room was kept spotlessly clean by the housekeeping staff but the carpet was really quite dirty and well worn. All in all the Wharney is a mid 3 * hotel - certainly not more. Although I love the location, I think I will be looking elsewhere for my next trip", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kalamata, Greece", "Title": "“Warm and friendly hotel”", "Author": "parsifal", "ReviewID": "UR10945044", "Content": "We booked this hotel through BA holidays primarily for its good price and location. It is situated in Wanchai close to the MTR (only two stops to Central), buses and trams. The area is very buzzy and there are some good bars and coffee shops nearby as well as more of what Wanchai used to be famous for - its a pale shadow now! We stayed (11 nights) in a standard room on the 11th floor overlooking Lockhart Road (don't stay here if you want a decent view) where there is always something going on. The room was of a reasonable size - two twin beds - and a decent bathroom. The beds are very firm which we liked. The standard of cleanliness was excellent. The staff throughout the hotel - reception, concierge, maids, bar - were, without exception friendly, helpful and all with a ready smile. We left our camera in the bar (The Canny Man) one evening - and didn't realise that we had lost it until the next morning. The staff were helpful and concerned and it was eventually discovered behind the bar where one of the bar staff had deposited it for safe keeping. This bar was generally very good - excellent staff and good food. The downside was that it could get very noisy especially on Friday nights with the biggest culprits being British expats trying to prove how brilliant they are - but, apart from that it was a good place to unwind. In summary - the Wharney is an excellent place to stay in HK - great location, good price, friendly and attentive staff - what more do you want!", "Date": "November 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brisbane", "Title": "“OK Stopover Hotel (Syd-Lon)”", "Author": "Tortoise_n_Hare", "ReviewID": "UR10031761", "Content": "Stay - 2 nights / 3 days. Location - Located in the area full of bars/adult clubs, the night life is best described as \"interesting\" During the day, a walk up to Time Square or down to the convention centre was OK. Room - Smallish, could do with a good clean (e.g. long hairs still on the floor) bathroom was fine. Room and entire floor had a funny smell (musty?); either floor had flooded recently or something was used to mask smell of cigarette smoke. Also, there are only 3 non-smoking floors. Food - Breakfast, again was just what you'd expect from a traveling business man's hotel, nothing flash, a bit of western and eastern hot foods - no service - had to get all food and coffee/tea yourself. We didn't have dinner there. Note: Yum Cha across the road was great, upstairs, has a big sign over the road Hoi-Tin I think. Staff - Mixed. Reception staff could do with a personality transplant; bell boys and security were friendly and always helpful with bags/doors/questions/etc. Overall - Used the travel agent for this booking, I didn't check it out online first and ended up with what I got. You'll be able to do much better for the same money with a bit of research.", "Date": "October 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Pleasant experience, great location”", "Author": "freespirit_888", "ReviewID": "UR8839157", "Content": "Good service, porter ran to take our bags when we arrived at the lobby. Always asked after us everyday we saw him. Some guests complained that staff was unfriendly, but we never found that, but its a 2-way thing - if your friendly they're friendly. One girl didnt understand English but she promptly asked her colleague to serve us who did. Rooms are like good 3* or low 4* european hotels. Smelt musty on first day but after that - no more smells. Beds were so hard when we first sat on them but when you sleep on them they were actually really comfortable. Really clean as I am quite sensitive and can feel bed mites - but no probs. Could see carpet stained where someone spilt a drink but you get disposable slippers so no probs. One funny thing was that my 6ft fiance didnt fit into the bath and when he stood up for the shower, had to bend his neck to wash his head. Good facilities, they even give you free toothbrushes, so one less thing to bring. Brilliant location, 2 mins from MTR, 5 mins from trams, 10 mins from ferry. Close to Wellcome supermarket for your bits. Only problem is that the bars on that road pump up the music on Thurs-Sat and even tho we were on the 19th floor we heard the music and screaming. Guess doesnt help that its rugby week - so not much sleep those few days! So joined in next day instead. Some reviews stated that the red night district bothered them, but we thought it was great, brilliant atmosphere not sleazy like France. Wouldn't feel intimidated if i walked there on my own more intimidated by the drunk tourists! Bad experience at American Peking restaurant. We walked in when closing but they asked us to go in, then many dishes we wanted werent avail. cos take too long to cook, so ordered other stuff. Then while we ate a waiter stood over us constantly looking at his watch, then the bill came and was extortionate! So got ripped off on an unpleasant meal! Not happy! Loved the Hay Hay restaurant tho, highly recommend the deep fried pigeon. So nice we went back on our last nite for that. If you're screamish ask them to leave the head out. Its detached but on the plate for deco. I know some ppl find that off putting. Also liked the garlic Gai Lan (greens), fruit punch, sweet and sour garoupa (fish). Suckling pig really fatty tho, so not a good choice. Overall it was a good stay, may go somewhere else next time only to try another hotel, but if stayed there again would be nice.", "Date": "September 21, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "new york, ny", "Title": "“very nice hotel on a not so nice street”", "Author": "judy1019", "ReviewID": "UR8713149", "Content": "the whole aura of the hotel was classy, the rooms were comfortable and of average size. the staff members were very friendly and helpful. the location of the hotel is about two blocks away from the wanchai mtr. my biggest problem were the clubs and pubs that were immediately adjacent and across from the hotel. it seemed a bit odd to be walking by sleazy women who worked hard to lure men into curtain covered doorways. and right next to a street full of what seemed like brothels is this beautiful hotel. so i guess if you don't mind that which men seem to enjoy greatly...the WGD is an absolutely great hotel i think for one or two travellers.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Bowling Wharney!”", "Author": "perthwatraveller", "ReviewID": "UR8469408", "Content": "Stayed here with a group during the 2007 Hong Kong 7s. Great position - in the heart of ALL the action. You would not want to be anywhere else. Lifts were slow, as was the toaster at breakfast. Rooms were quite comfortable and larger than I have stayed in elsewhere in Hong Kong - albeit mine smelt a big of fish. Lobby has a great chandelier and is a top place to people watch. Whilst the Hotel is a lttle tired - the hallway carpets needed a good clean - the accomodation provided value for mone", "Date": "August 22, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Newport, Rhode Island", "Title": "“Not a good choice - especially for women business travelers”", "Author": "SSR-RI", "ReviewID": "UR8452071", "Content": "I spent three nights here during a business trip in early June. Not a very positive experience. The location may be centrally located for business but the hotel is located in a bit of a red light district and for a woman travelling alone as I was, it was kindof creepy being out after dark. The first room I was given was one of the most depressing hotel rooms I have ever seen - it looked as though it had not been touched since the late 1960s. All but three floors permit smoking so the smell of tobacco permeated everything, and finally make me a bit ill. I requested (and got) a new room on a non-smoking floor which was much cleaner and seemed to have been recently renovated. The outdoor pool is in an adjacent building and the pool deck had about 3 chairs, meaning everyone else sat on hard, hot concrete. The staff did their best with English but most had limited English skill and so nteractions were quite challenging. You can find a much better value and location in Hong Kong than this hotel", "Date": "August 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "pompey", "Title": "“Great value great location”", "Author": "alanpfc", "ReviewID": "UR8372528", "Content": "8 of us stayed in HK 22 - 28 July 07. We were there for the Asia Trophy. The staff were very efficient, enthusiastic, helpful and all spoke good English. It's true the rooms weren't huge by Florida standards but I've had smaller rooms in NY at more cost. The hotel is less than 1 minutes walk to the MTR (HK's fast and efficient rail system), trams and buses. Taxis stop outside. The hotel is an oasis among the bars, restaurants and convenience stores of Wanchai. We were a mixed group and, except when sightseeing or watching football, we stayed in the area. Not all Wanchai is dedicated to \"girlie bars\" and we found plenty of places to eat and drink without spending loads or being propositioned. Overall, a great hotel at a great price (booked via BA Hotels website). Would I recommend this hotel? Too right. Would I stay again? If ever my wife and I visit HK again we would not hesitate to stay there again.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Very convenient”", "Author": "Roosta", "ReviewID": "UR8184529", "Content": "Excellent location: 7-11 shops, Maccas, Coffee shops (with free Internet) and Starbucks, tramline, terrific bars, cheap and expensive places to eat and underground train station all within a 2 minute walk. A 5 to 10 minute walk will get you to some great markets (lots of street stalls) or to the harbour where you can catch the Star Ferry to Kolwoon. Our (buffet) breakfast was included in our price, was a good feed to get us going in the morning. The room was average, but this was expected for what we were paying, but it had all we needed and had nothing wrong with it. Checked in and out quickly. Have to wait a couple minutes usually for the lift, but that certainly didn't bother us. Overall, good value.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "philippines", "Title": "“Liked the Wharney”", "Author": "bukidnonprincess", "ReviewID": "UR7998550", "Content": "We stayed at the Wharney Guangdong last June 18-20,2007. Our room. was moderate in size, very clean and orderly. The bathroom was also clean. The hotel is accessible to public transport ---MTR, buses, ferry, tram. There were also many restaurants around the area. It is true that it is located in a \"red light district\" but you wont feel harassed in the area and it is actually quite safe to walk to the hotel even at night. I booked this hotel through a website and found it to be good value for money. If you are travelling to Hong Kong for vacation, this hotel is walking distance to the bus stop to Ocean Park, to the Peak Tram terminus, to Pacific Place etc.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Overall fantastic experience”", "Author": "loulouBS", "ReviewID": "UR7847818", "Content": "I was born and bred in HK & this was my first time back there staying in a hotel. I expected a rather cheap but pleasant and clean hotel & the Wharney totally exceeded my expectations. Upon arrival the staff were friendly, quick to check us in & our rooms were clean, good sized & contained all the expected amneties (shower gel, safe, mini bar, hairdryer,etc). One staff member consistently went out of his way to help us (getting taxis, asking how we were, etc) & definately added so much to the hotel. We also left for 5 days to go to Thailand and were able to leave some luggage in the hotel free of charge. Throughout our stay the staff were incredibly helpful & when we arrived back from Thailand the hotel was full & we were put in a smaller room without a safe. I called to ask to change rooms & they said the next day when another was available they would do this for us. We arrived back the next night to a much bigger room! Our friend had a pretty horrible room on his return, but did not complain or ask to change, so I wouldn't put this as a negative as when we asked they were polite & apologetic. A few people on here have commented on the bad views, but as the previous reviewer said, you have to expect that in HK (unless you book a luxiourious hotel). Personally I loved looking out our window onto the bustle of Lockhart Road. Nearby is the MTR, buses, loads of restaraunts, bars, Wan Chai market, outlet shops. The bar downstairs \"the Canny Man\" is really relaxed and friendly (a Whiskey Bar my father used to frequent!) & you get a 10% discount if you are in the hotel - a nice getaway in the middle of WanChai. The area itself is great to walk around to get a nice mix of different aspects of HK (pick up a tourist map at the airport - so handy - we always had them at home, a free A-Z! The Wharney is also on there) No breakfast was included in our deal, but if you fancy a big English/American breakfast the building next door, 3rd floor, is a 24 hour (cheap) place called \"the flying pan\". Definately recommend. The American Restaurant (is actually Chinese food)(come out of the hotel & turn right- across the road) is famous for it's Peking Duck. We didn't use the swimming pool, but saw it & it looked very nice with outdoor jacuzzi! (Possibly not the most family friendly hotel due to the location as someone mentioned on here - right in the centre of Wan Chai which is known for strip bars - however when I was a child in HK I never really noticed them, so maybe through innocent eyes it doesn't actually matter! (and our family used to eat in Wan Chai a fair bit when I was younger) We are back to HK in Sept & definately staying at the Wharney again. If you have any questions message me!", "Date": "June 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“'Does what it says on the tin'”", "Author": "Baby2", "ReviewID": "UR7545614", "Content": "This a good 3 star hotel, lots of guests are attending the exhibitions nearby and probably a lot of package tours also. Located in busy Wanchai, in the street of nightclubs, filopina girls and a tatoo parlour. If that doen't bother you, it's a terrific location to take a taxi to Central, Causeway bay, Pacific Place. 5 mins away from bus stops to Stanley and the south of the island. A ten min walk to the ferry pier to Tsim Sha Tsui. Taxis on tap. Tram line also 5 mins walk (cheap and cheerful mode of transport). metro station 2 mins away. Also lots of bars and some decent restaurants nearby - such as Curry Pot and Chilli Club in the same street. Service is good, staff are friendly and helpful. This is a pretty good 3 star hotel which 'does what it says on the tin' and even has a bath tub in the rooms!", "Date": "May 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“great value for your money”", "Author": "oxobob", "ReviewID": "UR7388936", "Content": "Stayed 3 nights in march hotel was great very clean reception area and the staff at check in were very nice and helpful.Location is great you are only 2 minutes from trams and underground system .we were given a upgraded room and room very clean and looked very fresh room also larger than i expected i was worried before i arrived at this hotel as some reviews were not to encouraging but for anyone going to this hotel i would say you do not have any problems here and i am very fussy where cleanliness is concerned . Thank you to all staff at wharney hotel for a pleasant stay", "Date": "April 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "East Anglia", "Title": "“Great hotel, great location”", "Author": "Yaxina", "ReviewID": "UR7154579", "Content": "This hotel was easy to get to - thanks to the courtesy bus from the airport. Room was very clean with Sky TV, Mini bar. Location was great for us as it was close to lots of bars and clubs to enjoy in the evening. Near tram / subway routes.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Basic & Cheap Hotel, Good Location”", "Author": "debbiestothert", "ReviewID": "UR6894195", "Content": "Arrived with my wife and daughter after a long 15 hours flight from Gatwick. Had booked a non smoking room and was shown to a room that was on a smoking floor. It really smelled badly of smoke. No problem they moved us to a non smoking floor. We were in hong Kong over Chinese New Year and had a great time, but would I recommend the hotel to friends? Not if they were bringing their families, only if they were going on a boys short break or for people who don't nind roughing it. The central location was great though", "Date": "March 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Good value with great location”", "Author": "Blinque", "ReviewID": "UR6694635", "Content": "I stayed at the Wharney Hotel in Wanchai area of HK last week for 3 nights. Having read a couple of the reviews here before making my journey to HK, I didn't want to expect big things from this hotel (for starters, the name of the hotel doesn't make it sound like its a great hotel). We were initially planning to stay at the Novotel nearby, but it was fully booked so this was a cheaper option we took up, and on the map it's got really good location so we decided to make a reservation at the Wharney. I always think that how the hotel lobby looks would roughly give you an idea of how the room will be like. (although, I have been fooled on occasions). Walking into the lobby at Wharney Hotel, it was clean, well-lit, not too overly decorated, and well managed. Already I had a good impression. The rooms were small, (but every hotel in HK has really small rooms). They were clean, tidy. Bed was a bit hard, but it was alright. After a long day of shopping, you'd be so exhausted that the last thing you'd notice is the hard bed. They provide you with TV with satellite channels, and there's also wireless internet connection if you decide to bring your laptop along. The greatest thing about this hotel however, is the fantastic location. Only a stone's throw away from the Wanchai MTR station, you're only minutes away from the main shopping areas. The night life around the hotel is good too, with many pubs, and food stalls you can go to even at late hours of the night. One downside to this is there are quite a bit of prostitutes and strip bars around the area, and if you're a single man they do tend to bother you while you walk past them. Having said that, they don't post that much disturbance for it to be an inconvenience to you. If you're in a group, or with your girlfriend/wife, then chances are they'll leave you alone. Good value for money. It's no Four Seasons, but with the price that you're paying, and its great location, I'd say Wharney Hotel would be a place I'd consider staying in again in the future.", "Date": "January 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Athens", "Title": "“Good Value for money - Comfortable Stay”", "Author": "Gelada", "ReviewID": "UR6576696", "Content": "We stayed at Wharney GuangDong Hotel from Aug 17-22. The room was small but functional and clean. Location is very good for walking around town (Wan Chai MTR station within a few minutes walk). Although the hotel was located in a \"bad\" area, surrounded by \"strange\" nightclubs and bars, we were not harrassed in any way. We had a comfortable stay. Hotel was good value for money.", "Date": "January 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Durban", "Title": "“Very Poor!”", "Author": "ashepDurban", "ReviewID": "UR6567504", "Content": "This was a very disappointing hotel... When you first walk in you are dazzled by the stunning lobby and entrance hall... do not let the massive glass chandelier fool you. we had a horrific room... it was dirty and dusty, smelt very old.. and was tiny. Only one side of the bed had a bed side lamp, and the other side of the bed was right up against the wall.. not ideal! When we complained to the manager at the end of our stay he was shocked to hear that we had been put into one of the old rooms, apparently the whole hotel had been renovated except for a few rooms.. which had been given to us!! That is unbelievable.. and we were appalled. The road that the hotel is situated on is also appalling.. full of strip clubs and prostitutes and the hotel looks onto the back of a dilapidated old apartment block, so you get a great view of people bathing and hanging up their laundry... terrible!!", "Date": "January 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Pretty Good Hotel”", "Author": "Jade_Ang", "ReviewID": "UR6549780", "Content": "We stayed at Wharney GuangDong Hotel from 28-31 Dec. We were given a free upgrade from Deluxe to Executive Rooms due to the hotel being full. The room was small but functional and very clean. Although the hotel was located in a seedy area, surrounded by nightclubs and bars, we were not harrassed in any way. Also, the location was convenient with Wan Chai MTR station within a few minutes walk and lots of eateries nearby. We had a comfortable stay.", "Date": "January 3, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great hotel, pity about the location!”", "Author": "BigBarney", "ReviewID": "UR6170864", "Content": "I booked this hotel from the Cathay Pacific Holidays brochure. I chose this hotel because it seemed to meet all my needs, it is on the island, it is close to an MTR (subway) station and is centrally placed for access to all the attractions of Hong Kong. My wife and I arrived from Brisbane, Australia after a great holiday for a 4 night stopover en route to the UK. We arrived late at night (11.15pm) and checked in with no fuss. Our room (1106) was a lot smaller than we had hoped for but clean and quite stylish. First problem was there is nowhere to put clothes! There is a wardrobe but only one small drawer in the writing desk. So we lived out of our suitcases for 4 nights. The Wan Chai area is quite seedy with several dodgy looking night clubs almost next door.", "Date": "November 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Value and convenience”", "Author": "David007", "ReviewID": "UR5618868", "Content": "I recently had two short five day stays at the Wharney. I was somewhat concerned travelling with two teenage children having read some of the previous reviews regarding the ‘girlie bars’, but these were not an issue. If you are not a punter, they are not interested, although they would always give a polite ‘hello’. On the positive side, the hotel is excellently positioned for transport. The MTR is a few minutes walk away, as is a branch of the China Travel Service should you need a Chinese Visa in a hurry. The taxi to both Star Ferry terminals (at Wanchai and Central) is around HK$15, and the Wanchai terminal can be walked to above ground. Taxi to Peak tram was around HK$20. We requested non-smoking rooms, which we had on both stays. Well done! Regarding eating, once again the hotel has excellent local facilities. Having read the reviews we did not eat at the hotel, but rather took our chance locally. There are two excellent restaurants nearby: Jo Jo’s Mess (Indian) located above the Bottoms Up bar, and our favourite, the Chili Club. Pacific Place is also good, and there are plenty of good local places as well. The hotel has three 7-11 stores within 100 yards, which is great for that soft drink and quick snack. Also there is Starbucks around the corner for that caffeine fix! During our second stay we were positioned on the 15th floor, where the refurbished rooms were better than the 12th. Rooms were typically HK: small yet functional. Rooms had a mini-bar and coffee making facilities, and whilst the towels were a bit ‘thin’ they were clean. Room were cleaned daily and the bell hops were very attentive. The staff at reception tried their hardest at English, and as is usual in this part of the world, a smile and a gentle request is better received than a raised voice. We had a couple of hours by the pool which was adequate, but slightly strange being surrounded by 20+ storey buildings! On the downside, the hotel’s surroundings can be noisy (open bars playing late night music), although being on the 12 and 15 floors, this did not bother us. Breakfast was not expensive at HK$99, but there are plenty of places around the hotel where you will pay up to HK$25 for something reasonable. And finally, the nightmare that was ‘waiting for lifts’! Three lifts: not funny. It was not unusual to wait for 5 minutes for an empty lift, at any time of the day (or night). The hotel needs to get this sorted. In summary, given what we paid (we booked through BA), I have no complaints and would stay again at the Wharney. It’s not 5* but you don’t expect 5* when you’re only paying for 3*.", "Date": "August 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sevenoaks, Kent", "Title": "“Value for money”", "Author": "HUNTINGPARTY", "ReviewID": "UR5602878", "Content": "Our family stayed here for one night on a stop over to Australia, having got really good deal (£36 per room) over the web. I had read the reviews here before we went and was a little concerned about the area but we found it no problem. The children (14 & 12) thought the bars amusing and we never felt threatened or intimidated even though we were walking about quite late at night. The rooms were small and the beds were hard - but that seems to be the norm in Hong Kong. We had requested a non-smoking floor and adjoining rooms. They managed the no-smoking but the rooms were next-door but one even though the room in between seemed to be unoccupied. The corridor was a bit noisy and the pool looked a bit dingy but the staff were pleasant and spoke very good English.", "Date": "August 12, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Budget”", "Author": "browner_", "ReviewID": "UR5478514", "Content": "Well, I booked this hotel because it was the cheapest with a swimming pool, and I cant complain too much because I got what I expected. Our room was dull, tired and cramped, but cool and reasonably quiet. We faced the back of the hotel, but lower rooms could probably be noisy as there was a very loud American pub on the road below. I would imagine some of the front facing rooms could be noisy was well, as the road is very busy with traffic and clubs/bars. The basement bar was like a British pub with TV screens which was handy during the football World Cup. The pool was adequate but quite cold (this was in June) and only worth a quick dip. The spa pool was even colder! The location is great if you like the pubs and clubs and dont mind being grabbed by hookers as soon as you walk out the hotel. Some people would describe the location as seedy but I had my family with me and it didnt bother us. There are loads of bars/clubs,shops and restaurants in the immediate vicinity set amongst the \"ladies\" bars -each of which has several Filipino women hanging outside trying to tempt you in. When with my wife I was left alone, but when on my own the women always grabbed my arm. But it was friendly, never threatening. This hotel will suit undemanding budget travellers or those who want to party hard in the locality. Oh, and the staff were exceptional, very very helpful, all speaking good english.", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Perfect, but not for everyone”", "Author": "Frequentflyer2", "ReviewID": "UR5207894", "Content": "I've stayed at a lot of hotels in HK and on Kowloon but now I go back to the Wharney which is much cheaper than most HK hotels of comparable standard and probably better than most. Some clarification needed though because I wouldn't recommend it for a family stay but for singles, younger couples and especially guys, its pretty hard to beat for value and location. Yes, some of the rooms need a refurb but they're getting round to doing them and if your not happy with what they give you they'll normally change without much fuss. Breakfast is good, but now there's a breakfast club next door (3rd floor) serving 24hr breakfasts so no need to rush down to the hotel restaurant! I've not patronised the Canny Man, but with so many good bars in and around the hotel there's not much point drinking in a downstairs hotel bar when you can sit and watch the world go by in a heap of other bars. Hostess clubs next to the hotel are a bit off putting at first but once they realise that you either a 'goer' or a 'no-goer' they'll either leave you alone or be your best friend. All pretty harmless really and nothing much to see, unless you like looking at curtains! Great bars close by, too many to mention and lots of good, inexpensive eating places. You can spend a fortune on food in HK, but plenty of good value eateries in Wanchai. Also, hotel is ideally located for MTR, buses, trams, convention centre, ferries, etc. Great shopping too...discount clothes shops, electrical discount centres, mobiles, everything close at hand. Pacific Place (shopping, eating, cinema) is only a short walk away too.", "Date": "May 24, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "Unknown", "Title": "“is this the worst 4* (worst hotel?) in Asia ?”", "Author": "A TripAdvisor Member", "ReviewID": "UR5149244", "Content": "Damp sheets, bad air conditioning, noisy (as if you are sitting in the middle of a football match), smelly room. I have stayed in cleaner better rooms in Chung King mansions. Can someone please tell me how this hotel got a 4 star rating Don't be conned by ISO rating either", "Date": "May 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "London, England", "Title": "“Good value hotel”", "Author": "Peter999", "ReviewID": "UR4970694", "Content": "Perfectly adequate hotel which I got a very reasonable rate with British Airways. The staff were fine and the room was OK if a little small. It is well situated five minutes from the MTE & close to the Convention Centre. One word of warning. It is in the redlight district. Its perfectly safe but you might get accosted returning to the hotel in the evening. The hotel is very good value if you are looking for a room offering somewhere to rest and sleep and you will spend most of your time touring Hong Kong.", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "San Diego, California", "Title": "“great place to stay”", "Author": "caliduuude", "ReviewID": "UR4690394", "Content": "it's a great place to stay .if you get the right room. the first room i had was worn out and cramped.i then got moved to a better room on a higher floor .this room was newly renovated,with all the bells and whistles.a great room.with a safe and mini bar ,refidge,etc. the location is close to the metro line less than 2 blocks,so is some great dining and bars.no need for me to look for another place to stay while in H.K.,it's the Wharney for me.great staff that jump over backward for ya.they're really great folks.", "Date": "March 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "London, UK", "Title": "“Does what it says on the tin”", "Author": "Richpar", "ReviewID": "UR4461744", "Content": "We've just got back from 4 nights at the Wharney, and left satisfied that we got what we came for. As described in other reviews, the rooms aren't huge, and could certainly do with an update. However, they are clean and look like most other hotel rooms the world over. We got a deal through STA Travel for the double room for 4 nights for £200, so as far as value goes the Wharney has to score quite highly. We didn't use any other facilities, we planned to use the pool, but it's closed for 5 months over winter (not mentioned anywhere before booking). Again, this has been covered before, but do be aware that you're staying in Wan Chai, and that the hotel is in the heart of the hostess club district. This isn't at all noticable when you're in the room, but as soon as you're outside it's pretty in-your-face. It's a shame as there are a good few bars on Lockhart Rd too, but if you sit outside for too long the seedier side of Wan Chai begins to surface. It's not as intimidating as other cities perhaps, but just do be aware. Overall, the hotel is good value, is located centrally on Hong Kong island, and the staff are pretty helpful. Don't expect any glitz and glamour, or much space in your room, but the hotel does what it says on the tin!", "Date": "February 15, 2006"}], "HotelInfo": {"Name": "The Wharney Guang Dong Hotel Hong Kong", "HotelURL": "/ShowUserReviews-g294217-d302256-Reviews-The_Wharney_Guang_Dong_Hotel_Hong_Kong-Hong_Kong.html", "Price": "$119 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.57-73 Lockhart Road, Wanchai Bay</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "302256", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/28/31/55/wharney-guang-dong-hotel.jpg"}}