{"Reviews": [{"Content": "Wonderful Hotel A great hotel within a businesscomplex on the 33-38th floor with wonderful views over Tokyo skyline, next to Sumida river. Large reception at ground floor with excellent service. The two elevators goes directly to the floors between 33 and 38th floor. There are a lot of shops on the ground floor close to the hotel. The rooms are large by Tokyo standard. I also received a english newspaper every morning to my room with no extra charge. The roms are very very clean with everything you need. I stayed on the 34th floor and had a spectacular view of southeast Tokyo. There are also a superb lounge in the center of the hotel at the 32-38th floor. Just amazing.", "Date": "Nov 18, 2008", "ReviewID": "UR155195169", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "1globetrotterSweden"}, {"Content": "Spacious I agree with all other reviews, we also enjoyed the views and spacious rooms. We even saw Mt Fuji on 2 mornings in April from our bedroom window. When arriving with suitcases try getting off at the southern part of Tsukiji subway as there is a lift.The northern exit (Near Denny's) is closer to the hotel though there are a lot of stairs. I was concerned about hard beds due to previous reviews. Yes the beds are firm and even though I like a soft bed it wasn't too bad and we slept well. Internet in lobby 100yen for 10min. Overall very good value for the quality of hotel and location.", "Date": "May 15, 2008", "ReviewID": "UR429177143", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "wylma"}, {"Content": "Excellent location This hotel starts on the 33rd floor so the views of the river leading to the Tskiji fish market and the rainbow bridge are amazing. Just a short walk to Japans fantastic subway system with a MacDonalds, Gloria Jeans, a great 7/11 that will heat your food selection for you. Head upstairs from the foyer to get the best brekky in Japan at a great little cafe. Easy walk to the amazing fish market and vibrent market style shopping around it. Very clean, very comfy. We would definitly stay again.", "Date": "Apr 30, 2008", "ReviewID": "UR272783638", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "travelbugQueensland"}, {"Content": "good deal, great location, incredible view       view from hotel room to Ginza district", "Date": "Apr 26, 2008", "ReviewID": "UR805165378", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "larsb18"}, {"Content": "Nice room, nice view, not bad location (great for Tsukiji fish market)       Traditional Japanese Breakfast at hotel (Western also available)", "Date": "Apr 11, 2008", "ReviewID": "UR618188322", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "BobakLives"}, {"Content": "Great Hotel with a Great View Decided to spend our 30th wedding anniversary in Tokyo-a bit out of our comfort zone. This hotel is right on the Sumida River, with great views from the room as well as the restaurant. The room was fairly large and comfortable and the hotel is next to a large office building with food mart, coffee shops and restaurants. The staff's English was lacking but we managed to get by. Within walking distance of the fish market and Ginza. Ate the first night in the hotel, as we arrived late. The menu was in Japanese and the staff was unable to explain anything in English, so we just pointed and hoped for the best.", "Date": "Feb 13, 2008", "ReviewID": "UR103295933", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "suefromCalif"}, {"Content": "Good choice We stayed at the New Hankyu Hotel for two days in February. Arriving at the Tokyo station on the Narita Express is the simple part. We decided that after a long flight we will not try to master Tokyo's subway system that day and took a taxi to the hotel (1300 yen). The hotel is in a building along with offices and a hospital (St. Luke's). This is a little confusing until you see the sign for the hotel. Staff were polite and limited in their English skills. An earlier reviewer mentioned that the hotel decor is a bit eighties, which is absolutely true. However, the view that awaits the guest from the room is beautiful. Rooms were clean. Massage chair a nice touch (although being tall and not japanese sized the massage can be interesting).The hotel seems to be popular with Japanese visitors as well as Westerners. Food: there are several restaurants within the building, also a Mc Donald's and a 7-11 store.Location: 3-4 blocks from the Tsukiji Station. 15-20 min. walk to Ginza (going straight from the hotel entrance). 25-30 min. walk to Tokyo Station (without luggage).I would definitely stay there again. We also got a fairly good deal on expedia.", "Date": "Feb 13, 2008", "ReviewID": "UR251574359", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Tessita"}, {"Content": "thank you hankyu we stayed at new hankyu tokyo for 8 nights this year and it was great. room is comming with complimentary city or bay views ( your choise).massage chair in the room was nice surpprice. staff was very helpfull and good english speaking level. righ in front of hotel small coffee shops with good choise of breakfast menu ( dont take breakfast in hotel) {overpriced!}. hotel is situated short5 min stroll to Tsukiji metro station on Hibiya line which is conected to all major atractions in Tokyo. Or take Mizube river cruise which u can book at hotel reception ,different routes for reasonable prices.We went to sumo arena ,20 min cruise from hotel, 5 bucks one way...And on check out from hotel you get 20% off voucher for next your stay!!!great.thank you hankyu tokyo and see you soon...", "Date": "Oct 17, 2007", "ReviewID": "UR919156742", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "andrej_kollar"}, {"Content": "Good Choice for first stay in Tokyo Close to Tsukiji subway. Convienence store and Maccas next door. Good room. Pleasant Staff. all rooms are high in the building so have views over Tokyo. Massage chair, quiet air con , reasonably large for Japan. Room was a bit tobacco smelling at first but the aircon cleaned that up. Warning sign on bedside table advising customers not to smoke in bed. I found the bed and pillows ok. Overall a nice four day stay.", "Date": "Oct 14, 2007", "ReviewID": "UR982817555", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MakRoger"}, {"Content": "Great hotel, great staff We stayed here as part of our world trip, taking in a number of countries and hotels. The New Hankyu was excellent most areas. We arrived early, and they would not let us check in early, but we managed to store our bags. Once we checked in, we found the place excellent. Location was superb. We could walk to Ginza in about 15 minutes. We walked to the imperial palace in about 20-25 minutes. It was close to the train stations, and location overall was excellent. The room was very very large for Japanses hotels. The service was always excellent. The bed was hard as a rock, but ok for us. The massaging chair was nice, but would have been of more use if I found the instructions on the first day of our stay, not the last. To get there from the airport catch the limo bus to TCAT terminal (2900 yen each). Then catch a taxi to the building. This will cost abouut 1200 yen. Things to do. Check out the fish markets, or Ginza. Catch a subway to akihabara. Catch a short train trip to Tokyo Disneyland. Walk around Tokyo. Alll up a very enjoyable stay", "Date": "Feb 13, 2006", "ReviewID": "UR329710518", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "bobdobalina"}, {"Content": "Amazing view - great choice This turned out to be a complete result. The view that greeted me when I got in the room was unbelievable and made the whole thing seem like excellent value for money. The hotel was well placed in walking distance of Ginza and a couple of minutes stroll from an underground station.Like the other reviewer said the bed was indeed quite hard - but I like a hard bed so was happy. Also I had two pillows, one very hard, one very soft so no complaints there.Went to the bar one evening (you know - looking for Scarlett Johanson!) and couldnt get in as was full, but had a quick look out the window and discovered it had exactly the same view as my room - but a couple of floors down so it didnt matter at all.Only criticism is that the hotel feels a bit 80's still, but that is a minor complaint at this price, with that view and the excellent position.Highly recommended.", "Date": "Dec 28, 2005", "ReviewID": "UR908410701", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "JimmyHuntspill"}, {"Content": "Comfortable, but bad mattress               More photos", "Date": "Nov 5, 2005", "ReviewID": "UR803374658", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very comfortable, large room, great view We greatly enjoyed our stay at the New Hankyu Tokyo for our first three nights in Japan. The staff speaks good English and was very friendly. The room was much larger than we had expected. The extremely hot water was especially nice after our long flight. The hotel is within a 5-10 minute walk to the Tsukiji subway station. We received an English language newspaper at our door each morning which was nice.", "Date": "Oct 12, 2005", "ReviewID": "UR216126963", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "P-and-J-Travel"}, {"Content": "Great Views at Hankyu On a flying business trip to Tokyo I was booked in to this hotel by my Japanese business partner. It was the first time I had stayed there and I was pleasantly surprised. While the hotel is a short taxi ride from some of the restaurants etc it is well within walking distance of the Ginza and only 5 min walk from the subway. Roomas are spacious and very well appointed. I had a fabulous view across to Tokyo Bay from the 34th floor and the staff were friendly and spoke good english.I am returning in October and plan to stay there again.", "Date": "Aug 15, 2005", "ReviewID": "UR840116281", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A wonderful place Great location, near Tsukiji subway station (fish market) and Ginza. Friendly staff. And a spectacular view over Sumida river and the city skyline. The rooms start in the 33rd floor, you don't hear traffic noise, it is a beautiful oasis in the big city.", "Date": "Apr 17, 2005", "ReviewID": "UR335098858", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "椐呫亱銈夈仭銈囥仯銇ㄩ仩銇勩伄銇屻兓銉汇€?#x201d;   showReview(23170468, 'full');", "Date": "Jan 1, 2009", "ReviewID": "UR143346616", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "銉炪兗銇曘倱"}, {"Content": "澶滄櫙銇逗楹椼仹銇欍倛   showReview(20413028, 'full');", "Date": "Sep 27, 2008", "ReviewID": "UR746021251", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "tarepanda-a"}, {"Content": "Ottimo   showReview(19637222, 'full');", "Date": "Aug 27, 2008", "ReviewID": "UR934701177", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Edles Hotel in guter Lage   showReview(18534346, 'full');", "Date": "Jul 8, 2008", "ReviewID": "UR179802155", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "une bonne surprise   showReview(17435698, 'full');", "Date": "Jun 2, 2008", "ReviewID": "UR196260717", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Il bellissimo panorama dalle camere,   showReview(14734877, 'full');", "Date": "Mar 7, 2008", "ReviewID": "UR353313867", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bellissimo hotel   showReview(13195416, 'full');", "Date": "Jan 4, 2008", "ReviewID": "UR228850196", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "j y retourne sans hesiter   showReview(11314129, 'full');", "Date": "Nov 21, 2007", "ReviewID": "UR521399952", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "servizio impeccabile   showReview(11369589, 'full');", "Date": "Oct 11, 2006", "ReviewID": "UR654059633", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "脿 recommander   showReview(11332938, 'full');", "Date": "Jul 24, 2006", "ReviewID": "UR676925633", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066444-d302299-r21961019-New_Hankyu_Hotel_Tokyo-Chuo_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "302299", "Price": "$250"}}