{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Wonderful view & large rooms”", "Author": "IdaJoh", "ReviewID": "UR139957272", "Content": "We stayed in a Delux room on the 7th floor with an excellent view of the Hong Kong skyline. The room & bathroom were very spacious, something which is rare for a hotel in Hong Kong. The room was clean and tidied every day. The only negative point about the rooms were the hard beds, making it a bit uncomfortable for someone who prefers a softer bed. The hotel is located 15 minutes walk from MTR Tsim Sha Tsui, which was ok. Along the way to the MTR station you can find plenty of places to have your breakfast (Delifrance, Subway, Starbucks). The location is very central and convenient - around Tsim Sha Tsui you can find large shopping malls with excellent restaurants. We had a great stay!", "Date": "September 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Very Nice Hotel”", "Author": "cedricbc", "ReviewID": "UR139732249", "Content": "I have been staying here for the last 5 years on my visits to Hong Kong. I have only stayed on the Nikko floors. The service has always been very good and they work hard to sort any problems you may encounter. the business centre is good on the Nikko floor but they charge for everything including a print out or using their computers. But the free food and drinks make up for it. after 10 security is a bit intense as they want to see a room key to get in the lobby. The views are excellent looking over the harbour and the mainland. everything is near by and across is an excellent piano bar called Modey's bar. all in all excellent hotel with 24 hour services.", "Date": "September 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Very nice; Location superb, view from the room excellent”", "Author": "fergalandorna", "ReviewID": "UR137162835", "Content": "We stopped for 4 nights at the hotel Nikko in Kawloon. We were so happy that we stayed on the Kawloon side of the Harbour instead of Hong Kong proper. The views are similar (full Hong Kong skyline) to the intercontential but for half the price. I have to say waking up at 4.30 am with a bit of jet lag, opening the curtains remotely and experiencing the full Hong Kong view without getting up was an excellent experience. The hotel being a Japanese chain has obviously excellent staff with very good manners. Rooms are spacious and very comfortable. Only qualms were that the hotel's outdoor roof pool looked a bit dodgy though in fairness it was empty, as it was the wrong time of year. The restaurant on top of the hotel has quite incredible views; though we did have to sort out our server as she was quite cheeky. Also recommend making the effort to walk five minutes to see the spectacular light show projected each evening. Looking forward to staying at this hotel again.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Wonderful View of Harbour”", "Author": "Marc_C433", "ReviewID": "UR134674590", "Content": "Good Hotel on Mody Road, can see most of Harbour from the hotel, very Japanese in culture, breakfast good. Double rooms do not have two double beds only large singles. Club Floor excellent. Easy walking to shopping in Nathan Road.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worcester, Massachusetts", "Title": "“Pleasant stay at a Japanese Hotel in Hong Kong”", "Author": "orelse2", "ReviewID": "UR134266558", "Content": "I chose the Hotel Nikko for my first (business) trip to Hong Kong based on price, location, and reviews. It met all of my expectations. I booked a harbor view room for a reasonable price increment over a standard room. It was large with some Japanese touches (slippers, tea kettle), well maintained and very clean, with a great view. The advance booking price was good for Hong Kong which is an expensive city. I would definitely stay there again. The express train and free shuttle bus from the Hong Kong airport to the hotel worked great.", "Date": "July 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Good business stay”", "Author": "traveldizzy", "ReviewID": "UR133058320", "Content": "Stayed in Hotel Nikko for 8 days and is located in East Tsim Sha Tsui overlooking beautiful Victoria Harbour and Hong Kong Island. However, the given room was facing at building Mody Road on the executive (Business) floor, which I was not that happy about. However it was a good size and although felt slightly dated. It it slightly away from the hustle and bustle of central Kowloon (i.e. Nathan road and surroundings) but close to all the things you would need, shops, restaurants, pharmacy, bars,7 Eleven :) and yes Bespoke Tailors, they are everywhere, i know!! The business lounge was at the smaller side and less selection. There's a pool on the roof top but the water was cold for March and unfortunately the weather was poor then. Raining! Taxis are available at the doorsteps, buses, MTR (East Tsim Sha Tsui and Tsim Sha Tsui via underground) are nearby. Also walking distance to is Hung Hom. Hotel Nikko is near a Cross Harber Tunnel which came in handy when going to Causeway bay (Hong Kong Island) The staff at the business lounge were helpful willing to do especially when given a bit of a push. Maybe was only for me. Although the price was to the higher side I would recommend this hotel for the comfort Actual stay March 2012", "Date": "June 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "sidhiel@gmail.com", "Title": "“Honeymoon hotel”", "Author": "DocRenzFelipe", "ReviewID": "UR131628879", "Content": "My husband and I stayed here for our 5-day honeymoon in Hongkong. We chose Nikko despite the relatively high price because of its reputation, and because of its superb location. We were not disappointed. When we got there, the receptionists were very friendly and accommodating, and when they learned that we were honeymooning, they even upgraded our room! The room itself was actually nothing special; a bit cramped, but clean, with a good view. The best part that since it was in the middle of Tsim Sha Tsui, we could just walk to the nearest attractions and shops, even at night. We had a lot of fun exploring the area. It definitely contributed to our experience in Hongkong.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“hard times for \"old reliable\"”", "Author": "Rob R", "ReviewID": "UR130491007", "Content": "I fear my once loved hotel chain has developed a weak link. The evidence was first presented at check-in after 15 hours of travel i waited on a short line at registration only to be sent up to the 14th floor business center to register. I thought my hosts had arranged an upgrade. When i arrived i was seated by a window overlooking the harbor in their club lounge (business Center) and offered a hard sell to purchase an upgrade package which included breakfast and comp internet access. Not at all amused by the classless tactic, i opted to stay in my originally confirmed and prepaid room. The whole process rubbed me the wrong way so i called a very apologetic on duty manager who offered to bring my up a bottle of wine for purchase. I assumed this faux pas was more of a grammatical error and wrote it off. The room is badly out of date and the smell of mildew in the carpet was instantly apparent and never faded with my stay. in-room amenities are few including packets of instant coffee which i more readily associate with a cheap motel. I ordered a coffee at the Cafe down on the second floor and was charged 65HK for a small paper cup of coffee filled half way....i smiled because I could not believe it. Internet was initially slow and after a visit from two staff members it improved well enough for me to post this assessment. I am in day 2 of a two night stay and do not hold much hope that my experience will improve.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“\"Old Reliable\"”", "Author": "ChristMelbourne", "ReviewID": "UR130207687", "Content": "We have stayed at this Hotel once each year for the last 3 years and we have been very satisfied with the friendly staff ,the quality of the accommodation and the courtesy of the staff. We were in a Club room on the 14th. floor, which room we found to be quickly serviced each day by the young staff. The room was large, clean and quiet. We recommend the Club room and the Club Lounge which provides food and drink all day long in pleasant surroundings with a beautiful view over the water to wards Hong Kong Island. The Hotel provides a shuttle bus to the harbour about 5 minutes away.The harbour is only about 10 minutres walk away anyway. There are plenty of good restaurants close by as well as a Duty Free Store directly opposite.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Still the best in Kowloon”", "Author": "DviaTraveler", "ReviewID": "UR130159290", "Content": "Service is impeccable, even for Hong Kong standards. Got upgraded to a harbor view room. WOW! Great shopping. Phenomenal location, superb value!", "Date": "May 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Town", "Title": "“Nice Surprise”", "Author": "Loots49", "ReviewID": "UR130093182", "Content": "Decided to stay here despite some negative reviews and not the best of ratings either. Stayed in an executive room with harbour view and access to executive lounge. Will definetely stay here again: efficient service, free shuttle bus to harbour and MTR station. Plenty of nice restaurants and pubs in immediate vicinity. This was my 4th stay in Hong Kong and, although quite expensive, I will look no further next time.", "Date": "May 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Not terrible but not good”", "Author": "JessicaLeopard", "ReviewID": "UR129720080", "Content": "It's clean I guess, but our rooms smelled a bit of mold. The decor is outdated and starting to look a bit worn. You have to pay $17/night to get on the internet which is not that great a connection and you can only use it on 2 devices, more devices cost extra. You can't get internet free anywhere in the hotel, not even the lobby so you don't have a choice but to pay. The hotel has somewhat of a bay view but it's all the way at the end of the strip, so the views are not the best. Shangri-la has much better rooms and views. It's also kind of disconnected from the shopping and a little bit of a walk to get to anything. I have to say for the price we paid and for my other experiences at Nikko Hotels this was lacking. I think the Nikko Hotels are sliding in general, my last stay at one in San Francisco yielded a similar experience. I guess their heyday was in the 90's and they haven't really kept them up since. Oh and the beds are HARD AS A ROCK. For my money, I'll stay at the Butterfly with nice beds and free wifi.", "Date": "May 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Wonderful Stay”", "Author": "cgsaturday", "ReviewID": "UR129569412", "Content": "Hotel Nikko Hong Kong was a wonderful experience. For the most part the staff was excellent and very friendly and the amenities were in good order. After reading reviews prior to staying I was a bit nervous but once we arrived to our room, those worries vanished. Breakfast, though expensive ($35 USD) was actually quite good and enjoyable. The internet issue is a pain for those not expecting it. I purchased a SIM card at the airport for my cell phone and tethered via bluetooth the whole week. For an entire week of data browsing it cost me around $15 USD. Considering the hotel charges nightly for internet, this was a great deal. Great place - highly recommend.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“dash Liverpool”", "Author": "dashAlicante", "ReviewID": "UR128519716", "Content": "Excellent Hotel. efficient check in. Very grand decor and the staff so pleasant and helpful. Our room overlooked the harbour and breakfast was excellent.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beijing, China", "Title": "“Comfortable stay in Kowloon”", "Author": "nomadsbynature", "ReviewID": "UR127862991", "Content": "The Nikko is a reasonably well located hotel at the end of Mody Rd, about 10-15 minutes walk from the Intercontinental and the Avenue of the Stars. There are plenty of restaurants nearby to choose from. The room I stayed in was reasonably well sized, with a comfortable bed and a good bathroom. Complimentary water refreshed daily, fresh fruit in the room as well. A negative is the lack of free internet, even in the lobby or the lounge. The gym is well fitted out with weight machines, free weights, 3 treadmills, bikes and ellipticals. The Sky Lounge has a nice weight of Wan Chai and the cocktails are pretty good- try the Nikko Special. Overall a fine stay .", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jüri", "Title": "“Very nice”", "Author": "Angela_Aule", "ReviewID": "UR127023414", "Content": "Very nice hotel in Kowloon area. The service in the hotel is good, hotel rooms with good size! Breakfast is with good choise. Also have a drink in in Sky Lounge to enjoy the beautiful view to city.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good size rooms”", "Author": "peterm2911", "ReviewID": "UR126657286", "Content": "A feature of many of the hotels in Hong Kong are the small size rooms, when you are staying for a couple of days this can be a drag. The Nikko has good size rooms at a reasonable price. The decor and service is also good along with a reasonable breakfast buffet. Location in Kowloon is close to a number of bars and restaurants, easy to walk to. A bit of walk to star ferry terminal and Nathan road but nothing too hard, any way the taxis are cheap and plentiful if your feet are tired. One thing that annoys me with this hotel and with many hotels around the world is having to pay for broadband, in these days of mobile communications it should be included in the room rate. Other than that, I would recommend this hotel.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Cologne", "Title": "“Hidden but good”", "Author": "TomCologne", "ReviewID": "UR126226732", "Content": "I stayed in the Hong Kong favourites before (Island ShangriLa, Conrad, Peninsula, YMCA Salusbury, Langham Place). Somehow the Nikko was never on my radar screen. I must day the Nikko is good! Location is slightly less central and design is a bit \"boring\" (sorry). But rooms are very well equipped and LARGE for HK standards. I was upgraded to harbour view which was nice. Service is not overly \"devote\" but highly efficient. Facilities are well maintained. Harbour view is side of island and even minor services come at a charge (print boarding pass 7 hk$). Detail: food on the top flor bar ist best to be avoided: it travels long. I had the worst club sandwich ever with cold, soft fries sticking to a probably overheated plate. Apart from the bar, all good. I recommend the Nikko.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Central location in kawloon”", "Author": "668Anonymous", "ReviewID": "UR126174581", "Content": "Very good location Clean and comfertable, business room is pretty large in hk standards", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shelburne Falls, Massachusetts", "Title": "“Depends what you're looking for”", "Author": "solarchem", "ReviewID": "UR124512493", "Content": "I've stayed at the Nikko 3 or 4 times now and every stay has been enjoyable. This hotel is definitely showing it's age a bit as the furniture and carpeting all look a bit dated. The rooms are also on the smaller side compared to the newer upscale hotels. If shiny, new, and spacious are what you're after then this isn't the place for you. What you do get though is a very clean room, a courteous staff, and a location in Tsim Sha Tsui that's an easy walk to the MRT, harbor, and Nathan Road. All for a price that really can't be touched by the bigger names in the area. Last couple trips I've been given the option of upgrading to a \"club\" room after arriving which is a pretty good deal if you're traveling on business. $55 get you breakfast in the morning, internet access, and the club lounge where they serve snacks all day and free beer, wine and cocktails in the evening. Seeing as breakfast alone runs $30+ for the buffet it's pretty easy to get your money's worth. If I wasn't traveling on business and had more time I'd probably skip it though. The breakfast is just average or even slightly below. If I had more time in my mornings and it was my money I was spending I'd definitely be eating out in the city instead of trying to grab a quick bite in the hotel.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockport", "Title": "“Just as good second time around!”", "Author": "Xenos", "ReviewID": "UR124103390", "Content": "I've just returned from a 10-night stay at this hotel and would whole-heartedly reiterate what I put in my previous review two years ago. OK, it's not up there with the Peninsula or even the Shangri-Las, but for what you pay I don't think you can expect better value for money in what is a very expensive city. We stayed in a harbour view Nikko floor room again and once again it was well worth the extra. Yes, breakfast in the Nikko lounge is rather limited, but it's advertised as a business centre, so why would you want to breakfast there unless you were in a rush to grab a quick bite to eat before dashing off to a meeting? We found the full (free) breakfast buffet in the main Serena restaurant to be both extensive and appetisingly fresh and service there was nothing but friendly, efficient and polite. Maybe we were lucky (twice!), but our room was spotless and the toiletries, towels and fresh fruit etc, were replenished daily. I'm not easily pleased, but my only minor complaint was that the bed was a little too firm for my own personal taste, but I won't hesitate to stay there again next time I'm in Hong Kong.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Disliked”", "Author": "UneCharogne", "ReviewID": "UR123676451", "Content": "We booked quite expensive full harbour view room, but we got room with more of the city view. Room was very outdated, it had terrible moldy smell and one of the bathrobe had green mold stain on. The club lounge breakfast selection was a joke, the had only one kind of cheese, one kind of cheap salami, old bread, no eggs. The view from club lounge is great but breakfast was by far the worst I have ever experienced in club lounges. Next day we tried buffet breakfast downstairs, the selection was not much better, all the food looked very cheap. At 10:00 waiter walked around tables, announcing that we have only 30 minutes left to eat breakfast, which make me feel very uncomfortable. I have stayed in many hotels and this was the first time ever I was told to finish my breakfast before 10:30 because they really want to clean tables by 10:30. My husband witnessed a lady who came 15 minutes before closing time, she asked for bread (they already took it away) and the waiter just turned and walked away from her.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“We loved this place!”", "Author": "Joy B", "ReviewID": "UR122935640", "Content": "This was ourfirst hotel stay of several in Hong Kong/Macau and China and it was one of our favourites! I agree the room was dated and smallish for 3 people and yes looked a little less shiney in places BUT the staff were as accommodating as they possibly could be from Room Service, to Concierge, Check in & out and the daily breakfast included in room rate was great value. We had a harbour view room which was lovely. The hotel is close to everything but far enough away that the noise of traffic is not a problem as it is in alot of hotels in such condensed places. The beds are firm, perhaps ask for an extra blanket to put under you if this is going to be a problem - all beds that we slept on in China were firmer than we were used to. We walked twice as much during the day so when we went to bed we were so tired we slept.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great view - mixed decor”", "Author": "GlobalNomadLondon71", "ReviewID": "UR122585820", "Content": "Stayed for three nights in early Jan 2012 - booked a Harbour View room and got one on the 12th floor. Nice: Access to Nikko Lounge, view from the room, great shower (brilliant water pressure), large bath, location, good breakfast choice (included in room rate), free broadband, 50% laundry discount Not-so-nice: Bed on the firmer side, dated decor and marked carpets, somewhat indifferent staff So overall the HKD 2.1k/night seemed OK compared to similar properties in NY/London especially given it included breakfast and broadband To be honest I would have marked this hotel as \"Good\" if there was an option to do so as it really falls between Average and Very Good!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great value hotel in Tsim Sha Tsui”", "Author": "ggmackellogg", "ReviewID": "UR122545727", "Content": "I travelled to HK in late December and stayed there until early January 2012. Really glad with Hotel Nikko as a choice. Great value for money. We were 3 adults travelling. We were 3 and we got the Moderate Hotel room at the Nikko Floor. We got this via Expedia USA. Here's are some of the awesome positives about this hotel: 1. This hotel had top notch service. The bathroom had a stack of amenities that were regularly replaced. This included a shave, cream, toothbrush, toothpaste, and the usual hotel stuff (soap, shampoo, conditioner, shower cap), etc. For electronics needs such as a universal adapter, just call housekeeping/front desk and they will provide not just one but as many adapters as needed. I needed an iron w/ ironing board and got that promptly too. 2. Toilet had a Toto Washlet S300 which had an automatic back and front cleaner, with adjustable pressure and oscillator. Need I say more? 3. Free complimentary water and fruits everyday. 4. Free Internet and wifi in the room. I am not sure if this is just a Nikko Floor (Floors 10, 11 and 12) amenity. 5. Free buffet breakfast. We had two free breakfast included in our package. Good value. Had american, continental, Japanese, Chinese, juices/drinks stations. 6. Location wise, it is just a 5 minute walk to the Tsim Sha Tsui east MTR station. That station is huge though. The nearest Exit is Exit G / Entrance G near the WingOn Centre and Shangri-La Kowloon Hotel. 7. There's a complimentary shuttle every 15-20 minutes to some areas in Kowloon like the Ocean Terminal. 8. The Hotel is part of the Airport Express system. The Airport express is a train from the HK International Airport to the Airport Stations in HK Central and Kowloon. From the Kowloon Station, there is a complimentary shuttle every 15 minutes that goes to the Hotel Nikko. The depot is K3 (at the Kowloon airport express station). 9. Lots of restaurants nearby but if you want easy access to good Asian food, just walk to Chatham road which has tons of restaurants. There is a grocery store nearby too in the area in front of the Intercontinental (hotel beside Nikko). It is called International. 10. Excellent concierge service. My mom needed the schedule of masses at a nearby Catholic church. They printed out the schedule for her. 11. Very near to the harbour walkway that gives breathtaking views of the HK skyline. Check the Avenue of the Stars area. 12. We booked for December. Usually, hotels at this time of the year, especially 4 star hotels are very expensive. But Nikko was probably the least expensive among the 4 star hotels in the Tsim Sha Tsui and Central areas. A real value for money. 13. Nice flat screen TV. I think it was 40 inches. 14. Free slippers, bathrobes, and kimonos provided. 15. Lastly, as an added bonus, our room was at the Nikko floor. This gave us free access to the Nikko Executive Lounge which has a full stunning view of the HK skyline. Between 4-6 pm, we had free food as bonus. Free food includes free beer (I saw 8 different types including Foster, Guinness, Tsing Tao, San Miguel, Sapporo, etc.). There's free juices, coffee, and tea. Free Haagen Dazs ice cream. Cookies, breads...really depends on the day. New Years' eve day was awesome though - - they had canapes, champagne, wine, hard liquors, lobster, dim sum, etc. A few negatives: 1. So-so lobby. 2. Rooms were a little small. Because the hotel was fully booked, they had no additional extra beds to give out (all taken). We needed an extra bed because we were 3. We thought of upgrading but they said their biggest room will not be able to accommodate an extra bed unless the couch was taken out (these are for rooms with 2 twin beds . . .I believe they call those twin beds a \"queen\"). With a little creative tinkering, I was able to make the couch into a bed (connect the couch and the footstool to one of the beds and stack them with 4-5 pillows to make a bed. Just ask housekeeping for extra pillows). Overall: 5 stars. Can't beat the value and location for the price . . .especially during the extremely expensive holiday season. Highly recommended.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Lovely, environmentally-friendly hotel”", "Author": "oreodunker", "ReviewID": "UR122308877", "Content": "I loved the Hotel Nikko. Location was good, only about a 5-minute walk away from East Tsimshatsui MTR station and nearby, you have the shopping district. The room was great with a very comfortable bed but I found the pillows too soft for my liking. The bathroom had a bathtub and separate shower cubicle with the necessary toiletries and lots of towels. Service staff were friendly, helpful and knowledgable of the area when we asked where we could get some shopping done. Cafe Serena also had a good intercontinental breakfast buffet with a wide selection of dishes to choose from. What I liked most about the hotel is its attempt to be more environmentally-friendly. Guests can choose when to change their bedsheets or towels using a simple system the hotel has devised. I applaud them for their efforts. However, if you wanted Wi-FI you had to pay for it. Though I find that this is the norm nowadays, I still wish hotels would offer free Wi-Fi to their guests. After all, we're already paying so much for the room. Even a small hotel in Batam, Indonesia manages to provide this service so I don't see why a well-known hotel like Nikko cannot. Luckily, I could get free Wi-Fi at the conference venue and down the road at Starbucks so I didn't have to shell out any money. Still, all things considered, it was an excellent stay.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful hotel, Great staff!”", "Author": "Jtandor", "ReviewID": "UR121994183", "Content": "We really enjoyed our stay.. Definitly recommend the club level upgrade! ;)", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Spacious rooms, great view and decent location”", "Author": "flamboyant624", "ReviewID": "UR121688020", "Content": "stayed in the hotel for 2 nights and liked it. The hotel was grand, service was good (Cant say the same for the breakfast though, very limited options for indian vegetarians and they didnt accomodate even upon request. No veg bread also to have atleast the toast). Hotel is located in the tsim sha tsui and is close to prime shopping locations of the district. Not so close to the Metro though, but a 15 minutes walk, which is alright. The rooms were spacious as per the HK standard and had all the facilities. Loved the toilet, it had heated seats and was electronically operated. The rooms seemed a bit old, but was clean and nice so didnt mind it. However if they refurbish, it will be a great hotel overall.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice experience”", "Author": "nervosa", "ReviewID": "UR121051586", "Content": "The hotel is clean with good service. the location is convenient for business in kowloon since its a walking distance from resturants and cafes. the top floor swimming pool is nice. Massage was great, when I asked to be in the room. Expensive but very relaxing, One of the best massage I had in my life. Only one small issue which might have happened by a mistake, during my checking-out, the receptionist didnt give me my credit card back right away, I waited for 2 minutes after he gave me the invoice, the I asked for my credite card, he brought it from under some papers at the desk, I could have forgetten my card at the hotel !!!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Excellent hotel, if anything a little dated”", "Author": "braddeluca", "ReviewID": "UR121037432", "Content": "What a hotel room! Very good service at check in and concierge was very helpful making sure we only got in taxis that knew where they were going! Hotel was excellent, very good breakfast. Maybe the bed was a little firm... But regardless it was an excellent room, and I was upgraded to a suite!", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Nice hotel but bit dated”", "Author": "OZinNY", "ReviewID": "UR120280714", "Content": "This hotel is located on the Kowloon side of Hong Kong and is not very close to public transport. It is a hike to get to the closest MTR station. However, there are abundant taxis and the hotel provides a free shuttle bus to the MTR, Star Ferry and main shopping centres. The hotel is close to the HK Science Museum and the factory outlet stores on Granville Road. The view of the harbour from the hotel is great if you score a room on a high floor facing in the right direction! If you are a Starwood Preferred member then you will likely be able to request a harbour view room without extra cost. One important reason for getting a room with a harbour view is to get a front row seat for the nightly (8 pm) \"A Symphony of Lights\". This is spectacular and caps off a day's sightseeing before you head off for dinner! The service in this Nikko hotel is excellent and the rooms was comfortable though dated.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Panaji, India", "Title": "“Great Bussiness Hotel”", "Author": "ralino", "ReviewID": "UR120146512", "Content": "Stayed at the Nikko Hongkong, great location for business and pleasure , however the hotel was always crowded and lobby space too small Food and beverages good . Food more of the eastern variety service a bit slow otherwise the locations makes up for any lapses,.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Dependable Japanese-oriented hotel with great location”", "Author": "bsimosd", "ReviewID": "UR119834758", "Content": "If you enjoy views, pay extra for a harborview room overlooking Victoria Harbor and Hong Kong Island. In addition to all of the shipping sailing by, the lighting on the Hong Kong buildings are amazing. The hotel is a little older, but well kept up. The breakfast buffet was geared towards Japanese clients, but still was very good. Access to the nearby walkway along the harbor is convenient, and very entertaining with statues to China's movie industry and stars.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Hotel, especially with the Nikko Floor option”", "Author": "Keena_b", "ReviewID": "UR119374851", "Content": "We stayed at the Nikko in March. Loved the location. Close to transit / ferry. Nice views of the harbour. The Nikko floor is a must - provides access to the Nikko lounge with complimentary continental breakfast, all-day refreshments, evening cocktails and hors d'oeuvres. The lounge is small and can get crowded. Staff was friendly and helpful.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "adelaide", "Title": "“Hotel Nikko Floor is great!”", "Author": "Phil_Adelaide_18", "ReviewID": "UR119349348", "Content": "Before we went to Hong Kong we read on Trip Advisor about the value of booking the Nikko Floor. Boy were we glad we read that revue as we followed the advice and I can only say that it was fantastic advice! The Hotel Nikko Floor provides you with complimentary breakfast and high speed wireless internet. In addition you have access to the business lounge throughout the day where you can have nibbles and refreshments. From 6-9 pm complimentary cocktails are served along with some nice food, while you have a magnificent view over Hong Kong Harbour. We booked the Harbour view rooms on the Nikko Floor and had a good view of the harbour. The rooms are nicely appointed, well maintained and extremely comfortable. We found the Concierge extremely helpful and very polite. We also organised transfer from the airport through the hotel which was all well arranged. As there were four of us travelling and we arrived in Hong Kong late at night I would strongly recommend others in similar circumstances to take advatage of this service. There is a fee charged but it was certainly worth it for the great service we received. I have read other reports on the location of the hotel with some saying it is a bit far away from key areas in Hong Kong. There is no doubt that is a ten to fifteen minute walk to the Star Ferry terminal if you are wanting to go to Hong Kong Island or about the same distance to the main shopping areas, but we found the walks very pleasant with lots to see on the way so this in my view is not an issue when that is balanced with the great hotel, service, view and great value when you book the Nikko room. We would certainly go back to the Nikko Hotel in Hong Kong next time we visit and certainly recommend it highly to others.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Harbour Views from Nikko Floor”", "Author": "DandNK", "ReviewID": "UR118983849", "Content": "This was our 3rd visit to Hong Kong. We stayed in a Nikko Club Room with Harbour View at the end of September 2011 and were initially very impressed with the Hotel and room, the room was a good size, good size TV however the bed was extremely hard, the bathroom was clean however a bit dated, housekeeping and room service were excellent. The Club Lounge was one of the smallest we have ever been too, the breakfast and evening canapes in the Lounge were minimal, however the evening drinks were very good and an excellent view of the Harbour. You have the option of breakfast in the Club Lounge or Restaurant included, we did not bother with the breakfast in the Club Lounge as it was only really cereal, instead went to the restaurant where there was a huge selection, although if you had to pay was expensive at $HK462 for 2 people. We didn't really find the location convenient as it is not close to anything other than a few restaurants, we thought our previous stays on Nathan Road and Mong Kok near Ladies Market much better locations.", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Average”", "Author": "indy2205", "ReviewID": "UR117613671", "Content": "I stayed just one night, It was a great idea to pay more and stay in the Nikko's floor where you have wi fi, breakfast included, and cocktails with cookies and other things to eat during all day in their lounge, with a very good view in spite the lounge is not so big. Be smart and book a room with the harbor view, otherwise your window will be facing to the street, and HK is worth to pay a room with a view. The best thing of the hotel is the location, all the other things are like of an average hotel. Rooms are not so big but they have just what you need. Breakfast is not good at all although they have variety, but they do not have quality at all, the eggs were fluffy, the bacon was totally hard and cold, bakery was not good at all, and personnell from breakfast floor was so unpolite that they were taking away the food while the people was having breakfast in the tables. So half of the breakfast was already covered or gone, and it was still half hour before breakfast closes. Ladies from Nikko floor very polite. Too expensive for the service they bring. (harbor view rooms, nikko floor).", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "MUMBAI", "Title": "“Good Hotel”", "Author": "HITESHSADH", "ReviewID": "UR117272360", "Content": "I stayed in this hotel for 2 nights. Hotel is on the main street with good access to everywhere. Many Indian restaurants close by walking distance. hotel is nice & clean. My kids loved the pool on the top of the hotel with a nice sauna room.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Malaysia", "Title": "“Average room and location”", "Author": "Charlie8888", "ReviewID": "UR117013036", "Content": "Location is average only - 15 minutes walk to MRT. Nothing much around that area. Room is aged but clean.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Indore, India", "Title": "“Best hotel for sightseeing, business and honeymoon!Value for money!”", "Author": "shirin_cn", "ReviewID": "UR115829801", "Content": "1. Direct book from hotel or any other travel agent is same, while checking out, hotel gifted two bottles of wine free; 2. From the room, you can see the vitrolia night view, and the star avenue of Tsing Sha Chui; 3. Very comfortable room and very spacious, not as small and tiny room like other hotels in hongkong, you will be surprising after seeing the room; 4. Only 5 min. walk to Tsing Sha Chui shopping area; 5. Lot of reasonable fast food shops nearby, Mcdonald and KFC, as well as the currency exchange agents; 6. No free internet;", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "cagliari", "Title": "“Great service”", "Author": "sibi4", "ReviewID": "UR115787333", "Content": "I was at nikko for a week. The room with harbour view was large, clean and very nice. Nice, clean, modern bathroom. The room service was fast and efficient, the food was rather good. It was nice to have free fruit and water in such a hot weather. The swimming pool is ok, given the fact it is on the rooftop.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Thane, India", "Title": "“I liked it”", "Author": "ranjumohank", "ReviewID": "UR115755734", "Content": "Conviniently located for shopping and good food.The staff is courteous and check in service is quite quick . The meeting room had a great view and so one could have a eyebreak witout getting bored. The rooms are spacious and clean ,the bathroom amenities are not great considering the rates one pays .", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Not a new hotel, not bad, but not great”", "Author": "ms_Dewijakarta", "ReviewID": "UR115734380", "Content": "We were staying at the 14th floor which is a club floor. This means that you can consume food and beverages provided by the lounge with no extra cost from 7 am to 11pm. The food and beverages are of regular standards. Nothing fancy in a sense that its just like a business class airport lounge. You get to eat as many haagen dazs ice cream to your hearts content. Location wise, its not as strategic as, say marcopolo hotel which is in a more conventient and strategic location of canton road. in order to get to harbour city mall they have a free shuttle bus that leaves every 30 minutes. The lobby is crowded most of the time and since we are at the club floors we check in on the 14th floor. the lady that check us in are not as hospitable as I would think a so called \"five star service\" should be, We got a free wifi at the 14th floor. Breakfast are extremely expensive (850 hkd for four including tax). unless you have include breakfast in your accomodation fare , i do not think its worth it. The king size bed room is small. the twin share bedrooms are slightly bigger . however the size of the beds are two singles instead of two twin share size beds. however they have a two seater sofa on the side which you can pull down as an extra bed. Overall an ok stay if you know your way around. But as for me, I 'd prefer to stay on a canton road side of hong kong.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“CANT ASK FOR MORE”", "Author": "ahuja02", "ReviewID": "UR115663909", "Content": "had booked a room for HKD 1800 , i was not getting a room for less than this amount , have been to hongkong to several times and usually stay at rooms costing 1200- 1500 , but this time wasnt getting anything cheap , but after a lot of searches zeroed in , for this hotel , and i think was one of my wisest decisions of recent times , very close to HUNG HOM station , very convenient if you are coming from china as i did, hotel is located very conveniently ,you could reach anywhere in Tsim sha Tsui for minimum taxi fare of HKD 20, including the 2 MTR stations. upon arrival to hotel was happily surprised to see the lobby and location of hotel just opposite harbor , just took a chance by asking the lady at the reception to give us a harbour facing room , which she simply said wasnt possible as hotel was fully booked , we said ok , but i dont know what came to her mind and she said if we could wait for 1 hour she would give us a harbour facing room , as it is we had go for a business meeting we said was ok for us and left the luggage in lobby , upon return we were surprised when we entered our room as not only it was a harbor facing room , but it was a suite , with a very big living room. one living room , one bedroom 2 bathrooms, 2 42' lcd tv's room had remote controlled curtains awesome view of harbour , master bedroom's bath was bigger than average size room oh hotels in Hk , with full size jacuzzi tub , seperate shower / steam area, fully automated toilet seat was a surprise element , with drier , heater and auto cleaning system , lol , felt we got worth of every penny spent as we got a 2700 HKD room for just 1800 HKD , close by DFS galleria, subway and many hip bars and clubs , not to be missed was a SKYBAR on top floor of hotel with magnificent view of harbor , if you can afford it go for this Japanese hospitality chain.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Fantastic”", "Author": "AnelaWings", "ReviewID": "UR115348927", "Content": "The location was perfect. Many of the places I needed to go was within walking distance. The service was great overall.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Oslo", "Title": "“Top Service”", "Author": "soda1123", "ReviewID": "UR115002467", "Content": "We stayed a week and our \"Harbour View\" room sure had a fantastic view. The room itself was quite ordinary. How can a couple order roomservice with only one chair? Top service all the way and two ties left behing came home by mail. The room maid service was top. The swimming pool was closed due to thypoon warning.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "new york, ny", "Title": "“Very solid!”", "Author": "flippyfloppy1", "ReviewID": "UR114884605", "Content": "Stayed here for one night, and all around the experience was positive. The lobby and top-floor bar are stylish and filled with people, and the rooms are handsome, clean, and large for HK. The Kowloon location makes for good access to TST.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Dunfermline, Fife", "Title": "“Great Hotel to stay in for a stopover”", "Author": "CandDP", "ReviewID": "UR113473506", "Content": "We stayed in the Nikko Hotel for two nights on our way to Austalia. We had a beautiful and very comfortable room. When checking in we were told to go to the 14th floor and were met there by two very nice young ladies. We were told we could have an upgrade on our room but the downside was we would have to pay another HK$60 per night. We declined the offer as we didn't intend staying in our room except to sleep at night. We didn't need a view of the harbour. We used the hotel free shuttle bus to take us to the port to go on the Star Ferry to HK Island on day two. The bus takes minutes and the driver tells you the times he returns to return to pick you up. It's around every 30 minutes or so. The ferry just takes minutes as well. We did the Red bus tour on HK Island and went up Victoria Peak which is worth while. We ate breakfast in a lovely little cafe just a few shops along from the hotel and we had dinner across the road in nice restaurants both nights. We finished off the 2nd day by having a cocktail in the Sky Lounge in the hotel which has beautiful views over to the Island.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great Hotel to stay in Kowloon”", "Author": "OzBrian", "ReviewID": "UR111559420", "Content": "We only stayed at this hotel because it came packaged with airfares but we are glad we did. When we arrived we were asked if we wanted to upgrade to a harbour view room for $40 a night which we did. The room was very spacious and had a marble bathroom that was almost as large as the bedroom. Language was a slight barrier but service was excellent. Restaurants were lovely. We had breakfast in the Serena and had dinner in Toh Lee. One day we even had a high tea at the Nikko which was truly superb. Beds were comfortable, LCD TV, etc. everything you would expect in a good hotel. It's close enough to walk down to the cultural centre and space museum and was handy enough for all transport. One thing with a harbour view room is that quite often it was that foggy/smoggy that you couldn't see across Victoria Harbour in any case.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Its a good value for money”", "Author": "bafnas123", "ReviewID": "UR111254823", "Content": "I stayed there on 14th floor Nikko lounge room. Well equiped business center with free snax whole day.Free internet and breakfast with reasonable price. Very near to all Kawloon Business center. Good view and neat and clean everything.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "UAE and China", "Title": "“Started badly and went downhill from there”", "Author": "LanPing", "ReviewID": "UR110239343", "Content": "Checked in at 11.30pm, some time after my wife had arrived, and was immediately accosted in the lift by two very insistent professional ladies, who appeared to be offering some form of wandering massage service and didn't really want to take \"No\" for an answer. The staff all knew they were there, and they appear to have established a local franchise cruising the lifts in search of clientele. Not nice, though Strauss Kahn might have appreciated it. We had been \"upgraded\" to a room on the 14th floor without a view and backing onto the service lifts for the kitchens, which kicked into action a little after 5.30 am and the noise was deafening. Boxes, barrels, bins - Lord knows what else. Maybe it was just a noisy massage? My Wife tried to make a coffee and there wasn't any, just powdered Creamer, so I called the Concierge. No Answer. Called Housekeeping. No answer. Called the Front Desk and after several rings got through ~ \"it's in the tray next to the kettle\". No it isn't, that;s the problem. We'll send some up. 20 minutes waiting and I decided to go down to Reception to collect some - there were 6 bellhops, concierge's and a Meet & Greet lady milling around with nothing to do, so I asked to speak to a Manager. Why? Because I would like to make a complaint. Why? She eventually went off to get a Manager and after 15 minutes I gave up waiting and went outside for a coffee. When I returned I went to the Nikko Lounge (also on the 14th floor) and I asked to see the Manager, who duly arrived, and confirmed that he had just taken some Coffee Creamer to \"the woman\" in my room. I hastily confirmed that she was not a freelance masseuse, but my wife, and that what we were actually looking for was some coffee, not more powderd Creamer. He apologised and went and got some Nescafe. I mentioned the noisy lifts and he opened the door and showed me, as if to prove the point that I wasn't imagining it. I also mentioned the delays in communication and in contacting him and he confirmed that he had been busy - which is reasonable enough, but there was no offer of a comp breakfast, real coffee on the house, or any indication why the \"upgrade\" 14th floor features wall-to-wall hookers and service lifts. At check-out the handed us a bill in my wife's name, addressed as \"Mr.\" and initially declined to accept my HSBC debit card. I then discovered that they had played the same trick on my wife the previous evening, and were holding a RMB 2,400 cash deposit taken from her the evening before - against a pre-guaranteed & non-cancellable room rate just over half that amount. The ethnically Asian checkout girl insisted on speaking only Chinese and only to my (Chinese) wife, and then declared that she wasn't able to give us a tag receipt for our baggage (which we wished to leave with the Concierge) because they had run out. Next time we not only go to a hotel with instant coffee in the room, but one that provides a liquid approximation of real milk (e.g. \"Millac\", whatever that is) rather than powdered Creamer. This would be a good venue for an Asian remake of \"Fawlty Towers\"", "Date": "May 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Decent Place to stay”", "Author": "Ka0001ur", "ReviewID": "UR104197542", "Content": "The best thing about this hotel is its location, its situated on the waterfront. You can practically walk to a lot of good restaurants, shopping malls, bars and other places of interest from here. And its between two subway stations, using which once can get to majority of the other places in Hong Kong, and even Shenzhen. However its a hotel which caters mostly to business travelers so its probably not the best place to stay if traveling with family. On the whole a pretty solid place to stay.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Would recommend”", "Author": "Warrington2011", "ReviewID": "UR103989573", "Content": "Stayed here for four nights in September. It's nice. Free shuttle to Kowloon station. Competitively priced. Stunning lobby. Had a partial view of the bay. It is a little out of the way though. 20 mins walk from avenue of the stars.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“it was apractical hotel without too many luxuries”", "Author": "kristianhamb", "ReviewID": "UR103862433", "Content": "We stayed in one of the harbour view rooms, the view especially at night was great. Excellent location for shopping just 10 minutes to walk distance to Nathan Road, reasonable rates for internet, big rooms but we hope th gym and swiming pool stay open a bit longer. We will stay there again on next trip to Hongkong.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vienna, Austria", "Title": "“Only 2 stars -totally run down-very poor food and very ppor service”", "Author": "toversti", "ReviewID": "UR103376889", "Content": "This is a JAL airline own hotel which is totally run down. Poor beds and matrasses, terribly smelling bathrooms, lack of hygiene. Furniture and facalities totally outdated , smelling common areas. Tried all restaurants inside hotel as well as room service extremely poor food. You should never stay here...walk up the road 5 mins there is the Shangri-La excellent, or even next doors intercontinental is significantly better.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“EXCELLENT LOCATION, BUT AVERAGE IN OTHER DEPT.”", "Author": "jatin_Desai", "ReviewID": "UR103034833", "Content": "this is suppose to be a 4 star hotel. i had it booked for my honeymoon in end of may 2010. my brother suggested this hotel is good and he is geeting a good deal online, so he booked it for me. upon reaching the hotel, i was happy with the location, as it is pretty close to the TST market. but the service and customer satisfaction was zero !! i was so tired after the long overnight journey in plane, and just wanted to crash on bed in my room. but they made me wait for 10 minutes downstairs in the lobby, then they told me to go to top floor (i guess 12th or 15th floor) to go for check-in. there i was expecting to be promptly be given my room keys. but instead they started lecturing me on the benefits i will get if i upgrade my room by paying few hundred dollars !! i said i have already booked a deluxe room and kindly check-in. so after again trying to persuade me for 10 more minutes, they checked me in. while giving me the keys I was told they are giving me a complimentary upgrade as their deluxe rooms (which I had booked) where undergoing renovation.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great service but do not stay.”", "Author": "UrfanK", "ReviewID": "UR102507165", "Content": "I stayed here having read the other reviews, it seemed reasonably priced for HK so I booked. Trip started badly as the hotel car did not arrive at the airport to pick up, despite confirmation and all correct details. After an hour made alternative arrangements. The room when I checked in was very tired, carpets filthy with stains and had not been vacumed in a while. In the morning, I woke up covered in bed bug bites. I checked out first thing. Now the good, the hotel send complimentary room service for the delay with the taxi as I had arrived just before midnight. Second the manager did all he could to persuade me to stay. He was a paragon of courtesy and helpfulness but I was on a work trip and not willing to stay. The staff are superb, the hotel very tired. It is a real shame, with this staff and a massive refurbishment, this could be an outstanding place. Finally, the hotel is quite some way up the harbour so not really walking distance to Star Ferry etc or downtown Kowloon.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good value on Nikko Floor rooms”", "Author": "TRav100", "ReviewID": "UR102421262", "Content": "Stayed 3 nights and booked a room on 15th (Nikko) floor that comes with use of the Executive Lounge. Room was large and modern as was the bathroom, the latter having an amazing toilet with heated seat and front/rear washing and drying - crazy experience but apparently commonplace for Japaneses toilets, as we also found this even in public toilets when we were in Japan! We were given a corner room which had a semi view of harbour and sceince museum on the other side - quite good. Bed felt a little on hard side at first but in spite of that we sttill had very conmfortable sleeps, so no problem there. The service in the Executive Lounge was excellent right from check-in to check-out and I'd just like to mention Janis Lau who was a lovely friendly receptionist and also the 2 young girls (morning and evening shift) who served the drinks and tea - they were very good but I didn't catch their names - thanks for looking after us. Its well worth it to upgrade as their is drinks available all day - quality beers and tea/coffee as well as Ice Cream and biscuits and chocs. At 6pm they serve Dim Sum and any choice of drinks till 9pm - very good value and the food was lovely. Breakfast is also served there in the morning. The lounge is not large so you do need to arrive early if you want a seat. I have no complaints about the Nikko - the door staff who looked after the cases were friendly, as was the guy outside who'd worked there for 30 years. If I had to be picky I would say the Concierge could have been friendlier, but as in lots of big hotels Concierges only seem interested if they are getting tips! Finally, make sure you try the Sky Lounge up stairs for the most fantastic view of the Harbour! Would recommend this hotel - close to bars and easy to get around city!", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "delhi", "Title": "“Nice Hotel”", "Author": "parikshit", "ReviewID": "UR101334144", "Content": "Perfect place i stayed for 3 days and was awesome lovely sleep quality and overall service from food to internet. Staff was helpful and helped a lot the best way to a non local person. I would suggest to stay as its nice and in middle of most near by locations which is of great help to see the city", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Queensland", "Title": "“A Good Choice”", "Author": "Terryhazel", "ReviewID": "UR92149330", "Content": "We stayed in a Club Room for 5 nights on our way to Europe and felt that we had value for money. The staff were excellent and the view from our Habour View Room was lovely. The position is about 15 minutes walk along the water-front to the Star Ferry & the Entertainment Centre . There is a bridge across the busy road and then the walk is by the harbour and along The Avenue of Stars. The hotel also has a regular shuttle bus down to the ferry area.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Malaysia", "Title": "“Class of it's own”", "Author": "cglee6", "ReviewID": "UR91111113", "Content": "Though the hotel is located a distance away from all the hypes of TST, we were pleased that it provided us with the quietness and exclusiveness of a top class hotel. Staff there were friendly and eager to help, which is much appreciated. Most importantly, the room is clean and modern. Would definitely return for my next trip to Hong Kong. Value for money!", "Date": "December 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“This is the worst hotel experience I have ever had in Hong Kong”", "Author": "maxdatraveler", "ReviewID": "UR88138552", "Content": "This is truly the worst hotel experience I have ever had in HK. The service is horrid and pricing is outrageous. In addition to that, there was mold in my room; the staff did absolutely nothing about it and eventually I went to another hotel. Avoid this hotel at all costs!", "Date": "November 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“Highly Overrated”", "Author": "Nomadfre", "ReviewID": "UR87757873", "Content": "Old room and furniture smelled like mold. Hard mattress, jittery TV service, sub-par soaps and amenities. Gaudy decor reeks of 1987. Fruit and complimentary water in room the only redeeming quality. Nothing special here and I can't understand why it's rated so highly. Won't award points if you have a discounted rate. Was told to direct my complaints by writing a letter to the GM. Why bother? I just won't give them my future business. Back to the W.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "asti", "Title": "“fantastic!”", "Author": "bisu77", "ReviewID": "UR86585960", "Content": "this hotel is just over the top. they offer absolutely everything you could think of. room are spacious and very comfortable. amenities are excellent. complimentary tea and coffee as everywhere else but I have really appreciated complimentary fresh fruits in my room. food in restaurants is very good, breakfast is fantastic. staff is knoledgeble, helfpul and very friendly. location is ok, excellent view from the top but not too close to public transportation.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“wow”", "Author": "Taneja0", "ReviewID": "UR84177687", "Content": "It was fantastic awesome accoumodation, Our room has a best view of sea . Fortunately we were there when there was some particular day in hongkong last year, there was fire lighting overthere. They view from our room was awesome. They has restr on top floor with the beat view. Must Stay There", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "NSW", "Title": "“Great Experience.”", "Author": "raykez", "ReviewID": "UR81873476", "Content": "Not usually moved to write reviews but our stay at the Hotel Nikko was excellent. We paid a little more for Nikko Floor rooms and this was well worth it. The service was exceptional and the staff uniformly professional, pleasant and helpful. You are no more than a 10 minute walk to Nathan Road, close to Tsim Sha Tsui MTR station. The rooms are well appointed with an excellent sized room safe to hold those purchases that need locking away. All up a very good hotel experience.", "Date": "October 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Location & Free Shuttle Bus are value to the price”", "Author": "Olive-Wuhan", "ReviewID": "UR80928672", "Content": "Booked through Hotels.com, and stayed for 4 nights in Superior Twin room with 1*extra bed. There isn't any outraged luxury, however, it is just-enough facilities & services. Location is just across the Mody Rd, in front of DFS.Local noodle shops, subway, Starbucks, Mac, 7&11, Watsons and lots of other shops are located within walking distance. Free-shuttle bus brings you to Penninsular Htl, Harbour City, etc for complimentary. Don't need to walk to Subway station. Room itself was minimum furnished with small TV, SDB, slippers, bathrobe, wooden hungers, average minibar, hair drier, plenty of bathroom amenities. View from the room was not harbor view, unfortunately. Guests upstairs were making jumping noise, which means the sealing isn't well furnished. Housekeeping is done for make-up room & turn down. Housekeeping staff did vacuum the carpet every day although most of hotels don’t do so. Tried in-room dining service. Choose Nikko Fried Rice for 130HK$++. Delivery time was within 15 min. Ingredients were worth to try; big shrimps, BBQ pork, beautiful asparagus. Portion was enough for 2 adults. My family went up to 14th fl. to have a look at Sky Lounge. It was awesome view, according to them. Departure was very smooth with attentive luggage down. We left for HK airport at 22:00. We didn't face any hustles & bustles.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shanghai", "Title": "“Nikko is a cosy and comfortable place”", "Author": "Bustravel88", "ReviewID": "UR80118456", "Content": "This Kowloon hotel is really convenient when you need to catch an early morning ferry to Mainland China (5mn by taxi). Paperwork is smoothly dealt with at the front desk with a smile. The service is nice and effective. When you call reception, you request is promptly and professionaly handled. The hotel is very clean even if one can see it is not a brand new one. I was given a twin bed room and discored it when I arrived in the room. Switching to a king size bedroom was quickly handled. I also requested an adapter which was quickly delivered to my room. The seaview was a bit on the side but the storm was so strong that day that I did not see much. Anyway the bedding was good and I enjoyed a good sleep. Unfortunately, I did not have time to taste breakfast as I had to take a early ferry.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Oslo, Norway", "Title": "“Lousy Service and Quality”", "Author": "LOsfamily", "ReviewID": "UR79174396", "Content": "This is the worst hotel experience I have ever in HK. There are stings on bed and bathrobes, old towels ... and staff blocked into the room to check light while sleeping! Shuttle bus seat is extremely small. Complaint to the duty manager is useless as the GM is in Japan and they can only offer u a better view but smaller room! Staff can hardly speak appropriate English and the room service is very slow. As a frequent travel to HK, I would blacklist this hotel and there are better hotels at lower prices in TST for selection!", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "quanzhou", "Title": "“Nice Hotel,Good Experience”", "Author": "silkwayqz", "ReviewID": "UR73675930", "Content": "It's my second time to Hongkong and stayed in the hotel,the hotel locaition quit good and near the Salisbury Road,the duty free shop opposite to the hotel,room face to the harbour view and fantastic.Hotel Staff very helpful and friendly.Will back to this hotel next time.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bandung, Indonesia", "Title": "“Recommended”", "Author": "tuscanyid", "ReviewID": "UR71854752", "Content": "Stayed there on the purpose of taking a small family on a quick weekend holiday. This is a nice and comfortable hotel indeed. Got upgraded to the Nikko floor, the room size is very acceptable, and the extra technology the bathroom is so great to me. Location needs you to walk a little bit further to the MTR station, but as a city walker, it was not a problem at all. Overall, it is worth the price you paid for all the things you'll get :Location, Access, Service and Comfort.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good Location, Not Bad but Needs Improvement”", "Author": "Nathan K", "ReviewID": "UR68482269", "Content": "We stayed here for a few days this month on a combined work/holiday. We chose to stay here due to the fact that the Intercontinental next door was booked. They are completing some works in the Foyer, doesn't really disrupt your stay in any way. Upon Check-in they had a special where you could upgrade to a Harbour View Room for HK$220 (ish) per night so we took up this option. The room view from the 8th floor was nice, you did not get any noise from the road. The TV is very large and the layout is nice. The bathroom is looking a little tired but not dirty, so quite acceptable. We had drinks in the Sky Lounge on the 15th floor. Nice view and there is a happy hour until 8pm. Minimum charge to HK$150 after 9pm. Service from front desk staff was friendly and efficient. I did not have any issues with language that previous commenter's have made. The concierge may not be as connected as other hotels as I wanted to go to a special restaurant which the concierge at the Shangri-La was able to book me into on my last stay. No other suggestions were made however when he was unable to complete the booking. The only real downfall is the breakfast. Service is terrible. Staff are uninterested. Everytime we wanted a refill of tea or coffee we had to ask a staff member who had a look of affront on their face when we did. Food apart from the freshly cooked Omelette station was not good. As a result of breakfast, even when feeling too tired to go out we would not eat at this establishment. Our extra's bill was very small. Would we stay here again. Yes if the price was right. It was not terrible and overall it was ok. Enjoy yourself, unless it is included in your room rate don't bother with the breakfast establishment.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nikko - Very Good .”", "Author": "Zohanj85", "ReviewID": "UR64956459", "Content": "The service was great, the only issue is that not all of the hotel staff masters English, but you always find a way to explain yourself eventually. The rooms in the hotel are clean, the bathroom is huge and has both a shower and a bathtub. The hotel is a bit pricy but it worth the price, I will visit again.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Franklin, Massachusetts", "Title": "“2 week stay”", "Author": "HBF042806", "ReviewID": "UR63432989", "Content": "We have just returned after a 2 week stay at Hotel Nikko in TST East. After many years of staying elsewhere in Hong Kong, our selected hotel of choice had closed for renovations. We chose Hotel Nikko because of its location in TST East. We were not dissapointed and pleasantly surprised. We stayed on the Nikko Floor and enjoyed free internet and a buffet breakfast in the morning. We had a room right next to the elevator banks, but we did not hear any noise. The view was outstanding of the harbor and overlooking Hong Kong Island. The staff was superb, all bell man/door men would always open the door as you approach from the outside. Only two things I can think of that could be improved would be more available outlets in the room. With two people both with laptops, mobile phones, and camera, it was a struggle to keep everything charged. The other improvement would be to have more than two bath towels available. We will be staying here again.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tamworth", "Title": "“Good Location, but would not recommend”", "Author": "leatherlover", "ReviewID": "UR63405831", "Content": "Stayed here for 5 nights. It is a good central location with easy access to all transport links and shopping areas. Upgrade to the Nikko floor as it is worth it for the evenign drinks and snacks. Down side to this hotel, the service of the staff at breakfast. Breakfast is supposed to be served until 10.30am which in most hotels you can turn up until that time and be served. I arrived in most days just after 10am to be told repeatedly that breakfast was served until 10.30 and was basically made feel that I should eat as quick as possible and get out. I felt uncomfortable every day having my breakfast but I think the worst day was sunday when even the chef started packing up early. Becuase of the attitude of the staff in the breakfast room it totally put me off staying here again even though the rest of the hotel has a lot to offer.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Camas, Washington", "Title": "“great holiday hotel”", "Author": "mimijj", "ReviewID": "UR60960663", "Content": "stayed here to celebrate the chinese new year with my parents and my brother's family. wanted to have harbor view for my parents, but theirs was almost towards the corner area with a very far kind of harbor view. they were happy with it, but i thought we could've done better. (i would've asked for a change of room but due to different arrival times they had already checked in.) the rooms were very nice, huge bathroom. the shuttle buses were convenient and on time. conciege was accurate in providing some sightseeing and transportation information. did not have breakfast there as it's pricey, and we found really great bakeries right down the road. the location is good, but a bit farther from the MTR station than i'd expected, thought it would be within 10mn, but more than 15mn. worked out ok though. rates are a bit high but typical for a nikko. worth the harbor view? not sure, we didn't spend too much time in the roooms to enjoy the views. however, harbor view on the other side of the harbor would be double the price. all in all, a great nikko hotel.", "Date": "April 11, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "4.0"}, "AuthorLocation": "mumbai", "Title": "“ideal location opp siam paragon with sea animals”", "Author": "shahrahul", "ReviewID": "UR60843166", "Content": "good loaction clean rooms and near to mrt station worth staying herewithfamily near mbk", "Date": "April 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good hotel, not great!”", "Author": "KrishnaLondon", "ReviewID": "UR60524833", "Content": "good clean hotel, felt a little outdated, decor from the late 80's early 90's, few mins walk from the MTR station, easy access to taxis and shops nearby, decent sized rooms, big bathrooms - almost the size of the room but again a little old style. Didnt have breakfast in hotel, always went out, the Inter-Continental next door does a very good buffet..you have to pay for internet access here, a tip is to go to the Starbucks next door for a free 20min access if you have a laptop. The hotel was ideal for us since we needed 4 rooms for our family and was easily available at very good rates for the easter break. overall decent value for money. If you are keen on quality nightlife- clubs/bars etc, best to go to HongKong Central side - 20mins by cab - $90 HKD", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Hong Kong", "Title": "“Good but not good enough! You could enjoy a better location with this price.”", "Author": "Angelina-bunny", "ReviewID": "UR58941479", "Content": "My short stay there was good but not good enough. Our room was a harbour-view room. I have to say that the size was amazing. Even the washroom itself is probably larger than a standard room in some other hotels. After all it's Hong Kong! The reason why I give it 3 stars, however, is that the location is not worth its price. Nikko is minutes away from East Tsim Sha Tsui MTR. From there, you'll have to walk another long distance to get to Tsim Sha Tsui MTR. Well, I'm probably a bit lazy, but to be honest, I really perfer hotels where you can enjoy the views and nightlife right there! Also, the harbour view is not that good due to the location. It's too quiet (for Hong Kong) and not what I'm looking for. It is a good hotel but I would suggest that you spend a little time on the web and find another one located better with a similar price or one located not so good but much cheaper!", "Date": "March 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "philippines", "Title": "“clean rooms courteous staff but far”", "Author": "cleopatraManila", "ReviewID": "UR56437271", "Content": "stayed in this hotel form feb 13-15, in time to celebrate the chinese new year. we took the airport express train, then the hotel shuttle to tsim sha tsui, we were drop off at the peninsula hotel area and we have to walk to the hotel which is quite far. The hotel is clean, room is clean, staff are very helpful, there's a shuttle that leave every 30 mins to take you to the tsim sha stui area and you have to walk or take a cab going back to the hotel.Breakfast is okey. since its chinese new year on our second day, there's a free snack in the hotel lobby. overall , i think this hotel is not recommended for tourist who wants to shop because of the location, but i would recommend it to traveler who want quite place to stay and for business meetings and to meet friends after office hours in their beautiful harbourview sky lounge.", "Date": "February 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "India", "Title": "“Horrible service !!! No concept of \"Service with a smile\" !!!!”", "Author": "kookie256", "ReviewID": "UR53982500", "Content": "Great location but terrible service ! The staff behave and look like they are being forced to do their job. Terrible service ! All we are asking for is a smile and not grouchy faces all the time. Smile guys, you are in the service industry !!!", "Date": "January 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "India", "Title": "“HongKong Stay”", "Author": "Raspy888", "ReviewID": "UR53152038", "Content": "Nikko hotel is very conveniently located in Kowloon with the nearest MTR station only a short walk away. The rooms are clean and nicely done up and provided us with a pleasant and friendly stay. Right behind the hotel are various bars overlooking the harbour where one can unwind after a long day of shopping or business. The hotel was filled up with quite a lot of tourists. ALso the hotel provides a free shuttle service to the various main points of interest which makes travel very convenient. We didnt eat at the hotel except for room service which was pretty good. All in all it was a good stay and worth the money we spent.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Stockport", "Title": "“Excellent Value Hotel in a Good Location”", "Author": "Xenos", "ReviewID": "UR52688367", "Content": "We travelled to Hong Kong on 26 December for 7 nights. This was our 5th holiday in HK and, unfortunately, the Kowloon Shangri-La where we stayed on our last two visits had priced itself out of our range for this trip, so we had to look for a cheaper alternative. We got a great deal at the Nikko, just up the road, with harbour view rooms on the Nikko floor - which included full daily breakfast, all-day snacks with beer and soft drinks and very generously proportioned alcoholic drinks and dim sum in the evenings. The room price also included free wi-fi, a 10% discount at all the hotel’s bars and restaurants and separate check-in/check out facilities in the Nikko lounge to save queuing in reception. All this for HK$2,150 per night for 27-29/12 and HK$2,600 for 30/12-2/1 (about £173 / £210 currently), which was less than the price of a standard room-only at the Shangri-La. We were very pleasantly surprised by the standard of the hotel and although the rooms were a little smaller and the views not quite as spectacular as the Shangri-La’s, we though it was excellent value for money. It took an extra couple of minutes to walk to the Star Ferry pier and the MTR station, but hey, we were on holiday, so what’s the rush? There are loads of restaurants in the Tsim Sha Tsui area, but if you don't want to walk too far there's a wonderful Szechuan restaurant (called Sze Chue Wan I think!) in the South Seas shopping mall directly opposite the front of the hotel. I’d definitely recommend this hotel to anyone looking for somewhere around this price range and the Nikko floor upgrades were well worth paying the extra for!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Australia", "Title": "“Typically overpriced, middle of the road large hotel...”", "Author": "asiantraveller2009", "ReviewID": "UR50802634", "Content": "I had a friend book this hotel for me - from a Chinese language web site. We were just there for the one night on a visa run for the Children, as the Chinese visa in HK is far easier, cheaper and more fun! The best part of our stay was the rate. Our friend secured it for $700 HKD, but get this, the agency web site we used OPENLY states that Caucasian & Japanese customers pay and extra $300 HKD. I thought this to be highly discriminatory, and there is no way they would pursue this extra charge because I was white and not Asian. Alas, I was wrong, on check out they asked for my Chinese passport, as I had used my Western one to check-in. The duty manager explained to me that the rate I was quoted was a special \"promotion\" for Chinese guests...yeah right...anyway I produced my Chinese drivers license and said my Chinese passport was at the UK embassy getting a visa...problem solved. So the Caucasian paid the Asian rate...I had heard of this practice before but have never had such a blatant experience of it. As others have observed the carpets are really showing their age, the food is very middle of the road, and the 5* prices charged for room service, F&B and 'extras' are eye-popping. On the plus side it is very close to the train to mainland China, and a free shuttle to the Star Ferry. The door-man is a very nice guy - full of personality...other than that be sure you don't use the facilities of the hotel very much, as better, tastier and way cheaper is only a short walk away...", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great service in this hotel. Nice breakfast and we loved the Executive lounge!”", "Author": "qwertyPhilly", "ReviewID": "UR43959682", "Content": "Describe the service you experienced Great service. Staff friendly and typically wanted to go out of their way to help. We booked the hotel on hotels.com and got a reasonable rate. Upon check in we were ushered to the 14th floor where there was a \"special offer\" waiting for us. On the 14th floor is the \"Executive Lounge\" with free drinks galore and a fantastic view of the harbour. There is a check in desk in the lounge. The staff there offered us the chance to upgrade for an additional 550HKD per night (inc taxes) which in the end we decided to go for. This extra cost bought us a room on the Nikko floor, with a great view of the harbour, access to the executive lounge, breakfast, wifi etc. We're pleased we paid for the upgrade. Examples of good service include - staff always responsive when we called for extra hangers, water, towels. - On our final day our flight wasn't until midnight. However the staff let us use the shower and stay in the lounge until we left which was great. Tell us how you liked the room Room (1518) on the Nikko floor was nice and big with a huge bed. Lots of space in the room. Bathroom also huge - looked a bit dated but was clean with a good shower and nice toiletries. Liked the fact that that there was free water every day in the hotel. Loved the view of the harbour from the room. Talk about the location & amenities About a five minute walk from Tsim Sha Tsui MTR. Located near the Intercontinental/ShangriLa etc - all had nice bars/restaurants. View of the harbour from the hotel - can't quite see the Bank of China or IFC buildings though so can't see the light show at night. Wasn't a problem for us but depends on how desperate you are to have that view from your hotel! Amenities included a swimming pool on the top floor. From the top floor you have a view over the whole harbour. Pool was great and we went there every day. Shame it shuts at 7pm though which means you can't see the light show from the top. Say what you liked best & least Liked best- Executive lounge (cocktails and canapes from 7-9pm), beer and soft drinks there for the rest of the time, free wireless (in exec lounge and Nikko floor), friendly helpful staff, pool, view of harbour. Liked least - nothing really. With the price of the exec lounge it wasn't really that cheap though (approx 175 GBP per night).", "Date": "September 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Montreal", "Title": "“very nice hotel”", "Author": "val_destination", "ReviewID": "UR39964937", "Content": "I stayed here for one night in September 2008. The hotel is very modern and clean. The room was very nice and I had a great view of the harbour. The bathroom was huge! All in all, a very comfortable stay and a great breakfast in the morning.", "Date": "September 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Dubai", "Title": "“Lovely clean hotel, with great service!”", "Author": "fifidubai", "ReviewID": "UR38240044", "Content": "I stayed at this hotel in July 2009 and originally i only booked it as my office is directly across the road. The staff were really helpful at check in and i was really surprised at my room - it was huge, with a massive and extremely clean bathroom. The best part was the windows that look out to the harbour and is lovely to look at the lights at night. The staff were really helpful; for example - i discovered the taxi drivers don't really speak english and so the concierge wrote everywhere i wanted to go in chinese for me. I travelled to Macoa for a few days at the end of my trip and they held my extra bag for me until i returned for my pick up to the airport - free of charge. Overall, it was a great hotel to stay at...i couldnt complain about anything...and i would be happy to stay there for my next trip.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kent", "Title": "“Comfortable clean hotel”", "Author": "easternman", "ReviewID": "UR32164840", "Content": "Just recently stayed at the Nikko hotel & overall I was nicely impressed, my room was a harbour view room with a king size bed. The room was of a nice size and was clean & comfortable as it should be the bathroom was large & was marble with a separate shower. I would certainly recommend this hotel I cant understand why some people have given this hotel bad reviews as it was exactly as a 4 star hotel should be. I also used the sky lounge where you can relax and admire the Hong Kong skyline at night with a nice drink. My only negative point would be with the swimming pool area as there are no drinks or snacks on offer in fact it's quite a dull atmosphere by the pool area. Overall, a good quality hotel but I would also point out that Hong Kong chinese staff are not always overly friendly in this hotel but this can happen in any hotel in Hong Kong it's just the way they are. In terms of the local area loys of restaurants and bars within walking distance. BEWARE!!!! Please bear in mind that in this area late at night there are many prostitutes looking for business they manly come from mainland china looking to make money. If this is something that you would not be comfotable with then perhaps you might want to stay in another part of Kowloon or Hong Kong, otherwise the hotel Nikko was a good comfortable hotel mainly popular with Japanese guests as the Nikko chain is Japanese.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Basingstoke", "Title": "“Great Hotel in Kowloon”", "Author": "Travel4fun0164", "ReviewID": "UR31458865", "Content": "I stayed in the hotel in late May 2009 based on the reviews made by previous guests. I am very pleased with my choice as the hotel was excellent. I managed to grab a promotion deal that meant if we stayed two nights there was another free so we got three nights for the price of two. This was in the Deluxe double harbour view room and this worked out at about 75 pounds a night. When we arrived they tried to upgrade us to an Executive room which offered a slightly bigger room with breakfast and free internet and use of their executive lounge amongst a few other things for 500 HKD per day but we decided not to and pleased we did not as the room we eventually got was great. Very spacious with superb harbour views along with a large bathroom with seperate shower cubicle. Although the room was a little dated it was more than made up by its size and view. There was free fruit and water too which is always nice. It is very well situated with great links to shopping and ferry terminal which is useful if you need to get over the island which you will need to do if you want to go site seeing.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great hotel.”", "Author": "RRR93", "ReviewID": "UR30719430", "Content": "Found this hotel pretty much as described by other guests - very clean, quiet, nice size rooms etc. A couple of other positives - hotel is right on the water so you can go for great walks / jogs along the harbour. The hotel also has a terrific bar on the 15th floor - with fabulous views over the harbour (2 for 1 drinks at Happy Hour). There was water and fresh fruit in the room everyday and I was given a coupon for 20% off at all restaurants when I didn't require clean sheets after the first night (part of their green program). On the negative - The beds are very firm (a little too firm for me), they charge for internet in rooms ($250HK for one week) and for all telephone calls.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Buenos Aires", "Title": "“The worst hotel in Hong Kong”", "Author": "Glamstyle", "ReviewID": "UR30538085", "Content": "This hotel is awful. The bathroom was big but wasn´t clean. The breakfast is ok", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Very good standard”", "Author": "Anauk09", "ReviewID": "UR27502434", "Content": "Well treated. Free courtesy bus to give you any connections required. We travelled with a toddler and felt it was very much a 4 star hotel. Not right in the centre but only 5 minute walk into it!", "Date": "April 6, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Munich", "Title": "“70's style but still luxurious, very centrally located”", "Author": "CP0801", "ReviewID": "UR23813890", "Content": "Huge, comfortable rooms, everything late 70's style but very clean, bar on top with great view over the bay, staff could improve... Overal recommendable", "Date": "January 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fairly good hotel”", "Author": "MikeCMelbourne", "ReviewID": "UR21094499", "Content": "Nikko Hotel is in Kowloon, near to the harbour. You need to walk a bit to get to the main shopping district of Tsim Sha Tsui and you need to cross the harbour to get to Hong Kong Island proper. There are plenty of restaurants near the hotel and some rooms have a good view of the harbour. The Nikko Floor Lounge has a good selection of drinks and ice cream, although it is a little cramped. The staff are mainly very attentive and responsive. The room is fairly standard. Comfortable. Nothing to complain about. Breakfast choices at the Cafe Serena is not that wide but lunch buffet is good. Overall, a decent place to stay. Nothing much to complain about.", "Date": "October 22, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tacoma", "Title": "“Very Nice !! Better than I expected”", "Author": "rainman1956", "ReviewID": "UR20386491", "Content": "I spent 2 night at Nikko Hotel this month 9/14-16 . I needed to stop in HK on my way to vietnam fir a couple days . I usually try to stay in TST area . I had not stayed at Nikko before , all I knew was it was next to Grand Stafford ( Nice) so I knew it was it nice location. It was rated 4 -5* depending on which web site you looked at . Found a nice rate of $148 USD on bookings.com . I checked in late at night on 9/14 , staff was friendly and helpfull . I was upgraded to the club floor (14 & 15 ) . I was also told that my rate included breakfest each morning . I was given king room on 15th floor , and to my suprise it had a nice harbor view , Also on 15th floor was the health club and pool . They also have very nice lounge with outsatnding view of harbor . As i mentioned room was pretty big with King bed ( very firm ) Nice desk , closet and safe . bathroom was pretty big and had seperate tub and shower. Hotel lobby was really nice , buffett breakfest was nice and there was plenty of selections for western travelors . Overall it was really good stay , I was worried because after booking reservations , I had read some unpleasant reviews on this Hotel . I would definitely stay at this hotel again . Great location , great price and nice rooms", "Date": "September 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "chile", "Title": "“value 4 star hotel in good location”", "Author": "welltraveledA", "ReviewID": "UR13510674", "Content": "good hotel in kowloon i think is the less expensive harbour view room you can get in TST ,kowloon (may be in hung hom) corner room,small ,lcd tv just remade at the time not every room was remodelated breakfast is expensive and normal,better go to deli france just one block away in hkc visit FELIX at the peninsula (dont miss harbour view men bathroom)", "Date": "February 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Santiago, Chile", "Title": "“Nice for Orientals”", "Author": "negra30", "ReviewID": "UR12370303", "Content": "The hotel is good, but the breackfast is made for Asian people, the only thing that I coul eat was eggs, there wasn´t cheese, and more occidental things, only red beans roll, congee, etc", "Date": "January 6, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Shanghai", "Title": "“Too expensive for such an average hotel”", "Author": "xksb", "ReviewID": "UR11368806", "Content": "I stayed at the Nikko hotel for two nights while on business. Their function rooms are bad, overlooking the habour and food served was alright. We had lunch at their restaurant - buffet style - and the place as packed. Food was good, but not spectacular. The rooms are average. In my opinion, quite spacious for HK standards - especially the bathroom. Most hotels in HK would not carry both a bath and a shower, this one had both. However, their mirrors were not well placed (the small mirrors that turn out) and not enough closet space. Their TV is so small, I had to sit closer to the TV on the bed - could do with about 5\" bigger - TV isn't in proportion to the rest of the furniture in the room. Internet is not free. Their rooms are overpriced considering their location and decor (which needs an upgrade). I was disappointed to find that the busboy expected a tip. There are better hotels in the surrounding area - Kowloon Shangri-la etc. Hotel Nikko is a rip off mainly catered to Japanese tourists.", "Date": "December 9, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chongqing", "Title": "“ripoff”", "Author": "travelmaniak", "ReviewID": "UR10490059", "Content": "An average hotel regarding International standards. Prices too high. I found out that Caucasians and Japanese are paying a hefty upcharge! I have checked out immediately after one night and moved to the Royal Pacific Hotel. Here I got value for my money!", "Date": "November 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Linn, Oregon", "Title": "“Beware of Extra Charges”", "Author": "globalreach", "ReviewID": "UR8840248", "Content": "The hotel is clean and service good. Rooms are small, espcially by 4 star standards. Stayed on the Nikko Floor and was suppose to get free local calls; dialed 800 number and got charged $HK30 or about $4.00 per call. They told me 800 numbers don't count as local calls. Also charged $HK330 or about $45 US for two glasses of wine for my wife at the lounge. (she was in town on a different trip). Exchange rate for money at desk is about 6% lower than what you'll get on the street so go to Nathan Rd to exchange your money. Broadband access at Nikko Lounge only means the signal; they charge to use their computers. OK hotel, definitely not 4 star. Stay next door at the Intercontinental for a much nice experience and same great location.", "Date": "September 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“could be better”", "Author": "My-View-on-things", "ReviewID": "UR8451179", "Content": "On two occasions I was asked if I was interested in a massage* while walking to my room after a night in town. This is unacceptable, and I didn't feel I was taken seriously when mentioning this when checking out. For the rest the hotel itself isn't too bad. Unfortunately the pool was closed due to maintenance. Breakfast wasn't up to (their own price) standard. According to one of my colleagues his room-phone bill was the worst he had ever seen. Overall just okay, but there certainly are better hotels around.. one night we had a perfect dinner at the Peninsula hotel's Felix Bar, and decided next time we'd surely stay at the Peninsula! * the kind you get arrested for", "Date": "August 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Place To Stay”", "Author": "Sivan L", "ReviewID": "UR8244937", "Content": "My wife and I have stayed at the Nikko hotel during the Chinese new year of 2007. The hotel location is great, it is very close to the Avenue of Stars. we had an harbor view room which costs a bit more than a regular room, but the view at night is worth it, just be sure to ask for a room with a full view to the harbor, some rooms have partial view. The service was great, the only issue is that not all of the hotel staff masters English, but you always find a way to explain yourself eventually. The rooms in the hotel are clean, the bathroom is huge and has both a shower and a bathtub. The hotel is a bit pricy but it worth the price, I will visit again.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“Not happy with hotel”", "Author": "ERguy", "ReviewID": "UR8222513", "Content": "My 13 year old daughter and I stayed at the Nikko Hotel in Hong Kong for 5 nights. During that time, on 3 different occasions, she and/or I were walked in on by housekeeping. First a \"man in a suit\" walked in on my daughter while she was alone in the room. Next, a housekeeper walked in on both of us without waiting even 15 seconds after knocking. Third time was with me in the bathroom doorway just after a shower. A housekeeper walked in on me and obviously got a vision that will haunt her for the rest of her life! I complained to the hotel manager(s) who said they would take care of it, but they obviously didnt. My daughter also went to \"check out\" the hotel pool, and ended up being followed by a male staff member the whole time who was well inside her personal space. It made her so uncomfortable that she refused to go back to the pool, even with me. The concierge and desk staff weren't very helpful either. I asked for recommendation(s) for somewhere to eat, and they told me, \"nothing is very good around here\", and left it at that. English is not very good with many of the staff as well. We also were a definite minority at the hotel. It was jammed with hundreds of Japanese tourists milling around the lobby and the facilities. It was hard to get any help or use the facility amenities. The restaurants were very expensive. The phone calls are not free. The business center was always busy, but cost $40 per 15 minutes use. All in all, not a very happy experience. I could not recommend this hotel to anyone. I will not return. They call themselves a 5-star hotel. I'd say 3-stars at best. With all the choices in Hong Kong, anyone would be better staying elsewhere.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "MA", "Title": "“What you book is Not what you Get!!”", "Author": "GlobeTrotterMa", "ReviewID": "UR8031566", "Content": "Stayed at the Nikko last week, following a week at the Conrad HK. Booked a harbor view Nikko floor room for 2 adults and 1 child. Room was confirmed with rate and when we checked in were forced to sign document changing the rate by an extra 600 hkd for our daughter. They claimed that they gave us a larger room (not true) to accommodate cot. We showed them our confirmation from them and they would not budge. We signed as the Dragon Boat races were that weekend and we could not find another hotel to stay at as they were all sold out for the weekend. During our stay we found the beds to be terribly hard, the rooms dated and the breakfast mediocre at best. The rooftop pool was closed several times due to threat of thunderstorm, even though the sky was blue and sun was shining. We often wondered, with other guests, which weather channel they were watching. When pool open, there is no shade and only 2 umbrellas, 1 which the 2 lifeguards sit under. The staff at the Nikko is quite inflexible/indifferent and should truly remember who exactly is paying the bill. We will go back to the Conrad next time.", "Date": "June 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver, BC", "Title": "“Only worth 3 stars!”", "Author": "ldlowe04", "ReviewID": "UR7545635", "Content": "This hotel is asking for 5 star prices and should only be rated 3 stars. Overall, the hotel needs renovations. The rooms are quite dated and the carpets definitely need to be changed. We stayed on the 3rd floor facing the street, so it got a little noisy from time to time. By HK standards, this place is just OK. Don't bother getting the breakfast buffet rate unless you want to eat the same thing every day. You're in HK, which means there's so much to eat here! By the 3rd day, we were tired of the same selection, but still felt obligated to eat there because we had paid extra for it (I believe it was $175 HKD per person). Quite a walking distance to MTR, but close to the train that takes you to Shenzhen (which is a must for shopaholics!) When you are there, make sure you try dim sum at the \"Laurel\" restaurant upstairs at the mall and get a massage at one of the many luxury spas (you can go to the bottom floor of the mall and catch a shuttle, but make sure you have a mandarin speaking person with you!) For what I paid, I probably won't stay here again. If you like this area (which is the quieter part of TST), I would try the Intercontinental next store.", "Date": "May 4, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Stockton on Tees", "Title": "“Great Experience.”", "Author": "lindso", "ReviewID": "UR6906153", "Content": "The service was exemplary. The staff were polite and very helpful. The rooms were spacious and very clean. The restaurants were excellent, particularly Les Celebrites (although one had to eat a little earlier than we preferred, since it closed at 9:30) and Toh Lee. The location was ideal for access to Nathan Road and the Star Ferry (about 15 minutes walk) and there were many good shops and restaurants in the immediate vicinity. We preferred this location to the Marc Polo Hong Kong, where we had stayed in earlier, as it was a much more pleasant area for walking around and was a little less frantic than Harbour City. We would have no hesitation in returning to this hotel.", "Date": "March 3, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York, NY", "Title": "“Comfortable stay but the staff at the hotel can be clueless”", "Author": "dcnetworks", "ReviewID": "UR6840211", "Content": "I stayed at the Hotel Nikko a total of 3 nights in Feb 2007. I booked the hotel using Expedia (the reservation confirmed by Expedia but the payments were made at the hotel. Due to an overbooking made by my airline, I arrived at HK exactly 1 day late. In foresight, I called the Hotel Nikko from the airport and told them of my flight problem. I was told by a Hotel Nikko reservation specialist to make sure I get something in writing from my airline to indicate the fact that my flight was overbooked. I arrived at the Hotel Nikko a day after my check-in date. Check-in was a snap (granted it was midnight). The check-in staff made a copy of my boarding pass and airline letter. I asked the front desk clerk if I am going to be charged for the night I missed. He told me the reservation manager will review the documents and then contact me later on the day. I agreed. Hotel location: Hotel Nikko is located at the far east end of Mody Road. It is a bit secluded/quiet but it is within walking distance to Nathan Road, the MTR, Starbucks, Inexpensive rest. and the Kowloon harbor. I booked the lowest rate possible (an excellent deal on-line) and still got a huge room on the 10th floor. See downloaded photo. The tv in the room was a bit small but the room was very comfortable (no loud air-conditioner or strange smell). The room has a small fridge, 2 free bottles of water given daily and a fruit basket - refilled by the maid daily. I loved the bathroom (it has a walk-in shower and a deep soaking tub). All the hotel service staff I encountered were very nice. At check-in, I did not upgrade my room nor was I asked by the check-in staff if I wanted an upgrade. I did use the business center on the 14th floor once ($40 HKD for 15 minutes). After a full day of running around the city, I returned in the afternoon and received a message from the reservation manager. I went to the front desk and inquired about my request on file. The front desk staff member checked and then said my request was denied. I told him that was unacceptable because I called the hotel ahead of time. In any rate, he connected me by phone with the reservation manager. The reservation manager repeated to me 3-times that it was due to personal circumstances that I arrived late to the hotel therefore I would be charged for the night I missed. I persisted with her over the phone for like 5 minutes before she agreed to view the travel voucher I received from the airline. To make the long story short, I never received a formal response from the reservation manager but when I checked out the next day, I was not charged for the night I missed at the hotel. The check-out staff told me that I might still be charged for the night I missed and my request was still pending. O well. Overall, I enjoyed my relaxing stay at the Hotel Nikko. I would stay there again but I would make sure I have everything clearly documented. I won't expect too much from the reservation/front desk staff.", "Date": "February 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“too modern by half!”", "Author": "rosstucker", "ReviewID": "UR6831959", "Content": "Just like Hong Kong itself, this hotel is a bit of \" the modern\" mixed in with some frustrating details. Basically, it is a business and group tour hotel which manages successfully to retain a sort of personalized touch. (We stayed there twice in December -- and in January -- for a total of five nights.) The personal touch was exemplified by the dining room on Christmas day: when we expressed some doubt about eating lobster, crab, and so on; they rushed around and got us turkey, cranberries, dressing, etc. This was while the dining room was overwhelmed with customers! Unbelievable service! What more could one ask? On the other hand, the hotel seems to want to offer individual guests all kinds of deals -- and one is escorted to the fourteenth floor to hear about \"special offers\" when all one wants is to go to one's room. The room seems to be overwhelmed with technology -- requiring virtually an engineering degree to figure out things like light switches, draperies, and so on. The harbour view is of container docks to a great extent, but at night the distant skyline is certainly worth the price.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "singapore", "Title": "“a good stay”", "Author": "trixiebear", "ReviewID": "UR6815537", "Content": "Rather than staying on Hong Kong island as I normally would booked into for this trip in Nov 2006 as I was attending a conference in the hotel, and then extended over the weekend. The hotel was a pleasant surprise located in one of the less crowded parts of Hong Kong we've been to - reminded more of home in S'pore. Rooms were excellent, a very good size by HK standards and well apointed as well. Service was excellent and it was a generally very enjoyable four night stay. There are also some good bars and restaurants very nearby fronting onto the road looking over to HK island itself. The location can seem a bit inconvenient for central but if you take the MTR rather than a taxi its far quicker. Overall a pleasant surprise, if slightly beyond my normal budget.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Elmley Castle, England", "Title": "“Good Location, excellent service, nicely refurbished”", "Author": "tomtom333", "ReviewID": "UR6641066", "Content": "I have stayed at the Nikko many times over the years, but lately been tempted away by other hotels such as the Shangri La. I had occasion to visit Hong Kong during a trade fair which meant my 1st choice hotels were all full. I went back to the Nikko and was pleasantly surprised. I stayed in a Nikko Floor room with Harbour view. The room was newly refurished and was very comfortable. The bathroom too had been overhauled. The Nikko floor lounge provides excellent service and amenities. The breakfast selection was good as was the selection at cocktail hour. The food in the restaurants was great. I would recommend this Hotel as a cheaper alternative to the well known 5 star hotels on Kowloon and as a much better alternative to the tourist hotels on offer. The location in Mody Road means you are not far from the buzz of Kowloon and very near the best walk along the habour front overlooking the lights of Hong Kong Island.", "Date": "January 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Loved the Nikko, Hong Kong”", "Author": "Dublin_Dude", "ReviewID": "UR6549047", "Content": "We stayed at the Nikko for 7 nights, rm 1441. Upgraded on arrival to the Nikko Floor. We bought the extra upgrade that allowed us to use the Nikko Lounge which has spectacular views of the Harbour and Hong Kong Island. Free champagne, Sushi, dim sum etc from 6pm onwards and free snacks all day. The bedroom was very spacious, ample space, and extremely large bathroom. The beds were very comfortable, absolutely no complaints. Location is great for all attractions with only a short ride on the underground and the area is great for walking, providing its not to humid. The breakfast was amazing, with a varied menu to include Western, Japanese and Chinese items. We did spend at least an hour over breakfast every morning, definitely a good start to the day. There is ample choice of restaurants and bars in the area. Definitely will stay here again, if I can afford it.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shoreham by Sea, West Sussex", "Title": "“Outstanding levels of Service”", "Author": "matt_hosk", "ReviewID": "UR6348258", "Content": "We stayed at the Nikko in October 2006 on the first stage of a seven week round the world trip. At check in we bought an upgrade to the Nikko club, including full breakfasts and use of the Nikko lounge. This was located on the 14th floor with great harbour views, and outstandingly helpful staf who made all our restaurant reservations, reconfirmed our flights etc.. Complementary snacks , ice creams , pots of tea and coffee were inclued at all times; and premium drinks, including champagne, from 6.00 to 9.00pm. Oud bedroom was large ,and the bathroom enormous, with a huge bath and walk in shower. Complementary fruit and distilled water were provided daily. The air conditioning was simple to control and almost silent. Location is 20 minutes walk to Star ferry, but there is an alternative pier fewer than 5 minutes away with a daytime fast ferry service to Central on Hong Kong island. 3 tips: The Nikko is one of the hotels served by the airport express service. Your return ticket includes fast train to Kowloon station, and minibus transfer to the Nikko. Totally painless. After checking out , the minibus takes you back to the station where you can chek in for your flight, say good bye to your hold luggage, and make the most of your last day. Don't forget to visit Lamma island for a fantastic fish and seafood meal at the Rainbow restaurant. They will take you both ways in their private ferry at no extra cost. The hotel will book it all for you. Buy an Octopus card, which is valid on the very efficient public transport. You pre load the card with money, and scan it on buses, trams, ferries etc. when the correct fare is deducted.", "Date": "December 8, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Barcelona", "Title": "“needs update but still okay”", "Author": "Carlos_Barcelona", "ReviewID": "UR6342881", "Content": "Stayed a the Nikko hotel for 3 nights again after 7 years. Hotel is still okay but in my opinion, too tailored for the Japanese tourists. I think it needs a little bit of update. One thing I disliked was that the rooms have no possibility to open windows to air the room, something I can't understand. Rooms a lttle smallish but typical of HG where square meters are not cheap. The Nikko Executive Plant at the top has excellent views of the HK harbour. Service of the employees is all right but could be better for a 5 star hotel.", "Date": "December 7, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Letchworth, United Kingdom", "Title": "“Lovely hotel”", "Author": "Sarah3000", "ReviewID": "UR6325776", "Content": "On arrival, staff did ask us if we wanted to upgrade at extra cost. This would have included an upgraded room, buffet breakfast and use of special lounge. We declined and were not in the slightest bit disappointed with our standard room, it was very clean and comfortable. Facilities were great. Nice pool and gym area. Bistros and restaurants were excellent too. Plenty of eateries within minutes walk and all good value. As mentioned before, location was not central but we walked to the Star Ferry area on one occasion and it only took a 20 minute stroll along a lovely harbourside walkway. There is a free shuttle bus that runs to shopping areas and underground/subway stops, taxis are very good value too. A must do is Lantau Island day trip, booked via hotel reception. Excellent value, very well organised, so much packed in but it didn't seem tiring at all !", "Date": "December 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Great all inclusive deal”", "Author": "Canadianknowitall", "ReviewID": "UR6164736", "Content": "I stayed for 6 nights this November. I had a room on the 15th floor with a partial view of the Harbour and my rate was a “business package” that included the business lounge where you are served free soft drinks and cocktails and hors d’oeuvres at various times of the day. Also included were buffet breakfast in the 1st floor dining room (or a much lighter continental breakfast in the afore mentioned lounge), free wireless internet access in both the room and lounge, free access to the health club and to the pool on the roof (which is spectacular) and discounts on laundry, room service and purchases within the hotel. At $HK1550 a night, this package was a great deal and worth every penny. The service was without fault very efficient and instant and the quality of the food at breakfast superior and quite varied. I in fact tried several of the other restaurants within the hotel and all were outstanding (especially Toh Lee for Cantonese cuisine). The room and bathroom amenities were excellent with bathrobes and slippers, a plasma TV screen, cable TV with many channels, a mini bar fridge that could accommodate extra stuff if you wanted, complimentary water, tea and coffee ingredients, an electric kettle, a safe, electronic window drapes, a large bathroom with separate shower stall and bathtub. There wasn’t anything that I could thinks of that I missed. Room service was excellent and very quick. The only minor criticism I have would be that the concierge service was not reliable. I asked for a good restaurant and was told to go to the Jumbo Restaurant off the shore in Aberdeen. The place is inexplicably a tourist must-see where one pays thrice the money for a meal of comparable quality anywhere else. On another occasion I asked how much approximately a taxi would cost to a certain place and was completely misinformed. Other than that, I would not hesitate to recommend the Nikko, provided you go on the all-inclusive package. Believe me, it saves you a lot of money if you use it well. The Nikko is within walking distance of the Ferry Terminal and of great shopping on Nathan Road, The Jade and Night Markets. Restaurants abound in the area and if one wishes excellent non-asian cuisine, go to the Knutsford Terrace off Nathan Road. The Island Seafood House is out of this world as is the Italian restaurant there.", "Date": "November 22, 2006"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Location": "3", "Value": "1"}, "AuthorLocation": "california", "Title": "“Nikko Hotel in HK-a complete disappointment”", "Author": "vincewong2", "ReviewID": "UR6058475", "Content": "It just occur to me that I should share my experience with fellow online hotel shoppers even though my experience with this hotel was almost a year ago. Booked a room at Nikko Hotel in Hong Kong in Dec 2005 through Orbitz at a fantastic rate. Confirmed twice with Orbitz the reservation was firm before I left US. Upon arrival on the 23rd of Dec., Nikko Hotel claimed no such reservation was on file and flatly denied us a room even after I showed my paper confirmation. The manager there Mr. Park curtly said \"We can't be responsible for online reservations made on other websites and what's more I have never heard of Orbitz\". Given it was Christmas time, I thought he was very unsympathetic because he made no accommodation to the stressful situation. The desk receptionist confirmed there were rooms available but the manager would only let us have the room for about twice the price that we paid for at Orbitz. After 45-minutes with him, we gave up. He treated us as if we were trying to 'cheat' the hotel and we felt hurt. I would imagine a five-star Japanese hotel would be more understanding and willing to make adjustment and work with 'stranded' customers. Later I wrote to the hotel headquarters in Tokyo providing the details. The customer service department clearly did not read the letter; they provided a generic apology for the inconvenience and claimed the hotel was full at that time and there wasn't much that could be done. I would not recommend this hotel at all because of the attitude displayed by the manager. If this were a 1 or 2 star-small hotel, I can understand. But for a well known hotel that claims excellence for their service on their website, this was a complete let down. Incidentally, the location of this hotel isn't that great either as we found out.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London and Northern Ireland", "Title": "“Great hotel.. very special!”", "Author": "Kat_Orr", "ReviewID": "UR6024322", "Content": "For the price of this hotel and the prime location, it is incredibly good value. My fiance and I got the Harbour view room and it was incredible. It had all the mod cons in it.. electric curtain rail!!! Decorated in a beautiful modern oriental style and incredibly spacious unlike a lot of hotels in Hong Kong. Bathroom was simply beautiful, had a walk in shower which was large and a bath. Little things like the toilettries they gave were brill too! Service was brilliant and the general feel of the hotel was relaxed which is what you need on holiday.", "Date": "October 29, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Reasonable rate, good location”", "Author": "Reed&Shiho", "ReviewID": "UR5985949", "Content": "Unlike Intercontinental Hong Kong or Four Seasons Hotel Hong Kong, this is not a five-star hotel. However, we love this hotel because of its reasonable room rate. You can find 1000HKD (roughly 120USD) standard room throughout the year. The hotel is old, but renovation has been finished. The room is clean. Many restaurants serving Chinese, Italian or Japanese, are located in walking distance. Good hotel.", "Date": "October 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oxford, UK", "Title": "“Best breakfast buffet”", "Author": "Twofootplus", "ReviewID": "UR5947938", "Content": "This was an overnight stop on the way from London to Brisbane. On previous trips we had stayed in the New World Renaissance and the Langham Place; the Nikko seemed newer, the room more spacious and the price lower. The Nikko is in Tsim Sha Tsui East, only slightly further from the Star ferry than the New World Renaissance, a 5 minute walk to the Avenue of Stars, and near MTR and KTR stations. There is a bridge across the busy road to get to the harbour promenade. There are a few shops and malls close by (actually there are few places in HK that don’t have a mall close by!). We were able to check in early. The bed (crisp cotton sheets and duvet) was luxuriously comfortable. Everything was clean. Staff were friendly and efficient. Our 9th floor double room with harbour view had broadband for a small charge, minibar, kettle and complimentary tea and coffee (not quite as good as Langham Place’s filter coffee-maker). A star feature was the breakfast buffet, well worth the cost: cereals, fruit, patisserie; cooked items such as bacon, sausages, hash browns, pancakes and waffles; Chinese breakfast dishes, plus eggs cooked to order any way you want, including omelettes with smoked salmon, cheese, ham, etc. Loved it!", "Date": "October 13, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North East UK", "Title": "“Its on \"OK\" hotel and quite expensive for the room size”", "Author": "Kawah2750", "ReviewID": "UR5780233", "Content": "Hotel is fine, nothing special, staff are friendly enough though not very flexible. Food is \"OK\" but not to a very high standard. Have stayed there a couple of times but will look for an alternative next time I visit Hong Kong. Its handy for the Ferry to Shenzen which is a good point. Nothing to get exited over.", "Date": "September 8, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "PAKISTAN", "Title": "“An excellent hotel”", "Author": "NAEEMFAROOI", "ReviewID": "UR5728201", "Content": "I have been to Hong kong at the end of july staying at NIKKO hotel Hong kong with my family. It was an excellent experience with a large family of 12 to stay in together, the staff was cool and extremely helpful & they were much caring of my small kids as there nuns. The rooms was large enough to fit myself with my 2 small kids. The good thing is that, that all underground train stations are very nearby. all in all I hereby suggest for families to really check this hotel before checking in another.", "Date": "August 30, 2006"}], "HotelInfo": {"Name": "Hotel Nikko Hongkong", "HotelURL": "/ShowUserReviews-g294217-d302504-Reviews-Hotel_Nikko_Hongkong-Hong_Kong.html", "Price": "$204 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.72 Mody Road, Tsimshatsui East, Kowloon</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "302504", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/88/ec/41/hotel-nikko-hongkong.jpg"}}