{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "On the road", "Title": "“A very, very nice hotel”", "Author": "Coasterjunky", "ReviewID": "UR126387993", "Content": "Im a professional truck driver and was experiencing some problems with my truck so I checked in at the International dealership about three miles away. They told me at about 4pm (16:00) that it'll take several hours to get fixed and that there were two hotels nearby that were pet friendly as I have a small dog that travels with me. This was one of them and it's a real gem. I checked in at the counter where they told me there was a refundable pet deposit and a nightly pet fee. The deposit is refundable only if there's no damage. The rooms are a bit smaller than the newer hotels but the refrigerator, microwave, coffee maker with complimentary coffee grounds more than made up for the rooms small size. The bed was super comfortable and the TV channel list was very long which included the History Channel, Discovery Channel, Weather Channel, and other cable and local channels. There is a bank with 24 ATM next door and several local type restaurants within walking distance and several that will deliver. I recommend Geordiano's if you're looking for some deep dish pizza, it's what they're famous for. As I said before, this hotel is pet friendly with a refundable deposit and a nightly fee. They also do have onsite coin operated washers and dryers should you need to do some laundry.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“good service and good value. rough neighborhood”", "Author": "ericj076", "ReviewID": "UR125224723", "Content": "the staff was very friendly and helped plan our outings using public transportation. they even drove us a few blocks to the train. it's not in a very nice neighborhood though.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lakewood", "Title": "“the carlton inn midway”", "Author": "sslaninka", "ReviewID": "UR124339897", "Content": "it was only 1 stop from the midway airport and not even 1 block from the \"el\" to go to downtown chicago. able to purchase the day pass at the front desk. breakfast was very ample. not much to do around there at night but, after a hectic day in the city, all we really wanted to do was rest and be fresh for the next day! would highly recommend it and will stay there,again, on our next visit!", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cicero, Indiana", "Title": "“Gem in Disguise”", "Author": "Dick V", "ReviewID": "UR124057421", "Content": "Do not be fooled by the first impression when driving by - The rooms are clean, all the personnel are very friendly, helpful and accomodating & the breakfast was excellent. Not the Ritz, but a great value in Chicago.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cedar Rapids, Iowa, United States", "Title": "“Prayer answered”", "Author": "Lonnie Z", "ReviewID": "UR123665417", "Content": "With our flight to Chicago delayed by snow until after midnight, we faced the very dim prospect of (another) sleepless night in an airport. TripAdvisor to the rescue as I used it to find nearby hotels during our layover in Atlanta. I called the Carlton from there and reserved a room. I wasn't expecting much for the price (around $90), but was pleased to discover such nice accommodations, if only for a few hours. They even picked us up from the airport and dropped us off at the train station the next morning (after we enjoyed the complimentary continental breakfast and a good night's sleep). I highly recommend this hotel to folks traveling through or staying in Chicago.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crown Point, Indiana", "Title": "“Great Park & Fly stay!”", "Author": "Midwest123269", "ReviewID": "UR123157272", "Content": "We really enjoyed our stay at the Carlton and will definitely be staying there again. Our room was very nice. The staff was very friendly and accommodating. They shuttled us to a local restaurant our first evening and even made arrangements to have food earlier than usual for our early morning flight. Our drivers Steve & Kevin were exceptionally helpful and courteous and made us feel welcome. It's a great Park & Fly for Midway!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boise, Idaho, United States", "Title": "“Great value in Chicago”", "Author": "Jake W", "ReviewID": "UR122743598", "Content": "I stayed at the Carlton in September and the staff was excellent, pointing out on the CTA map how to get to different places that I was planning on going to. About a 5 minute walk to the Orange Line station, or you can use the Archer bus that heads downtown as well. Slept well, with minimal disturbances, after a long day of walking around, a comfortable bed always feels good. Closest supermarket is on Pulaski about 10 minutes walk from the hotel, plus many fast food places in the same area. If you need a White Castle fix there is one about 1 mile to the east on Archer. Would definitely stay at the Carlton again, helped make my trip to Chicago a blast.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Traveling in the Windy City”", "Author": "jackiestarr", "ReviewID": "UR122742455", "Content": "Our room was on the first floor, which was accessible to the parking lot. We were able to park right outside our hotel door. The room appeared to be clean upon arrival , but I did notice previous guest left something unsanitary on the floor in the bathroom. I contacted hotel staff immediately and they responded promptly and remove item and staff did sanitized the area. The hotel provided a courtesy shuttle for your convenience, and a list of restaurants in the area, and suggestions on where to go for entertainment.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Very happy with this hotel choice!”", "Author": "Shoshonechic", "ReviewID": "UR120946251", "Content": "I was a little nervous about coming to this hotel but was very happy with this hotel choice! My room was very nice, large, clean, comfortable bed, and pillows. Breakfast is minimal but free, so who could complain? There are several places to eat very nearby. I always felt safe and the shuttle service is fantastic. The front desk staff are very welcoming and go above and beyond to help plan trips and give advise for activities and restaurants. I will come back and stay here the next time I am in town. There are nicer hotels closer to the city center but I saved at least a couple hundred dollars by staying at the Carlton Inn and this little hotel has heart.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "culver city", "Title": "“Awesome”", "Author": "larocki", "ReviewID": "UR120841816", "Content": "Great triple A rate, free wifi and awesome staff. Stayed overnight when we missed our flight at Midway and they even had a crib for our twins. They gave us a bag of goodies since we didn't have any toiletries and the airport shuttle was free. Doesn't get any better than this. Big thumbs up.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Batavia, NY", "Title": "“I would stay again but...”", "Author": "kaileen76", "ReviewID": "UR120504078", "Content": "I would stay again. It was located close to my sister plus the free parking and breakfaast make it one of the best deals in the Chicagoland area. My first issue was the cleanliness. The beds were in terrific shape and everything alse seemed to be really clean on the surface. A normal person might not have noticed it but I have a 9 month old who is a very new and enthusiastic crawler. On the first full day there I had given him a bath and put a diaper on him and was letting him crawl around while getting my 3 year old dressed for a family dinner out. At dinner my friend was playing with him and said \"those are nasty bruises\" but the bruises on his knees wiped off. I thought he had gotten into something but that night while he was cruising around the hotel I noticed his socks were filthy along with his hands and anywhere else that was in contact with the carpet, On the next day my brother arrived (we were in town for a wedding).I had booked two rooms and I went with him to check him in. I was going to say something about the floors but was thrown off by a truly nasty front desk clerk who gave me a hard time because I had forgotten my AAA card but had my husbands (which he was staying with me and it was our joint credit card that was paying for the rooms) Even if it was a policy she could have been a whole lot nicer about it and she embarassed me in front of my brother's guest and everyone else in the lobby. I stewed on that interaction all night long and it ruined any chance of sleep I had. To be fair I never complained about the rug in the room. When I originally arrived I checked in around 8 pm on a weekday and the front desk clerk couldn't have been more welcoming and friendly. So the staff is inconsistent and the rugs are desperately in need of cleaning, it is a motor lodge though so don't expect the Ritz Carlton.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Little Gem”", "Author": "TheTwins750", "ReviewID": "UR120463294", "Content": "My sister and I checked late after a long drive from Nashville. We picked this Hotel because it is pet friendly and had a great rate! At check-in the man at the front desk was friendly, checked us in quickly and even had a bag of treats for the animal (how cute is that?). When we opened the door to the room we both looked at eachother and said \"wow\", very nice updated rooms with lots of space and very clean. The continental breakfast the next morning was amazing!!! Next time we are in Chicago this is where we are coming! Everything was perfect from making the reservation to check out. Everyone there is so nice and friendly. Thank you for the great place to stay, it made our trip even better!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great place to stay”", "Author": "chleo_11", "ReviewID": "UR120306153", "Content": "The staff is extremely competent, friendly and helpful, even providing us with discount coupons to the places we mentioned we would like to visit. They gave us a CTA map and we we able to buy our multi-day pass right there. Very easy to get downtown. The shuttle to the el was very appreciated on the last rainy day of our stay. We found the room clean,spacious and airy; I love the colour scheme! We would definitely recommend this to travellers who are looking for a reasonably-priced place to stay, but the biggest plus is the staff who make sure your stay is a pleasant one. chleo 2011", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Excellent independent motel”", "Author": "boba543", "ReviewID": "UR120163391", "Content": "I was worried when I booked this motel, because it wasn't a chain, thus not familiar to me. But I wanted to be close to the Robie House (Frank Lloyd Wright), and while hotels-motels in the Chicago area are so expensive, this one was somewhat more reasonably-priced, and the reviews were good, so I did it. And was I glad I did! Very large room, clean, and an amazing breakfast in the morning (egg & sausage bagel sandwiches), and the front desk people were very friendly and helpful. I think this is a family-run business, hence the more personable service. I will definitely go back again some day.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Canberra, Australia", "Title": "“Disappointing”", "Author": "mj316", "ReviewID": "UR119610318", "Content": "I think this place has been severely overrated on trip advisor. First, the good points... As noted by others, the staff are friendly and helpful. The courtesy transport to/from the airport is convenient and welcome. Although it has some major weaknesses, it is reasonable value for Chicago. There is a Giordano's within walking distance, which is great for Chicago style pizza. The location is what it is. Relatively easy to get downtown, but takes a while. Now... the less good. First, the rooms are fairly ordinary. Very small, with a small double bed. The bathroom is tiny. The shower curtain only covered half the shower, consequently water went everywhere. The rooms were also dingy. We had a room on the second floor, up the back, so very little light got in. All in all a fairly miserable atmosphere. Second, our room was not clean to the degree expected. Although the bathroom etc was clean, the carpet felt and looked as though it could do with a good thorough stem clean. It felt dirty to walk on, and I noticed hair on my socks after walking around in the room. Third, the breakfast was average at best. No-where to sit, we gave it a miss after the first morning. If stale dunkin donuts and cold breakfast sandwiches appeal to you then you may like it... Overall, I can't recommend this, although the staff are very helpful. If you do stay, give breakfast a miss and ask for a room that faces out in the open for light.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hermiston, Oregon", "Title": "“A jewel, close to Midway Airport”", "Author": "wguterbock", "ReviewID": "UR119536547", "Content": "This is a traditional motel with open balconies instead of inside corridors. It seems to be family run. It is about a mile from Midway Airport in a neighborhood that was traditionally Polish but is becoming more Hispanic. It is mainly a neighborhood of neat single family homes and locally owned businesses. The hotel has a shuttle to the airport. It is a few blocks from the el to downtown and there is good bus service on Archer Ave. There are many restaurants within walking distance. Rooms are spacious, clean, and fairly stylishly furnished for this price range. Even the pictures on the wall were in good taste! What a surprise! They have a rudimentary Continental breakfast. Exercise room had three cardio machines and some weights. Bed was comfortable and the internet was free and fast. Staff is friendly and helpful. Only negative is that parking is pretty tight and seems to fill fast. I don't know if overflow to the bank lot next door is allowed. Prices are extremely reasonable. This is a good alternative to the superbusy motel campus South of the airport on Cicero.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Blue Anchor, NJ", "Title": "“Very Nice”", "Author": "BlueLiz02", "ReviewID": "UR119440035", "Content": "A Great motel. Clean, comfortable, every thing we needed!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“A Days Inn with Lipstick”", "Author": "toomanymiles", "ReviewID": "UR119438156", "Content": "As you'll see in other reviews, the staff here is pretty nice. Sadly, the motel itself lacks some basics. We stayed in an upper floor (there are two), and all room entrances are to the outside. I can only imagine the fun in the Chicago winters, as there was a 3/4\" gap at the front door. The room itself was Euro-tiny. The double bed was firm, not quite rock-hard but uncomfortably close. There is a coffee maker, but no carafe, as the coffee exits into supplied styrofoam cups. There is a microwave and fridge, but there is but one tiny table afixed to the wall, and one chair. Don't be a couple, please. There are NO food preparation surfaces. The room's AC/heater unit blows directly onto the bed; hope you like the breeze. The walls are thin, and if you don't mind listening to the couple next door's sex life, you'll turn on the bathroom fan as we did. The bathroom door was incorrectly mounted and was difficult to close at all. The bathroom is tiny, and we surmise that larger people will have difficulty in it. There is supplied soap and body wash from dispensers in the shower/tub. The room was clean, although one wall photo had somewhat melted from repeated bathroom condensation. The breakfast amounts to fruit, yogurt, and bagels/Dunkin Donuts offerings, with coffee (reasonable) and tea. There is almost no place to sit; perhaps three small cafe tables for all of the guests that want breakfast; a bottom rung sort of endeavor. Parking is tight, and it is close to the Orange Line; shopping nearby if you need; the I-55 ramp to downtown and other destinations is a mile away. Midway Airport is about five minutes. The staff is genuinely helpful, and there are vehicles to take you places, like the airport, in a friendly way. The motel itself, however, is just not a very good value, in my opinion.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“Four Star Customer Service!”", "Author": "WZE", "ReviewID": "UR119328222", "Content": "From the first call to reserve my room, I was impressed. I first spoke with Valerie who steered me away from the expensive airport car rental places (later I found these taxes to be about $30 daily) and towards the Enterprise around the corner. She said they would be glad to pick me up at the airport to pick up my car. Valerie asked what was bringing me to Chicago and I explained I was attending a wedding in the suburbs during the weekend and would be staying at the Carlton so I could see Chicago in a day. Valerie assured me that they would help me with my sightseeing. I called the night before to confirm what Valerie had promised; and sure enough, Tommy set me up for a pick up - all I needed to do was call once I landed. Well, everything went great and I was on my way to Naperville for the weekend. On Monday, upon my return to the city, I called the Carlton and Serena sent the van to get me. There was a bit of a snafu with the car so the van came, got my bags, and left with a promise to come right back once I was ready. When I was finally on my way, the van driver told me that they had the room ready for me and that he had placed my luggage in the room already. This was a great plus - it was only 12 noon! Soon, I was ready to go into the city. Tommy and Serena both mapped me stations, paths, places etc... They were awesome! They even sell train day passes right on site! The van driver dropped me at the train station and said to call when I returned. My day in Chicago was amazing! The next morning, so was the breakfast in the lobby! There was juice, coffee, dunkin donuts a plenty, dunkin donut egg and sausage biscuits, bagels and cream cheese, and yogurt. Not your typical scanty continental breakfast. And, as I ate, I watched Valerie and Tommy both continually filling the donuts and sandwiches. Oh, and did I happen to mention Buddy the dog? Buddy is a beautiful, gentle dog that I like to think of as the mascot of the Carlton. He made the place even homier. When I go back to Chicago, I intend to stay again. The service was great. I know you are also interested in the actual accommodations so I will mention that the room was large and clean. There was a nice sitting chair, and a table and chairs. There was a microwave and fridge! And, they had comcast tv with free tv on demand. I like to relax to TV Land which they didn't have. I did a search on the on demand, and found something light to watch as I fell asleep. The only think I might mention is that being near the airport, there is a bit of noise. But, it is not overwhelming. Thanks Carlton family, I will be back when finances and weather permit!!!", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Super Friendly”", "Author": "David W", "ReviewID": "UR118900764", "Content": "The staff was extremely helpful in making my travel plans and suggested great places to see. Only 2 blocks from the Orange line, it is a great central place to stay. It was a nice comfortable room, and when I asked for anything the staff was right there and willing to accommodate my needs. I booked this hotel based on these ratings and I must say the stellar reviews are correct.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Northern California", "Title": "“Excellent value near Midway Airport”", "Author": "cl1811", "ReviewID": "UR118718427", "Content": "Great price for accommodations near Midway Airport. Convenient to transportation on the L to downtown. Free parking if you have your own car or rental car. Don't be alarmed by the looks of the neighborhood as you drive from the airport to the Carlton. The surroundings improve just as you arrive at the motel and I felt perfectly comfortable and safe as a woman travelling alone. Access to rooms is motel-style--exterior hallways-- but at night there was a security guard on duty and I never felt unsafe even arriving after midnight from an event. Free internet terminal and printer in the lobby. Nice continental breakfast including hearty bagel sandwiches to warm up. Didn't see any milk, so if travelling w/kids you may want to get a carton and keep it in the in-room fridge. I would class the rooms as deluxe--they look newly renovated. My room was large, clean, and well maintained. Microwave, fridge, dining table, TV with plenty of channels. Desk staff very friendly and helpful. I would definitely stay here again.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Haven, CT", "Title": "“Great value for the casual traveler on a budget”", "Author": "huangj02", "ReviewID": "UR118464426", "Content": "Save your hard-earned money. Stay here rather than in town and save over $100 per night, plus any parking fees or even renting a car. The walk to the L is only 5 minutes and the ride to the Loop is about 25 minutes. The front desk stocks 3-day passes (but not 7-day) that they can put on your room charge. They answer the phone promptly and they'll pick you up from the airport and deliver you to nearby locations. The area is working class but safe, no shady characters panhandling or loitering in parking lots. The room is basic Motel 6 flavor, with the dreaded soap and shampoo dispenser on the wall rather than mini toiletries (how do people actually use \"shower gel\" without a loofa or sponge). Shower was well-pressurized and hot water was hot. They're sticklers about room service! At most midlevel hotel chains nowadays, there are signs in the room to \"save the earth\" and refuse room service to save (the hotel) on laundering sheets and towels. I was surprised that they insisted on servicing the room after 2 days. Wireless signal was strong and free, and there's free wired internet as well. TV is older CRT rather than flat panel, with the usual assortment of cable channels. Food selection for the morning was basic, 6-9 M-F and 7-10 S/S. Donuts, bagels, and breakfast sausage/egg sandwiches from Dunkin Donuts, coffee or OJ, fresh fruit, and yogurt. There's about 4 chairs total, essentially you're eating in the front desk area unless you take the stuff back to your room. Food choices at other times are generic strip mall. Subway, Domino's, chinese, and McDonald's are all clustered around the train station. You do get a bit of noise, since you're in an airport motel and the windows are not fancy triple-insulated. In addition to the overhead planes, you'll hear the whistle of nearby trains. My room faced the back of the property, so I can't comment on road noise, though traffic did seem light at night. This amounts to nothing if you're accustomed to city living. All in all, this place was full up for the four days I was there and I can see why.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tucson", "Title": "“Free parking”", "Author": "PromoAZ", "ReviewID": "UR118330631", "Content": "FREE PARKING-in Chicago that's a big deal. Safe walking to the Orange Line and restaurants. Excellent customer service and very well stocked continental breakfast.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Definitely recommend”", "Author": "L P", "ReviewID": "UR118313035", "Content": "My 20 year old daughter and I visited Chicago for the first time in mid-August 2011. We selected the Carlton Inn Midway because of its proximity to a train station, the price, and the reviews that we had read on tripadvisor. A big consideration to us was that the location was considered safe by other previous customers, as we had no first-hand knowledge. I did not want to drive in Chicago, so it was important to be within walking distance to the train station. We both found the room to be clean and decorated in appealing colors (plum and sage green). The people working the front desk were incredibly friendly and helpful, providing us with information on how to get to the various tourist locations. Although they offered to take us to the train station, it was unnecessary, as it was just around the corner. My daughter and I would definitely go back to this hotel; we are planning to go back to Chicago next year.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mission Viejo, California", "Title": "“Home away from home - We appreciate your hospitality!”", "Author": "heartofgold57", "ReviewID": "UR117766566", "Content": "We live in CA, and for a variety of reasons, we hadn't booked a hotel for the 2 nights we planned to be in Chicago as part of a trip to visit family in Michigan (7/19-7/21); We landed about 5 p.m. and started to call hotels -- Carlton Inn made room for us by offering us a late check in (following the truckers who check out late and drive at night). The room was very nice, cutely painted/decorated, and the price was excellent. We were asked to check out in the morning, and then back in the following evening (same game plan - trucker checks out late, and we check in), but my husband become violently ill (vomiting, etc.) and they managed to find another room for us to check into without checking out. They really went above and beyond for us, especially since we didn't even have a reservation in advance! We make 1-3 trips to Chicago, via Midway, every year, and we WILL be back! I loved the coziness of what is obviously a family operation, and truly appreciated the hospitality when we needed it the most! (being sick and far from home). NOTE: it turns out my husband had pneumonia and once we made it to our next destination, he was admitted to the hospital for 3 days!). Thank you Carlton Inn - Reina & Rick Donia", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seattle", "Title": "“Management makes this the best place to stay!”", "Author": "SeattleMeadowlark", "ReviewID": "UR117501198", "Content": "Iâ€™ve had to wait all this time to write this, as the rule is one cannot post on the same place in less than 90 days between posts. On 30 May 11, we stayed at the Midway Carlton Inn in Chicago. Weâ€™d stayed at the motel a week or two before, and I wrote a glowing report of the motel. The management of the motel is outstanding, as was the service and the cleanliness of the room. We had received first class service the first time and fully expected it again. So we were astounded at the difference 12 days made. This time, the room wasnâ€™t so clean. This time, we needed to go down to the office to get hand towels. This time, there was no coffee, and the maid had failed to empty the coffee grounds from the last customer. The tub hadnâ€™t been cleaned, indeed, it was clogged, something we didnâ€™t find out until, unfortunately, the water backed up while I was showering. There were hairs a foot long in the tub. I have short hair, and my husband is bald. So I left the housemaid a tip: a Canadian nickel. I also filled out the comment card, expressing my dismay at the poor cleaning job, the lack of attention to common details, and especially the dirty tub. The next day, I was home, and received a phone call. I donâ€™t remember her name, but the woman was calling from the Carlton Inn. She had received and read my comments and was appalled. This wasnâ€™t their standard, she said, this was completely out of the ordinary. She apologized profusely, saying the maid was newly hired (and, I hope, considering her lackadaisical approach to doing a simple job like cleaning a room, fired). The woman said that, because of the poor service Iâ€™d received, she was going to credit (refund) my money for the cost of the room. She did. For the HIGHER rate. She asked that I forgive her (as if she were to blame!) and to consider staying with them the next time I was in Chicago. I was amazed, and mollified. I've seen worse housemaid performance, but was so surprised at the difference. I certainly didnâ€™t expect a refund. But I was definitely impressed, all over again, with the high caliber of service I received from the Carlton Inn. It is apparent to me that the managers of Carlton Midway Inn take high quality service seriously. They pay attention to their customers comments, both good and bad, and act on them as needed. And they do it NOW. I know they read Trip Advisor. So, I say, Yes, ma'am, I promise. The next time we're in Chicago, we will be staying at your Inn. Thank you for your prompt attention to the situation and its rectification. As for folks reading my posts: I suggest you stay there, too.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Good hotel with fantastic customer service!”", "Author": "ONUMello", "ReviewID": "UR117256099", "Content": "I stated at the Carlton Midway on what ended up being the same weekend at Lollapalooza, though I was not in town for that event. Upon my arrival, the very friendly gentleman behind the desk commended me for making my reservations early and securing the room at the rate I did, as they had only gone up since then. Every employee I met that weekend was extremely friendly and helpful. The hotel was in a great location as others have mentioned, with easy access to the L and a shuttle for both it and the airport, though I walked to the train. The hotel offers CTA day passes at face price. The only reason I am giving 4 and not 5 stars is the room was a bit small and no-frills, though it was completely adequate and nicely maintained: I was in my room until 5PM with a do not disturb sign up (long after normal housekeeping hours) one night, and when I got back from dinner I found it had been serviced, which was a pleasant surprise- I have visited other hotels and done the same thing and the room hasn't been touched. The next time I am in Chicago, I will definitely stay here again!", "Date": "August 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value and very helpful staff”", "Author": "Bctony", "ReviewID": "UR117203500", "Content": "This hotel was in a great location for us and was a great value. The room had an overwhelming smell of cleaning products, but the staff was incredibly helpful, going out of their way to find info for us. I would definitely recommend it for value and convenience for people who are in town to see Chicago, rather than a fancy hotel room!!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa", "Title": "“An awesome hotel!”", "Author": "codeman1964", "ReviewID": "UR116780111", "Content": "I stayed here for 4 nights and I was extremely impressed with such a stylish room for such a low price. It's in a lower-income neighborhood but I never felt unsafe. The staff is very friendly, bends over backwards to help out and is generous with valuable local knowledge. A 5 minute walk to the El train station and then 20 minutes to downtown.I will definitely stay here again!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Waterloo, Canada", "Title": "“would recommend in a second”", "Author": "rbt8", "ReviewID": "UR116699225", "Content": "stayed two days at this hotel, and would recommend it in a second, clean fresh room and the staff were super. two blocks from the over head train to downtown, and a great restaurant two minutes away called Pindos. the staff were great very friendly and helpful. they will drive you to the train if you want even though it is a five minute walk. no worries with leaving your car overnight the place was safe and i felt very secure in leaving my car and even items in the room. 100% recommend this hotel", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Novi, Michigan", "Title": "“For money savers, one of the best hotels in Chicago”", "Author": "Henrypapa", "ReviewID": "UR116609450", "Content": "If you are rich and you don't care about how much money you spend in your travel to get good accommodations, this hotel is not for you. Just skip it. You can find tons of better hotels in Chicago downtown. However, I'm not that kind of guy. When I go to Chicago twice per year, cost for hotel and parking creates some pain in my wallet. This hotel saved me in that point. One train(CTA) stop from Midway Airport, five-minutes walk from CTA station and 20 minutes to downtown by CTA...I believe this convenient location is the best part of this hotel. (You can use the shuttle bus to go to airport and CTA station, too!) Furthermore, the room price is around $100 per night if you book in advance. You cannot find such good deal normally with such convenient location in Chicago. This price includes complimentary breakfast, fitness center and free parking! I believe you can save $200 per night just by staying at this hotel. With this saving, you can enjoy good meals, concerts and museums in downtown! Accommodations are kind of average or above a bit with this price but I have no complaint about them. Only complaint I have for this hotel is there is little space to have breakfast in the lobby. It means I have to bring the meals back to my room. As an additional caution, if you come here by your car, be sure arriving earlier to ensure your parking space. Normally, it would be a bit difficult to find a single space in late evening or night. The above things are kind of minor drawbacks (at least for me). I'll keep using this hotel for my coming Chicago trips.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mantua, New Jersey", "Title": "“Staff went above and beyond. Great alternative to downtown Chicago”", "Author": "manateesneeze", "ReviewID": "UR116589769", "Content": "Stopped here for an overnight stay heading west from the East Coast. Wanted to avoid driving into downtown Chicago, yet be close enough to get there via the train. This was the perfect location! Two blocks from the train station (easy walk), yet the staff offered a ride due to the extreme heat during our stay. They also sold train passes & were very helpful explaining how to use the Chicago Transit system based on where we wanted to go. It couldn't have been easier to get downtown....and no driving/traffic and free parking. The room was clean, the breakfast offered was above average, and I can't say enough about the friendliness of the staff. I'd stay here again next time in the Chicago area.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington, Michigan", "Title": "“Basic Hotel Stay”", "Author": "Deertwo", "ReviewID": "UR116431187", "Content": "Stayed here 2 nights for a weekend in Chicago. The staff is very helpful and courteous. Gave us maps for the train to where we wanted to go. The room was an average hotel room - with the exception of a microwave and refrigerator. The bathroom was rather on the small side. The hotel is in a relatively safe area. It was quiet at night and the A/C wasn't too loud. There is a complimentary shuttle to and from the train station. The only thing I would warn about is the train. We took it during the day and it was fine. We rode it Saturday night around 11:00 p.m. and were a little intimidated by some of the people we encountered. There was a fight that almost erupted on our train. If you're not used to this sort of thing, I would suggest you stay in town and take a taxi.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New Braunfels, Texas", "Title": "“A Good Value, Safe Area, Nice Staff”", "Author": "BubbaGump1", "ReviewID": "UR116406075", "Content": "This hotel is located in an old Polish neighborhood and is quite safe. The staff is very friendly and the rooms were very clean. The fitness center was very clean. The only negative is the breakfast. ...not much of a selection and not very healthy, heavy on carbs. Note: for those who are handicapped, they do not have elevators to their second floor.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cedar Rapids, Iowa", "Title": "“great access to Toyota Field and Midway, excellent staff”", "Author": "tjgetta", "ReviewID": "UR116403025", "Content": "the staff were courteous, the room was clean, safe, quiet", "Date": "August 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Helpful Staff at First...But wait”", "Author": "AmBen", "ReviewID": "UR116366588", "Content": "Seven of us stayed here on our way for a two week vacation. We stayed at the beginning of the trip and then two weeks later. Our first stay was great! The staff went above and beyond in getting us what we needed, even going out of their way to drive us in the shuttle to Union Station so we wouldn't have to drag our bags to the L station in the pouring rain. They did this for no charge. Unfortunately, when we came back two weeks later, the lady at the front desk questioned our registration because she said it had been made under my late father's name and my mother's credit card only had her name on it. She was extremely rude and when I informed her we had stayed here two weeks previous with no problem, she still questioned how we could prove we made the reservation. I was fired up by this time and informed her we had been on a train for 36 hours, it was almost midnight and we did not need this unnecessary hassle. She yelled at me informing me she had been at work since 7 am. Big whoop, lady... That's your job and questioning people who had stayed there previously and treating us like we were common criminals who would come in with 5 other people ALL Senior Citizens as well. Get a grip! She then proceeded to lecture us on how we would never be able to stay at any hotel under those circumstances... Also untrue. My father has been dead for 18 months and my mother and I have been traveling extensively since then and I can assure you, no hotel has EVER questioned our proof of identity. All our last names are the same! She was hassling us over two initials. Although I doubt I would stay in this part of Chicago again, she ruined what would have been an otherwise glowing review until that night.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dunedin, Florida", "Title": "“Great customer service, enjoyed our stay”", "Author": "Florida2530", "ReviewID": "UR116281672", "Content": "We were glad we booked a room at this hotel, because the location was good, the rates were affordable, and the customer service was excellent. The staff provided free shuttle service to the CTA station, and to Midway. They were very helpful, and even provided maps and directions to places in downtown Chicago that we wanted to visit. The room was clean, and quiet, and they provide a microwave and refrigerator in the room, and also a nice continental breakfast each morning in the lobby area. We would definitely stay there again.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Inwood, West Virginia", "Title": "“Awesome place”", "Author": "Melblye", "ReviewID": "UR116219565", "Content": "Some of the best customer service I have ever experienced, We rented 3 rooms and were pleasantly surprised at the cleanliness and outstanding service. Great experience.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Awesome people, awesome stay.”", "Author": "pburke17", "ReviewID": "UR116091487", "Content": "The room was very spacious and lovely. The service was great, and they took care of us very well. If I were ever in Chicago again, this would be the hotel i would stay at, bar none!!!!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“The staff was very nice and helpful”", "Author": "Vallerina30", "ReviewID": "UR116041791", "Content": "The room was very clean and nicely decorated, the staff was extremely helpful and professional. The hotel is located very close to an orange line stop as well as Midway Airport and they offer free shuttle rides to and fro. there are many restaurants in the area and each room has a microwave and refrigerator in them. They also have free parking for guests which is nice too. This hotel is great for people on a budget, or perhaps people traveling on business, but for someone who wants to take in the nightlife, it's kind of out of the way and I didn't anticipate the extra cab fees I incurred at the end of each night. If the location were a little bit closer I would definitely stay there again, because I did have a very good experience with every other aspect of the hotel and my stay there.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York", "Title": "“The staff could not have been more accommodating!”", "Author": "Trishdiaz", "ReviewID": "UR115769268", "Content": "The Inn does not look like much from the outside. Inside is a totally different story. The rooms are comfortable and clean. The beds are very comfortable . Each room has a microwave, a mini-refrigerator and a coffee maker. A complimentary continental breakfast is provided each morning ... food is fresh. The room offered everything necessary to work from the road. The staff could not have been more accommodating. 4 business associates also stayed at this hotel this trip, and everyone had the same experience. We'll be back.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Peoria, IL", "Title": "“Great Place!!”", "Author": "cleocat63", "ReviewID": "UR115737336", "Content": "My friend and I drove 2 1/2 hours to Chicago on a Saturday for a funeral service which was at 12:30 in the afternoon. We decided to drop by the hotel when we got into town at 11:00 a.m., just to see if our room happened to be ready (since check in wasn't until 3:00 p.m). We were pleased to hear that our room was ready!! The employees at the Carlton Inn were VERY pleasant! The room was very clean and very modern!! We will definitely be back to the Carlton Inn at Midway when we return to Chicago in the future!!! Nice place!!!", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Accommodating, reasonably priced, convenient location.”", "Author": "JoelandMandy", "ReviewID": "UR115575138", "Content": "No other hotels near Midway are this close to the Orange Line. It was so convenient to have breakfast (they provided Dunkin Donuts sausage, egg, and cheese bagels), get ready, then hop on the L for a 22 minute ride into downtown. The room was clean, and the beds were comfortable. Any time we needed extra towels or anything, they were at our door in a snap. They helped us with directions to local spots, picked us up from the airport, dropped us off at the airport, even took us to get CTA passes. If you're spending the weekend in Chicago, definitely consider Carlton Inn. We saved a ton of money staying out by Midway rather than downtown. And we were still able to do everything we wanted!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bloomington, Illinois", "Title": "“A+++ Hotel, Definetely Recommended”", "Author": "MadAtEachOthr", "ReviewID": "UR115542222", "Content": "Me and my husband was on a trip to Chicago for sightseeing and we stayed in three different hotels (Key Lime Cove,Carlton Inn Midway and Hyatt Regency) ... Out of them Carlton Inn Midway was the best hotel we stayed. It is very close to the train station and the accesibility to downtown chicago is way too easier and good. We had no need to take our car and the front desk was absolutely helpful and they was beyond appreciations. I would personally like to acknowldege the courtesy of the front desk receptionist \"Ms.Valerie\" . She was so patient and had all details instantly.. She explained each and every routes clearly. The rooms were the best and upto the mark. Its a very good place and I would definetely recommend to all my friends. They offer complimentary breakfast,wi-fi. There is a microwave and fridge too. I will visit again.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Bernardino, California", "Title": "“More than I expected! Better than some of the big names!”", "Author": "Nando_27", "ReviewID": "UR115199438", "Content": "It was a nice surprise the quality of service at this smaller, intimate hotel. If you are looking a nice hotel where you don't want to get lost in the elevators, different hallways, and want to find easy access to the city... this is a great place. People are helpful! Close to the Metro station and to Midway Airport.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Erie, Pennsylvania", "Title": "“Great service great staff”", "Author": "lizd15", "ReviewID": "UR115194049", "Content": "We stayed there on our trip to Chicago and eveery morning there was a great breakfast and when there wasnt donute the staff provided them for me and the Dunkin Donut breakfast sandwiches were great every morning. And every morning we asked for deirections to certain locations in Chicago and they didnt hesiate to help us with everything we needed. And when it was time to come back to the hotel we called for the hotel shuttle and there was little to minimal wait. Also they were great with getting me my clean towels every day ansd when we came back the bed was made and the clean towels were ready for the nightly shower. Also my digital camera battery died so i call the hotel and in ten minutes tops they gave me directions to the nearest Best Buy in Chicago. If we ever make another trip to Chicago we will most definitly staythere. Great service great Staff!", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“We'll stay again when we're in Chicago”", "Author": "Snowbiker", "ReviewID": "UR115100905", "Content": "When we first drove up to the Carlton Inn, I thought I'd made a mistake. But it lived up to its reviews. The staff was so friendly and helpful. They went out of their way at every turn to make our stay pleasant. The room we had was large and clean. Free internet was a plus since many higher priced hotels charge for it. We were there four nights. The location is great; very close to the train to the city. They offered to drive us 1 1/2 blocks to the station but we chose to walk. They also offered to drive us to a nearby restaurant and again we chose to walk. Their offers were much appreciated though when we walked too far and they came and rescued us! We will definitely choose this place again when we want to stay near Midway Airport.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stockbridge, Georgia", "Title": "“Affordable, convenient, great service”", "Author": "Abider", "ReviewID": "UR114723958", "Content": "When I first began researching hotels in Chicago, I was shocked at the expensive prices of rooms downtown, and the additional expense for parking a car (sometimes $30 a day). Because of the moderate room prices and good reviews, we decided on Carlton Inn Midway and were not disappointed. It is not a new facility, but neither is it in disrepair. It is clean and with all modern conveniences, and parking is free. It has a parking lot with entrances to the rooms from the lot, but with someone in the lobby 24 hours a day it feels secure. The neighborhood is one of mixed ethnicities, with a high school right across the street and a good Greek restaurant next door. We felt safe walking around in the area. The only inconvenience is that it's a 20 to 30-minute ride on the train to downtown Chicago. You just have to plan accordingly. After experiencing Chicago traffic, we decided to park our car at the inn, get a CTA 3-day pass, and take the elevated train into the city for sight-seeing. The Orange line Pulaski Station is very close by, within easy walking distance. The folks at Carlton Inn offered to take us to and pick us up from the station in their van if we didn't want to walk. They also furnished maps and information about restaurants, tours, and driving directions when we left. Everyone in the office was very friendly and helpful. Someone in a previous review mentioned the dog in the office. The owner's dog spends the day lying around in the office pretending to be an area rug. He's some sort of large terrier, very cute and completely passive. For breakfast, the sausage/egg/cheese bagels are substantial, but there are lighter offerings as well--a good selection. Our next trip to Chicago, even if we fly (it's one stop from Midway Airport on the train), we'll plan to stay at the Carlton Inn Midway. It's affordable, convenient, and the service is great.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "BelÃ©m, Brazil", "Title": "“Not so good...”", "Author": "DavidNormando", "ReviewID": "UR113286064", "Content": "I had staied at this hotel on May. The hotel is noisy and a dog is always in the lobby. The staff is really careful, except for the dog.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Great Place”", "Author": "Gail_HTucson", "ReviewID": "UR112642990", "Content": "My wife and I plus a couple of friends were in Chicago to attend an annual training seminar that we have been coming to for years. Sinnce we were flying into Midway Airport rather that O'Hare this time, we looked for a hitel near the Airport. We found the Carlton Inn Midway in our AAA book and decided to try it. A great decision as it turns out. Hotel is neat, clean, and user friendly. Staff is extremely helpful in aiding people to be able to get around the town, suggesting good local places to eat, and sights to visit. We are looking forwaard to next year already.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stillwater, Oklahoma", "Title": "“Fulfilled Promise it made”", "Author": "Dipanjan_Dey", "ReviewID": "UR112621745", "Content": "I went to Chicago for a one day trip with a friend of mine. The free pick up facility is awesome looking at the fact that I went to Chicago for the first time. Its location is another advantage as it is minutes drive away from the Midway airport and CTA orange line. The reception was friendly and courteous. The room was very clean with king sized bed, clean sheets and toilets. Additionally it had fridge, coffee maker and study table. Since the booking was for one night only checked out the next day after availing the complimentary breakfast. The staff at the reception in the morning was again very friendly. They gave us a one day CTA pass and also explained the points of interest in Chicago one must visit along with a CTA map. I would definitely stay again there.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleethorpes", "Title": "“Good clean motel & friendly”", "Author": "meggie19", "ReviewID": "UR110540635", "Content": "Stayed here in march due to family illness. My 1st time in a motel as i normally stay in the bigger hotels with flight deals. This place did not disappoint as other posters on here have said. This did help me decide on staying here. The room is spacious with a queen bed, tv, fridge, table & chairs etc. The staff are very friendly & helpful. They do a breakfast bun,bagel,fruit,orange juice and coffee. If you need to go down town you can order a yellow cab and costs about 25 - 30 dollers over all I would definately stay here again when in Chicago.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Greensboro, NC", "Title": "“What a motel should be...safe, convenient, and priced right”", "Author": "slowee08", "ReviewID": "UR108999690", "Content": "I had a short business trip to Chicago and stayed at Carlton Inn Midway based solely on TripAdvisor reviews. This is a motel and the rooms face the outdoors. If that makes you uneasy, I don't recommend staying there. Personally, I had no problem with it. It is literally minutes from the airport and the CTA train and the motel shuttle is available to hotel guests. The price was less than $100/night and they also offer weekly rates. The rooms are clean. Wifi available. Public computer in the lobby. Fitness Center. And restaurants nearby to walk to. Oh and the staff is superb!", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“They treat you like family.”", "Author": "JDSimmons", "ReviewID": "UR108840550", "Content": "This is probably one of the best-- if not the best-- hotel I've ever stayed at. It's not super swanky, but the service was absolutely exceptional. I chose this hotel because it was the cheapest hotel that was the closest to the center of Chicago. Because the rates were so much cheaper at the Carlton Inn than at other hotels in the city, I really wasn't expecting much. And then they completely blew me away with their outstanding customer service. I had accidentally booked a smoking room and they upgraded my friend and I to a bigger, non-smoking room at no extra charge. Upon learning that it was my first visit to Chicago, they also provided us with maps and tour booklets and explained the train system to us. They offered to help us plan our sightseeing trips once we decided what we wanted to see. Talea was running the front desk when I checked in and she gave me her business card and told us to call anytime, day or night, if we had any questions, or got lost and needed help getting back to the hotel. A driver was also available to take us to buy public transit day passes, as well as drive us to, and pick us up from, the train station. By the time we left, they knew our names, where we were from, and why we were in Chicago. Every time we walked into the office, even if it was just to grab a bagel or a takeout menu, they chatted with us and asked us how our stay was going. They did everything they could to make our stay comfortable and memorable. Location: the location is great. It's only two or three blocks from the train station, so downtown Chicago is quite convenient. Room: the room was small, but very clean and comfortable. The internet connection was a little slow, but the hotel was so hospitable otherwise that I hardly noticed. Breakfast: Breakfast was simple, but fresh. They provide yogurt, fruit, fresh donuts, bagels, and bagel sandwiches from Dunkin Donuts, as well as coffee, juice, and tea. They also provided little trays so that you can carry breakfast back to your room, if you wish. I really appreciated this little added convenience. While I stayed at the Carlton Inn, I felt like I was a guest in someone's home, rather than a hotel customer. Every time I go back to Chicago, I'll be staying at the Carlton Inn. They have really set the standard for hotel hospitality. It's so clear that whoever runs this hotel really has a passion for what they do and they pass that enthusiasm down to each of their employees. I've never been more satisfied with an overall hotel experience.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Fabulous service, excellent rates.\"”", "Author": "SeattleMeadowlark", "ReviewID": "UR108717985", "Content": "Had I judged a motel by its appearance rather than by the reviews I saw on Trip Advisor, I would have driven right on past it. Not that it's bad, just that its appearance is that of hundreds of other, older motels. Passing it would have been a huge mistake. For its appearance belies the world class service you get when you walk in the door. No! It starts when the very nice driver picks you up from the Midway Airport. He told us where to get the best pizza in town is. The staff is friendly, knowledgeable, and eager to help. They gave us maps and taught us how to navigate the subway/train system, called the El. The boss, Gary, took us to a nearby Walgreens to buy our El tickets, as you can't buy day passes at the station. He then drove us to the El station and said if we needed a ride back, just call. The station is about three blocks from the motel, not far at all for me and my hiking husband. Everyone was so very generous with their time, so eager to make our stay a good one. Buddy, the Wheaton Terrier, was quiet, friendly, and politely asked for a belly rub. We didn't oblige him, which was okay with hi Our room was spotlessly clean. The carpet is new and clean. The bed was comfortable with good sheets and real pillows. Even though you are next to a major road and the air traffic is overhead, the room was relatively quiet. The bathroom was again, spotlessly clean. Even the applicances were clean. OK, so it doesn't look like the Ritz on the outside. But the service is on par with any Hilton or any other hoitytoity, over-priced hotel I've ever stayed in, and a lot less expensive. Do not drive past the Midway Carlton Inn. Stop and find out what good service REALLY looks like.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Does not stand out when you first see it, but was a definite gem!”", "Author": "UWarrior84", "ReviewID": "UR108256575", "Content": "The service immediately from the check-in was excellent. Anything we asked about the local area or the Inn were answered. If we ever return to that area of Chicago or need to pass through, we would stay there again. The room was cleaned very well and there was plenty of space.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambria, Illinois", "Title": "“Very wonderful!”", "Author": "Melaniea76", "ReviewID": "UR107190982", "Content": "Stayed there Wed thru Fri this week. Wonderful experience, very friendly staff, nice clean rooms. Close to everything we wanted and had a nice restaurant down the street. Staff couldn't have been nicer. Highly recommended! Four stars!", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Nashville", "Title": "“Great Find, friendly staff”", "Author": "NurseDebbie", "ReviewID": "UR106960853", "Content": "This was a great find. A small hotel with a great staff, plus a sweet dog to boot. They have a shuttle that will take you to the convention center for a low price. You get a fridge, microwave and coffee maker in your room. There is a market about a block away so you can stock your fridge with water or soda. Also Ice cream store within walking distance and a Mexican restaurant. They havea small fitness room but it has what you need. The neigborhood around the hotel driving in seemed a little on the rougher side, but I felt very safe walking to the store by myself. Would stay here again.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Affordable Hotel With A Great Staff”", "Author": "campbell_rl", "ReviewID": "UR106516363", "Content": "When I booked a room at this motel, I honestly wasn't expecting much. All I knew was that I was on a budget and it was affordable. However, my stay was much better than expected. If I could, I would actuall give the hotel 3 1/2 stars, but since I cannot, I went higher rather than lower because of the amazingly helpful staff that was great for a first-time visitor to the city. Pros: 1. Again, the staff was amazingly helpful. I was able to get around the city with ease because of their help, which I did not even need to ask for. It was offered freely. 2. The hotel is located within walking distance (approximately a quarter mile) of the orange line of the elevated train, which can take you from the Midway airport all the way to all the downtown attractions for very little money, and you can transfer to other trains to get to where the orange line does not go. Because of that, I ended up never needing my rental car. 3. Continental breakfast daily. I cannot give a full review of this because when I went to eat, it was almost time for it to end, but despite that, the food that was left still tasted fresh and there was a nice variety. 4. Free Internet. Of course, most hotels and motels have this nowadays, but it is still a perk and worth mentioning if you are staying here anyway. Cons: 1. The room was a bit on the small side, so depending on how much time you plan to spend in your room, you might find it is too small for your needs, though it does have all the basics in the room. 2. The exterior wall is apparently a bit thin and while the neighborhood isn't extremely noisy, when a loud noise does happen outside, it can be heard pretty clearly. 3. The bathtub, like the room itself, is a bit small and the water pressure is low. And lastly, this could be a pro or a con depending on your preference, the beds have a pretty firm mattress, rather than the extremely soft ones you find in the big chain hotels. Overall, though, the hotel well exceeded my expectations and I would have no complaints about staying there again.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“A diamond in the rough”", "Author": "businesstraveler212", "ReviewID": "UR104921136", "Content": "What a pleasant surprise. I booked this hotel because of the reviews on Tripadvisor and I was pleased. The accomodations are nice, comfy and cozy. The rooms were very clean and nicely decorated but most importantly, the service was great. The only reason I rated down on the location is because It isn't in one of the most desirable neighborhoods. However, the free transportation compensates for this. I would highly recommend this hotel to others visiting chicago and flying through Midway Airport looking to reduce costs.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Great choice”", "Author": "TomDiroff", "ReviewID": "UR104023022", "Content": "The Carlton is a very nice budget choice when going to Chicago. The rooms are very reasonable for the price but the hospitality by the owners is awesome. They offered to take us to the EL or other near by locations without any hesitation. The motel is close to a nice family restaurant and the EL station so we were able to go to the city during the day and stay close to the motel at night. We would stay again", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dousman, Wisconsin", "Title": "“Clean, Updated Rooms & The Friendliest/Caring Staff Ever!”", "Author": "nkelley83", "ReviewID": "UR101966079", "Content": "We came into the Chicago area from SE Wisconsin to see a show at the Congress Theater. We decided on staying at the Carlton Inn because of the free parking, free 24/7 shuttle to the \"L\" train system, proximity to the train, price, & what really sealed the deal were the great reviews written here on Trip Advisor! When we arrived, the staff remembered what we were coming in for & had all the info. on the train system pulled up & mapped out for us. I was pleasantly surprised as to how much they seemed to care about us feeling comfortable on the train system & having a good time at our show! When we got to our room, I was pleasantly surprised yet again, as to the cleanliness, neatness, size, & overall feel of the room. Yeah, the room may not have a pillow-top mattress, flat screen TV, or fancy shower head, but it was updated enough to fit in with this century & I didn't feel like I went back in time or anything. It certainly had everything that we needed or expected in that price point. Everything considered: proximity to train/location, price, staff, look/cleanliness of rooms, etc., you just can't beat the Carlton Inn!", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bandera, Texas", "Title": "“The Absolutely Best Hotel Experience Ever”", "Author": "TexasTravelerx3", "ReviewID": "UR101323194", "Content": "When we pulled up we weren't sure about our choice, so I asked to see a room. I was impressed with its contemporary look, cleanliness, frig, and microwave. I am so glad we stayed! The shuttle was fantastic and the continental breakfast would satisfy any appetite. (We didn't have time to use the exercise room.) The best part was the staff - they treated us like royalty. They went above and beyond the call of duty in accommodating our extended stay (due to overbooked flights during spring break). I left feeling like I'd made new friends. I never would have guessed I'd find such hospitality in a big city. The people make this fine motel outstanding!", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great value and service - zero complaints!”", "Author": "SearsFamily", "ReviewID": "UR91035950", "Content": "Stayed on a short family vacation trip to the Chicago area around Christmas. Was only expecting a decent, inexpensive place to sleep, but what a nice surprise this turned out to be! Room was very clean and quiet (even with Midway airport not far away). Super-friendly staff really went out of their way to be helpful. Parking lot was a safe place to leave the car while using public transit (walking distance to a station, although the hotel shuttle van can take you there). Our room had a mini-fridge, microwave, and good choice of TV channels. Shower and beds were fine as well. An on-site exercise room was a nice perk, too, and we had it all to ourselves. I'm rather picky when it comes to hotels, and have seen plenty of good and bad ones, but I was genuinely impressed with this place. We plan on returning.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Troy, New York", "Title": "“Clean & Comfortable, great staff. Very close to train.”", "Author": "TravelingGranny18", "ReviewID": "UR87412676", "Content": "This is a nice Motel. Clean & comfortable, microwave and refrigerator in your room. The staff is excellent, very helpful explaining how to get around. Offered rides to trains or other local areas. My husband & I took a wrong turn when coming off of train and were lost, we called the motel and they sent their driver to pick us up. When we first checked in there was a problem with our room, we notified the front desk, they came immediately to check on it. It could not be repaired right away, so we were given a new room and they even offered to help us make the move. The train is just a few minutes walk away and takes about 20 - 30 minutes to downtown Chicago. The best thing is, you are paying at least $100.00 less per night than if you stayed in downtown Chicago.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Seattle, Wa", "Title": "“Clean Motel with friendly staff @ a very good price”", "Author": "LyonsGate", "ReviewID": "UR86783547", "Content": "This is a great value for Chicago. It is close Midway but not right on the \"strip' with the other more sleazy motels. It is also an easy walk to \"EL\" train stop with service on the Orange Line to downtown. There are good Meican restarants in the area. The counter clerk was helpful. . The room was quite large with 2 beds and a table with 2 chairs. Fresh fruit, yogurt, coffee, juice, donuts and bagel egg sandwiches were free at breakfast. Parking is free and the TV had quite a few premium channels i.e. H.B.O.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Visalia, California", "Title": "“A Hidden Treasure”", "Author": "MyronS", "ReviewID": "UR85364478", "Content": "Read the reviews before selecting this place for a 5 night stay. The reviews were on target. This is a great value for Chicago. We were picked up promptly from Midway by a courteous and helpful driver, Steve. He pointed out some places to eat as we drove in. The counter clerk was equally helpful. Printed out some information that we needed and provided some good tips. The rooms are nothing fancy, but clean and fixtures fairly new. Roomy enough for the price. Rooms were quiet. Internet access was free and quick. Complimentary fresh fruit, yogurt, coffee, juice, donuts and bagel egg sandwiches were nice when we didn't want to go out. The area surrounding felt safe to walk. The Orange Line Pulaski station is a very quick walk away. From there you can get anywhere. This place is very near some great restaurants (Giordannis and a new, excellent Mexican restaurant). There are also grocery, $1 stores, Subways, and a nice ice cream parlor all very nearby. Although we didn't have a car this time, parking is free. All in all a great reasonable stay. We will definitely use this palce again when we visit our son in Chicago.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winnipeg, MB, Canada", "Title": "“Budget Lodgings- Good enough for most”", "Author": "Novaya", "ReviewID": "UR80768260", "Content": "We booked our stay online about 2 weeks in advance- the rack rate was about $95/night- midweek stay - Reasonable rate for a location that was 20-25min by L-Train to downtown, plus free parking. We stayed at Candlewood Suites O'hare a couple nights before on the weekend, and to compare they had a $65/night rate, plus a full kitchen although location was not as close to the train, and there was no breakfast included. (Candlewood was a nicer stay overall, although Carlton Inn was acceptable also. We had a car, but didn't want to drive downtown , so we thought staying closer to a train stop was a good idea- which it kind of was...) Check-In was smooth- Desk clerk was fast & friendly- even gave us a list of recommended places to eat closeby. Room was clean- airconditioner was on in advance which was nice- available of a fridge was convenient (although it wasn't plugged in, we discovered the next morning that we had to plug it in directly rather than via the microwave, which wasn't working). Bathroom was a bit small in our room- a small pedestal sink with a shelf above it was all you got for counterspace- but it was adequate I suppose. Soap & shampoo were in a dispenser. Towels were white and fluffly & clean looking. Bathroom was clean overall & water pressure was decent, and hot water available very quickly. Room itself was on the dark side- area lighting was good, but even when everything was turned on (bedside lamps x 2 , worktable lamp, bathroom light w/ door open- the room was still fairly dim... maybe alright for some people- I like my room to be bright- better to see everything is clean, where all my stuff is...) Room was a nice size- had a separate desk area - the free highspeed wireless internet worked well for us. We had to call the front desk for the passwords. TV was a CRT- channels were decent. Breakfast was nicer than the average continental variety- The bagel w/sausage & egg was good especially with the thoughtful instructions about how to reheat - There were also doughnuts, oranges, apples, bread/bagel for toasting, coffee, tea. A decent enough spread. There was one computer in the lobby area which was free to use- also free printing which was nice. My gripes (mostly not the hotel's fault)- Since it was a motel setup- 2 floors, 2 separate buildings, the parking spots were not always ideal, especially if you don't get your spot early on- first night the closest parking spot we got was way on the other side of our building- so with our luggage to haul in, it wasn't convenient- but I guess with all the rooms they had, there's no way to guarantee a spot close to you room. Also, since it's a motel setup- there's no way you can open up your drapes (to make the room brighter) without losing all your privacy (especially on the 1st floor)- plus we had a hard time overlapping the drapes closed so that people couldn't see in. With a 1st floor room, you get a lot of noise pollution potentially. We had a maid on the first morning talking with a friend or a cellphone to her buddy in spanish just outside our window-- woke me up. Also some other guests (inconsiderate) had a meeting/long conversation somewhere outside our room and you could hear almost every word. If you are a light sleeper, maybe request a 2nd floor room. Overall - a good stay for our first time in Chicago. We went mainly for see the city and eat with some other touristy distractions like museums thrown in. Next time, we will stay somewhere more north of downtown- that seems to be where a lot of the restaurants & stores we are interested in are located. This location was quite adequate though- no real complaints.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fantastic service and value - would recommend it to anyone”", "Author": "christina1970", "ReviewID": "UR76581970", "Content": "My cousin, bf and daughter went to Chicago for 5 days this month. Our entire trip was about ball games and site seeing so all we needed was a clean and comfortable room. We go that and much more. It was a little out of the way of the downtown area but the trains are right there and they were amazing with shuttle service. It was super quiet and plenty of room. We were all pleasantly surprised at how great it was and how incredibly friendly and helpful the entire staff was!!!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“EXCELLENT!!!!”", "Author": "angelmisener", "ReviewID": "UR76126755", "Content": "The staff here was just excellent and so accomodating.. I am definately staying here during my upcoming visits. A++++++++++++++", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Worth the stop”", "Author": "jadenj", "ReviewID": "UR75351463", "Content": "I decided to stay near the airport with an early morning flight but did not have reservations. I stopped here and found the staff was very accomodating and the accomodations were a good value. The location was great to make my morning easy. I would definitely do this arrangement again.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alberta, Canada", "Title": "“Great staff, Great rate, Great stay”", "Author": "Altamom", "ReviewID": "UR74474246", "Content": "Our family of four stayed at this motel while travelling through the Chicago area based on the reviews on TripAdvisor. We were not disappointed. Check in was easy and the gentleman who checked us in was very helpful, even recommending a great restaurant for Chicago-style pizza which turned out to be very good. The motel is within walking distance of the orange line for reasonably priced access to downtown Chicago. We drove downtown the next morning on a Saturday (no rush hour) and arrived at Navy Pier in about 10 - 15 minutes. The room was clean, smelled clean (we booked a non-smoking room), and the bedding and towels were adequate. Appreciated the complimentary breakfast which we took back to our room to eat...Dunkin' Donuts breakfast sandwiches, donuts, yogurt, fruit, bagels with cream cheese, coffee, tea, and juice. We made use of the free internet on the computer in the small lobby. When we checked out, the hotel staff (Gina in particular) provided us with several options of good routes to take to exit the city. We would definitely stay at this friendly motel again (great value...under $100 for Chicago) and would recommend this motel to friends.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great place, friendly staff!”", "Author": "ValAsare", "ReviewID": "UR72915772", "Content": "My family and I stayed here this past weekend when we traveled to Chicago for a wedding. The rooms were clean and the staff at the hotel were very friendly and accommodating. We really loved the location because it was readillyeasily accessible by train from both Midway and Downtown. Thanks great service and excellent breakfast!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coldwater, MI", "Title": "“Unexpected Stay, turns out better than planned”", "Author": "Granfair", "ReviewID": "UR72910581", "Content": "I was visiting friends, when they had to leave for an unexpected family emergency. I was referred to the Carlton Inn- Midway, and was pleasantly surprised with my visit! Warm and friendly staff, well maintained and clean, and convenient access to the orange line and downtown. Felt like I had received more than the price I paid...Thank You for the great stay!! We'll be back!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, Canada", "Title": "“Exceptional Rooms and Staff for the Price”", "Author": "Until_It_Sleeps", "ReviewID": "UR72360088", "Content": "I had a very pleasurable experience at the Carlton Inn Midway. The only room with two double beds available was a smoking room, and I was hesitant about the potential for a stale smell and dirty sheets and such. We arrived in Chicago late at night and the front desk were more than helpful in providing us with plenty of maps and brochures for downtown activities. We got to the room and were very pleasantly surprised with the level of cleanliness and quality that we found. The room had a microwave, a coffee maker with several packs of rather good tasting coffee and condiments, and a TV. The beds were comfortable with plenty of pillows. Most importantly, the room smelled as clean as any non-smoking room that I have found in a motel. The bathroom was quite nice as well. In general, the room was extremely well kept and was pleasing. In the morning there were Dunkin Donuts bagels with meat and cheese available in the lobby. There wasn't a lot of room so it is possible that you would have to eat in your room or outside, neither of which I see a problem with. There was also some water, coffee, yogurt, and a few other choices with a toaster. After breakfast was when the staff's generousity really came into play. Although we only booked one night at the motel and had said that we would be leaving that day, they allowed us to leave our vehicle parked in their lot for the day while we went downtown so that we could avoid parking costs and the hassle of driving downtown. They also gave us a lift to Midway station instead of the closer Pulaski station on the Orange Line so that we could purchase a daypass ticket and were helpful on telling us the route that we should take to get to each of our planned destinations. When we got to Midway it turned out that they no longer sell day passes, so as a future reference for those visiting and taking the rail or busses you can save your time and have them drop you off at Pulaski station and save about 10 minutes. The parking and shuttle were both free of charge. The neighbourhood was also fine. Nothing exceptional and probably 15-20 minutes from downtown by the rail and was nothing special, but it was a decent enough neighbourhood for walking in and finding food and such. If I return to Chicago and need a cheap place to stay with great service, I will definitely be looking up the Carlton Inn Midway location again! Definitely recommend!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Average,remote but saved by competent staff”", "Author": "Weedinthewind", "ReviewID": "UR72352161", "Content": "Average motel,out-of-the-way but the staff personified professionalism. The driver works almost around the clock and offers to pick me up at O'Hare which is far away. The receptionist handles customers with grace and tactfulness,juggling phone calls and alternating between English and Spanish. Possibly because of its location,the rate is lower but the walk-in rate is lower than that on internet.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "FLL", "Title": "“Smokers only hotel-unsafe health conditions”", "Author": "DougFLL", "ReviewID": "UR72056571", "Content": "We booked through hotels.com two non-smoking rooms, but when we arrived there were none. They said that Hotels.com does not specify non-smoking room. But beyond that, the air conditioner was clogged full of mold and mildew, blowing out water. We had to end the stay as we were all getting ill. The hotel mainly caters to international airline crews who smoke. The manager promised a refund, but after we left town he reversed the refund. We plan on reporting this to the Chicago Board of Health, BBB, etc. Be wary of the Carlton, and we wonder who writes the good reviews on this property. Staff was friendly, but the manager lies with a smile.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Super”", "Author": "gioveny", "ReviewID": "UR71035185", "Content": "Great experience i suggest this hotel to everyone", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "scorney", "Title": "“The Midway Inn was simple but comfortable.”", "Author": "scorney", "ReviewID": "UR70635906", "Content": "We really enjoyed the Midway Inn. We needed a place close to Midway airport, but close enough to the city that it would be easy to get to. The friendly people at the Midway Inn picked us up at the airport very late at night, and the next day were willing to drive us to the train station that is easily within walking distance. They provided us with maps, and good advice. Also, the room was very comfortable, and the free breakfast surpassed our expectations. We would stay here again definitely.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macon, GA", "Title": "“Wonderful moderate hotel with the friendliest staff I have ever encountered”", "Author": "ChuckMacon_GA", "ReviewID": "UR64879337", "Content": "Minutes from Chicago's Midway airport, this motel is conveniently located to downtown Chicago either by car or the El train. The hotel is located in a large hispanic neigborhood. We were uncomfortable at first, but realized it was safe at all times. The rooms were clean, the beds comfortable, the staff the friendliest and most helpful I have ever encountered in the US or Europe. The free shuttle wil take you to the airport or to the nearest El train. The modest breakfast was excellent (they served Dunkin Donuts breakfast sandwiches - egg, sausage and cheese between a bagel) as well as donuts. There is free parking (other downtown hotels charge for parking).The only negative was they put us in a handicap room to begin with. We checked out for a day (travel to another city)and came back to a regular room which was much more spacious.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kalamazoo MI", "Title": "“Great Experience, Great Time”", "Author": "Chachi06", "ReviewID": "UR61042220", "Content": "To start just want to say AMAZING customer service. Willing to drop us off at the train station that is easily walking distance from hotel. And being a tourist was great, they gave us tips on how to save money in the city. My g/f and I were planning on taking a taxi in and out of town both days, which is quite expensive, however, the staff told us we would save a ton of money just taking the train in. So THANKS A TON for all the help. They also helped with where we could go while in the city that was less expensive and still fun. We got to the room and the room was very nice and clean. It may be a little ways out of the city but its still very very nice for the price. I only have one problem and that would be that it is kinda far out of the city. But that is easy when the train station is right around the corner. And if you are thinking on going the train into the city is only 2.25 one way from the hotel, which is a very good price.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Louis2010Louis2010", "Title": "“Great Customer Service!”", "Author": "Louis2010Louis2010", "ReviewID": "UR59335930", "Content": "The accommodations were good enough for what we needed. Keep in mind it is a motel and thus the great rates. They definitely made up for it with great customer service and shuttle rides available to the airport and train on a whim. Very convenient and perfect for saving money on a business trip.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lisle, Illinois", "Title": "“Great Value and Great Staff”", "Author": "gfg01", "ReviewID": "UR46645117", "Content": "We stayed at this hotel the night before an early flight from Midway and what a pleasant stay it was. The rooms were clean and up to date and the TV had probably 200 channels. The staff really made our stay by informing us that we could jump on the train, right around the corner, and be downtown in 20 minutes. We did just that and had dinner at a restaurant that was personally recommended by the manager. The next morning at 5 a.m., we came down the stairs and the driver was waiting next to the van with the doors open to take us to Midway. Best of all, we paid $25 less than the other hotels in the area-this place is a gem", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Ann Arbor MI", "Title": "“We loved this Welcoming, Safe, Dog-friendly, Fair-priced Inn near Chicago”", "Author": "FritziFro", "ReviewID": "UR37399104", "Content": "We felt welcomed and safe by the friendly staff and always present security guard at this clean, well-maintained inn. For the price, which is reasonable (about $100 per night), you really get a lot for your money. We were surprised at how nice they were about our dog. We paid $5 extra per night, and they even had a little doggy \"welcome package\", with a handkerchief, bones, and treats for him. The continental breakfast was also really nice. This hotel is NOT central to Chicago's tourist sights, and the neighborhood is not fancy, but we felt pretty safe, especially because of the security guard and well-lit parking lot.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Aalborg", "Title": "“Great staff”", "Author": "PeterV00", "ReviewID": "UR30420161", "Content": "Stayed there there one night to fly out the next day. The room was nice and clean and there was free transportation to the airport in the morning. The staff was really nice and helpfull. Not the greatest neighbourhood but felt safe and it is close to a metro station and Midway airport.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“Clean and fresh! Great location!”", "Author": "Mr_ken_Iowa", "ReviewID": "UR27555869", "Content": "I drove in from Iowa. Parked for free at the hotel, and then explored the city by the CTA's L train. I am thankful I didn't need to deal with the downtown parking hassles and expenses ($20-40 per night at the hotels). Room was great- as clean as the reviewers have already mentioned. Staff was so helpful- more so than at many fancier hotels. I must've seen two dozens museums in my week long visit! A truly fascinating visit to Chicago!", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Impressive, Outstanding, Spectactular,”", "Author": "brijoli", "ReviewID": "UR23239285", "Content": "As I work for a major hotel chain and due to location, it was not beneficial, I chose to stay in this area. I tend to be more critical of properties and in this case I was totally impressed!!! First that the staff at this hotel is amazing, quick, friendly, professional, and helpful!!! From simple questions to quick delivery of an ethernet cable to meet my needs. Outstanding!!!!! I checked the room and found that it was in great condition and very clean for both general cleaning and overall cleaning. I was very impressed that the hotel offers single serve coffee machines and the nicest factor was that they have dispensers for shampoo, conditioner, soap, etc so there are NO PLASTIC BOTTLES which is great for the environment. This property is definately a great bargain and is worth it for the service alone. Great job to Carlton Inn Team as you are doing a great job!", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Upper Peninsula", "Title": "“Awesome staff”", "Author": "Flame825", "ReviewID": "UR22550251", "Content": "Needed a couple nights while meeting family coming in from different parts of the world, So I picked this hotel for location to Midway. One family member came in Midway, two others from England at O'hare. The staff directed us and guided us and even shuttled me to a grocery store. My whole family enjoyed the stay. The only disappointment was the fee for my dogs. I don't think a hotel should charge a per night, per dog fee. I was impressed that the owner also worked the hotel. Thank you staff.", "Date": "December 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "scottsdale,az", "Title": "“What a great place to stay”", "Author": "azrailer", "ReviewID": "UR20507157", "Content": "After reviewing this hotel on trip advisor we called the hotel to reserve a room. The staff at this hotel is one of the best we have had the pleasure of dealing with in our many years of travel. At check in they gave us tips on what to see, where to eat based on there personal experience and how to get there. The \"L\" Orange line station is only 2 blocks away and they shuttled us there and back many times during our 4 day stay. You can get to almost anywhere from the light rail combined with a short taxi ride if neccesary.They also shuttled us to Midway Airport when it was time to leave. The room was clean and comfortable and although we were told the airport noise might bother us we really didn't notice. They have a small but sufficient continental breakfast complete with sausage and egg bagels from Dunkin Donuts.This is not a 5 star downtown resort but the staff here goes the extra mile to make there guests feel welcome and provides the best service anyone could ask for. Thanks to them our stay in Chicago was all we could have asked for. We highly recomend this hotel to anyone who does not want to stay in downtown at a 3 to 5 hundred dollar a night hotel.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PITTSBURGH", "Title": "“QUIET, SAFE, CLEAN”", "Author": "PittsburghTripper", "ReviewID": "UR16735203", "Content": "My cousin and I had been at a B&B and were disappointed. We wanted something near Midway where we could tour the city and then come back relax, have some popcorn and watch TV. We wanted to \"hunker\" down for the night and wake up early. The motel is nothing fancy but it sure is CLEAN and quiet with a nice table for reading the newspaper, etc. The staff is VERY helpful. We would stay again.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lawrence, KS", "Title": "“Felt like home”", "Author": "MAJx4", "ReviewID": "UR11076331", "Content": "Even before I got to my room, I'd already experienced a warm connection to the Charlton Inn Midway staff. The shuttle came to the airport quickly and the driver was friendly. The reception I received from the check-in staff was courteous and they spent a generous amount of time showing me how to use the public rail-system to get downtown and gave me information on many sights to see. The room itself was clean, updated and spacious. The continental breakfast was filling. This was my first trip to Chicago and, although it was too brief, whether I return alone or with family, I already know I'll be staying at the Charlton. My thanks to everyone for making my stay so pleasant!", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Utah", "Title": "“So friendly and helpful”", "Author": "UtahLuv2travel", "ReviewID": "UR10210760", "Content": "If you don't need the luxury of a higher priced place to stay, and you want a convenient location with a very helpful staff, this is a good choice. Bathroom facility could be better...like at least a shelf for toiletries; and the only cleansers provided were the gel and shampoo... in the shower. Towels could double as exfoliators! And the telephone was across from the foot of the bed. The Internet was very slow. But we didn't mind as everything else compensated. The staff even offered to drive us to a movie theater 8 miles away!", "Date": "October 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "kalamazoo, mi", "Title": "“Fantastic Service”", "Author": "kdoyle26", "ReviewID": "UR10084018", "Content": "This was a great hotel because the staff is so friendly and accommodating. They are willing to drive you the subway station or bus stop and they were helpful giving feedback on places to go. Place was clean, safe and comfortable. I recommend this to anyone looking for good neighborhood service.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowling Green, KY", "Title": "“Great place to stay”", "Author": "liketotravel033", "ReviewID": "UR10071222", "Content": "Very convenient and nice place to stay. Staff went way out of their way to accommodate us when we left our bag at the hotel. I plan on staying here again in the future.", "Date": "October 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alabama", "Title": "“A great place to stay!”", "Author": "soljerblue", "ReviewID": "UR8666210", "Content": "We've now stayed at Carlton Inn Midway on two successive Chicago tripsover two summers, and would recommend it to anyone, anytime. Its convenience to Midway Airport and the CTA system are good points. The good restaurants close by, especially Pindos, are also pluses, as well as the neighborhood \"feel\" of the area. But far and away, the cleanliness and comfort of the rooms, the courtesy and friendliness of the entire staff, and the reasonable rates put it on top of my list for any trip to the Windy City. You can pick any \"name\" hotel where you'll pay a lot more, but you won't find a better \"deal\" or finer people than right here. Steve Ross Birmingham, AL", "Date": "September 6, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southern California", "Title": "“A nice, economical place to stay in Chicago”", "Author": "Visitor007", "ReviewID": "UR8431625", "Content": "We had a family reunion and celebrated a birthday while at the Carlton Inn Midway in Chicago. The hotel was nice, clean, convenient, accomodating, and knowlegeable about sites to see and how to use the public transportation. The shuttle service was ABSOLUTELY perfect. A nice and affordable stay.", "Date": "August 15, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Jackson, Ca.", "Title": "“Friendly and Helpful Staff”", "Author": "Amadorcounty", "ReviewID": "UR8376522", "Content": "The entire staff (including the two great in resident dogs) were very nice and helpful telling us about great restaurants in area and in downtown Chicago. Nice having a shuttle take us to the airport right when we wanted. Enjoyed having a microwave and refrigerator in our room too. Also liked that the Orange L train was only a couple of blocks away - easy walk. They even did our airline boarding passes for us.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“More than I expected”", "Author": "DE_Jobie", "ReviewID": "UR8362149", "Content": "I was very impressed with the hospitality of the hotel staff. They were very friendly and knowledgeable about the area. Their shuttle took us to and from the airport. Their shuttle even took us to and from the train station even though it was within walking distance from the hotel. They were very helpful with explaining the transit system and transit fare cards to us. Our room was comfortable and clean. The breakfast of Dunkin' Donuts bagels, donuts and breakfast sandwiches was awesome, especially after a stay at a Radisson that provided no free breakfast items. I would definitely recommend staying here. There are several restaurants in walking distance also. We ate at Pindo's, a family style restaurant with good food, good prices and friendly staff that is only two doors down.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good price and location, really great staff”", "Author": "mantaraggio", "ReviewID": "UR8193222", "Content": "The hotel is right on the Pulaski stop of the CTA and is about a 15 minute ride in to the Loop. For the price, the location is fantastic. You can park your car and just head straight into the city. The exterior looks like a standard motor lodge, but the rooms themselves are really nice and beautifully decorated. There's a fridge, a big TV with DVR capability, a desk, a bed with really soft and plentiful pillows. The high speed wireless internet was slow when I stayed there, but they were working on fixing it. The staff was incredibly friendly and helpful. The continental breakfast included coffee, donuts, and Dunkin Donuts egg sandwiches.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“great inexpensive hotel”", "Author": "slivalisa", "ReviewID": "UR8103890", "Content": "The staff at the hotel were very knowledgeable and able to offer information on how to get to many destinations. The room was very clean. Security was excellent. Great deal!!!", "Date": "July 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“A good choice in hotels”", "Author": "drhowarddrfine", "ReviewID": "UR7444830", "Content": "Went to Chicago to visit colleges with my son. We stayed two nights in double beds for the AAA price of about $112/night. I was wary of this hotel because it only had two diamonds from AAA and I had stayed downtown at another two diamond hotel which was not very comfortable. I was pleasantly surprised. The lobby staff were very friendly, giving helpful advice on where to eat and how to use the 'el train'. The rooms had been remodeled just four years ago and were up to date and very clean. The beds and pillows were very comfortable. An in-room refrigerator, microwave and free broadband internet access makes this a top choice for my future visits. You don't get that at any of the other much more expensive hotels that offer \"premium service\". A grocery store, and all kinds of familiar foods are within two or three blocks walking distance but most offer free delivery to the hotel. The El train is only one block away getting you downtown with ease in less than 25-minutes but it's also an easy trip back to the I-55 highway. A couple of channels on the TV were fuzzy and I brought it to their attention. I was in a room toward the back and wasn't affected by the busy street noise, though I could hear a couple of \"big rigs\" during the day. Overhead airplane noise from Midway was noticeable until about 11pm or so but not overnight. Apparently traffic patterns change, too, and the second night I heard none. I deducted one star for this but it did not keep me from getting a good nights sleep. The neighborhood is busy with traffic and I felt somewhat uncomfortable walking it at first, but I then realized my fears were unfounded and I think it's perfectly safe. Asking directions and questions a few times of the locals brought friendly responses. Free coffee, doughnuts and, especially, breakfast sandwiches were another pleasant surprise. My last two stays in Chicago were at the high-end Palmer House downtown. The services offered and available at this Carlton Inn give me no reason to do that anymore.", "Date": "April 26, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Minnesota", "Title": "“Nice lovely hotel!”", "Author": "sacral", "ReviewID": "UR6490218", "Content": "The stay at this hotel was so pleasant. I booked a room after reaching chicago midway airport and the staff kindly let me do it. They were very cooperative. The hotel room has all amenities in it and was very clean. I am glad I stayed at Carlton Inn Midway hotel. I would recommend it to anyone who can/wants to spend $100/night for a neat stay!", "Date": "December 24, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“A family trip to see King Tut.”", "Author": "highwayfreak", "ReviewID": "UR6146658", "Content": "We travelled to Chicago to see the King Tut exhibit at the Field Museum. We wanted a hotel close to the museum, but all were booked due to events occurring the week we were to arrive. We settled for The Carlton Inn Midway and are very glad we did. The place was clean and quiet. We had to arrive very late which we have found to be a problem several places we have stayed. It was not a problem at the Carlton. Although the Carlton is a ways from the museum, we found it actually very convenient. The first day we drove, it was a straight shot with no chance of getting lost. The second day we used the el, a half block walk from the hotel, which proved to be an inexpensive, rapid method of exploring the city. Our kids were thrilled. The best thing about the Carlton Inn was the staff. We were made to feel welcome. They went out of their way to be helpful and accommodating. Future trips to Chicago will find us at the Carlton Inn Midway.", "Date": "November 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bremen/Germany", "Title": "“A good alternative to downtown hotels”", "Author": "Tourist_Bremen", "ReviewID": "UR739139", "Content": "IÂ´ve been visiting the RSNA meeting in Chicago every year since 1997. Last year was the fourth time I have spent a week in the Tangiers motel. It is a middle class motel with all usual facilities. It is quiet at night, non-expensive (last year the weekly rate was $40/day) and clean. You can get a good breakfast at PindoÂ´s restaurant which is only 50 mtrs away. Some shopping malls are also available within walking distance (about 1/2 Mile). With a car you can reach Chicago downtown in 15 minutes.", "Date": "November 4, 2002"}], "HotelInfo": {"Name": "Carlton Inn Midway", "HotelURL": "/ShowUserReviews-g35805-d304277-Reviews-Carlton_Inn_Midway-Chicago_Illinois.html", "Price": "$101 - $147*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4944 S. Archer Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60632</span></span> </span> </span> </address>", "HotelID": "304277", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5b/a3/5ba3783e8566253c5940525f21cb9c9b1large.jpg"}}