{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Right under the flight path”", "Author": "Mark A", "ReviewID": "UR126430866", "Content": "Not a bad hotel, friendly and efficient staff. The restaurant off the lobby is quite good. Rooms are pretty good too. The biggest issue is it is RIGHT under the approach/take off for Dubai airport so you have the noise of a plane every minute or so 24 hours a day. It's a pity", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Sheraton Deira”", "Author": "MartijnG3", "ReviewID": "UR126104394", "Content": "Great rooms with the famous Sheraton beds. Breakfast buffet is great and the swimmingpool at the roof gives you a nice view. Only disadvantage is the distance to the airport. This is quit close so easy for arrivals and departures however every 5 minutes an airplane flies over the hotel which can be quit noisy.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Great place and good value for money”", "Author": "BrianOHDublin", "ReviewID": "UR126033715", "Content": "Stayed here for three nights recently and would definitely recommend it. Staff are all excellent, very friendly and overall the service was top notch. Rooms are fine, food in the restaurant is of a very high standard and the hotel is within 5-10 minutes walking of the Metro. It is also a short taxi ride to the airport so very handy in that respect. Facilities such as a supermaket and pharmacy are only across the road too. Only downsides are the 18 Euro a day Wi-Fi and the fact that the hotel is in the flight path of most planes from the airport but neither particularly bothered me. Would highly recommend it.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Good rooms but quirky service”", "Author": "jhlatl", "ReviewID": "UR125969458", "Content": "The rooms at this hotel have recently been renovated to a high standard and represent excellent value for money. The hotel is relatively close to the airport which makes it handy for a short stop-over as long as you aren't going anywhere else in Dubai. Otherwise, it is a long way from the major business districts and tourist attractions in something of a traffic blackspot. Food from room service is excellent but otherwise, F&B options are pretty limited. The service everywhere in the hotel is, if anything, over-attentive. I am a SPG Platinum, and the fuss they made over me prolonged rather than shortened the check-in. In a similar vein the bellboys were so eager to help that they were falling over each other and both on the way in and the way out, succeeded in dropping my laptop bag...", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“All staff lovely, nothing too much trouble”", "Author": "ClareMo844", "ReviewID": "UR125745957", "Content": "Booked here with a group of friends to celebrate a 50th birthday. We had club rooms which I would recommend spending the extra on as the club lounge facilities were excellent. The breakfast and evening snacks in there were lovely. Our rooms were spotless and of a good standard. The restaurant food/buffet was also good quality and all the staff we came across were so helpful and friendly. We felt it was excellent value for money and would definitely stay there again.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good hotel with the best service I have ever had”", "Author": "Richarddorchester", "ReviewID": "UR125507243", "Content": "Booked to stay here with my partner for her 30th got a really good deal on the room under £80 per night. The hotel is in the old part of town but the service of the staff, free shuttles and the cost of taxis in general makes it a great choice. The room was everything you would expect from a 4star, good bar, pool and restaurant if you like that sort of thing. Staff will do anything for you and really try to make your stay with them memorable. My advice book outside of the beach resort as it will cost 3-4 times more and it only takes 15 mins by taxi at a cost of around £4 only use a taxi never the White private cars as it will cost you a fortune. We had a late flight and ate at the fish Market at the meridian hotel opposite the airport again a must, you literally pick your fish A very happy customer Richard , Dorset", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Tehran, Iran", "Title": "“food lovers! terrece restaurant is wonderful ;)”", "Author": "sara k", "ReviewID": "UR124904512", "Content": "Everything is nice in there,rooms are clean,maybe you need an extera pillow.staff are friendly.foods and dessert are amazing.nice pool and gym..but you won't expect the nice area to walk at the night or for jogging.a little far from some malls like dubai mall or emerates mall or wafi..city center is near of course.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Not quite as advertised”", "Author": "jmarquiss", "ReviewID": "UR123768842", "Content": "Good things first: the Club level at this hotel is just superb. Stay there if possible. The Club Lounge has wonderful, hospitable staff and very good food. It is a lovely place to hang out and recover after a day out sightseeing in Dubai. The rooms at this level are certainly in the five-star category and our two-night stay was very enjoyable. Not-So-Good Things: At check-in, we dealt with a very unfriendly person who was adamant about an extra charge (120 dirhams, or about $35 plus 16% taxes) for a rollaway bed for the 11-year old traveling with us. Our reservations were explicitly for four adults and one child and I had assumed that our full prepayment included all members of our party. We asked to speak to the manager and he assured us that this was \"standard policy\" for all hotels in the region and he wouldn't budge on the extra charge. In fact, our party of five stayed at a total of eight hotels in the region during a 3-1/2 week tour and the Sheraton Deira was the ONLY hotel that charged us extra for a rollaway bed. It was more the hostile attitude of the front desk, rather than the extra money, that upset us. My daughter, traveling with us, is the General Manager of a high-end hotel on the beach in California. She has always told me that the way you are treated by the front desk staff at check-in will remain as your lasting impression of a hotel. This experience certainly proved her right. Please note, also, that while the hotel description says that it is \"centrally located\", in fact it is not within walking distance of any Dubai attraction and you need a cab to get to the Creek, any shopping area, or basically anywhere else you might want to go in Dubai.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tehran", "Title": "“Valuable Stay”", "Author": "Saviz M", "ReviewID": "UR123723111", "Content": "Pros: kind and helpful employees, almost clean rooms, valuable price, near the subway (metro) station good breakfast quality, excellent room service, excellent guest service, closing to airport. Cons: room's window could not be opened, so you can't use fresh air, far from big shopping malls but since access to subway is not difficult, it isn't that important. expensive internet access. Tips: * Subway is closed Friday morning until 13:15, so if you're planning to go by sub, be aware of date & time ;) * if you don't like anyone wake you up to check the mini bar or room service, be sure to put that \"Do not disturb\" sign on the door before you fall asleep. * if you're sensitive to noises and sounds, do not stay at 4th floor under the night club, for me it was OK but some people may be angry :) To Hotel Manager: Please do something about the price of internet access.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Grubby and noisy!”", "Author": "Hurstbourne", "ReviewID": "UR123462844", "Content": "I am writing this review at 2.30am because the room is so noisy it is impossible to sleep. Despite two promises from the duty manager to address the issue, the music from the club upstairs is still so loud that I cannot hear my TV, let alone sleep! On the bright side I could spend the additional sleepless hours cleaning the coffee stains from the cups and the walls. I am glad I am only staying here one (half!?) night. I will never stay here again. Unless you plan to be awake until 3am it would be best you avoided this hotel too.", "Date": "January 22, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Clifton, New Jersey", "Title": "“Middle Eastern legacy LIVE at Sheraton, surely a memorable experience”", "Author": "SubodhKant S", "ReviewID": "UR123290630", "Content": "This is truly a unique hotel in Dubai which offers a true middle eastern experience.I felt so elated during my visit here last week.Here is the detailed version 1) Located in the middle of the Dubai city, Sheraton Deira Dubai is a great place. Situated in close proximity to the Jumerah towers, Sheraton Deira offers great shopping avenues. Sprawling lawns and meandering pools make the stay truly pleasurable. 2) A great place for socializing Club Lounge at Sheraton Deira offers some of the best recipes and delicacies from all over the world. I thoroughly enjoyed the great ambience at roof top restaurant and bar. There is wide array and economy of rooms to choose from. 3) I stayed in business class room, with a grand hall, 24 hrs internet access and room amenities. All rooms are well equipped with accessories and great interiors. Grand and well furnished conference rooms and halls offers a great meeting place. 4) Resort provides holiday packages, and sight seeing opportunities.but the cost is very very high. I visited the sand – dunes and enjoy the desert safari in Middle East through my tour operator I was mesmerized by their hospitality and organization skills. 5) One thing that I will never forget about the trip was the courtesy of their well – groomed staff. Sheikhs serving coffee..haha..you will feel the same as waiters look like mini sheikhs..:P 6) Being in Dubai how can somebody miss upon the shop carnival. I availed of some of the best marketing offers for some of the best brands at most affordable price. Standing tall amidst scintillating sky scarpers it offers a great view of the city from roof top. 7) I booked a 4 day/ 3 night tour package from Antilog Vacations (India) , a Dubai bulk dealer for hotel & sightseeing packages.The rates you get are 20-25% less than market & direct services 8) On the last day of my trip, I sailed across the blue waters of Gulf aboard a star cruise – liner. Great spectacle of the marine life and rich flora and fauna enthralled me craving for more. 9) Do some shopping, if you are rich.Resort has small antique shoppe which offers some of the great masterpiece and relics. I still relish the memorabilia that I gathered. 10) All in all resort Sheraton Deira Dubai brings alive the Arabian Nights and old folklores. It was a great vacation that I will never forget. See you guys soon next December With Love Subodh Kant Sharma", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“christmas break”", "Author": "steve1964_11", "ReviewID": "UR122362898", "Content": "Stayed in club room on 3rd floor from 17th Dec till 26th December this was our second visit here we asked for a room away from the night club and was given room 340 and no problem whatsoever regarding noise from there apart from the planes which didnt bother us,took advantage of the happy hour in the club room most nights room was very clean and staff very helpful and polite.. Pool area was very good the only complaint I had was that sunbed toppers were a bit dated and dirty. will stay here again in the future..", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stranraer, United Kingdom", "Title": "“Nice Hotel – Close to Airport”", "Author": "huwllshols", "ReviewID": "UR121150572", "Content": "We stayed at this hotel for 2 nights 7-9 November. Booked Club room which was on 4th floor, room itself was very quiet, well appointed and comfortable however with being so near to the airport the flights are taking off all through the night passing over on average every 10-15 mins, would recommend ear plugs. The view from the rooftop pool & terrace area is superb looking straight down both runways; if you like plane spotting this is the hotel for you. Good hotel to use as a base for sightseeing, nearest metro station (Abu Baker Al Siddique) is a short walk away and gets you to most of the main attractions. Booked in advance (in UK) for the Burj Khalifa as it’s way cheaper and you don’t have to queue for tickets when you arrive, well worth the visit views are amazing. Hotel runs courtesy bus to the Jumeirah Public Beach 1 leaving 10.30 back at 16.00, you can also get courtesy bus to nearby shopping malls. Club room entitles you unlimited use of the Club Lounge on 3rd floor, free internet access, drinks & snacks, you can also have breakfast there however better choice in the main restaurant. Alcoholic drinks and hot snacks served between 6-8 which is well worth it as the price of a beer around £7. Noticed the hotel restaurant and bar was virtually empty in the evenings, wonder why? We ate in a nearby restaurant which served local traditional dishes and was good value. There is also a spa on the top floor, spotless, which you can use to get showered and changed (towels provided) if you have a late onward flight like we did and have to check out by 12 noon. A secure room for your luggage is available and is arranged through the concierge, all staff we spoke to were very polite and helpful.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hertford, United Kingdom", "Title": "“Nice base to explore Dubai”", "Author": "Jon2314", "ReviewID": "UR120825498", "Content": "Booked this hotel through lastminute.com as a top secret hotel 'BEST HOTEL DEALS IN DEIRA'. Hotel was good value, clean, great service, allowed us to check in at 10am when a room was available instead of standard 3pm. We found the location fine, 5-10 min taxi to Dubai creek, 5-10 min walk to nearest metro stop Abu Baker Al Siddique on the new green line. Used the hotel shuttle bus on a few occasions which was very handy. Plane spotters paradise at the rooftop pool, of which there were a few! The hotel is directly underneath the flight path for departing aircrafts, which was noticeable in the room on occasions but didn't cause us any real issues.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Island of Malta, Malta", "Title": "“Efficient Hotel”", "Author": "Raven196", "ReviewID": "UR120805323", "Content": "I usually make buisness trips to Dubai and stay in this hotel, it's clean close to the airport and has an efficient and helpful staff. Two things I don't like are that if your room is over the nightclub you will hear the miusic till 3 in the morning. This is really annoying and the nightclub should be made more sound proof. The second is that while her sister hotel the Sheraton Creek has free Internet here you have to pay and it's not at all cheep.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "JAcksonville, Florida, USA", "Title": "“Dubia Vacation”", "Author": "JaxPhilly", "ReviewID": "UR120478930", "Content": "I thought the hotel was great for the price I booked it. All of the staff was very friendly and accomidating. The roof top pool was awesome with a great view. The hotel is located within walking distance of a bunch of restaurants, which was great. The etertainment at the bar and night club was enjoyable. I also got a massage at the hotel, which was just average, I expected something better the way it was advertised. Over all the facility has everything you need including room service in the middle of the night. Only cons- I wish I would have known about getting a room on the 3rd floor that included evening extras. I also would have liked to know about the Friday night BBQ roof top I missed. I think they could do a better job of telling you things going on at check in. The internet was rediculously expensive, about 10USD an hour.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newbiggin by the Sea", "Title": "“Best value”", "Author": "David F", "ReviewID": "UR120399345", "Content": "We have been using the Sheraton at Deira for some time now and all of the family love it. Staff are first class and they treat you as respected guests providing a first class service. We have not posted a review till now as we want to keep the quality of service a secret. From the pool at the top to the reception area we have found it clean tidy and any minor niggles fixed ASAP by the attentive staff. Take a club room and get the advantage of the Club Lounge for breakfast and evening with drinks and nibbles. The pool while not Olympic size is great due to the Staff (Jude and Jimbo) who look after in an attentive manner. Based in the old town are a short walk takes you to local shops and restaurants serving local, Indian and Chinese food at very cheap prices. Across the road from the hotel is a fantastic Indian veg restaurant which serves food to die for, try the masala dosa. Don't worry about not being down at Jumiera as taxis are cheap and the staff will arrange one for you at the front door. I read comments about the ladies of the night, yes they do get into the bar but they get into the bars of every Dubai hotel, perhaps they are cheaper at the Sheraton. We have taken both my daughters and their children to this hotel and they loved it. They loved the friendly staff And my eldest has been back twice and the youngest is planing to return apparently for my birthday. My wife and I highly recommend this hotel but we do know there is better but we look at value for money and that's what you get at the Sheraton Deira. Donnt all rush to book as we need rooms next year. Dave", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Down Town location”", "Author": "AHMED81", "ReviewID": "UR120076865", "Content": "The area dose not seem to be very good, but close to many restaurants and supermarkets. the hotel night club is good and the have nice entertainment. i had suite in the 3rd floor the view was very bad, but the bathroom was amazing. the breakfast in the club lounge was disappointing. only 1 type of cheese, they do your choice of eggs. you can stay in a better place for the same money. Dubai is full of good hotels.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Asia", "Title": "“Great Place”", "Author": "Frequent T", "ReviewID": "UR119712500", "Content": "I visited this hotel in August and it was excellent. The reception is very proactive and friendly. There is a nice club lounge where you can enjoy a drink and some little things to eat. Breakfast is also served there and it is very relaxing and peaceful. There is a pool on the terrace where you can relax after a city trip. The location is very close to the airport. With a short taxi ride, you can reach the Dubai Metro station. I would definitely recommend that place to stay.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Did not like it.”", "Author": "trainaholic", "ReviewID": "UR119036055", "Content": "The place is in not so good location, you need to use a taxi to get to places, our room was on the 5th floor, there is a hair salon when you first come out and for some reason there was a foul smell as soon as you step out. When you get closer to the rooms, it goes away. I a booked a king non-smoking, and when we made it to the place late a night, they told me that they only have a 2 single beds or a king smoking, we manged to get the room we wanted but after waiting 35 min in the lobby while they clean it. I did not like staying here, 700 dirhams ($200) a night is way too much for this place. I heard the Sheraton Creek near this place is much better.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "key west, florida", "Title": "“Don't be fooled by the Sheraton name”", "Author": "dandeja", "ReviewID": "UR119010499", "Content": "My wife, son and I stayed here in February of 2011 and found the experience OK, but not what we had expected. The service was generally good, and the rooms well appointed. We had two and they were basically identical. We constantly had to get coffee (the instant Nescafe packets) from the front desk because the maid never left replacements. I finally bought a jar at the store down the street. Staff were friendly and helpful. We found the restaurant in the hotel overpriced. On the plus side, the Sheraton Deira is walking distance to some very nice local restaurants with excellent food at reasonable prices. The hotel also is on the route of the shuttle to the Deira City Center (like all Dubai malls, great shopping) where the ultra-modern Dubai Metro can be accessed. Internet was very expensive; probably standard in Dubai, but cafe's around town offer it free. Probably would not stay again - even for the for the modest price we paid, there are better places to stay in Dubai.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Great pool w/swim up bar and co-located club with Night life”", "Author": "Sandy H", "ReviewID": "UR118583735", "Content": "The staff was very professional and the rooms were clean and well appointed. Good location. The pool was really nice! Swim up bar with really nice staff and chilled drinks! If you're a plane watcher then this is a great place to go pool-side on top of the hotel in the flight path of departure air traffic, yet they are at an altitude that you don't hear the noise. Bring your binoculars. Directly adjoining the hotel (you have to leave hotel) is a nice club with disco and drinks that gets hopping after midnight. Very busy and energetic! I suggest staying on the club floor and enjoy the daily specials at diner time. Relax at the lounge and enjoy a free drink or 2 and gourmet snacks. All in all great place to stay for the low price.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“BIG ROOMS”", "Author": "zuheb", "ReviewID": "UR118229131", "Content": "stayed at this hotel in 2008 , hotel was under renovation but on the whole it is luxurious and the staff was helpful. located in deira very close to city center mall ....", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Cairo", "Title": "“Nice 4 star hotel”", "Author": "Arefaat", "ReviewID": "UR118145665", "Content": "A nice 4 star hotel in the heart of Deira, rooms are a little old but functional, breakfast is OK, however, the overall impression is more a 4 points by Sheraton than being a Sheraton branded hotel.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Noisy room”", "Author": "EuroTrav2011", "ReviewID": "UR117964751", "Content": "I stayed for 2 nights at this hotel, my room was very noisy so I could not sleep at night due to the loud music from one of the night clubs within the hotel, and apparently the rooms are not well insolated. We were a group on business and some of the rooms were OK but some were very noisy like mine. I complained to the reception and they offered to move me to another room but I was not sure if it will be one of the quieter rooms. Also, the hotel is quite old and it is one of the worst Sheratons on my opinion", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Derbyshire", "Title": "“fantastic value!”", "Author": "RMS1974", "ReviewID": "UR116843422", "Content": "I was on holiday with some friends for this trip. We we're in Dubai for our annual lads trip to the Rugby Sevens. I had booked a Junior Suite for me and a friend through LastMinute.com. The nightly rate was less than £100 at the time, which was brilliant! We arrived at about 9am. Our room was not ready on arrival so we were offered a free room upgrade to an Executive suite. Our friend's room was ready, so we dropped our luggage with him and went exploring. Reception, like a lot of hotels in Dubai, is a large area with lots of seating so you can wait in comfort for your friends before getting a taxi. The hotel has a roof top pool area with a swim up bar and a separate heated jacuzzi. There is also space for sun loungers. It is not a massive area but we didn't have any problems getting sun loungers. The hotel is underneath the flightpath from the airport so it can be noisy. We had all booked rooms with business club access which meant we could eat breakfast in the club and have free drinks there between 6pm and 8pm. The breakfast selection included cooked foods, fresh fruit, cereals and bakery produce. The free beers in the evening were very welcome, especially in Dubai. The business club room itself is quiet and has some PC stations which give access to the internet and local and international newspapers. We didn't eat in the hotel as were out most of the time. Our room was excellent - all the more so seeing as we had been upgraded for free! The executive suite is big enough to contain a superking sized bed, a sofa and armchair, coffee table and a desk with chair and still feel very spacious. The view wasn't great as it was looking into the hotel's central atrium. The large wardrobe also contained a safe with an internal power socket. The bathroom was also huge with a large separate shower area and a bath. Sheraton supplied their usual complimentatry toiletries. Wifi was available in the rooms at an addtional charge, which is the norm for Dubai. It was expensive and slow, which is also the norm for Dubai. The hotel location is not great - there are a couple of restuarants and shops nearby, but nothing exciting. However, this is not a problem as taxis are plentiful and cheap. Overall, this was a great hotel for the money. The service was, as has always been my experience in Dubai, excellent.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Excellent Service and value for money”", "Author": "Mctoosh", "ReviewID": "UR116573808", "Content": "We booked through Expedia and got an all in good deal with Qatar Airlines (excellent) and a Club room at this hotel. Top Tip : Get a Club Room. We grabbed a cab (very cheap, forget rip off pre booked Limos etc) and our check in was seamless(2100 local). A lovely Asian lady and the Deputy Mgr attended to us and when I asked how much and the availability of a Junior Suite it was £20pn (bargain). The Dep Mgr insisted I looked at both the Club Room and the Jnr Suite, I took the Suite. It wore a no smoking sign on the door but - Ha, its the Middle East everyone smokes. The Bell Boy was happy to fetch a fresh air spray and doused the room - it helped. Starting at the top the pool is cleaned and fettled daily very thouroughly. The Head Barman (Jude) works very hard and his happy hour cocktails are worth a try. Do tip him a few Dihrams he gets very embarrased but their pay aint a lot. Yes, its an Airport hotel so aircraft in the local area are possibly to be expected but most people regard the departing or landing aircraft as quite Kool. A fully laden A-380 on departure is a sight to behold! The pool lunch menu has a good choice and the food is very fresh - try the fish and chips - fantastic, with the lightest batter. The Club Lounge supplies breakfast including eggs to order and evening nibbles and free drinks. The red wine was Australian (no complaints from my better half) and my G and T`s knocked your socks off. The girls are very smiley and attentive. We never ate in the lobby restaurant but did in the Lindbergh Bar - a good enough choice and the Fillipino bar ladies again were very smiley and chatty. There is the odd lady of the night but it adds to the atmosphere and they never bothered me. The local area is Middle Eastern and well worth an evening promenade - very safe and some of the Sari shops are quite spectacular. Every shop was family owned and different -no Blockbuster video and Clinton cards here, my wife loved it. June to Sep are the hottest months in Dubai so ratesare very favourable my only observation with the Sheraton Deira is they should provide a mini bar stock list and price list - there was neither. On check out mini bar issues are always common. We had no problems at all but its an area that requires attention. We would and will stay at this hotel again - loved it.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Athens", "Title": "“Decent hotel”", "Author": "Pekard", "ReviewID": "UR116092317", "Content": "The hotel is quite decent and clean. It is close to the airport, even though it will take you 10-15 minutes to reach in the city centre, since in the area that is located, there is almost nothing. The rooms are bright and clean, and the staff makes you feel comfortable at any time. Generally, it is a good option for a business trip.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Try another one!!”", "Author": "mra_brazil", "ReviewID": "UR114957455", "Content": "It was a 2 night stay. Things were not ok from the beginning; maybe because we were a big group a non friendly staff received us. Our room? O non-smoking with a very strong smell of smoke; people smoked there for years... Sometimes there was no hot water in the shower. After midnight a loud music was heard from a club that was inside the hotel (for me, it was inside my room!). Very, very, very low speed internet (paid!). The breakfast was good.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai, U.A.E", "Title": "“Awesome staff- so much better than most Dubai hotels!”", "Author": "kcindxb", "ReviewID": "UR114474461", "Content": "We live in Dubai and wanted to have a night away from home and kid, so booked in a part of town we don't normally get to. Stayed on the Club Floor and enjoyed the breakfast and cocktails and meeting others. Had awesome filet steaks from room service (and great value!). Room was VERY quiet and perfectly fitted out. There are lots of nice hotels in Dubai, but many don't have the staff skill matching the decor- this one does. All the staff were competent (a differentiator in Dubai - unfortunately! ) and very friendly. The hotel is on al Muteena Street which is very pretty with a long palm covered boulevard in the middle with a nice pathway. This hotel is not part of the new flashy Dubai, rather it is in a nice part of real Dubai and close to lots of things. This 4* in Dubai would be 5* anywhere else.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "2"}, "AuthorLocation": "abu dhabi", "Title": "“Never go back”", "Author": "mcgillad11", "ReviewID": "UR113880738", "Content": "We booked this hotel and confirmed that the payment was for three people (I even sent two emails and was guaranteed there would be no problems at check in). And so there wasn't, at check in that is. Everything was fine we passed our passports over and reservation which stated prepaid for 3 adults, they had an extra bed put in our room (small and rather uncomfortable). Rooms are basic enough but we were happy enough until on the second night we received a call to the room saying that we needed to pay for the extra bed. We were confused and brought the email down stating the room accommodates for three people and was fully paid for. However they said it accommodates 3 but if you want the extra bed then we must pay extra. This was strange as it hadn't been stated when we paid or checked in and was suddenly brought up on our second night. We refused to pay for the bed on principal and for the fact it was uncomfortable. So the people at reception ordered staff to go into our room whilst we were out and take the bed away. Quite petty considering it was a mistake on part of their staff and booking agent for misinforming us. For a Sheraton Hotel I felt this was terrible form and will not be back again. There are far nicer hotels to stay in for the same rate and better locations.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Zoetermeer", "Title": "“perfect place to stay”", "Author": "ZoetermeerEric", "ReviewID": "UR107548127", "Content": "6th. time in this hotel , value for money. Hotel in old Deira Town so outsite noisy but insite relaxed , good restaurant with good food. On top small pool to relax , plains are coming over , noisy but no problem. Best staff you can find in Dubai ...TOP...... valid parking for free , clean and proper rooms. TOP...................", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Outdated, but OK”", "Author": "JAV_87", "ReviewID": "UR107329880", "Content": "This Sheraton property is located not far from DXB Int`l. A bit outdated and really needs an upgrade, but for the price I paid it was more than OK. (550AED) I stayed 1 night for business. Roofpool is OK. Restaruant was good. All the hotel staff was always very polite and nice. Jumeira beach is about 20-30min away, a 70AED taxi ride.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Leeds, UK", "Title": "“Great value, right in flight path of airport - NOISY!!”", "Author": "cassie26", "ReviewID": "UR106634758", "Content": "As former residents of Dubai, we knew what to expect in Deira. Its not a tourist spot but taxis are cheap and much easier to get than they used to be. We had read the reviews and thought great, but we hadnt realised that even though its close to Dubai airport, it wouldnt be too bad. . It is so noisy that you panic a bit when you first see how low the planes are flying overhead. But as the locals dont even flinch you soon get used. Once asleep its fine, but if you cant drop off they keep on coming through the night. The lobby is lovely, typical old school dubai hotel, and our floor nice, but an awful damp smell on the 4th floor that was worse in our room. We also occasionally only got given one bath towel which was a bit annoying. I guess we could have asked for more, but when you're on holiday you dont want to chase people - it should all be there. When we arrived they were out of basic rooms so upgraded us for one night to a suite. That was fab, but were to be moved the next day. They said to pack our bags and they'd do it for us. However the next day when we arrived back later they hadnt done it! Reception said they'd tried to contact us, but we had left in the morning and told them our bags were ready to go. A little annoying, especially having to pack up when you just want to leave all after a long flight/journey. All in all, good value, but the suites are best for low noise.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Perfect for Business Travelers”", "Author": "rich430", "ReviewID": "UR106582974", "Content": "I stayed twice in Sheraton Deira and I had a good deal for a single room for both times, Although I didn't like the idea that the points aren't added to my SPG as I am using booking.com deals. The breakfast is fine and the service is well organized and meets Sheraton standards. The rooms are Ok as well. I am currently in Dubai right now in a business trip and I am staying in another hotel which is nearer to the business center but I added a couple of days to my trip for leisure and I will move to Sheraton Deira on Friday morning to spend the weekend there. Nowadays, the price is perfect :)", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vadodara, India", "Title": "“comfortable to stay but avoid the food”", "Author": "ashitpatel", "ReviewID": "UR106202242", "Content": "A very conviniently located hotel , close to the airport and some of the malls.The check in staff was very courteous and efficient. The classic room was well done up and was comfortable though may not be spacious for two people.The beds are of high quality ensuring a sound sleep and the bathrooms are spacious. We had two breakfasts, one lunch and one dinner at the terrace restaurant which generally serves buffet. The food was over priced for the spread offered. Each meal was at an average of 100 dirhams and the food was not worth that , further when you eat at this place you realise the same food items are being served ie same salads , desserts and some of the main course dishes .Being a regular at dining in hotels you can look through this inspite of re arranging the spread .For meals it is recommended to come out of the hotel and eat at any of the restaurants that line the street adjacent to it. The use of internet is also pricey at 90 dirhams for 24 hrs which would add to your cost.The hotel has agood gym with sauna and steam facility.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“perfect for business”", "Author": "Akram_S", "ReviewID": "UR105764446", "Content": "the hotel was really nice. rooms were clean and spacious. food was great. the service was very good. make sure your room is on the other side of the discotech below the hotel. it is very loud and it stay reaqlly late (till 2:00 am or later)", "Date": "April 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Visakhapatnam, India", "Title": "“I WILL COMEBACK AGAIN AND AGAIN TO THIS HOTEL”", "Author": "rajiv009", "ReviewID": "UR101461269", "Content": "I along with my wife and 10 year old son stayed at this hotel from 12 feb till 19 feb 11 during Dubai Shopping Festival in club room with breakfast included. I booked this hotel through internet booking.com and got an excellent deal. I must admit that our stay in hotel exceeded our expectations and we really enjoyed our stay. Just to start from international airport its a ten minute ride and costed us only 30 AED through taxi. (You need not pre fix taxi as the rates charged are 100 AED !!!) By the way though near to airport but we really didnot get disturb due to flying noise. In fact we didnt even feel when inside hotel. Since it was club room the buffet breakfast spread was good. However since we are pure vegetarians the chioce was limited. The management needs to look into this aspect. However, near hotel there are Indian veg hotels annapurna ad sarvana bhavan, so it was comfortable food wise. The internet facility was provided free of cost in club room and it was simply very very useful and convenient. The happy hours from evening 6 to 8 with good snacks and drinks were fabulous and thoroughly enjoyed by us. There are lot of free shuttles which run from hotel to various malls and its very convenient. Across the road there is LULUs the super market. Beig on main road, bus connectivity is excellent and nearby there is bus depot also. The metro station at City Centre Deira mall is nearby. Few other things which we liked wer that hotel is well spread out ad ot in congested area though Diera is oldest city of dubai. The hotel room was very well maintained and size of room was good. We didnot use swimming pool since there was chill in air. The travel desk and currency exchange are o steeper side, better avoid using them. Our check in was smooth and any info about dubai was given by concierge. Overall A lovely place to stay. Very comfortable and relaxed atmosphere in hotel. Certainly recommend and will come back", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good Service”", "Author": "fareed67", "ReviewID": "UR101055367", "Content": "i stayed in the hotel for 5 nights in Feb and had a enjoyable time the service provided was excellent ... special thanks to the door man and the front counter staff who alway greeted and alway smile. They also tried to help us in every way", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Minneapolis, MN", "Title": "“If you can get it for cheap, then it might be worth it --Otherwise pass.”", "Author": "BobakLives", "ReviewID": "UR99680278", "Content": "Let's get the bottom line out of the way: I was able to get this hotel for less than $90 per night (USD), and at that particular rate it wasn't a bad deal as a hotel. However, as a Sheraton and as a supposed upscale hotel I would say it's a disappointment and one of the more disappointing properties in the SPG group that I've been to. The one thing I've learned is that, in Dubai, things built before 2000 feel like they were built with separate rules and expectations than those built after the millennium. Nowadays, when you think of Dubai hotels you think of the luxurious extremes that were built in the boom years that were marked by the opening of the Burj Al Arab in 2001 --and to an extent that's true: things feel like a mix of Las Vegas and Manhattan in the Gulf. Alas, this hotel was built in 1996 so it feels less like the modern Dubai and more like what constitutes an upscale hotel in the developing world. That's not to say that Dubai is the developing world, just that the rules that seemed to govern its construction, design, management and --especially-- overall \"feel\" of the property give you that impression. The room we stayed in was described to us as an upgrade, so our furniture was... well, normal furniture and the bathroom looked like it had been upgraded in the previous five years. I can't say it was particularly nice. It was what I would expect at a 3 star hotel off the freeway in the United States. For some inexplicable reason they hotel was very stingy with the towels --we had to call to get more than three towels (total) for two people and they wouldn't supply many each day. The room was never cleaned particularly well for the four nights we were there and the overall room lighting was not very good. There is a club in the building so some rooms can hear the booming base (ugh!) until late at night. We were actually somewhat lucky and a few floors removed --I can't imagine what some of the other rooms were subjected to! As other reviewers have mentioned, the internet wifi rates are stupid, and the rates to use the small business center are also silly. The food at the breakfast in the main lobby is far superior to the food in the more exclusive club lounge. The hotel's located at the edges of Deira, an older neighborhood somewhat removed from modern Dubai. It is not too far from the Airport; we used the hotel's own driver service but I now think a cab might have been just as good. When the new line of the subway is finished within the next year or so it might end up being a reasonable walk from it (as of right now it's about a 15-20 minute walk from the existing subway to the airport and major sights along Sheikh Zayed Road). The first day we elected to walk over to the Dubai Creek and touristy parts of Deira and, in the 70 degree winter weather, it was an easy 20-30 minute walk over there. It isn't the most scenic walk but it isn't dangerous or difficult in any form to get over to the Gold souq or Creek areas. Cab rides are still pretty cheap in the city so you can always rely on that (we used them a lot based on the savings we had on the room). So there you have it: a hotel that isn't a good Sheraton, but if you strip that name out of your mind and can get it for under $90 USD it is a decent enough spot in what can be a pricey city. However, if you can get a more recently constructed hotel (esp. past 2002 or so) you might be able to get more bang for your buck for only slightly more per night.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Singapore", "Title": "“efficient”", "Author": "frankview", "ReviewID": "UR98286604", "Content": "basic hotel with dated furniture. Business lounge offers very basic cocktails in the evening and limited breakfast. Club floors residents cannot have breakfast in the main restaurant which is a complete no no.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "manchester, UK", "Title": "“Great value for money - but useless overpriced wifi/internet”", "Author": "sammy978", "ReviewID": "UR93939390", "Content": "Stayed here for Arabplast 2011 with colleagues and clients. Excellent value for money. 4* is generous by Dubai's standards but compared to international hotels is great. 3.5* is prob more accurate although rooms are nice and spacious. Only negatives are it's a bit of a trek from main city centre and BIG NEGATIVE which would stop me returning is the dire internet service - the bandwidth in the room was to small to even log on to my mail server and it costs (AED90 per 24 hours - £18, a complete waste of money). Would happily return if this was addressed or if I was away on leisure and didn't need internet connection.", "Date": "January 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Southampton", "Title": "“Good friendly hotel”", "Author": "Paris1959", "ReviewID": "UR92123359", "Content": "Stayed for 7 nights with friends, have stayed a number of times before, staff always very helpful and professional. Had an early arrival flight but the room was made ready for me without a fuss Has a nice roof top pool with swim up bar also heated Jacuzzi, Lindbergh's Bar small but ok, Star Nightclub attached open to 3am and not for couples ! Good buffet style breakfast, omelettes cooked to order at buffet area. Internet access expensive (£15 a day) for a business hotel, would benefit from free WIFI which is becoming pretty standard in most hotels. Rooms I have stayed in have always been good with excellent air con. Close to the airport, well placed for the city and taxis cheap. Never had any problems walking around the surrounding area at night. Good base for a city break, would stay again", "Date": "January 7, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne", "Title": "“Very expensive wifi - only one device per payment”", "Author": "Kate789Melbourne", "ReviewID": "UR90405674", "Content": "Hotel facilities, staff etc all great, very courteous HOWEVER just paid 90 UAE (approx $25-30 Aus/US) for 24 hrs of wifi access in room. For this price, you can only use one device ie one pincode for wifi access. My daughter was using laptop, and when I started using iphone wifi, hers dropped out. Have just been travelling though UK, Germany, Poland and Ukraine, and free fast reliable wifi in all these places. Have discussed with management who offered additional free hour in their club room, but their 2 pcs are in use.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Nice Hotel - in an older city of Diera”", "Author": "Rabbina", "ReviewID": "UR90314056", "Content": "I was very pleased with my stay at this hotel..I was in Dubai for 13 nights and stayed at this hotel. Staff was extremely helpful, whenever I called for anything, it was brought to the room within a matter of minutes. the staff was very professional. Hotel was clean and our room was spacious. The carpet in the room needs to be changed, it was kind of worn down. Hotel is far away from the main attractions in Dubai and taxis can be costly. It's close to the Gold Souk and one of the malls \"Diera City Centre\" - A nice place for shopping and if you are dying for Starbucks or Dunkin treat like I was, you will find it here. Hotel has a very nice bar and lounge for those that like to have a drink at night and its open till 3:00am in morning.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Los Angeles", "Title": "“NO FREE WI-FI & I won't put up with it anymore. FIND ANOTHER HOTEL!”", "Author": "sawatdee", "ReviewID": "UR89797921", "Content": "I've had it with hotels that claim free Internet and it isn't really.. I'm simply not going to stay at another hotel that doesn't offer FREE WI-FI period. If you're staying on the \"CLUB ROOM\" floor you can use their two broken down laptops with basic filtered web only Internet access and you cannot install SKYPE. If you want to use Wi-FI on YOUR laptop there is a substantial charge by the day or hour. No Thanks. I'll find another hotel that has FREE Wi-FI and you should too.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Friendly Service. Great Treatment.”", "Author": "Flyintl", "ReviewID": "UR86991876", "Content": "From a very personalized check-in, to a spacious and well furnished room, to friendly and helpful staff, my stay at the Sheraton Deira was great. The hotel isn't the most modern and the design is showing it's age, but that's not too different than hotels in any city. That said, the place is clean and well-kempt. All the staff is friendly and say \"hello\" which is nice. Small suite was spacious, well-furnished with a sitting area, a desk with fax machine, a king bedroom, full mini-bar and a large flat screen credenza. That bathroom was large with a large free-standing tub, massage shower, toilet, bidet and plenty of shelves. Windows are double paned, so there's no noise from the outside. Yes, planes do fly overhead, but the sound is muted and didn't bother me at all even during the night. Executive Club lounge has two computers (slow internet), WiFi, full breakfast buffet (with made to order eggs/omelettes, evening cocktail/hors d'ouvres, and all day tea/coffee/drinks . It is staffed with the friendlist and most helpful of people. Health club has a fitness room with a modern equipment - a few treadmills, a few elliptical machines, a few biking machines, free weights and a few nautilus circuit machines. Had a great massage in the health club by a fantastic Thai masseur. The health club offers massages by female or male massage therapists. The men's locker room lockers, showers, steam and sauna. I was told in the women's locker room, there is the same. Please note, however, that access to the steam and sauna rooms alternate between men's or women's use, so check with the health club to see when it's available to your gender. There are men's and women's hair salons right next to the Healt Club, as well. Am a Starwood Preferred Guest Platinum member and I received all the Platinum benefits (and more) at the Sheraton Deira. The surrounding area is full of local shops, restaurants which are much more affordable than being near Dubai Creek. This is not a tourist area, but just jump a taxi and you'll be at Dubai Creek in 5 minutes. You do, however, get access to a local neighborhood where you can go to a 24-hour supermarket, malls, etc. Frankly, I travel a lot and it's far more interesting to me to walk around, eat and shop in a local neighborhood than in the tourist section of town.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Good hotel with a friendly staff”", "Author": "aanamikaa", "ReviewID": "UR83312474", "Content": "Booked the hotel online after reading few reviews. Hotel turned out to be according to our expectation... clean, beautiful, and above all a nice friendly staff. They even upgraded our room! The hotel is ideal located, Diera City Centre Mall close by and also for the budget travelers the metro line as well as bus stop are also not far. Breakfast was included in our package but got a little monotonous as the menu never changed! Fully recommend this place.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Good value for business travellers”", "Author": "AllieNYC1", "ReviewID": "UR80226721", "Content": "Located about 15 minutes from the airport, this hotel is a good value for those on a business trip or just passing through Dubai. The staff are very friendly and helpful, the accommodations are comfortable, and there is wireless internet service in the rooms, though you have to pay extra for it. I arrived early, at 8:00 am, and had requested early check-in in advance. When I got there, I was told the wait for my room to be cleaned would be about 20 minutes. I decided to have breakfast in the lobby cafe while I waited. It was buffet style, okay choices, but not worth the 78 AED that I was charged. In addition, the furnishings were somewhat worn down, and there were fruit flies buzzing around some of the dishes. I returned to the front desk at 8:40 and was told my room would be available in another 20 minutes. The concierge offered to help me confirm my flight the next day, which was helpful except that he got the departure time wrong, and I ended up 2 hours too early at the airport (better early than late, though!). My room was finally ready at 9am, and everything was in order, except that one of the hand towels was dirty. Otherwise, it seemed clean. Room service was excellent, though not as many choices as other hotels, and for some reason the cart that was brought to my room was too large to pass between the bed and the entertainment center, so the waiter ended up carrying each dish to the table by hand. Overall, the staff were very attentive and efficient, and my stay was pleasant.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Luxembourg", "Title": "“Nice place for Business Travellers”", "Author": "lyam888", "ReviewID": "UR79102059", "Content": "I was there 3 time in the last 2 years and always my stays were good, employees are very polite, remember that you have been more than one time in the Hotel. Food and breakfast are good, of course in Dubai you always will find a better Cuisine, but this is the perfect place for Business travellers, close to the Airport, not so fare from the main places in town, the City Mall is about 5 minutes by Taxi and you can find all you need there (souvenirs, restaurants - specially if you need to bring a souvenir for your family), there are bigger Malls and more expensive too, but this one is the right size and you can find all you need. So Hotel is very good for the prices, good deals are made through Internet. for people that are only for vacations of course there are better choices.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Perfection!”", "Author": "Shevz", "ReviewID": "UR72825796", "Content": "Ok so My friends and I went to this hotel in the hot month of July. Not a problem because everywhere you went had aircon. Arriving at this hotel was fabulous! Doors were ALWAYS without fail opened for you. We got to the hotel at 07:55am. Check-in wasnt until 3pm but when we got there, they were getting our room ready for us and putting an extra bed in there for my third friend who came along. They informed us of all the hotel amenities and let us know where to go for fabulous shopping, handbags and beach trips. The food in the restaurant was perfect! we had choices of and Italian Buffet night and French buffet night and if that didnt tickle your fancy, you could pick from the restaurant menu. The cake pastries were out of this world! and the service from the restaurant staff was amazing! Mehraj in particular was polite and always smiling. I couldnt help but tip him every time. Sweetest guy in the world. The hotel was amazingly clean to fantastic standard and the rooms were exactly the same. Definitely worth the money! Oh! I also had a massage which was lovely but I'd never had my back cracked before! The hotel also had a bar you could smoke in if you like that sort of thing and they like to make a fuss about your birthday. Also!! The pool was very relaxing. Had a nice cocktail and food get served up there as well.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "bombay", "Title": "“good”", "Author": "sidhantjatia", "ReviewID": "UR68383741", "Content": "great hotel , newly refurbished rooms.. good staff and helpful. would recommend freinds to stay", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "American in Arabia", "Title": "“Great Stay at Sheraton Deira”", "Author": "Musqat", "ReviewID": "UR68038021", "Content": "I was recently in Dubai on business and took advantage of the great rate and location (for me at least) of the Sheraton. I had stayed here quite a few times in the past, but hadn't been there in over a year. I can't praise the staff enough. Everyone I encountered was extremely friendly and professional. I would like to mention a few exemplary staff members by name: Kusni, Yani & Rajesh in the Club Lounge and Kyaw at the bell desk.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "mumbai", "Title": "“JUST PERFECT ...”", "Author": "hemal1112", "ReviewID": "UR67169576", "Content": "The ambiance of the hotel is soothing.... after enjoying the business class of emirates....was disappointed to learn that my luggage was not loaded in mumbai...Thats emirates... well entering the hotel i was just relaxed ...guess what the staff was so helpful, it was like they were tracking my luggage and i was left to be with my friends to enjoy my holidays....The rooms and service are just perfect.... Thank you !", "Date": "June 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fareham, UK", "Title": "“Sheraton Deira”", "Author": "Fred_Fareham_UK", "ReviewID": "UR66610012", "Content": "Arrived at the hotel on 28/05/10 early morning. Having been advised to book the previous evening to ensure we could go straight to our room and not have to hang about until 14:00, we were surprised to be asked to wait for a few minutes to get housekeeping to check our room - no problem . What was a minor problem was that when we did get access some 10-15 minutes later we found that the sink in the bathroom had a leak. Someone knew about it because the waste bin was thoughtfully postioned under it. Mentioned it to the receptionist and she was full of apologies and if it couldn't be fixed we would be moved. It was fixed by the time of our return to the hotel. With a formal note left in the room asking us to contact the duty manager. Who asked if everything was to our satisfaction - no issue. More tea bags required - no problem Rang down to reception and they were there within 5 minutes followed by a phone call to confirm that they had been delivered. Issue over glasses for drinks mysteriously disappearing. Same approach, same result. Nothing too much trouble for a friendly hotel staff and management. Yes the hotel is on the flight path to Dubai airport but this did not cause an issue for us and double glazing kept the noise out of the bedroom. Still the plane spotters (yes they were there, complete with laptops, binos and notebooks !!) seeemed to enjoy themselves. Swimming pool is not large but is of a sufficient size with a pool side bar. Be warned though drinks are on the expensive side and not just alcolholic drinks. I am talking of the soft drink variety. We did fall foul of interpretation. My wife was asked if she wanted the bed changed and as we only had one day left of our visit she said no. The toiletries, coffee and tea were replenished but the bed was left unmade so we had to do it ourselves. Shame on us !! All in all a comfortable hotel with good staff, positioned in the biusiness area of Dubai but with those planes, which may cause some people an issue but not us. Would use the hotel again.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "italia", "Title": "“Good if you find a good deal”", "Author": "rosellinarossa", "ReviewID": "UR63872936", "Content": "the hotel is nice, it's not luxory like a sheraton, but in my opinion is good for the price you can pay (about 100 $). I found a good deal on Expedia and I'm happy to my choise. the service is not the best you could find, but it's an avarage. The hotel is not central, but the taxi is so cheap that you can stay here without problems (ride to the city center is 5-10$). the hotel is very clean and the bed is very confortable. if you can find a good deal I suggest this hotel. the negative point is the early check in, we arrived at 7 am and they asked a surcharge (50% of the price of the room) and they did not make up the room for the whole day even if we paid for the early check in (i.e. we arrived at 7 am, slept until 11 and then left the room until the evening: the room was not make up).", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Zoetermeer", "Title": "“perfect to stay”", "Author": "ZoetermeerEric", "ReviewID": "UR63472386", "Content": "We stayed 6 days in the hotel for leisure - rooms are perfect , Sheraton standard..... - restaurant for breakfast and dinner \"value for money\" and very kindly staff. - free valid parking with frendly staff to park the car - little swimming pool on the roof , but nice place to relax after shopping etc. - some noise of plains coming over the hotel. - from Deira you can with a car drive easy to all places in Dubai. - not less important : very nice and helpfull staff all days ; also when a little personal accident happened near the lobby with one of our family... THANX..... SO IN ONE WORD : PERFECT", "Date": "May 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Milano", "Title": "“Not a Sheraton”", "Author": "Principissimo", "ReviewID": "UR62358782", "Content": "This time my travel agent booked an hotel for me: it will be the last time! This hotel is not on the average standard of a Sheraton: position not good and hotel not nice at all. Only advantage is that it is close to the airport.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "canada", "Title": "“Certainly not representative of Sheraton stanadards”", "Author": "vancouverchu", "ReviewID": "UR61774172", "Content": "After a 20+ flight arrived at 2 am and found a dated facility, but fairly freindly staff. I booked a room on the Club Level, and found it to be also dated and barely clean. Past reviews of this hotel were too kind. I stayed one-night and moved!", "Date": "April 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "tehran . iran", "Title": "“Very nice”", "Author": "samira-bm", "ReviewID": "UR60070204", "Content": "We stayed at this Sheraton on the New Year weekend for 6 days; everything about this place is almost perfect. the rooms are nice. The location is fine, there are a few restaurants nearby. The staff is very friendly, and overall this is a nice place to stay if you need to be in this area.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Fort Worth, TX", "Title": "“Not bad for a short business trip”", "Author": "joeb1249", "ReviewID": "UR58980374", "Content": "The Sheraton Deira is in an older section of town within a short drive from the airport. It is a rather small and ordinary hotel, but certainly consistent with the standards of other Sheratons I have visited. The hotel staff is friendly and helpful, and there is a tour desk that can arrange local sight-seeing trips. The room was comfortable and clean, and wireless Internet service is reliable but somewhat costly. The business center is very small, with only two working computers that were occupied whenever I arrived. On each occasion, I had to sit and wait before I could get access, so this facility I found to be quite inadequate. There is only one restaurant in the hotel and staff usually tried to steer me to the buffet that was available at each meal time. At lunch and dinner, an a la carte menu is available, but I found it to be fairly limited. Food quality seemed to be okay, though. If I were returning to Dubai for a short business trip, I would consider the Sheraton Deira, but tourists might want to look for other options.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southampton", "Title": "“Fabulous Staff”", "Author": "RobAldridge", "ReviewID": "UR58743377", "Content": "We spent a superb 10 days in this hotel. The rooms are really nice and although being on the flight path into Dubai noise is minimised due to the double glazing. The best point about the hotel is the staff who were superb. We spent many a happy hour in the roof top swimming pool. The staff were great and made a great fuss of my 5 year old son. This is my third trip to this hotel and we will go back next year if we possibly can.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Simply put, this is a great hotel.”", "Author": "jg1way", "ReviewID": "UR58439330", "Content": "Having stayed at the Sheraton Deira several times, this was the most recent. I found the location slightly remote but with ample taxi's, getting around isn't a hassle. The hotel is older and maintenance is ongoing. I found the fitness center and pool to be an excellent source of recreation. The breakfast buffet is excellent although quite expensive if not on the B&B rate.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lancashire,England", "Title": "“Excellent Hotel-highly recommended”", "Author": "Morph65", "ReviewID": "UR56907424", "Content": "The Sheraton Deira hotel was a superb place to stay, the hotel has been recently updated and you can certainly tell, the decor and cleanliness was to a very high standard. The staff were very friendly and helpful at all times. The resaurant and cafe were excellent. The roof top pool and jacuzzi was very nice and hot, the pool bar offered happy hour between 6pm and 8 pm which we definately took advantage of!! The location was a taxi ride away from the attractions but they were cheap. Overall i would highly recommend this hotel to anyone", "Date": "February 23, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Australia", "Title": "“Worst hotel Ever”", "Author": "hashmat_s007", "ReviewID": "UR55911526", "Content": "Worst Disgusting hotel ever been. I stay there for 6 days and I will never ever go their again even if its free. They have hidden fees if you invite some of you friends in you room at night, even if they stay for a few hours, the room are disgusting with fresh paint smells and you cannot open the windows because of the airplane noise they have lock the windows. Every 1 minutes a plain comes and go and the location is in the middle of no where. To top it all off they over charge me for a night, the internet prices are unbelievable high. I just hate that place so much if I was rich , I pay them to close that place. So you might get a good rate if you stay their but trust me , it does not worth the money.", "Date": "February 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Fine for a business stay”", "Author": "AFDMumbai", "ReviewID": "UR54942194", "Content": "Had to stay overnight in Dubai for business purpose so I stayed in Deira Sheraton. Its good place to stay if you have a meeting around the exhibition centre area. The hotel was good but I felt it was more suited for business type. The food was excellent and the service offered by the hotel was good. They have a good bar if you want to catch up with some drinks but beware of company.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Derbyshire, UK", "Title": "“Nice room but loud disco all night (and morning) and prostitutes! Stay somewhere else”", "Author": "adeleandgaz", "ReviewID": "UR54483543", "Content": "Nice room but we HAD paid for a Suite. The Club room was kinda average that my mum stayed in. Decent breakfast. Not too good location but cheap taxis. They did that annoying thing where if you prepay they hold the money and then make you pay on departure. So you pay twice untill the release first payment. Plus, the exchange rate in the hotel was terrible so it was more expensive than the price I booked it in the UK. This was using their own site so be careful. Expensive food and drink but, hey, it's a hotel. Prostitutes in the bars and wondering about so maybe not a good idea if you are religious etc. I didn't find it too alarming but they did make my aunty feel a bit uncomfortable giving her \"dirty looks\" when she went in alone before we met her. VERY loud disco till past 3am and we were on the other side and 3 floors up... No sleep possible. At all. Even midweek. Even after complaints. We got a free lift to the airport as we complained... Not really making up for it.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait", "Title": "“Excellent for Business”", "Author": "SPPatelIndia", "ReviewID": "UR51727737", "Content": "Its located at the Dubai Creek, beautiful place, friendly staff, and above all very nice hotel to stay", "Date": "December 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“very good”", "Author": "RV19", "ReviewID": "UR50553164", "Content": "we stayed there for 2 nights and it was wonderful..i would defo recommend that to asnyone..the only thing that was bad was it was far from other hotels and attarctions...but good value for money", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Basel, Switzerland", "Title": "“choose somewhere else”", "Author": "rackiec", "ReviewID": "UR48643355", "Content": "If you have a choice then choose a different hotel - the staff try really hard and I was very impressed with the service but it is just a noisy place - walls like paper - I could hear other guests all night talking, walking past and hear phones and alarms all morning. One tip for the ladies is a great beauty salon across the road - look for the pink sign - amazingly cheap waxing, threading and manipedi! tell them I said hello! For Dubai I think the price is too high for what you get!", "Date": "November 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“Don't do it”", "Author": "MelbourneRichie", "ReviewID": "UR46091093", "Content": "As nice as the staff are at this hotel (they tried hard to please) it just doesn't offer good value. Considering that I nearly stayed at Grosvenor House for about $50 more, I was kicking myself for choosing this hotel as it looked ok on the website and is a participating Starwood rewards resort as opposed to GH which is not(although still SPG). Went down to GH and it was 1000 times nicer. Have you seen Benidorm? Sheraton Deira was a little like a scene from that show. I went onto the roof to have a swim in the little pool only to discover we were directly under the airport approach/flight path (we are talking planes 200M over head - the stuff of travel nightmares). Plus the roof top was shabby and 2 star ordinary. My room was renovated, and ok, looking into internal courtyard, but, perhaps because renovation works are underway, when I turned off the AC to go out, the room was overcome by the sewerage smell. Quite foul. Again, I must say, staff quite lovely, and they gave me an early check in, although wouldn't let me have breakfast on day of arrival at Business Club even though I was leaving early the next day and wouldn't be able to have breakfast at 5am. Again, a huge problem with most SPG hotels, 'internet for a fee'. A big rip off at 60Dirham - akin to the price at most SPG hotels. Dubai offers great competitive value in these times and many smart resorts. Definitely give this one a miss.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "east midlands", "Title": "“excellent staff, excellent service, excellent value = excellent holiday!!”", "Author": "firsttimedubai", "ReviewID": "UR37620555", "Content": "Just liked to tell all first timers who are planning to come to this hotel and are abit weary about some of the negative comments past visitors have left....ignore them and come! I and my family visited this hotel on 26th july 2009 for a week holiday, booking 2 rooms, for a first ever holiday to Dubai...and we thoroughly enjoyed every minute. The staff are so helpfull its unbelievable! As soon as we checked in we were looked after, in every aspect! The Terrace Resturant was excelllent (our breakfast chef Sunil made our omlettes to perfection!) Arun at the checkin desk was always there with plenty of info and advice and Joey was the best conceiarge we have ever met, ever! The whole management, housekeeping and leisure team worked at their best. The rooftop pool was a bonus, with passing of planes frequently, which if anything was a surprising pleasure with our son!! It was abit of a novalty if you ask me. The location of the hotel was perfect. It was very central which made it ideal to travel to all your daytrips to the beach/malls/city and the free shuttle service the hotel offers for the shopping centres were great! Rooms were very clean, room service was nice and good value for money and the channels on the tv suited all ages and tastes! Overall, a very pleasent stay and will surely be coming back again in the future! well done and keep up the good work!", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "manchester", "Title": "“Excellant Stopover Hotel”", "Author": "Melbsteve", "ReviewID": "UR35737850", "Content": "I stayed at this hotel for one night on a stopver and can really recommend it. The first impressions are excellant with check in being faultless and a connceriege team ( there seems to be half a dozen of them ) only too pleased to help you move in. The hotel rooms all face an internal courtyard which contains the breakfast restaurant which is nice, the rooms themselves are very smart with very modern fixtures. The hotel has a smallish rooftop pool and good sunbathing area, the gym is excellant with a good selection of machines. The hotel is located within a short tax ride ( 12Dhs ) from all the malls and other bars so the location is good, there is one issue with noise from planes going overhead but not bad enough to keep you awake. The buffest breakfast is nice, some real bacon and pork sausages would have been nice but I guess you cant have everything.. Overall a pleasure to stay here and would do so again.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "maddiston,falkirk", "Title": "“Decent hotel, wrong location”", "Author": "Blueangels", "ReviewID": "UR32395799", "Content": "To be honest, this is a perfectly decent hotel. Its problem is it is in Dubai where 5 star hotels try to out do each other with palatial splendour as standard. This is a four star hotel in the wrong location with limited facilities and on the flight path to the airport on its doorstep, almost. We arrived here at the end of 12 days in Maldives and as we had to change flights in Dubai it made sense to stay a day or so to see what all the fuss is about this place. Choice of bed and breakfast was really the choice of the travel agent as our knowledge of the Gulf state was nil. We know more now so it’s unlikely we will return to this hotel but don’t let that put you off. The tour itinerary said rooms would not be available before 2pm; we arrived just short of this time. And the room was not available till nearer 2.40pm so we consoled ourselves with a tea in lobby café/bar. Not an inspiring start. The room was ok. Nice comfy double bed. All the facilities you would expect, fridge with booze etc at prices to make you wince (unless on expenses) TV, ironing board, tea/coffee making facility and safe. The bathroom was tiny but clean but the bath was a good size and certainly bigger than my one in the home. Our only meal in the Sheraton was breakfast and it was good. Food choice was all you would expect. Bit like being in a quality UK hotel truth be told. My “world famous orange juice test” ™ was passed with flying colours. Something for everyone, cereals, fruit, extensive cooked selection, all in pleasant surroundings. The amount of time we spent in the hotel was not great but it did strike me as being noisy. With a 5am pick up for the airport the last thing you want is to endure loud music from a nearby function as you go to bed. C’est la vie. And the occasional airplane overhead, although the double glazing does a good job. Staff were reasonably attentive but I can’t say I came away with a feeling that I had been valued. To conclude, a decent hotel but I suspect and know there are better to be had in town.", "Date": "June 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Business hotel showing its age”", "Author": "ilovemiddleeast", "ReviewID": "UR31840378", "Content": "I stayed at this hotel for one night in June 2009 with my partner. I was attending a training event the following day. First problem was finding the hotel. Our instructions were to take the 3rd turning on the left and in fact Al Muteena Street was the 4th left after Maktoum Bridge and the Clock Tower Roundabout. After finding the hotel I was very disappointed with the car parking arrangements. There is no hotel car park and the only parking is on the street behind the hotel (even if you valet park). I spoke to the manager and they cleared one of only four places by the front door of the hotel for me to park my car. I was impressed how quickly they dealt with this to my satisfaction. The hotel itself was opened over 10 years ago so is old by Dubai standards. I booked over the internet and got a good price of 600 AED net including breakfast and 'romance package' (wine and fruit in the room). Late checkout until 4pm was part of this package and the reception staff kindly agreed to extend this to 5pm at no extra charge. The room was freshly painted and had new furniture. The corridor outside the room (smoking allowed in these rooms) smelt pleasantly of fresh paint. There was masking tape on the skirting boards in the corridor so the painting work must have still been in progress. Despite having a room on the front the room was quiet thanks to the double glazing. No thanks however to the noisy woman shouting outside our bedroom door at 2 am! We had a buffet dinner in the hotel (170 AED for two net). Good for the price. Breakfast was served in the same restaurant and at all meals they offered a selection of hot and cold food. I also had lunch in the same restaurant as part of my training course and by then I was bored with the limited hot options for vegetarians. The staff in the restaurant were very attentive and also made some helpful food suggestions to make sure customers got the most of the buffet. The fountain in the restaurant was old and cracked but still contained a few koi carp. This damaged fountain should have been removed when they did the repainting/refurbishment job. We went for a walk in the area round the hotel and concluded it is not located in a neighbourhood suitable for tourists. You'd have to get in a taxi to go anywhere interesting, whether to the malls or to the older parts of the city. There are much better located hotels for tourists to stay in and still be in Deira. The hotel is near the airport so convenient for a night's stay if on a short stop-over. Location was ideal for our needs but there are no frills. I would not recommend it to tourists. However, if you get a good deal on the room rate that might make up for the need to go everywhere by taxi. To sum it up I would say this hotel has good service and friendly staff. But it is an old hotel and it is let down by the old and worn infrstructure and facilities.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Stourbridge", "Title": "“High service and friendly people in good location”", "Author": "Steveglass", "ReviewID": "UR29082872", "Content": "If you prefer 'old Dubai' and need a hotel that offers exceptional comfort and very high service levels, dont forget this Hotel. When offering special deals like the one we appreciated last week, it really is a great place to stay. The staff are really helpful and friendly and the rooms are very comfortable. The only criticism was the crazy price for breakfast, where you would have needed to pay about Dhs 70-90 (£14 +). Easily avoided by eating elsewhere, but why do hotels try to charge such exhorbitent prices?", "Date": "April 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Best Option Close to airport.”", "Author": "amit2207", "ReviewID": "UR28605785", "Content": "Close to airport and Shrajah road, where I wanted to travell. Good India food and nice sercvice.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Shocking Hotel - Glad to Check Out.”", "Author": "MissJasmine", "ReviewID": "UR25876036", "Content": "What can I say this Hotel is absolutely shocking. We checked in around 4 am in the morning after flying from Singapore. We decided to pay a Hotel room rather than sit in reception until 3pm when the rooms would be ready whilst checking in this scantily glad woman with thigh high boots and a micro mini and a skimpy top walked passed us at reception . It would become clearer the following night what ladies dressed like hookers were doing, wandering around the hotel late at night. We were very tired and put the do not disturb sign on the door only to find the maid vacuuming outside our door banging the nozzle of the cleaner against our door at 9am. Obviously the maid did not understand what do not disturb means. The room was adequate but the towels were threadbare and the bathrobes had holes in them. The Hotel have installed, state of the art coffee machines that just do not work after four people came to look at the coffee machine and try and fix the problem I politely asked would it be possible for me to have a kettle - The kettle worked just fine. We found the Hotel very expensive considering the location. The hotel is not really near anything in particular. They have a nightclub next door, which is part of the hotel. A coke costs £3.50 and a small bottle of beer £7. There is a supermarket a short walk from the Hotel that caters for everything and a coke costs 20p there. Now to the shocking part there is evidence of prostitutes everywhere in the corridors of the Hotel in the Piano Bar and especially in the Nightclub when I asked the Manager about this he said that there are buyers and sellers and he was fully aware of the fact that prostitution was evidently being conducted. I was shocked because I didn't expect this in Dubai and I didn't expect it in the Sheraton. I am not talking about one or two I am talking about a whole nightclub where I really do believe that I was the only genuine guest there, all the other women were working girls and it was quite disgusting watching mainly local men pawing these young girls. My husband and I felt totally uncomfortable at this situation and we left quite quickly. If you want to relax on the rooftop pool forget it every few minutes an aeroplane flies overhead disturbing your peace and quiet. Breakfast was good and the staff very efficient We decided to order room service we felt safer in our room. The best thing about this Hotel was the checking out. Please avoid at all costs", "Date": "March 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ottawa", "Title": "“Decent Hotel close to the airport.”", "Author": "Shufti_Traveller", "ReviewID": "UR25828765", "Content": "Knowing this hotel from a previous stay and due to its close proximity to the airport, I booked two nights in a club room on my way to and from Abu Dhabi. I was not disappointed. The Sheraton Deira offers decent facilities and clean well maintained (club) rooms for the business traveller. The staff are efficient and friendly. On the renovated club floor, the bedrooms are large with flat screen TVs, well stocked mini-bars and large en-suite bathroom facilities. The club lounge offers decent finger food and complimentary alcoholic drinks during Happy Hour (6-8:00 pm) and tea, coffee, soft drinks, cakes, biscuits (cookies), nuts and crisps (chips) at other times when it is open (6:00am until 10:00 or 11:00pm).. There are also two computers in the club lounge with printer and internet access. A decent breakfast is a leisurely affair served in the club floor lounge for those staying in club rooms. The bar (Lindbergh's) on the 5th floor serves decent cold beer on tap and bar meals. The views are also good. The roof top swimming pool is a good place to unwind and relax during the day. The hotel rooms are well insulated against the overflying aircraft but not so much against the music from the night club which \"rocks\" till about 03:00am. The music was audible in my room, but not loud enough to keep me awake (although it might others). Another negative point, but beyond the control of the hotel, are the huge road works (construction) between the hotel and the airport - adding significantly to the time required to get to the airport.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, UK", "Title": "“Nasty”", "Author": "other1", "ReviewID": "UR22806282", "Content": "Best avoided: - tacky furnishings - smelly common areas (polished rather than cleaned) - poor food - dirty toilets - dreadful, grubby business facilities - 'sharp' practices with billing", "Date": "December 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lancashire", "Title": "“You need a taxi”", "Author": "Robjan", "ReviewID": "UR21005376", "Content": "Enjoyed our stay at this hotel even though it did seem a bit out of the way from all the main attractions Dubai has to offer. You need to get taxis, the Hardrock café was half an hour away and Wild wadi similar. At least taxis are cheap. Our room was clean and tidy and of a reasonable size. You could hear some aircraft noise as the hotel is on the flight path to the airport. We had breakfast in the hotel which was very good. Also thought the bar was fairly good. The roof top pool gives good views over Dubai. Hotel is probably suited for business travellers more than tourists.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“Plane Spotters Dream”", "Author": "RichardSW1", "ReviewID": "UR20892532", "Content": "The hotel is conveniently situated at the end of the airport runway. Remarkably this isn't noticeable unless you visit the roof top pool where i saw a couple of \"anoraks\" in socks and sandals with binoculars and cameras. Then a plane takes off and the earth moves. Downstairs the rooms are OK but make sure you get a refurbished one (they have extra power sockets for your laptop). The staff are friendly but when they come to your room it's difficult to get them to leave without dipping your hand in your pocket. There's a \"night club\" next door where a wide selection of unattractive girls hang out. The location of the hotel is terrible (middle of nowhere) and with Taxis in Dubai being scarce you are stuck.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangkok", "Title": "“Very nice Business Hotel”", "Author": "Expat_1965", "ReviewID": "UR20337013", "Content": "I stayed at the Sheraton Deira for one night and I had a pleasant stay. I took a tower room and had access to the lounge what was a real plessure. The room itself was not ultra modern but had everything you need. The hotel was very clean and the staff very attentive. Overall I had a nice stay and will come back in the future.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Great service at the hotel, but lousy location”", "Author": "binsca", "ReviewID": "UR15574237", "Content": "This hotel has wonderful service, from the Manager, to the Reception Desk, to the Concierge, to the Spa staff. Very friendly and helpful. Nice complimentary items in the room, too. Really, really wanted to stay there longer, but it's location is not ideal for tourists, probably better for business folks. There are many, many little restaurants on the same street as the hotel; nonetheless, it was too far away from the downtown area near Dubai creek and the luxurious Jumeirah Beach area. If you are visiting Dubai on business, then this is a great place to stay - good service and reasonable rates.", "Date": "May 2, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Southampton", "Title": "“Lovely Hotel - aircraft noisy!”", "Author": "margp", "ReviewID": "UR15532297", "Content": "The hotel is very well located near the airport. The hospitality is second to none, its clean, comfortable and has good amenities. Having said that it is rather spoiled by being on the flight path, which is not good if you are a light sleeper. We stayed 3 nights, everyone was really friendly and helpful.", "Date": "May 1, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "California", "Title": "“Not that great. On the seedy side. Again, Very Overrated”", "Author": "AliveInSea", "ReviewID": "UR15497724", "Content": "For a four star sheraton, nonetheless in Dubai, I was very unimpresed. The lobby was outdated and felt cramped and cheesy. The reception made multiple attempts to con me into paying more than agreed upon for different rooms, they operated like a used car dealership. Maybe I have high sandards but I already got bad vibes. Beware of the club on the 2nd floor, which management has encouraged its transformation into a brothel. Which would have been okay had the girls not looked like drug addicts, just kidding, ok not really. The room was nice with a large comfortable bed a flatscreen TV with a broken remote and repetative channels. The bathroom was ugly. I didn't like it but Im sure some wil.", "Date": "April 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good service, Upgraded Suites beautiful”", "Author": "Crazytravelgirl", "ReviewID": "UR6917707", "Content": "I got a great web fare on an Executive suite and I was bumped up to a nicer suite. From the moment I came in I was treated wonderfully and waited on hand and foot. Although it was a little much after a while. The best thing was that they put up with a lot of mess from me. I was a single girl on my way home from holidays and I was being a bit wild but unlike some other hotels in Dubai, they didnt say anything. The down side is that there is no good clubs really close so you have to take a cab but it is a great location if you are just in town for a few days so you are close to the airport", "Date": "March 5, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sacramento, CA", "Title": "“What a Dump!”", "Author": "rlaw811", "ReviewID": "UR6646815", "Content": "The rooms are dated, tired and tiny. Location is close to airport - read Aircraft noise - but they charge excessively for airport shuttles. Breakfast is overpriced. And best of all, when I questioned the 20% local taxes, I was told - \"You're a rich American - you can afford it.\" A disappointing Sheraton.", "Date": "January 23, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Worcs, UK", "Title": "“Dreadful hotel”", "Author": "Bailey1481", "ReviewID": "UR6571386", "Content": "I would never recommend this hotel to anyone. The quality & service were significantly below standard and could not believe it was under the Sheraton name. Our room (non-smoking) was dull and dismal, the shower was constantly cold and quality of the hairdryer was poor. We requested a transfer to a better room and were given a brighter one but a smoking room, that stunk!!! In fact, the smell was so overpowering I could not stand to stay in it. The bathroom was old and tired with cigarette stains. The response from the hotel was firstly an airfreshener!!! And secondly, an ioniser (or so they say) that didn't do a thing. The only reasonably pleasant spot was by the pool. Yes, the planes do fly over but compared to the rooms, this was not a problem! I could not stand the unpleasant rooms and the awful smell any longer and we arranged to move hotel. This was not what I expected from a Sheraton hotel and it was certainly not the pleasant end to my holiday that I expected. We moved to the Sheraton Dubai Creek and this was fabulous. The location was fantastic with wonderful views (unlike the Deira), and the room/hotel quality was faultless. I would advise anyone to consider the Sheraton Dubai Creek if you are looking for accommodation near the Creek rather than Jumeirah Beach area.", "Date": "January 10, 2007"}], "HotelInfo": {"Name": "Sheraton Deira Hotel", "HotelURL": "/ShowUserReviews-g295424-d304492-Reviews-Sheraton_Deira_Hotel-Dubai.html", "Price": "$69 - $294*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Al Muteena Street</span> | <span class=\"extended-address\">PO Box 5772</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "304492", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3c/da/3cda770c009af8c534437ba00df82ae17large.jpg"}}