{"Reviews": [{"Content": "What a great solution to stay in Tokyo!!       room's tea table+chair", "Date": "Dec 22, 2008", "ReviewID": "UR418345964", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "bigoi75"}, {"Content": "Great hotel, great price, some flaws We took a very long time looking for the hotel, as we tried to navigate by subway. Ochanomizu is a very long walk from the hotel, the nearest station, Yushima, isn't on the main subway lines. It took some navigating and changing trains to find it.The hotel is located up a rather steep hill. Its a long walk up at the end of every day. Didn't look forward to it.There's only ONE free internet access terminal, and unfortunately during my entire 2 weeks' stay, it was hogged by some really inconsiderate caucasians.Many inconsiderate visitors smoke at the lobby lounge, and it can get unbearable.On the other hand, Hotel Edoya's location makes it very quick, convenient, and easy to get to the usual tourist places. Ueno, Asakusa, Tsukiji Fish market, Ginza, Akihabara, are all a direct line and mere minutes away by train.There are coin laundry services, a large relaxation lounge on the top floor, an open roof lounge, a hot sauna room, male  female baths, and a basement restaurant. In short, the facilities are great.The staff are wonderfully friendly, and some of the best I've ever met. They are incredibly helpful, speak a modest amount of english, and served us with an enthusiastic smile for the entire 2 weeks of my stay at Hotel Edoya.I stayed at a Japanese-style room, as is my preference. It was larger and better than I expected, and great value for its price. The attached room-bath was large enough for 2 people to use at once, never had a problem with the hot water, though the toilet did look a bit old. No problems at all with the aircon, cleanliness, and room cleaning.The great location, spacious, clean, and comfortable rooms, great service, combined with the affordable price makes Hotel Edoya one of the best accomodations I've found in Tokyo yet. The hotel even provides free breakfast daily to all guests. This saved me a lot of time and hassle of going out in the morning to look for a place for breakfast. Although I did get sick of the breakfast after a week.The breakfast consists of both Japanese and Western style every morning, at the basement Japanese restaurant.The Japanese menu consists of: Tamago (egg), Salmon Shio (salmon fillets fried in salt seasoning), cabbage, various japanese plums and appetisers (not sure what they are), rice, and a different soup every day (miso, seaweed, etc.)The Western menu isn't as good. Though its the choice for all the caucasians I've seen at the hotel: eggs, toast, sausages, jam, butter, bread.The funny thing is, the breakfast menu never seemed to change, and you can quickly get sick of it. Also, don't spill anything as the lady in charge (little lady in apron) can get quite fierce. I did, and she won't talk to me for the rest of my trip. The restaurant staff seem entirely separate from the hotel staff though, so I wouldn't discredit the hotel for this. Also, every 5 days you stay gets you a free Kaiseki Japanese Dinner worth 3500 yen at the basement restaurant. For this meal, you can choose from a number of items, of which all are of pretty good quality. The meal is good. Enjoy it. Also the staff (old ladies) are in formal kimonos during the evening. They mainly serve japanese salarymen (office workers).There is a laundromat located 1 min's walk away from the hotel, and at least 2 or 3 convenience stores located in the vicinity. The hotel doesn't provide clothes-iron, so I had to sought a laundromat.My advice to get there: Take the cheapest (no reserved seats) train or the Skyliner from Narita Airport straight to Ueno, take a taxi from Ueno. Its so near the taxi metre will hardly tick. It costs just 800 yen or less. This is the fastest+most convenient+cheapest way I have found to get to Hotel Edoya.I'd probably be going back to Edoya next year, so if you stayed there because you read my review, look out for a Singaporean-Chinese couple and say Hi!", "Date": "Dec 12, 2008", "ReviewID": "UR864166610", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "tnightwind"}, {"Content": "Average ryokan offered friendly service Had a little trouble finding our way from Ochanomizu station. Not even three locals (who had come to help us at their own accord) knew where the hotel was.Once there, friendly service at the front desk greeted us and we were shown to our room. Large and clean, although starting shows signs of its age (around 30 to 40 years) and dark. Shower was had brown mould/dirt build up though wooden bathtub in surprisingly good condition. Hot water took a LONG time to arrive. Futons comfortably thick and room in a quiet position.Lack-lustre air-conditioning not that great in the middle of a humid summer. Had to walk up tiring hill at the end of each day. One public internet station always occupied and involved frequent trips out of the room to check if available. However, the rooftop area was a nice respite. Good location, and once on the subway; getting anywhere in Tokyo was a breeze.Overall a fairly pleasant stay, but couldn't help but feeling we could have done a little better for our money.", "Date": "Dec 11, 2008", "ReviewID": "UR343425840", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "treiber86"}, {"Content": "Hotel Adorable! My husband and I went to Tokyo for our honey moon with money we received as a gift when we got married. We booked our trip rather late as a result, and had trouble finding a nice place to stay within our price range. Luckily, Hotel Edoya told us they could accommodate us by transferring us to 2 other rooms over the course of our two week stay, which really helped us out a lot.The rooms (japanese style) we stayed in were all very well looked after and very clean. The beds were very comfortable, and I really liked the wooden bath. After a long day walking around the city, it was alway a pleasure to come back to such a comforting, relaxing place.The hotel had a free breakfast everyday, which was not only delicious but a great way to try the japanese option. You have to get up really early to catch it, but with jetlag, this wasn't a problem. The hotel also has free internet (only one computer so you might have to wait, but nice to check e-mails at the end of the day). The also have coin washing machines, and a little roof terrace, and an outdoor bath!The staff were very helpful and welcoming, will help you with directions and give advice about nice places to visit. i thought it was very affordable as well. the location is good, close to a few metro stations and a handful of convenience stores. an amazing place over all!", "Date": "Sep 9, 2008", "ReviewID": "UR272402234", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "kdfantasy"}, {"Content": "A really fantastic place to stay in Tokyo - great value too! We stayed here in April. We found it easy to book and it was also easy to find. We were close enough to Ueno and several other metro stops so it was an ideal location. The staff was friendly and went out of their way to help. Free internet access in the lobby. Breakfast was great (go for the Japanese breakfast - way better than the 'western' brekkie!)We stayed for 5 nights so we got a free evening meal in their beautiful restaurant and it was probably the best meal we had in Japan - delicious!Our room was a bit dark but spacious - the toilet was tiny but it was all clean and it felt like we were experiencing something more traditional. It was clean, comfortable and quiet. We really can't fault it. If I ever have the fortune of going back I'll stay there!", "Date": "Sep 8, 2008", "ReviewID": "UR955288142", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "floellabenjamin"}, {"Content": "Excellent friendly ryokan       futon", "Date": "Mar 1, 2008", "ReviewID": "UR853173989", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "emma_1986_1986"}, {"Content": "Hotel Edoya - The second time I stayed in Edoya in 2004 and in 2006. And it will be my Hotel in this year too.If I look back to the last time I stayed in the Hotel I can say there are no big changes at all. And this is GOOD. I found everything like I left it two years before: The room is clean and nice (I prefer the japanese styled room). The bath room is clean and functional. The hotel staff is very kind and helpful. Even if there english is not good they do all to help you. They have WLAN in the lobby. They still can not cook a good coffee *big grin*. You have always hot water on your room for green tea and beer in the fride. To sum it up: The hotel has all you need a long day in Tokyo. The hotel is worth each yen you pay for it.The also have a small onsen on the roof and a sauna. The hotel is located very good (important subway lines, train to Narita, amusement district - all reachable by a short walk).", "Date": "Feb 29, 2008", "ReviewID": "UR145946861", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Seidenpriester"}, {"Content": "The Real Japan After a day at the Disney resort where everything is superb fake,( even the cracks in the concrete paths are manufactured,) it was a joy to return to Edoya for the night. Nothing there was fake. I had the feeling that I was experiencing the real Japan which was missing in the other four hotels in which I stayed during my trip.The staff was welcoming and always eager to help answer any queries. If one was so moved, one could eat enough at breakfast to get one to the evening meal. OH WHAT A BREAKFAST ! The basic western ingredients were there ( bread coffee eggs, ) but it was the authentic local cuisine which intrigued me .... new tastes. textures and combinations. And isn't why we travel. If I wanted familiar food I'd have stayed at home in Australia.I enjoyed the experience so much that I have already reserved a room at Edoya for my next trip in February '08", "Date": "Jan 14, 2008", "ReviewID": "UR201261938", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "jamesjamesCanberra"}, {"Content": "Great hotel, especially for the price I stayed at the Hotel Edoya for about 3 days, and it was great. The building, lounge, etc may be a little old but I didn't care. Our room was one of the Japanese style rooms and it was great - we even had a separate living room which I did not specifically book, so our entire suite was huge! The staff was wonderful and tried their best to help us in english, to find places in the area, etc. Very conveniently located, only a short walk to train stations. Excellent hotel to serve as your base when exploring Tokyo, and a good price. I've even recommended it to friends who were traveling to Tokyo.", "Date": "Jan 11, 2008", "ReviewID": "UR989990164", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "acornhead"}, {"Content": "nice cheap little hotel - very freindly staff I think its a advisable hotel for this very little price. The room was clean, large and simple but very nice furnished. I stayed there for three weeks and it was a very comfortable basis for exploring Tokyo - you have only a few minutes to walk to Ueno Station or the Metro station. The partial english speaking staff was very helpful and always friendly. It is right that it is a little bit old but this is rather charming than objectionable.", "Date": "Oct 25, 2007", "ReviewID": "UR879272526", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ichinichi"}, {"Content": "Cheap but dissappointing This hotel located in Ueno is really cheap but I think it's worth pay more and spend a better stay. It's really old and rooms are dark and the bathroom is really horrible. You have to do a big effort to have a shower there. I found a sock under my futton (it was not mine) so I'm not sure it was very clean. Corridors have a nasty smell and you prefer walk and walk for hours in Tokyo better than spend more than a minute in the room. Nevertheless is really cheap and if you can't afford spend more money, location is good and there are Internet free access.", "Date": "Aug 5, 2007", "ReviewID": "UR173721300", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1", "Value": "4", "Rooms": "1", "Location": "3"}, "Author": "corrilleros"}, {"Content": "First class service When we first entered the hotel, we were greeted by the warm welcomes of the hotel staff and the cosy ambience of the hotel lobby. Though small and a little old, the hotel had a cosy and inviting atmosphere, the feeling of coming home. We took a 3+1 japanses-styled room for 5 nights. The room though a little cramp, was clean. Despite having small pillow, the tatami mats were large enough and the blanket was soft. Facilities were rather complete. There was a hot spring for relaxation after a hectic day, a computer with fast internet connection, hot water for instant noodles, cool potable water for drinking, etc.Most importantly, the hotel staff were very friendly and polite. Language wasn't much of a barrier as we met with a staff who speaks English. In short, the hotel staff tried their very best to answer our queries and clear our doubts. Maps are also provided.", "Date": "Jun 23, 2007", "ReviewID": "UR900383949", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "jasonnn"}, {"Content": "A little bit old.. I reserved this hotel because I wanted a room of Japanese style. The hotel is a little old and not in very good state. The small Japaneseroom was rather pretty, but unfortunately there was much noise.I found that it was a little expensive, for quality suggested.I will not go back there.", "Date": "Jan 11, 2006", "ReviewID": "UR282891621", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not Bad for the Price I had read both of the previous reviews before deciding to try it. Both were correct. It is a great place to stay for the price and is very close to Yushima station, but yes you do need to climb a huge slope to get there... but if you're like most traveling in Japan, you are used to walking! The staff was friendly - only one spoke very good English, the others did ok. My room was a western style and was clean, but definitely could have used some updating. I was just happy to have a nice bed, a tv (for noise - no English) and a refrigerator. The bathroom area was clean, and the shower was very hot with great pressure, but you could not have paid me to use the bathtub! The hallway carpeting was in a hugely sorry state. I did not use the ofuro, although a Japanese woman had been so it must not have been too bad (?) The free breakfast was good, although I was unaware of what it was I was eating most of the time. The restaurant was very clean. I would stay there again because of the location and price. If you are there on vacation, you should be too tired to care about how clean the outside of your room is or how outdated the hotel is in general. You could do worse - I saw worse places while I was in Japan!", "Date": "Nov 30, 2005", "ReviewID": "UR502389080", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "Lexirose"}, {"Content": "Tired and worn I stayed at a small Japanese room. It was reasonably sized, and sheets were clean. Location was also pretty good, though you'd need to climb up a slope to get to the hotel. The complimentary breakfast was also not bad. Unfortunately, those would be about the only plus points of the hotel, and I would not recommend staying at it unless you have no other choice. It has been around since the 60s, and is sorely in need of refurbishment. The toilet was stained, and the bathroom had a musty smell (the ventilation fan wasn't working). The bathtub (Japanese styled) was also in a really sorry state and I was totally put off by it. You might be able to find better value elsewhere.", "Date": "Jun 5, 2005", "ReviewID": "UR972117054", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Place for a Good Price My husband and I stayed here for 6 nights and really enjoyed the hotel. It is located near several train station for easy access. The complimentary breakfast really help keep our trip within our budget. If you want a clean, well maintained place to stay with a friendly accomodating staff look no further.", "Date": "Nov 19, 2004", "ReviewID": "UR503960620", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excelente   showReview(22669821, 'full');", "Date": "Dec 12, 2008", "ReviewID": "UR125632463", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "VMTK"}, {"Content": "Volver茅   showReview(21943813, 'full');", "Date": "Nov 17, 2008", "ReviewID": "UR399128239", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "wilbur_kyriu"}, {"Content": "Encantador lugar y buen servicio   showReview(21619492, 'full');", "Date": "Nov 7, 2008", "ReviewID": "UR312584019", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Llors"}, {"Content": "H么tel 脿 l'ambiance japonaise   showReview(21162019, 'full');", "Date": "Oct 24, 2008", "ReviewID": "UR634832186", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "EmmaGa"}, {"Content": "Veramente bello       Esterno dell'hotel, strada verso la stazione della metro", "Date": "Oct 3, 2008", "ReviewID": "UR717505059", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "baldoc"}, {"Content": "Conveniente e carino   showReview(19568658, 'full');", "Date": "Aug 31, 2008", "ReviewID": "UR804438642", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "variFirenze"}, {"Content": "Economico ma ok       Interno camera", "Date": "Mar 23, 2008", "ReviewID": "UR844449026", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "barzies"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066442-d304541-r22913359-Hotel_Edoya-Bunkyo_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "304541", "Price": "$127"}}