{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "ATHENS", "Title": "“nice hotel”", "Author": "THANOSZACH", "ReviewID": "UR120264282", "Content": "It'a very nice hotel, with very rich breakfast and large rooms. The only problem is that you have to cross the city and some times you loose some time on your way there.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Friendly staff average property”", "Author": "tatliturk", "ReviewID": "UR120064063", "Content": "My wife and stayed at this property which was designated as the conference hotel. The conference was organized by Marmara University and the location was convenient. Check in was seamless as we had already reserved on line through the conference web site. We were taken to a corner 'suite' which was at best a small room with no suite in sight. The room had a coffee maker and a double bed which was pretty average in terms of comfort. The next morning we went downstairs to breakfast served buffet style. Very average offerings of cheese, butter, some jams, and honey, two kinds of bread and coffee or tea. The next morning my wÄ±fe supplanted the bread basket with a few awesome fresh simits from the simit vendor outside. And management added some fruits to the breakfast offerings. The next night we had trouble sleeping as the young people next door kept talking loudly which sounded like they were inside our room because the walls were paper thin. After I requested that they tone it down they complied only to repeat the act the next night. When we asked the front office people next morning to move us to a quiet room they moved the young people instead!!! Check out was a stressful experience as they wanted to charge us 120 Euro per night when the conference rate was 80 Euro. This for a hotel that we rate as 60 Euros, at best. Eventually the conference chairperson was involved and after back and forth telephone calls between the front office people and top management we were given a discount down to 90 Euro per night. They said this was a goodwill gesture. So the bottom line: There are much better hotels in Istanbul for that price but we really liked the staff.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“It is nice hotel”", "Author": "kuwaity-word", "ReviewID": "UR117269748", "Content": "Mim hotel has beautiful decoration. It has nice breakfast. His rooms very nice. The employies is friendly.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“very nice hotel”", "Author": "dodoswiss", "ReviewID": "UR116147664", "Content": "I went to this hotel with my wife because she has to make an operation in her eyes (Lasik operation).the hotel is only 5 meter away from the hospital. it's very modern hotel and from there you can go to anywhere in istanbul without problem. Istanbul is a very interesting city and the food is very good and shopping is amazing.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sonderborg", "Title": "“Good hotel, but lousy location”", "Author": "Jan_Bruns", "ReviewID": "UR56164018", "Content": "Stayed at the Mim hotel, as I had eye surgery in the Istanbul Surgery hospital, located right next door. So when compared to this the location was excellent, but otherwise it was not good. One night we where at a soccer game, where Turkey played Hungary, we decided to walk back as we could not get a taxi. When we got close to the hotel we meet several groups of young Turks, who we asked for directions, the all recommended that we took a taxi, as it qoute 'was a bad neighboorhood'. The hotel is located on a very steep road, there are no restaurants near by, but there is a pizza place right across the street, alcohol is served at the hotel. If you want a taxi you have to got the the main road near by, and hope that you can catch one (usually not a problem). So the surroundings are not to good, the htel it self is rather nice though, its maintained quite good, the rooms are very nice, the staff is usually very helpful, I recommend the hotel if you have to go to the hospital, if you just want to visit Istanbul you should find somewhere else to stay.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Skopje", "Title": "“Highly recommended with outstanding staff”", "Author": "LjupcoA", "ReviewID": "UR34724371", "Content": "In the past two years I have stayed in Mim Hotel several times. The Hotel is located in a superb location only 10 minutes from Taxim Square by Taxi and has its own shuttle bus. Inside it is very very clean and the rooms are surprisingly big and comfortable. Even my little son finds enough room to run around. The Hotel has excellent breakfast in the morning with variety of food for everybody. Hotel staff is outstanding and very helpful. They are much closer to a five star hotel. I would recommend this Hotel to anybody that needs to stay in Istanbul regardless if it is for a business or for pleasure. It is also highly recommendable for a family with small children as well.", "Date": "July 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "other", "Title": "“Lovely Hotel”", "Author": "Tourist_2007_2007", "ReviewID": "UR10495740", "Content": "Very friendly staff, good service, small but very clean rooms, great breakfast ... the only problem was about the location, which you won't have any problems if you like walking for about 20 mins for getting to Besiktas, Another way is taking a bus to Eminunu by 5 mins walk! For getting to Taksim, you can take a taxi for 6-7 YTL in the traffic time, or you can go up a hill for about 20 mins and get to the nearest Metro station. The taxi for the same route will cost you about 3 YTL. It should be mentioned that the hotel has free shuttle service for a route to important places which will go at 8:00 am and 19:00 everyday except weekends. At weekends more services are available. Also free wireless internet connection was available in the hotel! On the whole, I recommend the hotel! It was great being in a nice and friendly atmosphere inside!", "Date": "November 1, 2007"}], "HotelInfo": {"Name": "Mim Hotel Istanbul", "HotelURL": "/ShowUserReviews-g293974-d304826-Reviews-Mim_Hotel_Istanbul-Istanbul.html", "Price": "$138 - $171*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fulya Bayirl Ferah Sokak No 16</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">80200</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "304826", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9f/b3/9fb3638bfe0d6760baed880f9ed4e2d31large.jpg"}}