{"Reviews": [{"Content": "Villa Antea We stayed at Villa Antea for our first trip to Italy in September and we couldn't ask a better place for this occasion.Romantic Relais...we have never had such a wonderful welcome, the personal attention was terrific and Serena, the owner, is a fantastic host and nothing was ever too much trouble.Prior to our arrival, the staff was very helpful suggesting the best places to visit and organizing all the activities during our stay: we had the opportunity to visit a superb wine production absolutely out of the beaten track!!Our room was big and comfortable, and the bathroom.... HUGE!!! My wife really loved it!!! We also enjoyed hanging out there drinking red wine and eating parmesan cheese 鈥?amazing value and top quality!!! The relais is situated in a lovely area that is a short 15 minute walk from the center of Florence. We will be back someday and we highly recommend staying at Villa Antea to anyone who visits Florence!", "Date": "Nov 4, 2008", "ReviewID": "UR646532689", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "giuliaNYC"}, {"Content": "Lovely Florence Villa My husband and I just returned from a two-week trip to Italy which included a 5-night stay at Relais Villa Antea in Florence. What a lovely experience it was! We loved the oversized rooms, the huge bathroom and the B and B atmosphere of the hotel. The morning breakfast spread was wonderful, with cold items and made to order hot items equally available. Our room included a chaise lounge for relaxing and reading that was welcome after full days on our feet!The villa is situated in a quiet neighborhood, within walking distance of the central part of town and a welcome respite from the congestion of the main part of the city. The best part of all, however, is the delightful, gracious and helpful staff managing the hotel. Each person we encountered was kind and went out of her way to be helpful with whatever our needs were, from finding the correct bus, or calling a cab to getting a guide lined up in Rome at our next stop. The hotel staff also provided a helpful written guide to restaurants in the neighborhood and kindly made reservations for us each night when we decided where we wanted to go. Our experience at Villa Antea was so perfect that we promised to tell all our friends about it when we got home. I have already written my travel agent and advised her to book her future clients at this gem of a hotel.", "Date": "Oct 2, 2008", "ReviewID": "UR242445977", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "AnnaLisa8"}, {"Content": "Great stay at the villa My wife and I just returned from a 4 night stay at the villa and would certainly stay there again the next time we are in Florence. Rooms were very spacious and the bathroom was huge and very comfortable. I found no problems with the hairdryers nor did my wife. The breakfasts, the usual meats and cheeses plus any style eggs you wanted with bacon or sausage, were great and sustained us until the mandatory late afternoon gelato trip. Prior to the trip the hotel was very responsive to my numerous e-mails and was very helpful. All the hotel staff and the owner were very friendly and took the time to make sure everything was to our liking. We don't mind a little walking and if you are in fair physical condition you'll have no problem walking to most of the sites. I would certainly recommend this hotel to anyone visiting Florence without hesitation. We have vacationed in Europe for the last 3 years and this was one of the betterhotels we chose and I choose all my hotels from comments I find on Tripadvisor.", "Date": "Sep 22, 2008", "ReviewID": "UR106393366", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "golfguy62"}, {"Content": "Nice and relaxed Large bedrooms, great bathrooms and very competitively priced for Florence. However, it was the help we were offered by the Villa's reception desk that really made our trip. Nicola recommended some excellent authentic Tuscan restaurants and great local bars over the duration of our stay. With many more galleries and eating establishments left to explore, we will most definitely return to Florence and Villa Antea.", "Date": "Aug 7, 2008", "ReviewID": "UR140243574", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "JRichmondM"}, {"Content": "A very memorable stay! We are traveling seniors and we enjoyed our 4 night stay in the fabulous Villa Antea exceedingly! Our room was generous in size with a beautiful, large bathroom. We found the hotel very quiet and the breakfast excellent! The hotel is located just a few minutes walk from all of Florence's wonderful main sights. The walk itself gave us a chance to experience fun neighborhoods where we found some nice restaurants. I certainly would recommend this lovely facility.", "Date": "Jul 28, 2008", "ReviewID": "UR110182373", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "Twitterpated Traveler"}, {"Content": "Great Place Lovely big, tastefully decorated rooms and good service made our stay at Villa Antea a pleasurable one. The staff were only to happy to make art gallery and restaurant reservations for us and went out of their way to help when problems with the wireless internet connection and cable TV arose. Breakfast was delicious and as the hotel is about a 20-25 minute walk to the major attractions you do get a chance to appreciate the local areas of Florence.", "Date": "Jul 5, 2008", "ReviewID": "UR714627734", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "TokyoCjm"}, {"Content": "Fantastic Florence Find! First- Management helped us so much! We loved staying here. Our Italian is not very good, so the staff spoke English with us when our Italian failed miserably. Breakfast was plentiful, tasty. We were able to use the Internet to check emails. We walked in the rain to a local pizza place. Waited 25 mins but it was not a problem- it was inexpensive  tasty. We had lots of wrinkled clothes, so we had to send our clothes out to be ironed. (ironing in the room is not permitted)The staff treated us so well. Our bathroom was luxurious and huge! The room was clean, comfortable. The museums were fun, educational, a real treat. Italy is such a beautiful welcoming place. You really must stay here! We loved the charm and elegance at the Antea.", "Date": "Jun 26, 2008", "ReviewID": "UR886690636", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "TravelDo2"}, {"Content": "beautiful secluded retreat My boyfriend had booked for us to go to Florence as a surprise for our first anniversary. His choice was perfect. It is a little out of the main part, (our feet ached after three days of walking around) but I think that is the charm of the hotel. The setting is lovely, relaxing and a real haven away from the hustle and bustle of the tourists and the rush of sightseeing. The staff were incredibly helpful-even more so to him before we got there, as they spent a lot of time helping him to choose where he should take me for a perfect view and a meal (where he proposed to me). The next morning he had arranged for them to have a bouquet of flowers delivered and all this was executed beautifully. The rooms are lovely, the breakfast delicious and presented impeccably. I would not hesitate to recommend this hotel. The ONLY thing I would advise is to take your own hairdryer, as blowing on your own hair would probably have been more effective than the one provided!!A fantasic experience (and he proposed in Fiesole for those of you interested!!)", "Date": "May 29, 2008", "ReviewID": "UR290446064", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "4"}, "Author": "catherinec-g"}, {"Content": "Relaxing Luxury I took my wife to Villa Antiea for her 40th Birthday.Before and during our trip the staff were extremely helpful. We received a bottle of champagne on arrival and their advice on local, non-touristy, restaurants was spot on (the Tuscan restaurant they recommended was excellent).Villa Antea is about 20 minutes from the Doumo but the walk is a pleasant one and takes you by the markets etc.The room and bathroom are massive and the breakfast is a combination of coffee, luxury continental, eggs and bacon but not full english!For a relaxing and luxury break go here!", "Date": "May 23, 2008", "ReviewID": "UR203808956", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Inverclyde"}, {"Content": "Great hotel Great hotel for the price. Staff is very friendly and helpful and the breakfast was great. It is about a 20-30 minute walk to the major attractions, not the ten minute walk that is advertised. Also, the wireless internet only works downstairs and is super slow. A big deal if this is the only way you can stay in contact with home (kids and family). If you can afford it book the suite that has the bathtub (room #6). Well worth the extra $$ . This hotel is super quiet. You can hear people coming and going at all hours. A good and bad thing. Overall a good experience.", "Date": "Apr 1, 2008", "ReviewID": "UR802855832", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Frank55"}, {"Content": "The best place we stayed in Italy My husband and I stayed here for 1 night on our honeymoon and loved it! We wished we had made reservations to stay longer. I enjoyed being out of the hubub of the tourist areas but within easy walking distance. We will be back!", "Date": "Mar 25, 2008", "ReviewID": "UR544812060", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "turboca"}, {"Content": "Warm welcome despite the cold weather The advance help and advise gave us a clear impression that our stay would be good and we were not disappointed. Friendly low key attention, comfortable room-nice bath for post walking relaxation, and a generally helpful atmosphere ensured we were warmly looked after-which was just as well, because the biting icy winds were less than welcome-first stop in Florence was the market where leather gloves and cashmere scarfs were plentiful and very necessary.Will be back to both the Villa and the city-lots more to see and do than we could cram into 2 and a half days.Eleanor and Harvey-Glasgow", "Date": "Mar 16, 2008", "ReviewID": "UR360641224", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Hamelldaeme"}, {"Content": "incredible home away from home My husband and I went there for a vacation on our own (no kids) We found the accomadations incredible!!! The room was sensational, huge and furnished beautifully with everything you could possibly need. The shower is beyond words, you could have a party in there if so desired. The staff could not have been any more helpful or friendly. They meet your every need and more!!! I would Love to keep this place a secret for just ourselves, but it is too nice not to share!!! The breakfast was also very good . The smell of fresh crossiants wafting into your room made you want to get up and start your day. I look forward to going back there one day!!!", "Date": "Feb 15, 2008", "ReviewID": "UR424471180", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "magnoliaGeorgia"}, {"Content": "Villa Antea Villa Antea is an attractive Villa tucked away a short distance from the main sights of Florence. As per all the other reviews, i can confirm the bedrooms are very large and the bathrooms are equally sizeable with super showers and immaculately clean throughout.Nice comfortable King size beds, beautiful hallway and staircase. Breakfast is limited, but it almost doesn't matter as the Villa Antea is such excellent value for money in every other aspect. Can easily walk to main sights during the day, but advisable to get taxi for the evenings. Would recommend to friends.", "Date": "Feb 11, 2008", "ReviewID": "UR910361008", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MargoMidlands"}, {"Content": "Villa Antea remedies a billing problem Villa Antea is a lovely Bed  Breakfast style hotel. The building and rooms are full of light and artfully decorated, bathrooms are sumptuous, and the staff were nicer and friendlier than at a typical tourist or business hotel. Being from New York City, I didn't mind at all the 15 minute walk to the City Center. I brought my mother to Italy for her birthday and she loved this hotel (so long as we took a taxi home!).My only issue with Villa Antea occurred about two months after our stay. As I understand it, Villa Antea changed ownership a little less than a year ago, but the previous owners, before selling the hotel, charged my credit card twice for my stay. I didn't catch this double charge immediately and after months of filling out forms, my credit card company declined to refund me the charges (next time I'll use American Express or cash!). I brought this issue up with the current owners of Villa Antea and they have since sent me a voucher for an equivalent visit.Since the double charge did not take place during their ownership, I am very satsified with their response and their willingness to take responsibility to remedy the situation. They seem to care very much about their guests' experience, even one year after their stay! Perhaps next time, I'll bring my husband to this hotel, as it is well suited to be a romantic get-away. I would recommend this hotel to fellow travelers.", "Date": "Feb 10, 2008", "ReviewID": "UR156106428", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "3"}, "Author": "veronajuliet"}, {"Content": "Romantic Getaway Slightly out of town but only 15 minutes walk to the Dumo and other main attractions. Location gave great access, via staff recommendations, to great restaurants that are off the tourist path. The rooms are large and very well furnished. We would recommend Villa Antea especially to couples looking for a perfect romantic getaway.The staff are very helpful and friendly and we would not hesitate to book there again.", "Date": "Jan 4, 2008", "ReviewID": "UR337143366", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "charlescroaker"}, {"Content": "Interesting Place My wife and I stayed at the Villa Antea for 1 night with our daughter and friend using two rooms. Our daughter had previously stayed there just before Christmas and loved it.As other's have commented it is a delightful place, very helpful front desk staff, enormous bedrooms and bathrooms (even by the standards or American hotels) with an interesting mixture of classical design and furnishings alongside very contemporary elements. The (buffet) breakfast was relatively simple but everything very fresh. The Caprise salad was excellent and the fresh fruit salad looked as if the ingredients were fresh as opposed to the usual European offering of canned fruit. As it was January we obviously weren't able to sample the outdoor terrace.Also as others have noted, it is about a fifteen to twenty minute walk to SMN train station - I'm not sure I could get to the Duomo in fifteen minutes without braking into a jog. When the weather is favorable this isn't that disadvantageous but when its cold and/or wet it's less appealing. In addition the walk is not particularly interesting, if one likes to be in the center of things this probably isn't a good choice. A taxi from the Centro late at night for a party of four was EUR14. The local bus stop is just around the corner, however, we're told they don't run frequently after 8 PM.The one thing that took the edge off for us was no hot water the morning of our stay; the boiler had broken the previous evening.Overall I'd say a nice place for those looking for a large bedroom and bathroom, who appreciate interesting design, don't mind limited hotel style services and don't mind an invigorating walk every time one goes into town. I have a harder time deciding on vale for money and whether its worth it in the spring or summer. EUR180 per night seems expensive to me but I don't know what rates are for comparable hotels nearer the center, I do know that Florence is expensive generally.", "Date": "Jan 4, 2008", "ReviewID": "UR733512960", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "3"}, "Author": "TiburonTony"}, {"Content": "large, lovely  What a lovely villa! My husband, labrador, and I so enjoyed this quiet, gorgeous hotel within a 15 minute walk from the Duomo (cathedral) and old city. The staff was knowledgeable and offered a ground floor room with private entrance to accommodate our dog. We have traveled extensively in Italy and this is the largest bedroom and luxury bath we have seen! What a treat! The luxurious fabrics and upholstery throughout are true representatives to the best craft in Firenze. Highly recommend.", "Date": "Dec 26, 2007", "ReviewID": "UR558928117", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "American_in_Italy_7"}, {"Content": "Beautiful retreat in Florence This was one of our delights among several on a recent trip to Crete and Italy. For starters the shower is unbelievable - at least 8 ft x 10 ft, and the rest of the bathroom is about three times that size. And then it comes with one of those pole units with about half a dozen shower heads on it. Wonderful way to relax after seeing the sights of Florence. This was true in room #1 and also the suite upstairs.Quiet property off the beaten path but still within reasonable walking distance to the major sights. Those who think a 20-30 minute walk is strenuous exercise won't agree, but those who like walking will. Breakfast was great with eggs made to order.Speaking of food, two great area restaurants are Ristorante Il Cavaliere and Cafe Alfredo. The excellent staff, who are very accomodating and friendly, can tell you how to find them.The rooms, and showers, were larger than most for this class hotel and price range. Overall this was an excellent value for the money.", "Date": "Aug 8, 2007", "ReviewID": "UR200100523", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Heydehi"}, {"Content": "beautiful villa our 5 day stay in this wonderful city was made even better by our stunning accomodation. Large room with huge bed and big bathroom in amagnificent villa only 15 minutes walk from the tourist area and 30 minutes walk to the ponte vecchio, although there is a bus to take you into town on the same road.After the hustle and bustle of the city, a glass of champagne or chianti in the quiet villa courtyard to relax is a must.", "Date": "Jul 16, 2007", "ReviewID": "UR549480963", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "mikeDunfermline"}, {"Content": "Great Place To Stay In Florence! Date: May 15th- May 18th, 2007Place: Florence, ItalyVilla/Hotel: Villa AnteaRating: ExcellentMy husband and I celebrated our 25th anniversary with a trip to Italy. We visited Florence and stayed at the Villa Antea which has six very big deluxe guest rooms and have the largest deluxe bathrooms that we have ever seen in Europe. We were very pleased that the management welcomed us warmly on the day that we arrived from Rome after our train ride. The villa manager was very helpful with reservations for the local attractions before we arrived and also went into great detail regarding how to get around and where to eat in Florence. The attractions are about a 15 minute walk from the villa which was nice since we were away from the Florence traffic.The room was beautiful, clean, oversized, and had very high ceilings. The bathroom was very large with a huge shower and very attractive tile work.Breakfast was part of the rate and included cereal, yogurt, deviled eggs and cheeses.The villa looked very Tuscany and was painted a pale yellow and seemed to be in great condition. We felt very comfortable during our stay and thoroughly enjoyed, both the villa, and their staff.", "Date": "Jun 6, 2007", "ReviewID": "UR455178085", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "groved"}, {"Content": "una fantastica due giorni all'insegna del relax e della cultura   showReview(22985337, 'full');", "Date": "Dec 24, 2008", "ReviewID": "UR285816169", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "patmaffino"}, {"Content": "un bel viaggio di lavoro   showReview(22172777, 'full');", "Date": "Nov 25, 2008", "ReviewID": "UR814288156", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "matbon"}, {"Content": "Espectacular Villa Antea   showReview(21866335, 'full');", "Date": "Nov 15, 2008", "ReviewID": "UR233937502", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Lanzajo"}, {"Content": "magnifica esperienza   showReview(21144032, 'full');", "Date": "Oct 23, 2008", "ReviewID": "UR641291874", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "capocett"}, {"Content": "Hotel splendido, stanze...   showReview(14059064, 'full');", "Date": "Mar 2, 2008", "ReviewID": "UR422518107", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "La bellezza della villa e le...   showReview(12945189, 'full');", "Date": "Jan 12, 2008", "ReviewID": "UR270599198", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel merveilleux correspondant...   showReview(12651561, 'full');", "Date": "Dec 26, 2007", "ReviewID": "UR764141148", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Muy recomendable   showReview(11054679, 'full');", "Date": "Nov 25, 2007", "ReviewID": "UR777197611", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "gonzalohra"}, {"Content": "Hotel molto carino, belle e...   showReview(11426039, 'full');", "Date": "Sep 7, 2007", "ReviewID": "UR376755916", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Raisonable en prix pour un 4...   showReview(11426040, 'full');", "Date": "Jul 9, 2007", "ReviewID": "UR102569469", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Parfait pour un court sejour...   showReview(12648502, 'full');", "Date": "Jun 30, 2007", "ReviewID": "UR911345535", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s belles chambres et salles...   showReview(11426041, 'full');", "Date": "Jun 8, 2007", "ReviewID": "UR688383248", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Sencillamente maravilloso...   showReview(11426042, 'full');", "Date": "May 2, 2007", "ReviewID": "UR371475039", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "tres tres bien   showReview(11394297, 'full');", "Date": "Feb 23, 2007", "ReviewID": "UR665323519", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Struttura all'interno di una...   showReview(11426044, 'full');", "Date": "Jan 15, 2007", "ReviewID": "UR666923062", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tutto di questo albergo 猫...   showReview(11426043, 'full');", "Date": "Jan 12, 2007", "ReviewID": "UR558254125", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "A mon arriv茅e sur place on m a...   showReview(11426045, 'full');", "Date": "Apr 24, 2006", "ReviewID": "UR959063050", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Ein sehr angenehmer...   showReview(11426046, 'full');", "Date": "Apr 3, 2006", "ReviewID": "UR721724510", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "A fronte di una struttura di...   showReview(11426047, 'full');", "Date": "Dec 17, 2004", "ReviewID": "UR914996667", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Cette villa compl猫te...   showReview(13548436, 'full');", "Date": "Apr 14, 2004", "ReviewID": "UR345128007", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d305315-r21533551-Villa_Antea-Florence_Tuscany.html", "HotelID": "305315", "Price": "$224"}}