{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Good location but just average hotel”", "Author": "Harish Velji", "ReviewID": "UR128104072", "Content": "We stayed at this hotel just prior to the Christmas. Location is good but room quality is poor. There is hardly any room to move. We requested staff on number of occasions to arrange taxis which never happened. However they arranged prepaid taxi to airport. I suppose they must have been happy to get rid of us. As our flight was in the evening we requested the use of one room for an hour or so extra but was denied. Breakfast is ok. I suppose that for Singapore the room price is average but hotel generally is below average and nothing inspiring.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“A nice place to stay”", "Author": "wannabeaussie", "ReviewID": "UR128001184", "Content": "We were in Singapore on a stop over on our way to Australia. This hotel is in an excellent location and lots of places (Raffkes etc) are all within easy walking distance. The staff were very helpful. This was very obvious when my husband lleft his camera in a taxi. The staff contacted the taxi company to check with the driver if the camera was still in the cab, Unfortunatley not,but mothing was too much trouble for the staff at this very comfortable hotel.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Pinas", "Title": "“Good location average rooms”", "Author": "JEmmanuelLasPinas", "ReviewID": "UR127521442", "Content": "I decided to the Bay viiew hotel. I saw it across the street from the Rendezvous. It's in the same good location close to MRt Circle line stations. walking distance to Bugis Junction, Iluma, Raffles City and a few steps away from a good Kopitiam. Breakfast is average. Rooms need some updating.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Value for money”", "Author": "Chloe D", "ReviewID": "UR126678657", "Content": "I booked this hotel again for my trip to Singapore on March this year and to my surprise i paid more reasonable rate than what i had paid during my previous stay. Only to know when i arrived to the hotel there is subway construction going on infront of the hotel. But as traveller, i didn't spend much time during daytime in the room so it didn't bother me much. Important thing is i had clean room in a good location with reasonable rate. It has good buffet breakfast and the hotel staff are friendly. The highlight of this hotel is nice rooftop garden with swimming pool. I would recommend this to those who are looking for hotel in good location with reasonable rate.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Palmerston North, New Zealand", "Title": "“BUYER BEWARE!!”", "Author": "mykeyz", "ReviewID": "UR126479115", "Content": "The Bayview Hotel is in an excellent location. However what they dont tell you is that at the time of making a booking there are huge construction works going on right outside of hotel. This also effects the surrounding hotels in Bencoolen street. There are 3 more years of this construction before it is complete!!. The noise is constant in the rooms from early morning until late at night. BUYER BEWARE......................... The Management were very rude, off-handed and argumentative when we voiced our concerns. Shame on you Bayview!!!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Awful”", "Author": "Andrew M", "ReviewID": "UR126474312", "Content": "Dirty, smelly and very noisy as well as very very rude management. No wifi as advertised, only on the first floor.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Petaling Jaya, Malaysia", "Title": "“Paper thin walls spoils overall value”", "Author": "SLChong", "ReviewID": "UR125848012", "Content": "I stayed 4 nights at Bayview Hotel, Bencoolen Street Singapore on a business trip. The hotel is very near Orchard Road and there is a 7 Eleven and food court literally steps away from the entrance, which is a great convenience. However, the sound proofing of the rooms is a problem and I could hear the guests next door to the extent that it disturbed my sleep for 3 of the 4 nights I stayed here. The sound seemed to be coming through the bathroom. The corridors also had a musty smell. The hotel is also surrounded by MRT construction work, which does generate a lot of sound during the daytime, although it does stop after 9.30pm. This didn't bother me as much, as I got back to the hotel later in the day. However, due to the construction, it is rather confusing for the taxis to find, so I had to guide the taxi driver on occassion to get to the entrance. Breakfast was decent, with the food on offer changed slightly everyday to break the monotony. Staff were generally helpful and courteous. For the price charged, with 2 single beds, coffee maker, iron & ironing board and breakfast, SGD 160 per night (exclusive 10% service charge and GST), seemed like a good deal. However, this was spoiled by the paper thin walls between rooms and heavy construction around the hotel.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Navi Mumbai, India", "Title": "“Hotel Bayview Singapore”", "Author": "Sankar N", "ReviewID": "UR125685541", "Content": "Hi, Had booked my hotel stay from India. The hotel is situated right in the middle of multiple MRT stations. From the Hotel entrance come on the main road then take a right and walk 5 mins is Dhoby Ghaut MRT(Interchange) which connects you to all MRT lines and to the left of the main road is Bras Barah MRT(Circle line). The Rooms are clean and the staff is very co-operative. The breakfast was not very good and the options kept everyday was minimum and some times repeated the same day. The swimming pool on the 15th floor doesn't have option for kids. The hotel only takes SGD 50 as a security deposit aganist any usage done by the guest, aganist an higher amount by other hotels.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“Don't stay here!”", "Author": "TiSwede", "ReviewID": "UR125557729", "Content": "Warning! Don't stay at this hotel. Construction work going on just by the hotel. After complaining, we did get a new room facing the other side but you can still hear the work going on far after 9 pm. The personnel were not very understanding when we asked about changing room but after a while they did admit that it was not very pleasant and that we could get another room (a twin room instead of a double that we had booked and much more worn out than the first room we had). The receptionists were not very helpful and our first impression was not at all good. We also had problems with the baby cot that we had booked for our daughter. When we changed room no-one came to help us. We had to move our entire luggage and the baby cot ourselves. The rooms are quite old and worn out. The swimming pool is quite nice. Not at all huge but ok. Breakfast buffet will feed you but quite uninteresting. We would not stay here again.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good location but be aware....”", "Author": "Michieltravel", "ReviewID": "UR125109929", "Content": "Be aware that there is construction going on on the road right before the hotel. This will take a few months. A lot of loud noise you can hear where ever you are in the hotel. The hotel does not warn you for this and does not give you a discount for this. They moved us to a room at the back of the hotel but did not make a difference. Construction starts at 0800 and continues to 2100! Staff is not the best. Rooms are older than they look on internet.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Good value for the buck”", "Author": "jtblin", "ReviewID": "UR123695207", "Content": "Good location within 10 minutes of the MRT station (although there is some construction work in the street at the moment, making it a bit difficult to access by taxi) between Orchard Rd and Clarke Quay, room was not huge but spacious enough for the price allowing to work comfortably at the desk, service is just ok. Other than that it isn't very pretty but the main point is really the value: cheap, free breakfast (average quality with western and asian food), free internet, swimming pool on the roof. The fitness room is a joke on the other hand: tiny room smelling mold with only a treadmill and a machine that I didn't even try given the smell. There is a park nearby (Fort Canning Park) if you are into running and the roof is a nice place for working out at dawn. When most (much more expensive) hotels in Singapore will charge you $20-40/day for internet access, having free internet is really a plus. There is also free wifi in the lobby and restaurant. Definitely not a place that I'd recommend for a romantic holiday but it does the trick very well when you travel on a budget.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Great Location, Courteous Staff”", "Author": "VirmaniKartik", "ReviewID": "UR123677202", "Content": "My first trip to Singapore and this is the place I got to stay on doing my booking from RCI. Everything about this hotel was good. The location is just perfect with 2 MRT stations in the vicinity(100 meters and 300 meters). There is a new MRT station being built right in front of the Hotel Entrance and will be completed by this year end. There is a nice Seven Eleven outlet also located just next to the Hotel, where travelers can shop for any of their daily needs. They offered a good comfortable room. All tour packages were booked with ease by the hotel staff. Being pure Vegetarians we had fewer options for Food both for Breakfast and Lunch/Dinner. Although the staff was courteous enough to make a few vegetarian dishes for us on request.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good value suite in a reasonable location”", "Author": "mrdeeping", "ReviewID": "UR123443475", "Content": "was the end of a two and half week holiday in Vietnam and Singapore and we wanted something more than a cramped room. We paid 250 USD a night for a suite. The rooms were of good sizes. The bedroom was en-suite and there was another toilet attached to the living room. A first for us. We would not normally pay this much, but it seemed good value compared to some of the basic rates that were being charged for just a bedroom. The staff were very helpful, one guy spending a lot of time trying to explain how we could get to some of the greener areas of Singapore. The breakfasts were reasonable with a decent number of options. There's a 24 hr 7/11 and a small but varied food-court next to the hotel. There's a bus stop and metro station very close. The one thing that could be a problem is the construction work outside the hotel. This is related to the metro and we were told was due to continue for a few years. It had no impact on us whist we were there. They even put Xmas decorations all round the shuttering.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mandaluyong, Philippines", "Title": "“Great value hotel that's very near the MRT!”", "Author": "jovanpuyo", "ReviewID": "UR123432919", "Content": "I enjoyed my stay at the Bayview last time, and so on my next trip to Singapore (this time to watch the Wicked musical at Marina Bay Sands) I booked the hotel again. There are a number of changes in this trip compared to my last one: 1. There is some construction work being done on Bencoolen street itself. I didn't know this until the taxi cab turned left to Bencoolen coming from Middle Road. It's not that big of a hassle but it's noisy during daytime and the taxi stand right in front of the hotel is gone temporarily. 2. The Bras Basah Circle Line Station is open! This is awesome! If walking two or three blocks to the Dhoby Ghaut station is a turnoff, now all you have to do is walk to the corner or Bras Basah and the MRT is entrance is there on your left. In this trip I was able to try the pool, and it was wonderful. I don't know if other guests use this, but I have it all to myself when I went up to the 15th floor. After almost two years, hardly anything changed in the buffet breakfast. If your package doesn't have this, consider yourself blessed. The selection is lousy. As alternatives, there's a 24-hour Kopitiam place a stone's throw away from the hotel that serves chicken rice, dimsum, laksa, duck rice and whole lot more. If that's not your fancy, walk a little more to the Wendy's Hamburgers right next to it along Bras Basah. Our room came with free WIRED internet. What's funny is you have to get the network cable from the lobby, where you have to sign some form saying that you'll return it when you check out. That wasn't my experience the first time I stayed in this hotel. A lot of people must be packing this along with their laptops. Talking about internet, it's slow, even by Philippine standards. I was hardly getting a 1 Mbps connection. I had aircon problems the first time I was here (it was dripping), and I encountered another aircon problem this time - it wasn't making the room cooler. I had to call the reception to have them fix it. Only after the maintenance guy cleaned the filter and made some adjustments did the aircon start to work properly. Will I come back? Yes.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manila", "Title": "“Bayview Hotel Singapore”", "Author": "Louieboytoy", "ReviewID": "UR122812029", "Content": "The hotel is very nice. Very accomodating staff (they also speak Englsih), clean hotel, with swimming pool and very near shopping places! Though I have no plans of going to SG soon, but i can say that I made a good choice and will be in this hotel again if in case I will be back!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“view, what view?”", "Author": "TOGtravellerEngland", "ReviewID": "UR122642448", "Content": "Don't let the fact that this hotel does not have a view of the bay put you off. It is in a great location - very convenient for the waterfront, shopping areas, Clarke Quay and Raffles. The rooms are clean and functional and represent good value for money. Service is efficient and the choice at breakfast is good. We would definitely stay here again.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Great Location”", "Author": "stephanielowhh", "ReviewID": "UR122359418", "Content": "Stayed at the hotel for 3 nites. Clean rooms with funtional old fittings and furniture and very basic hotel amenities. Would say its a 3-4 star hotel at most. Great location at the art & museum district, 2mins walk to the Bras Basah MRT station and it's near a 7eleven and the 24 hours Kopitiam foodcourt. For the price of hotels in Singapore, the hotel is good value for money. The downside is that this part of Bencoolen is currently closed to traffic etc for 3 years due to the expansion of an underground MRT line. The hotel is in the middle of a construction site with a small walkway from the entrance leading out to the main road. You could also hear construction works going on throughout the nite.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth, WA", "Title": "“Staff need to improve their knowledge”", "Author": "Mrs_Mallie", "ReviewID": "UR122321116", "Content": "My husband and I stayed for 3 nights in December 2011. The surrounding area is currently having roadwork done so it was a bit difficult for our taxi driver to find the entrance late at night. The roadwork wasn't a problem as it only occurred during the day. The room was adequate and the bed was very comfortable. The room had a queen size bed and a bath over a shower. It did not have an alarm clock which I think is a hotel room basic and a necessity. It also had a weird space aged type study chair that squeaked if you moved on it. The bathroom had mold on the ceiling and in corners of the shower tiles. This really puts me off. The 3 times we asked staff for assistance and they couldn't really understand what we needed and twice we told them not to worry and figured it out alone. Breakfast was ok with a range of offerings. The location is very good located very close to the MRT. There is a 7 eleven next door and a tea leaf and coffee bean store that has free wifi around the corner. We love Singapore and will come back but next time we will stay at our first choice, hotel Ibis on Bencoolen.", "Date": "December 31, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0"}, "AuthorLocation": "New York City, New York", "Title": "“mold in the A.C.?”", "Author": "10027", "ReviewID": "UR121605047", "Content": "Everything looked fine when I checked in. However, within an hour my nasal passages were blocked and I thought I was coming down with a cold. Went out, the \"cold\" went away. Came back to the room, within an hour I was so stuffy that I had to breathe through my mouth, lymph nodes began to swell painfully and I had trouble swallowing. Check out and into the Carleton. The \"cold\" went away. I have never had such a reaction before, though I have heard about them and am blaming the AC without further evidence. The windows cannot be opened. I couldn't breathe in that room.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent location. Clean modern theme rooms”", "Author": "Ksalcalde", "ReviewID": "UR121383669", "Content": "Stayed 4 days and 3 nights with my wife and 2 young kids. Experience was good having booked junior suite. I liked the interiors as I prefer the minimalist type. Junior suite has a receiving room with LCD. Location was excellent as MRT Bras Basah station is a stone's throw away. Breakfast is a lot better than grand central hotel. Buffet style. Continental with a few Asian choices. Kids enjoyed the roofdeck swimming pool. Water was clean. I was still able to get good wifi signal even though our room is situated in the 12th floor. Take note there is really no wifi service. Only LAN connection. However Singapore has an abundant supply of wifi networks and some don't require passwords. I'll definitely come back to this hotel on my next Singapore trip. Quite expensive though for a 3 star hotel.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "malaysia", "Title": "“Major Construction Site in front of Hotel”", "Author": "The_Rottweiler", "ReviewID": "UR120700374", "Content": "Had to stay one night here as the other hotels in Singapore were booked out for the week. Was shocked to see the entire Bencoolen street is a construction site due to the expansion of the MRT underground system. Taxi's can reach the front of the hotel but need to take an alternative route to get to the hotel front but there aren't regular taxi's now unlike before. You need to walk out to the main road if you need to get a taxi and the hotel staff are not very helpful in this regard. Hotel is fine. No problems with the room doors (don't understand why Indian tourist don't lock their room doors if they are so afraid of people opening the room door. Never had a problem thus far with the hotel staff opening room doors without ringing the door bell first or knocking) and no problems with the buffet breakfast which is simple and predictable but fine. You get the same standards at other similar hotels. This is a 3 star hotel and not a 5 star hotel some indian tourist seem to keep expecting this hotel to be. If they want indian food, stay at a hotel in Little India.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great location, value for money”", "Author": "katbrad26", "ReviewID": "UR120558856", "Content": "This is the second time I have stayed at the Bayview in the past three years and both times I have found it to offer great value for money in a city of expensive hotels. The room was not huge but was adequate size. Mini bar was expensive, but that did not matter as there was a 7-11 right next door to buy your own beverages. The rooftop pool is a bonus and a great place to cool off on those hot afternoons. The bed was very comfortable but the pillows were a bit flat. There was free internet and plenty of channels on the TV. The cleaning lady was very friendly and the room service food was good. Breakfast was included and was buffet-style, with a good variety of western dishes and a few Asian choices - we ate here every morning. The location was great, just a short stroll from Bras Basah and Dhoby Ghaut MRT stations, and an easy walk to Orchard Road and other attractions. Be aware that there are currently roadworks happening around the area on a new MRT station and as such Bencoolen Street is actually closed to traffic, although taxis are able to get access to the front of the hotel.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pune, India", "Title": "“Nice place to stay in Singapore”", "Author": "pawan kumar g", "ReviewID": "UR119888066", "Content": "The location of the hotel is good. As we wanted a connecting room for our teenager children, we were given that. Front desk staff was very friendly and helpful. They helped us in arranging transport as we had to go to Kualalumpur. Breakfast was ok though same for both the days. One more thing I want to share that we forgot our bag in hotel lobby and next day we got it back. Beds were really comfortable, bathrooms were clean and rooms were spacious. We had a comfortable stay there.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“pleasant stay.”", "Author": "zzzuni", "ReviewID": "UR119736634", "Content": "for its location alone, i would give props to this hotel. i love that it's in Bras Basah because it's not as chaotic as Orchard Rd. yet it's also near the city's attractions. also, it's a stone's throw away from Kopitiam, a food court with a great selection of food. there are also churches nearby. as mentioned in the other reviews, it's a mid-range hotel. Bayview is not as expensive as the other hotels in Singapore. while there's nothing spectacular about it, it's a good value for money since the rooms are clean and big. buffet breakfast had a wide selection. staff was generally friendly & accommodating. ok, it is old but not run-down. overall, i had a pleasant stay in this hotel and would definitely go back.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vietnam", "Title": "“Best of the middle range”", "Author": "TTDao", "ReviewID": "UR119519114", "Content": "Everyone know that accomodation in Singapore are expensive. If you're looking for a clean room right in City Centre at a moderate rate, Bayview is your best choice. Location is its main advantage. At less than 1 minute walk to 3 bus stations and Bras Basah MRT, I think it's the most convenient place to stay. Though it's an old hotel, it's well maintained. Everything was clean and efficient. Front desk and restaurant staffs were kind and helpful. My room was not large, with a glass window opening right on the white wall of the next door house, no view at all, but it didn't bother me much. Breakfast was not bad, not so good either, the food was displayed without care, dishes and bowls are all wet and look disgusting. I was particularly shocked by the noise a lady staff made when collecting and arranging dirty dishes right in the dining hall, and I was more impressed that her manager didn't give her any sign to stop the noise, at least she could do it in the kitchen or elsewhere and not right there when all the customers were enjoying breakfast. One more thing, the street was blocked for construction, it's noisy during daytime.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gurgaon, India", "Title": "“Family Trip for a week”", "Author": "AmritVS", "ReviewID": "UR119386741", "Content": "To be frank and honest, i booked this hotel based on reviews on various sites. Since i dint find any adverse review of the hotel i thought of giving it a try. i was travelling with my small kids and parents so booked my week holiday as 4 Nights and 3 nights incase i dont like i can switch over to some other hotel. But, as soon as we arrived the check-in formalities were all set and promptly done by the hotel staff (swift). They gave us joined two rooms with baby cot as requested which is a fun comfort if you are travelling as a family. Location is unmatched as it is walking distance from Brash Basah & Dhoby Ghaut MRT stations. . . Although there are not many indulging activities to do at the hotel including a good restaurant, it offers a comfortable and clean sleep once ure back from city activities. The price offered including breakfast is a steal buy stay.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clearwater Beach, FL", "Title": "“Solid 3 star on Bencoolen Ave”", "Author": "Traveler5548", "ReviewID": "UR118506694", "Content": "I will start out by saying we got here because we arrived back in Singapore without reservations and upon arriving at Ibis on Bencoolen found they were booked. The front desk was kind enough to get us rooms here (a block down the street) at a comparable hotel to Ibis - and at a lower price (they offerred a last minute special [$702USD for 4 nights] and at 8 o'clock, we were very last minute. City Bayview is ALMOST as good as Ibis Bencoolen but close enough that I think price will come into play. Laundy (only one machine) is not as good as Ibis - if you have a lot of clothes pick Ibis. Restaurant buffet not as good but still good. I would pay slightly more for Ibis, but you will not go wrong picking this hotel in the mid-price range", "Date": "September 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangkok", "Title": "“Lacking respect, standards, but good location.”", "Author": "Pradonism", "ReviewID": "UR118439445", "Content": "I was booked for this hotel by our office secretary. We were there in a group of 5 for 3 rooms. Location is great since it is near Bras Basar MRT station and easy access to Suntec Convention center where the Spikes Asia festival was held. Being a Thai citizen, we are used to the HIGHEST standard of hospitality available anywhere in the world. For the price of 190 SGD per night for a 3 star hotel, it was appalling. For that price, you can probably stay at a 5 star hotel downtown BKK. Rooms were ordinary. The TV turned on by itself every morning. (I thought my colleague turned it on, vice versa). We couldn't get any sleep. Pillows were low and needed two to stop our necks from breaking. For breakfast, I really have no idea where to start. Choices were limited. Everything was BASIC. Quality was extremely low. No cheese. Bacon was soggy. 3 choices of salad to choose from and their dressing looked like it came out from a bottle. Last but definitely not least. Where did they hire these people from? The receptionist (male with glasses) probably in his 20s was downright rude. He was pushy and impolite. Repeatedly asked us for the LAN cable (when it was already returned). Only when he realized he looked embarrassed. He needs a harsh lesson in hospitality. Though it was company expenses, none of us were impressed. Would have loved to stay at the Ibis which was a few steps away. They said on their corporate website that free WIFI was available only to find out that it was available only on the ground floor. You need a LAN cable upstairs. If you're looking to stay in a 3 star hotel, please avoid this horrible hotel.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ireland", "Title": "“Really good standard for 3*”", "Author": "PuffleIreland", "ReviewID": "UR117661355", "Content": "This is a good honest 3* hotel which punches somewhat, but not significantly, above its weight. If you get a good deal it's well worth considering this ahead of some of the more expensive 4* hotels around the Orchard Road area. It's relatively small; service is good, the breakfast buffet acceptable for the price paid (but they should do something about their choice of breads and pastries, which most days was pretty disappointing - consisting of sliced white bread and not-so-fresh croissants if one was lucky). Great location in between two MRT stations. Their \"family room\" was a very positive surprise, really large - actually two rooms that could be completely closed off from each other, both with flat screen TVs. Oh, it's clean too, and room service is better than I had in some of the 4*s around the place! So yes, it's worth considering for its value for money.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Great value, Great location”", "Author": "Eva497", "ReviewID": "UR117093525", "Content": "We stayed here for 3 nights in July 2011. Our room was good size, very clean and we had everything we needed for our short stay. The hotel is in great location, only 2 minutes from MRT and about 20 minutes from Orchard Road. There is also free WIFI in the reception area. We would definitely stay here again.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Oz", "Title": "“No, don't go”", "Author": "SydneysiderOz", "ReviewID": "UR116379157", "Content": "Booked one night (10 hours stay) while in transit as I was heading to Indonesia resort the next day. Some of the other reviews were saying this hotel was ok - good but I must have gotten an old room.There was NO doubt the room required an refurb. If I had known the rate I paid compared to the type of room I got, I might as well went straight to a 2 star hotel to begin with and not pay that price. Oh, there was blood stain on the bed sheets. Unlikely to return.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Goa, India", "Title": "“Good Location, but just an average hotel...”", "Author": "Gordon-goa", "ReviewID": "UR116099912", "Content": "The rooms are comfortable. But the room service is terrible. The hotel staff have a stiff upper lip which is bigger then the famed English! The reception was not too warm and welcoming in the approach towards the guest.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Banbury, United Kingdom", "Title": "“Great hotel would recommend to anyone”", "Author": "Trisha03", "ReviewID": "UR116075641", "Content": "Stayed at the Bayview for ten nights, very very happy with hotel. Its not a deluxe super duper posh hoel but they accommodated us with a smoking room which was cleaned every day fresh towels daily and bed linen every two days without fail. We had a deluxe room plenty of space, En suite bathroom and plenty of wardrobe space and enough drawer space for the two of us. A safe, fridge ironing board and iron were withn the room. Tea and coffee facilities and fresh toileteries daily. We had breakfast twice which had plenty of choice and is buffet style. Staff very very helpful and friendly. Only one bad night sleep due to noise from outside hotel and a unhappy male somewhere on our floor !! Two minutes from MRT at Bras Basah (nearest MRT station), Tourist pass bought from City Hall MRT ticket office. Fantastic transport system, pass can also be used on buses. About £28 for a three day unlimited use pass which got us to most places without the need for the organised trip scenario. Breakfast with the orangutans at the zoo is a must get there early for a better seat. The food court 2 mins away is excellent value as is the 7 11 store next to it. Will definately be staying at this hotel again. It is in the centre of the city with Raffles and City Hall within a ten minute walk. There is a roof top pool with a washing machine and a dryer t dllars each and washingpowder purchased from housekeeping at a doller. There is no sauna but there is a runniong machine and a bike on the roof if you feel the need. The pool is clean and small but ample.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "singapore", "Title": "“clean and convenient”", "Author": "satoyuriko", "ReviewID": "UR116060409", "Content": "Superior room is of adequate size - clean (though headboard / lamps etc can be dusty), fully equipped (wireless internet access, TV with international channels, tea/coffee making facilities, plenty of toiletries). Service is generally good, especially at reception and restaurant. Location is great - 4 nearby MRT stations (Bras Basah, Dhoby Guat, Bugis, City Hall), museums, 24 hour food court, cinemas, shopping centres etc. It is one of the cheapest hotel among the hotels along Bencoolen Street. Though a small hote but it's fully equipped with gym, swimming pool, bar, restaurant etc.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Setúbal", "Title": "“I' came again”", "Author": "JoseSet_bal", "ReviewID": "UR115957984", "Content": "Very good rooms, central, excelent swimming pool in the roof. the staff in the reception could be mor friendly!!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Nice enough”", "Author": "Scotrocker", "ReviewID": "UR115247055", "Content": "Stayed in the hotel for one night as a stop over before flying to Australia. The hotel was clean and pleasant enough although the rooms were a little bit basic with some items within the room being faulty. We were only here for one night and as the Singapore Gran Prix was on at the time, we really didn't spend much time in the room. It served it's purpose as a stop over hotel and was a good price, if we were going back for a holiday again I would be more inclined to spend a bit more to get something a bit more central and a bit more luxurious.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Makati Philippines", "Title": "“Very clean and conveniently located”", "Author": "Nat0123", "ReviewID": "UR115073628", "Content": "My family checked in for 4 nights late June. This was my second stay here and I find it great value for Singapore. The hotel is not new but if you want very clean and well maintained rooms then this is the hotel for you (or me). Rooms are average size and will comfortably sleep 2 (we booked 3 rooms for 7 people and found it gets cramped with 3 people). We also liked the roof top mini gym and pool area. Breakfast was very average and after our first day we opted to go to the nearby 24 hour food court which was very reasonable and had something for everyone. Location wise it is an excellent choice outside the main Orchard Rd district. Check out the MRT station about 200 meters away...it's very new, modern and takes you everywhere. As this is a new train route for the SMRT, there are relatively few people using it. Only thing missing is no complimentary water in the rooms which is pretty standard everywhere else these days. After forking out $3+ for the mini bar water, we bought bottled water at the 7-11 next door for the rest of the stay. Wifi is free but only available in the lobby. Overall it was a good stay with great service. Staff were able to accommodate our request for late check out to 2pm which was great as our flight was late afternoon!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Linkoping, Sweden", "Title": "“WORST EVER HOTEL!”", "Author": "StefanoLion78", "ReviewID": "UR114817346", "Content": "They lost my 1-week booking, so we were accepted only for two nights then they suggested to get the luxury room for twice the price! I asked them to look for another hotel for me, and of course they did not do it. The room was very small. The sink in the bathroom always gets clogged and smells horrible. The swimming pool is also ridiculous... so small! The sauna smells of mud. Completely unreliable!!! Do not go there at all! There are hundreds of other hotels in Singapore.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Singapore", "Title": "“Fabulous Bayview”", "Author": "traveltosingapore", "ReviewID": "UR112562585", "Content": "I and my colleagues were put up in Bayview Singapore last December and it was a pleasant experience. Located on Bencoolen street, Bayview is in the center of the party hub that Singapore is. Clarke Quay, Orchard Road, Singapore Art and National Museum, Suntec City Convention Center, Marina square are all within striking distance of the hotel. If breakfast is your thing then that is an area that needs improvement. Menu is pretty limited and even more so for the vegetarians. A la carte menu is pretty good. nothing extraordinary about taste but the quality standards seemed satisfactory. If you are on business, like we were then getting taxi in the morning is very important. You can either call for the taxi or you can even try your luck by waiting at the entrance. Usually there would be no problem in getting the taxi and you will get one within 15 minutes. The staff was quite friendly and will help you out with most of the stuff that bugs tourists. Room service is timely and the work done is of high standards. We were put up in deluxe room. Television bar and mini bar facilities are provided based on which room is booked. All in all, will recommend it to anyone visiting Singapore.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly staff, very clean, good location.”", "Author": "vian1975", "ReviewID": "UR107155911", "Content": "Stayed for 3 nights and satisfied with the service. Clean room. Room also has safety box , iron and ironing board. Wi-fi is free but only available in the lobby. I love the 24 hr food court just next to the hotel, cheap but nice food selections. Very near to metro station, bus stop and cafe's.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Comfortable and clean for short stay”", "Author": "asiatraveller77", "ReviewID": "UR104898901", "Content": "Stayed in City Bayview at Bencoolen Street for 2 nights. Conveniently located as it's near to the MRT and also food court. Also walking distance to Singapore Management Uni. Location is quite safe as I did walk around alone on the streets at 10pm a nite. But it's Singapore. So it's relatively safe. Rooms are not big but clean and comfortable enough for short stay. And also did not have a hard time in getting a taxi to the airport. There are one or 2 taxis always waiting outside the hotel. Overall, I would rate this hotel as quite good.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Plymouth, New Zealand", "Title": "“Good value!”", "Author": "JordanAndJax", "ReviewID": "UR104260716", "Content": "Just checked out if the Hotel today. Small simple rooms that did the trick-especially as the price of the room is quite cheap! Location was great for us! Right by MRT station, great food options, and Orchard road shopping. Breakfast was great-good food and great selection! Would reccomend!", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Location but Shoddy for Professionals”", "Author": "Yamamus", "ReviewID": "UR101391112", "Content": "We had a stay at this hotel arranged by the organization where we had a short-term appointment. In total we stayed almost 3 weeks. The hotel is in a very good location. It's within walking distance to some shops, attractions, and restaurants in the Central Business District north of the Singapore River. The hotel staff at the front desk were polite and professional, and the cleaning staff were also polite and friendly when we saw them in the hallway. The room had a nice little fridge we could use for milk or leftovers, as well as an electric kettle for tea. In other ways, though, it wasn't ideal for a working professional. Like many Asian hotels, the mattress feels like canvas stretched over a bed of bricks. On the last day I finally woke up not feeling sore. They have a small pool and exercise area, which also includes a do-it-yourself laundry facility. They lock the doors for the pool/laundry at 7:00 pm, so that makes it impossible for someone on a business schedule--and yet they charge a huge price to send out laundry. The sheets and towels felt rough and well-used, with some obvious tears and burn holes in some of the sheets and pillow cases. Also, the drain of the shower/tub was almost contstantly backed up, so it was inevitable to shower standing in 4 cm of water.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Taunton, United Kingdom", "Title": "“Not recommended”", "Author": "Lynn919", "ReviewID": "UR101380783", "Content": "Although in a good position this hotel is not up to the standards one would expect for the price. Staff are not particularly friendly (other that the door staff), only speaking when you speak to them first. Room overlooked aircon units & had a tear in the carpet. The housekeeper seemed surprised that we should object to this! The washing line in the bathroom was too high to use & the loo seat was cracked. There was an offer to move us but we were only there for two nights & couldn't face the upheaval. There is no hotel info (re cost of using telephone, pool rules, TV etc) in the room. The woman on the desk at breakfast on our first morning couldn't be bothered to interupt her chat with a colleague to take our room number & and none of the other waiting staff spoke. Breakfast was just adequate rather than inspiring. Although a nice roof top pool, the furniture is patched and brittle with age. The pool showers hardly produce a dribble. The ladies loo in the lobby had a wet floor & tissue paper on it. The gents loo stank. There was little interest from the reception staff when my husband reported it. As we were checking out two members of staff were having a heated 'discussion' in front of guests. Not a hotel to which I would return!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Very good hotel”", "Author": "Alansouthampton", "ReviewID": "UR100799640", "Content": "We were very pleased with the bayview rooms were big and clean free wifi internet well on the 5th floor, We had B&B and it was a good choice on a morning enjoyed it and it is good for anyone", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“Comfortable place with good service and helpfull staff”", "Author": "Micgwit", "ReviewID": "UR99835213", "Content": "Bay View hotel Singapore. We booked this hotel as a budget place for our first 2 nights following a long haul flight. The idea was to use the hotel just for resting to help us recover from 3 days of nonstop travelling. We did not expect too much for the price we paid but were very pleasantly surprised. The room was very spacious, especially for Singapore. The pool was excellent with great views over the area. Staff were courteous and helpful. The breakfast buffet was more than adequate for our needs, catering for Eastern, Asian and Western needs. The location is fine, a few minutes’ walk away from local transport or one take a taxi from the rank right outside the front door. This hotel does not advertise itself as a luxury hotel but it is far better than most budget hotels I have stayed at before in Singapore. If you are looking for, good service, larger than average room size, a comfortable night’s sleep with decent food, a pool to relax by; then the Bay view will provide all this. I would definitely stay here again if wanted a few days just to relax and recover from long haul travel.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Small rooms, comfy but overpriced”", "Author": "UspeakNYC", "ReviewID": "UR97712894", "Content": "Friends and I went on a last minute trip to Singapore for a few days and we selected what seemed like a decent priced hotel on agoda.com. First things first, they adviertised FREE wi-fi. guess what? only the LOBBY had so-called wi-fi. We did not have any connection in our rooms. Truly dissapointing. That's why I chose the hotel - free wi-fi access, a lot of us were traveling internationally and needed wi-fi to access our emails and skype. They did not have wi-fi and the lobby that did was WEAK. Do not book this hotel if you need wi-fi. The food (breakfast included that we paid for) was just dissapointing...I would have been happy with just the basics but they even got that wrong. I'm no stanger to Singaporean-malaysian food so what they served us was really drab and old, like yesterday's food! We arrived early morning, and tried to use our breakfast for that day but they told us no, it is for the next day (the day after your first night's stay). Really? That is just poor management/customer service. They kept saying they were fully booked and yet there were 10 ppl at the breakfast buffett... Rooms were decent sized but both our rooms smelt smoky - like someone was chain smoking next door or in a vent leading to our rooms. It's a no-smoking hotel too. Terrible. Overpriced, and the staff was rude and mean. I will not be coming back. the only plus? the great location (near almost everything, but then again SING is small)", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location but noisy rooms”", "Author": "Travelcat097", "ReviewID": "UR96891407", "Content": "We had requested a room in a quiet location away from the lifts but were given a small room next to the lift with a view of a brick wall! Not a good start. We thought we would give it a go but after 2 nights asked to move as it was noisy and depressing and we couldn't spend another 4 nights here. The reception staff were helpful and agreed to move us and we were given a larger room with a view. Unfortunately it also had an interconnecting door and we could hear everything going on in the adjacent room as well as the corridor. Don't pick this hotel if sleep is important as people leave and arrive at all hours and you constantly hear loud voices and slamming doors. Not everything was bad though, the pool was lovely and quiet, we had free wired internet in the room and a decent breakfast included. The location was good, close to the MRT and restaurants. The 24 hour food court down the road was an interesting experience and very popular.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lucknow, India", "Title": "“excellent location with all facilities nearby”", "Author": "vipul6789", "ReviewID": "UR96194554", "Content": "We stayed at this hotel along with one more family of young kids.We had requested for an early check in which was denied by reception staff and our flight landed early morning so we had to stay at a near by hotel for few hours as we had kids.This hotel provides a free buffet break fast and it has got restaurent. Even some of good food joint in singapore are near by.over all a decent hotel only problem is hotel staff are very rigid about rules and regulation and they are not flexible even for kids...", "Date": "February 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Perfectly Ok for a short stay”", "Author": "matilda48", "ReviewID": "UR95158463", "Content": "The Bayview hotel has no view of the Bay, it is located within walking distance of Orchard Road and Raffles. Comfortable room nice swimming pool, Ok breakfast helpful staff. This was the cheapest we could find at the time but taxes put the cost up to neraly £90 for the night.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bristol, UK", "Title": "“OK but \"Bayview\" is a bit ironic!”", "Author": "salmoneater", "ReviewID": "UR89141760", "Content": "Stayed here two nights on a business trip. It was Ok but basic. Our room window looked straight onto a concrete wall. \"Bayview\" is a bit ironic! The room was rather small, as was the bathroom, but clean and adequate for a short stopover. Service was good. Breakfast was also good but nothing special. Location is very good - very close to Singapore Art Museum and the National Museum, which really needs a half-day to visit and follow the excellent audio-guided tour of the exhibits laying out the history of Singapore (especially WWII).", "Date": "December 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Great location, bad nights sleep”", "Author": "tibetanrangertwo", "ReviewID": "UR88720582", "Content": "I travelled with my school to Singapore for a conference, and we stayed in this hotel. When we first arrived, I saw the hotel lobby had 80s renovation and was quite small. However, the room was renovated and the toilet was very clean. It looked like I would enjoy my room, but however it was really a mixed bag. First off, the air conditioning was too cold and I often woke up in the middle of the night because I was freezing. I turned off the air conditioning for one night and it was better, but just by sitting in the room without air conditioning proved to be too hot. Another problem with the room is the room is not sound-proof. What I mean is I can hear any noise from neighboring rooms as well as rooms on the next floor. This woke me up twice during my stay at the hotel. It was hard for me to fall asleep again given the beds are not that comfortable. The hotel breakfast was really not that superb. There is little choice in terms of food served and the food was the same every day. However one good thing is the location of the hotel, as there is a local Singaporean canteen a minute's walk from the hotel. The food there, unlike the hotel, has many choices and the food is cheap compared to other restaurants in Singapore. The hotel is also a minute's walk away from the nearest MRT station, which proved very convenient for me as I liked to travel on the MRT to other parts of Singapore. Overall this hotel is great for budget travellers; but for travellers looking for slightly more, stay away!!!", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Good value, service and location”", "Author": "BlackCat2119", "ReviewID": "UR88715214", "Content": "I can't speak more highly of this hotel, its good location, facilities and most helpful staff. Its location was the main reason for my choice. Situated in the CBD, it is only a few minutes walk in the shade to the nearest train station (Bras Basah MRT) and a short stroll to Orchard Road shops and Raffles City. The facilites are very good. The reasonably large room came with Internet, effective room temperature control, and facilities for coffee making and ironing. Room was dry enough for washings to dry overnight even in the bathroom. Above all, I was most impressed with the helpfulness of the staff. I made a mistake with my Internet booking through Agoda, a third party website, but a staff member (Ms Wan) went out of her way to rectify the error directly with them, quite beyond the call of duty.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“A great choice”", "Author": "kakaye1970", "ReviewID": "UR88470632", "Content": "We stayed here for 2 days, wanting to be in the city, and you're perfectly located. Very central. Breakfast buffet was excellent. Bedding was very nice, very comfy, bathroom large and clean. I would absolutely stay here again, for the location, price, and cleanliness. And the roof swimming pool is a deal-closer!", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liphook, United Kingdom", "Title": "“Good location, good value and I'd go back readily”", "Author": "GB01", "ReviewID": "UR85628219", "Content": "The Bayview is a good (but not high) quality hotel which I’ve used a couple of times this year. For Singapore, this hotel represents excellent and affordable value. Hotel highlights are; clean but basic rooms, fast in-room internet (you will need to ask at the front desk for an Ethernet cable), a good shower, a smallish roof-top pool, an adequate breakfast (with both Western and Asian food), an in-room safe and very pleasant and helpful staff. The only downside was that the gym located by the pool is too small, the equipment too limited (just one small bike and one treadmill) and the room is far too hot to use. BTW the poster photo of the swimming pool is very misleading - the pool has a cityscape in the background, not an airbrushed blue sky! The Bayview is well situated - on Bencoolen Street, near Fort Canning park - for the city. It’s very close to the MRT metro (Bras Basur station) and the airport takes around 30 minutes in a taxi (S$20 – S$25). An Irish Pub has just opened around the corner and there’s a good ‘Coffee Bean and Tea Leaf’ concession in the same block. A ‘7 to eleven’ is also close by and my tip would be to buy an international phone calling card (S$10) there to use back in the room. I’d certainly go back to the Bayview - it's a perfectly adequate hotel for short stays.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“You pay for what you get - not bad - but they should call a plumber”", "Author": "BusinessTravelsAsia", "ReviewID": "UR85230061", "Content": "The room was very large in size but basic in its contents, the wardrobe needed a paint job and there was no clock of any kind in the room. the bathroom was OK - but kind of lacked a \"clean\" feel. Plus I should have called about the draingage in the sink , the plug was stuck in a closed position with a minute gap to let the water through - when i took it out - let's just say it was not a pleasant smell...- although by the look of the drain in the bathtub - i think that the hotel has a bigger plumbing probelm than just one room. Internet was free and VERY fast - so for those on business this is a plus ! Breakfast is just OK - i would suggest coffee, cereal and a piece of toast - i was not attracted to the mini sausages floating in oil or the bacon (or so they called it). My room faced onto bencoolen street - and it was quite noisy with the buses going past . At the end of the day if you are looking for a place to sleep - not too expensive and in a good location - then bayview it could be.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Very comfortable hotel”", "Author": "kathmd", "ReviewID": "UR83901362", "Content": "The Bayview Hotel is in a great location. The hotel is very neat and clean. My husband and I changed rooms as the bed was not a true Queen or King but a double size bed, we are very tall people so we opted to swap to king singles which we did not mind. My sister and husband had a family room which was a king size bed and a roll-a-way. The room was basic but comfortable and clean and enough room. The bathroom was very clean and modern in design. Staff were very friendly and couldnt do enough for you. Breakfast was very good and enough choices. If you have a flight after check out time, reception will tag your bag and look after it and also give you a towel and let you use the hot shower/bathroom facilities near the pool. There are good eating places all around, close to shopping, and always a taxi outside. Very Good value as Singapore is very expensive. No complaints.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Clean & Attentive Service”", "Author": "Yap88", "ReviewID": "UR81195861", "Content": "Compared to the other 2 Bayview Hotels in Penang, Bayview Singapore is best in cleaniness and their Service staff were most helpful; always walk the extra mile to help in providing pre-arrival advice, directions and information on public transport matters. Matching this hotel to others of similar price range that I stayed before, they beat others in cleaniness & guest service. Hotel centrally located with easy access to Mass Rail Transport lines. In the locality of great food outlets and restuarants.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane, AUST", "Title": "“Wouldn't stay here again”", "Author": "MissBrisbane", "ReviewID": "UR80105163", "Content": "On the plus side, the pool area is a nice place to hang out and there is a 24hr 7/11 and a food court right beside the hotel, also the housekeeping lady was really lovely. Downside, We had a room right at the lift and the noise was horrendous! Some nights I couldn't get to sleep till 2 or 3am. The pillows were lumpy and we've gave breakfast a miss most days as it was fairly poor, but ook if you're just looking for some coffee and toast. The rooms were very basic and the walls needed to be scrubbed down. Overall I wouldn't stay here again.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great location but could do with renovation.”", "Author": "mm_travel8", "ReviewID": "UR77885274", "Content": "Had a fairly good stay at Bayview. The location is fantastic, walking distance to Albert Sq, Sim Lim and Dhoby Ghaut with buses out the front too. For those who want to walk, Orchard Rd is only abt 15mins walk away. However, the hotel does look a bit tired and old now. The fitness centre is not great and the hotel in general can do with some renovation. However, if you're not in the hotel much and want a convenient location, Bayview is a great spot for it.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangkok", "Title": "“Decent accommodation”", "Author": "shantichop", "ReviewID": "UR77018180", "Content": "Decent and affordable accommodation, reasonable walking distance to orchard road or marina square.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Basic hotel, but great location”", "Author": "edace", "ReviewID": "UR76268946", "Content": "My partner and I stayed at the City Bayview Hotel for four nights. I booked a room with a queen size bed, however, on our first night at the hotel we were checked into a room with two singles beds! The hotel staff explained that the only room available with a queen size bed was on a smoking level (we are both non smokers, so this did not appeal to us) and we would have to wait for another guest check out until we could have a room with a queen size bed! As you can imgaine, I was quite annoyed and disappointed by this, being that we requested and paid for a room with a queen size bed. Anyway, the following day, a guest obvioulsy checked out and we changed rooms that had a queen sized bed! The room was comfortable and clean, but basic. The breakfast was also very simple - nothing to rave about. The buffet breakfast comprised of a selection of scrambled eggs and fried eggs with baked beans and chicken sausage, noodle soup, or ceral (coco pops or corn flakes). Although we were disappointed with the hotel, the location was fanastic. We were within walking distance to many attractions.", "Date": "August 22, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "NZ", "Title": "“Very Expensive for what it was”", "Author": "kiwi024", "ReviewID": "UR67646847", "Content": "Stayed for 2 nights and got the room right by the lift which never stopped and was very loud. If we were staying any longer would have asked to be shifted. Rooms ok nothing fancy, Breakfast the same ok nothing brilliant. Location ok and can walk to Bugis and Orchard Road but my preference is around Chinatown and the Quays. Would not stay there again as I dont think it was value for the money we paid", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kemnay", "Title": "“Great location - nice enough hotel”", "Author": "mags56", "ReviewID": "UR67264376", "Content": "I am actually typing this from my room at the Bayview so the poster who said there was no internet access is mistaken. I agree with the postings here - location is fantastic. Staff are friendly but my safe hassn't worked since I've been here - maintenace seems to be an issue. Room very clean - TV basic channels and a bad picture. I'm at the back on the 11th Floor. Noise from, I think air con on the roof of neighbouring hotel but not excessive. Breakfast varied but nothing to write home about. Roof top pool isn't as great as it sounds. On the whole hotel not luxurious but a great central base.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunshine Coast", "Title": "“Very comfortable hotel”", "Author": "SunshineCoastJag", "ReviewID": "UR67172769", "Content": "We spent 7 nights in a large comfortable, well equiped room. Room was fully serviced every day. Location cannot be beaten. Breakfast was great - lots to choose from. Pool was lovely, clean and inviting. Also gym and sauna near the pool. Staff very friendly and allowed us to spend the day (after the midday checkout) at the hotel and use the pool etc and have a shower before we left for the airport that night. Staff also gave lots of advice about transport etc. and spoke good english. Concierge and porter were excellent also. Only 1 very minor problem was that the wardrobe door hinge was bent and the door did not shut easily. Housekeeping staff should report it. Would definitely stay here again.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fairly close to Orchard Rd, older type hotel, clean but needs update”", "Author": "vippygeo", "ReviewID": "UR66911908", "Content": "Stayed for one overnight. Standard room large enough, has the necessities, wall paper peeling off walls, bar fridge poorly stocked. Needs some renovation. I found it expensive compared to European hotels. No internet facility. Breakfast buffet quite good. Staff friendly and helpful. I did not compare price with other Singapore hotels and if comparable, I would stay there again for a short overnight stay.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect for travellers”", "Author": "rachel1978", "ReviewID": "UR63291119", "Content": "This hotel is not memorable but don't take that the wrong way. It is clean, functional, food is acceptable, staff were plesant and best of all it's within walking distance of most places. Singapore accomodation is expensive and this is reasonably priced for what you get (I think). We didn't eat dinner here but there are so many great places to eat near by, why bother, breakfast was fine and food was a mix of asian and western. I'd recommend this to people who don't want a beautiful room to lounge about in, it;s fine but it's not luxurious, also we took the room upgrade to a superior I think, I wouldn't bother, the rooms are a small amount larger and higher up the building, but the size difference is minimal and there is no view really worth talking about. The pool is small but quite nice, the gym is not a gym but a running machine (it's seen better days) and a bike which didn't work. All in all it was pretty good and did us fine for 5 days but we are quite active people and were not in the rooms too much. Staff were friendly and efficient. A good hotel for travellers who dont' want to rough it too much!", "Date": "May 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Darwin", "Title": "“Decent hotel in a very central location”", "Author": "onedaylikethis", "ReviewID": "UR62532642", "Content": "I just returned from a 3 night stay here with friends/work colleagues on a shopping trip. I was pleasantly surprised by the hotel, as it's been many years since I stayed in Singapore and things have improved in the mid-range hotel market! The room was very clean and tidy, the bathroom was a much higher quality than expected with a large shower and great water pressure. My only criticism is that the room at times smelled quite strongly of cigarette smoke, which seemed to be coming through the air-conditioning vents. Breakfast was included, I was impressed by the variety of asian and western foods. The staff were very friendly and helpful, and the location couldn't really have been better. The pool was small, but very clean and the one afternoon that we spent up there we had the place to ourselves for most of the time. The 7-11 downstairs is very convenient, and most of our meals were eaten at the foodcourt a few doors down which has a fantastic array of local food at very cheap prices, $3 to $4 SGD for a meal and $5 SGD for a large tiger beer. There is also a lovely coffee shop along Bencoolen Rd adjoining the end of the Art School which makes close to the best Cappuccino I've ever had. I would stay here again, but next time would shop around for a better rate, I don't think the hotel is worth what we ended up paying through asiarooms, also with them the advertised rate doesn't include GST or Service charge, so we were slugged an extra 17% on top of the room rates at check-out.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bunbury Australia", "Title": "“great value for money & well located - 3 star in Singapore is 4 star in Australia”", "Author": "VespaGirl65", "ReviewID": "UR62365312", "Content": "I found this hotel on the net and after reading the positive Trip Advisor comments, booked our 6 night stay via email. All communication with them was prompt and they delivered on their promises. I requested, and got , two interconnecting delux rooms for oursleves and our two teenage boys. Our room had a king size bed, adequate storage space, a mini bar, fridge and tea and coffee making facilities and a bath. The twin bed room was the same but the bathroom was a little smaller witht a shower and no bath. We overestimated how little time it would take us to get through customs and into the city via taxi ($22SD inc. luggage), so after travelling overnight on Jetstar (not recommended) and getting in at 5am, we ended up in the hotel at 6am. The room was not ready naturally, but we were offered shower facilities, luggage storage and directions on where we could breakfast next door, while we slept by the pool and rested for a few hours. The rooms had good quality linen and definitiely no bedbugs! The staff were always courteous. Breakfast was fine - the usual western line including a toaster machine (wholemeal, white bread), watermelon and pineapple pieces, 4 juices, scrambled eggs, fried eggs (that were more poached than nastily fried), bacon, baked beans, hash browns and pancakes. Croissants and breakfast rolls were also available. They also cater for the traditional Japanense, Chinese and Malay breakfast as well. There is a 7/11 next door and a wondeful up-market (yet incredibly inexpensive) food hall where all the locals eat adjacent to the 7/11 called Kofitam. Deli france and a coffee shop are nearby too. Unfortunately for us, the new yellow. circle line MRT openned two days after we left as it was just around the corner 200m from our hotel. The only 2 criticisms we had were that the swimming pool on the roof closes at 7:30pm and that the bed was a bit hard but we both slept well regardless. I was surprised at the quality of this hotel as it was listed as a 3 star in the travel brochures but the same style of hotel in Australia would be 4 star.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tasmania", "Title": "“Better spend an extra $30 and get decent hotel”", "Author": "Tassie74", "ReviewID": "UR61397409", "Content": "Stayed here last week and was very disappointed with the hotel. Location was excellent being near Orchard Street but that's the only positive thing i can say. The room was disgusting and smelt. It was dirty, especially the carpet. This was not a cheap hotel by any standard but I would have gladly paid an extra $30+ a night to get into something else. Breakfast was average and the facilities were also very average. Will not stay here again to save a few bucks.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“Great Location close to Public Transport, Nice rooms, Clean!”", "Author": "TeachingCouple", "ReviewID": "UR59471020", "Content": "The Good: + Decent-sized rooms, which is why we chose it. We traveled with our baby, who needed some room to run around in a room, as well as have room for a crib. + Clean bathroom, good shower head and water pressure. + Extra pillows in closet. + Lock-box in closet. + FREE Internet access (via LAN cord you can get at front desk) in the rooms. + Mini fridge in room + a/c worked perfectly + black-out curtains helped us sleep late! + TV with cable (only a few channels, though) + Very comfy low-seated lounge chair. The back folded down and you could use it with the ottoman to sleep on. + Great service at the front desk + The included breakfast buffet was VERY nice. Everything from toast to scrambled eggs, to sausages, rice, noodles, fruit, coffee, juice, cereal, etc. + Good location. It was about 3-4 blocks to Bugus Station area, which had lots of shopping, great restaurants, MRT, etc. + We got a late check-out and our luggage was stored by the doorman while we went out and did shopping. (We had a late afternoon flight out of Singapore). This was a GREAT service and much appreciated! The Not-So-Good: + The bed was really hard! I ended up sleeping on the lounge chair, as I have back problems and literally could not sleep in the bed! + Located on a 1-way street, so be aware when taking a taxi and you have to circle around. ++++++++++++++++++++++++++ We would certainly return here! While it was more expensive than we usually pay for a hotel (close to $100USD/night), it was worth it for us. My husband was in Singapore for surgery and I knew we would not want to dance around with questionable hotels, or spend our 5 days in a cubicle-sized room with our 18-month-old daughter. We definitely made the right choice with this hotel.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mandaluyong, Philippines", "Title": "“This hotel has a wonderful location and great staff service”", "Author": "jovanpuyo", "ReviewID": "UR58348526", "Content": "We took the red-eye budget airline flight from Manila to Singapore and arrived to City Bayview Hotel at around 1:00 a.m. The person at the desk was very warm to us despite the late check in. When we told him that we're leaving Sunday night on another red-eye flight, he even offered us a place where we could freshen up before leaving Singapore. Sweet. Room We booked the superior room for US$125 a night all-in. I was expecting this to be small but we were surprised to see that it was almost as big as a standard room at the Holiday Inn. There was a 21\" flat screen TV and free wired internet (wireless is only available in the lobby and the restaurant). The bathroom was OK with a tub plus the usual towels and toiletries. The bed was comfortable and my wife and I both had two pillows each. On the downside, the aircon started dripping on day two. We can hear it dripping on the carpet throughout the night. The room smelled like wet carpet by nighttime. It's not a deal breaker for us, but it was a minor inconvenience. Location The location was excellent. It was near every where you want to go and yet the neighborhood isn't as chaotic as a hotel in Orchard Road. Getting around is easy. The Douby Ghaut MRT station is just a 7 to 10-minute walk and there's a taxi stand at the entrance of the hotel. If you're looking for food, there's a 7-eleven convenience store right next door and a Kopi Tiam (coffee shop) at the corner. For Catholics, the Church of the Good Shepherd is just a couple of blocks away on Bras Basah Road. For those who worship gadgets, Sim Lim is about six blocks away. For art and culture needs, the Singapore National Museum is just a stone's throw away. In a nutshell, the hotel's location is just excellent. Staff The warm guy who met us when we checked in was quite refreshing. Check in was fast. As I said, he even offered us an area to freshen up before our red-eye flight on Sunday if we were in the hotel before 7:00 p.m. Other members of the staff were quite courteous with us. They even lent us a weighing scale to make sure that our luggage didn't exceed the maximum weight.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great Central Location”", "Author": "Bavroadtrip", "ReviewID": "UR58202368", "Content": "Stayed 3 nights at the Bayview on a stopover in Singapore on our way over to Vietnam. Had never been to Singapore so was looking for a good central location, and the Bayview delivered. It seemed to be fairly good value in comparison to other hotels in the area, but a notch or two up from the cheaper Fragrance style hotels. Breakfast was a decent combination of eastern and western styles, but I couldn't bring myself to have beef bacon this time around.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Islamabad", "Title": "“Nice place Ideal location”", "Author": "Nilli", "ReviewID": "UR57940654", "Content": "The location is perfect just near Dhouby ghaut station.Rooms are nice and breakfast very good.over all Good and reasonable place to stay in Singapore .", "Date": "March 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna", "Title": "“good value for money”", "Author": "bettyRTW", "ReviewID": "UR56756416", "Content": "Nice hotel with comfortable rooms, good value for a week; I especially liked the small swimming pool on the roof (though not much shade), the self-service laundry on the roof and the free wi-fi in the lobby and restaurant (the room had only free wired internet). the evening buffet is not really suitable for vegetarians, and for breakfast there is limited vegetarian choice, but it was sufficient for me. the location is centric, about a 10 minutes walk to the MRT and some shopping malls. a disappointment was that when I arrived early morning my deluxe room was not ready yet, and when I returned from a walk the room I was allocated to was next to the elevator. the night after I changed to the room next doors but this was a bad idea as the walls are thin and you can hear your neighbours; by hindsight I had prefered the first room. overall, street noise was low as I faced the wall of the house next door. I'd come again.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“NICE HOTEL - GOOD LOCATION”", "Author": "Navy35", "ReviewID": "UR55139197", "Content": "The Bayview is located about 10 minutes walk from the start of the main shopping strip on Orchard Rd. Due to the heat and humidity, I would not want to be any further away. If walking is a problem, you do have Dhoby Ghaut MRT close by and there are plenty of taxis also.........and Singapore taxis are relatively cheap. The hotel has 15 floors, and the rooms were neat, clean and quite spacious. They contained a bath and shower, coffee/tea facilities, mini bar, and toiletries. The tariff included breakfast, which is a smorgasboard of hot and cold selections. It is not a huge selection, but nevertheless, there is a good choice. On the top level, there is an outside pool and small gym.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“great location,very clean, great”", "Author": "MonkeyAlex", "ReviewID": "UR54971434", "Content": "Stayed here for 2 nights in Janary,2010 thru an offer with my friends Great location - around the corner from the center Smallish room but then we were only there to sleep and were generally exhausted after touring about all day. Room very clean , comfy bed. Great full breakfast that allowd us to have light lunches. Very easy check in and out. Would definitely stay there again.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location for a quick Singapore stopover”", "Author": "OzKayKay", "ReviewID": "UR53651244", "Content": "The location is great, given we only had one day to shop and meet a business associate (5 minute taxi ride to Suntec City and Raffles CIty). Room was what you would expect from a 3-4 star hotel. The price was on the high side, but then again Singapore is getting expensive. Breakfast was buffet, had a nice selection. All in all good for what it was, given other hotels were $A200+, this hotel was well within our price range, in the right location, and the room was clean.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "london UK", "Title": "“Comfortable and relaxing experience”", "Author": "galesan", "ReviewID": "UR50638057", "Content": "The hotel is what I expected for and I am very thankful with Octopus travel and tripadvisor for this and believe me you're not going to be disappointed.The room itself is clean,nice and soft to look at which is very important to me and it's big enough for the 3 three of us. My parents love's the buffet breakfast , as they always wants to have full breakfast with rice to start with the day. But food is not a problem here in Bencoolen,the area is surrounded with different types of restaurants. I strongly recommend this one for family to travel. My advise to everyone need to book it in advance for I tried to book for 1 night after coming back from Kuala lumpur but the hotel was fully booked though the receptionist were very helpfull and suggested 3 nearby hotel which i want to make a review as well. A bit expensive but it made our stay more relaxing and comfortable especially the size of the room.", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“ideal for our prioroties”", "Author": "scallywag22", "ReviewID": "UR47040993", "Content": "If,as other reports have implied, a budget hotel means no fountains in the hall, no concierge to book expensive concert tickets or doormen to save guests the bother of opening the front door themselves, then, yes, the Bayview is a budget hotel. We have just returned after 9 nights there. Our priorities were central location comfortable beds a pool free internet access All of these were met in the Bayview. We took the package which included a room upgrade [spacious with interesting view], free breakfasts and one free dinner. While not fussy eaters, we found the breakfast lacking in imagination but more importantly, lukewarm at best. This also applied to the evening dinner so we did not take dinner again, as we like our food hot. Northwards to Orchard Rd; Southwards down Raffles Boulevard towards the sea; Eastward to SE Asia and on to Little India and West across Fort Canning Park to Clarke Quay and Chinatown, the central location is perfect. As indicated before, there are only four sunbeds at the pool along with some tables and chairs, but there were never many people there and we were there once every day. To keep in contact with family, the free interenet access in the room was ideal and the king sized bed was wonderfully comfortable.. The reception staff were extremely helpful and pleasant and happy to give advice and information about the area. Steve, the manager,showed real concern that we were happy with everything. Apart from the food [and considering it was included at a price that was no more the similar hotels without breakfast] we could not fault the Bayview at all. We would stay there again without question", "Date": "October 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“A good choice for visiting Singapore”", "Author": "DiegoSydney", "ReviewID": "UR37228691", "Content": "We came to Singapore as a mix of business and leisure. The hotel was very conveniently located at walking distance to Suntec City and relatively close to the metro station. Apparently a new metro line is being built and a new metro station (not yet operating) is just a few metres away. The rooms were clean and air-conditioned though the bathroom was a bit tired. The swimming pool on the roof (and tiny sports centre) was a welcomed relief from the heat of the streets. We loved having free internet, and the breakfast had a surprising variety of western and Asian food. The staff was very friendly and efficient and they very happily changed our room when we requested to change it because it was too close to the lift.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "malaysia", "Title": "“A good budget hotel in a strategic location in downtown Singapore”", "Author": "The_Rottweiler", "ReviewID": "UR37132584", "Content": "This was my 3rd stay at the Bay View in 2009 and the rooms are not only clean but newly renovated. Only complaint was whenever the aircond was off in the room and we came back, the was a strong ciggarette stench I suspect from the blower so someone probably smoked in one of the non smoking rooms. Otherwise staff are very pleasant and helpful. Room rates are reasonable and Orchard road is a short 10-15 minute walk to the MRT station at Dhoby Ghaunt. Lots of food outlets beside the hotel so you have a lot of choices when it comes to local dishes at reasonable prices other than hotel food. No problems with Taxi's as they are available 24/7 on the street. A strategic hotel on bencoolen street and well worth the its value.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Very Good VFM”", "Author": "Samunder", "ReviewID": "UR32513487", "Content": "It is a very good budget hotel. Sittuated in prime location closer to business area. Hotel staff is very helpful and accomodating. A good value for money", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“No problems!”", "Author": "Arilh", "ReviewID": "UR32474578", "Content": "The reviews for the Bayview make interesting reading. The vast majority are complimentary but interspersed are some that suggest the hotel is not up to standard. I fall firmly into the first category; I didn't expect the Shangri-La for the price I paid and the hotel exceeded my expectation on most counts. It's central and convenient for both the shopping malls and the tourist areas; there's a taxi-rank outside the front door (good for the airport) and a hawker bar within 50 yards for excellent value food. The staff were courteous and helpful; the room was clean and comfortable. Breakfast menu was varied and perfectly acceptable. It was a good choice and I'd certainly return.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Italia", "Title": "“A good hotel with friendly staff”", "Author": "Oxys", "ReviewID": "UR29757029", "Content": "Good location. Kind and efficient reception. Free Internet in the room. The food is ok. The swimming pool on the roof very good. I paid 155 SGD per night, which is a good value for money. I checked out at 10am, leaving the luggage there and went for a city tour. When I came back at 4pm they told me I could relax at the swimming pool while waiting to go to the airport (my taxi was at 8pm!), and offered me a couple of towels. This was very appreciable!", "Date": "May 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Average three star hotel”", "Author": "Roamingx", "ReviewID": "UR28992116", "Content": "Better options in Singapore unless it's high season. This place is a firm three stars, with cheapish and not very tasteful furnishings. Bit dodgy. Staff not very friendly or helpful. I stayed here because having stayed at most hotels in Singapore over the years I thought have been missing something special but I was wrong. One night and I would not stay here again.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“would stay again...”", "Author": "whatcouldtopthis", "ReviewID": "UR28685023", "Content": "I arrived at the City Bayview at 4.30am (had previously notified them of my late arrival), the reception speedily checked me in so I could get to sleep as soon as poss. Location was great for me, just easy walks to Orchard Road shops, cinemas, Raffles etc and free wifi in the lobby.", "Date": "April 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ulverston, United Kingdom", "Title": "“Couldn't have wished for a better hotel...”", "Author": "Lotty79", "ReviewID": "UR28431281", "Content": "I stayed at the City Bay View with my 16 year old nephew for 5 days on our way to Australia. The hotel was in a good safe location for us to wander around and explore Singapore from (even at night), some tourist attractions were so close we reached them on foot and it wasn't too far to walk to the nearest SMRT station to explore further afield (Chinatown and Little India etc...) There was also a number of good shopping centres near by, which are always handy for food too. The hotel itself was very clean and the staff were very friendly, I'd stay here agian without a doubt. (If you wanted to be picky the roof top pool is a bit small, but honestly it really is a good hotel.)", "Date": "April 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Choosing a hotel in Singapore is never easy”", "Author": "NLR", "ReviewID": "UR28062681", "Content": "We were staying over in Singapore for 3 nights between NZ & Thailand/UK, just as we had between India and Australia three months earlier. On the way out we stayed in the Landmark (for much the same place as the Bayview) which is near the 'Arab quarter'. Though the room was a good standard hotel room and though it was close to the underground it really didn't have much to offer. We considered 4 hotels this time around the same price, in the end going for the Bayview even though it was the only 3* of the 4 (others were 4*) because of its location on Bencoolen Street near Orchard Rd. Internet booking agencies were considered, but the hotel was offering a good internet deal - which involved upgrade to a better room, free breakfasts and one free dinner for about the same as internet booking agencies. And there was free hi-speed internet Was it worth it? Well it was in a very good position with a small but pleasant food centre next door. The room at first seemed 3* depressing but actually it was pleasant in the daylight and clearly the bathroom fixtures had been modernised. The breakfasts were a little limited but then they were free, and they did have some pleasant Chinese food alongside greasy western. And given other hotels for the same money didn't include this - it was good. The free evening meal was a joke - there was nobody in the restaurant (This is Singapore, food capital of the world!!) - and the food on the buffet was very sad, suicidal even. But the internet was good. So overall it wasn't a bad choice - not perfect but for what we wanted ok. But Singapore hotels are bloody expensive; nearly as bad as my homeland, the UK", "Date": "April 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“Decent value, but it's a budget hotel to be sure”", "Author": "jaizee", "ReviewID": "UR28061933", "Content": "Singapore seems to be a pretty expensive city for hotels. We booked this place for around $90 USD, which is a good price for Singapore, except this place was really not high end. Breakfasts were the worst I had in all of SE Asia. The first room we were put in had a bunch of tiny little bugs in the bathroom. When we complained the hotel switched us to another room but acted like it was much ado about nothing. I would compare the room to an Ibis-style, bare-bones room, but on the slightly older side. The only positive aspect was that the location was good - a 5 minute walk to the nearest train station, and easy walking distance to the central stuff.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "singapore", "Title": "“comfort in good value”", "Author": "zen012", "ReviewID": "UR27476304", "Content": "stay here for a weekend getaway. overall i love the hotel. the front desk was fast and friendly. the room is nice and cozy, complete amenities. but i suggest you bring your own toiletries if you're staying more than a night. or just buy from the 24hr convenience store next to the hotel. the aircond control is a bit tricky though. the food is delicious. i had my dinner for free since it was included in a package. the staff is helpful and friendly. but what i love the most is the location. its not too near the busy life in singapore, yet just minutes walk from them. its not a 5 star hotel, but worth its value.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Valparaiso, Chile", "Title": "“Excellent hotel”", "Author": "Celeblung", "ReviewID": "UR27122321", "Content": "Good price, nice rooms, good breakfast and excellent free internet connection. The have a small but nice swimming pool on the top. You can make your own laundry in a coin washing machine and dryer. Excellent free internet connection.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Central location, good hotel”", "Author": "tunsttravel", "ReviewID": "UR25456153", "Content": "Stayed for four nights, fantastic location for getting anywhere, MRT about 5 min walk and taxis always waiting just outside. Basic but very clean room with everything you need, as we were going to be out most of the time, this was perfect. Everything was spotlessly clean and the staff were very helpful at all times. The rooftop pool was also clean and a nice place to relax in the heat of the sun. Very similar to a Travelodge or Premier Inn in the UK, would recommend if you are there for a few days and need a base in a good central location at a very reasonable price.", "Date": "March 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Loved my stay at this hotel”", "Author": "SJA_9", "ReviewID": "UR25229819", "Content": "My travel agent booked this hotel for two days as the rooms were not available in the Summer View Hotel where I moved after two days stay. I have found this hotel comfortable, with cooperative staff and excellent facilities.", "Date": "February 27, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Loved the Bayview, Loved Singapore”", "Author": "mackie14", "ReviewID": "UR23861489", "Content": "We stayed at the Bayview Hotel from the 27th Dec 2008 - 3rd January 2009. We got an excellent price for this Hotel so did not really know what to expect - It is more than adaquate for a Sight Seeing Holiday. All of the staff were very helpful, always smiling and could not do enough for you. The Hotel was clean, and the size of the room was very good, free Air Conditioning, a fridge with soft drinks supplied (Chargable) a TV etc etc, everything you would expect - The ONLY problem we encountered was that our room was right opposite the lift and it 'dings' everytime it arrives at the floor - It was very annoying but to be honest we got used to it. I was pleasently surprised with the breakfast buffet, alot of other reviews said it was samey but what do you expect for breakfast, there was Asian cuisine to Ceral and Egg and Bacon, fruit etc - I just had a few different variances every day and it made a good start to the day. The Hotel Location, we thought was fantastic - OK, it is about 5/10 min walk away from an MRT stop, but we actually found we walked to places anyway, nothing is really too far. Orchid Road is just round the corner from the hotel and in the opposite direction you have Raffles Hotel and the Chijmes Centre - About a ten min walk.. The hotel also does have a taxi rank right outside which incidentally were very cheap to go any where. The swimming pool on the roof is 'cute' and very nice, had a nice morning up there in 30 degree heat and sunshine in December !!! :o) Next to the Hotel is a 7/11 store which had most essentials but as you will start to realise Singapore is not cheap in the centre apart from their own cusine. Next to the 7/11 is a Hawker Centre (Food outlet) we thought this was fantastic, 2/3 course meals for around £3.00. If you like trying new dishes then do try the hawker centre's around the city, by far the best way to experience the food - Do not be put off by how food places look in Sngapore, they pride themselves on how food tastes and not the ambience - Hygeine laws (so we have heard) are very very stricked in Singapore. Try the Satays in China Town the were fantstic !!!! Western food is singapore we found expensive, but then the exchange rate was terrible when we went, however it can be expensive but it is very very good !! I could go in to all the sights we saw etc, but discover it for yourselves - everything we done was worth seeing and doing. For our nghts out in Singapore we headed to the Chijmes, Boat Quay, Clark Quay etc all very pretty - Alcohol IS expensive in Singapore so do not be surprised, we were paying £6 - £9 a Beer depending on where you went - Please be aware there is nothing cheap about a Singapore Sling in Raffles, but it is a must - Wonderful afternoon sat in Raffles chcking Monkey Nut shells on the floor :o) Just remember do not drop litter, smoke where there are ash trays and tipping in restaraunts etc is not nessassary - it is not encouraged. All in all we had a wonderful week in Singapore from shopping to site seeing to trying lots of different foods. It is clean, tidy, you can eat your dinner off the floor down in the MRT and people are very friendly - Singapore is a must !! I will just also add - New Year .... We found very little information on New Years eve celebrations before we went, however there are several parties all over but we headed to Marina Bay about 10 - 10.30pm, we had a fab view, the atmosphere was amazing and the Count Down and fireworks were out of this world. If anyone wouldlike anymore info then please E mail me - I cold type all day Singapore and what to do etc. Enjoy x", "Date": "January 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cheshire", "Title": "“A very satisfactory stay”", "Author": "538Anne", "ReviewID": "UR22844053", "Content": "We stayed at the Bayview for 3 nights on the way to New Zealand. My Husband, 2 year old son and I shared a triple deluxe room. The room was good and clean, the beds were fine, We had a double and some sort of fold away bed for my son, we all slept well, but the beds are quite firm, so if you like a soft bed this may not be the one for you. The third bed is also suitable for children but not adults. The pool on the roof was great for all of us, not a huge pool but perfectly big enough, again it was clean and nice to use. The staff were all friendly and happy to look after our bags for us until check in time and after check out time. The breakfasts were good but not great. We found that we were close to central amenities, raffles, Orchard Road Shopping and the MRT station. The public transport was very good although taxis are also cheap in Singapore, so we used them when we wanted to. I would definitely recommend a trip to the zoo, my son loved feeding the kangaroos! Overall I would say that this is a good place to stay if it fits your budget, Comfortable and Clean,", "Date": "December 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Greenock", "Title": "“Very freindly ssafe hotel”", "Author": "jenniferalisonuk", "ReviewID": "UR22664438", "Content": "I stayed here for 3 nights on the way to australia as I had my world belongings with me and didnt quite trust the hostels. It was fairly cheap to stay in and to be honest I got what I payed for. The room was clean... it wasnt the most stunning room in the world and it didnt reflect the pictures online but again it was safe. The staff where really lovely.... they ran after me with the depsit for my safe which i had forgot to pick up on my last morning. The bed was clean, the bathroom was clean.. it just wasnt as modern as some hotels. However... its incredibly central and again I can emphasise how good the staff where. It was pretty much ideal for a few nights.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aberdeen, Scotland", "Title": "“Singapore - Nov 2008”", "Author": "ExiledinAberdeen", "ReviewID": "UR21959798", "Content": "I spent 10 days staying at the Bayview. The hotel room was very good, clean and towels a plenty. The restaurant is also to be recommended. Superbly located for all forms of public transport bus/MRT etc. Taxi's are in great supply so not a problem there and cheap. Would recommend for all types of holiday makers from stopovers to families. The pool up on the 15th floor is excellent for having a dip after undertaking a bit of retail therapy or if you have had a tiring day.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wollongong, Australia", "Title": "“Good Stopover!”", "Author": "SandraW66", "ReviewID": "UR20301647", "Content": "We stayed here just last week for 3days on our way back from Europe. After reading the reviews we both we were a little reserved on how it was to be. We got to our hotel at about 8am knowing our room would probably not ready and checked in our luggage and set off for to see the sites of Singapore, fate didnt bring us back till nearly 5pm as we found Tour East and booked a 1/2 day tour. We were pretty exhausted on our return and checked in - we were really happy with the staff - very friendly, all I can say is if you are friendly to them straight up they are likewise, and we found them polite, always smiling and happy to see us. The room was great - room 713. Quiet not noisy. although we only had a view of a wall it shielded a lot of noise and views of other skyrises we didnt miss - we went up to the pool for that. Pool was quiet and most of the time it was just us in for a dip to cool down at the end of the day as it was only 1.2mt. We had dinner the first night there in the hotel, but would advise skipping it as if you like asian there is a food hall called the Kopitain next to the 7eleven which is great value, and food is worthwhile a meal can cost from $3-7 singapore dollars. Breakfast is a buffet and is adequate, cant complain. Yes sugar cereals maybe but there is enough other variety to fill you up till after lunch if so be Orchard road, Little India, Raffles and Fort Canning Park (which takes you to Clarke Quay) are walking distance. Taxi's are cheap $5 to the city, We used the blue ones, and if you talk to them most will give you a bit of free history about the town and themselves (lol) along the way. My picks are 1/2 day tour, Singarpore Flyer, Fort Canning Park But you have to witness Raffles - Long Bar, Orchard road and maybe the zoo/night safari and generally wear your feet out walking. It cost us $14 to get a cab to the airport - a blue or yellow one which was brilliant at 4.45pm on a Sat Afternoon, go before 5 to escape the surcharge.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jakarta", "Title": "“Not Bad”", "Author": "nxf83", "ReviewID": "UR20029689", "Content": "Bayview is a good, basic choice. When I checked in, they gave me a room on the 13th floor, next to the elevator, which another review warned about specifically. The room looked fine, but smelled like urine. I went down to the reception and asked if they could do something about it. They said they could spray something, but that their housekeeping was closed for the day, so I’d have to wait until the next morning. I find it odd that nobody in the hotel has access to air freshener, but whatever. They were polite, just not very imaginative. I asked if they could give me a different room, and they complied. The new room smelled fine, but several of the electrical outlets didn’t work, and some of the lights didn’t work either, just minor annoyances. I was happy about the free internet, and the speed was good. The hotel staff was not particularly polite, but not outright rude either. I found it bizarre that they never acknowledged my presence when coming and going. There was no hello or eye contact or anything, even if nobody else was around. The food in the hotel’s restaurant is disgusting, but there are plenty of excellent and very cheap 24-hour options nearby. Just next door, there’s a Kopitiam, which is like a food court that has all different types of food. I really liked their Hainanese chicken rice, and the teh susu (strong black tea with condensed milk). On the other side of the hotel, there’s another food center with good Vietnamese and Indian food, which are not as readily available at the Kopitiam. Two blocks down on Bencoolen Street, there’s a 24-hour Indian/Arab restaurant. All of these places are open 24 hours and have great food, and there are so many options you’ll never get tired. I think the food nearby was my favorite part of staying here. Overall it’s a decent hotel at a decent price for Singapore. It’s nothing fancy, but it’s very clean and there didn’t seem to be any shady people there. Even at all hours of the night, there are normal people all around the area, and it feels very safe.", "Date": "September 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Been to better Bayviews”", "Author": "Willkeeptravelling", "ReviewID": "UR19820313", "Content": "Read the varying reviews about this hotel on different websites and took the plunge. We arrived as 2 couples, wanting 2 bedrooms and double beds and it was after 3.00 pm. Not a difficult request so I thought. No double beds available and cannot move the singles together. The reception banshee started on us, that our booking was made over the web and it is very clear that they do not have to give us double beds. I replied that is fine but that is not my choice and I am very happy to walk across the road the a very nice looking hotel and can I have a refund please. She huffed and puffed and found one double bedroom and said we could not be on the same floor. That was fine. Next had to wait for our room because of cleaning we waited 1 1/2 hours (no drink no apology) remember this was asking for a room with a double bed nothing more. Went to the reception was told we would have to wait another 4 hours. I said I don't think I am waiting any more I am leaving, suddenly a room materialised on the same floor as our family members. ????? The materialised room was lovely facing the street. The air conditioning was so cold I ended up switching it off . There is only very thin covering on the bed. Bathroom excellent good quality shampoos and towels. Breakfast: Don't bother if you eat European food as selection is extremely small. Pre made underdone eggs, toast, poor selection of highly sugared cereal. We ate toast for breakfast. The location is good was able to walk to Raffles and enjoy the walking to Bugis Street and generally walked around the city. This hotel is good if you can avoid reception staff and not eat breakfast and especially avoid the fruit juice (witnessed something). Good Luck.", "Date": "September 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading", "Title": "“Great value”", "Author": "JenReading", "ReviewID": "UR19701741", "Content": "Like many others my Mum and i stayed here on our way back from Australia. We found the hotel very comfortable and staff very friendly. The hotel is in walking distance to most places, but we did take advantage of the hop on hop bus, which we are glad we did as it was well worth the money. If you like shopping designer style then you will love Singapore. If you get the chance get the bus to Malaysia it works out to be about £1.50 return and takes about an hour on the bus. Remember to take your departure cards aqnd passport with you. Be careful when you get off the bus in Malaysia as you get approached by un official taxi drivers who will charge you 3 times as much ( i got caught out ) Go to the city shopping mall you will pick up some bargains there diesal jeans, leather bags etc and they are the real thing. Have fun!", "Date": "September 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds UK", "Title": "“Great Place”", "Author": "MissJackieChan", "ReviewID": "UR18957743", "Content": "I stayed here last week for 8 days and thought it was great. My room was very spacious, free internet, clean with a roomy contemporary and clean bathroom. Huge flat screen TV too (in the bedroom that is!) The reception staff were excellent and polite and offered suggestions of places to visit etc. Thought that the breakfast offered brilliant choice and being from 7 - 10.30 meant I could sleep in. Continental choice of croissants/breads, fresh fruit, juices etc, cooked western style, asian and others. It is also extremely central and located easily for galleries etc. I would definitely stay again. Only fault I can think of is the 'connecting door' between some rooms, which meant ocassionally I heard the odd bit of chatting from the room next door, but not enough to be a nuisance at all. Thoroughly enjoyed my stay.", "Date": "August 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "vienna", "Title": "“thin walls”", "Author": "martin_austria", "ReviewID": "UR18425989", "Content": "hotel is principally ok, but walls are much to thin. third night in a row with just limited sleep, thank god, i am leaving tomorrow. finding sleep on a plane seems to be easier!", "Date": "July 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gillingham, United Kingdom", "Title": "“Bad start - got much better!!”", "Author": "AdrianGFC", "ReviewID": "UR18222725", "Content": "Bad start - rolled up at 4pm on Valentines Day with our advnaced internet booking from about 5 months ago, at the beginning of a 6 week trip to New Zealand - only to be told that there were no Double Rooms left for us on Valentines night - only twins!! We politely told them that after a long flight from London he could poke it. Thankfully they came up trumps after lots of tapping into their computer - and gave us a free upgrade to a Junior Suite! Now this was fantastic, a proper suite with lounge, 2 toilets, king size bed, 2 flat screen tv's, nice a/c lovely shower. Only minor thing was sink in one bathroom was blocked & took forever to drain off. Location - within walking distance of everything, 10 - 15 mins to Clarke Quay, 10 mins to Rafflles. Plnety of stuff around the hotel & 7/11 next door! Cannot comment on food - never ate there.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Leith, Edinburgh", "Title": "“no complaints – clean, basic hotel”", "Author": "didileavetheovenon", "ReviewID": "UR17167726", "Content": "My partner and I stayed at the Bayview for 3 nights on our way to Melbourne in February. We had a limited budget and for the money this hotel was fine for us with the added bonus of free wi-fi access (something we have found hard to get at hotels in Australia). It was clean, comfortable, quiet and within easy walking distance to the MRT (Dhoby Ghaut is marginally closer than Bugis). The bathroom was a little shabby but clean and spacious. There was a large selection of breakfasts to suit European or Asian tastes and the hotel is not far from plenty of cafes bars and restaurants. The staff were pleasant and helpful. We didn't make use of the tiny swimming pool or laundry facilities on the top floor but it was nice to know they were there had we needed them. Overall a pleasant stay and we are considering booking there again on our way back through Singapore in July.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Not a bad hotel for the money”", "Author": "foz72", "ReviewID": "UR17039842", "Content": "Firstly the good points: The room was big and clean. The location was excellent, easy walkung distance to the nearest MRT which I believe was Dhoby Ghost. The staff were very helpful and were able to give good restaurant reccomendations We stated here twice (first for three days and then 1 day after a trip to KL) and one of the days we had a room with an interconnecting door, this made the noise from the next room quite audible. I would reccomend the hotel as it is cheap for Singapore and well located.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Good and yet disappointing”", "Author": "Scully15", "ReviewID": "UR16949646", "Content": "My partner and I booked the City Bayview after discovering that our previous hotel (which was opposite the CB) that we stayed in wanted almost twice the price we had paid in 2006. Feeling slightly trepiditious after reading hundreds of varying reviews online, we decided that we would give it a shot anyway. After all, the majority of the time when we were last in Singapoare, the hotel was used for sleeping in and swimming! We arrived at the C.B. around 1500 hours. Check in was swift and the concierge very helpful with the luggage. We were checked into room 607. If anyone reading this has stayed or is planning to stay in C.B., please ask to be away from rooms that have 07/08 at the end or else you will find yourself opposite the lifts. Good points about the Hotel: Pool was hardly used - a good thing because it is rather small and I like to do laps. If it had been busy, all I could have managed was a small dip. Corridors were clean and lobby was spacious. Location is a huge positive. Bugis Street one way and Orchard Road the other. Dhoby Ghaut was perhaps 5 minutes walk if that. Negative: No safety warnings at the pool. On my first swim, I slipped badly coming out of the shower as the slope slightly. They aren't designed for safety either - no grip-safe tiles at all. Just normal tiles you might find on a kitchen floor. After suggesting that the staff put a warning up, nothing was done by the end of our 10 night stay. Breakfast. Oh, dear Light, what can I say about this? Buffet style which is okay, but very very limited selection. Three types of fruit juice. Apple, orange and pineapple. The orange tasted like strong diluting juice and I couldn't even bring myself to taste the other two. I ended up savouring a few extra hours in bed and then eating at the Kopitiam thirty yards away. Laundry and ironing facilities were disappointing. There were no instructions on how to work the iron. You had to assume that the timer switch that was meant for the light was actually for the iron. It was six dollars (Sing) apiece to use the washer and dryer and yet only three minutes away was a laundretted that charged 10 Sing dollars for collection, laundering and delivery - all on the same day! Good points about the room: Very spacious Huuuuuuuuuuuge bed - well above king/queen size. Air-conditioned and the window opened ever so slightly. Curtains were amazing at keeping the light out. I woke at 1000 hours one morning and thought that it was still the middle of the night. Bathroom was spacious enough. Negative Aspects Walls were PAPER THIN! I was woken at 0600 by some German man's nokia ringing over and over and then the hotel phone calling to wake him. I ended up shouting through 'Answer your bl**dy phone!' We were given an inter-connecting room - obviously one meant for families. On our second night within the hotel, two girls decided that they were going to play 'knock door runaway'. Feeling decidedly angry at having my night disturbed, I knocked on their door and asked them in no uncertain terms to stop knocking. I then spoke to the front desk and they sent three people to our room to investigate. We were informed that our inter-connecting door could not be opened by the adjoining guests as long as ours was 'latched' into place. There was no lock on it and the fact that there was only a knob on one side (the side into each room) was supposed to assuaged my fear of someone sneaking into the room and perhaps raiding our items. Luckily, the girls appeared to only be stopping over for a couple of nights - of which I am glad - their incessant chatter and giggling had me at my wits' end and I am someone that enjoys a laugh far more than the average person. THE CLEANERS HAVE TO CHECK UNDER THE BED! It's all fine having a newly re-furbished hotel, but the bath was so old that it was stained yellow. Before I took a bath myself, I scrubbed it to ensure that it wasn't nicotine or dead skin stuck to the sides. The TV was so-so. Only two English channels - BBC World News (which repeated every 20 mins or so) and HBO, which due to injuries, my partner and I spent a lot of time watching. The lighting could have been more adequately placed and a lot brighter. After three days in the room, the lightbulbs were replaced by dimmer ones and so we had to have every single light on to feel comfortable to read! I would recommend this hotel for people that have a smallish budget and anyone that is looking for a 'stopover' room between travelling destinations.", "Date": "June 15, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "hampshire", "Title": "“Great value”", "Author": "pompey1001", "ReviewID": "UR16397615", "Content": "Dont hesitate to book the Bayview hotel in Singapore, it was a lovely hotel and the breakfast is fine. Rooms clean and comfortable. Reception staff are very helpful The roof top pool is lovely and they have washing facilities next to it. Best place I have every done any laundry. We are going to stop off at Singapore next year and I will book this hotel up again. Taxi and transport are so cheap that yo can get to any attraction. Like all places in Singapore the wine is very expensive. I would take your own at the duty free and remember to take a bottle opener if you are a wine lover. We had the Asian buffet at the hotel prior to leaving in the evening, and it was not very hot. In fact the restaurant was empty , maybe this should have told us something. Breakfast is fine though and there are loads of other eating places locally. We booked the room for an extra night prior to departure, as we had a 11pm flight and we wanted to shower etc. However you can take a shower at the hotel, or you can book a room for $90 up until 6.00pm.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Asia", "Title": "“A Major dissapointment”", "Author": "Realtravelasia", "ReviewID": "UR15980675", "Content": "Many decent reviews of this hotel, and for a while I thought I'd gone wrong, cause the hotel I checked into was not up to standards..... Unfortunately, I found that I was at the Bayview in Bencoolen Street. The beds were uncomfortable, rooms was smelly( I tried two), walls between room are paper thin, the TV had 3 english channels, the hotel does not have a laundry service ( although they have an overpriced self service by the swimming pool), there are no facilities to speak of, and frankly, there are a lot of better choices in Singapore at similar price. On the bright side, the location is very good, and they provide free internet, and that's all the positives I can think of.", "Date": "May 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cebu, Philippines", "Title": "“Good location”", "Author": "tambalyn", "ReviewID": "UR15738708", "Content": "I purposely chose a hotel that's not too smack on Orchard Road but still convenient to get to the MTR. Bayview would be about a 10 minute walk to the nearest Dhoby Gaut station....if it's raining (which it did when i was there), it's not much of a comfortable walk. But taxis are readily available around Singapore as well. The room is a little above average. It was clean but a little bit too small. The bathroom was also clean and was okay. I didn't have much of a good view considering that i got a room thats higher than the standard one. I had a full view of walls! :) Breakfast at the hotel was so-so, not many choices although they try to change the choices everyday. But if you really don't want hotel food, you can easily go to the 24-hour kopitiam around the corner. Next to the hotel is also a 7-11 so food won't be much of a problem at night or early morning. If you wanna go electronics shopping, then SimLim centre is just a good 2-3 blocks away, okay for a leisurely stroll but not when coming back if you have loads of shopping already. I guess Singapore is really very small and it seemed everything is very near each other. I could walk about 15-20 minutes from my hotel to LIttle India or Arab district. The hotel staff was nice and helpful. They gave us suggestions for interesting dinners around Singapore and were very thoughtful to ask us how it was the following day. They were also very courteous and was always ready with a smile when you enter the lobby. Bayview is an overall good hotel to stay for Singapore. Taxi is easy to get from the hotel itself and walking around its area is pleasurable.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kansas City, MO", "Title": "“Great Value and Location”", "Author": "drkc", "ReviewID": "UR15640325", "Content": "Went to Singapore for a 3-day conference, which was at the Raffles Convention Center. Bayview Hotel was only 3 blocks away, and I saved a bundle in lodging costs vs. staying at Raffles. Easy to get around, and had a great time in the city. Staff was pleasant. Breakfast buffet every morning was good - Not one complaint.", "Date": "May 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London UK", "Title": "“Very Friendly”", "Author": "jenniehome2001", "ReviewID": "UR15534677", "Content": "We were very happy with the greeting we received and also happy with room. Any time we had to ask for anything it was dealt with effitionately. Breakfast was interesting and vast. Area was ideal for getting around. A good all round hotel on cost and location.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rösrath", "Title": "“Clean rooms & good location at a low price”", "Author": "EvertS", "ReviewID": "UR15346592", "Content": "I just had to go to Singapore for a business trip. As there was a trade fair most hotels have been either fully booked or selling rooms for exorbitant rates. Bayview offered Rooms for a reasonable rate. Our rooms have been spotless clean. Service was friendly and quick. Excellent location. Good buffet breakfast serving western and asian dishes (5 warm dishes), but not too much variety of bread. You should not expect luxury, but if you need a clean room and a hot shower this place is appropriate.", "Date": "April 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Nice little hotel - good value”", "Author": "Melnq8", "ReviewID": "UR14761661", "Content": "I visit Singapore often and have watched hotel prices increase a great deal over the past few years. I've decided to rebel against high hotel prices, and now I search long and hard for better value. And that's exactly what I found at the Bayview Hotel. I booked this hotel for an overnight stay during a 24 hour layover. I got what I felt was a great deal on a last minute booking site - US $117 for a double room and breakfast for two, inclusive of all taxes (which are steep in Singapore). Our room was compact and simple, but spotless, modern, and very comfortable. It was decorated in light woods, had a cotton duvet on the comfortable queen sized bed, flat screen TV, desk, safe and mini bar/fridge. The bathroom had a shower over the tub and the vanity was nicely decorated with red tile and black accents. Good water pressure and nice amenities too. The room looked recently refurbished. I particularly liked the soft lighting, the overlapping blackout curtains and the air conditioning, which kept us plenty cool, just the way we like it. I'd requested a room away from the elevator, so we had a quiet evening and a good sleep before our long international flight. Breakfast wasn't anything to get excited about, but hey, I didn't choose this hotel for its food. The hotel is located a five minute walk to the Dhoby Ghant MRT station. There's a Kopitiam food hall right around the corner, and we had two very good, inexpensive meals there. The staff was friendly and helpful and even lent us an umbrella for the day. We were also able to get a 2 pm checkout without paying an additional fee. I would happily return to this hotel again.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockport, United Kingdom", "Title": "“Good Central hotel”", "Author": "somsoceel", "ReviewID": "UR14688002", "Content": "Central location only 10 minutes walk from Raffles, Orchard road & MRT train station (Dhoby Ghaut). Poor view from hotel window, but room good basic standard. Shower curtain dirty. Lovely roof top pool with gym, sauna, plus washing machine. Reception staff not very knowledgeable, but friendly. Very cheap food centres on either side of the hotel for purchase of meals. 7/11 shop also nearby. Taxi is about 25 singapore dollar each way from the airport, but train is cheapest by far 1.7 singapore dollars. MRT is currently being extended so new station (Bras Basah) will only be 3 minutes from hotel. Internet is free at the airport so you are able to send email, etc.. on arrival or departure.", "Date": "March 31, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Brighton", "Title": "“Perfect Stop-over Hotel”", "Author": "SaldeanTripper", "ReviewID": "UR14662780", "Content": "This hotel was recommended to me by a colleague as a comfortable stop-over hotel. I was travelling from the UK to Australia and wanted to break my journey. It is located pretty centrally & is within (slow) walking distance from several attractions (Raffles Hotel; shopping areas etc). The staff were welcoming & efficient - they are very used to tired travellers arriving late, I think. The room was very clean and comfortable. It had a great 'wet-room' style shower which I used within minutes of arriving - so relaxing. Within a one minute walk is a great Kopitiam or food hall with a great variety of local cooking. Freshly cooked, very tasty and so inexpensive. Breakfast in the Bayview is basic but tasty and caters for most tastes. There is a very nice pool on the roof, and when I was there I had it virtually to myself. The hotel is also very well-practiced at storing luggage for guests who have to check-out but have a late flight. This was very reassuring and allowed me to see more of the City. I've been back to the Bayview again - with family this time, and the standard is high every time. It's also very well priced. I will always choose this hotel for stop-over stays.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kolkata (Calcutta), India", "Title": "“City Bayview - Great Location, Rooms & Service”", "Author": "Libran20", "ReviewID": "UR14637103", "Content": "Read all the positive reviews (negative reviews were too few) and pushed an online travel site to obtain reservations at City Bayview. Obtained a fabulous deal, inclusive of breakfast and airport pick-up and drop. My 72 yr old Mum and I arrived at the Hotel to be greeted by a smiling Haroon who picked up our bags and escorted us to the Reception. The Reception ladies smiled (they always had a smile on their faces whenever I saw them)listened to my request for a street-facing non-smoking room and in 2 minutes we were in room 905, once again escorted by Haroon. The room and beds were clean and very comfortable. The Coffee/Tea maker was a boon. The view from our room of the street below was good. We could see right upto the street crossing. The breakfast spread was good. We found some dishes empty on day 1 but after I completed the little card placed on all tables and handed it over to the General Manager, the dishes were never again empty the next 5 days of our stay! The \"Roti-Prata\" was our favourite. The elevator - which seems to be a point of complaint for many - is a Misubishi, Japan elevator with a smooth/swift speed. I asked an elderly gentleman who had a room opposite the elevator if the sound disturbed him and he said no. We bought the SGD23 Hippo Tours tickets and enjoyed 2 wonderful days of sight-seeing at our own pace hopping-on-and-off (and also did loads of shopping). A pick-up/drop-off point was just 2 minutes from the Hotel. The Cathderal, CHIJMES, Raffles, SAM and Orchard Road were all within walking distance. We really enjoyed our meals at the KOPITIAM food court (next door to the hotel!)- our favourite counter was \"Roast Duck\". The SGD18 set meal for 2 persons was our favourite. For the famous Singapore Chilli/Pepper Crab we turned to the various Hawker Centers. The highlight of our holiday was being able to board the \"Singapore Flyer\", which opened on March 1. We boarded a 7pm 'flight' which gave me some great daylight panoramic photos on the way up and stupendous evening shots on the way down. We'll definitely return to City Bayview Hotel for our next holiday.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Excellent Value”", "Author": "yorkspuds", "ReviewID": "UR14480044", "Content": "Our room was comfortable, spotlessly clean, reasonably spacious and very quiet. Big shower. Excellent AC. However, the TV did not receive the BBC channel despite the information indicating the contrary and reception staff were unable to tell us why. The small rooftop pool was a real bonus (there is also a small gym and DIY laundry facilities). The staff were friendly and, with the exception of the TV channel issue, most helpful. Breakfast offered a large variety of choices both Asian & Western, but the quality was only just adequate. For example, toasting bread took a long time using an overworked domestic toaster. The fruit juice was of poor quality as was the coffee and when the serving dishes were empty, they remained empty for some time. The hotel was good value, met our expectations & I would recommend it as economical, comfortable & well situated. Booking was done through Skoosh.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Seoul", "Title": "“Not my favorite”", "Author": "crabtreeSeoul", "ReviewID": "UR14479091", "Content": "This hotel seems to be not very popular to taxi drivers. Everytime we want to get to the hotel, we have to show the hotel map to the drivers, but they are still not sure of the location of this hotel. Nothing is near from the hotel, only what I found was seven-eleven right next to the hotel. Rooms are small not a good view, very close to the next building. Staffs are not very helpful, I asked them how to get to a restaurant, but they were chatting themselves but not cared enough. elevator is very old too. Breakfast was not so good, not various collections(as I remember, just some breads & jams..etc) Not very recommendable", "Date": "March 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Merseyside", "Title": "“Great hotel - central location”", "Author": "merseytripper", "ReviewID": "UR14424085", "Content": "Very pleased that we chose this hotel. Clean, comfortable, excellent facilities. Staff are very friendly and helpful. We booked a deal including breakfast and were not disappointed, there was an excellent choice to suit all nationalities. Hotel is 10 minutes walk from Raffles and Orchard Road, where the nearest underground station is situated. University district not far away. Excellent, cheap food court on corner just past 7-11 shop. Highly recommended. Good value for money.", "Date": "March 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Great Location, Excellent Value”", "Author": "dust56", "ReviewID": "UR14150344", "Content": "Pleasantly surprised by this 3 star hotel. Excellent location for tourists or those on a stopover in Singapore. Close to lots of attractions. Room was clean and comfortable. Linen was a bit tatty had a good laugh when on the hotel blurb it stated you could purchase towels at reception. Smoking rooms available however even as a smoker not being able to open the window was a bit disappointing. Would stay here again when we return to Singapore.", "Date": "March 8, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Sydney,", "Title": "“Badly managed”", "Author": "JewelzSydney", "ReviewID": "UR14026071", "Content": "My husband and I booked this hotel way in advance because of the location and pictures provided. Unfortunately when we got there they told us that they'd over booked and transferred us to another hotel in Chinatown (without even consulting with us first).We were VERY disapointed. Although the hotel that we were transferred to was nice, it was in an inconvenient location for our needs. For future travellers watch out for the same mistake. I couldn't believe they could actually do that to us but they did!", "Date": "March 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Ok...but...”", "Author": "iamozbok", "ReviewID": "UR13823833", "Content": "I have to say straight off, it's in an amazing location, so if you go by that it should be alot more$$. BUT... when I checked in, the lady didn't look at me once and she was chuckling to the male colleague, seemingly about me. The lift scared the [--] out of me everytime and when I got into the room, there were tiny pale ants ALL over the cupboard and in the bathroom. And the bathroom smelt like stale p*ss. I tried to clean the benchtops with toilet paper and the dispenser soap that was there. Aside from that, the room was really nice. Pity the walls are so thin. I had a family in the room next to me and the kids screamed all the time and the parents were loud and they all kept trying to open the door that adjoined our room even though though knew I was in there. TV channels very limited but the windows are massive and it's good to look outside. When I left, the lady who checked me out was much nicer but the bellboy guy just took my bag, labelled it, then left it next to his counter while he saw to a more important looking guy. I expected to not find it when I got back. Upon getting back, my bag had been well looked after, but I would've liked to have known that all day. I asked how I get a taxi, or could he call one for me as it was 5pm (ie peak time) and he told me that I could hail one outside as they go past then walked off on me. I waited for nearly an hour on the curb and when I was finally first in line, an English businessman stole my taxi as I was lugging my bag to the boot. The concierge saw me the whole time and did nothing. Luckily another English businessman saw this happen and promptly gave me the taxi he had rung for 20mins beforehand. Having the 7/11 next door was very handy, but I didn't really enjoy my experience. I am a small female who travels alone, so things can get daunting. I've travelled extensively but I have never had so many problems in one place. Oh, and there was this creepy Indian guy that would follow me around the lobby and in the lift. I often saw him sitting on the couch near the brochures watching women. No staff seemed to care.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hyderabad, India", "Title": "“Good Clean Room with Excellent Location”", "Author": "abhaagarwal", "ReviewID": "UR13704940", "Content": "We stayed from the 14th of Feb until the 16th of Feb 2008 at the City bayview hotel. I looked at many options on kayak.com and after reading all positive reviews at trip advisor decided to pick the hotel. I know the area really well as I visit Singapore quite often. Nevertheless the hotel looked exactly the way it was shown on the internet with no hanky panky business. Our check in was a 2:00 PM which was a wierd time. The guy at the reception desk said we could come in by 11 AM to check in which seemed a good proposition. When we were about to check in a lady came down (Seemed European) who was extremely annoyed with some water leakage from the ceiling and how her husband would be so annoyed with her for this! We were extremely scared to hear and this and we thought we were in for some major crappy room in such cases. But that was definitely not the case. Our room was right at the end of the corridor and near the house keeping room so in the morning we had some noisy house keeping chinese lady making all sorts of irritating noises. Finally we had to ask her to stop it and she did. I found the bathroom stinking at times maybe because the main bathroom drain was right under us (Atleast I am presuming that). The funny part was before I left for Singapore I had checked with the hotel on the breakfast that was suppose to be included with the room rate. Once we reached there the reception lady haughtily refused the breakfast saying that she never mentioned about the breakfast. Anyhow the seven eleven store right next to the hotel was a boon we had coffee and a butter croissant every morning! Good clean room with a clean bathroom was something I liked about Bayview and yes its sooooo close to the Dhoby Ghat MRT station and very close to Plaza Singapura Mall which is a boon in disguise. Overall for shopper who are looking at more like a sleep and stay place its a great place to be at!", "Date": "February 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Good Value for Singapore”", "Author": "TerryEmu", "ReviewID": "UR13663316", "Content": "We stayed for one night transit from Thailand. We have stayed in quite a few Hotels in Singapore and I would rate this one as one of the best for value. The check in staff were polite and efficient. There was a LAN Internet access in the room and WIFI in the Lobby. The location is good with a 7-11 next door and a great food hall ( Kopitiam)next to that. We left early so missed the breakfast but would stay again!", "Date": "February 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Fantastic”", "Author": "lollipop21", "ReviewID": "UR13632887", "Content": "I booked about a month early for this hotel and was very happy with the hotel itself. The staff were very helpful and room service was excellent. It was a very clean and well kept hotel. We did not use any of the facilities but the location of the hotel was excellent for the centre of town and for a night-time jaunt to the Raffles hotel for the singapore sling! Check-in was easy, and even though some had mentioned that the lifts were noisy, we were opposite them and did not hear anything. I would highly recommend this hotel and don't believe that paying more would get you better service or cleaner rooms. Enjoy!", "Date": "February 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great location”", "Author": "minicooperdownunder", "ReviewID": "UR13397009", "Content": "Bayview Hotel Singapore Had a two night stop over here on my way from Australia to Germany in October 2007. The hotel is a good choice for a short stop over, not sure the room is large enough if you were staying for a week as it is a bit on the small side and the view from my room was just a brick wall which wasn’t really an issue as I wasn’t in the room during the day and made the room feel private at night. Check in was quick and efficient and room 714 was in working order except for one light above the minibar and the shower curtain had a bit of what I am assuming was mould on it. The room had everything you need, comfortable bed, TV, fridge, but only 1 armchair plus another at the desk so if there were two of you in the room only one would get a comfortable chair. The bathroom looks like it has been recently updated and had a fresh modern look to it. Breakfast was included in my rate but was on the disappointing side and below par compared to the rest of the hotel, ok if included in the price but probably not worth paying extra for. The location is great basically at the very bottom of Orchard Road, I found it an easy enough walk up Orchard Roadto Scotts Road and down to the Marina area, Raffles Hotel and the river area. Next door to the hotel is a 7-11 which is handy for basic items and on the corner is a very popular local café that seems to be open 24/7. Nice rooftop pool with a bit of a view over the surrounding area. Also on the top floor they have a washer and dryer which I didn’t use but would assume it is for guests plus changing rooms which you can use after you check out for a shower if you have a late night flight like I did.", "Date": "February 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "italia", "Title": "“very good hotel and location”", "Author": "italyItalia", "ReviewID": "UR13058206", "Content": "I stayed 5 nights at the city bayview hotel and I found it nice, clean and in a good location. Breakfast was good and with a lot of different choices, the roon was in order and clean. Staff at the hotel is very polite and charming. Surely a good value for the price.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, England", "Title": "“Nice Hotel - Great Location”", "Author": "Economy_Class_Clive", "ReviewID": "UR12491245", "Content": "Stayed here for 4 nights on our way back to the UK from Australia in Jan 2008 and would definitely recommend it. We were given 2 adjoining rooms which was very good as our children are 11 and 12 and it was good for them to be able to get to our room without having to go out into the corridor. The rooms were clean and comfortable. The shower cubicle in the twin room was very big while ours was over the bath. The room top pool is quite small but more than adequate for a refreshing dip. There are also guest laundry facilities up there too which is useful when you've been on the road for 3 weeks as we had. You can swim while you do your laundry. The hotel location is great. There is a 7-11 food shop next door with a food mall next door to that. The nearest MRT station is a ten minute walk away. Orchard Road , Raffles, China town and Little India are all about 20 minutes stroll away. Breakfast was a buffet and was ok, with a variety of foods offering something for most tastes.", "Date": "January 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Perth Western Australia", "Title": "“Christmas Stay”", "Author": "fre0man", "ReviewID": "UR12338433", "Content": "i stayed at this hotel Dec 21 -26 2007. A friend mentioned this hotel and then i checked the positive reviews on tripadvisor and went ahead and booked it direct with the hotel website. I booked this hotel because of its central location, ie proximity to Dhoby Ghaut MRT, Orchard Road, Raffles Hotel, Funan IT Centre. although did not have time to visit the famous Raffles. Sure enough everything is walking distance. Just make sure u are prepared for walking in the heat..ie. talcum powder for chaffing and worn in shoes. I also concur that nearby 711 and \"kopitiam\" food hall are extremely convenient for sundries and midnight snacks. I initally received a room opposite an elevator which i was warned from previous reviews not to accept. I then got a much better room fronting Bencoolen St with a much better view near the fire escape and secluded from the elevator. There is a Sauna and pool on the top floor which i only had time to try once. Good if u have time. Breakfast is routine but is a good way to start the day if have to go without lunch. Overall a very practical hotel and good if u can get it when it is not peak season. Try and visit Sentosa, Night Safari (express bus), river cruise from Clarke Quay. [--]", "Date": "January 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Yorkshire", "Title": "“No problems at all”", "Author": "harvblue", "ReviewID": "UR11891214", "Content": "We had a pleasant 2 night stopover in Singapore and would have no problems at all recommending the Bayview. It was good value for money. The rooms were fine. Breakfast ok. There were plenty of eating places nearby, but we liked a place just round the corner called Kobe Tiam (or something like that). It was an oriental food court with all sorts of food, from pizza, to Indian, to Oriental food - all at very cheap prices. Give it a try!. Walk left out of the hotel, and you can't miss it. We used taxis to get around as we were only there for a short while, and they were fairly cheap.", "Date": "December 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide", "Title": "“Great location for a budget hotel”", "Author": "Reviewer14", "ReviewID": "UR11472805", "Content": "We stayed here for two nights, in May 2007. The location was within walking distance from many attractions such as orchard road and Raffles. Taxi to Sentosa chair lift was around $15. The hotel was clean, and the service was pleasant. The only complaint would be that the walls in the rooms are paper thin, (which is something I would never normally complain about) but we were next to the elevator and you could constantly here the dinging of the bell and people coming and going all night. Additionally, there was a man on the telephone in the room next door and we could hear everything that he was saying. We did not request to change rooms as we were only there for two days. Other than that, the hotel was well located, bed comfortable, and the price was right - only approx $100 aud per night. If I was to stay again, I would probably pay a little extra and stay somewhere more luxurious around the china town area near clarke quay & boat quay. A piece of advice, regarding the Night Zoo, there is a bus that runs from stops around Singapore to the Zoo at certain times for $4 each way. Much cheaper than paying for a tour, and more flexible.", "Date": "December 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Great location, value for money”", "Author": "karenbeanpole", "ReviewID": "UR11263395", "Content": "Only a 3 star hotel and the facilities are nothing to write home about (small lobby area though adequate, almost non-existent gym), but for the location, I would give it 5 star. it is walkable to Orchard Road and almost any direction will take you somewhere on foot. Otherwise, the bus routes are great there and the underground is only 5 mins walk away. For value, this is definitely the hotel to stay in. We were there for a week, no breakfast included, but there was a 24 hr hawker style coffee shop just next door as well as a 7/11 shop. The swimming pool was a good size on the roof top. Staff were very friendly and helpful. Great for budget traveller!", "Date": "December 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrington, Uk", "Title": "“Great Location”", "Author": "AliJG", "ReviewID": "UR10990817", "Content": "We're just back from a 3.5 week trip to Australia, and stopped off in Singapore enroute for 3 days. We spent a lot of time researching hotels and where to stay in Singapore and have to say that we were not disappointed in our choice of the Bayview. Our flight arrived at 7am and although check in wasn't until 2pm the hotel reception were very helpful in trying to get us checked in as soon as possible - we were in our room by 11am which was wonderful for 2 very tired travellers. The hotel is on the corner of Bencoolen / Orchard Road and an ideal location for sightseeing. The nearest MRT station is only 10mins walk - and Raffles,Chijmes only 10mins walk the other way. There is a 7-11 right next door and many coffee houses and eating places practically on the doorstep. Our room was clean and comfortable - and the shower amazing. Breakfast was a buffet of a variety of things which was a very nice start to the day. We didn't get chance to use the pool facilities due to our hectic days of sightseeing but given the excellent facilities experienced at the hotel this would be of the same calibre. We will definately stay here again - and we'll definately be going back to Singapore again as it was such a lovely place to visit.", "Date": "November 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis", "Title": "“Fantastic hotel convenient location”", "Author": "bowdenj", "ReviewID": "UR10740386", "Content": "This hotel met all our needs - its location is perfect for tourists, great breakfast buffet, Steve the manager (?) was great and provided us with tourism information and suggestions, price was also good. We paid around $US122/night for 5 nights at end of October 2007 and had a room with two beds. We were surprised that the price included breakfast every morning. The only complaint is the room we had 910 had a shared door - but the door is very very thin and you can hear EVERYTHING in the room next to you. Luckily we had quiet people next door and weren't disturbed. Hotel is about 2 blocks from National Singapore Museum, Raffles, Singapore Art Museum. Orchard Road is a slight walk but not too bad.", "Date": "November 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stavanger", "Title": "“Great Family Rooms.”", "Author": "HousewifeStavanger", "ReviewID": "UR8753708", "Content": "We are a family of 4 who stayed here on stop over to Australia. We were very pleased with the linked family rooms - almost like having our own suite. The hotel was very clean, and quiet. We had a great stay and would recommend it.", "Date": "September 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Staffordhire, UK", "Title": "“Beware of the bell service”", "Author": "Theloo", "ReviewID": "UR8686759", "Content": "Stayed at the Bayview after trouble with the hotel that we were originally booked in. The hotel reception was welcoming and rooms were clean. The bell service for the hotel was very insisting on having a tip when he assisted us with our luggage from the lift to the room. I was always under the impression that it was discretionary in Singapore particularly in light of the service charge that everyone has to pay irrespective of the service you receive. Breakfast was rather poor with the emphasis of waiting staff on collecting your breakfast voucher rather then waiting on you. Upon our check out the bell service assisted us in getting our luggage from the reception into the taxi. And again the employee was insistent that he had a tip for his limited service. This practice of paying a 10% service charge always troubles me when poor service is given. To add insult to injury it irritates and repels me when members of staff demand to be tipped. It maybe time for the hotel management to look at the practices of certain individuals.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Great Stay, very good location”", "Author": "PADK", "ReviewID": "UR8514887", "Content": "We have just got back from a very long Far East holiday with a stop in Singapore from 20-25th August. Our last visit to Singapore was 7 years ago. Previously, we have stayed at a hotel in Orchard Road then and alI I can remember was going through lots of shops before getting through to our hotel lobby. Arriving at Bayview was a a very pleasant surprise. For a country where city space is premium price, Bayviews hotel offers a nice welcoming atmosphere when you step inside their lobby. The room we were given is of very decent size. We have booked a triple room for our family of 2 adults and 2 kids. We definitley have plenty of room to move about. Oh, we have stayed in some big city hotels before when you only have just enough room for 2 suitcases. The staff are amazingly polite, helpful and friendly, but that is most of Singaporean for you. They all love English football and our 5 year old son wearing his Man U kit was an instant star. Breakfast is served daily unitl 10 am. It's the same every day but then, enough choices to vary your plate each morning. In terms of location - Ideal! Bus stop 5 meters to the left as youstep out of the hotel. Dhoby Gaut MRT about 10 mins walk (with children's pace). There re eating places right outside the hotel to the right and if you turn left, next to the hotel is 7/11 and a massive local fastfood place calle Tokipiam (or something like that). Wow for those like me who loves oriental dishes. Yum! There are several cafe's (name it, and you can walk to it). Funny how we found on the 2nd day that to go to most places of interest like Orcahrd, Raffles hotel, Bugis Street and the Suntec Mall, it is easier to walk because of the one way road system whichmeans some routes will have to do a turn around to take you to the next street. Well, walking was fun, go to see some interesting buildings. When you get to Bras Basah (that chages to Orchard Road as you go right). turn left and 2 streets away is Chijmes. Don't be fooled. It is not a place of worship. walk in and enjoy beautiful gardn setting of several eating and drinking places. Be warned- can be pricey for some budget travellers. Do try the DHL helium balloon- not far from Bugis street. Anyway, enjoy Singapore, it is a very unique, organize, and totally civilized Far east adventure . Cheers, PADK", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Stay”", "Author": "lillywr", "ReviewID": "UR8458173", "Content": "My friend and I had come to the end of our 5 week travelling experience through Asia so were much relieved when we came to the hotel (that had been previously booked) it was clean, comfortable and in a perfect location to explore the city. The staff were courteous and adapted themselves to our every need. The room was always spotlesly clean, however my only complaint would be that the toilet sometimes smelt after stalinisation - but I guess that is inevitable. The shower was huuuuuuuge, and the most powerful I have experienced in a while - maybe because I was putting up with cold hoses as showers!! I would really recommend this hotel to anyone, specifically for location and the fact that breakfast is included - which is always an added bonus!!", "Date": "August 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Not impressed!”", "Author": "goonette", "ReviewID": "UR8445065", "Content": "This hotel had a good location but was not very clean. The rooms were sparse and the bed uncomfortable. The fridge smelled so bad after opening it I couldn't clear the smell from the room for a good couple of hours. The staff were friendly and helpful which is the only thing that saved me from making a major complaint. If I were you I'd find somewhere else to stay. Not good!", "Date": "August 18, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "karen11au", "Title": "“Nice Hotel but....”", "Author": "karen11au", "ReviewID": "UR8431917", "Content": "The Bayview is an average hotel but for half the price I stayed across the road at the Bencoolen a month earlier and it was just as good. The rooms are larger at the Bayview but if you are on a budget choose Bencoolen.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Nothing great but stayable”", "Author": "MikeCMelbourne", "ReviewID": "UR8238506", "Content": "Booked this hotel on the internet. It is not easy to find hotel rooms in Singapore especially when there are trade fairs or conferences in the city. Chose this hotel because no other rooms were available elsewhere. Fact #1: Hotels in Singapore aren't that cheap Fact#2: This hotel is one of the cheaper ones, so you can't expect much If you want something cheaper than this, it will be likely those that are often used for \"bed activities\" If I am travelling on business, I will definitely stay at a better place, but I will not hesitate even for a second to stay here if I have to pay on my own. Close proximity to cheap food. Need a bit of a walk to subway. But can manage. Not that easy to get taxis.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Bedbugs”", "Author": "red_wanderer", "ReviewID": "UR7712206", "Content": "My girlfriend and I stayed here for two nights paying US$130 per night for a double room. Location is excellent for exploring Singapore with an MRT station within walking distance. It's not actually that far to walk to the area where Raffles Hotel is. Room was a good size. Staff are friendly. Bad points: poor cable TV - choice of channels was rubbish. Walls are thin and we could hear the couple next door arguing. Breakfast was not that great - we preferred to eat at the Kompitel food court place down the road. Worst thing was the bedbugs! Other than the bedbugs, I think I would just about recommend this hotel.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "philippines", "Title": "“Nice hotel”", "Author": "carlnoweast", "ReviewID": "UR7638222", "Content": "We stayed here for 4 days and 3 nights. Nice room, comfy ambiance.. helpful staffs.. what i dislike -- you can hear voices from nearby rooms , mostly chinese tv channels, lack of spare electrical outlets for my videocam.. but overall, our stay is good and will recommend this hotel to my friends.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Very Nice”", "Author": "MK10", "ReviewID": "UR7417082", "Content": "We stayed at this hotel for four nights and were very happy. We paid about 130S$ per night, which is very reasonable. Hotel staff were effective/friendly/helpful/responsive; the room was very clean; room amenities are good (basic toiletries (toothbrush, shower gel, shower cap, lotion, conditioning shampoo, soap...), instant coffee/tea, free internet access, safety box, etc.). The location is excellent - Seven-Eleven, a foodcourt called \"Kopitiam\", and coffee shops are just a few steps away. MRT station is just less than 10 mins walk. If you're looking for a place to stay comfortably, not luxuriously, this is the place!", "Date": "April 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, UK", "Title": "“nice hotel, good base to explore city”", "Author": "millypoppymo", "ReviewID": "UR7208351", "Content": "this hotel was of good quality and a reasonably good location. The pool area was nice, with a self service laundry area. The room was clean and nice, but quite small. Not sure how this compares to other hotels in Singapore. The staff were helpful and the restuarant was nice. Overall not outstanding but nothing complain about.", "Date": "March 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Not again”", "Author": "trevostar", "ReviewID": "UR7194585", "Content": "Surprised after reading all the positive reviews on this website when I arrived at this hotel and found that it looked a bit like a hostel. Was not impressed with the lobby that was small and rather unwelcoming looking. Was even less impressed by the room that was about as nice as my dorm room in college. Bathroom was modern but not very nice. The only toiletry in there was liquid soap that you have to push on the wall to get a squirt, like in the gym. Bedding was hard and uncomfortable, with very thin blanket that had a very cheap feel. Breakfast was quite awful, all the bacon was burnt to a cinder and scrambled egg was soupy. Walls in the room was also very thin as I could hear someone next door coughing every time. The door of the room also didn't close properly when it swings shut. Of course I didn't realise this so the door was unclosed for the whole night. At 5am I woke up becos someone was knocking on my door. When I got to the door that was when I realised it was still open. Imagine how terrified I was discovering that after hearing knocking at 5am! I quickly slammed it closed and looked though the peep hole to see no-one there. But the thought that someone could have just come in while I was asleep creeped me out big time. Worst part of this is that something was maybe going on in Singapore that week so I couldn't book anywhere and ended up paying to pay 170 SGD for this hotel. It is a major rip off for this standard and I imagined that all the other people who wrote positive reviews about this place must have paid a lot less. Basically was told by friends that you should not be paying more than 90 SGD for here. Even at that price I think I would still look elsewhere.", "Date": "March 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Pleasant stay”", "Author": "Morningsider", "ReviewID": "UR6567470", "Content": "Arrived in Singapore at 10:30 and took the airport shuttle to the hotel, it was a 20 minute drive... Was offered early check-in upon arrival...the room was clean and well furnished, the air-conditioning was quite good. The shower pressure was quite impressive, the slight problem with the wash basin was rectified immediately upon notification. Dhobi Ghaut MRT (train station) is a 10 minute walk and can be quite tedious in the sultry weather...All in all, a pleasant stay and a perfect base to explore the city state.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "perth", "Title": "“Great value hotel”", "Author": "eos26", "ReviewID": "UR6232884", "Content": "We really enjoyed our stay here. Probably one of the most conveniently located hotels we have ever visited. Short walk to most attractions including art museum, Raffles area, Bugis and even Orchard Road! Just outside the hotel, there is a 7-11 store plus a 24-hour coffee shop selling a wide range of cheap delicious food. The Kopi-O (black coffee) is only 80 cents! You can get a decent meal for under S$5. Although the rooms are a bit small, they are comfortable with most ammenities such as a room safe and coffee/tea. The bathrooms are immaculately clean and quite modern. Hotel facilities include a small roof-top pool with good city views, and free internet - the reception will lend you a LAN cable or you can use the wifi in the lobby. This hotel will suit business travellers and also tourists who spend most of their time sightseeing, as they probably won't mind the compact rooms. Probably difficult to find better value for money in Singapore. Thoroughly recommended!", "Date": "November 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Great city hotel”", "Author": "smartcat64", "ReviewID": "UR6102054", "Content": "Booked on the strength of reviews on this website and wasn't disappointed. Nice sized room, well appreciated tea & coffee facilities, clean spacious bathroom. Breakfast was more than adequate although more sausage and bacon would have been appreciated but I survived on the egg and beans. TV was a bit hit and miss but enough for the time I spent in the room. Location, excellent for everything - metro close by and all shops, sights in easy reach. Well worth the price though and I will defininitely stay here again if I am in Singapore.", "Date": "November 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "2", "Overall": "4.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "USA", "Title": "“Nice surprise, very pleased with the room”", "Author": "Savvy-tourist", "ReviewID": "UR5824153", "Content": "I just returned form Singapore where I stayed in Bayview hotel. Travel airport-hotel: my travel agent forgot to mention the shuttle bus on the voucher and I had to pay for it. It was 7 S$ one way, (shared with 5 people) in a Mercedes van with no meter. When I got off he offered to take me back for 35 S$ and I rejected. He lowered the price at 25 and when I told him that I will check with a taxi first, he took off. (the taxi for the airport is 15-20 S$ from anywhere in the city). Beware of crooks. I was a bit tense before the arrival to the hotel, taking in account my disastrous experience with Golden Landmark Hotel a couple of years ago. Since my flight arrived at 8 AM in Singapore ( 13 hours of flight ), and I had the next plane at 1 PM next day I booked two nights to be hassle free and to check in immediately. Location: the location is good, almost in the city center, near everything. Lobby modest, one TV screen, only some sofas, no internet. ( you can get internet access in department stores with computers and also in telephone stores, free of charge). The room paid: Superior with breakfast. What I asked at the front desk: High floor, good view, quiet (not near elevator), non smoking, no pets. I was extremely pleased to see that was very clean. Clean indeed, without any smell and I could walk relaxed and safe bare foot on the carpet and in the bathroom ( do you follow me ?). This is the first time after many years in hotels all around the world in this price tag… Bathroom clean, with no mold. Some amenities. Towels worn, but clean. Bed (double) very clean. Whole room refurbished with very good taste in colors and design. A small safe working, hangers. TV, I did not check tough. A minibar but does not worth the money. It is a 7/11 shop next to the hotel full of drinks. Lights: extremely well done, switches everywhere, could modulate light in every corner intelligently. Very pleased. Air con: individual for the room. Working. Could adjust flow and temperature. Very pleased with that. Overall: room very good for the price. View: do not be fouled. The name has nothing to do with the bay. Take a front street room. The building is somehow low and very near the other buildings all-around. The best view is on the main street. Take a higher floor, ( I was at 12) because the traffic is high and noisy. Scary: to my horror, the room was connected the next one by a double door. Each room could open only its door (only interior handle), nevertheless there was no system in place to clearly lock my door from inside. The elevator correct and safe. I was surprised to see an announcement that is available some free laundry on the last floor. ( I did not check tough). Anyway, is good if you stay for a longer holiday. After checking in, I went to take my breakfast. You will get a voucher for that. Breakfast: disappointing. No cheese, no bacon. Scrambled and fried eggs, a processed ham pathetic, one Chinese processed meat can type sausage, some cereals, no milk one type of orange juice, one of coffee, (no decaffeinated), and tea. Some fruits and sweets. For the price, almost nothing. The restaurant clean and refurbished. Conclusion: do not include in room price the breakfast, does not worth the money. Go around the corner, there are plenty of restaurants with great choices. Town: each time I go I relax and enjoy. People are friendly, smiling and relaxed even they are not rich. Can take and understand a joke. Think about Tokyo for example…. In Singapore was an IMF meeting at the time and police was at every corner. They discretely scrutinize you, nevertheless, overall you feel very safe in town. I went to Clarke Quay, took a boat around the bay and after that the lunch. I tried to walk there but is a bit far (2 Km ?) and I was approached by a old may with a rickshaw. I did not negotiate any price. The guy was so old and weak that almost I had to push him since could hardly make any progress. After less that one km he asked me 10 S$ that is 5 times more than the taxi for the same distance. I gave him 3. The restaurants on the Quay were empty. I shopped a bit around and I could see that one can get first beer free with the meal. Do not forget to ask. I took tenderloin that was advertised at 22 S$. I offered him 15, he rejected, we settled at 18 and first beer free. Do not forget to bargain. Returning, I took a taxi and cost 7.5 S$ for 2 Km, that later I felt high since for the airport like 15 Km I paid 15 S$. Dinner: I returned to the hotel and asked them since I leave very early and I do not get the breakfast in the morning to give me a cold snack. There were a bit surprised and after some deliberation they gave me a voucher for the dinner. Only a few persons there. Food was much better that breakfast (buffet also). A few type of meat some sea food even a Japanese dish. It was good enough for me. There was no orange juice and I asked for it, telling them I have no intention to pay for it since should be included. They brought a glass. Promptly. I did not take a coffee at the time and before leaving the hotel I went to take a coffee that they gladly served free. From what I could see ones should not go for meals in the last half hour before closing because food is scarce. Overall impression of the hotel: very good for the price, very clean room, staff friendly and helpful. Restaurant's foods rather poor, do not worth the money. I would go again and I would recommend it for longer holidays too.", "Date": "September 20, 2006"}], "HotelInfo": {"Name": "Bayview Hotel Singapore", "HotelURL": "/ShowUserReviews-g294265-d305428-Reviews-Bayview_Hotel_Singapore-Singapore.html", "Price": "$149 - $296*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">30 Bencoolen Street</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">189621</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "305428", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3d/f3/1f/deluxe-room.jpg"}}