{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great location, small but clean functional room”", "Author": "eric p", "ReviewID": "UR128243237", "Content": "I stayed for 2 nights in March. The location is very convenient, right in Chinatown. The MRT is a 5 min walk away. There are amazing food choices within minutes. The rooms are small, but they are clean and functional. I found all the front desk staff friendly and helpful. I had a late flight so I checked out of my room at noon. When I returned in the evening I was allowed to use a vacant room free of charge to shower.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "adelaide", "Title": "“fantastcic hotel”", "Author": "Chris J", "ReviewID": "UR127586254", "Content": "We stayed for three nights late March 2012. What a fantastic hotel. Rooms are small but seriously clean with great reception staff. We accidently left clothing behind and they immediately emailed us. Location is in the very middle of Chinatown - great location, clean and compact - beat it - best of luck in Singapore!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Room the size of a cupboard!”", "Author": "DavidfromOz", "ReviewID": "UR125819630", "Content": "Didn't have a great experience at this hotel. The positives: Cheap, great location right in China Town, three minutes to the MRT trains. The negatives: Room the size of a large cupboard, TV in room didn't work, Wi-Fi wasn't working, the world's smallest bathroom/toilet wasn't clean, staff constantly asleep at the front desk, no breakfast available - need to go to Mcdonald's close by. The hotel has character as it is a restored old chinese inn, but it isn't well run or looked after despite having tourism awards displayed. An old grotty tissue on the main steps up to the rooms was there when we arrived, and was still there two days later whe we left. Doesn't look like much cleaning ever gets done and our room reflected this. Despite being in the lower price bracket price (about $105 a night, so not exactly ultra-budget) we won't be staying here again.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel. Great location.”", "Author": "Didiki", "ReviewID": "UR124048003", "Content": "We stayed here for 11 days over Chinese New Year and had an absolutely great time. The hotel opens onto Temple Street which was closed to vehicles, and full of food stalls and hawkers selling everything under the sun. It was great. The room was clean and tidy. The small fridge and electric kettle were a nice touch. Staff were very friendly and helpful. A thoroughly enjoyable staff. Our room was on the second floor at the rear. We used foam ear plugs at night, and weren't bothered by the street noises. Would we stay here again. You bet.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“This is Not a Boutique Hotel!”", "Author": "KandyKitten", "ReviewID": "UR123722318", "Content": "This hotel is by no means a Boutique Hotel - a statement that is being used rather a lot these days without any foundation. http://en.wikipedia.org/wiki/Boutique_hotel The Hotel has just been renovated and stank of paint, when I asked if windows could be opened, as the smell was intoxicating and giving us headaches, I was told no. It turned out nobody had keys for any of the windows in the whole Hotel, not the stair ways nor the bedrooms, which is a big Health & Safety concern. The rooms are tiny to say the least, and the bathrooms have been 'shoehorned' in. The decor is simple and pleasent but the beds are short. I'm 5'8\" (172cm) and when I was laid on my back with my head on the pillow my heels were hanging over the end... For a one night stop over it is okay but for a couple of nights at 113 Singapore Dollars per night, when it is advertised as 'Boutique' it is very disappointing and not worth the money.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bhubaneswar, India", "Title": "“cozy place to stay while in singapore”", "Author": "SorentoMoon", "ReviewID": "UR123390506", "Content": "it's very cozy right in the heart of China Town. It is very near the Marina and it's accessible to the night market. It has a busy street of great foods and cheap shopping. The people at the front desc are very accomodating and friendly.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "China", "Title": "“Very good place”", "Author": "JCLau", "ReviewID": "UR122642625", "Content": "Friendly services, convenient,very clean, nice to stay. I will back soon", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Enjoyable Stay...!”", "Author": "wu p", "ReviewID": "UR122642119", "Content": "I have enjoyed my recent stay at the In. Well decorated and design after the renovation. Looking foward to my next stay with them.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Hobart, Australia", "Title": "“I would not even consider recommending this place to others!”", "Author": "KevJosh", "ReviewID": "UR121307432", "Content": "I just checked in to this hotel. The receptionist told me nothing about their on going renovation work. The floor where I'm staying smells terribly because of the paint, and there is drilling and knocking noise! For goodness sake, this is a hotel. If they cannot even provide a decent place for guests to rest, why not just shut it down until the renovation work is over! This reflects how money-minded this so-called hotel's management is!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Croydon", "Title": "“Good location but beware of the stairs”", "Author": "SurreyGrahame", "ReviewID": "UR119658022", "Content": "I stayed here in September for 3 nights with a night on Batam Island after the first 2 nights. It isn't close to the airport but if you're not travelling with too much luggage or you're fairly fit and active the SMRT (Metro) is efficient and easy to use and the Chinatown stop is very close to the hotel. Alternatively a taxi doesn't cost the earth and it doesn't take too long. The hotel isn't very large or grand but if you're travelling on a budget it is perfectly fine and comfortable and in a good location close to the SMRT and the delights of Chinatown. The one considerable downside was being on the 3rd floor and the stairs were quite steep. I am fit and strong but even I was out of breath from getting my bags upstairs. So if you have mobility issues make sure you get a room on the 1st floor or ask for help.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kuching, Malaysia", "Title": "“Strategic location but too small”", "Author": "Fan_Theng", "ReviewID": "UR119463733", "Content": "I checked-in to The Inn at Temple Street in Singapore back in September 2011. I chose this inn because the location is strategic as it is very near to Chinatown MRT (only 3 minutes walk) and the price is rather cheap for hotels not located at the red light district. We arrived very early in Singapore at around 8.30am and plan to go Universal Studio Singapore on the same day. We appreciated the Inn staff for letting us to drop off our luggage in their store room first and we headed to USS for whole day. The Inn is basically a boutique-style hotel. We chose to stay in Standard Double Room for SGD110 per night inclusive of tax & service charges. The room is VERY small as you can hardly walk after you put your luggage on the floor. The furniture is old, some of the drawer and hangers are broken / spoiled already. Basic toiletries are provided which include towels, soaps and hair shampoo. No floor mat is provided!! >< The bed is ok as I can sleep soundly due to the long exhausted day in USS. The hotel surrounding is quiet at night, which can ensure you have good quality sleep. No breakfast and no bellboy to help you carry your luggage all the way up to 3rd floor. Generally, do not put too high expectations and you will be happy you have found a quite ok place to sleep and bath in Singapore. P/S: There is one Chinese dessert shop selling excellent Iced Durian Dessert on Temple Street. After walk out from The Inn, turn to your right and walk towards Mcdonalds. Somehow you will see a dessert shop on your left (one of the shoplot opposite Mcdonalds) which sell excellent desserts. Give it a try then.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Location is sometimes just not enough.”", "Author": "doctordv8", "ReviewID": "UR119279616", "Content": "We were in Australia recently, and it's my wife's birthday. Hanny being half Chinese, and we were transiting in Singapore, I thought this would be a great time to overnight in Chinatown. Unfortunately the online speel and pictures did not match the hotel I chose. Poor roadside signage, very outdated foyer/reception pics should of warned me. Especially as there was a much grander hotel across the road which in hindsight we should of checked out. We knew of possible disruptions due to advertised renovations, which we never saw or heard in our 2 days there which was a blessing. To be advised there was a tiny TV, but sorry it does not work, and no, we won't fix it either, was another warning sign I failed to see as a precursor to the following other problems. We did not want or need a TV, but it is part of the room and equipment level so it needs mentioning. 3rd floor room and stairs only so only good for the fit who can carry all your bags yourself. We found our room, opened the door, and BANG, 3/4 open before it slams the bedside table, oops, that is a tight squeeze. Our rock had bed was great for me, but Hanny did not sleep at all, and strange as there are NO extra pillows. A tiny room, equipped with 2 bedsides and a wardrobe, all with doors/draws in various states of disrepair prepared us for the in cupboard safe that was in pieces and a waste of space. The bathroom with its bi-fold door that nearly closes was well layed out, but mouldy and no bath floor mat or hand towels. We did ask the night manger for hand towels and bath mat but we were given bath soap. ???? A few other folk stayed 5 minutes and cancelled to go across the road, although we persevered and enjoyed being in the center of Chinatown, walking distance to the River Precinct and excepting the hotel, we had a great short birthday stay in Singapore", "Date": "October 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Ghent, Belgium", "Title": "“Small dirty but excellent location”", "Author": "Dirk V", "ReviewID": "UR118035799", "Content": "The title says it all. The rooms are so small that we had to climb over our twin beds to get to the bathroom. Our first room had no window and felt like a cellar . As we had booked WITH window , they changed us the second night . Same same with window that could not be opened. But we had daylight . The rooms a damp , the sheets are damp. And the rooms - both of them - were dirty . Staff was not very helpfull . Internet only in the lobby . And this so slow that more often than not hotmail did no t open. No beakfast possible and if you do not want an eastern one , the only option of something like pancakes is the macdonalds on the corner .All this said : Singapore is very expensive hotel wise. And we were somewhat spoiled after Vietnam and Bangkok . The hotel has an excellent location in Chinatown - a very nice place to be at night with great little restaurants and the eateries on Smith street . We walked around in colonial SIngapore and little India and the modern parts but Chinatown is the best place to sleep. So in that repect the hotel is excellent.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melaka, Malaysia", "Title": "“Convenient and cheap”", "Author": "Jessielau", "ReviewID": "UR117484501", "Content": "The Inn was at conveniet location,5 min to China Town MRT. This will save my transportation spending. Alot of souvenir gift shop, easier for me to shop around. Hotel is clean . I would like to thanks for the friendly staff there.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Bali, Indonesia", "Title": "“Nice hotel & good service!”", "Author": "AyundaGitta", "ReviewID": "UR115309596", "Content": "Once you step in the lobby,you will be welcome by friendly receptionist.They give useful information as it was my first time in singapore.The room was just nice,not too big not too small.Perfect environment and its only took 5 min to the MRT. Wonderful experience! Will come back next year!", "Date": "July 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good location but no free internet”", "Author": "angelluvdevil87", "ReviewID": "UR114749625", "Content": "I enjoyed my stay at this inn due to the comfortable bed (comes with attached bathroom!!) and merely 5mins walk from Chinatown MRT. The downside is the inn doesn't provide free wifi like other hotels. I would recommend the inn to my family & friends who just want a place to sleep.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Great & Enjoyable Stay...!!!”", "Author": "TripSingapore", "ReviewID": "UR108759961", "Content": "Our recent stay in this hotel was great and enjoyable as the hotel is situated in the heart of Chinatown where food eateries and grocery shops are just conveniently accessible. Reception and housekeeping staff were friendly and we have very good impression on them concerning places of interests they had recommended to us. Above all we are very satisfied with the hotel service and would definitely recommend others to stay at The Inn @ Temple Street....!!", "Date": "May 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Banff National Park, Canada", "Title": "“RIP OFF”", "Author": "tropic_heat", "ReviewID": "UR104719927", "Content": "Incrediably small room...closet doors that would only open to a 6\" ajar position due to bed being in the way. Safty boxes that do not work. Three stations on tiny TV. Bed fills the room with only 10\" clearance between walls / closets ALL THE WAY AROUND. Furnishings thread bare. Holes in ceiling and walls. Dirty bathroom and shower. THIS IS NOT A 3 STAR HOTEL AS ADVERTISED!!! At 105SGD it is overpriced. The only positive thing about this hotel is it's location.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location but in need of some serious TLC”", "Author": "glendaloughbnb", "ReviewID": "UR104115911", "Content": "This is a small hotel, 3 floors, with compact rooms. The reception were welcoming and helpful, even very late at night when I arrived. The room was clean, the bathroom was also clean, although some small items were broken and had not been repaired or replaced. With twin beds in the room there was only 28cm at the foot of the beds as a walkway to the bathroom, really tight! A bar fridge, tea making, iron and ironing board were all provided. There was also am electronic safe, this did not work. The airconditioning was very good, quiet and efficient. Wifi was available for $20 per day. The location is the best, right in the middle of Chinatown, 2 minutes walk to the MRT, and just over the road from Peoples Park Shopping Centre. There are food courts, small local restarants and inn the evening a street with food stalls, all are very reasonable and good. Great quiet location.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Run down, cramped and unfriendly.”", "Author": "LeithBrian", "ReviewID": "UR100104173", "Content": "It's not a heritage/boutique hotel! It is an old cramped run down dump with ill-natured unhelpful staff. The room was the most cramped uncomfortable one that I have ever stayed in… Only good thing about it is teh location. Not recommend...", "Date": "March 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“WONDERFUL LOCATION, WOULD RECOMMEND THE INN AT TEMPLE STREET”", "Author": "Journey61", "ReviewID": "UR92506678", "Content": "I stayed at The Inn at Temple Street for 4 nights early January 2011. Wonderful location right in the heart of China Town, minutes walk into town or there is a metro station behind the hotel which is fast, clean, easy to use and will take you all over the city. My room was on the 3rd floor with windows facing on to the street it was tiny, queen size bed comfortable, small ensuite with separate shower clean, for a solo traveller as I was it was just right for my needs and at around $75 a night I think not bad for Singapore for what it is. My room was cleaned each day with fresh towels, I slept well no street noise. There is internet in the lobby. The buildings in Temple Street are heritage listed, the restoration work is beautiful and colourful with most of the upper floors having shutters on the windows painted yellow, purple, red it is quite pretty with lots of Chinese lanterns fluttering in the street. All around the Inn are lots of markets, restaurants and eateries with wonderful food, Chinese antique shops, Chinese traditional medicine shops, hawker food halls, shopping centre, McDonalds and a Seven Eleven store at the end of the street and the other end has a magnificent Hindu temple. Staff were friendly and helpful.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Excellent location, horrible place.”", "Author": "BackpackingMike", "ReviewID": "UR91791622", "Content": "The only thing this place has got going for it is the location. It is perfectly located 2 minutes away from the Chinatown MRT smack bang in the middle of Chinatown. Perfect. However, the service is appaling, the rooms are dingy and falling apart, and for the price they are charging, pay a little bit extra and stay somewhere really nice!", "Date": "January 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“STAY AWAY!!!”", "Author": "PrincessWY", "ReviewID": "UR89314941", "Content": "Worse hotel I stayed at! And I stayed in some hostels during my holiday which were luxury in comparison. Too Expensive for what we got. Poky little rooms, which were filthy, smelly and hadn't been cleaned from the last stay. Got bitten from bed bugs. Staff were rude and unhelpful. Saw some dodgy room service activites. Would never stay there again or recommned oit it to anyone.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dirty, Dusty, Grungy, Grimy”", "Author": "contingo", "ReviewID": "UR86308861", "Content": "Booked a late overnight stopover in Singapore and this hotel came up. This place laughably describes itself as a boutique hotel; it is not. The reception is pleasant enough. we had a room on the third floor (308) and even as we approached that floor it was clear that the common areas had not been cleaned, maintained or refurbished. The bedroom was small; this is not a problem, but the condition of the room was very very poor. The windows were dirty and grimy. the net curtain was filthy. the curtains encrusted with dust. the carpet looked grimy. the bed clothes could not be trusted. we slept in our day clothes for fear of bugs. the TV was small, (10 inches) and did not work. The only positive was the bathroom which was clean, with lots of hot water on demain. The location was good, if you wish to be in chinatown, or walk home from clarke quay. But, after 2.5 weeks in asia, this was the only hotel i did not read a review for, before i booked it, and it was terrible. Avoid.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Burton upon Trent, United Kingdom", "Title": "“temple inn compact and bijou”", "Author": "hazelhelen", "ReviewID": "UR77594055", "Content": "unless your paying thousands you will generally get small in a metropolis! clean yes staff helpful yes quiet yes felt safe yes in the center yes", "Date": "August 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bridgend, United Kingdom", "Title": "“You get what you pay for - and we paid peanuts!!”", "Author": "AllisonTuck", "ReviewID": "UR75274629", "Content": "Excellent location, right in the heart of Chinatown with the MRT stop just one street over. Due to it's proximity to all the hustle and bustle it's not a place for a quiet night's sleep. The hotel itself is very small, friendly and clean but a little tired and could do with a facelift. The rooms are tiny but stuffed with oversized wooden furniture and if you you are over 4 ft and have normal sized legs, you'd struggled to sit on the loo without your knees hitting the shower. There are no real facilities at the hotel - they send you over the road for a curb side sandwich and ropey cup of coffee for breakfast but it adds to the fun. Saying that there are loads of places to eat and drink near by, including a MacDonalds, 7/11 and some great places serving delicious local cuisine. There's a stunning temple right at the end of the road and it's only a 10 minute walk to the city centre. So in summary, slightly claustrophobic hotel with a lumpy old bed, but friendly staff and superb location. Okay if you are looking for just a convenient base to explore the area.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bridgend, United Kingdom", "Title": "“Cheap (for Singapore) and shows it....but very good location”", "Author": "msprichj", "ReviewID": "UR74553528", "Content": "Had three nights here and expected a noisy sleep being right in the heart of china town. Turned out to be a decent enough night's sleep, but the rooms are really pokey - we had to climb over our cases to reach the bed and climb over the bed to reach the OTHER side of the bed. The \"included breakfast\" is a bit of a joke and amounts to a small sandwich and espresso coffee across the road, but then there's a 7-eleven and a macdonalds on the same street so there are some options, not to mention plenty of eateries in Chinatown. The location is great though and you are literally a 10 minute walk from the heart of the city.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Completely satisfied”", "Author": "DocLeeMelbourne", "ReviewID": "UR69688239", "Content": "I'm not sure what parallel universe the other reviewers inhabit, but I have stayed at The Inn on Temple Street four or five times, and have always found it fine: staff courteous and helpful, room very clean. Once the airconditioner was not working properly, and it was dealt with immediately. It is authentic Peranakan architecture (as one of my Singapore students told me) so, yes, the rooms will be small. I have stayed at the Singapore Hilton on a business trip recently, and it was luxurious and super-efficient, but I actually prefer The Inn because it feels more like 'real' Singapore to me, and that is my preference. If people want the Hillton, they should go there and pay four times more, and not expect the Inn to be something it isn't. As for all the other stories--as i said, sounds like some people live in a parallel universe to the one I inhabit.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Disappointing!”", "Author": "Apolloforteen", "ReviewID": "UR55145650", "Content": "My husband booked this hotel without checking the travellers reviews. We were both quite disappointed with the room, especially as he had paid more for it than most of the very nice hotels we had stayed in during our previous 2 weeks of travelling, including another hotel in Singapore. It was not cleaned properly - the bathroom looked as though it had just been hosed down - there was soap scum clearly visible on the bath, and the shower curtain was quite grubby. The towels were ancient and threadbare, and the sheets and bedspread were old and marked. The room itself was very cramped, the door could not be fully opened, as the bedside table was behind it. Our room was up 2 flights of stairs, and there was no lift. The man on reception carried our cases up on arrival, but my husband carried both of them down when we left, as there was only a lady on reception. If it had been clean, this would have been a fun place, as it is in the Chinese markets,and was easy to get to by train. It has character (see the advertising photos), but loses out by being dirty and relatively expensive.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Horrible Service!”", "Author": "minny85", "ReviewID": "UR39971492", "Content": "The customer service was horrible! the hotel manager was never around for your feedback and they would put you on hold (international call) for an hour!!!! Gosh. and they scream and they hang up on you on reservations and wouldn't let you cancel reservations. It left me angry and frustrated and demeaning. DO NOT TRY THIS HOTEL.. its NOT THAT cheap and there are TONS of hotels in singapore more chic and with better service. for budget, try Frangrance and for ambience a boutique hotel like Royal Peacock or 1929 or New Majestic would give you a wonderful stay in Singapore.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Singapore", "Title": "“Credit Card Beware!”", "Author": "mylemonhead", "ReviewID": "UR32608675", "Content": "I'm a local, who decided to walk into this black boutique hotel, just with an intention of checking the rates.. as i needed a week out. I was told to leave just my credit card name and number for reference, together with my mobile number. I was hesistant but agreed as i felt i did not have to worry as they have the singapore 'tourism award', and they just needed it for reference purposes. Additionally, there was NO registering with my identity card, NO signing of any documents, NO invoices, NOTHING! I was stupid and caught unguarded. I received my CC statement, i was blown away when they charged me for NO SHOW.. which i felt simply absurd because even if it was miscommunication that led them somehow to believe that i was registering (giving 'em the benefit of the doubt), why was'nt i informed of NO SHOW penalty at all?? Worse, no invoices/ documents stating cancellation options and penalty! Personally, this is a shady place from this incident.. and i will not recommend to anyone at all.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "France", "Title": "“Don't be tempted by that 'boutique' nonsense!!”", "Author": "JillFrance", "ReviewID": "UR26496598", "Content": "One week after staying there we are still suffering from masses of big red itchy bed bug bites. The great worry is whether we have brought any bugs home in the luggage. The room was cramped, the air-con was pathetic and the room stuffy, the sheets were marked, the towels scruffy, the shower didn't work and nor did the bath-plug. They appeared to have lost our on-line reservation when we first arrived and had only a top floor room left. Was it any worse than the rest? Don't know. My advice - don't risk it.", "Date": "March 20, 2009"}, {"Ratings": {"Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Melbourne", "Title": "“False advertising”", "Author": "TheFave", "ReviewID": "UR18564251", "Content": "When we contacted The Inn on Temple Street via email before we left home, we requested a family room as there were four of us- three adults and a three and a half year old. We promptly received a confirmation back from the hotel that a family room was available so, as requested, we gave our credit card details to secure the booking. When we arrived at the hotel, we checked in, (foolishly without looking at the room first) lugged our bags up the stairs (there was no lift) and to our dismay, tried to squeeze into a tiny room. The door couldn't even be opened all the way because it hit a desk that was in the door way. It had obviously been moved to make way for a stretcher bed. This certainly wasn't a family room! For $248 Sing. a night, with no breakfast or no swimming pool, we at least expected a room where we could all fit into without having to try to scramble over our luggage and each other's beds! I've travelled to over 50 countries and stayed in a lot of rooms, but this just was ridiculous. We politely handed back our room key to the lady at reception and said to her that the room was just too small for four people, and she agreed! We should have suspected this when we arrived and she asked if we had booked two rooms. We caught a taxi and soon found another place to stay with a much larger room, a pool, free internet (unlike the Inn which had a very high rate) and included breakfast for less than $248 Sing. When we arrived back home three days later we found that we had already been billed $292 Sing. by The Inn for the room which surprised us a lot. It wasn't as though we had just changed our minds because we didn't like the room- it was just not what we were told it was when we booked it- A FAMILY ROOM We emailed the hotel to ask for an expanation with no reply, so we waited a week and sent another email with no reply again. Yet when we were booking the hotel, we received promp replies. They have our money yet are too unprofessional to even reply. If you are looking for somewhere to stay in Singapore, I would not go near The Inn at temple Street. It is just a small 'Boutique' hotel with little in the way of amenities or views. There is nothing special about it. If you want to visit Chinatown it is very easy and inexpensive to catch public transport or even walk there form another part of the city where there are heaps of hotels with similar (or cheaper) rates than The Inn. At least you will have a much nicer room, views of the city, restuarants, a pool and perhaps free internet", "Date": "August 3, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“Good if you do not want to spend much time in your room”", "Author": "lover_lee1", "ReviewID": "UR18333773", "Content": "When trying to find somewhere to stay in Singapore this place was one of the cheapest we could find that wasn't backpackers and our travel agent said that it was a STA travel reccomended budget hotel. Probably would not have stayed here if we had read the reviews on this website before booking. They do make it sound a little worse than it actually is (or maybe thats because we were expecting much worse). We paid about 95$ AUD a night including breakfast which we thought was going to be a buffet and it turns out you get given a voucher and walk across the street to a little street caffe for instant coffe and a few pieces of heavily buttered toast! If I had known this I would not have purchased breakfast with the hotel I would have walked up the street for a Mc Donalds muffin! The rooms are tiny pretty much just consists of a bed and a view of rubbish and other peoples rooms in a dingy alley out our window. We didn't spend much time in our room only to sleep so this wasn't too bad although had to climb over the bed to get to the bathroom. Although the decor isn't bad its a quite cute little place. The final mistake we made was asking to owner of the hotel to book us a taxi for 5.15 am in the morning to the airport. He booked with his friend which was an expensive taxi company at a set rate of 43 SINGapore$ when it would have cost about 20 with a normal company as there was no traffic at this hour on a sunday!", "Date": "July 28, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "singapore", "Title": "“Bad stay at The Inn at Temple street”", "Author": "SingaporeSpitfire", "ReviewID": "UR16889765", "Content": "We booked 3 night , 3 bedrooms for our guests from Taiwan. This is their first time to S'pore. They found crockroaches in one room , another TV not working, plugs were not working. The management didn't even apologise when feedback. They offered to change room but by then our guest decided to check out the next day to find another hotel. Real embrassment for first impression. We found this hotel on line. We wonder how they been awarded The Tourism Award 2008. The room rates was attractive online but when they check out they paid full rates.", "Date": "June 13, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "KL", "Title": "“Boutique hotel? You're joking.”", "Author": "melbritt", "ReviewID": "UR16768290", "Content": "This place claims to be a boutique hotel but really it's just a hostel in a prime position. My room had no window, was so small it could only just fit the (small, single) bed in and still the air-con struggled to cool it. Wallpaper peeling, no hot water in the shower, a single scraggy towel that looked like it could do with a wash. Very poor, I won't be back.", "Date": "June 8, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Selangor", "Title": "“Worst Budget Hotel in Singapore!!”", "Author": "GG_Malaysia", "ReviewID": "UR11639627", "Content": "Chosen this budget hotel out of desperation. I checked into this hotel 2nd week of Dec 2007. Never thought the budget hotel in Singapore is in such a bad condition. I agreed with the noisy street, but worse than that, my air-con was ‘interesting’, not able to adjust the temperature, when it got too cold, you can’t off the unit as well, how amazing, when it happened in a country like Singapore….shame on you!! Oh ya, when most of the hotels in Singapore are giving free internet access, this wonderful hotel is charging you at SGD6 per hour, I cant believe I am in Singapore! Never ever choose this budget hotel if you have other options!!!!!", "Date": "December 17, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Singapore", "Title": "“Beware! Theft Central”", "Author": "DrAngMo", "ReviewID": "UR10785353", "Content": "Do NOT stay here. Why? You will run a high risk of having items STOLEN. In particular, mobile phones, notebooks, and other easily portable electronic devices that can be sold easily in SG. Having stayed here before, I had made the mistake of thinking that it was a reasonable (if somewhat shabby and small) budget hotel. My assessment now is that it is a prime site for theft - organised by some staff, with items gone in a flash (usually just prior to checkout). In a word - AVOID!", "Date": "November 13, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“Unbelievable bedbug infestation!!!”", "Author": "jarbru", "ReviewID": "UR10399093", "Content": "I was generally unimpressed with this hotel when I arrived--the shower door had to be lifted (not slid, as it was designed to do), the smell of mold was more than usual in midrange places, the top sheet was far too short for the bed (meaning you had to touch the gross blanket), and the toilet was so close to the shower that no one could possibly sit forward on it (it was a kind of a side-saddle sort of thing). Then I woke up and found myself covered in OVER A HUNDRED BEDBUG BITES! I don't know how much over a hundred, because I stopped counting there, but I know that my left arm had 29 and my right arm had 26. Holy begeezes, I have never experienced anything like this--maybe five to ten bites after a night in a budget place, but never like this! Usually bedbugs are difficult to see, but there were so many here that I saw (and squashed) three of them, adding my own blood marks to the numerous marks already on the sheets. Needless to say, the pain and aching of having so many bites lasted for days. Usually bites don't bother me, but having most skin covered in bites makes wearing clothes and taking a shower almost intolerable. I'm posting a picture of my arm, where you can make out some of the bites--unfortunately, it's not easy to see all of them (those purplish discolorations on my forearm are all individual bites), but you certainly see enough to get the idea. When I complained to the guy at the desk, he was unresponsive, unsympathetic and unapologetic. He'd \"let them know\" there were issues. Period. Goodbye. I absolutely beg everyone who reads this not to stay at this hotel. It's not worth the risk of being in pain for days. There are plenty of other places to stay in Singapore.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Please hide the manager”", "Author": "Marlow897", "ReviewID": "UR10044792", "Content": "Foolishly I booked this hotel because it got a good rating in the lonely planets guide. Admittedly the location is very central, but Temple street is also very noisy at night - if you turn off the dusty air-con you will be woken up by noises from the street. Rooms are *very* small - literally no good space to put your suitcase. I stayed in a double room with a queen size bed - reception made a big fuss about giving me this \"large\" room at the same prize as a single room. S$148 per night is clearly too much for this **-hotel. In the latest Lonely planets guide the price is given as S$98, so clearly they have hiked the price up recently. Before checking in I stayed at the Changi Village Hotel (A good 4 star hotel) for the same price per night! While the sheets on the bed were not exactly dirty, they where certainly not white either, but old and spotted by something that could look like blood. Reception staff was friendly, but look out for the middle aged Chinese manager who also hangs out in the reception area - using one of the internet terminals a lot of the time. I did not deal with him directly, but happened to overhear him abusing the girl in the reception when walked town. A nasty fellow they would do well to hide from the customers. When I checked out he was there too in the background. He grinned and said \"Money!\" Charming fellow.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "UK", "Title": "“Huge disappointment”", "Author": "cathyhUk", "ReviewID": "UR7238151", "Content": "We stayed overnight en route to Australia, we arrived mid morning and on checking in couldn't help but notice how tired the place looked, on the way to our room(if you can call it that) we noticed the wallpaper hanging off the walls and dirty stairs and threadbare carpets. The room was so small you had to walk sideways to get round. The bathroom was dirty and I noticed hairs on the floor, yuk. We were so shattered we just sat on the musty smelling bed and wanted to cry, the view was a brick wall so close to the window, very strange. We overslept by twenty minutes the next morning, no surprise as the very loud airconditioning kept us awake most of the night, and on going downstairs for breakfast we were abruptly informed we couldn't have any, we had paid for breakfast and I pointed this out to the manager but he would not relent, I had to plead for a cup of tea. I couldn't wait to get out of the place and would advise people to avoid at all costs. The staff including the manager are abrupt and brusque, there is no friendly smile and quite frankly I don't know how he manages to get away with it.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“OK if you only need a bed”", "Author": "Nyonya", "ReviewID": "UR6170882", "Content": "We booked this hotel for a 2-night stay as it was the only one left in Singapore with any rooms, due to a poker convention and a visit by George Bush. Our room was tiny and we had to walk sideways between the wall and bed to get to the bathroom. The carpets were sad & tired and there was a strange smell of over-cooked cabbage in the corridor. On the plus side, the staff were very friendly and helpful.", "Date": "November 24, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Give it a miss”", "Author": "leco", "ReviewID": "UR5446577", "Content": "I foolishly booked this hotel without reading any of the reviews on here. I arrived to be given a room with no windows, the air conditioning not working (in tropical heat and humidity), barely enough room to get to the bed and a solitary light that made the room look like a very badly lit, very claustrophobic mineshaft. I complained to reception and the manger, who's attitude was both surly and rude and who's answer was to tell me what did I expect for booking a cheaper room. I was told that I could pay an extra 20 pounds per night or come back in the morning (having already paid). At this point I demanded my money back and after a very heated debate was then offered a better room at no extra cost which I took. Also the rooms at the front face the road which has very noisy Karoake which goes on through the night. Please do yourselves a favour and avoid this hotel - you're on holiday - it should be fun - not like this.", "Date": "July 10, 2006"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Disaster!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5003882", "Content": "Although we had made a reservation, when we arrived at the hotel from the airport we were told there were no rooms available. Then we were told that if we wanted to stay we would have to pay additionally for the night because our reservation was for a different day. After some very lengthy and heated discussion, the receptionist studied the voucher again and claimed that the booking company (AsiaRooms) had made a mistake. At this point, we no longer wanted to stay at \"The Inn at Temple Street\", so we left and found another hotel nearby. Since returning from Singapore we have been trying, so far unsucessfully, to obtain a refund the amount AsiaRooms billed us for the room where we were refused. Avoid \"The Inn at Temple Street\" and avoid AsiaRooms.", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Dated but excellent location”", "Author": "C&C2006", "ReviewID": "UR4112646", "Content": "I have just spent two nights at the Inn on Temple Street. The hotel certainly has not seen a lick of paint or new carpets for a few years, however, the staff do keep the hotel very clean and are very friendly. Despite the tired decor I really enjoyed staying at this hotel due to its very central location in China Town which is walking distance to the Singapore river, boat quay, the financial district and even Raffles hotel and the colonial district. It is also very near the china town metro stop. China town has a great vibe due to the street traders, the large number of food stalls and the general buzz of the area, which I preferred to the less colourful areas such as around Raffles and north of the river. All in all a good budget hotel. I think if I was staying for more than two nights, however, I would stay in a more up market hotel with more facilities and general ambience etc.", "Date": "November 15, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "2"}, "AuthorLocation": "United Kingdom", "Title": "“Cheap and Cheerful”", "Author": "A TripAdvisor Member", "ReviewID": "UR4040136", "Content": "Myself and my fiance stayed here for 8 nights and had a great time. The room and en-suite were clean, the bed was comfortable, and the hotel is in a SUPERB location for seeing singapore - and frankly for £22 pounds a night what more would you expect! The breakfast was a bit basic (toast and tea/coffee), and the room a little small with some quirks - like a dodgy TV, but at the end of the day you get what you pay for. If you are after 5* accomodation and lavish hotel facilities, then this place isnt for you - however if you want a clean and comfortable place in a great location where you can get a good nights sleep after sightseeing then i'd recommend it.", "Date": "October 20, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Melbourne", "Title": "“Dirty & Unloved Hotel”", "Author": "stkildatram", "ReviewID": "UR3613605", "Content": "I stayed at this hotel In April 2005. The hotel is dirty, tired and unloved. The room was dingy and in extremely poor repair - dirty carpet, wallpaper falling off walls, safe that was broken. The airconditioning barely worked as the filters were thick with dust and dirt. The bed had hair in it and the brakfast was the worst I have ever had on my travels. It is a pity that the hotel is not managed and maintained properly as the location is great. I would suggest that any travellers seek accommodation elsewhere or they are likely to be very disappointed.", "Date": "June 27, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tasmania", "Title": "“Utter Garbage”", "Author": "A TripAdvisor Member", "ReviewID": "UR3605664", "Content": "This was to be our great return holiday to this hotel. Unfortunately we arrived at midnight and had to stay here. Originally booked for 10 nights we walked out the very first morning. The room booked was not the one we were given. It was FILTHY. I personally know the manager and was very surprised by the deterioration over the last couple of years. Avoid at all costs.", "Date": "June 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Tasmania", "Title": "“A Great Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3506547", "Content": "My wife and I had a very enjoyable 10 day stay at this fine small Inn. Bobby Chng is a brilliant host and made our stay so perfect we have just booked for another 10 day stay during June 2005 at the Inn", "Date": "May 28, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Great location, but....”", "Author": "A TripAdvisor Member", "ReviewID": "UR3428937", "Content": "I had booked 3 days in this inn and 2 days at another hotel...being it my first time in Singapore, I like to make sure I am not stuck with only one hotel. I am so glad I had only book 3 days here and 2 days at a luxury hotel. I mean the inn was located in an absolutely great location in Chinatown, near the bustling shop markets, food hawkers, and MTR station to get to all the other neighborhoods. Quaint looking lobby. The only thing is I had stayed in a single room consisting of a twin bed, decent size bathroom, and a closet...that's about it...no windows, dim lights and guess what, I had to kill 3 baby roaches during my 3 day stay on different days. I was uncomfortable with my bed sheets and cover...kinda moldy...so I didn't really have a relaxing sleep in this environment. If you are not planning to stay in your room too long, this inn is ok for that...just make sure to seal your stuff every time you leave, just in case a baby one might want to hop along on your trip with you.", "Date": "May 1, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Avoid this hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2868655", "Content": "This was my second visit to the Inn and will certainly be my last. The towels were threadbare and dingy. There was mold on the bathroom wall, the bedsheets and comforter smelled musty and were stained. The room safe had batteries removed and did not work. The night clerk was asleep in the lobby and we had to wake him to check in. The air conditioner was on a timer and clicked off every 10 minutes. Plus, the room card operated the air conditioner and had to be removed when exiting the room; thus, it was never really cool in very hot Singapore. Neither the television nor the radio worked. The location was great in the heart of Chinatown and the Asst. Mgr. was very helpful, but this hotel definitely needs improvement.", "Date": "December 7, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Don't Go”", "Author": "A TripAdvisor Member", "ReviewID": "UR2849105", "Content": "I was excited to stay somewhere interesting, but shortened my trip because I had already paid for this hotel! The service was terrible and the internet cost $4.50 for a half hour. The worst part was how dirty the hotel was. One guest found faeces in his bed and when he asked to have his sheets changed they simply turned the bed sheet around. My advice is stay somewhere else.", "Date": "November 27, 2004"}], "HotelInfo": {"Name": "The Inn at Temple Street", "HotelURL": "/ShowUserReviews-g294265-d306180-Reviews-The_Inn_at_Temple_Street-Singapore.html", "Price": "$103 - $128*", "Address": "<div class=\"amenFloat\">", "HotelID": "306180", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/56/be/56bedbfb5f8fec6864845e245b73fb344large.jpg"}}