{"Reviews": [{"Content": "Modern and relaxing resort I stayed at the Swiss Grand Bali (now called the Grand Bali) for 10 nights in April 2008. This is a delightful hotel offering fantastic value for money. I have been to Bali 8 times and usually stay at a different hotel each time. This is certainly one of the nicest and best value hotels I have had the pleasure of visiting. I highly recommend this hotel for single travellers and couples without children. If you are a family, this hotel is probably not suitable as there are not many facilities for young children. I had a pool view room which was enormous and beautifully furnished. The room comes with a king size bed, wardrobe, writing desk and large TV entertainment area with 68cm TV. All fittings and fixtures were 5 star. The bathroom is all marble and has a huge shower and a separate bath. The bathroom was cleaned twice daily and additional fresh towels provided each night if required. The hotel also has 1 and 2 br villas available with private pools and courtyards. There are 2 medium sized pools in the centre of the hotel with most rooms surrounding them. The pools are very well shaded which can be a problem if you are a sunlover. Breakfast is provided in the restaurant overlooking the pool and was of average standard. The service was always good. The hotel is located in Nusa Dua Selatan (South) which is just outside the main Nusa Dua compond but within easy walking distance of shops and restaurants. The resort is not located on the beach but has a beach club which is accessed via a free shuttle every 2 hours from 8am to 4pm. The beach club was disappointing and the beach is not as nice as others in the Nusa Dua area. The hotel has a free hotel shuttle to Tuban (South Kuta) leaving at 10am each day. You need to make your own way back to the hotel. I would highly recommend this hotel for people looking for a modern, smaller and relaxing hotel in Nusa Dua. I previously stayed at the Bali Nikko in Nusa Dua which was a much bigger resort and with direct beach access. I found the rooms at the Grand Bali to be bigger, nicer and cleaner than the Bali Nikko. Also the Grand Bali was less isolated than the Bali Nikko. I also inspected the standard rooms at the Nusa Dua Beach hotel and Melia resort and the Grand Bali has nicer rooms than these properties. I would happily return to this lovely hotel.", "Date": "May 5, 2008", "ReviewID": "UR934036533", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "lucy071"}, {"Content": "Beautiful Place!! The hotel was absolutely breath taking! The room, pool, and other areas were just as amazing! The staff was great! My biggest disappointment was the condition of the beach. I did not mind taking the bus, but it was very dirty (Not so much as garbage but more along the lines of seaweed, twigs, branches, etc. ). Another disappointment, but not as much, was the food. Very limited choices. Also my wife got sick from eating a hamburger. However, there is a main road, at the corner, that has several restaurants, all of which will do anything (even offer you special deals, extras, like dessert!) to get you in. I can't speak for all of the restaurants, but the one we went to was AMAZING. Great quality and tasty! All in all, a great place!", "Date": "Dec 7, 2007", "ReviewID": "UR394285099", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "rexmaden"}, {"Content": "Great boutique hotel Have stayed here several times, great small 4.5 star hotel outside the Nusa Dua compound. Highly recommended if you don't need to be on the beach.Full review at http://www.littlewhiteswan.com/Accom/az09/0701.html", "Date": "Oct 26, 2007", "ReviewID": "UR627471061", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Swanygirlie"}, {"Content": "Bit disappointing Stayed there for 4 nights from 20th to 24th Oct. The service was good and attentive. Rooms were value for money considering the price I paid and also it has small shops nearby which makes it convenient. Service was prompt too. Disappointing in the sense that it is not really as good as it seems. The mall wasn't that near to the hotel. Don't be fooled. The beach area wasn't that fantastic as there is no facilities compared to Hyatt and the Adoya near by. The place seems run down, the walls have cracks, the room with webs at corners and ants were attracted by food in the room. The place need to be upgraded. The bath tub was really worn out and the shower and toilet area are really old. Need to refurbished as the room I stayed in seems tired. The toilet flush not functioning properly when I checked in and the flush always seems to be weak. Overall just a normal hotel. Also food in the hotel was just normal and breakfast just barely made it.", "Date": "Oct 25, 2007", "ReviewID": "UR467886126", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "Lee78"}, {"Content": "Nice Hotel       Lobby area", "Date": "Oct 16, 2007", "ReviewID": "UR794608293", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "doydy"}, {"Content": "Nice ambience and warm people :)", "Date": "May 24, 2006", "ReviewID": "UR436198216", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Chidda"}, {"Content": "Great! Me  my wife visited the hotel for 7 days in early June 2005. The tsunami resulted in us visiting Bali instead of Thailand. We had great room, massive bathroom with balcony  own jacuzzi/ splashpool. We found staff very helpfull  friendly. Keep up the good work!", "Date": "Dec 19, 2005", "ReviewID": "UR127413044", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Disappointing Shabby rooms with shabby sheets, towels, pillows etc. The fact that it is advertised as a beach resort hotel is false advertising- having to go to the beach by bus was irritating as it was always late! There were never any towels at the beach and the food service was apalling!The staff were ok but could be annoying as they constantly wanted to know where we were going!!y This hotel should not be rated as a 4 star hotel, a minus 3 would be more apt.Will never return to this hotel and we won't be recommending it to anyone.", "Date": "Sep 27, 2005", "ReviewID": "UR208038554", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Noisy air-conditioning My wife and I stayed here for one night, and we were unfortunate enough to have a room where the airconditioning was noisy. We arrived at night, and initially, the noise was still bearable, so we tolerated it. But in the middle of the night, the noise became louder, and we woke up several times. So we had very bad and interrupted sleep...we checked out the next day and moved to another hotel (I already booked in advance). The place was nice, quite new, and breakfast was OK. I think our stay there would have been quite pleasant if the aircon was OK.", "Date": "Sep 13, 2005", "ReviewID": "UR202807137", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "3306"}, {"Content": "Beautiful and good value We stayed at the Bali-Aga for four nights in early July. The room was lovely, the air conditioning worked, the bathroom was sensational. The pool area is lovely. The breakfast buffet was excellent. It was good value for the money.", "Date": "Jul 18, 2004", "ReviewID": "UR125271073", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Tek"}, {"Content": "鏈濋銇孏OOD   showReview(19169159, 'full');", "Date": "Mar 2, 2008", "ReviewID": "UR355901720", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉屻偟銉夈偄鍦板尯銇ф牸瀹?#x201d;   showReview(19167199, 'full');", "Date": "Dec 20, 2007", "ReviewID": "UR402529369", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉屻偟銉夈偉銈伄绌村牬銉涖儐銉?#x201d;   showReview(19166660, 'full');", "Date": "Nov 27, 2007", "ReviewID": "UR774463868", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇傘伨銈婃湡寰呫仐銇︺仾銇嬨仯銇熴伄銇с仚   showReview(19161334, 'full');", "Date": "Jun 12, 2007", "ReviewID": "UR463521989", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鎵嬨仈銈嶃仾渚℃牸銇?#x201d;   showReview(19158994, 'full');", "Date": "Sep 30, 2006", "ReviewID": "UR864523537", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297698-d306731-r15689502-Swiss_Grand_Bali-Nusa_Dua_Nusa_Dua_Peninsula_Bali.html", "HotelID": "306731", "Price": "$93"}}