{"Reviews": [{"Content": "I keep going back. Stayed at The Kitano Arms on two occasions, once in September 2005 and then December 2005 and have found it excellent both times. The connivence of having a kitchenette can't be underestimated. We were able to provide our own breakfast and evening meals using the fridge and microwave available. Its located close to two main Subway stations which make it easy to visit all sites in Tokyo. Its also not to far from Tokyo Station which can be reached both by Subway of even a fairly low cost taxi ride (10mins max). On our second visit we got upgraded to a enormous room with separate bedroom at no extra cost. In fact we love it so much I have just booked a third visit over New Year 2009.", "Date": "Jun 14, 2008", "ReviewID": "UR543733087", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "FlapLondon"}, {"Content": "People kept asking how I found this hotel My business associates in Tokyo all asked how I found this hotel because it is frequented by those working with the neighboring government offices as well as long-term stayers. Thanks to Tripadvisor and my imaginary Internet friends!My husband and I were staying 6 nights in Tokyo, so I wanted something larger and more functional than our budget would allow in a traditional hotel. KA fit the bill. For 150,000 yen per night for 2 people, we got a superior studio (B level) on the 7th floor facing the expressway (they said they had reserved a quiet nonsmoking room for me). The room was a great studio--long built in desk, roll out table for dining, sofabed with table, twin beds, built in closets, bathroom, divider, then kitchenette. No divider between living and sleeping areas. Sufficient lighting and lamps.The room was clean (grout in bath showing need for bleach), the beds were comfortable, the air conditioning sufficient, and the double windows did a decent job of blocking noise, though we could hear the steady sound of traffic and the occasional siren and announcements. Construction going on next door, but we were not close to it. Replacing sidewalk in front at night just now.Bathroom door is frosted glass, so not totally private from room. No exhaust fan in bathroom.We used the coin laundry with satisfactory results (100 yen per load and per 15 minute dry) and the iron/board. Made a local phone call for 10 yen. Reliable wired Internet. Flat screen TV with CNN. No supermarket close, but we found decent sized grocery about 15 minutes walk and there's another in Akasaka.We used the Metro a lot, though it is a long walk to the Ginza and other lines through the tunnel or on the surface. We walked to Palace, Akasaka, Honda (Asimo). Area is very quiet on the weekends when no workers around.Staff friendly.Maid service twice during the week.", "Date": "May 25, 2008", "ReviewID": "UR589009977", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Metwo3"}, {"Content": "Comfortable, Quiet, Great Value We were two people needing two beds. We received a very clean, quiet, one bedroom apartment, functionally furnished, utilitarian and not as attractive as the hotel's self-provided pictures would suggest, though we know that more stylish, renovated apartments exist in the building. The lobby is attractive, but smelled of smoke which lessened some of its appeal for us. The small staff is very friendly and eager to help and please. Our apartment was located to the back with an interesting view of a residential neighborhood. The view to the front would be of the street and the elevated expressway the building faces. Our apartment featured a tiny kitchen with a refrigerator, small stove, and a microwave. The bathroom was small, with a shower/tub combination. Good water pressure. The toilet seat was heated to just the right temperature. Everything worked well.An internet connection for our laptop was included. We watched CNN on a small, picture-tube television. The apartment had a table with chairs, a lounge area, and a desk-like space on which to work and use the laptop.The location is quiet and a bit off the beaten path. Restaurants, including a McDonalds and a 7-11 store, are located on the same block. We were able to withdraw cash from the ATM inside the 7-11, but not from another ATM next door to it. The hotel itself has a streetside cafe and an interior restaurant. We tried only the cafe, for their tasty 鈥渟et breakfast鈥?-a good value. We did not try the restaurant. The stores and restaurants of Akasaka are within walking distance, as is the Akasaka Prince Hotel. There is a subway station within meters of the entrance. A post office is said to be nearby.Without an extra fee, maid service is provided less than daily. We had maid service once in 4 nights, but we did not mind considering the price and amenities. Self-service laundry is said to be available. The staff is friendly and eager to help and please, and we enjoyed interacting with them. They vary in their ability to speak English. We enjoyed the convenience and utility of having our own, independent, apartment in Tokyo.", "Date": "Dec 31, 2007", "ReviewID": "UR785557073", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "CoffeeBoss"}, {"Content": "Excellent apartment hotel for the price of a regular hotel room Kitano Arms is an excellent apartment hotel. The Type-B room has morethan enough room for a couple and has a desk and couch. The view was to the backside of the hotel, but this was better than to the front which faces onto the expressway.The fittings and carpet are a bit older, but the rooms are clean and tidy and much larger than any hotel rooms in the 2 or 3 star range. It had a sink, microwave, fridge and cooktop, so, potentially, you could cook your own meals.The immediate area is a business area, not much happening at night. But about 500m down the hill, just beyond the Akasaka Prince Hotel, is Akasaka, with an abundance of restaurants, bars, Pachinko Palaces and other night life. Go there. And a coupld of hundred metres in the other direction is the Imperial Palace and gardens. Overall, an excellent location and an excellent hotel.", "Date": "Apr 18, 2007", "ReviewID": "UR565982266", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Jak_the_Wanderer"}, {"Content": "Wonderful Appartments to explore Tokyo I stayed In a Superior appartment for 14 nights in order to explore Tokyo and the surroundings as well as visiting some people. I had a roome to the backside yard, but this is recommended to the expressway at the front side. If you wish, there is a restaurant and a cafe, which are OK for western travellers. The location is one of the best in Tokyo, because you have direct access to 5 different subway lines. Three convenient stores are located nearby and even a lot of restaurants can be reached within 10-15 minutes by foot.My room was furnished quite good and there was free-of-charge internet access. You have also a direct phone line with your own number and you can phone at resonable rates. If there would have been english TV available, it would have been even better than excellent.", "Date": "May 24, 2006", "ReviewID": "UR624391548", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "AndyJu"}, {"Content": "Better than expected Are you looking for a comfortable, fair price-valued accommodation in Tokyo with good traffic connection? Kitano Arms is a very good alternative.Even the room in standard category is really large enough and good equiped to have a comfortable stay of more than three days.Simply ask for a quite (facing to the back) and renovated room in upper levels (higher than 4th floor) including high-speed-internet access.Everything is clean and well maintained, however, do not expect the newest building standard. The contact and reception is very friendly.Nagatocho-station is closely located with access to Hanzomon-line and Nanboku-line. The underground pathway leads you also to Akasaka-Mitsuke-Station with additional connection to Ginza-Line and Marunouchi-Line.", "Date": "Jun 26, 2005", "ReviewID": "UR789385059", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "weidam"}, {"Content": "More of an apartment than a hotel The Kitano Arms is an apartment building that rents out furnished rooms for moderate-length stays (5 to 7 days minimum). For about the price of a mid-level Tokyo hotel room (JPY13000 plus 5%tax special introductory price booked via Travelocity), my room at the Kitano was about twice as large, and included a kitchenette (burner, microwave, sink, fridge, a simple set of dishes for 2). The main room had a king-size bed (actually two twins pushed together with king sheets, but comfortable enough), separated by a knee wall from a living area with small couch and table, small dining table and 2 chairs, and a good-sized work desk with a high speed dataport. There are sliding paper screens and solid screens in front of the windows (but no curtains on the curtain rod), and a ton of storage space.The condition of the room was not so great. Although the room was clean, the carpet was old, worn, patched, and stained. The closets smelled musty. Furniture was a bit worn. There's no washlet, nor are any amenities provided other than soap. Maid service is provided 2 or 3 times a week.My ninth floor room at the rear faced away from the raised expressway, looking over nearby roofs, and was very quiet. Rooms at the front may not fare so well, as the expressway is extremely close to the front of the building.There is a pool on the roof which is open for limited hours on Summer weekends only, and a cafe on the first floor which seems to be open only for lunch and maybe breakfast on weekdays.There is someone on duty at the front desk at all times, but outside of normal business hours it was just a security guard. All the personnel I met were extremely courtous and helpful, and spoke at least rudimentary English.Location, not far from the Akasaka Prince Hotel, is good if you're on business in that part of Akasaka, but only OK otherwise - there is a subway station at the hotel's front door, but it's still a 10 minute underground walk to the train. Although the size of the room was a wonderful treat for Japan, the condition of the room and lack of services and amenities left me somewhat disappointed, compared to my experiences at other Tokyo hotels. But, for a large no-frills room at a reasonable price, the Kitano Arms may be a good bet.", "Date": "Aug 2, 2004", "ReviewID": "UR336061245", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066443-d307349-r16921544-Kitano_Arms-Chiyoda_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "307349", "Price": "$236"}}