{"Reviews": [{"Content": "Not all Amans are created equally- doesnt compare to Amankila On my trip to bali I learned the same thing that is said about four seasons can be said of Amans - not all Amans were created equally. I came to Bali on the Bali experience through Aman resorts and Amandari was our first stop. Having stayed at Amanjena (Morrocco) our expectations were high. I have to say that I was very dissapointed. The rooms were very dated (the hotel is the second oldest of the aman resorts and nearly 20 years old) - the kind of room you would walk into in the late 1980's and think this is modern and cool, and they havent been touched since then. The room to me looked very run down and and was bleak - not the kind of room that i was expecting to pay 800 dollars a night to sleep at. The common parts I also found very dated, and the place was dead. The resturaunt was fine but nothing particularly special. We did a trip into ubud and again i found the town full of backpackers and people begging you to buy stuff - so much that you didnt even want to go into their stores. The service was good - however I was very annoyed by one thing. We asked the hotel about the four seasons, and they said yes, it is a 2 minute drive down the road. We said great can you give us a lift there as we would like to see it, and they told me the only option was to hire one of their car and drivers and have them wait, and this would cost 50 usd. they also would not call us a taxi, so the only way we could have lunch at the four seasons was to pay them 50 usd for a 2 minute drive!! i think when you are spending 800+ dollars a night this is rediculous. Anyways we went to the four seasons for lunch, and we found it much nicer and less dated (though i must stay still not amazing and if i came back to bali i would not make the journey to stay there either). On the positive side, they let us check out a night early to go to amankila (we only stayed on night at amandari) - and that was AMAZING...we loved amankila (i will write review there next)NB one thing to note is there are no gyms at ANY of the aman resorts on the island of Bali. I didnt come to bali to go the gym, but given it rained A LOT and there was not a whole lot to do in the pouring rain and thunder, I really think hotels of this caliber should have a gym.", "Date": "Apr 4, 2008", "ReviewID": "UR311951176", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "-1", "Location": "-1"}, "Author": "MissLondon"}, {"Content": "resting place for the gods The Amandari is definitely unique: if you expect a standard five stars hotel, don't go there. But if you want to experience a completely different atmosphere, you鈥檒l find that the Amandari is the most wonderful place in Bali, and probably one the finest in the world. Everything there, wherever you look, is pure, simple and beautiful, from the entire compound to the smallest detail in your room. The Amandari is not luxury, gorgeous and rich: it's better than that. You'll find subdued elegance everywhere, harmony of lights and shades, colours and scents, polished marble with rough stone, beautiful teak wood architecture, a mix of balinese original style with a japanese touch throughout the pavilions, paths and lanterns. And you'll experience something like a higher kind of civilization. The place looks like a wonderful traditional balinese village, in the Bali Aga original style, where you are greeted as if you were coming back in the family after a long trip. The landscape is beautiful, with terraced rice paddies over a deep gorge and the Ayung river, where you can make a beautiful trek through the bamboo groves, sometimes crossing the river by walking trough a waist-high water. The pool overlooks the entire view, and while entering it, you'll see the entire landscape floating over the water surface. At night, gamelan musicians play in the pavilion over the pool, creating a timeless atmosphere, while the perfume of frangipani flowers spreads behind the thatched roofs of the buildings. The place is so peaceful and serene that you instantly feel relaxed. The suites are delicious, each of them being a small villa in itself, with its own porch, traditional aling aling wall and courtyard, garden terrace, outdoor bath, and private pool (for the most expensive ones). You can completely remove the wood and glass sliding doors, if you like, so the entire villa is open to nature. The service is very nice, and everybody will care about you, while you鈥檒l get accustomed to the sound of the bamboo bell they use when coming at your entrance door. Sometimes, villagers will silently walk just under your terrace, holding alang alang or bamboos, for the place was not intended to be cut from the life of the surrounding country. The cuisine is very good, even though a little bit expensive, but a private dinner in your villa is really worth experiencing. Far from the international nonsense atmosphere of the coast, where you hear the same kind of music everywhere and everytime, sometimes wondering why you did make such a long trip to face what would bother you anywhere else in the world, Ubud is the cultural center of the entire island. Nowhere else the wonderful balinese culture is so much alive, small children dancing at night in the temples when they hear the lively Ke莽ak rhythms. While looking at the pathways between villas at night, lighted by small japanese style lanterns, I remembered the Tale of Genji, an eleventh century novel about the love stories of a japanese prince. A Balinese Genji would have liked this place, and would have felt quite at home there. And that鈥檚 also the feeling you鈥檒l have, no matter the kind of existence you have in everyday life. I love grands hotels, and I try to stay in one of them whenever I can afford it. But I never experienced anything like that before. The Amandari is not a hotel: rather something like a resting place for the gods.", "Date": "Feb 28, 2008", "ReviewID": "UR217284799", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Pimmmms"}, {"Content": "Dated...Don't Bother Aman resorts have always generally really impressed us. Their service, standard and setting.However the Amandari lacked the polished service typical of Amans.The resort was rundown and dated (the rooms and the public areas).The food was not good.And it was the same price and advertised under the same guise as other Aman resorts which makes no sense. How on earth can the Amankila cost the same as the Amandari!!??This hotel is really not worth the money, if you want to stay in Ubud, stay at the Four Seasons Sayan next door. It is much nicer and much more up to date and well-mainatined, we opted to spend our New Year's Eve celebration here instead.We left the Amandari early.", "Date": "Jan 9, 2008", "ReviewID": "UR243999984", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jetsetter87"}, {"Content": "Genteel Balinese pampering One feels as if one is staying in a beautiful Balinese village. Staff are wonderful. Our pool villa was magnificent and authentically imbued with all the smells, colours and design elements which remind one of this beautiful island.", "Date": "Oct 21, 2007", "ReviewID": "UR614254164", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Amanvari"}, {"Content": "Overpriced for what you get. We just came back from 3 nights at Amandari and 4 nights at Amankila for their Bali Experience Package. Amankila is wonderful (read my review there) but Amandari is only so-so. We had pool suites at both resorts so we can compare the two.Amandari is a little dated and looking worn down, which is surprising because we were told Amankila was older than Amandari. There are only two recliners by the pool and one small umbrella (whereas at Amankila, we had two recliners in the sun, a queen recliner located in the shade and also an outdoor daybed). Needless to say, this was irritating. You would have to move your recliner to chase the sun/shade. They were also dated and the pads were old and not very nice. The lack of privacy was also a problem. If we leaned over our fence or even stood in the right area, you could see our neighbours in their pool area. Also, we were in a pool terrace suite and they are surrounded by pool duplex suites (which are two stories) and they could look into our outdoor and pool area, not making it private at all.If you are a couple looking for romance, do NOT go here. We encountered at least four families, with kids of various ages. There was even a baby under one here. Dinners are ruined by crying babies. We also did a sunset coffee/sweet excursion (one of many included excursions to chose from) and it was ruined by kids jumping, splashing and screaming at the pool. Overall, it was only okay. It was quite expensive and was not as good as Amankila or Amanjiwo. This is our 5th Aman resort that we stayed at and it does not rank near the top. (I have also reviewed Amanjiwo). For what we paid, you have many more choices in Ubud-hotels which are newer and nicer and cost less.", "Date": "Sep 28, 2007", "ReviewID": "UR226564621", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "likesthingsclean"}, {"Content": "A terrific experience-skip the Four Seasons!       Our room at Amandari", "Date": "Sep 14, 2007", "ReviewID": "UR207358811", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "strickles"}, {"Content": "A lovely place!       The tadpole pond", "Date": "Jun 4, 2007", "ReviewID": "UR106552293", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "KOinCT"}, {"Content": "A wonderful place....       amandari main pool", "Date": "Mar 30, 2007", "ReviewID": "UR843900999", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "ccrr77fr"}, {"Content": "Paradise! We went to Bali on our honeymoon and did the Aman Bali experience. While Amanusa and Amankila were amazing (they upgraded us for free to the honeymoon suite at Amankila for free!) Amandari was our favorite. The rooms were absolutely gorgeous, the service was prompt, courteous, and kind, and Ubud was our favorite spot in Bali. We will definitely be back!", "Date": "Jan 9, 2007", "ReviewID": "UR416323069", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cooseone"}, {"Content": "Unbelievable       amandari: pool amenities", "Date": "Jan 6, 2007", "ReviewID": "UR652412430", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Matt321"}, {"Content": "Beautiful resort but glitches in service Amandari, as with most Amans, was beautiful and tranquil. The rooms have almost panoramic floor to ceiling glass that slides all the way open, so you feel like you are in an open courtyard with the bedroom, living area, and pool all in one large fluid area. There's a separate rain forest shower and toilet and there's also an outdoor tub. We tried the restaurant and bar on several occasions. The drinks were great and the food was pretty good but not a must have. The spa was somewhat utilitarian, but there are several other beautiful spas near the resort. Overall, our experience was very pleasant. My only mark against this property was that during our entire stay, the staff did not observe our do not disturb sign on the door. We just wanted to do nothing and relax in our room, but there was always someone knocking at our door- to bring us a complimentary snack, to turn down our bed, to bring us the newspaper, etc. We even saw staff members come into our pool area to light candles around the pool area while we were in bed! Now this may all be because they are trying to provide excellent service, but remember we had the do not disturb sign on the whole time and the room had floor to ceiling glass- so we can see the guy lighting the candle outside and he can see us in bed! It was just a little unsettling and definitely interfered with my enjoyment and ability to relax.", "Date": "Nov 30, 2006", "ReviewID": "UR216018262", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "angel_valentine"}, {"Content": "Your new favourite hotel/resort chain Don't you just love it when you wake up in a hotel room and have no idea what time it is because the room is so dark? Not that this is a hotel room by any means, this is your own very secluded villa, set amongst rice fields in the heart of Bali.When you do decide to rise, you can wonder around your room, taking in the views and the quiet drone of work and play, but if it's your first day, I would suggest calling for breakfast in the villa before you get too excited.Wonder down your spiral staircase into your dressing room, and you'll notice the tranquillity of your very private outdoor tub, the spacious shower and your Mr  Mrs vanity and storage areas.Take a walk outside (don't worry about dressing - no-one can see you) and soak up the warmth of the sun, and the stillness of your very own beautiful infinity pool. Take a dip and from the edge of the pool, watch the workers tend to their rice.... dry off on your freshly laid towel and don your complimentary robe and slippers - they actually fit!Enjoy a leisurely breakfast (delivered and laid out by your waiter) by your pool, or indoors in the lounge that's most likely bigger than the one at home. Some music provided by the bose system will I'm sure suffice - did you bring your ipod? If not, borrow some cd's from the library.If you do decide to leave your villa (and you really don't have to), you will be welcomed by a host of staff, who will know you by name and ask if your breakfast was enjoyable.Fancy a book? Some internet surfing? Head for the library for some interesting texts and dvd's for tonight if you're planning an early night!! If you feel like a massage, or the ultimate in reflexology by a blind man who knows everything about you from the way your feet feel, head for the spa.If this seems a bit slow for you, book the white water rafting experience for the afternoon (or maybe tomorrow). The river runs just below the hotel, so its literally on your doorstep, and a lot of fun - even if you don't like getting wet. If shopping is your thing - ask the driver to take you to Ubud and buy some paintings, hand crafted furniture or local produce at good prices.Afternoon cocktails at the bar, or by your pool, and then you must try the 'Special Balinese Feast'!. If you don't already feel like royalty, then this is the deal clincher. A private dinner just off the restaurant with your own waiter and an abundance of candles and petals. But before you begin, you'll be treated by the local village children to a taste of Balinese dancing.Of course, you don't need to stay in the hotel - you can venture out and explore Bali, and the local villages - I would recommend Ubud. The hotel staff also have a great list of local restaurants if you want to vary your choices during your stay.This hotel is both exquisite and 'environmentally' friendly in that the staff there have been mostly employed since the hotel opened some 15 years ago. Don't let that put you off - you won't believe it until someone tells you how old it is - it looks like it's a year old. They embrace the locals, encouraging them to work at the hotel, and make use of the hotel by displaying their art, local gifts and entertainments.The Balinese people are some of the friendliest I've ever met. They really do care, and strive to ensure you are having the holiday you dreamed of....and more.This is by far the best resort type hotel I have stayed in, because of the privacy, attention to detail, and also the amenities. Now I just need to try all the other Aman resorts!!!!Enjoy!!!", "Date": "Jul 5, 2006", "ReviewID": "UR339817065", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "LovieLoverson"}, {"Content": "Review of Amandari from a journalistic viewpoint I am a freelance journalist from Singapore and I have read most of your reviews on Amandari. Here's my 5 cents worth: I was in Bali last year on a series of spa resort reviews and Amandari was one of the few resorts I visited / reviewed. Besides the gorgeous views of the Ayung, gracious service, free limo rides, great food (though costly and limited selection) and enormous villas, I was most impressed with Amandari's cultural heritage. [------]For a unique spa experience, get in touch with the spa and request for a foot reflexology treatment in the comfort of your room by Pak Wayang (a blind foot reflexologist). Though painful, the treatment is very effective in easing away aches and pains (ironically) - my husband has testified to that!", "Date": "May 30, 2006", "ReviewID": "UR467163917", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent service - makes you feel special Lovely place and excellent service. Even the general manager makes an effort to greet guests and make them feel welcome. I think this must be setting an example for the rest of the staff provide. All staff were always smiling, friendly and welcoming. If you want to feel special, go to Amandari. Dont make the mistake of going to Amankila.", "Date": "Apr 10, 2006", "ReviewID": "UR471141424", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wow! Really incredible service. I noticed that no one has reviewed the Amandari yet on trip advisor. I stayed there a few years back, and I think I can say, it was my favorite hotel experience ever. I had heard about the Amandari for years and had very high expectations. I remember arriving, and at first glance, was not being particularly impressed by the setting or architecture. But it slowly won me over. It's really a magical place and I'm not sure how to describe it. It is set up to look like a traditional balinese village. It blends well with the natural surroundings. Every detail you can imagine is taken care of. They change the flowers/fruit/and decor of the room (by sliding panels in and out) twice a day. Your garbage can is always empty. At night, there are always presents on your pillow, fragrant flowers, and soft balinese music fills your bungalow. The service is exceptional, they will drive you anywhere and do anything you could possibly ask of them. They even paid a local artisan (after we left ) to finish a furniture piece we comissioned. They checked on it's progress, and arranged shipment to US for us when it was finished months later. I was amazed! Oh. And if you are going to Bali. Stay in Ubud. It is a wonderful commmunity and much more interesting than the beach areas.", "Date": "Mar 1, 2005", "ReviewID": "UR473212479", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "锛掑害鐩伄Aman       閮ㄥ眿", "Date": "Jan 7, 2009", "ReviewID": "UR323355912", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "amanayus"}, {"Content": "鑱栥仾銈嬫．銇х檼銇曘倢銇俱仐銇?#x201d;   showReview(19876140, 'full');", "Date": "Sep 8, 2008", "ReviewID": "UR765277452", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "tabisukidaisuki08"}, {"Content": "銇俱仧琛屻亶銇熴亜銇嬨倐銆?#x201d;   showReview(19170716, 'full');", "Date": "May 2, 2008", "ReviewID": "UR175562821", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈優銉炽儉銉伅銈炽儐銉笺偢...   showReview(19925525, 'full');", "Date": "Feb 27, 2004", "ReviewID": "UR268225916", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈︺儢銉夈偉銇北濂ャ伀銇层仯...   showReview(19920827, 'full');", "Date": "Aug 28, 2003", "ReviewID": "UR582864176", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d307591-r14792258-Amandari-Ubud_Bali.html", "HotelID": "307591", "Price": "$867"}}