{"Reviews": [{"Content": "Friendly Hotel with Great central location. Landed in Berlin without accomodation for 5 nights.. Directed to this place by a booking agent in Europa Centre. First night paid 33Euros for a room at front which slept four (only two of us!) bit unsure about the shared bathroom at first - turned out excellently clean. Decided to stay for rest of hols although upgraded to with en-suite at the back (cant remember price)Rooms - high ceilings and bright walls mean its really airy, basic carpet, beds real comfy and very clean. No tea/coffee stuff but clean towels and a maid service. If you get breakfast - buffet style loads of bread rolls (Yum) and different meats and cheese, cereal etc. Try and get quiet room at back as street noisy in AM.You geta key which serves your room, the door accessing each floor and the main front door. Staff are very friendly/helpful and spk English.Transport - Kurfurstendamm u-bahn (U1) 200m will take you Mockenbrucke, then change onto U7 to Rudow if heading to Schonefeld Airport (2.10 Euro, 50 mins) and reverse if heading into city. Great links across the city east  west.Location - right across from Europa shopping centre, Fab shopping on Ku'Damm and in KaDeWe. Zoo nearby.Food - Maredo steak restaurant right below hotel (till midnight), 2 Italian restaurants across road, Curryworst stall and kiosk just outside. Out of hotel and turn left small bars further up, more bars on KuDamm and in Europa Centre (Irish Bar downstairs).Dunkin Donuts and Pizza Hut 5 mins walk.Summary - good friendly basic place to stay (very popular with all nationalities) - will be going back in 2 weeks :-)", "Date": "Sep 20, 2007", "ReviewID": "UR800644537", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "dtstuff"}, {"Content": "superb place to stay All the other reviewers have already said how great the location of this place is. And I totally agree.So I would like to comment a little on how well organised the hotel is and how friendly the staff are. On arrival we recieved a room key which works the main outside door, the door to our floor and our room. This means that you can come and go 24 hours without bothering the staff. Many hotels in mainland europe require you to leave the key at reception when you are out, and sometimes they have 12 key fobs or bulky things attached which you wouldn't want to lug around all day. Not so here, a small security key with a small plastic tag.We spent a full 7 nights at pension korfu II and could have happily stayed for longer. We pre-paid for breakfast throughout our stay, and it was a good continental buffet ( warm hard boiled egg, cheeses, cooked hams, crusty bread rolls, cerials, youghurt, apples, oranges ). They even have a selection of electric toasters around the dining room, and provided nice sliced white toastable bread as well as german dark bread. 拢4 a day each I would have paid that for just the lovely unlimited coffee.Next to the front door is a shop which sells currywurst, chips and other snacks, coffee ( up to about mid afternoon) and beer, so if you want a quiet evening you can ride down the lift and top up. There is a restaurant opposite if you would prefer. also the huge bookshop nextdoor on the left does good Capuccino.In the main office is a free internet terminal which is easy to use. The staff are all lovely, half of them speak fluent English and the rest can get by ok.Our room was large and warm with an enormous double bed. They provide a TV which has only german channels but I soon got used to that. We had an en suite room with shower basin and toilet and it had it's own hot water boiler which is adequate for one shower, you have to allow it to recover, or be quick if 2 of you need one.A quick word about Berlin it is a modern and clean city, and one of the few places I have visited where I have thought about not going home.Pack your walking shoes, although there are hundreds of stations on the enormous public transport system, you walk miles along the subways and platforms.highly recommended ...", "Date": "Apr 2, 2007", "ReviewID": "UR174045697", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "regulartravellerfrom"}, {"Content": "Great Location Great Location, slap bang in the middly of everything, near great transport links for the underground (U) and overground (S) and buses (100, 200). The hotel was basic but clean with large rooms, the breakfast was basic (continental style) but filling and plentiful. There is free unlimited internet access (something I have never seen in a hotel, a fantastic touch) in reception which we used to find a great Jazz club(budchen hof musikcafe I think) and had a fantastic night out there for only 13E. The food in Berlin is varied and fantastic, we ate something different every day. The italian across the road from the hotel was cheap and quick. plus the countless Bratwurst stores for a qucik snack.I would recommend you take a good street map and tube map everywhere as although the transport system is efficient and cheap it is a little confusing! Not really sign posted as well as it could be and no station assistants for guidance. We flew to Schonfield Airport and took a train into berlin straight from the airport, despite this -none of the train station signs/time tables were in english there were no assistants and we had no idea which train to catch for a good 10 minutes..A lot of people looked lost at the same time as us. But we got there in the end.I also noted a lack of tourist offices in the city so we were a little lost for what to do on our last day and just hopped on and off trains. Take a train to Postdam and visit the Sansouci PArk and Palaces of King Fredirick this was a beautiful town and a good half day trip. Also the East Side Gallary is very good for taking pictures of the Berlin wall with good graffiti. Its a lovely, clean, safe city with friendly people, would recoomend the city and the hotel.", "Date": "Mar 25, 2007", "ReviewID": "UR674077527", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "ZoeEnfield"}, {"Content": "Great budget hotel", "Date": "Aug 3, 2005", "ReviewID": "UR367021229", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "applerain"}, {"Content": "Korfu II hotel - great choice in West Berlin Too bad we only had 2 nights to stay in Berlin, as we had a great time in that city. Korfu II hotel is located 5 min walk from the ZOO station, next to Europa Center. Rooms are very clean, high cellings give extra space, and bathrooms are spotless. Also the breakfast was a great treat, as it was pleantiful and very tasty. We paid 99 Euros/night for a tripple-room, incl. breakfast. Considering prices in Berlin, it was a good deal, and we will stay there next time. Also, I would recommend to take a ride on the regular city bus #100 and #200 (bus stop in front of the ZOO station for both, and you can do the loops on them, as they have a slightly different routing), as they go by all of the tourist attractions, and you can get on and off as you like. Make sure that you purchase a Berlin Welkome Card (19 Euros) that is good for family of 4, and gives unlimited city transit traveling, plus discounts to some attractions, plus more. And last but not least, if you are traveling with teenagers who like skateboarding, make sure you come in the evening to the plaza in front of Europa Center, as you may witness how few guys show off their skills in skateboarding, and I must say, Tony Hawk watch out, there is a great talent in Europe.", "Date": "Aug 6, 2003", "ReviewID": "UR600513041", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "DorotaK"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187323-d307973-r8825889-Hotel_Pension_Korfu_II-Berlin.html", "HotelID": "307973", "Price": "$77"}}