{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bern, Switzerland", "Title": "“Great staff in a very nice place”", "Author": "2togo2010", "ReviewID": "UR128508900", "Content": "In 40 years of travelling we never have been received in a hotel as cordially as at Louisa’s Place. During our whole stay, everyone – from concierge to night porter to the cleaning ladies – was exceptionally friendly and helpful. When we arrived, our luggage was instantly taken care of and check-in didn’t last more than two minutes. The second day (of five days) we had some complaints about a very loud ventilator in the attic. Within the shortest of times we were offered another room (which was even more spacious and sunny than the previous one). For the transfer we only had to repack the smaller things, everything else (like clothing on hangers) was taken care of by the staff. Both suites we came to use faced a quiet backyard with a huge chestnut tree (the rooms facing the Kurfürstendamm might be less quiet) and consisted of a bedroom, a big bath, a big drawing room, a kitchenette (in one suite) or a separate kitchen (in the other) and a small balcony. Although Louisa’s Place is situated about 2 – 4 km from the centre (Zoo / Potsdamer Platz), it is ideally located. You can start shopping right at its doorstep and the metro station and the bus stop (served by 4 lines) are only 200 m from the hotel.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Wunderbar”", "Author": "Escoceses", "ReviewID": "UR127672052", "Content": "We spent a week in this wonderful hotel. The staff could not have been more friendly or more helpful. The level of service really lifts this hotel above the usual. Their recommendations for restaurants and sightseeing were just what we were looking for. The room(s) were spacious and comfortable, the kitchen well equipped and a quick trip to the local supermarket meant we enjoyed leisurely breakfasts in the comfort of our room. The swimming pool was lovely. Louisa's Place is on the Ku'damm (designer shops as far as the eye can see) in the Charlottenburg district which has a great choice of bars and restaurants. The hotel is a 2 minute walk to the nearest \"U\" Bahn station and a 10 minute walk to the Charlottenburg \"S\" Bahn station so central Berlin is easily accessible - we travelled into the centre most days and it couldn't have been easier.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Carefull when booking...”", "Author": "Al F", "ReviewID": "UR126250965", "Content": "It's a nice hotel but they play rate games when you arrive. I had a printed confirmation rate of 155 Euro per night for two rooms which they changed to 210E and 220E. After I double checked it they reluctantly agreed to change one room but not the other. They're very clever at doing this so beware! I would only book this hotel book with a rate guarantee company not a travel agent if I were you. A. Fleitas Philadelphia", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Home away from home”", "Author": "IvanaP603", "ReviewID": "UR125859780", "Content": "These charming apartments, in a typically Berlin style house and located in Berlin's wonderfully luxurious Ku'damm neighbourhood, make you feel right at home. The hotel offers good facilities, including a well equipped kitchenette. Very good location, with a wide selection of restaurants in the vicinity, as well as fruit and vegetable markets, as well as bakeries for convenient in house dining. Some of Berlin's sites are within walking distance and others easily reached by bus or subway, all in close proximity of the hotel. The rooms are very comfortable and spacious. The staff is friendly and efficicient. These apartments are a very good alternative to a traditional hotel, indeeed a home away from home!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "yorkshire, England", "Title": "“Want to feel like a Berliner?”", "Author": "ZoeB2141", "ReviewID": "UR124905201", "Content": "This hotel is a complete home from home. The apartments are fabulous, large, airy and equiped with everything you could need for a few days in the city. The location is perfect for shopping, sight seeing and attending conferences, even just being able to reach the airport with relative ease. The transport is exceptional in Berlin and buses and undergrounds are just short walks away from Louisa's. The nicest thing about this hotel however is the staff, they are exceptionally nice and very helpful, if we wanted to find how to get anywhere they got out a map and drew us a route. The only downside was the inclusive breakfast, not much to choose from, only hot option was egg, egg or egg and there were fruit flies on the fruit basket. other than that perfect.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Wow!”", "Author": "msverble", "ReviewID": "UR124904376", "Content": "This hotel has everything. Perfect location, wonderful staff, attention to detail. You could not do better in this fabulous city.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great place to stay in Berlin”", "Author": "RJT456", "ReviewID": "UR124794652", "Content": "We stayed here for a number of days. The hotel was excellent - extremely clean and very spacious. The staff were very helpful - printed up maps for us, did the online booking for our flight etc. The location was excellent - shop opposite if you need to buy any food. Very close to both an S and U line. It is also ideal for a number of restaurants. We had not been to Berlin before but found this an excellent place to stay.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“fantastic”", "Author": "thamido", "ReviewID": "UR124306450", "Content": "very nice, friendly staff, fantastic location in Kudamm , warm welcome when we arrived, our room was spltlessly clean and the beds were comfortable.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Excellent Hotel”", "Author": "Kerry L", "ReviewID": "UR121828045", "Content": "This hotel is delightful! We were greeted with the warmest welcome when we arrived. The staff were friendly, professional and had masses of useful tips and information about where to go in Berlin. Our room was spotlessly clean and the beds were comfortable. The service was exceptional and when we asked for one more duvet and a pillow and there were received immediately. The breakfast was excellent with lots of bread, pastries cheese, meat and fruit. We always came away full! We would definitely return to this hotel.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lymington, United Kingdom", "Title": "“Delightful hotel on the Ku'damm”", "Author": "mercury50", "ReviewID": "UR121667494", "Content": "A charming hotel, delightful staff and spotlessly clean apartment. The staff could not have been more helpful at reception and also in the breakfast room. Our room was a one bedroom suite with kitchen and small lounge containing everything we needed. Very comfortable beds with cosy duvets. The breakfast was a delight, delicious scrambled egg cooked freshly to order and the best breads, rolls, pastries all very yummy. I just love these breakfast with hams and cheeses for me the best meal of the day. The hotel is very close to public transport but it is a little out on a limb for the museums but unless you want to go back to your hotel for a rest in the afternoon this is not a problem. We loved Louisa's place and would happily return again.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tamworth, Australia", "Title": "“Gem in Berlin”", "Author": "79aussietraveller", "ReviewID": "UR120977950", "Content": "Louisa's Place is an absolute gem. The hotel is delightful. The staff are absolutely fantastic - nothing is a problem. The location is brilliant for shopping, site seeing and eating places. Berlin is a wonderful city and exceeded my expectations. We had 3 days but you could have more and easily not see everything. The guided walking tour was brilliant and they direct you to many many things that can be done within the city for little if any cost. My advise would be to do the guided walking tour first and then focus on the highlights they bring to your attention over the next few days of your stay in Berlin.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“Exceptionally clean, very helpful staff”", "Author": "Scribbly1", "ReviewID": "UR120420833", "Content": "We found this traditional styled hotel to be extremely clean, and finished to a very high standard. In fact, I raved about its cleanliness to anyone who would listen. It is on the Ku'damm, in quite a posh bit, and has excellent public transport links to the rest of the city. I would dispute other reviewers who say it is a bit far away from anywhere because the bus stop from Tegel airport is 100m away and a bus runs every 10 mins, the U=Bahn stop 'Adenaur Platz' is also 100m away, and buses into the 'busy' part of the Ku'damm run almost continuously from outside the front door. If you get a day pass you can use all this public transport very easily. The rooms were huge, and we were unexpectedly in an apartment, which had a dishwasher, 2 TVs, pots and pans, big fridge etc etc and was lovely. The staff were incredibly helpful, and still had tradtional values of service to the customer. Breakfast was a cold buffet with lots of choice and was delicious. If I could afford to stay there again I would!! Loved it.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Apartment in Berlin”", "Author": "BrianGC", "ReviewID": "UR118362922", "Content": "Based on Berlin's fashionable Ku'damm the apartment was luxurious, quiet and very comfortable. The addition of a kitchen gave maximum flexibility whether to eat out or stay in. The staff were very helpful and on-site in the reception area. The gymn and swimming pool were modern, clean and the icing on the cake.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“A nice hotel a bit too far from the centre(s)”", "Author": "FlyingFinn", "ReviewID": "UR118259667", "Content": "Cozy, very friendly, a bit old-fashioned/traditionel boutique hotel. Tranquil surroundings, but bit of a walk to K'dam's busier parts, and quite an travel to any other part of the town. If you travel for the first time to Berlin, perhaps a hotel in the Mitte area or even in the east side of the city would be a better starting point. If you prefer modern interiors (and want to stay in this part of the town), try Swissotel or Concorde. On the other hand, with children this might be a good option.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Good location with spacious rooms”", "Author": "Paldrevl", "ReviewID": "UR117212196", "Content": "Perfect location and facilities for long stays due to apartment like rooms. Also perfect for bringing children due to the spacious rooms with kitchen facilities. Only thing missing is air condition on the bed room.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Wonderful boutique hotel with great service”", "Author": "FrankandJones Posted by an OctopusTravel traveler", "ReviewID": "UR116841984", "Content": "lovely helpful staff, enormous room, great pool - only downside, breakfast too expensive - no issue as plenty of lovely places around to eat in any case. Overall superb...", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Recommended hotel”", "Author": "Ruth201181", "ReviewID": "UR116199443", "Content": "I had emailed the hotel prior to our trip to enquire the best way to travel from the airport. I received excellent directions which led us straight to the door . On arrival we were given an upgrade. Our room had a balcony,separate bedroom,ensuite,sitting area and a kitchenette.It was lovely. The staff were very pleasant and helpful. There is a swimming pool in the basement and a small gym. What we really liked was the area we were in. Lots of restaurants to choose from and the city centre is only a short bus or train ride away. If we return to Berlin we will definitely stay here again.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Manchester", "Title": "“The best apartment hotel we've seen so far”", "Author": "Janric55", "ReviewID": "UR115983373", "Content": "This is classed as a hotel, but is actually an apartment within a hotel. There is a pool and fitness suite free to use in the hotel - half an hour's notice and you can use the sauna as well. The whole experience was delightful, staff greeted you personally by name and the entrance to the hotel was securely locked with your own personal key, as well as one to your apartment. I never used the front door key, as soon as the staff saw you coming they had the door open before you got there. Breakfast was available but the apartment was fully fitted with a large kitchen area, including dishwasher - there was even a free laundry room in the basement. Consequently, allow the apartment cost more than we would normally spend, we saved a fortune on breakfast in and even had several evenings Meze style with wine, meats, breads, cheeses etc. Loads of very cheap lidle and aldi type stores in the area made it very cheap to eat.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "sydney", "Title": "“hard to fault it”", "Author": "francoislepelerin_10", "ReviewID": "UR115407869", "Content": "10 days and we felt part of the hotel-friendly staff, great advice, nothing too much trouble. it was wonderful to come home footsore, and unwind in the pool--the situation is no problem, with buses virtually at the front door,and the zoo interchange 5 mins away. we would certainly stay here again if we return to berlin", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Alton, Illinois", "Title": "“Grand Suite was spectacular! Great spa & pool too”", "Author": "julie h", "ReviewID": "UR114940183", "Content": "Stayed with my 2 kids and the service and the suite were fantastic. We stayed in a Grand Suite and had a large entry foyer, huge living room with fold out sofa with tv and dvd player, huge bedroom with king bed and tv, and galley kitchen with small balcony with table and chairs for eating outdoors. The bathroom was large with a shower and all the other amenities (no tub). There was lots of storage in the suite including a safe. There was no microwave which is good to know but we did not mind. Beds are really hard (typical in Germany) and pillows are thin but if you ask for more pillows they will arrive instantly. The place was very clean and posh and had great housekeeping service. Our suite had a lovely view of the street below. Area is a very upscale neighborhood with grocery around the corner for making food in your kitchen! There was free wired internet and wifi for 5.95 Euro per day which is a great deal. The desk staff were very helpful in every way. The pool was like a dream. Loved the sauna too! Did not try the exercise room because trekking through Berlin was enough exercise. Would stay here again for sure!", "Date": "July 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Charming, friendly, warm and quiet hotel”", "Author": "Pietro1970", "ReviewID": "UR103400710", "Content": "Travelling with my wife and my six year old daughter I have been delighted by the warm environment of this hotel and the warm, friendly and professional personnel. The room was very functional, quiet and clean. The position is perfect to reach the Zoo at walking distance (15 minutes in a nice avenue) and close to a Metro station. Good breakfast. Swimming pool very charming. Gym club small but nice, clean and with good devices. Very recommended.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly hotel with large rooms”", "Author": "LeChat76", "ReviewID": "UR99772254", "Content": "This hotel is located centrally in what would have been the old West Berlin and as such is slightly further away from the tourists areas of Unter den Linden, Brandenberg Gate, Alexanderplatz etc but it is very well served by the excellent U-Bahn stop at Aderneurplatz and a S-Bahn station which is a 10 minute walk or a short trip from the U-Bahn so it's not really an issue. Kurfurstendamm is a long street that heads toward the Zoo and is a pretty trendy street with lots of boutique shopping although the hotel is located on a slighlty quieter stretch The hotel itself is excellent, the staff are really friendly and go out of their way to help. We arrived early and whilst the room was not quite ready we were invited to check in, refresh and relax a little. The chap at the front desk also gave us a quick guide after asking us what we wanted to see, a few hints and tips and directions. The room we had was more like a large studio, in fact it was probably the size of an average converted one bed flat in London! The hotel is clean, well decorated quiet. The only thing I would say is that it is slightly further away from the tourist areas of the new Berlin but that's not always a bad thing!", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "malta", "Title": "“very good place to stay in berlin”", "Author": "jbianco", "ReviewID": "UR85969285", "Content": "this is a very good hotel to stay in berlin with family. we just returned from five nights and it was a very pleasant stay. the suite we had was very comfortable. two good size bed rooms , one with dinning area, separate kitchen with all necessaries. huge shower room and balcony. location is 10 min away from u station , 5 min away from supermarket , and in a very good road for shopping. staff is very helpful and friendly, good spoken english . my kids where calling the place their home. .... pool in the evening was a very good bonus for all family . on the down side. the pillows. .... actually i don't think you can call them pillows, they are flat and very uncomfortable. also the price for breakfast , i think it is on the high side at 20euro . i would surely stay again if visiting berlin, and would highly recommend it.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excellent option for families”", "Author": "cinanina", "ReviewID": "UR85504882", "Content": "I stayed here mainly because I was on a business trip but since it was for 2 weeks I decided to take my family along with me and I have 2 small children. The option of having a kitchen and a pool or the children to play while I was working, seemed good. The staff was perfect, professional and extremely helpfull, they went out of their way to satisfy every need. The pool area and the living room are brilliant and the room was really an excellent appartment, truly confortable and spacious with all the amenities a family could wish for. The only thing we didn't find so convenient was the location since it ends up beeing very far from the places we were visiting and the fact that there were no supermarkets nearby. There is a convenience store on the other side of the street but it is very bad and totally unsuitable for family shopping, rather more centred at beer/beverage/cigarettes than selling bread or even milk. So, this ended up beeing very complicated. While we stayed at the hotel, we never encountered a normal supermarket with all the inconvenience this can cause. The subway station nearby was also not very usefull, with strange connections. The buses were also scarce and driving around Berlin for small connections (eg after walking to the bus station and waiting for the bus to arrive it will take you 15 minutes to drive you to the zoo station which is a 30 minute walk), so we ended up taking taxis for the whole stay or just walking but this ended up beeing very tiring and expensive.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "wizard of essex", "Title": "“Super-size Suite - Huge Hospitality”", "Author": "gandalfwizardofessex", "ReviewID": "UR76531937", "Content": "We arrived 3 hours before the rooms were due to be ready - 'No problem, sit down, lets talk about what you would like to do in Berlin'. Twenty minutes later, armed with maps , directions and invaluable advice, we entered Ku'damm feeling refreshed, reassured and certain that we had made a good choice of hotel. This standard if service was effortlessly maintained during our four-night stay. We were up-graded to a de-luxe suite which contained a large double bedroom, hallway with ample storage for all our clothing, a bathroom bigger than some city hotel rooms that we have stayed in, a lounge,a fully fitted kitchen and balcony. It was simply huge. The rooms and the hotel in general are simply and elegantly furnished in a syle befitting the heyday of Berlin in the 1920's/30's. A pleasant swimming pool, sauna and mini-gym are available in the basement. Breakfast was the usual continental affair with cold meats cheese, rolls, fresh fruit and preserves. The breakfast room was opened up onto the street in the evening and transformed into the Balthazar Restaurant. Perhaps,shamefully, we never tried this. Before unification, this hotel would have been situated in the centre of West Berlin. Since the wall has come down,however, it seems that this centre has moved east to the Brandenburg Gate area. Berlin holds endless fascination to anyone who has an interest in the history of Europe over the past 70 years. Public transport is fairly easy to use and purchasing a Berlin Welcome Card saves the bother of buying tickets as you make your way between your chosen destinations. A welcome card for five days which includes Potsdam, gives free travel on all U-Bahn (Underground),the better S-Bahn (Overground Railway), All buses and trams in Berlin and a discount on most museums and some restaurants, cost us E34.90pp. This establishment was named after Queen Louisa who resided at the nearby Charlottenburg Palace (Well worth a visit). She was renowned for excellent hospitality (By Napoleon amongst others). If she were to return today, she would be delighted that such a place as this honours her. At Louisa's Place, hospitality is not an optional extra, but it's raison d'etre.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Louisa's Place - great location, nice rooms though slightly expensive”", "Author": "Shinyy", "ReviewID": "UR72016890", "Content": "I found Louisa's Place at a wonderful location on Ku'dam. The rooms are so very spacious and the decor quite royal. I feel it is slightly expensive though but rest all the things are great. I somehow feel the beds could have been slightly bigger for more comfort.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“A great place to stay”", "Author": "moreholidays99", "ReviewID": "UR71107660", "Content": "We stayed at Louisa's Place for 3 nights in April 10. What a fabulous place. We were lucky enough to get a room with a Winter Garden, which was beautiful. The check in was great the service by the staff generally pleasant and helpful. A lovely breakfast room looking out on a garden for a tasty continental breakfast with great service. A great location near a u-bahn stop. We would stay here again.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Great location”", "Author": "GrandAdventurer", "ReviewID": "UR60943343", "Content": "This hotel is located on the Kurfurstendamm, a nice street for walking. Our suite was spacious and clean. It had a nice balcony, but not a nice view. They were a bit stingy with the amenities and towels, but the bath had a great shower. The bed was pretty hard and uncomfortable. The included breakfast was pathetic. The hotel is nice enough overall, but I would probably not stay here again.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Yorkshire", "Title": "“Fabulous 'place'”", "Author": "WestYorkshireHoggy", "ReviewID": "UR59999013", "Content": "It was without doubt the best hotel we have ever stayed in. We arrived Tuesday night to greeted by the nicest, most helpful receptionist (though that's probably doing her a disservice) we have ever met. Apologies if this is a little sexist, but guys it's worth going to hotel just to meet Anna, she is gorgeous!! On arrival we were shown to our suite at which point Anna announced that as it was a special occaison (my partner's birthday) they had 'double' upgraded us. Fair to say when we opened the door we were stunned, the suite was huge, as Anna said 'the other 40 people were arriving shortly\". I kid you not we could have had a party for them and more. The bed was so big that it was hard to tell if my partner was still in it during the night! Our stay included breakfast which was probably the only thing that we have any minor niggles about in that it was a bit 'samey', however the food was lovely just a bit repetative. After a long day sightseeing we used the pool and sauna most evenings, again this was fabulous and just what was needed. Location wise it's little way out from the main parts of Berlin but Kurfurstendamm is a lovely boulevard in it's own right, some seriously expensive shops. However there is a U-bahn stop very near the hotel so getting to other parts of Berlin was very easy (and I hate undergrounds!). Berlin itself is an absolutely amazing place, we walked for miles the first day and on the second did the Fat tire bike tour which is great, we would highly recommend it if you are a first time visitor to Berlin (really interesting, easy cycling, great guide and excellent value for money, 20 euros). If you have any doubts about going to Berlin for a City break forget them its an absolute must place to go. If you do go then stay at Louisa's Place, the only regret you will have is having to leave. We will be back, thanks to all the staff, especially Anna! you really made our break the best ever.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Limerick", "Title": "“Wonderful home away from home in the heart of Berlin”", "Author": "GoMunster", "ReviewID": "UR59666206", "Content": "Stayed here recently during the ITB Berlin. Was given a fabulous room with large sitting area and small kitchen.Bedroom a little on the small side but very comfortable.Nice bathroom with heated floors and power shower. Very friendly staff who are all fluent in English.Excellent Restaurant and standard of room service food is really good.Breakfast a little on the expensive side at 20 euro. Leisure area with pool was an unexpected treat.Didn't have time to sample the spa treatments but did have my hair done at the salon adjoining the hotel and I can highly recommend it.The location is very good with a 24hr mini market on the corner and lots of excellent shops and restaurants within walking distance. The following would have made my stay perfect; more pillows free wireless more towels and toiletries in bathrom pay per view tv and more english channels Overall would highly recommend this hotel.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "londonE9", "Title": "“great value - warm welcome - top location”", "Author": "londonE9 Posted by an OctopusTravel traveler", "ReviewID": "UR57049163", "Content": "charming hotel good location great value - added bonus having a kitchen which allowed us to cook our own meals", "Date": "February 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Coventry", "Title": "“Best hotel I have stayed in”", "Author": "CoventryColin", "ReviewID": "UR49483814", "Content": "My colleague and I stayed at Louisa's Place for a week and it was easily the best stay I have enjoyed in years. I was expecting a standard hotel room but what both I and my colleague got were apartments beautifully furnished and spotlessly clean. The rooms were extremely quiet even though the hotel is on a very busy street (Kurfurstendamm). In fact I couldn't hear any traffic. The best thing of all was how nice the staff were without being obsequious. I will never stay in another hotel in Berlin again - it will be Louisa's Place every time. I've marked the location down slightly because it is on the Kurfurstendamm and that has a lot of very expensive designer shops. If you are there with partner who likes to go shopping steer then towards the U-Bahn as soon as you leave the hotel:-) One other thing, the hotel restaurant is outstanding - try the wiener schnitzel.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Livingston, Scotland", "Title": "“Understated Luxury in Berlin”", "Author": "amsquared", "ReviewID": "UR44986586", "Content": "Super boutique hotel on Kurfürstendamm Strasse Berlin. Louisa's Place is a small hotel near the Designer shops on Kurfürstendamm Strasse. All the room are Suites with bedroom, lounge and full kitchen with washing machine, cooker and all utensils. HIgh quality furnishings and huge rooms. give space for an extended stay. The staff are very pleasant and speak excellent English which is very helpful when my German is virtually non existent. We stayed in room 2.02 which had a balcony leading off the bedroom. This is not a cheap place to stay but for a special occasion at the quieter end of Kurfürstendamm it would fit the bill. We didn't have time to use the swimming pool. Continental Breakfast was very good if a little expensive. There is WiFi through T-Mobile available throughout the hotel charged by the day or month. It took us a while to realise that the upper part of the double glazed windows was open and let in the noise from the street, once we closed the window it was very peaceful.", "Date": "September 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scottish Highlands", "Title": "“First class - yet again!”", "Author": "TellTheTruthPlease", "ReviewID": "UR35340815", "Content": "Oh joy!........ Our second visit to Louisa's was equally as good as the first (my summary of our first visit is entitled 'Outstanding' on Trip Advisor if you care to read it). There is little I can add to it, except to say that as returning visitors we were given an upgrade(suit 2.03) and had a fabulous balcony where we could relax and enjoy the sun. I can only encourage you to visit this place - I'm sure you will enjoy it.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "edinburgh", "Title": "“Not for us”", "Author": "flyingscotsman123", "ReviewID": "UR23342299", "Content": "We stayed in a superior suite at Louisa's place and although it was very elegant and grand it was lacking in something. It wasn't atall cosy and actually seemed really empty and had a cold feeling about it. The furniture is lovely and the ktichen has all the best facilities, but there is something missing. Maybe we missed the hotel atmosphere because although it is a hotel it doesn't have that kind of atmosphere because each room is in effect an appartment. We ate at the restaurant on the first night and it was 100 euros and it really was not worth it, we have eaten in many good restaurants, been charged less and eaten better. I actually was unwell with stomach problems after eating there. The staff are very polite and helpful, the cleaning staff are also very effecient. We would not go back but apart from the restaurant we can't really complain about anything, it just lacks something. it would be good for families, because of the space and the kitchen.", "Date": "January 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "new york n.y.", "Title": "“no refund for days not spent there”", "Author": "paulal_8", "ReviewID": "UR21821729", "Content": "After three days we noticed that they hadn't changed the linens. We got new linens, but they were badly soiled(obviously blood stained) We checked out that night at 12:30 am. The night manager never apologozed. We were charged for seven nights! They refuse to refund American Express for the four nights spent elsewhere. They never gave the travel agent her commission. The nerve! paulal 8", "Date": "November 13, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "houston", "Title": "“Hurricane Ike cancellation, no help at hotel”", "Author": "grumlin", "ReviewID": "UR20521461", "Content": "We booked this hotel for a two day stay through Entertainment Hotels.com , in the meantime, had a mandatory evacuation from Hurricane Ike. Had damage to our home, had other hotels booked and were able to cancel with no problem, however Louisa' Place manager was not very understanding, would not refund our payment which is normally non refundable but we felt the circumstances should have allowed it. Finally agreed to let us come back another time but may have to pay higher price and hotel may not have any openings. Said we would get an email that would state this as a guarantee, never received anything yet, will have to call back and go through this all over, Not happy with this , the other hotel was also non refundable but did not hesitate to refund our payment.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“A Fantastic Small Hotel”", "Author": "gfmPennsylvania", "ReviewID": "UR16774274", "Content": "Lousia's Place is on the western end of the Ku'dam shopping street in Berlin. It features suites with kitchens, living rooms, modern baths and well-appointed bedrooms. Public transportation -- U-Bahn and bus -- is conveniently nearby, making it a good base for tourism. The room itself was spacious, with a quiet balcony sitting area as a bonus. It faced the main street, so there was some moderate street noise at night. Some other rooms face the inner courtyard. The staff was friendly and always there when we needed them. The breakfast buffet was average for German hotels, but quite enough for a good morning start. Overall, we felt the luxury and comfort offered by Louisa's Place was excellent. Yes, it is not cheap, but it is worth it.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meath, Ireland.", "Title": "“Gr8 Hotel .... But wot goin on with the Pillows !!!!”", "Author": "FlyinChick", "ReviewID": "UR14348993", "Content": "Just bak from a 4 day mini-break in the fab city of Berlin, we had the pleasure of stayin at Louisas Place on da Kurfurstendam. Location was just perfect and despite the public transport strike, we were able to get to see all the tourist attractions from the hotel. I recommend a trip to the Berlin Zoo. The suite was a ideal base and the staff were nothing but helpful. Sorry but this hotel provides the most uncomfortable pillows I have ever got in a hotel anywhere in the world.... and dats not me being fussy... they were sooo soft !!!!", "Date": "March 17, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Somerset", "Title": "“A great place to stay in Berlin!”", "Author": "BellaNorthSomerset", "ReviewID": "UR14239317", "Content": "My husband and I have just returned from a three night break at Louisa's Place in Berlin. I would be happy to recommend this little gem of an hotel to any friends ( or fellow trip advisor readers!) The hotel is smart, clean, elegant and friendly, and I felt it was a lovely change to a \" normal\" hotel room. It felt like you had your own private litle appartment in the city, and was a lovely relaxing place to come back to after a busy days walking round the city( NB: there is currently (12th March) a public transport strike in Berlin, so you will be walking a lot, and will be grateful for a relaxing space at the end of the day) We had a Superior suite, which comprises of a good sized double room, bathroom with shower ( no bath) entrance hall, and a lounge/kitchen with dishwasher, dvd player and TV and full self catering facilities. We didn't eat in the restaurant or use the pool , so I can't comment on those facillities. All in all , a great place, and so much nicer than some of the impersonal boring hotels that you can stay in for a similar price!", "Date": "March 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Louisa's Place Deserves Its Fine Reputation”", "Author": "Irishfe65", "ReviewID": "UR11976826", "Content": "A fine small hotel with good sized suites including a well stocked kitchen, a lovely rarely used indoor pool, helpful staff, good accessible location. Stayed for a week in September 2007 and will return for another week in April 2008.", "Date": "December 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, UK", "Title": "“Great place to stay”", "Author": "Birthdaytreat", "ReviewID": "UR11371952", "Content": "We chose this hotel specifically because we wanted more than just a room for our trip and we were very happy with our choice. We had what can only be described as an apartment on the 5th floor - hall, bedroom, bathroom and livingroom/kitchen. All very clean, very comfortable, nicely done and very pleasant, for the price of an average hotel room. Room service was a problem as the attached restaurant had a convention running so wasn't operating. However, there is a 24 hour store opposite for basics and plenty of cafes and restaurants. We made our own breakfast everyday and ate out otherwise. We particularly recommend the stunning Chinese restaurant - Hot Spot - on the adjacent street. The hotel is just up from a metro station (Adenauer Platz) and there are plenty of buses -including one for Tegel Airport.. Getting to the main attractions was easy and quick. We found the staff helpful and kind. The pool, fitness room and sauna were excellent. We would definitely stay there again - the sense of space was wonderful.", "Date": "December 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Wonderful”", "Author": "winetripper", "ReviewID": "UR10762982", "Content": "Wonderful clean and classy apartments. Try to get one overlooking the courtyard as the Kdamcan be noisy. Highly recommended.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Just Perfect”", "Author": "Yanuza", "ReviewID": "UR10118966", "Content": "We had a great experience here. The apartment we stayed in was lovely and clean and spacious. We are a family with small children and it was great. We had a car but the tube is very close (within 5 mins walk) -- If you drive, there is a paid car park underneath. TIP! We managed to park on the street for nothing! Microwave would have been helpful but certainly wouldn't stop you from returning. Situated in a street with all the designer labels. We did find it difficult to find breakfast outside the Apartments, so settled with croissants (which were also not easy to find...but you could always cook - we did not dine in for breaky) - there is a supermarket a few blocks down. The staff did recommend against driving around but we are so glad we went against their advice, we saw so much and it was more convenient with the children. Staff were also very helpful. (was unable to upload pics let me know if you would like to see)", "Date": "October 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“only 4 star hotel”", "Author": "highbrowed", "ReviewID": "UR8738035", "Content": "time/duration of stay: september/4 days hotel: old stile, relatively small, rooms with balconies available. staff: slow, no real help with the luggage (students?) suites: quite big, comfortable beds, quiet, kitchen fully equipped except washing machine. no bath tub in most suites, no slippers. had to ask for another shower gel, got shampoo instead after 2 hours. only cnn-english speaking. spa: small pool/sauna-too cold, no shower gel/shampoo, towels too small for the sauna. location: very close to underground station \"adenauerplatz\" and a bus stop. restaurant: don't know. very annoing: smell of cigaret smoke in the corridors. price: 170 euros/night not too bad for a suite. overall: 4 star hotel (us-standards) cm", "Date": "September 17, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, New York", "Title": "“EXCELLENT CHOICE”", "Author": "NYGlobeTrekker7", "ReviewID": "UR8738028", "Content": "First, with so many hotels posting photos or descriptions that are not 100% accurate, know that Louisa's Place is the real deal. You will not be tricked with photos that are not a true representation of the hotel. The rooms are spacious, well kept and quiet. In addition, I found the staff to be very helpful, knowledgeable and multilingual. In a two simple words, The best !! While I am from the U.S., I travel often abroad and to Europe specifically. Of all of the hotels I have stayed whether in the U.S. or outside the U.S. Louisa's is one of the best. I recommend it highly and you will not be disappointed. I almost fear singing it's praises so much that when you get there you may expect a 6 or 7 star hotel and be let down, but make no mistake about it, one of the best hotels in Berlin and perhaps all of Germany. Having said all of that, the prices were also quite competitive.", "Date": "September 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Excellent rooms”", "Author": "barnmeister", "ReviewID": "UR8664258", "Content": "Stayed for 3 nights with partner and son and found the rooms to be an excellent size, seperate bedroom, large hallway space, large shower/toilet room and good size lounge area for the extra bed for our son. Fully fitted kitchen was a great bonus. Breakfast was good, plenty of choice, hot food had to ordered but no problems there. Great area , loads of places to eat nearby if you didn't want to venture further afield any night. U Bahn only 1 mins walk away, giving easy access to any of Berlins many points of interest. Staff on reception were very friendly and helpful. Booked using octopusstravel.com and got a great rate for the 3 nights including breakfast. Well recommended for anyone wanting plenty of room and needing an extra bed for the kids. Will certainly consider this hotel again for further trips to Berlin.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Aerdenhout, Netherlands", "Title": "“quiet and lots of space”", "Author": "margriet1950", "ReviewID": "UR8496516", "Content": "Was staying with two sons in one of the suites and we did enjoy the rooms and the bathtoom. Good beds,excellent bathroom with the best shower ever and everything was really clean and well groomed. Quiet rooms, so no noise.Swimmingpool small but nice! Breakfast just perfect with lots of choices. Margriet", "Date": "August 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent Hotel”", "Author": "Gardel", "ReviewID": "UR8359758", "Content": "Excellent hotel - discrete frontage and entrance in a very nice area of Berlin and close to subway stations, good places to eat and the main shopping area of Berlin. Staff are very friendly and helpful and the suites are spacious and well appointed. This hotel is for those who do not want to be met by the typical large hotel experience of anonymous receptions and generally inane bustle of other guests. The building is beautiful and the wellness centre and swimming pool is very pleasant. I would definitely stay there again.", "Date": "August 6, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sant Quirze del Valles, Spain", "Title": "“Execellent hotel”", "Author": "travelBCN", "ReviewID": "UR8271155", "Content": "We (me, my wive and my 18 months baby) spent 4 days in this wonderful hotel. Rooms are huge, treatement by staff is exquisite, serving you in all possible way they can. All details are looked after, you feel like home. I travel quite often for business, and I can only say that every time I go again to Berlin, Louisa's place will be my elections, whatever is the object of my visit.", "Date": "August 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire, UK", "Title": "“Loved it!”", "Author": "Shipscaptain", "ReviewID": "UR8061393", "Content": "Great hotel, nice people! Just returned from a two-night stay and we couldn't have been more pleased with the room, the decor, the food and the people. Everyone was extremely helpful, even more so when our luggage didn't arrive thanks to BA! The room was comfortable, extremely spacious, quiet, premium fixtures and fittings.. in fact everything you would want from a city-centre room but rarely find (well, not at such competitive prices). If Genesis play Berlin again, Louisa's Place is where we'll stay...!!", "Date": "July 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vienna", "Title": "“Location, Location, Location”", "Author": "ViennaMike", "ReviewID": "UR8039865", "Content": "Booked my recent stay on the basis of reviews on this website. The staff are indeed friendly and helpful, rooms are spacious and well appointed, the pool is relaxing, the library restful and the hotel quiet. You will be perfectly happy staying here. But for me, the problem is one of location. Most tourists will want to spend the bulk of their time east of Potsdamerplatz and probably within walking distance of the museums and sights around Unter den Linden. For that reason alone, I would not return as staying here means a 20-30 min commute by U-Bahn or a €12 taxi fare each way.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Midlands", "Title": "“Wonderful Hotel”", "Author": "IPI0", "ReviewID": "UR7638560", "Content": "Our stay in Louisa's Place was fabulous - just what we needed to make the most of our weekend in Berlin. The champagne we had requested was chilling in the fridge when we arrived, the breakfast was lovely, staff were wonderfully helpful, and the pool and sauna were a real treat after a day walking around Berlin. The restauarnt was fabulous too - service and food are excellent. Our room was on the front, but there was absolutely no road noise. Would recommend this hotel very highly.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“A top class base in Berlin”", "Author": "metroace", "ReviewID": "UR7390379", "Content": "My wife and I stayed for three days here following a conference in Potsdam. We could not have chosen a better place! The staff were helpful and knowledgeable. The location on the Ku'damm could not be bettered with loads of choice for eating and drinking all within walking distance. The rooms (sorry, suites) were very well appointed, clean and faultless. If you want a top class place to stay on business or on holiday in Berlin, I can thoroughly recommend staying here.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Maine", "Title": "“Stunning Hotel, Great Staff and Location”", "Author": "VOYJEAN", "ReviewID": "UR7267911", "Content": "We just returned from a 5-night stay at Louisa’s Place and couldn’t have been more pleased. This is one of those rare finds – an upscale and classy yet very friendly place. The light and airy suites are extremely spacious and simply stunning, with high ceilings, beautiful wood floors, elegant window treatments, and pleasing artwork on the walls. Everything is first class -- the kitchen has Bosch and Krupps appliances, the bedding is luxurious, the shower has power. You think “Wow” every time you walk into the suite, and it just feels good to be there. The pool/spa area, which we only admired but did not use, is also gorgeous. The employees at Louisa’s Place are all top-notch, too. The desk in the lobby appeared to be staffed at all hours, and we had interactions with several different people. Every one was warm, friendly, and responsive to our queries. They called to find out restaurant hours for us, they checked a manual to figure out the correct postage for an oversized postcard and then sold us the stamps, they arranged an early morning taxi for us. We never failed to receive a smile and friendly greeting when we came and went. We have rarely experienced better service in a hotel. We also thought the location was perfect, on the quiet (western) end of the famous Ku’damm. The Adenauerplatz U-bahn station is less than a block away and Tegel airport was just about a 15 minute cab ride away. A good Internet café is less than a block from the hotel (it has far lower rates than the hotel). There are numerous restaurants within a 5 minute walk. Two of our favorites were Kartoffel Pfanne right across the street on Eisenzahnstrasse (ask for Henk, a super waiter), and Café Fraziskushof Stuben, just up Wilmersdorferstrasse. They have a local neighborhood feel, not a touristy feel, and have excellent food and very reasonable prices. Just about everything at Louisa’s Place was perfect, and we would absolutely stay here again.", "Date": "April 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "American expat", "Title": "“Fabulous for families”", "Author": "Travellingmom823", "ReviewID": "UR6840328", "Content": "We stayed at Louisa's Place for 5 days, between Christmas and New Year's and cannot say enough about it. It was a lovely, friendly hotel, more like an apartment hotel, perfect for a family of 4, including two kids aged 5 and 7. The room was huge, with a kitchenette and a separate living room with pull-out couch for the kids. The kids especially loved the swimming pool downstairs and spent hours there. Our son also loved the delicious chocolates set out each day at the reception desk. We loved the sauna, the friendly staff and the cleanliness of the rooms. This is a great place for families. Stay here by all means.", "Date": "February 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sydney", "Title": "“Best Hotel”", "Author": "JMC-7", "ReviewID": "UR6780750", "Content": "We stayed in this hotel for 3 nights in January. I have to say that this is one of the nicest hotels we stayed throughout Europe. Well priced and friendly service. The pool and Wellness spa are amazing and for 3 euro we could even wash and dry our clothes. The rooms are magnificant. Our room had a balcony where we could eat our meals. We highly recommend this hotel.", "Date": "February 11, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South East UK", "Title": "“Great hotel”", "Author": "kymcs17", "ReviewID": "UR6738066", "Content": "We have just returned from a 3 night stay in Louisas Place(Apartment.1.12 on first floor). The taxi driver from the airport did not know the hotel but simply punched in the address into his satnav. NB Most of the taxis in Berlin are Mercedes Benz's and therefore very comfortable. On arrival - you might be unsure if there is actually a hotel there - as the sign is very discreet. However look out for the Balthazar Restaurant - which is right next door to the entrance. There is a very relaxed air about the place. There is a small unobtrusive desk in the entrance hall - which was always manned. We had arrived earlier than expected and our allocated room was not yet ready - but eager to help they upgraded us from a Junior Suite to a Superior Suite. The hotel itself is really quite impressive - a wide sweeping stairway took us to our first floor suite. The suite itself was just wondeful. My partner (a well seasoned traveller - over 58 countries) - said it was the best place he had ever stayed in!! We had our own entrance hall with coat rack and mirror and space for shoes....a very useful area - as it happened to snow for the 4 days we were there. Lovely and romantic - but not good on the shoes or carpet!! There was a well fitted out bathroom - no bath - but a huge wet room shower (big enough for two!) and spotless white fittings. The whole place was very clean. Then through the door into the sitting area - with kitchenette in the corner. Ceiling heights in the rooms made them feel very grand - especially as the windows were floor to celing and covered with suede drapes. The decor was very tasteful and classy. Our sumptuous separate bedroom was equally well decorated. We then discovered the piece de resistance - there were double glass doors from both the bedroom and the living room into a heated balcony - with huge double glazed windows, comfy seats and a dining area with table and chairs. Bliss. Great views to sit and eat and watch the world go by. The Ku Damm is quite a busy road - but with the balcony doors shut - you could not hear a single car, so it was very peaceful. Also - you are away form the end of the Ku Damm that has all the bars /restaurants and even though our apartments was directly above a restaurant - we never heard a thing. Out of the front door of the hotel - turn right and after a few minutes you will see the U Bahn (German tube) - the tube and buses run with typical german timeliness and are clean and safe. That said the best fun we had was finding the bars in the back streets - where we wandered in - used pigeon german to order and sample the local food (a little vinegary)- but recommend the Bratwurst...and my partner indulged his love of German Pilsner. All in all - combined with the overwhelming sense of culture is this feeling that the Berliners are finally moving on. Apparently there has been more building work done in the last 10 years than at any other time last century. That said - German effiency means there does not seem to be any permanent building ongoing. There is a distinct difference in the architecture of East and West - but a visit to Berlin would not be complete without seeing both. Most impressive for me was the renovated Brandenburg Gate - once in no mans land between East and West - it is amazing to see such a historical landmark up so close. Oh and out of the hotel - turn right - walk for 5 minutes and there is a Steak House on the corner - best steak I have EVER had - but book it in advance - as they get packed from 6pm onwards. People were still queuing to get in when we left at 09:40pm! Visit Berlin - stay at this hotel - you will love it. We have already rebooked for next year.", "Date": "February 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NC; USA", "Title": "“absolutely amazing!”", "Author": "BluePink", "ReviewID": "UR6478780", "Content": "This place is definitely an insider tip at the lower boulevard Kurfuerstendamm - The staff is awesomely nice, the suites are really huge, the Restaurant is amazing too - great food even at night (we ordered via room service) - the pool area is a MUST and if you have time to relax - go and get a massage...we will be back - just do not know when...", "Date": "December 21, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great little Hotel”", "Author": "The_Powerranger", "ReviewID": "UR6364515", "Content": "Lovely hotel with very pleasant and helpful staff. Great location on the Ku'damm with plenty of restaurants and bars close by. Very easy to get to by public transport. Would definitely use again.", "Date": "December 11, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Best city hotel I've stayed in.”", "Author": "TravelAgencyManager", "ReviewID": "UR6017996", "Content": "Amazing suite with beautiful kitchen. We just stayed in the first day and ate and drank wine winding down from work. Great base and location. Even managed to get room service to bring up a bottle of white wine for 3 drunk girls at 2am! Got to love that.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sheffield", "Title": "“is a nice place, in a good location”", "Author": "TAmember33", "ReviewID": "UR5893267", "Content": "Good room - we got a smallish, high ceilinged modern suite, with an excellent bathroom, comfy bed, and sleek modern fittings. Some others had balconies. Good location for sight seeing in Berlin, but about an hour on train and metro from Schonefeld airport. Friendly reception staff (organised balloons & champagne for a birthday surprise). Breakfast fine if you like continental, but not the hot buffet as advertised. Waiting staff not particularly accommodating. Small but posh breakfast room. Pool and sauna area was small but luxurious (steam room not working and wasn't fixed in the four days we stayed although we reported it). They opened the pool area for us at 12.30am, which was a lovely way to unwind after a night out in Berlin. Water in pool is cold, so be prepared! Would recommend this if the price is right (we got a good deal on octopus) and would consider returning if they could do us some bacon & eggs in the morning!", "Date": "September 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“Loved it!”", "Author": "jen_clem", "ReviewID": "UR5611016", "Content": "THIS IS A WONDERFUL HOTEL. Louisa's Place has a warmth that is both luxurious and friendly. We had one of the smaller sized suites (a bargain from hotelclub) and it was palacious! Stylish, expensive funishings (from curtains to Bosch dishwashers) made our stay extremely comfortable. Very clean too. The location meant that we could access any part of Berlin by public transport. Staying in this hotel means that you are located on the very west of centre. This is a bit of a disadvantage if you want to stay late in the East, although there are night buses and taxis. Staff were very professional and friendly- really good service. Breakfast was an excellent continental spread. This is the niceist hotel I've ever stayed at!", "Date": "August 14, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“disappointing”", "Author": "Letstakeoff", "ReviewID": "UR5601450", "Content": "Having read all the excellent reviews, I had high expectations for my 3 night stay but was bitterly disappointed. The furnishing and the fittings are of top quality, but the poor service and lack of attention to details really let the place down. It is more a serviced apartment (as it says so on the brochure) than a 5 star hotel! I was surprised that the room were not air conditioned. It was airy enough with the windows open but the room we had faced the main street and the noise of the traffic continued well past mid night! The kitchen was well equipped, but there was no complimentary tea/coffee or mineral water. When I asked whether they could provide some tea bags - I was told we checked in early (at 11 am) and had our pre-allocted room swapped so the 'welcome pack' was not in the room. It never came, but we were given instructions to the nearest supermarket. We had a 3 night stay and the bed linen was never changed. We had to ask for fresh towels on two occasions - housekeeping simply hang up wet towels instead of replacing them with fresh ones. We also had to ask for additional toiletries which were not replenished. The shower was execllent though, but it would have been nice if we also had a bathtub. Breakfast was adequate but there was no hot buffet breakfast as described when we booked, unless you can count warmed hard boiled eggs as a hot dish! There was no information about the facilities either in the room, we only found out about the spa and pool on our last day! Louisa's Place could be a 5 star hotel, but it will need huge improvments in service!", "Date": "August 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Düsseldorf", "Title": "“A quiet, luxurious and friendly haven in the centre of town”", "Author": "German_Traveller", "ReviewID": "UR5337856", "Content": "We stayed at Louisa's Place for 2 nights on the Worldcup opening weekend (coincidence!). The city was buzzing with fans, press etc. and lots of people out and about enjoying the extra opening hours. We had planned a quiet weekend away and hadn't counted on the noise on the street, otherwise might not have booked a hotel based on the Kurfürstendamm (one of the main shopping streets in Berlin). But we needn't have worried. Although Louisa's Place is on the Ku-Damm, it's on the quieter, more elegant end, and is absolutely sound-proof. We had a superior suite (the hotel only has suites/ appartments) as part of a weekend special and its terrace opened out onto a spacious back yard which was totally quiet. The rooms were very large, spacious and comfortable. Offering WLAN and DSL connections, stationary etc., it's ideal for business travellers and with the kitchen and enough space in the living room for 2 more guests, it would be perfect for a family too. For us as tourist guests we appreciated the good beds and the strong shower and the tranquility of the place. We didn't use the wellness area (which is open around the clock!) but enjoyed the elegant surroundings of the garden room for breakfast and the library for a drink. The whole building is beautifully renovated and benefits from high ceilings, period features etc. I didn't see the marks on the walls that a previous reviewer criticised and definitely can't confirm that it has the feel of a home for the elderly. Yes, it's spacious, but it's more like a city townhouse and very nicely done up. Breakfast was excellent with joghurts, fruit, meats, cheeses, breads, croissants, 3 salads and egg dishes and various coffees / teas to order (included). The only thing to improve here would be to chill the salads, which were starting to suffer in the summer heat by the time we made it down to breakfast. A very nice touch was the personal order based on the questionnaire we filled out prior to arriving (in our case: a special juice, a certain newspaper and a chocolate croissant). Indeed, the service was impeccable on all fronts. I liked the small things like the lady at reception standing up to greet us on arrival and their willingness to help at all times. We were able to use the room until late into the afternoon as it wasn't booked the following day and the staff was full of advice when asked for. We didn't see many people during the day (it is a small hotel with only 40-50 rooms) but there was always a lady at reception. OK, to sum it up - we can recommend it wholeheartedly and will definitely go there again on our next visit to Berlin.", "Date": "June 13, 2006"}], "HotelInfo": {"Name": "Louisa's Place", "HotelURL": "/ShowUserReviews-g187323-d307975-Reviews-Louisa_s_Place-Berlin.html", "Price": "$169 - $1,310*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kurfurstendamm 160</span>, <span class=\"locality\"><span property=\"v:postal-code\">10709</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "307975", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/fa/03/8b/louisa-s-place-berlin.jpg"}}