{"Reviews": [{"Content": "One of the best of Bali for location and value This is a truly wonderful hotel. I visited the Inna Sindhu Beach hotel (formerly the Nator Sindhu) on my first trip to Bali in 1998 and have been happy to return on all but one of my many visits. It is fair to say that if you are looking for over the top luxury this might not be the hotel for you but if you are looking for one the best travel experiences in Bali I highly recommend this hotel. The hotel dose look a little outdated but that is easily made up in the fact that the facilities are kept very clean and well maintained. The staff in this hotel is amazing. In all my travels throughout the Americas, Asia and Europe, the staff here is one of the best. Beyond being exceptionally pleasant (in my many visits here I have never had a problem with the staff) they will go above and beyond to make sure that your every need is met. One of the most pleasant surprises was that the staff in the hotel and the restaurant did not just engage in polite small talk but were happy to have a real conversation with you, in fact I have even kept up friendly correspondence with a few of the wait staff. The hotels restaurant is good and very inexpensive, their is also at huge number of other restaurants in walking distance of the hotel. It is the location of the hotel that may be its best feature. Besides the fact that there are absolutely no shortage of things to do in the town, Sanur is one of if not the best location for getting around the island. Sanur is makes it so that you can reach almost any part of the island easily and quickly. On my last visit I stayed at what has been rated as one of the top hotels on the island and in all of Asia Even though that type of super high end luxury made for a wonderful trip, the experience did not even come close to any of my four previous visits to the Inna Sindhu Beach hotel.", "Date": "Aug 26, 2005", "ReviewID": "UR641545028", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "manunyc"}, {"Content": "In need of renovation       The \"seaview\" wing", "Date": "May 20, 2005", "ReviewID": "UR347710882", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The best. For the fifth time I stayed here with my friend. And everytime we have a very good holiday there. The rooms are nice, the breakfast is delicious and the staff are very friendly. the garden and pool are nice and it is right on the beach. What more do you want?", "Date": "Apr 29, 2005", "ReviewID": "UR496992894", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great value and location this was a nice hotel to stay in- we stayed here twice , the first room was onthe ground floor, near the pool and was OK but nothing special. The second room was onthe second floor- with a view of the ocean and a very elaborate door- room 1 B I think and was beautiful. Location is great- right on the beach, near restuarants and bars, but not too hectic (like Kuta)Staff were very heplful and pleasant, rooms were spotlessly clean and breakfast served on the beach was great. This is not an upmarket resort by US standards, but very good by asia standards.", "Date": "Mar 11, 2005", "ReviewID": "UR854148299", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "munkispank"}, {"Content": "銉椼兗銉亴銈堛亜   showReview(19457947, 'full');", "Date": "Aug 28, 2008", "ReviewID": "UR875084217", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "銇俱倱銇°們銈?> 銇俱倱銇°們銈?</a> </div>"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297700-d308411-r3809297-Inna_Sindhu_Beach-Sanur_Bali.html", "HotelID": "308411", "Price": "$85"}}