{"Reviews": [{"Content": "Rundown and filthy We checked in and checked out within an hour. We booked the top of the line room. It was dirty, blood stains on the sheets and blankets. The one sitting chair outside was broken, the Bali chaise was covered with ants and hair. The kid that escorted us to the room under a broken umbrella was nice, but the man at the front desk was surly. When we arrived, he emerged from a hole in the wall like a troll and treated us as intruders. To top it off the place is way overpriced. HORRIBLE!", "Date": "Dec 22, 2008", "ReviewID": "UR378357090", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "USAinSing"}, {"Content": "Great hotel for great rate This hotel is located in the main street of Ubud, the rooms are distributed in the garden with a pool at the back of the hotel.Daily breakfast is provided. The people of the hotel is very friendly and always willing to help.Even though this is a simple hotel, the rooms are very clean and the cost very reasonable.", "Date": "Oct 28, 2008", "ReviewID": "UR272737164", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "lirits"}, {"Content": "Peace and Tranquility My wife and i stayed at this hotel in the wet season, and one of the highlights of our trip was the croaking of the frogs accross the rice fields in the fine hours of the morning. Another was the beautiful birds playing out front of our room during the terrential rain. Personally i found the room quite nice, and considering the price i would recommend this place. It was a really nice touch when the porter brought us lemon tea upon arrival....Stay here if you want some peace and quiet.", "Date": "Jul 24, 2008", "ReviewID": "UR779894626", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "Andy-Gunn"}, {"Content": "Gotta love Ubud I stayed there for 2 nights in late September 2007. Cute, clean and quiet. In Indonesia I stayed in buget to ritzy and I felt this was a good value. 200,000 rupiahs per night including breakfast, but they charged exta for coffee refills. The place was quiet and comfy. I would stay here again. Close to Monkey Forest.", "Date": "Oct 6, 2007", "ReviewID": "UR293600117", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "unklekevin"}, {"Content": "Can this be the same hotel? I've seen the other review on this site and wonder if it was the same hotel. We booked into a bungalow suite at Dewi Sri. It does overlook rice paddies (many hotels in Ubud do) and the pool is in a nice position. However, our bungalow suite was not sealed from insects. We were told by the 'helpful' staff that there is no problem with mosquitos in Ubud. Ubud is surrounded by rice paddies which every evening give off the little critters. You need a room that is well sealed.The bathroom was gloomy and unclean. In fact come to think of it, our bungalow suite wasn't a bungalow and only a mosquito would call it a suite!We dumped our bags in our room and within 15 minutes got ourselves a deal elswhere in a clean hotel overlooking rice fields.It's a shame as Dewi Sri looked like it could have once been a really nice place to stay.", "Date": "Oct 13, 2005", "ReviewID": "UR719949319", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "ferretbanana"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d308779-r22902516-Dewi_Sri_Bungalows-Ubud_Bali.html", "HotelID": "308779", "Price": "$57"}}