{"Reviews": [{"Content": "Renovated Rooms Are Fabulous The renovated rooms at La Walon are fabulous. The older rooms, however, are dark with terrible bathrooms. My room was bright and clean with AC and English TV. I paid about $40 a night, and it was well worth it. The pool is great and very clean. The hotel has a great location on Poppies 1. I was able to get WI-FI access in my room from the Internet Hotspot above the restaurant. I had to pay for that but it was a reasonable amount. Great breakfast.", "Date": "Dec 5, 2008", "ReviewID": "UR796121284", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "galpine70"}, {"Content": "a never before experience we had arrived at la walon at 12 thinking check in time would be 12 but was informed both check in  check out time are at 1p.m. that means it's impossible for them to check in their guests promptly at 1 if there happened to be many guests! we went to have our lunch  was back at abt 1.45pm. when i was told the room still wasnt ready, my face turned black  immediately, the receptionist changed her mind  said it was. was led to the room but when i walked in, good heavens! the room was still in a mess! the boy quickly apologised  said would clean up.5minutes later, i went to 'inspect' but there wasnt anyone in the room cleaning up as promised! i saw red  demanded to see the manager. when he merely uttered an 'oh' to my complaints, it further enraged me  i demanded a full refund if the room wasnt ready by 2pm. only then did he spring into action. immediately got 4 of his staff to clean up the place. by then i didnt trust them so i went to the room to monitor  gosh! caught them red-handed trying to just tidy the bed without changing the bedsheet  pillow cases! naturally, i flew into another rage  demanded the manager that everything was to be changed  clean! then, they forgot to pass me my room's key  i had to personally go to the receptionist to get it  they didnt even apologise!apparently, it wasnt just us who had nasty experience. as i was rummaging through for evidence of the check in time, i chanced upon the feedback written by the previous occupant of my room. they had given negative comments too. noisy  unfriendly staff.  when we were checking out, another guest had demanded to see the manager.la walon isnt exactly a very budget place esp when we were staying in the new rooms thus more expensive. to pay such a price for such horrid experience which i've never encountered with any accomodation, totally not worth it.", "Date": "Feb 9, 2008", "ReviewID": "UR631655442", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "4", "Location": "3"}, "Author": "nabunay"}, {"Content": "La Walon Bungalows - great place to stay       La Walon - Pool", "Date": "Jul 13, 2006", "ReviewID": "UR543912520", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "Ianhevans"}, {"Content": "涓€鐣畨銇勫銇硦銇俱仯銇︺伩銇俱仐銇?#x201d;   showReview(20348492, 'full');", "Date": "Jul 8, 2005", "ReviewID": "UR645732550", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297697-d309154-r22470070-La_Walon_Bungalows-Kuta_Bali.html", "HotelID": "309154", "Price": "$26"}}