{"Reviews": [{"Content": "Character Plus I stayed at the Tjampuhan with my 9 year old son in early December 2008, and was very impressed. We were very happy with the room and the bathroom, and the view from the balcony was amazing! It is true that there are lots of steps, but since it's built on a hillside over a river, that is hardly surprising. We asked for a room near the top, and it was quickly provided. Our request for an electric jug and a fridge were also quickly dealt with. My only negative feelings were that at a hotel of this calbre, a fridge and jug should be standard in every room. The fridge that was provided was not very clean, and it is important to attend to these small details. The main pool was beautiful, and extra space for sunbathing was provided down a few steps, next to the bar. The banana pancakes are also awesome - my son ate about 6 each day!!I found the staff to be charming and helpful and sincerely interested in us. It is a beautiful, tranquil spot and I would stay there again in a heartbeat, next time with my partner.", "Date": "Dec 21, 2008", "ReviewID": "UR497024524", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "SweetOtter"}, {"Content": "Amazing place to stay We stayed at the Tjampuhan and found the stay absolutely amazing. The rooms were well appointed and clean with views of the river. The complex was very large and spacious - we were not expecting such an amazing setting. The Tjampuhan was very tranquil and a great place to escape the heat and filth of Kuta. The staff were very helpful and courteous and made the stay even better. Overall was the best place we stayed at on the entire trip. Cannot recomend it enough!", "Date": "Dec 12, 2008", "ReviewID": "UR463505117", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "sam_ham_01"}, {"Content": "Great choice for Ubud, Bali. My husband and I just returned from a week in Ubud, Bali. We stayed at the Hotel Tjampuhan Spa on the western edge of Ubud central. It is gorgeously situated on a hillside surrounded by a virtual tropical jungle overlooking the confluence of two sacred rivers. Service was graciously attentive and unfailingly polite and solicitous. We had the most delicious breakfasts ever anywhere. The banana crepes are simply scrumptious....I'm craving them right now. And the rice porridge every morning is just what this Chinese girl loves to have in the morning, even in the heat and humidity -- it was very satisfying. And the eggs cooked to order, you haven't had eggs until you taste these. I had a wonderful 2-hr spa treatment for $38 US - an hour whole body massage followed by a body scrub and yogurt treatment capped by a warm bath in fragrant oils and beautiful fresh flower petals. I was served lemon ginger tea as I bathed. It was heavenly. The spa is at river's edge, as you receive your treatment, you are lulled by the sound of falling water, the buzz and chirp of the jungle and the warm sweet fragrance of frangipani blossoms.....you have to pinch yourself to believe that you are really there. It is an unbelievable experience. I highly recommend this hotel with no hesitation, except one warning that there are many steps to traverse up and down because the hotel is built into the hillside; those with impaired mobility would have difficulty going to and fro, I'm afraid to say.", "Date": "Oct 27, 2008", "ReviewID": "UR419115306", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Lilo888"}, {"Content": "Fantastic hotel right in the jungles!!       Me relaxing on the balcony", "Date": "Oct 25, 2008", "ReviewID": "UR304144415", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "almakonya"}, {"Content": "Not longer an option. Many times I was in this hotel (since 1988) and now it is a pitty how rundown some of the rooms are. Specially funghi-walls and bathrooms have urgently to be upgraded. Not valid the money at that time. In the restaurant they have extremly high prices for drinks and the breakfast is just a joke.", "Date": "Oct 18, 2008", "ReviewID": "UR680945622", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "3", "Value": "1", "Rooms": "2", "Location": "5"}, "Author": "wuzile"}, {"Content": "Faded Glory This could be a beautiful hotel trading on its history. Instead it has become a somewhat shabby dowager - still dignified but frayed round the edges. We stayed here for 3 nights in January and from the website had expected something much more refined. The bedrooms are old-fashioned, the bathrooms are very run down - it is almost as though the jungle within which the hotel is set is threatening to take the whole thing over. But Tjampuhan is not without charm - the staff are friendly and accommodating, the rooms are clean and (in the higher rooms at least) sitting out on the verandah is magic. At this price, it is certainly value for money - but with stronger management and some investment this could be somewhere quite special.", "Date": "Oct 2, 2008", "ReviewID": "UR456549027", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "returnjourney"}, {"Content": "Value for money Value for money, loved the landscape  the river but the bathroom was a bit grim. Not recommended for old people, disable and people with small kids due to the number of stairs  walking distances.", "Date": "Sep 30, 2008", "ReviewID": "UR370922576", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "Reisekater"}, {"Content": "No one can prepare you for the number of stairs       Bonet room", "Date": "Sep 16, 2008", "ReviewID": "UR523875538", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "notsosilent"}, {"Content": "Tjampuhan.... .not perfect but relaxing       View from our balcony", "Date": "Aug 17, 2008", "ReviewID": "UR450811157", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Mannalay"}, {"Content": "Ubud Tjampuhan       river at the bottom of the hotel", "Date": "Aug 4, 2008", "ReviewID": "UR921471481", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "caddyandbellA"}, {"Content": "One of our absolute favourite hotels We have stayed at the Tjampuhan many times and adore the place and the people who run it. There is nothing flashy about the hotel. It is simply an honest, delightful and homely place to stay in wonderful Ubud, with staggering views of the Ayung river valley. The roms are fairly basic, air-conditioned or fan-cooled, there are two pools and the restaurant serves good food. Earlier this year we celebrated our 25th wedding anniversary at the Tjampuhan with a party for 50 friends. The hotel staff did a fantastic job and we had a wonderul time. We have already booked our next visit and we have met peoplewho have been staying at the Tjampuhan for the past 50 years! One point to remember: the hotel is situated on the side of a valley so the lower rooms are accessible only by steep steps, which may be a problem for the elderly or less fit!", "Date": "Jul 22, 2008", "ReviewID": "UR281445152", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "TTD1"}, {"Content": "dont stay at the Tjampuhan we had a week at this hotel and will never go back there The hotel was old, tired, full of mildew and in need of a good cleanout On top of that my wedding and engagement rings disappeared from our room the last morning we were there. They were in the room when we went to breakfast and not there when we came back to pack up to leave. A report of the missing rings to the person on duty at Reception brought a half - hearted response. As we had to fly back home that day there was nothing else we could do so left with the matter unresolved Subsequent emails sent to the hotel to follow this up have note been responded to As a reult there is no way we could recomend this hotel to anyone and we urge anyone thinking about it to choose an alternative", "Date": "Jun 30, 2008", "ReviewID": "UR203707994", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "lyssAustralia"}, {"Content": "Beautiful setting, nice place to stay We stayed here for 3 nights with our family of 2 adults and 2 young kids (6 and 8 years old). The Tjampuhan is lovely - the setting is lush jungle with a river below. A short walk to the town (around 10 minutes), the hotel also offered a shuttle bus and if times weren't convenient, then transport was easy to find outside the hotel - and cheap too! I would recommend requesting a room away from the road as it can get very noisy with motorcycles and trucks. We booked an interconnecting Raja room direct with the hotel months before we arrived and specifically asked for a room off the main road. One was not available when we arrived and we were shown to a room which was almost on the road! We did complain and were shown some other available rooms. The hotel handled our complaint extremely well and they bent over backwards to keep us happy - we were also given free massages and a dinner in the restaurant for the booking confusion.We took another room called River 1 which was even better for us as it was a huge double storey loft room with the kids sleeping upstairs in the loft and us downstairs. The room was lovely - however in need of a little renovation ( the bathroom was out of the 1950's!). It had huge comfy beds, 2 balconies and was very peaceful. It was a distance from the reception but was never a problem for us or the kids - we felt the stairs helped us burn off our meals! We had read some other reviews and requested a fridge for our stay. There was a store almost opposite the entrance to the hotel so we were easily able to stock it with cool drinks. We did love the fact there was no tv, and the kids just watched dvds on our laptop. wi fi was available in the restaurant and reception areas which was handy for my husband.All in all, it was great to stay at an Ubud icon. A lovely setting, nice pools, quiet location, but could do with a little attention.PS - If you are feeling cashed up, have a dinner out at Mosiac restaurant. It would have to be one of the (if not the) best meals we have had in our lives!! No kids under 12 though!", "Date": "Apr 28, 2008", "ReviewID": "UR104891500", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "carowilk"}, {"Content": "a beautiul hotel We have just returned from our honeymoon and stayed in theTjampuhan hotel for 7 nights of our 14 day trip. The hotel was built in the 60's and is very spread out, consisting of chalets built on different levels, directly above a ravine. There were many steps to reach our room (I did not mind the exercise given that we ate more than usuall and it was the chance to burn off calories!) The room was decorated in an old style and had tasteful furniture and a stunning view of the lush trees and vegetation overlooking the ravine. You sat on your comfortable chairs and could watch squirrels and listen to the birds. However we were a little disapointed at the lack of facilities eg there was no bar fridge (Bali is very hot: you need cold drinks and beer), no hairdryer, kettle and cups etc and no TV or even a radio, which you would expect from this standard of hotel. We thought maybe the management considered it impractical for them have TV's in the rooms, as the walls are thin and you could hear you neighbours talking very clearly and therefore a TV late at night be more of a disturbance. I will give them due credit that we did ask for a fridge and a hairdryer and they were able to provide them. They had a 'musty feeling' TV room and dvd player which we used and no other guests did, however there were not too many English chanels available. Our solution was to buy videos at the supermarket in Ubud for $2. The food was very good and the service excellent,all the staff are so friendly. The pool is nice and the was a spring pool too. The spa was a little pricy (15 American dollars was just for using the pools) but a unique experience as it is a very ornately decorated groto nr the ravine with a hot pool and an icy one side by side.An added bonus was they provided a free shuttle service into Ubud, which is also walking distance.I did enjoy staying at this hotel very much, despite the lack of facilities(dont let this put you off as you can ask for the electrical things if you want them) it's beauty and character did make up for it.", "Date": "Apr 27, 2008", "ReviewID": "UR763134293", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "suzieH71"}, {"Content": "great place to relax We stayed for 4 nights in the Arie Smit 2 in Hotel Tjampuhan and had a magnificent time. Though it was the rainy season, we usually only had rain late in the afternoon or during the night. The rain added a beautiful lustre to the lush gardens and water fountains and pools. In the mornings looking out across our verandah, it seemed like the beginning of the dawn, so calm and mysterious.Our room was spacious and comfortable. We forget all modern cons including reading the paper on holidays, so the lack of this in our room was a great plus.The bathroom is a good size, though perhaps may need updating in the future, nevertheless the plumbing and hot water worked without trouble.We enjoyed all meals from the romantic restaurant overlooking the estate. The shuttle bus is a definite plus and we also used it to see the company's other resorts, which we found worthwhile.The only minuses would be, if physically steps and slopes were impossible to undertake. Otherwise, it is a fantastic holiday destination.", "Date": "Apr 5, 2008", "ReviewID": "UR257645428", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "walkabout2008"}, {"Content": "Recommended       A room with a view", "Date": "Apr 2, 2008", "ReviewID": "UR846844712", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "JCRBAM"}, {"Content": "tip the staff stayed at tjampuhan in july 2007 for 7 nights, air con raja room, beautiful room and magical gardens , staff friendly but like a small tip otherwise ignore you , shuttle bus great service try the indus resturant up the hill the view is like heaven, going back this may for 5days cant wait , pool lovely but cold massage worth every penny breakfast YUMMY HAVE FUN", "Date": "Mar 5, 2008", "ReviewID": "UR771774879", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "stacynsw"}, {"Content": "What A Let Down My Husband  I stayed at the Tjampuhan the last 3 nights of our trip, up to New Years Eve. We were pretty disapointed with our stay.We found the room to be completely outdated, particularly the bathroom. First the toilet wouldn't stop running then the flush handle broke. When you took a shower the plug hole wouln't drain away. Very unpleasant.On two occassions we had snake's appear in our room, which we found quite entertaining, though I feel that the entrance door should be more sealed to prevent this from happening as the bright green coloured snake, I am told is quite venemous.I really loved the sound of nature at night, that was lovely but something I'm sure you could find at many other places in Ubud.We found the gardens to be very beautiful, but the location of the pool and seperate bar facilities quite unapealing.The breakfast was nice, especially the banana pancakes, but would I stay again? Nooooo!!!!", "Date": "Feb 7, 2008", "ReviewID": "UR456155059", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "TOO-NEW-HORIZONS"}, {"Content": "my time at the tjampuan The Hotel Tjampuan was a great place to stay for my week in Bali, the staff are friendly and the service good. My room was spacious and well serviced. The breakfasts were so filling that only one more meal was needed each day. They could have some type of entertainment at night though. The location is an easywalk to the centre of town or catching the hotel shuttle takes about 5 minutes.Use the spa for a massage and you will be rejuvenated.I ould stay at this hotel again without any reservation.", "Date": "Dec 23, 2007", "ReviewID": "UR276209713", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "rosemaryak"}, {"Content": "Absolutely gorgeous After 3 days in sanur (Gazebo Hotel), we moved on to Ubud for 4 days. We rented the the Walter Spies House for our 4 grown children and a separate suite for my wife and I.We found the Tjampuhan to be quiet and relaxing and yet close enough to town. The property is made up of several bungalows down a hillside and are connected by narrow paved pathways. Therefore, they provide a great deal of privacy and quiet with sounds and sights of nature all around.Very little interaction with the staff, other than getting our morning tea delivered to the room (enjoyed on the terrace amidst nature). But they were quite attentive and when needed.Shuttle service to town really works. Shuttle service FROM town can be a problem as we had to wait 45 minutes or so on one occasion, before realizing that it is best to call for it 30 minutes in advance (like when you are having desert).2 swimming pools. We preferred the natural pool and had it to ourselves each day.Still look at the videos of the place fondly. Yes, we would stay there again.... except there are so many other places to visit in this world of ours and new destinations being created as we speak....Good luck and enjoy. Great for the money in Ubud!!", "Date": "Nov 20, 2007", "ReviewID": "UR189174757", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "4"}, "Author": "vinooram"}, {"Content": "Loved it!! We had booked into the Tjampuhan Hotel for 3 nights but as we liked it and Ubud so much we stayed an extra night. The hotel is very unusual. When you see the reception entrance you don鈥檛 expect the oasis which is behind it. Once inside the hotel, you don鈥檛 hear any noise from the road outside and it really is a haven! The hotel website does not do it justice at all!!The hotel layout, d茅cor and surroundings make this hotel special. There are stone carvings all over the hotel grounds and they are breathtaking. Take some time to explore the hotel grounds, check out the spring pool and the temple across the river. The pools are lovely and relaxing. We did use the spa for one day and had a massage by the river, it was lovely but after checking prices in Ubud we got the rest of our spa treatments in the town as they were considerably cheaper. That said, we did enjoy the spa in the hotel and don鈥檛 regret checking it out.The staff were lovely. There were staff everywhere and they offered excellent customer service. They were genuinely friendly, always very helpful and polite. The breakfast was lovely and set us up for the day. There are lots of steps so the hotel is not ideal for older people or young families. We stayed in one of the cheaper rooms (Pula 6), it was clean and spacious. We could have opted for one of the more luxurious rooms 鈥?which looked lovely, but decided to save some money for the spa!I would recommend this hotel and would be more than happy to stay there again if I go back to Ubud!", "Date": "Aug 9, 2007", "ReviewID": "UR322430944", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "DeirdreMG"}, {"Content": "Would never stay there again! My husband and I recently stayed at Hotel Tjampuhan this June for 5 nights. We found the hotel and rooms to be musty, moldy, dusty and look as if they have never been renovated. The location is a little ways out of Ubud and the weather was hot so we really used the shuttle service which would take and pick us up at any time. That wasreally nice because when we were ready to be picked up in town we could have the restaurant call and wait there to be picked up. While we were there they changed the policy to leaving once an hour and going to two pick up and drop off spots, so that meant walking a distance and then standing and waiting in the hot sun. Also, I find all the transport people who follow me down the street to be annoying and I don't want to use them. I spoke to the manager but he didn't care what I, the customer, wanted. Not good customer service.One of the fellows in room service was often in a grumpy mood in the morning b/c of all the steps, i didn't like the slippery steps either! So many better places than this in Ubud!", "Date": "Aug 2, 2007", "ReviewID": "UR642803496", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "Serena5"}, {"Content": "Almost perfect       Arie Smith 6", "Date": "Jul 28, 2007", "ReviewID": "UR827595826", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "pmta007"}, {"Content": "Unique experience The Tjampuhan is a unique experience. Not for people with bad knees, though - it is located on the edge of a rainforest gully at the base of which gurgles a mountain stream which turns into a gusher after rain. The villas are set in pairs, and the rooms are large, airy, beautifully kept with equally large bathrooms and a terrace on which one can sit in absolute peace and silence listening to the birds and watching the vivid plant life. No jug for tea/coffee, though, and although the willing staff tramp along at any time requested with jugs of hot water, the water is never hot enough by the time they get there. You have to BYO tea-bags/coffee. There is no fridge or mini-bar either, and the food in the hotel is famous for being pretty awful - even the breakfast is only just so-so. But the staff are lovely, and the total experience is fabulous, with a clear mountain-spring fed pool and a remarkable carved grotto in which is located the spa and steam-rooms - clean and not expensive. There is a lot of history to this hotel and anyone interested in the early expat community in Ubud would connect with it at once. We booked by phone at short notice and paid a relatively high price for an air-con room which we certainly did not need as it was cool the whole time. There are fan-cooled rooms but they are half the size of the others. The hourly shuttle service into town is completely reliable, but you can walk there in 10 minutes or find a ride with a driver - good for groups. A little overpriced for the facilities, but good fun, and so peaceful.", "Date": "Jul 24, 2007", "ReviewID": "UR786454239", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Ann-de-Mot"}, {"Content": "Peaceful,beautiful, ornate spa area We spent 2 nights near end of June.We had to wait an hour or 2 for our room to be cleaned as there had been lots of guests leaving after the Balinese celebrations.The drive from Sanur to Ubud was fantastic as it was raining heavily and there was water everywhere.The rice fields looked fantastic. We got caught down town in a down pour and entered the free shuttle back to the resort dripping wet.As the weather was wet we decided to spend our only full day at the spa.For $105 US we got a full couples 2 hour treatment-massage-1 hour and then spices and volcanic ashes rubbed into us and lunch-(meal can be taken when you are ready for it) we also could use spa pools and sauna etc.We enjoyed this luxury- the same package would cost a lot more here at home and it was a treat for us.Our room was large, but older style- no tv.There is a fridge in the room, airconditioning and a fan and armchair, couch furniture. The bathroom recesses slightly and was quite dark.It was difficult at times to work out the light switches.The pool was nice but yes somewhat in the shade.The setting was beautiful and the ornate volcanic carvings around the spa area were exquisite.We thought the hotel was beautiful and it was not an expensive stay. The staff were very accommodating.We were given a free rice wine drink on arrival and really took a liking for it and ordered with our meals.The meals were reasonably priced but breakfast is included in your hotel stay.We paid $60 NZ each for our room through House of travel and thought for the price we got good value.There is internet facilities- very cheap across the road from the hotel and cheap beer for sale.We did a further day trip from Tuban up through the Ubud area from our timeshare exchange at the Risata Bali.The carving shops lining the countryside are just incredible and if you got to Bali you must travel to Ubud and inland to the volcano. We bought home losts of wood carvings from Bali.Incredibly cheap!The scenery is spectacular.The accommodation is very step-lots of steps outside and not suitable for elderly or those with heart conditions, disabilities etc.However much of the accommodation in Ubud will be like this so check that out when considering accommodation choices.", "Date": "Jul 23, 2007", "ReviewID": "UR454088256", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "oysterfiend"}, {"Content": "Beautiful setting, but shady pool... Spectacular setting, and generous rooms are this hotels biggest plus points. Set on the side of a steep river gorge, I doubt you will find a more beautiful and relaxing setting. The sound of birds and rushing water to wake up to is fantastic.The shuttle service into the centre is great, but the walk is not actually that far with it taking between 10 to 15 minutes for a group of 9 (so walking slowly). The pool is not so good, with it being in the shade almost all day due to the tall surrounding trees. So don't come here if you want to lie around the pool all day as you will be disappointed. The staff were a mixed bunch, but generally very polite and helpful. Beware that a lot of them will try and sell you days out on the side (White water rafting, cycling etc) - they will claim to be the hotels activities coordinator but in fact they are doing it on the side and would get in quite a lot of trouble if they got caught. Its generally the waiters and bell boys. However, thats no necessarily a bad thing as the company's that do the tours are actually the same, so its best to go with the cheapest person. See my other reviews for the best tour operator.I personally didn't have the spa, but my friends did. They said it was fantastic, especially with the setting. But the treatments you can get in Ubud centre for a 10th the cost are almost as good, so probably better off going there.As everyone has said - not for anyone who has trouble with steps as this hotel really does have a lot of them.[--] seemed to have the best prices I could find for this hotel so worth a shot.", "Date": "Jul 19, 2007", "ReviewID": "UR248440174", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "mcampster"}, {"Content": "Amazing view Beautiful views! Worth a night alone.Spa center in special setting. Massage on the costy side.A pool in the shadows, but it will do.Old rooms, not to clean.Helpful reception and room service.Breakfast not worth writing too much about. Almost no food left. Good shuttle service.", "Date": "Jun 24, 2007", "ReviewID": "UR902752426", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "5"}, "Author": "wipadvisor"}, {"Content": "Fantastic views, friendly staff, peaceful environment This was such a lovely hotel. The room was a bit musty but it was the reall Indonesia. Felt like being in an Indonesian home. The shuttle service to Ubud was amazing. We used it to go to and fro and the drivers were helpful with getting a Sim card, doing laundry, getting tickets to shows so it felt like we had our own car and driver. Breakfast was a delight. But the views were the best. The pool was warm and though we didn't use it, the spa was intriguing. Would go again any time.", "Date": "May 21, 2007", "ReviewID": "UR557915423", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "trisimlin"}, {"Content": "A Great Escape If you have ever dreamed of waking in a pristine rainforest to a cacophony of bird songs and the gentle sound of a running river while the sun spills through the frangipani and hibiscus on to your private balcony, then look no further. This idyllic setting truly must be seen to be believed. Leaving a typical Balinese village street scape you are transported into a tranquil fantasy when you walk through the door.Ok, enough of my aspiring Mills and Boon **!!. My fiance and I have just returned from a trip to Bali where we spent the final 2 nights and 3 full days at the Tjampuhan Hotel in Ubud. The hotel is set over several hectares of rainforest / jungle and small clusters of 3 or 4 adjoining villas are spread throughout the grounds. The rooms are clean and comfortable with huge beds and serviced daily. The bathrooms more than adequate and impeccably clean. The resort has two pools (one is naturally spring fed and incredibly refreshing.) The spa is a must, carved stone walls surrounding natural plunge pools and massage beds in the rainforest overlooking the river. Wow !! (see pics attached) The restaurant is great and the food is terrific, as usual with resorts there is no doubt that food is cheaper elsewhere in the town, but hey this is Bali, so whatever is expensive is still ridiculously cheap !! A free shuttle takes you to and from the town at your leisure (pretty long walk otherwise) and taxis are cheap enough (about $3 AUD).Things to be aware of at the hotel, (these were in no way a problem for us and actually added to the feeling of escaping back to nature). There are no fridges, tea / coffee facilities or televisions in the rooms. (At least not the type we stayed in - there are two types and we chose the Raja as it has air con). Apparently fridges can be requested and are literally carried to your room if required. But the simple press of a phone button will have anything you desire brought immediately to you. (i.e. tea in the morning). The service in this regard and every other of the friendly staff was superb.There are a lot of stone steps, so not ideal for the frail or physically impaired. Ubud itself was wonderfull and we wish we had stayed here longer. However, we will most definitely be back and the Hotel Tjampuhan is where we will stay.", "Date": "Apr 21, 2007", "ReviewID": "UR388979757", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Matt_and_Leisa"}, {"Content": "Stunning This is really a pearl ... in the jungle.Fantastic wooden bungalows, with all comforts in a valley in the middle of the tropical forest. You will fall aleep with the lovely noise of the river, flowing down in the valley. 2 nice pools, a good restaurant, a spectacular particular spa almost ... carved in the stone, and a lot of balinese charm!!!A great stay for a very reasonable price.", "Date": "Apr 11, 2007", "ReviewID": "UR726673215", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "bruges00"}, {"Content": "Enjoyed Tjampuhan My husband and I were at the Tjampuhan for a week and a half in an air conditioned Raja room. It was lovely. As others have noted, the scenery is breathtaking. There really are not a lot of hotels with similar views in Ubud that are also convenient to town and reasonably priced. The rooms themselves were quite decent if not super luxurious. Bathroom was a bit 1980's and needs upgrading. If you just care about room (not the setting/view or convenience to town or resort pool, spa and restaurant) you can do better than this hotel. Balcony was big and had a great view. I loved this. Cleaning staff did a very good job and overall staff was super obliging and friendly. As previous writer noted they did seem to very much appreciate any tips but then who doesn't? One negative point was that staff was overly eager to volunteer offers for personal tours, personal art work, referrals to relatives' shops, investment opportunities, etc. Nice touches like flowers on the sheet turn-down every night. The hotel facility was really charming. Built in the 1920's of stone into the side of a hill overlooking a river. If you have any mobility issues though, hotel is not for you. Lots of steep steps. Hotel restaurant is excellent. I chose to eat there many times because food was so good. Service great too. You can also have food sent to either pool or your room. Daily breakfast buffet or you can have breakfast in the room. Try the french toast! Yum. Drivers will take you wherever you want to go pretty much whenever you want to leave (7 am to 11 pm) in a nice air conditioned minivan. They pick you up from town too. You are close enough to town to walk it in maybe 10 minutes but I always seemed to be going to a specific place in town so got a lift. Spa massage was pleasant enough and the setting was really wild. You have to see the grotto. Massage itself was in pavilion overlooking the river gorge. Very nice. I believe they have spa meals too if you want to eat extra healthy or vegetarian. Overall a great stay and we will come back.", "Date": "Feb 28, 2007", "ReviewID": "UR122143765", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "curryda"}, {"Content": "Beautiful... but just so-so... Just returned from a 5 night stay:The hotel is ideally located in Central Ubud - very convenient to town, restaurants, etc. Setting of hotel is stunning ! Hotel is built on side of ravine, with beautiful river at bottom. Gave us the feel of being in a lush jungle.Hotel offers complimentary shuttle service anywhere in Central Ubud. (they say, shuttle departs hourly; however they were ALWAYS avail to take us at whatever time we needed).We stayed in River 3, gorgeous view right at the river and next to the Natural Spring Swimming Pool. The room had a huge front terrace that overlooked the river! The room's interior and bathroom were just okay. Furniture was a tad dated, but in good condition. Housekeeping was NOT GOOD! It was obvious that room had only been given surface cleanings vs. periodic deep cleanings. There was LOTS of dust and grime (kind of like smoker's grease!) on lamp shades, paneling, telephone, and light switches.Ate in main restaurant for dinner on 2 occasions. Food was good, and fairly priced. Breakfast buffet each morning was fine: Coffee/Tea, choice of 2 juices, 3 fresh fruit offerings, banana crepes, sausage, hash browns, sausage, rice, and omelet station were the norm each day.The overall service at this hotel was fair... the staff really didn't seem that enthusiastic about their jobs...a few smiles and pleasantries here and there; but for the most part -they were quite dower.Supposedly tipping is optional / not necessarily the norm in Bali (per books we had read). On most bills you will be charged plus plus - tax  tip.Being from the West, we typically like to give some extra - to make it 15 - 20% based on service, and did so on Bali.Periodically we'd get so-so service and would just stick with the plus plus. You should have seen the disappointment in the server's eyes! Also, on check out day, ALL come around to say hello, good bye, and come back to see us! (I felt like all had their hands out !)... So, whatever you read in the tour books about how tipping is optional, please note, it is NOT optional (it is expected !)Again, the location of the T'Jampuhan is great, and the scenery just gorgeous. I'm glad I stayed here; however will most likely try somewhere else on my next visit to Ubud.", "Date": "Jan 6, 2007", "ReviewID": "UR819713346", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "DDunn"}, {"Content": "It was fab!!       In front of the restaurant", "Date": "Jan 3, 2007", "ReviewID": "UR870667924", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "diormanolo"}, {"Content": "So much character This place is just oozing character....the gardens are beautiful and lush....because of its location at the bottom of the valley, its always shaded and has a cool, fresh feeling to it. rooms are large and has old balinese antiques.... service was superb...we asked for a sewing kit, and a lady came to sew our buttons back on! talk abt going the extra mile! don;t miss the spa....u can get a massage practically next to the river...gorgeous, loved it.", "Date": "Dec 7, 2006", "ReviewID": "UR648610962", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "fariny"}, {"Content": "you will love it!       offering", "Date": "Sep 21, 2006", "ReviewID": "UR960744735", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "skyfyre.x"}, {"Content": "Lovely hotel We spent 3 nights here whilst tourning around Bali. The staff were very helpful and friendly. The room was spacious, with a balcony overlooking the gardens going down to the river (very steep). It is perched on the side of a steep gorge, and consequently there are many steep steps from the lobby/restaurant down to the rooms, pool and spa. It was slightly alarming first time when we arrived after dark!. The hotel, and room did have a slight damp feel to it, so I am not sure what that would be like in the rainy season.On our first night, we ate in the restaurant, and they had the Ramyana Ballet there which was wonderful. This was the only night that we ate in, going into Ubud. We took advantage of the on call shuttle bus to go into Ubud, and to be collected. We asked the restaurants, and tourist office to call for us when we needed collection. The pool, and sunbed does become shady readily, but since were out and about often this was not a great drawback.We enjoyed our stay here, and would recommend it.", "Date": "Aug 18, 2006", "ReviewID": "UR681327310", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "mag1calspider"}, {"Content": "love this hotel I have stayed at this hotel three times and are heading back again this year. When i first selected it, it was described as a budget hotel and I found it absolutely charming. It is scenic and very balinese in style. The only drawback being the steps if you have bad knees etc. It is now described as first class and about twice the original price per night that I had first paid, but it now has a spa section and accomodation in Ubud is becoming very boutique and more expensive.I rate this one as very enjoyable, and very relaxing....p.s. there is no fridge, phone, TV etc so maybe not so enjoyable for the techno adicts", "Date": "Jul 23, 2006", "ReviewID": "UR600496442", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "jarrah111"}, {"Content": "Cultural and lovely We have just had three nights at this lovely hotel. The location is sensational, built into the side of a hill with views into tropical forest, distant villages and temples. The rooms are very comfortable and well apppointed. The decor is not new but has a nice heritage feel as does the whole hotel. The gardens and buildings are full of antiques, stone carvings, and architecture that is clearly from a bygone era, all very well cared for; we loved the feel of the place. The staff were really friendly and helpful. The spring fed pool was just great and a good place to be after being out and about. The hotel provides an on call  shuttle to Ubud and you can pre arrange or phone for a pick-up. It's ony a short 10 minute walk into town anyway. The only down side was the food at the hotel, breakfast was OK and on the night we ate at the hotel for dinner, the meal was rather poor. Better to head into Ubud for a good meal. All in all very good value for money. They gave us a room upgrade without being asked also. We would stay there again.", "Date": "May 30, 2006", "ReviewID": "UR135381301", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Marin_8"}, {"Content": "Beautiful place!!!   showReview(5079002, 'full');", "Date": "May 16, 2006", "ReviewID": "UR879622542", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "BaliLover"}, {"Content": "what a lovely place   showReview(4589511, 'full');", "Date": "Mar 6, 2006", "ReviewID": "UR940772081", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "rrrjjjmmm"}, {"Content": "Loved Tjampuhan... still trying to get my toungue around the name!       Our room balcony", "Date": "Jan 27, 2006", "ReviewID": "UR363632703", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "barrattt"}, {"Content": "The Tjampuhan is amazing   showReview(4077126, 'full');", "Date": "Oct 31, 2005", "ReviewID": "UR348755305", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A Wonderful Place in Ubud   showReview(3945910, 'full');", "Date": "Sep 28, 2005", "ReviewID": "UR582212242", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "CAamigo"}, {"Content": "Wonderfully child friendly   showReview(3633682, 'full');", "Date": "Jul 4, 2005", "ReviewID": "UR256337499", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "StrawberryQueen"}, {"Content": "Heavenly   showReview(3555177, 'full');", "Date": "Jun 15, 2005", "ReviewID": "UR675459057", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lunarmeow"}, {"Content": "A real paradise place !!   showReview(3224063, 'full');", "Date": "Feb 23, 2005", "ReviewID": "UR725666855", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "dutchguy"}, {"Content": "Most romantic and relaxing place   showReview(2841719, 'full');", "Date": "Nov 22, 2004", "ReviewID": "UR478611933", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The Tjampuhan needs an urgent update!   showReview(2837566, 'full');", "Date": "Nov 21, 2004", "ReviewID": "UR923391015", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "astro50"}, {"Content": "Tjampuhan, oui ... mais       un des pavillons dans le jardin du Tjampuhan", "Date": "Jan 3, 2009", "ReviewID": "UR929063171", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "Balikecak"}, {"Content": "Zu busy   showReview(19937599, 'full');", "Date": "Sep 9, 2008", "ReviewID": "UR383047748", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Konsi"}, {"Content": "Bel hotel dans un cadre verdoyant       Chambre Rdv Walter Spies", "Date": "Sep 2, 2008", "ReviewID": "UR278924313", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "coropied"}, {"Content": "UBUD銇嚜鐒躲倰婧€鍠?#x201d;   showReview(19912066, 'full');", "Date": "Aug 31, 2007", "ReviewID": "UR139332957", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇俱亗銇俱亗銇犮仺鎬濄亜銇俱仚   showReview(19911948, 'full');", "Date": "Aug 14, 2007", "ReviewID": "UR501900069", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "che magnifica sorpresa   showReview(8084247, 'full');", "Date": "Jul 9, 2007", "ReviewID": "UR204111725", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "adelt17"}, {"Content": "25骞淬伓銈娿伀娉娿伨銈娿伨銇椼仧   showReview(19910745, 'full');", "Date": "Sep 3, 2006", "ReviewID": "UR368145344", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "鑷劧鐠板銇腑銇с仚   showReview(19929441, 'full');", "Date": "Dec 1, 2004", "ReviewID": "UR578688903", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銉儞銉笺倰鎶溿亼銆佹笓璋枫倰...   showReview(19924662, 'full');", "Date": "Jan 30, 2004", "ReviewID": "UR380370304", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銆€鍊ゆ銇畨銇勩伄銇€佺礌...   showReview(19922561, 'full');", "Date": "Oct 31, 2003", "ReviewID": "UR641593706", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d309357-r22881874-Hotel_Tjampuhan_Spa-Ubud_Bali.html", "HotelID": "309357", "Price": "$113"}}