{"Reviews": [{"Content": "Paradise in the Paddies Waka di Ume is a beautiful experience, at the same time completely rustic and entirely luxurious. The cottages open up to rice paddy fields. You have breakfast surrounded by lotus blossoms rising out of the fields, and dinner greeted by the fireflies.The staff - Lasmini, Sudiari, Karmana, Sumitri and others - wrapped in sarongs present an aesthetic delight. Their warmth is touching. Great service. Oh, and the women carry large platters on their heads in which they bring you delicious pineapple juice, a splendid nasi goreng, etc.We loved the experience!", "Date": "Jan 8, 2009", "ReviewID": "UR420514712", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "insearchoflight"}, {"Content": "amazing place--you will feel great after staying here We ABSOLUTELY loved the Waka di Ume. What an amazing place--gorgeous, beautiful location. huge luxurious rooms, amazing staff, fantastic food. We can't say enough about the place, everything was perfect. We had massages everyday and ate the most amazing fresh meals overlooking rice paddies and the valley or sitting alone in the sit on the floor dining room. Their staff was amazing and one day we hired a driver from the hotel--Wayan-he lives down the street who took us all over the place (8 hours) whereever we wanted for just 50 usd (that was a year ago. We also stayed at Waka Nusa on Nusa Lembongan and it too was magical.One thing, the Balinese are so poor but so kind. If you have things you don't want, give them to the hotel staff or people you meet of the street. They are so grateful. We want to return. It was the best vacation we have ever taken behind a safari in Kenya.", "Date": "Nov 21, 2008", "ReviewID": "UR981160100", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "scubamaui"}, {"Content": "It's all true...       From the open air restaurant", "Date": "Nov 11, 2008", "ReviewID": "UR867808405", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "tappy43"}, {"Content": "Peaceful experience, fantastic staff On arrival we were upgraded to a Terrace Villa which was amazing - beautiful balcony to watch the ducks in the field, or local kids flying kites in the rice paddies - i've rarely felt more tranquil!It's only a small resort, but the staff have great hearts - they were awesome with our 2 year old daughter. The resort feels so very Balinese (isn't that the reason for travelling to Bali) and the location was great. Food was *far* superior to what we were expecting, and considering how cheap the resort is, standards are very impressive. It's not a slickly run luxury resort, but a lovely small hotel with a heart.", "Date": "Sep 17, 2008", "ReviewID": "UR798734284", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Moonchild123"}, {"Content": "quite peaceful       lanai garden twin room", "Date": "Sep 8, 2008", "ReviewID": "UR781350980", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "garbo"}, {"Content": "Not our place The Waka di ume is a nice hotel, but we found out that it is not our style.Meaning, we were booked for 5 nights, but after the first hour in the room and examining the hotel and the room we decided to only stay one night.The room was nice, but the fact that our room felt like it was in the middle of the hotel ( you hear every word of the people walking by) and the fact that the peasants working on the rice field had a straight look into our bathroom and bedroom....that wass not our style.Also realising that the bathroom and the bedroom were in litererally one room (!!!!! ) ...also not our style as it gives ZERO privacy.The pool looked nice, but being in the shade not interesting to jump in. Also it is kind of small for what we expected.The breakfast was a bit disappointing, after staying before in Nusa Dua where all hotels have huge breakfast buffets, the small a la carte selection of Waka di Ume breakfast does not rub you quite well.Last to say, the staff was always extremely nice, and did an excellent service. I think the hotel can be a nice place, it just was not meant for us and our expectations.", "Date": "Sep 4, 2007", "ReviewID": "UR335273536", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "dana_christian"}, {"Content": "Will definately return I have just returned from a weeks stay at The Waka Di Ume Resort and i would return there tomorrow!I went with a girlfriend so not a romantic getaway however we so enjoyed the whole experience. The grounds, villas and staff were amazing. Friendly, informative and fun. The spa was beautiful, one of the best we'd experienced. One thing we felt was missing was a quite bar / lounge for guests to meet for pre-dinner drinks, a place to swap adventures, learn of hot shopping spots, tours etc. It could be used for promoting inhouse activities or just relax back and listen to some local music. The upper level above the resturant would be an ideal location. All in all we absolutlely loved our stay and will return.Thank you", "Date": "Jul 12, 2007", "ReviewID": "UR840233961", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Sydney67"}, {"Content": "Didn't work for us at all. To begin with, they had rooms aplenty and at 3pm still wouldn't bargain. In the end we decided to stay in the expensive pool villa.We had relaxed, lay by the pool and then the Manager burst in telling us that we had to move. Clearly that had had another offer for the room. No apologies.We moved into the standard room. The sheets were musty and there was a dusty feel to the room.The view over the rice paddies was nice.The complimentary bus to take you in and out of town left us stranded in town three times!The pool was fabulous, unfortunately we didn't use it as it was in the shade and Ubud being in the mountains, the temperature was a little cooler than the coast. Had the pool been in the sun, we would have been in it.Breakfast buffet was sparse - two kinds of fruit and some cold toast.Ants in the room, bugs all over the bed, blood on the sheets.Booked the room with a US Dollar rate though at the end their exchange rate was a little dubious and as an Australian we paid AUS 400 for what was quoted as US 200 - doesn't quite make sense to me. No correspondence would be entered into by the nasty lady at reception.Grounds were nice, pretty flowers though.", "Date": "Jun 19, 2007", "ReviewID": "UR961565814", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "panfarfan"}, {"Content": "Our Second Home After travelling to Bali every year for over 10 years we have come to regard Waka di Ume as a second home. We were married at Waka di Ume in 2000 and I would highly recommend it to anyone wanting a wonderful Balinese style wedding experience. The hotel staff are fantastic . They are quieter than staff in some hotels we stay in which fits in with the whole ambiance, they are always there when needed and some of the long standing staff have become good friends. This hotel is only for those who want to experience the peace that Bali can offer. There is nothing better after a day out shopping or travelling to return to the tranquility that is Waka di Ume.", "Date": "Apr 6, 2007", "ReviewID": "UR730069439", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "NatnDave"}, {"Content": "Our paradise escape I found this resort to be one of the best i have stayed at in Bali. After shopping for my business it was so relaxing to come back to such a quiet and serene resort.The rooms are exquisite and the attention to detail above average. The pool is inviting and the new spa is the best in Bali. We found the staff friendly and more than willing to to help in every way they can. My waitress Lasmini has become a close friend and excells at her work. Your stay at the Waka will leave you feeling like you have had the best holiday ever..", "Date": "May 28, 2006", "ReviewID": "UR970316201", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A great idea but not quite there The hotel is pleasantly situated amidst typical Balinese rice paddies a short distance north of Ubud. The concept of the hotel is a good one but it doesn't quite work. The views across the rice fields are somewhat diminshed by the next villa complex about 300m away. The pool area is attractive but shaded and rather small and during our stay was rather affected by building work for the hotel's new spa. Service was very variable. The hotel had overbooked the rooms and we found we had to move during our stay. Yes they did put us in a suite for our first two ( out of three ) nights but there was no apology forthcoming for the disruption caused. there was a long disagreement over the bill when checking out and in general the management were unhelpful. The rooms were beginning to look a little tired and there seemed to be little attention to general maintainence. All in all not somewhere we would return to.", "Date": "Sep 7, 2005", "ReviewID": "UR409496932", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "superbe hotel   showReview(22716348, 'full');", "Date": "Dec 14, 2008", "ReviewID": "UR507060512", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "lunevilleNormandie"}, {"Content": "涓€鐩儦銈?#x201d;   showReview(21862644, 'full');", "Date": "Nov 15, 2008", "ReviewID": "UR559535006", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "3"}, "Author": "jyaran"}, {"Content": "Le paradis sur Terre       vue de notre terrasse...", "Date": "Sep 19, 2008", "ReviewID": "UR316269018", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "julien75"}, {"Content": "銉嗐儵銈广亱銈夈伄鐪恒倎   showReview(19955319, 'full');", "Date": "Sep 25, 2007", "ReviewID": "UR852881167", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銇ㄣ仸銈傞潤銇嬨仹銈嗐仯銇熴倞閬庛仈銇涖伨銇欍€?#x201d;   showReview(19955306, 'full');", "Date": "Sep 21, 2007", "ReviewID": "UR358222309", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇仒銈併仸銇偊銉栥儔婊炲湪   showReview(19955181, 'full');", "Date": "Jul 21, 2007", "ReviewID": "UR862193228", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鐢板湌棰ㄦ櫙銇絿銈€闅犮倢銉淬偅銉?#x201d;   showReview(19955115, 'full');", "Date": "Jun 14, 2007", "ReviewID": "UR117686702", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d309331-r23366043-Waka_di_Ume_Resort-Ubud_Bali.html", "HotelID": "309331", "Price": "$171"}}