{"Reviews": [{"Content": "Being As Nice As I Can ! We arrived here after a week at Langham Place Mong Kok and were truly under no illusion - we knew it had that 70's vibe from the info and pics and were not expecting luxury. The hotel caters mainly for Hong Kong people coming over for functions and the weekends - there was no special treatment for us as UK tourists and we got the feeling that, although civil, staff could take or leave our business ! Staying there was a bit like staying at someone elses large house - there was a reluctant politeness from everyone we encountered. Our 1st room was straight out of Crossroads Motel .... we asked to change and were given what they may have considered 'contemporary' - this was a bare stark room with silver-effect lamps and little else - the bathroom was like something out of an 1980's caravan - how we would have showered there I don't know .... as it was, it didn't come to this as we discovered the more updated room next door and asked to move for a 2nd time. Although more updated, the rooms were not without their problems - daily cleaning being a particular worry - a glass shelf covered in dust in which we wrote Please Clean Me remained intact with the wording for the duration of our stay ( 1 week ). Bulbs were out of action, human hairs stayed on the dodgy balcony (do not venture out there, they are going to 'go' any time now) for several days ..... stains in the bathroom seemed worringly to escape the daily cleaning regime .... I could go on ..... Breakfast choice was toast/fruit and cereal ... or 2 eggs and bacon or sausage .... end of !!! Orange juice was dusty - eggs seemed to bypass the cooking process and the cutlery was original 1974 silver, complete with tainted surface. To be honest, it was a disgrace and we gave up after day 2 and ate at McDonalds. This place has well had its day - I am really sorry to be so negative, the beach view was superb and if you had been staying here in the early 70's you would have thought it was cutting edge, but disapointment is definitely on the cards if you book this place. Incidentally, harbour restaurants in Cheung Chau are fantastic (although the better ones suddenly don't have a table for you on special days of which the Island seems to have at the drop of a hat !) but outside of this, there is really not very much else .... the Island is geared towards their 'own' tourists, which is fine, but we felt somehow 'in the way' and not particularly welcome most of the time. Tourist info assures you that there are no cars on the Island - however, the narrow streets are inundated with all manner of wheely things other than cars - bikes / strange tractor type things - you name it - and dogs are everywhere - there is definitely a stark, industrial and depressing feel about the place, but with a beach. Some graffiti (unusual in HK) left intact over the beach area reads [--] and has also 'missed' the periodic clean-up ... I guess this just about sums it up . I will return to HK and will stay in Kowloon and Central and maybe get the ferry over to Cheung Chau for an early evening meal .... and then leave.", "Date": "Oct 8, 2007", "ReviewID": "UR181181504", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "4"}, "Author": "wayneyboy35"}, {"Content": "Excellent value We were somewhat hesitant to choose a hotel at some distance from downtown, but this turned out to be an excellent choice. The price was great for a 3-star hotel and the rooms, at least on our floor (5th) had been recently renovated and were spotless. Our room was big enough to acommodate a mattress for our young daughter. The staff were very helpful and provided us with a free upgrade to an oceanview room, since it was the off season, thus giving us the sound of the waves to lull us to sleep. The island itself is charming, with lots of cheap eateries and small supermarkets. With no cars, buses or motorcycles, walking is a real pleasure. The trip to Central on Hong Kong Island was a relaxing way to start and end the day - it takes 30-50 minutes, depending on if you arrive for a fast or slow ferry. We never had to wait more than 20 minutes and the Octopus card made paying a simple click on the turnstile. On balance, a very good value hotel (although the price increases significantly during the peak season) with easy access to all of Hong Kong's attractions.", "Date": "Mar 28, 2006", "ReviewID": "UR686445035", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A Different Hong Kong My first night in Hong Kong I stayed at the Renaissance Harbourview, a typical 4-star business hotel. It was quite a shock when my business contact took me to the Warwick Hotel on Cheung Chau for the remaining 6 days. Cheung Chau is a small island hidden from typical visitors - this is not the Hong Kong you see in the brochures. It has a feel of mainland China with the added quirk of being home to several excentric expats. The pace is very relaxed, with no cars on the island although there is a little ambulance that looks like a really old golf cart on steroids. The Warwick is a leasurely 10 minute walk from the ferry. English is not widely spoken but the locals are very friendly and will try to help.The Warwick hotel is a six-story hotel from the seventies that really would benefit from upgrading. I was initially disappointed with my room, but it was clean and reasonably spacious by Hong Kong standards. Plus everything worked in the room. The manager spoke reasonably good English and was very helpful. We got into conversation and spent 15 minutes haggling over an upgrade to one of the large suites. Having the extra room was nice but not critical. Be sure to ask for an ocean view room, there was no extra charge and the views of the beach were relaxing.Interestingly, the best thing about this Hong Kong hotel was that it wasn't in Hong Kong! For anyone who has not been to Hong Kong, it can be sensory overload: there is always one more restaurant, one more sight, or one more bar. Cheung Chau is served by two ferries: the fast ferry and the slow ferry. Both depart from, and arrive at, the same piers. The only differences are the speed and the fact that you can sit outside on the slow ferry. The ferry ride allows you to wake up gradually and prepare for a busy day, or relax and unwind on the way home.There are a couple of small restaurants near the pier that serve surprisingly good food. Cheung Chau serves up two final treats: on Friday night a mass of Hong Kong young couples decend on the island for romance, all very civilised; and this is probably the only place in the World that doesn't have any roads or cars, yet has a McDonalds! You can order breakfast at McDonalds right opposite the pier and wait for your ferry to arrive. Arrive a bit late and you can get your breakfast to go, and take it on the ferry.", "Date": "Nov 23, 2005", "ReviewID": "UR419796380", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Une bouffee d'air a proximite de Hong Kong   showReview(11417378, 'full');", "Date": "Apr 29, 2007", "ReviewID": "UR563750020", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294217-d309419-r10055061-Warwick_Hotel_Cheung_Chau-Hong_Kong_Hong_Kong_Region.html", "HotelID": "309419", "Price": "$130"}}