{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Terrible service, overpriced”", "Author": "Ronthebear", "ReviewID": "UR128326535", "Content": "Went to a wedding hosted here. Prices were way too high and they nickled and dimed us for parking and breakfast, bellboys we never used etc. It took them an hour to get our room ready and then they put us in the wrong room without a sofa fold out bed like we had booked. then we had to wait another 30 minutes for another room. Also the sheets and blanket for the extra bed were musty. The breakfast also was pretty bad and cost $16. Do not stay here or have your wedding here.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Tampa", "Title": "“Rip off.”", "Author": "KommandantTampa", "ReviewID": "UR127734287", "Content": "This hotel is not at all a 3 star experience. Maybe a minus 1 star would be more appropriate. Rude help, unreasonable prices, dirty room, and generally this place offers a poor experience. I'm surprised that they didn't charge my wife and I for air and through it all, they behave like they have the corner on the nice hotel market. If you don't like paying too much, being treated poorly, and being made to feel like you came from another planet because you don't speak Spanish, you won't like this place. Particulars you ask...Air Conditioner made the room sound like an airplane taking off, nice linens are a foreign concept to this place, food is expensive and awful, but above all the staff is very rude when you bring up any problems to them. I am not a complainer, but I am angry with this place. I have been in 72 countries, I speak two languages other than English, and I have been around the world at least 10 times. Because of my experience, I feel that I can honestly say that this hotel is a dump and you should spend your money elsewhere.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Top resort”", "Author": "Laurence H", "ReviewID": "UR126661683", "Content": "I recently spent 5 nights with my wife and 3 year old daughter. We were always greeted by sincere friendliness by everyone. Service could not be better. Amenities were well above expectations. Luckily my wife's family lives nearby, so I am looking forward to staying there again and again.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "SAN JUAN, PR", "Title": "“THANK GOD IT WAS ONLY ONE NIGHT”", "Author": "BIGT60", "ReviewID": "UR126408020", "Content": "What ever you do, do not get room #106. This room has some machinery behinfd it which makes a really loud sound every 20, 30 or 40 minutes. You won't be able to sleep. The sound is like an air conditioner compressor re-starting. Even my fiance which is a sound sleeper complained about the noise. The pillows are not good. One is long the other one is a big square one??? We've stayed in this hotel many times and is nice just try to get your rooms past the David Cookies...", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sharon, Massachusetts", "Title": "“Great Stay!”", "Author": "val-from-sharon", "ReviewID": "UR126009204", "Content": "this is a great resort - very clean, great pool area, and a very nice beach. We stayed there almost an entire week (We first rented a house in Guayama, which turned out to be horrible, and moved to the Windham after suffering there for 2 days) During the week, not a lot of people, so we had the pool area and the beach almost entirely to ourselves. the staff is VERY friendly, and helpful. there were a few minor issues, but as the staff resolved everything ASAP, they're not even worth mentioning. If we come back to PR for another vacation, we most likely will stay there again!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North Dakota", "Title": "“One Night Stay Feb 18, 2012”", "Author": "bs4u2c", "ReviewID": "UR125501394", "Content": "The Sheraton over booked the hotel we were scheduled to stay at, but made arrangements for us to stay here at the Wyndham. It was about an hour taxi ride from the Sheraton PR Convention Center. The staff was very friendly and accommodating (Mayerling). The room was average, but the pool area, grounds, and beach, which was a short 3 minute walk, were all beautiful. We ate at the restaurant, service was slow, the food was pricey, but the meals were very good. I would stay here again, a rental car would be a good idea.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful Vacation - Staff exceptional”", "Author": "Caribear", "ReviewID": "UR125245728", "Content": "Just returned from a 5 night trip to the Wyndham Garden at Palmas del Mar. This was our third trip back to Palmas del Mar and each year, the hotel management and staff make us feel at home. Palmas del Mar is a hidden vacation spot with a relaxed atmosphere and what makes this hotel so special is the staff. Flavia - you and your team at the Wyndham Garden are AWESOME.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lehighton, Pennsylvania", "Title": "“Wonderful time had by all”", "Author": "Allentowntoboston", "ReviewID": "UR124400521", "Content": "Just came back from a wonderful stay at the Wyndham Garden at Palmas del Mar. The staff was wonderful, the hotel immaculate, the pool was spectacular. Two negatives were the pillows had a funky oder and the food in the restaraunt left much to be desired for the price. They have minimal handicap accessibility, although they said they are currently out for bids for elevators. The beach is a very short walk and it's gorgeous...heavy rip tides though. I can't begin to describe the hospitallity of the front desk staff!! They were amazing!!! I even made $112 in the casino at a penny slot machine (paid for dinner) :-) I had my twin 17 year old nieces with me and didn't give a second thought to them walking anywhere on the grounds at any time of day or night. Good, safe, family oriented hotel. We'd go back in a heartbeat!! Thank you so much, Maya!", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Wonderful Visit”", "Author": "thiawroane", "ReviewID": "UR123041392", "Content": "From January 9-11, I visited the hotel. Check-in was efficient, and we settled in to our room. The air conditioner was absolutely frigid, and they had to make a service call. The room had high speed but no wifi. It appeared newly renovated, and the amenities (coffee, towels, etc.) were of good quality. The pool was a little cold, but the hot tub was fine. There is a private beach, but the surf is very rough. Only very strong swimmers should even attempt to go in the ocean. We had dinner at the nearby plaza, which has several restaurants and a nice town square feel. All in all, a wonderful stay!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bronx", "Title": "“Beautiful grounds and great customer service”", "Author": "trishv719", "ReviewID": "UR122847351", "Content": "We stayed at Wyndham Garden from January 2 - 6th, 2012 and had a very pleasant stay. The front desk was always very happy to assist and we were greeted warmly by all staff we would pass by. The room was very nice but needs to be upgraded (old TV, no dresser for makeup....). The amenities are nice, Trueblue spa! We had a leak problem in the room and they quickly came to resolve the issue. The grounds are beautiful and very relaxing. The pool is nice, but we did not go in, was cold and seemed to not be heated. The beach by the hotel is not for swimming at all, and the surf was rough while we were there so we travelled elsewhere for beach fun. The negative things I found were that you have to pay for parking (you need a car to get to Humacao and travel around....nothing in the area in terms of activities), no elevator so you have to either bring up the luggage yourself or use bellhop service, no ice machine in the building we were staying at, and the food is way overpriced for the value. My boyfriend and I had a couple of drinks, a sandwich, and an order of wings for lunch at the pool bar and it came out to $68 dollars, which is ridiculous and the food was only average...My suggestion, eat elsewhere. Overall the customer service and scenery are the +++ for this hotel. They are also in process of renovation so things will most likely improve.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, CA", "Title": "“Best hotel in Puerto Rico!”", "Author": "roydio1948", "ReviewID": "UR118344063", "Content": "My wife and I stayed here for only 2 nights, first time at Palmas Del Mar, Puerto Rico, but our experience here seems like we have been there numerous times. We had what i would call a \"WOW\" experience, this is the very 1st WOW I have given to hotels I have stayed in throughout the world, I travel to SE Asia, Europe, Mexico and other places. This is the reason why it is wow- Before coming to Wyndham Garden at Palmas del Mar, we were staying at the Marriott Condado Beach, San Juan for 4 nights, we were surprised to find a bottle of wine, fruit and snacks waiting for us, I thought maybe it came from the Marriott management for being Elite members, but when I read the card, it was from Limarie Moral, ByRequest Coordinator of Wyndham Garden, the note read that they were very excited and looking forward to our stay at their hotel, no hotel has ever done this before, to take the time to find out what room we were in and doing a little research of who we are and so forth. In addition, Flavia Bonilla, Guest Service Manager at Wyndham Garden at Palmas del Mar Hotel & Casino, saw us in the lobby and introduced herself, she knew who we were and something I have not experienced in many hotels ever. So kudos to Wyndham Garden, rest assured we will come back and stay there again, most likely for more days, extremely highly recommended!", "Date": "September 19, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "5", "Rooms": "2"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Don't waste your time or money!”", "Author": "XXTRISHXX", "ReviewID": "UR118218022", "Content": "The only reason I did not give this hotel a terrible rating is because the pool was nice, the front desk staff was wonderful, and it was quiet. This hotel had NO ELEVATOR!!! I am disabled and was forced to climb not one, not two, not three, but four flights of stairs to get to our first level room. I have handicapped parking permit, but there is no handicapped parking due to the locals parking there to visit the casino, they have no hotel handicapped parking available. And if that wasn't bad enough, we looked at the cars that were parked in the handicapped spaces in front of the hotel and one of them did NOT have a handicapped placard. We parked in the horseshoe in front of the hotel to take our luggage into our room which was a distance, by the time we got back to our car (our placard was visible but we were parked along the sidewalk) the security guard had slapped a \"NO PARKING\" sticker on our window, I was shocked and told him that he saw us unpacking the car and making several trips to get our luggage and why is he allowing a non-handicapped person to take one of the handicapped spaces, he walked over to investigate and told us, \"Oh, that is the general managers car, his private parking space is taken by the other manager\", so here we are, disabled, and the general manager who is NOT handicapped takes up a handicapped spot and then makes sure to slap a big sticker on our window that we were not parked legally! Everyone else parked along the sidewalk to unload their luggage, but due to our disabilities and the distance of our room it took us ten minutes longer to make it back to the car to get the rest of the luggage! The only good thing was the infinity pool, but I did get a rash from using the hot tub, the hot tub did not smell like chlorine the way I am used to, lets hope its not the flesh eating virus!!! The staff at the front desk was happy and very eager to help, very professional...too bad I can't say the same for the egotistical security guard!!! They had a restaurant that was understaffed and people were becoming irate that it was taking over an hour to cook their child a hotdog. There was a David's Cookies there for breakfast and snacks. I give the five star rating on service ONLY for the front desk and housekeeping staff, NOT THE SECURITY GUARD!!!", "Date": "September 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great service”", "Author": "Jomy_ap", "ReviewID": "UR115032480", "Content": "The rooms are ok, the pool is nice, great food and great service. If you want to be relax, this is the hotel for you.", "Date": "July 4, 2011"}], "HotelInfo": {"Name": "Wyndham Garden at Palmas del Mar", "HotelURL": "/ShowUserReviews-g644388-d310451-Reviews-Wyndham_Garden_at_Palmas_del_Mar-Humacao_Puerto_Rico.html", "Price": "$120 - $278*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">170 Candelero Dr</span>, <span class=\"locality\"><span property=\"v:locality\">Humacao</span> <span property=\"v:postal-code\">00791</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> (Formerly Four Points by Sheraton)</span></span></address>", "HotelID": "310451", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/85/81/8581f33fe7daa05652e93f6a6db7a54a5large.jpg"}}