{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Perfect for low-budgets”", "Author": "mawie49", "ReviewID": "UR119545110", "Content": "I stayed there for one night in June, and was satisfied with my stay. Rooms are small but bathrooms are a great size, and very clean. The overall room could use a little sprucing but I mean, for one night it was just fine. The view from the window is actually great, and if you peak far enough you can even see Sacré Coeur. We didn't take the hotel breakfast as there is a pâtisserie and grocery store right in front of the hotel. The area isn't that seedy at night and while I probably would not have walked by myself, I didn't fear for my security or my purse. Keep your city wits about you and you'll be fine.", "Date": "October 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Just okay if on a low budget”", "Author": "Babylove2011", "ReviewID": "UR117734389", "Content": "I stay in this hotel with my husband and 2 young daughters as we just wanted somewhere to sleep at night after our daily trips sight seeing in Paris. We took a taxi from gare du nord station on our first night and it was relatively easy and close. The hotel is situated in a dirty area of pigalle and there were loads of sex shops surrounding the area. We booked two rooms and the rooms had a double bed and a single bed in each of them. Surprisingly, the bathrooms were pretty big compared to reviews that I read previously and my room was quiet at night. On the down side, the other room which we booked was facing the road and the noise from the bar next door to the hotel was so annoying as they kept my husband awake all. We had to check out of the room after 2 days and we all stayed for the rest of the trip in the first room which was very quiet. If you plan to use this hotel and you want a peaceful night, ask for the rooms facing away from the road. The rooms were cleaned daily and light refreshments replenished daily as well and the staff were quite nice and friendly. The surrounding area is not really ideal to move around with kids as everywhere you turn into seems to be leaping out with sex shops. Overall, the hotel is not bad but I don't think I would be returning there due to the location.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "mumbai", "Title": "“Please avoid this hotel & area in Paris....”", "Author": "kevin_mumbai", "ReviewID": "UR117534036", "Content": "No fans nor air-conditioning in the rooms even in the hot summers. Very very noisy at night with bars surrounding the hotel on all sides. Just not worth the money you spend here. Felt very insecure staying with a family in such a shady area of Paris. Do not ever make the mistake of staying in Pigalle with family. The hotel staff was quite nice and friendly but the hotel just doesnt deserve the 3star rating it has. 5mins walk to Pigalle metro station.", "Date": "September 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Hong Kong, China", "Title": "“Cozy and friendly”", "Author": "Sorciere1307", "ReviewID": "UR32698160", "Content": "We came from London staying in a reasonably sized room and arrived at this hotel where the room could not fit an open suitcase. The bathroom is of good size and clean but the bedroom is really small with a tiny safe. So we were uncomfortable at first but thinking about the hassle of seeking for another hotel, we'd rather stay where possible. The hotel room cleanliness is acceptable and the bathroom is clean. They supplied two small bottles of bath gel to us which were replenished when totally finished. The condition of towels was acceptable. The hotel is situated near the red light district but the area on the whole is fine and safe. There are a few bistros and there is one nearby called Bistro des Deux Théâtres and the food is good. Only that they serve a fix menu of 38Euros per person, but it worths it. The hotel serves breakfast in the breakfast room from 7am - 10am and can start serving in the rooms from 8:30am. The continental breakfast is so so as I am a bit disappointed with the croissants. The ladies there don't seem to like bringing breakfast to the rooms as I guess the hotel lift is small and bringing breakfast to the rooms is a bit complicated for them, ie. to go through doors without help. The hotel staff at the Reception are very friendly and nice. They speak good English. Not a lot to say about this hotel because it is very small, \"Paris style\" I guess. Yet I think we made the right decision to stay. Finally, just to say that I booked this hotel on their website and all worked fine...AND... they have free wireless in the rooms! I would recommend this hotel if you have a limited budget. Hotels in Paris are more expensive than in the UK!", "Date": "June 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frankfurt", "Title": "“Good Stay!”", "Author": "dxffm", "ReviewID": "UR14626923", "Content": "The hotel is located just a few minutes walk from a metro station. Some sex shops were between the metro station and the hotel, but it doesn't bother us. Walkable to the Sacre Coeur Church., and this cafe area. also walk to the opposite site, Moulin Rouge is waiting. People at the hotel were friendly and polite. Room is not so big, but for sleeping, it is enough. If I come to Paris again, I would like to stay here again.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Norfolk England", "Title": "“Typically Paris”", "Author": "Mikekel", "ReviewID": "UR5911364", "Content": "Ideally situated close to Pigalle Metro station with access to whole of Paris. Within walking distance of Sacre Coeur (uphill) Previous review (2004) rather negative - this hotel is listed as 2 star (not 3 star), dodgy lift no longer dodgy! Reception area is rather small as in common with most converted buildings in Paris. Receptionist very friendly, helpful and efficient. A typical French breakfast at tables for two and four. Good service. From our room on 7th floor a great view of Sacre Coeur over the roof tops of Montmartre & Pigalle Economically priced for the area. Would use it again.", "Date": "October 5, 2006"}], "HotelInfo": {"Name": "Kyriad Paris IX Montmartre", "HotelURL": "/ShowUserReviews-g187147-d315151-Reviews-Kyriad_Paris_IX_Montmartre-Paris_Ile_de_France.html", "Price": "$87 - $131*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">55 rue Jean-Baptiste Pigalle</span> | <span class=\"extended-address\">9th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75009</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "315151", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b2/4d/b24d18124a339dccf9f40f538cb600d93large.jpg"}}