{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Louise”", "Author": "Louise T", "ReviewID": "UR126714996", "Content": "I have stayed at this hotel several times, and it never disappoints. The staff are always so friendly and helpful and this is a huge advantage. The hotel itself and the rooms are pretty, quaint and Parisian and very clean and with proper showers (yes!), super for someone from overseas. The location is fabulous, very easy to get around from here and you can see the Eiffel tower from the front of the hotel. And I absolutely love the breakfasts, the coffee, croissants and baguettes are so delicious.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Very Close to 4 Star Hotel”", "Author": "rgraham", "ReviewID": "UR126156270", "Content": "This is our favorite area in Paris. We have stayed and many nice hotels in the area. Passy Eiffel ranks highest of them all. First, the location near the metro was very good. Second, it has free Wifi. Good enough for emails. Third, the bathrooms are 4 star and have real showers. Fourth, the staff and cleaning crew are first rate. Fifth, very clean. Sixth, good beds with block out drapes. But, heating/cooling could be an issue. Room air was a little stale and couldn't figure out how to run the in-room units And, it was a little bright and noisy outside. In all, this would be one of the better places to stay in the area and would recommend with only a few reservations.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Girona", "Title": "“An immaculate hotel, but......”", "Author": "OFSO25", "ReviewID": "UR122403260", "Content": "This is an immaculately presented, clean and tidy hotel, with rooms at reasonable prices, but lacking some features which I've come to take for granted in Paris. These include tea- or coffee-making facilities in the room, an ironing board (important for business travellers who want to look smart for a meeting), and free wifi. In October the a/c in my room was switched off, a serious matter because I had to \"sleep\" with the window open and the Rue de Passy is extremely noisy all night. The breakfast area is far too small and the items on offer not particularly sumptious. The local area has a wide choice of restaurants provided you like Chinese food, otherwise, no. To sum up: a little bit more time and thought invested would make this a good hotel, but it's still somewhat off the beaten track for visitors to central Paris.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Clarksburg, Maryland", "Title": "“Very nice 3* hotel in a nice neighborhood”", "Author": "lbmd1", "ReviewID": "UR122175843", "Content": "This is a very nice hotel in the Passy neighborhood, near the Eiffel Tower and Trocadero Gardens. It's not right in the center of town, but the neighborhood is a nice one with lots of cute shops nearby. The hotel itself is clean and pretty, with modern, large bathrooms. I got one of their deluxe single rooms, which was significantly larger than I've had in other 3 star hotels in Paris. The staff was very helpful and friendly. Very good value for a 3 star hotel in Paris.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Olney, Maryland", "Title": "“Great hotel, great value”", "Author": "alliecat2842", "ReviewID": "UR122077077", "Content": "I stayed at the Passy on the recommondation of a friend. The hotel was very clean and the staff helpful and friendly. I liked being in the 16th e; I felt like I had a less touristy experince than being in some of the more popular neighborhoods. The hotel is close to several metros and within walking distance to the Eiffle tower. Also good shopping and the Passy Marche is up the street. I would stay here again.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Queretaro, Mexico", "Title": "“Pleasant stay, great location”", "Author": "DulceMR", "ReviewID": "UR121738135", "Content": "Small cute hotel, clean and well maintained facilities. I travel with my husband and the best of all its the location really near to the eiffel tower and trocadero also to the metro station. We love the bakery right beside the hotel, and the friendly staff. Superior room size is ok and a new good size bathroom. The only downside we found, is that the wifi is not free. Overall if you are looking a nice little hotel for sightseeing in Paris this is the place.", "Date": "December 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Lovely Stay”", "Author": "Jibsa", "ReviewID": "UR118069904", "Content": "Very clean and friendly in a nice area close to the eiffel tower and metro Attractive room though like all paris hotels very cosy. Nicely appointed bathroom . Thoroughly enjoyed my 4 nights here. Recommended.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Delightful, clean, well-cared for”", "Author": "Reviewer-TA", "ReviewID": "UR118031605", "Content": "This is a delightful hotel in the Passy section of Paris. We normally stay near St. Germain because we like the activity; this is quite a bit quieter. The hotel is well cared for. Nice, new bath, the room was clean, typically small like most Paris hotel rooms. The staff at the desk is helpful and hospitable. Breakfast is so-so compared to other Paris hotels and no wi-fi at this room price is a little silly. But overall, it was a very pleasant stay and we would stay here again should our travels bring us to the Passy section of Paris.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“Very nice staff”", "Author": "kayesarah1", "ReviewID": "UR115427784", "Content": "The staff was very accommodating to our family, and they were very helpful with any questions we had. The breakfast was disappointing (for 12euros), and there was not free Wifi available. The location is nice if you'd like to be close to the Eiffel Tower, but it is rather far from all of the other tourist attractions in Paris (about 20-30 minutes on the metro).", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Pleasant, Friendly Hotel in Residential Area”", "Author": "Chesapeake_voyager", "ReviewID": "UR115214782", "Content": "I stayed at the Passy Eiffel hotel in conjunction with a business trip to the OECD headquarters (about a 14 minute walk). The reception was very courteous and helpful, the room was ready as promised, and overall it was a very good choice. Our room (number 16) was small, but adequate. There was a small desk for doing work, although not a lot of surface area. Because it was on the first floor and faced the small, lovely interior courtyard, we escaped the intense sun which I assume flooded the street-facing rooms. Unfortunately we encountered a three-day heat wave in Paris, raising outside temperatures to near 100 degrees F, and the hotel's air conditioning system servicing our room was not adequate to deal with extreme heat. When the temp dropped to more normal levels the air conditioning worked fine. Internet WIFI access came with a 10 euro fee for three days. The small breakfast room served a satisfactory continental breakfast at 14 euros, but there are many patisseries in the neighborhood. The Passy metro is just a few minutes walk from the hotel as well as Trocadero. One problem I noted was that the small lift was out of order a day or two, but as our room was on the first floor, we always walked the stairs to the room so it wasn't an issue. I would certainly consider staying here again and definitely recommend the hotel.", "Date": "July 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Hidden Gem”", "Author": "Day_tripper1234", "ReviewID": "UR112649139", "Content": "This hotel was a great find! it was an attractive price in an attractive location close to the eiffel tower. Upon arrival and check in the receptionist was friendly and spoke understandable english, we then proceeded to our room which was small but enough room for us. The only thing i didnt like was the door in our room that interlinked with another. The continental breakfast was great and very tasty overall we enjoyed our stay and could see the top of the eiffel tower from our room which was great! There was also a tasty deli across the road that i would reccomend trying!", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Beautiful small hotel close to the Eiffel Tower”", "Author": "Maija67", "ReviewID": "UR104099265", "Content": "Helpful and kind staff, who spoke rather good English. Clean and beautiful hotel with a nice small garden in the backyard. We were three persons and ordered a deluxe room, which was two rooms with a connecting door, so we had plenty of space and it was practical to have two bathrooms and toilets. The rooms faced Rue de Passy, which is a small road, not too quiet, but it didn't disturb us. In the nights it was surprisingly quiet! On the other hand, the street is filled with small boutiques, cafes, small restaurants, a pharmacy - so everything needed was very close! Breakfast was delicious, but rather expensive (€14/person, even the kids!) and there could have been more choices for that price. But everything that was served, was good: fresh bread and croissants, fresh squeezed orange juice, different cheeses, lovely fruit salad and wonderful cafe au lait.!The lady serving in the breakfast room was very kind and very French! Internet connection in the lobby cost 3€/15 min, the first time I had to pay for internet in a hotel, which was a disappointment.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hillsborough, North Carolina", "Title": "“Wonderful staff and good quality hotel.”", "Author": "homebre973", "ReviewID": "UR98922357", "Content": "I spent 3 nights here to attend a conference at the OECD. The staff was wonderful--very polite and helpful. Although the room was small, it had everything I needed, and the bathroom and shower was very roomy and clean. The bed was comfortable, and the rooms quiet. This is a small hotel around the 16th. and appears to offer good value for the money. At the rate I was charged, breakfast and internet were extra.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Lovely small hotel in nice neighborhood”", "Author": "travelguy901", "ReviewID": "UR97027444", "Content": "Chose this hotel because it is walking distance to OECD. Actually neighborhood is quite nice -- residential but with lots of shops along Rue de Passy. Great boulangerie next door. Close to Passy metro. Walking distance to Eiffel Tower. Had a deluxe room facing the courtyard; very quiet. Decent size by French standards. Nice bathroom with large bathtub and \"shower\" but the shower is the French version (i.e., sit down). Staff was very pleasant and helpful. Petite dejeuner was excellent, although a bit on the expensive side (14 euros). My only complaint was that the mattress was not terribly comfortable (rather stiff).", "Date": "February 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wolverhampton, United Kingdom", "Title": "“Does exactly what it says on the tin!”", "Author": "Ruthie016", "ReviewID": "UR75572330", "Content": "From the outside you could quite easily walk past this hotel. However, when you walk inside you won't be disappointed, it looks exactly like the pictures on the hotels website! The reception staff were extremely friendly and went out of their way to make us comfortable and to answer any queries that we had. One small criticism is that the lift is small, but if you get up close and personal with whoever you're travelling with this shouldn't be a problem. The surrounding area of this hotel was beautiful. Just one stop on the metro from the eiffel tower the area had a distinctly boutiquey, villagey feel. I would most deffinitely recommend this hotel to anyone wanting to visit Paris!!", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Strasbourg, France", "Title": "“Rude night watchman”", "Author": "Millevoyages", "ReviewID": "UR75485304", "Content": "Announced late arrival, didn't get the promised room on the courtyard and the night watchman couldn't be more rude: he didn't seem to show any interest for clients and started arguing - very unpleasant experience. Rooms on the small side, but ok, nice bathroom, good breakfast and very nice staff at day time. WIFI could be free in this category of business hotel.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“Fantastic”", "Author": "AlejandroMadrid80", "ReviewID": "UR75468518", "Content": "Small intimate hotel. Well decorated, very friendly staff (Elizabeth and Rosanne), Walking distance to Eiffel Tower, and ... MAGNIFIQUE!!!!", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Excellent Hotel in a Great Location”", "Author": "CLANMARGO", "ReviewID": "UR68216874", "Content": "My friend and I found this little Gem in The Rue de Passy. Location was great - Near the Metro and The Eiffel Tower. Great room with a balcony overlooking the Tower and a Bathroom to die for. This is truly a 3Star Hotel. The staff were attentive and kind and the chambermaid was just lovely. Hope to go back again at the earliest opportunity", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“All i expected, and much more!”", "Author": "docdebby", "ReviewID": "UR65215759", "Content": "This hotel is really good value for money: convenient location, very near metro and Eiffel tower, tastefully decorated rooms (big by Paris standards), many shops and restaurants nearby (including Chinese and japanese). Very very helpful and friendly front desk. I regret not trying their restaurant, including a cute garden which would have been ideal for a relaxing breakfast. My children and I want to use it again the next time we go back to Paris.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Athens,Greece", "Title": "“Nice place, ideal location, good price”", "Author": "zoberonn", "ReviewID": "UR61027304", "Content": "It's not the most luxurious or the most beautiful hotel in Paris, but in an expensive and huge city it's one of the best choices and it's sure that it worth it's money. Located in a beautiful residential area of Paris (Passy), very close to the Eiffel Tower (10min. on foot), this hotel gives you the opportunity to feel like you live there fro years. Away from the hordes of tourists and feeling very safe, it's the ideal base you can have in Paris. There are different places to eat in the neighborhood (japanese, restaurants, bistro), or you can easily take the metro line 6 to Etoile/Champs Elysse - Place D'Italie and with change you can visit the whole Paris area. The stuff of the hotel is very kind and helpful. Maybe some of them are more \"happy to serve\" from others, but they all do a great job. The rooms are ok. At least the one we stayed it was just a bedroom with toilet and with paper walls and noisy from the street. But it's a minor problem thinking that you are in Paris and you really don't want to stay inside. I believe that this hotel it's a good choice for people that don't want to spent a fortune and no matter what it's going to be my budget next time I'm visiting Paris, I'm definitely going to keep it in my mind.", "Date": "April 11, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Location": "5"}, "AuthorLocation": "Ipswich", "Title": "“Great Location!”", "Author": "Buffy_poo", "ReviewID": "UR49893759", "Content": "......& great hotel! As long as you take on board that Paris 2*/3* hotels are not the same as the one's in the UK. This hotel was a 3*, as it was my third stay in Paris, i was mildly surprised that the room I stayed in (Room 1) had a Mini bar & an actual bath (though quite small) The room was situated in a little courtyard where you can sit outside if the weathers nice. I found the room to have all the necessary amenities. Yes the room was small, but where you're exploring the sighst of Paris, you're hardly every there! It was also the first time I could go down to breakfast at a reasonable hour (9am) and there be Croissants/Fresh Bread etc as apposed to a few crumbs. The receptionist during the day was lovely, offering to make us Tea/Coffee after a long day out sightseeing. & the main who stayed on duty never stopped smiling, despite us raiding the mini bar in the lounge! Location was also one of the main points when booking this hotel. You can't miss the Eiffel Tower when leaving the hotel! It's roughly 10mins away, with the Arc being about 20mins. Will definitely go back here next time I'm in Paris", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Madrid", "Title": "“TRES, TRES CHIC!! AWESOME”", "Author": "FreqLatTraveler", "ReviewID": "UR47173904", "Content": "If you have heard that french are not nice people, then come to this fantastic hotel. A wonderful lady will welcome you and will even teach you some french :). Great location, and cheap (for Paris standards). Everything is walking distance. 2 subway stations very close and charming little rooms. I stayed at room 1, which is in the back, separated from the main building, a total oasis of peace. Look no further. THIS is where you want to be.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "North Pole, Alaska", "Title": "“Good value for the Money, nothing special”", "Author": "FrequentFlyer_Rome", "ReviewID": "UR32737547", "Content": "This is good value for the money considering the prices of accommodations in Paris and typical room sizes. The pitched roof makes some of the rooms awkward. The beds aren't very comfortable. The small European bathtub is very high so if you have mobility problems it's tough. The stairwell is dingy and smelly. The receptionist was rude and inattentive, as I've found in most Parisian hotels that are in this class. HOWEVER, if you are going to Paris and are on a budget, this place is PERFECTLY located, is clean enough, and gets the job done. Enjoy the city, that's why you came!", "Date": "June 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Highly Recommended”", "Author": "Mr_and_Mrs_Obertelli", "ReviewID": "UR24894917", "Content": "We stayed at this hotel for a long weekend. The location was perfect and we had a great view of the Eiffel Tower, which was a 5/10 minute walk away. The staff were very friendly and helpful and the hotel/room was always clean. Access to the metro was 5 minutes away. The hotel is surrounded by shops and places to eat. A very good place to stay.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Terrible!!!”", "Author": "OECDDelegate", "ReviewID": "UR23751363", "Content": "Recently I stayed at this hotel for business. I travel often for business and for pleasure but never before have I stayed in a hotel as bad as this one. The room was shabby, the bed had big black hairs in it, the shower was either freezing or scorching, the traffic outside loud and worse of all the airconditioner made a horrible buzzing noise the entire night. I did not sleap a wink. To top it off, when I complained, the staff said it wasn't their problem and at one point even started shouting at me. What a nightmare! Do yourself a favour, NEVER stay here.", "Date": "January 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Very nice!!”", "Author": "NettaOslo", "ReviewID": "UR21090906", "Content": "This hotel has a wonderful location, 15min walk to the Eiffel Tower, and not too noisy environmental. Rue the Passy is great for shopping and dining. The hotel was clean, the rooms good size, and they were refurbishing parts of the hotel. Breakfast was typical continental and the \"restaurant\" is very small. But who care when you have wonderful bakeries, bistros etc just nextdoor. I will have no doubts recommending this hotel or staying there again next time I'm in Paris. I had not been in Paris for some years, and I was so positively surprised of how much friendlier the parisians have become! You can even manage by speaking english most of the time... can't wait to go back again!!", "Date": "October 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ann Arbor", "Title": "“Clean rooms, pleasant staff, great location, would recommend!”", "Author": "tyhoward", "ReviewID": "UR20651113", "Content": "The Hotel Passy Eiffel is a great place to stay on your trip to Paris. The hotel is located less than 100 meters from the Passy metro stop and about 5-10 minute walk to the Eiffel tower (From the third floor you can see the Eiffel tower over the other buildings). There are a few restaurants near the hotel, most notable the bakery two doors down and the place across the street that sells Gelato. At night the area is a little dark but it still seemed very safe. When I stayed at the hotel they were doing renovations so the halls and stairwells were all stripped of paint and all lighting/electrical outlets were a bit exposed. The price of the room was set accordingly though which just meant a great deal for me because the room and lobby were still perfect and clean. The rooms themselves are basic but clean and more than enough for the average traveler who is just looking for somewhere to re energize. I stayed with my girlfriend at the time and we found the place to meet all of our needs. The bathroom is reasonably sized for Euro standards and the bedroom included a double bed(real double not two twins) a desk, small tv, closet, and refrigerator. It also had two large windows which were nice to let the sun in in the morning. We were on the third fllor (4th US) but they had a small elevator for running our luggage up and down. The staff were extremely nice, we arrived early on the first day and left late the last day and they worked with all of it with no complaints. They even let us leave our luggage until 5 pm on the last day so we could see more sites. They all spoke English and were at the desk late into the night. I think they offer breakfast but with the bakery right next store we never ate at the hotel. They also have wireless internet which you can purchase for 4 Eur / 2 hr or 7 Eur for a day as well as a computer you can use for a small price. Overall I would recommend this hotel to anyone ( maybe not honeymooners, unless they have a suite). I used HRS.com and got a great deal on the room(200 eur / 3 nights) but it might have been because of the renovations. Even though, for two people for three nights in Paris I would have paid much more had I known it was of the quality that it was.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Really disappointing stay”", "Author": "ShortHop", "ReviewID": "UR20087295", "Content": "Recently travelled to the beautiful city of Paris for a wedding and this was one of the hotels recommended as it was close to the church. The hotel is located in a great spot but I have to say that is all this hotel has going for it. We had originally booked to stay for 5 nights as all of our family was staying here also. On arrival we were informed there was some refurbishement work being carried out between 10 and 5 each day. Little did we know the extent to which this work was being done, only to see the complete mess that was waiting when we got to our floor. Painting material everywhere, noxious smell of paint, bare walls, the dirt and dust was unbelieveable. We were not allowed to use the stairs which were completely blocked with painting equipment and had to wait upto 10 mins for the lift, which when it came the cleaners informed us we weren't to use. We were awoken in the morning to the sound of the very loud painters. When we went down to reception to ask why we had not been informed of this work she could not explain, just shrugged her shoulders. We found the staff were particularly unapologetic and quiet rude. My husband suffers from ashma and we had to leave the hotel after 3 nights as he could no longer bare the fumes. One of my familys' clothes were ruined after touching off a stair posts. It was just disgraceful.The hotel had been made aware that they were being recommended for the wedding and still didn't care. They really should be ashamed of themselves. I've been to Paris quiet a bit and know what to expect from 3 star hotels but nothing could have prepared me for this disaster. There are better places to stay in Paris so might be better to look around.", "Date": "September 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, UAE", "Title": "“Pleasant Hotel”", "Author": "Basantoot", "ReviewID": "UR19221504", "Content": "Passy hotel is a pleasant little hotel located in a very central part of Paris and only 10-15 min walk to the Eiffel tower which was a great advantage. We spent 4 nights in the hotel. Rooms were good, but there was no air conditioning so it was sometimes a bit too hot to handle. We had to have the windows open most of the time. Beds were comfortable, sheets were clean, area is kin dof quiet so you're not likely to experience any noise while sleeping. There were plenty of cafe's and patisserie around the hotel which made it easy to have a quick breakfast before starting our daily tours. Staff were not the most friendly but they were not rude either, very typically French. I would highly recommend this hotel to families and senior tourists due to the convenience of the location.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“A nice hotel, pleasant suprise”", "Author": "kh57ca", "ReviewID": "UR18359266", "Content": "Back in May I was searching for an adequate hotel in Paris for our party of three. This size group ended up being rather difficult to find less expensive hotel options. The Passy Eiffel was the one I chose for a couple reasons. The reviews were okay, although a few negative. They had an option for a party of 3, they had A/C, and the location was reasonably close to the major sites and transportation. We ended up being very happy with the Passy. The hotel staff were very cordial and helpful, the room was surprisingly large..with lots of room for us....and it was clean. The bathroom was very clean and up to date. There was some updating construction going on in the hallway outside the room, but it didn't effect our stay in any sort of negative way. Our room faced the main street, so we had a view of the Eiffel tower out our windows, which was especially nice at night with the tower all lit up. We skipped the hotel breakfast, and utilized a variety of local establishments that had various breads and pastries in the morning. I felt the price was reasonable....when compared to the other options I had researched. The local Passy subway station.....was easy to use and created no issues for us to travel about Paris to the various locations we wanted to visit. I would stay here again.......", "Date": "July 28, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "casablanca", "Title": "“There is a robber in this Hotel!!!!!!”", "Author": "ben-allien", "ReviewID": "UR17610955", "Content": "I have been stoled in my room. One night, when I was in a restaurant (the receptionist booked for me the restaurant), someone entered in my room with the KEY, ripped my lugage and stoled 3000 euro!!!!", "Date": "July 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“The Passy Hotel helped make our trip a success!”", "Author": "trvlrgrl07", "ReviewID": "UR12408954", "Content": "My husband and I decided to skip our traditional trip to see my family and make sometime for ourselves instead, thus we head to Paris for 9 days, including New Years. Being the great procrastinators that we are we waited until a month before our trip to decide on where we would be going. After much research (I am a geek!), we decided on the Passy hotel based on the reviews we read here, availability, location and price. This was our first time in France and neither one of us speak French, so we were a little apprehensive about our hotel and their services. We were very pleased with our stay at the Passy, the staff was extremely helpful and nice. The rooms were very clean, the bed was comfortable, and the view from the Eiffel Tower was not bad either. I am a very light sleeper so I did hear quite a bit of street noise because we were on the street side, but after a couple of long days they seem to not bother me as much. They offer a continental breakfast for 11 euros a person, which we had passed on the first couple of days, but after you realize that a coffee and croissant cost 7 euros and you would still be hungry, 11 euros for all you eat didn't seem like a bad deal at all. The hotel is also located within 2 blocks of the Passy metro station and about 10 minutes walk from 2 other stations. It is a 10 minute walk to the Eiffel Tower and 5 minutes to the Seine. The neighborhood is not very \"turisty\" compared to other areas and it is pretty calm witch was nice after a day of walking 10 miles. The cafe across the street provided us with many dinners as we experienced major sticker shock with the food prices in Paris, and there was a nice liquor store right next door where we would pick up an excellent bottle of Bordeaux for 6.50 euros! If we had the opportunity to go back to Paris one day we would most likely stay at the Passy again. I only say most likely because if we win the lottery we would probably stay at a 5 star hotel instead. :-)", "Date": "January 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Excellent choice for Paris”", "Author": "LADundee", "ReviewID": "UR12327765", "Content": "My husband and I stayed at the Passy Eiffel with friends for New Year and were very pleased indeed with the hotel. We had booked a standard double room, and while perhaps a little on the small side for some, it had everything that we needed and was spotlessly clean. We were lucky enough to have a room at the front of the hotel, with 2 sets of large french windows which opened to reveal a view of the Eiffel Tower, which at night is simply stunning. When the windows were shut, there was absolutely no problem with noise from the street. The location of the hotel is brilliant. The friends we travelled with had been to Paris 4 times previously, and had usually stayed in the Latin Quarter, but they preferred Passy by far. The close proximity to the Eiffel Tower and the metro is fantastic. Breakfast is also good at the hotel - the croissants and fresh bread are just to die for!! They set you up for a day of sightseeing! Staff were also very helpful and the maids were so cheerful too! All in all, an excellent choice for Paris - good sightseeing base and nice and relaxing neighbourhood to stay in if you like a bit of a gentler pace in the evenings after a long day in the bustling buildings and streets of Paris.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Kabul", "Title": "“Would Pass on Passy”", "Author": "Travelshmavell", "ReviewID": "UR10074483", "Content": "Was a bit disppointed - -although the location was good, the room and breakfast were only okay. The room was a bit on the shoddy side compared to other similarly priced hotels in Paris. Although a non-smoking, superior chamber was requested and confirmed, upon check-in we received a standard smoking room. When we asked the reception desk about the room we were told it was a superior, but the next day we saw the list of rooms posted on the wall that clearly indicated the room was a standard. As we were only there for 3 nights and most of the time we were out it did not make sense to swith. Nevertheless, kicker was that upon checkout the bill was at the rate for a superior. Upon noting the discrepency the manager did reduce the rate, but in a small hotel these mistakes are hard to understand.", "Date": "October 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "devon UK", "Title": "“great place to stay in paris”", "Author": "moorali21", "ReviewID": "UR8723336", "Content": "Having trawled through so many other reviews of hotels this little gem came up trumps. We had a superior room which was perfectly adequate- it was very clean and comfortable. We only had a shower in the room but that is a minor point. The toilet was a little small and not too up to date but hey it worked and who spends all day in a loo! Our room overlooked flats which was so nice to see (and very quiet too). All the staff were excellent from the check ins to the dining staff, room service etc. No restaurant but with so many gorgeous cafes to chose from and with shops close by there was never any problem. Patesseries to die for and the most wonderful chocolate shop close by (Jeff de Bruges). You can walk to the eiffel tower, where bato bus is too and the metro is just yards away (cannot hear it though). Our stay in Paris was made so fantastic by this great 3 * place.", "Date": "September 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Wonderful!”", "Author": "Kingsboy", "ReviewID": "UR8456576", "Content": "I had a wonderful stay at the Passy Eiffel. Great location being near to the Eiffel while still retaining a sense of calm being tucked away from the crowds. The front desk couldn't have been more helpful and we had a nice view of the Eiffel from our suite. Great service and the maids were charming! Definitely returning on my next trip to Paris.", "Date": "August 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "novato", "Title": "“Great Paris Hotel”", "Author": "Gotitall", "ReviewID": "UR8239175", "Content": "This is a comfortable, clean, beautiful boutique hotel. Very well located! We were a family of four(2 adults and 2 kids) and they accomodated us beautifully with two adjoining rooms in their quiet garden. The location of this hotel is also fantastic. 2 doors down is a GREAT boulangerie and Rue Ascension(?) has many restaurants. Great clothes shopping near by too!! Also near the Eiffel Tower Batobus stop on the Seine. Very well located for walking Paris. We walked left bank on day 1, then right bank on Day 2. Easy to communicate with the hotel over email to reserve your room. Bfast was extra and at a high price considering its so easy to go down the street for croissants and fresh fruit at a near by fruit stand which had the best apricots I ever tasted. We ate dinner at 7:00-7:30pm each night which seemed a good time to beat the crowds. Loved this hotel. Can't say enough good things. So friendly. Enjoy.", "Date": "July 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wales", "Title": "“lovely good value hotel”", "Author": "wandererWales", "ReviewID": "UR8236420", "Content": "This hotel is very close to the metro and bus routes. The area had a \"buzz\" which was nice, but not too noisy due to double glazing and air conditioning. Small and personal, with helpful staff on the desk. Good, simple breakfast, served until 10.30! Restaurants and shops within easy reach. Nice to be able to see the Eiffel Tower from our room (especially when lit at night) and walk to it across the river. room and bathroom clean and well furnished. We would definitely recommend this hotel", "Date": "July 26, 2007"}], "HotelInfo": {"Name": "Passy Eiffel Hotel", "HotelURL": "/ShowUserReviews-g187147-d315160-Reviews-Passy_Eiffel_Hotel-Paris_Ile_de_France.html", "Price": "$145 - $275*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">10 rue de Passy</span>, <span class=\"locality\"><span property=\"v:postal-code\">75016</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "315160", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/a6/04/d2/notre-patio.jpg"}}