{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent staff.....”", "Author": "divinedream01", "ReviewID": "UR139268098", "Content": "I stayed here on a recent trip to New Orleans. The staff was excellent. Everyone was very helpful and friendly. They recommended wonderful places to eat and visit. This hotel was in walking distance to the heart of New Orleans. This hotel helped to make this trip to New Orleans a wonderful experience. I will definitely stay here again during my next visit.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Great value”", "Author": "Kyle G", "ReviewID": "UR139071230", "Content": "I stayed here for in early August while in the process of house hunting and moving down to New Orleans. I got the room with a $60 bid on priceline and of all the similarly priced hotels I have stayed in over the past month (which is more than I would like), it was by far the nicest. I also stayed in the Holiday Inn Downtown/Superdome, and the Courtyard by Marriott in the Warehouse District, and the Hilton Garden Inn had much larger/nicer rooms and the nicest gym. I was able to park on the street pretty easily near the hotel and could walk to many neighboring restaurants.", "Date": "September 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful staff!”", "Author": "Ericamarie89", "ReviewID": "UR139066877", "Content": "I booked this hotel at the last minute on Priceline for a spur of the moment night out in new Orleans. There were five of us trying to stay in one room, so when I called to ask if there were any double beds left, I wasn't surprised to hear that there weren't any. I mentioned over the phone, \" darn, Priceline always works out for me, the boys will sleep on the floor!\" had a laugh with the woman, and thanked her for checking. When we went to check in (with sleeping bags in hand) both receptionists were very kind and fun, greeting us with, \"checking in to a king room are we?\" while surveying our sleeping gear. We had a laugh said yes! We love to camp! And she let us know that they had heard about our predicament and were upgrading us to a suite that had a king bed and a pull out sofa. We were absolutely not expecting this, especially after getting such a discounted rate from Priceline to begin with! We thanked them immensely and the room was gorgeous! This hotel has a wonderful staff that will try to make your stay as comfortable as possible.", "Date": "September 1, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bossier City, Louisiana, United States", "Title": "“awesome!!!!!!”", "Author": "honey0821", "ReviewID": "UR138156259", "Content": "I loved this hotel....from ms.scarrlett at the front desk made check in n out quick n simple..... to mr.tim at the bar to ms. Amanda in hotel restaurant....everyone was sooooo friendly.... the room was big with a lot space.... and i loved the short walk to bourbon st n canal street.... oh rooms comes with microwwave n frig....pool is very small....oh the elevators move very fast....overall everything i was looking for and more", "Date": "August 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bay st louis", "Title": "“Very nice for New Orleans”", "Author": "abry l", "ReviewID": "UR137468656", "Content": "Have stayed here several time. We have never had a bad stay. The parking is a little high 26 plus dollars but it is in middle of the city. Overall not a bad place to stay. Ask for a room with a city view some of the rooms the window face a hole in the center of the buliding with no view at all.", "Date": "August 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Augusta, Georgia", "Title": "“Nice Safe Place and Close to the French Quarter”", "Author": "OrlandoMouse", "ReviewID": "UR136901277", "Content": "We found the Hilton Garden Inn to be a quiet and well kept hotel. It is located on the opposite side of Canal Street two blocks from the noisy French Quarter. We didn't bring a car but there is parking available for about $25 per night. You enter into a hallway where there are elevators. You get in and press a button for the 15th floor where the lobby is located. Once checked in you will always need your hotel key to operate the elevator (a part of their added security). Our room was small but clean. There is a small breakfast/lunch restaurant located on the lobby floor as well as a bar that is open most nights. Of course with so many bars in New Orleans you can understand why they try not to compete, the bar closes early. The lobby personnel are helpful and can provide you with maps and guidance of things to see while in New Orleans. Try to take the St. Charles Street car while there. Avoid the Canal Street car as it only goes up and down Canal.", "Date": "August 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“Great 5 Night Stay!”", "Author": "K D", "ReviewID": "UR136426517", "Content": "I just completed my five night stay in the Hilton Garden Inn. I have absolutely no complaints, everything was ideal. Check in was quick, easy, and completely painless. My room was spotless, a good size for just myself. Unfortunately I had a terrible view, it was of a cement wall facing another hotel room, but I kept my blinds closed.. I didn't come to New Orleans to stare out my window. Everyday my room was cleaned spotlessly, linens refreshed and the housekeeping staff actually organized my shoes for me. I couldn't be more thrilled with the housekeeping. The location is great, you can see Bourbon Street and the lights from the roof at night. The pool is tiny, but good for a quick refreshing swim. I walked to a concert at the Superdome, but was only a short walk to the French Quarter. Perfect location for me!!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Garland, Texas", "Title": "“Convenient location, good value”", "Author": "KMK55884", "ReviewID": "UR136258952", "Content": "We just completed a two night stay at the Hilton Garden Inn and we were quite pleased with the property. The front desk staff were prompt and friendly and our room was comfy, quiet and well appointed. There is a nice (though tiny) pool on the 18th floor and a great fitness center. The hotel is easy walking distance from dining and shopping, as well as Bourbon street and the French Quarter. However it is not IN the French Quarter, as our somewhat surly cab driver pointed out to us. We were particularly pleased with the friendly service we got from a young man in valet parking who called us a cab and carried our heavy bag out to the curb. A nice touch at the end of our brief stay. We would definitely return to this hotel.", "Date": "August 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "coloradogirl711", "Title": "“Compassionate Staff!”", "Author": "coloradogirl711", "ReviewID": "UR135921359", "Content": "We stayed at the HGI after coming off a cruise. The location was perfect, as it was just a couple of blocks walk to Bourbon St. and and the main hub of the French Quarter. The hotel was exactly what I have come to expect from Hilton Garden Inns... clean, comfortable, and wonderful staff. The crew here was especially accommodating, as one of my dad's suitcases was lost on the way off the cruise ship. The staff at the hotel was much more compassionate than anyone at the cruise line had been, and they went out of their way to offer to call around to the cruise line and port to see if it had been located. When we're in NO again, we'll definitely stay here- no complaints at all!", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester", "Title": "“Outstanding Customer Service”", "Author": "Michelle R", "ReviewID": "UR135846838", "Content": "Floyd the bellman is AWESOME! He directed me to a great place to get authentic New Orleans food and when I came back he remembered my name and asked how everything was, offered other suggestions and was just very pleasent and seemed like he really loves what he does. He is an asset to your hotel. Scarlette at the front desk was equally as wonderful and even lent me her personal phone charger when I mentioned that I left mine at home. I travel often and I am not easily impressed but these two staff members brings a glow to this hotel and they should be recognized.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“They fixed our toilet at 2 AM New Years Day”", "Author": "Grizinator", "ReviewID": "UR135787342", "Content": "I was here with my mother, brother and sister in law for New Years. The hotel was a modern business hotel, located just a few blocks from Canal Street and the start of the French Quarter. An excellent location for those who'd not normally feel comfortable being far from the action (given New Orleans' tough reputation)...like my mother. The area was quite safe and there were always people around. The rooms were what you would expect from a business hotel and the staff were friendly and efficient. No complaints there at all. One problem, our toilet was not functioning properly when we arrived and finally gave up the ghost when we came back after ringing in the new year. When we notified the front desk, they asked if we were staying up (we were) and they would send someone to fix it right away. The gentleman was quite nice and had it up and running in no time. Did not have any problems afterwards. Unfortunate that someone had to work the wee hours of the morning on New Years day, but I suppose you have to have someone when running an efficient hotel like this one.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Terrible Hotels in NO for Essence Fest”", "Author": "SBenard00", "ReviewID": "UR135509572", "Content": "All hotels had to be booked for the Essence Festival for three days nad they were in poor conditions. We went down early to get settle on Jul 4 and the AC went out. The room was not the cleanest in the world and there were problems like broken fixtures, hard water stains on the shower head and the list goes on. Small bar with a person working as a bartendar but I'm not sure of his skills. They did comp the room for the night the AC broke. Wrote the hotel and suggested they get someone to do quality control on rooms and the manager said they do already. That person should get fired as the room was deplorable. No other HGI as ever been in this shape as this is a chain I use frequently and they have always been outstanding in the past. A lot of people were complaining about their hotel rooms for the festival.", "Date": "July 27, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Houston, Texas", "Title": "“Just decent.”", "Author": "Neisha R", "ReviewID": "UR135017485", "Content": "We stayed here for Essencefest July 2012. All the Canal Street hotels were booked solid. After reading the questionable reviews I doubted if I wanted to pay the high rates so I cashed in on my HH points instead. The hotel was descent Short walk to Burboun. short walk to Canal Street. A lot of ppl complained the hotel was old but it was very acceptable. Not old and nasty. It's descent enough to be a Garden Inn. I was afraid to open the door when we arrived after reading the reviews but it was nice. The only complaints I have are: they only had a handicap room available when we booked and the shower was the absolute worse in the world!!!!!!!!! Even handicap ppl may want to take a shower.......it was so bad I thought I was gonna have to take baths all weekend. There was NO WAY TO GET HOT WATER!! There was NO WATER PRESSURE! The rooms are incredibly dark at night! There was no lighting at all in the room aside from one dim light. There are lots of windows that provide natural light during a sunny day unfortunately the days we went it was cloudy and rainy. I'm a makeup artist who had two clients to do while there and had to do my clients faces inside the bathroom because that was the only place with normal lighting. That sucked. Most of the cab drivers had no idea where the hotel actually was...I'm not sure why. I would probably decide according to the rates on if I'd stay there again. If it were low enough I would. But it's not worth 75,000 hh points!!!!!!!! I regret not spending the extra points and going to the Waldof Astoria....I should have known better. It was decent tho. You get slightly less than you pay for here but its alright.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marina del Rey, California", "Title": "“Perfect for both the Quarter and downtown”", "Author": "Fitch7600", "ReviewID": "UR134822989", "Content": "This is a bit different than most Hilton Garden Inn's. It's a high rise. As with a lot of New Orleans buildings, the first several floors are parking levels, so the lobby is on the 11th floor with the guest rooms above it. The rooms are standard, comfortable rooms with new TV's, a mini-fridge, good desk space and a comfortable bed. Free wifi or ethernet in all the rooms, and free breakfast for Hilton Elites that's a cut above the usual hotel fare. I found the staff to be very helpful when I had to ship some equipment home via FedEx. As for location, it's less than a five minute walk across Canal Street to Bourbon Street and the French Quarter, less than five minutes to the downtown area, and about a 10 minute walk to the Super Dome. It's great after a night of fun in the French Quarter to have a short, safe walk back to a quiet and comfortable room. Strongly recommend.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NM", "Title": "“Comfortable and Friendly”", "Author": "jthitch", "ReviewID": "UR134565803", "Content": "This is a typical Hilton Garden Inn - clean, comfortable and friendly. The location is good for French Quarter access, but away from the bedlam. We got lots of information and help from the folks at the desk.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "SoCal", "Title": "“Mixed reviews, but overall very good”", "Author": "danthatravel", "ReviewID": "UR134242642", "Content": "This hotel is a bit weird with the registration and \"lobby\" on the 11th floor. Good: Service is great, rooms are clean and comfortable, close enough to Bourbon Street without the noise/crowd/dirt. Bad: Lobby coffee is NOT 24 hours (very bad), very scratchy towels, rooms look into dark/dingy shaft (and we're gold members), front desk cookies are not warm and fresh, weird positioning of \"lobby\", all breakfast grill items are cooked in LOTS of watery oil, ceilings are too high in the room (doesn't feel warm and cozy), and (standard with downtown NOLA hotels) parking is very expensive (~$30/day with I/O privleges). Otherwise standard HGI (microwave, fridge, comfy beds, nice linens, etc). We did encounter a problem with the phone ringing our room when folks called from outside hotel and later when folks were calling for wake-up calls and car pick up. This went on all day and through the night. We spoke with the manager the following morning and she was awesome/professional. She apologized, had service ordered immediately, comped our room for the evening (expected since our sleep was disturbed all night) and sent up a fruit/cheese platter. Kudos! Thanks for a good stay...", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Groesbeck, Texas", "Title": "“Great”", "Author": "jgeakins49", "ReviewID": "UR134120564", "Content": "excellent location,the room was clean and fresh and staff was great. (oh yeah great omelets)", "Date": "July 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Roswell, Georgia", "Title": "“Convenient location, clean and quiet”", "Author": "wg355", "ReviewID": "UR134055695", "Content": "I choose this location for our three couples for three nights due to the location and Hilton brand. The hotel could not been more conveniently located for our stay for the Essence Music Festival. It was a 1/2 mile walk to the Superdome, 1/2 mile to Bourbon street, 1/2 mile to casino and 3/4 mile walk to Convention center and Riverwalk with many good restaurants within that 1/2 mile radius. It proved to be very important because it was tough getting cabs with all the people in town. The three rooms we had on the 12th floor were roomy and very clean. Very surprised with the quietness at the hotel each night. The staff throughout were very responsive. Will definitely stay there when the Steelers go to the Superbowl next year. Mattress could have been more comfortable.", "Date": "July 10, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent Value Near French Quarter”", "Author": "Drewdini123", "ReviewID": "UR132386377", "Content": "We secured a room for $55/night on labor day weekend. It would be hard to complain when getting a deal like that... Ask for a room with a view that isn't facing the courtyard. They have rooms with windows looking at other rooms which I notice people complaining about when we booked. We requested a room looking out onto the city and received one with a great view.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Fantastic”", "Author": "uwbooster", "ReviewID": "UR132364917", "Content": "Stayed here in May for 5 nights. Location was perfect. easy to get to everything via bus & streetcar. Two blocks from FQ, but nice & quiet with good security. Lives up to Hilton standards by being well maintained & CLEAN. Front desk reps are helpful, friendly & efficient. Ate only breakfast in the restaurant (once) & had room service (once). Both very good. Rooftop pool is lovely & super CLEAN. King (bellman/concierge) was the absolute best and helped to make our trip a most wonderful experience. He greeted us as if we were family and gave us the best advice on sights, dining and directions. Everyone at this hotel gave us first class service and treated us as valued guests. All this plus a reasonable price for visiting NOLA. Thanks for making our stay so memorable!", "Date": "June 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Location, Helpful Front Desk, Not Consistently Great”", "Author": "Interested01", "ReviewID": "UR130479940", "Content": "Stayed two nights. Breakfast was excellent the first day, not so great the second (confused order, sketchy omelet). Servers and managers were attentive, though. Both nights the fitted sheet didn't cover the bed and kept peeling off at the corner. Overall, housekeeping was not first class. Reasonable price for a very good location near the edge of the Central Business District. Three short blocks to the French Quarter. It was my first time in New Orleans. The front desk people patiently supplied answers to all of my questions. They made some good recommendations.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Beware of their NO REFUND policy!!!!”", "Author": "Angela969", "ReviewID": "UR130440815", "Content": "My husband was working in the area and we decided to make new Orleans our vacation spot. This way our family could be together even if dad had to work. My husband's location was changed 5 days before we were to arrive.. We called and cancelled immediately. The Hilton not only charged us the entire $ 2,000 for the five day reservation, they also told us at time of cancellation we would get our money back. Almost 3 months later my family is told we are not getting any money back and basically the Hiltin has finished discussing the matter with us. We are devastated emotionally and financially. Don't book with them if you think you ever need to cancel!!!", "Date": "May 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bedford, Texas", "Title": "“Not good”", "Author": "SweetpeaPaula", "ReviewID": "UR130409532", "Content": "We've stayed at many Hilton Garden Inns around the country and in Canada as they generally get it right. Not in this case, however. This is the black sheep of the Hilton Garden Inn group. They just don't seem to care, either. We received \"wake up\" calls for previous guests at an ungodly hour that they would not disable after multiple requests. It is jarring to be awoken by the phone in the dark when you're on vacation. We were told that they don't do room service on Sunday nights, but this is in conflict with what is on the menu--this was told after our second call to room service. On the first call, someone lifted the receiver and we could hear laughter and then they hung up. Our sheets did not cover the bed fully and kept slipping down to where the pillow was the only thing separating me from the mattress, which felt gross. The breakfast deal was utter chaos--food was mediocre and the stations were not stocked properly--plates/spoons/bowls not there. When I asked for a plate, one of the servers picked up a random plate that looked like some guest had left it and handed it to me, \"Here, use this one.\" I declined. Would never stay at this hotel again. It's not being run properly or by professionals.", "Date": "May 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Doylestown,PA", "Title": "“Not bad if you just want a room and the price is right”", "Author": "DoylestownTraveler", "ReviewID": "UR130355717", "Content": "They had the best price for a brand name hotel, close to where I needed to be, for Tulane's graduation weekend. Hotel reception is on the 11th floor, rooms are above. There is no sitting/waiting area on the ground floor. I doubt any of the rooms have decent views. My room had a smoky smell for a non-smoking room. If you only need a room to sleep, no other amenities and get a good price, go for it. However, there are other hotels in the area that are nicer.", "Date": "May 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Mundelein, Illinois", "Title": "“keeps me coming back”", "Author": "muzikman6", "ReviewID": "UR129199803", "Content": "I have stayed at this hotel several times. The staff is wonderful. They move quickly, answer questions, meet any requests, clean the rooms well, and provide for a snag free stay. While the rooms are a little more $ than I usually spend, they were reasonable for the time of year that I visited which as for Jazzfest. The air conditioner was a little loud but most are. They watched my bags after I checked out so i could do a little shopping before heading to the airport. They called a cab for me.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "bmp8", "Title": "“Great location!”", "Author": "bmp8", "ReviewID": "UR128421205", "Content": "Stayed here for the weekend and was perfect location in the French Quarter and easy access to the trolley to sight-see. Standard Hilton Garden Inn - room was a bit old, and scratchy towels, but no big deal. Had heard there were bed bugs, but hope that wasn't the case. :/ Breakfast was great. We left our bags with front desk last day while sightseeing more after check out. Great view from the rooftop pool. Would stay here again.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fairly nice, but ...”", "Author": "Boxing_Kangaroo", "ReviewID": "UR128258189", "Content": "Arrived at hotel - was glad I returned the rental car beforehand at $26 a day parking. Entrance to hotel was a bit hard to find with reception area up on the 11th floor, but was quite nice and staff friendly once you got there. Checked into room, it was spacious and clean with decent facilities, and the decor is alright. Got a double queen room - okay, I'd booked a king, but no real biggie. Go to check out the view - very disappointing, all you can see is like an internal ventilation chamber to the building, with no view whatsoever and little light getting down there; many rooms must be like this as you can look across into a number of other rooms spread around the chamber. Frankly the window may as well be bricked in. Given I'd booked here partly to get a view over the city on my first and possibly only ever visit, this was a letdown. Some rooms must get some sort of view as from the pool area on the top deck you can see quite far. Perhaps the rooms should be charged at a different rate. Some other issues. Some slop, looked like a milkshake or something, spilled down the footstool. Surely this could be cleaned, but if not it probably should be removed from the room. Either way there's a bit of a problem there. An in-room safe is provided, but to use it you get billed an extra $3 a day - okay not a lot, but it's annoying when places like this nickel-and-dime on those types of things. Some places I've stayed in for half to a third this price provide safes for free. Same thing on the breakfast - it can be purchased at around $13 extra plus tax and tip. The bed was reasonably comfortable, but if the supposedly adjustable firmness 'snooze guide' is functional, I couldnâ€™t feel it. Additionally the light switch in the bathroom was flaky, and the ceiling fan was not working. Perhaps some maintenance is being overlooked. Everything else was generally pretty reasonable. Location is very good, just minutes from the French Quarter, right near street cars, and even a short walk to the Superdome if that's your thing. Good sized widescreen LCD TV with wide choice of channels, and other facilities are quite good. Security seems quite satisfactory. If you can get this place at a good price then it's a nice enough place to stay, especially if you can procure a room with a view. If it was cheaper I'd probably give this a rating of four given the issues mentioned above, but with the price and the name you really expect things to be right.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Jackson, Mississippi", "Title": "“Nice place to stay, a little off the beaten path”", "Author": "ceegee58jxn", "ReviewID": "UR128070266", "Content": "This Hilton Garden Inn is not really in the French Quarter, but it's not terribly far away. During the day the walk isn't bad at all, but at night it can be a little scary. The hotel itself is nice. We got upgraded to a corner suite, which was great. The check in area can be a littel confusing, since it's on, like the 11th floor of the building. Valet service has always been very fast, and the staff are freindly and helpful. All in all, this is a nice place to stay in New Orleans, but if you want the real flavor of the French Quarter, this may not be the place for you.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boulder, Colorado", "Title": "“OK for a short stay”", "Author": "solyluz", "ReviewID": "UR127636906", "Content": "Check in was OK with valet parking doing their best at 6pm. One hour later as we left the hotel to walk to B Street, cars were backed up all way down the block waiting to enter the hotel. The valet parking area is small, but you need to unload and ride up to 11th floor reception to check in. Room was fine and clean. Walk to B St is convenient altho a bit dodgy with the occasional transient. Check out was a slight hassle, again due to the limited valet parking staging area. In summary, if you do not mind the mandatory $25 valet parking cost and process, then this hotel is well located and worthy of consideration.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "CHICAGO", "Title": "“Average stay”", "Author": "ERRANTTRAVELERE", "ReviewID": "UR127473482", "Content": "I stayed at this location for several nights while in town on business. Overall it was a decent stay but for the price, I was a disappointed. When arriving, valet parking is mandatory ($26/night!!) and the front desk is located on the 11th floor. The room I stayed in was decent but clearly showing signs of wear. Not being in their \"elite\" club, put me in an interior court room which was rather dim and drab. I could not wait to get out of there in the morning. I am not sure why but the hotel seemed much older that it likely is. The room decoration is very uninspiring and it's almost as if they found the most \"commercial\" furniture available. The mattress firming dial was broken as was my toilet. I do have to say that the hotel addressed the toilet issue immediately. The location is in the heart of the business district and away from the French Quarter which I appreciated but still only a short walk when I wanted to restaurants in that area at night. Overall it's a hotel room so I have realistic expectations. An average place but not something I would jump to book if I am in that area again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "oklahoma", "Title": "“Good Hotel, Perfect Location”", "Author": "sallywallerman", "ReviewID": "UR126931119", "Content": "This hotel has all you need to make your New Orleans vacation an easy to get around experience. The only downside is the valet parking requirement running 26 dollars per night. We only used our car a couple of times when it was raining so the rest of the time it sat in the hotel's garage. The hotel rooms are clean and neat, the beds are fine and the flat screen tv's with many channel options make the room a respite at the end of the evening. Complimentary wifi worked well and we found that a plus. There is a small outdoor pool with chairs tables, and standing ashtrays as well as a small but high quality gym, which we used on the top floor of the hotel. Each floor has ice machines and each room has a microwave and small refrigerator. I asked our cleaning lady for extra regular coffee and none of the decaf and she was great at remembering them each of the days of our stay. The hotel has a small bar and restaurant on the 11th floor near the registration desk. We did not use either of these so I cannot speak to the quality of either service. The hotel is very secure and you cannot access the floors above the 11th without placing your room key into the slot on the elevator. You must also use your room key to enter the gym and to exit the door leading to the outdoor pool and rooftop seating area. (So just a note: Ask for an extra room key at check-in in case you misplace one, and make the effort to have your room key on you at all times!) The Hilton Garden Inn is just a couple of blocks to the west of Canal St. (a main north-south street separating the French Quarter - Bourbon St. from the Business district) and the main action of Bourbon Street and the shopping opportunities, restaurants and clubs of the French Quarter. It is also located just a block north of St. Charles St. and two blocks north of Magazine St. both offering shopping and foodie options. We purchased a 3 day metro pass at the kiosk on Canal St. just down the way from our hotel and we were able to use it for both the trolleys and buses. At the start of our 6-day vacation, we took the Canal St. trolley north to the RTA (public transportation) offices to pick up a map of the bus routes which cannot be found anywhere else on the system. The trolley is limited to 3 lines so it is easy to figure out without the map; however to fully use the bus system options you need this map. (The online version is not that useful for viewing the whole layout at once!) We could easily pick up the Canal St. or Charles St. trolleys within minutes from our hotel. A Magazine St. bus can take you down Magazine St. (from Canal St.) to the World War II Museum and beyond. There is a CVS which sells some food products and spirits as well as beer and other sundries within a 6 minute walk from the hotel, at the corner of Canal. (Be aware there is virtually no paperback fiction section at this CVS, although there are a small number of magazines and non-fiction books available.) Once on Canal there is additionally a Walgreen's a couple of blocks away as well as many restaurants and stores. If you are looking to purchase literature to read while on vacation we did pass a privately owned bookstore on a walk down Decatur St. heading from Canal St. east. There you will also find many clothing and decorative arts stores as well as restaurants including Cafe du Monde, a definite must stop, on your tour of New Orleans. All in all our vacation using the Hilton Garden Inn as a base was a success. We felt comfortable and safe there and enjoyed the facilities. There are washing machines and dryers on certain floors but we did not use them. The rooms are comfortable though not particularly special in any way. Everything was kept clean. We were able to walk to the Arena for a pro basketball game north and west of the hotel, and we were able to walk to trolleys and connecting buses to get to everywhere else we wanted to explore in the city. I can strongly recommend a stay at this hotel and I suggest you go onto their website to check on promotional deals they offer (like the stay 3 or more days including a Sunday offer) to make the cost more affordable and to offset the exorbitant garage fees which by the way are fairly standard for hotels in the center of New Orleans.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“They always treat you well”", "Author": "crt1966", "ReviewID": "UR126781437", "Content": "I travel to New Orleans about 7 or 8 times a year and always stay at the HGI on Gravier. its an excellent central locations with its own parking garage attached (parking is not great downtown NOLA). its only a few blocks from Bourbon street so you can walk back if you have had a few too many (who hasnt on Bourbon street) they have a nice restuarant with good food and room service is quick and easy. I have stayed there during their \"Event pricing\" but was always able to negotiate a better rate with the manager myself (maybe because im a Diamond member). has a nice pool on the roof with a view of Bourbon street. cant go wrong with the HGI/CBD", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Good Location”", "Author": "cabjohnson", "ReviewID": "UR126554876", "Content": "We stayed here at the tail end of one of my business trips. The room was a standard HGI room. It was in good condition and clean. The view however leaved something to be desired. The one window we had looked out on an interior atrium I guess you would call it. You had to look up about 6 or 7 floors to see the sky. As a result, the room was rather dark unless you turned the lights on. We were on the 12th floor, which is only one floor above the lobby, which is on the 11th floor. I know this sounds weird but the hotel occupies the top half of a business building, so oyu have to go up to the 11th floor to get to the lobby. I assume there are rooms that look out on the outside of the building. I would definately ask for one, although it wasn't that big of an issue for us since we weren't in the room much. I am a Diamond Hilton Honors member and thought I might get a better location but O well. The hotel is located central to just about anywhere you'd want to walk, which was nice. Also, my complimentary breakfast we great, not unlike that served at Embassy Suites. I wouldn't have paid for it however. You need to ask the bellman to call a cab for you. They don't cue up by this hotel. Alternatively, just walk around the corner. There are larger hotels there that have cabs waiting. I'd stay here again. I'd just make sure I had a window that looked outside.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“A better choice for New Orleans.”", "Author": "Kennethtravelling", "ReviewID": "UR126181206", "Content": "Having tried a couple of hotels in New Orleans this is an easy choice. You are 3 min. walk from Bourbon St. and you dont have to listen to the noise. Parking in house (vale), swimming pool on the roof and a very pleasant staff. If your at a conference or exhibition, this is walking distance to the convention center. Pricing compared to Hilton, Hyatt etc. is good. All room are high above street level so you dont have to worry about any noise.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "missouri", "Title": "“Business travelers preferred”", "Author": "Dax N", "ReviewID": "UR126104619", "Content": "I arrived by Amtrak and walked to the Hilton Garden Inn. I had a backpack and a plastic bag. As soon as I exited the 11th floor elevator to the lobby, I was greeted by someone, who clearly thought I didn't belong in his hotel. I declined his \"help\" and was checked in according to my reservation number. Everything else was grand until I requested a late check out. The hotel information clearly stated a 12 noon check out and I requested a 1p checkout. The front desk nexed that request and explained that check out was 11a and I was given a 1/2 hour extension. Come 11:15a, I was reminded twice that I should be out by 11:30a. Overall, I didn't feel welcome.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location and friendly staff”", "Author": "TravelKing76689", "ReviewID": "UR126061952", "Content": "The hotel rooms were large and the beds were very comfortable. It was a great location allowing us to walk all over the French Quarter and do several of the tours. We ate in the restraunt that night and the food and service were great.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dallas", "Title": "“Pathetically Apathetic Staff”", "Author": "Marc R", "ReviewID": "UR125716627", "Content": "Really? So looking down your nose and being condescending is a trend? Not in any other HGI I have ever stayed in. The front desk staff need to be replaced ASAP. I am a Hilton Diamond member and have never been treated or talked to like these two women did. If I had not had such wonderful experiences at other properties I would seriously consider changing to Marriott.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Super staff”", "Author": "Captain'squarter", "ReviewID": "UR125458989", "Content": "We recently visited with my daughter's family including a toddler. I have never been in a hotel with such an absolutely marvelous attentive staff who went way out of their way to be helpful! The baby was tired and our server in the dining room helped care for her and kept her entertained. We had lost her pacifier during a parade and the hotel sent out and brought us some. Everyone - parking attendants, desk clerks and dining room staff were the best I have ever encountered and I have traveled the world. Special kudos to our server - she is topnotch! The hotel itself was very clean and quiet. We definitely will be returning to this hotel on every visit to New Orleans! Congratulations to management too - you are definitely doing something right!", "Date": "March 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "SoCal", "Title": "“GREAT location, spotty service”", "Author": "OsideJC", "ReviewID": "UR125252729", "Content": "This property is very well situated, just 2 blocks from Canal Street and Bourbon Street. Also just a short 1/2 block from the trolley, making it a great base for exploring NOLA. The property itself is dated and the rooms just average, but nothing to complain about. Service during our visit however was all over the map. Perhaps it was the fact that our visit was for the end of Mardi Gras and they were just burned out (I like to give benefit of the doubt). But the service ranged from almost hostile (front desk, my wife call it \"service with a snarl\"), to indifferent (housekeeping who blew off cleaning our room one day and didn't seem to care), to friendly and bubbly (staff at the morning breakfast the morning after Fat Tuesday, 5 star service for sure). But if you keep your expectations low I would recommend this property as a base for a NOLA visit in spite of the service.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“OK location and good-sized room”", "Author": "amiprice", "ReviewID": "UR125203091", "Content": "Based on the Trip Advisor reviews, two couples stayed for two nights at the beginning of February 2012 for the first weekend of Mardi Gras. The hotel is in a good quiet location, close to but not in the French Quarter (about a 4 block walk). Air conditioning worked well, large room and bathroom, two queen beds, free wireless internet. For a quick weekend this was great. For a longer vacation, I might choose to stay somewhere just a bit closer to restaurants and a grocery store. The only snafu we had was that the parking company isn't in sync with the hotel, so you can't call down for your car ahead of time, and when we retrieved our car upon checkout, we had to go all the way back up to the lobby to pay for parking. Annoying! Overall, great value for the money and I would not hesitate to recommend.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Nice big place--roof is awesome”", "Author": "PD L", "ReviewID": "UR125121709", "Content": "Got a really good deal after Mardi Gras and had a great experience. The kids liked the rooftop pool and workout room. Close to The Quarter and riverfront. Nice valet parking (wasn't too expensive with in/out priviledges). Nice little bar and convenience center. Good views from the room. I know the prices skyrocket during events, reason why we haven't stayed there since--but wish we could.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Excellent location, good value”", "Author": "KJ78", "ReviewID": "UR125108430", "Content": "We stayed at the HGI for 4 nights during Mardi Gras and the hotel was the perfect base to explore New Orleans. It is very close to Bourbon Street / French Quarter, but far enough away to get a quiet night's sleep. The hotel is also within walking distance of the WWII museum (in the opposite direction from the French Quarter). The hotel itself was clean and comfortable. Check-in was friendly and efficient, especially for such a busy time of year. We asked for a cab the night before we had to leave for the airport and it was right on time. The fitness center was fairly well equipped with cardio equipment and one universal machine. Free weights would be a nice addition. There is a small heated pool on the roof with a great view. A couple of notes, the maps that the hotel offered were not very good. You may want to bring one of your own. If you are staying during Mardi Gras, the location while great was surrounded by parade routes, leaving us stuck trying to cross Canal St. and St. Charles St. several times. Nearby restaurants to try, GW Fins for seafood (the freshest in town) and the Court of Two Sisters for an excellent jazz brunch.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great choice for new Orleans”", "Author": "Travellincandy", "ReviewID": "UR124782561", "Content": "This little hotel was a great option for my trip to new Orleans . It is just 3 blocks from canal and bourbon street . Close enough to all the action yet quiet enough for a good nights sleep. Would definitely go back . Great value, nice rooms, friendly staff.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“Location, Service, Amenities”", "Author": "paypar", "ReviewID": "UR124582429", "Content": "Stayed here 11 February 2012 for 3 nights. Appreciated the location - 2 short blocks off Carondalet (same as Bourbon St just on the other side of Canal) so easily walkable to all the action in the French Quarter and parade routes. Streetcar was also nearby. We scored this via Priceline for a great price. Be careful though - they charged $3/day to use the in room safe!! However, this is such a small nit given the level of service and comfort at this place. King was very helpful helping us retain our luggage since we got there a little early, and providing directions and information for getting around. I liked best that it was in the CBD, so it was away from the crazy noise of Bourbon but yet still steps away. Appreciated the complementary bottled water and cookies available from the front desk.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good location, good hospitality”", "Author": "Scott S", "ReviewID": "UR124226044", "Content": "While I am personally a Marriott fan, my friend prefers Hilton and had enough points to spend a couple of free nights, plus we paid a bit more to extend our stay. This hotel is convienently located near Canal and Bourbon street, and is easily accessible. As a group of 5, we chose to not rent a car and have been able to get around easily. When we arrived we were greeted by a very friendly and welcoming front desk person who informed us of different local places and events. At one point our room fridge stopped working and was replaced brand new late at night. The service staff has been great. The sleep number bed option is amazing and both sides of the bed offer their own choice!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Convenient and close”", "Author": "Theresa2319", "ReviewID": "UR124182510", "Content": "A nice place to stay at if you are visiting the area. This location is close to everything and the personnel are friendly. Valet parking is available and their is a morning buffet available for a small price. Beds offer the sleep number which allows you to adjust the firmness, and the rooms are very spacious", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Look no further”", "Author": "Mike E", "ReviewID": "UR123787493", "Content": "The complete staff, car valet, front counter, Bell hops, and the dining room staff are all 100% customer focused. We have experianced non better and we are Hilton Diamond Member which means we spend a whole lot of nights in Hilton hotels. When looking for a hotle close to the French Quarter, 2 blocks away, this is the place to stay.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Good location and a good value”", "Author": "darrender", "ReviewID": "UR123655190", "Content": "This hotel is by no means 5 star, but it's a very nice place to stay if you can get it for under $100 or around $200 during peak times. Nice staff, big rooms, amenities in the rooms, a rooftop pool and LOCATION make this a very nice place to stay. It's only 2 blocks form Canal St and is a short walk to some bars and restaurants on Poydras. It's still a good hike to the Superdome but not as bad as if you were in the quarter. If you have stayed in the quarter before and are looking for a nice place that's a very short walk to the quarter and doesn't cost as much as the quarter, then this is a great place!!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Great staff and rooms - just a few blocks from the Bourbon Street”", "Author": "HeyRayCa", "ReviewID": "UR123203713", "Content": "We have stayed at this hotel twice now and found it to be a great hotel, close to Bourbon Street and Canal, but not right on top of the action. The staff is very friendly and professional, the rooms are very quiet and comfortable. The only issue I have with this hotel is location - it's really not French Quarter, but is close (just a five minute walk).", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "richmond", "Title": "“NOLA - Wow !”", "Author": "tripin1", "ReviewID": "UR123039618", "Content": "Just visited New Orleans for the first time for the Sugar Bowl. Really enjoyed the town, the people, the history and of course the hotel. This hotel is so close to all the action that it must be tough for the cabs to make a living ! We took a left and a left and made it to Bourbon Street. A few blocks more and made it to the famous Cafe' du Monde for some famous Beignets. We walked to the Dome for the game, and walked to Mother's Restaurant for some great breakfast. The hotel was very accommodating, and the staff ready and able to assist when needed. One of the family had a sore throat and the late night attendant made some hot tea for her. Roof top pool smaller than most, but warm and a great view of the city. We'll be back !", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Friendly Breakfast Staff and large rooms”", "Author": "Trueohioplaya", "ReviewID": "UR122948337", "Content": "The wife and I stayed here for New Years. The location is literally 2 blocks from the French Quarter so you are within walking distance of everything you want to get to. When I checked in, the room we had was very close to the elevators and the noise would have been very distracting while trying to sleep. I called down to the front desk and I was moved away from the elevator with no issues at all. The staff was very professional during the entire stay. At $26/night for parking it is on par with parking in the area, but the free wireless internet is appreciated. The breakfast staff was very accommodating and very helpful as well. I recall speaking to an older gentleman about the Ohio State Buckeyes.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“An Oasis of Suite Rooms with Spectacular Views convenient to CBD and French Quarter!”", "Author": "sandiegosunshinemom", "ReviewID": "UR122741589", "Content": "We arrived late after a long day of travel from San Diego with our 4 year old. The City is crowded with party goers from the Saints game and upcoming BCS. We were just exhausted and could not believe the amazing professional staff that greeted us. From the bell captain to the front desk, the team was amazingly friendly and understood how to take care of us. The room we received was enormous with outstanding views of the entire City. It is close to the action of the Superdome without being on top of it. We can see all the party goers from the view of our room without having to deal with the crowds. It also offers an immaculate heated pool with great views as well as an adjoining mini gym with updated equipment and gorgeous views. With so much to do in New Orleans, the enormous room is like an apartment and the warm staff are like a family to come home to while in town. We also like the complimentary Wireless Internet and the convenience of the microwave and refrigerator when traveling as a family. They also recommended several attractions for us and we are in the heart of the City so it is very convenient.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "VIENNA VA", "Title": "“Great Staff”", "Author": "MDYNASTY", "ReviewID": "UR121473960", "Content": "Our family of five stayed in two rooms over the Thanksgiving weekend for four nights and it was a great stay because of the staff from the front desk, restaurant, bar, and bellman. Because of our Hilton Honors status, we received complimentary breakfast each day and it was great before venturing out to NOLA. The room was very clean and the beds can be controlled for firmness. It did have a pool on the roof but it was too cold to swim but the view is incredible. We felt very safe walking from the hotel to the Quarter. The street car for the main line is right around the corner. The whole family is in agreement that the staff made the hotel great. Enjoy NOLA and this hotel. Last note, if you need a place to eat, make sure you check with the bellman Mr. King. He knows what he is talking about as he suggested Mahonys for po-boys, and few other great restaurants.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Great Hotel, Great location”", "Author": "Omiwatson", "ReviewID": "UR121118282", "Content": "This hotel was of a high standard and only 5 minute walk to Bourbon Street. The hotel was secure as you could only get to your floor by using the room key. It had a great sized room and the bed was very comfortable. There was also a roof top pool which had great views over the city. There were lots of shops/restaurants and bars all within walking distance of the hotel. There is also a business centre which has PC's and a printer.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cleveland Ohio", "Title": "“Great Location, Pricey, Excellent Breakfast, ho hum Staff”", "Author": "getsmart", "ReviewID": "UR120856927", "Content": "I've stayed at this hotel 5 different times. I love the location but after this visit I think I'll try somewhere new. The prices have gone up A LOT! With the exception of the bellman the staff wasn't that friendly. I made the reservations 2 months in advance for a three night stay and they put me in this room that faces the interior of the building. I've never had to stay in one of these rooms before. They shouldn't even bother to have windows in those rooms. Plus, I heard the elevator like it was right in my room going all the time day and night. I was surprised. The room and bed was comfortable and clean. The breakfast excellent and the hotel lobby and such very nice. If you generally stay at Hilton properties like I do, try the Hamton Inn next door. Next year when I'm down there, I'm going to try somewhere new!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Great view of the city but at a high price”", "Author": "McFliege", "ReviewID": "UR120816816", "Content": "We stayed a single night here, just wanting somewhere to crash while we spent an evening roaming around the French Quarter. The valet parking is truly a nightmare. I understand that space is cramped and parking is short that close to downtown, but I do not like the hassle of having to contact other people to access my car. In addition to that, it costs $30, and it's a scramble in that parking garage. Moreover, the reception/lobby of the hotel is not at ground level, so it is slightly inconvenient to have to go there whenever you want to communicate with the front desk (I mean when coming and going, not while in the room, obviously). We had a spacious handicap-accessible room on the 16th floor, which I recommend, as there is plenty of room for luggage. The very awkward parking situation, not to mention an overpriced room (which doesn't include breakfast) was displeasing, but the room itself was good: large, clean, and with a massive window-view of the city. In conclusion, very expensive compared to other chain hotels we'd been staying in while traveling throught the south, but the location is very convenient--it's only a short walk over to Bourbon Street (the French Quarter).", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mocksville, North Carolina", "Title": "“Great hotel, great location”", "Author": "CraverFamily", "ReviewID": "UR120513099", "Content": "We were first time travelers to New Orleans (NOLA). I was a little worried about booking this hotel at first for two reasons. (1) Previous reviews said it was a poor excuse for Hilton (2) I was unsure of the location because it was not on the St. Charles streetcar line. As soon as we checked in I knew I had made the right decision. We got to the way before the check-in time of 4pm. The staff greeted us, took down our contact info so they could call us when the room was ready and stored our luggage so we would be free to explore the city. A very nice man named King took the time to talk to us about points of interest in the city that would be well suited for a family; he made recommendations on restaurants base on our preferences; he was a wealth of knowledge the entire trip. As for the hotel, it was very well appointed and had all the ammentities we need for our trip. Also, the location was fantastic. We were able to walk or ride the streetcar every where we wanted to go. And the street car stop was only a very short block from the hotel.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milwaukee", "Title": "“Hotel Staff”", "Author": "SunnySassy", "ReviewID": "UR120178432", "Content": "We ended up staying @ this hotel because the Cotton Exchange Hotel which we had reservations did not have water....They let people check in without telling them they were without water since the day before......It was a scramble to get a hotel being it was Halloween weekend...everything was booked. The Hilton Garden helped us look for any open rooms....They found us one @ another Hilton for the first night...which was much nicer than our previous hotel....then gave us a room at there hotel for the weekend....The staff was amazing!!!!!!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Good location, good service, will return”", "Author": "wick1979", "ReviewID": "UR120019084", "Content": "Great stay, having stayed at ever Hilton property near the quarters, it is equally spaced from the quarters as the other 4 in the area. Room was nice, A/C worked great, could see the quarters with your head turned a little bit. Staff was good, parking attendants were much better then the other hotels I've stayed at in the area. We will definately return. Only request, Room Service for lunch I don't want to have to leave the room just to get a burger or something quick for lunch. Other than that, not a single complaint", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Good location, average hotel”", "Author": "widb0005", "ReviewID": "UR118562798", "Content": "I've stayed about 10 nights at this hotel over 3 business trips. Overall the location is good but the hotel is very average. My biggest complaint is the loud HVAC system in the room - so unless you're willing to freeze, roast, or are a very heavy sleeper, you're getting woke up about 4 times a night. The location is good since it is a short walk to the French Quarter. You'll want to go to the Quarter for dinner while staying here. There is a restaurant with all you can eat breakfast for $13, which is pretty expensive for breakfast but the food quality is always very good in the morning. There is also an a la carte breakfast place across the street. The rooms are average to below-average - nothing very remarkable about them. I have trouble with cell reception in the hotel rooms because of all the brick. Beds are comfortable. No HDTV. Parking is $26/night - this is pretty consistent with other hotels in the area so there isn't a way to avoid it if you need a car.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Great rooms, very close to the quarter!”", "Author": "fl4delis", "ReviewID": "UR118068878", "Content": "We stay at this hotel frequently and love it. The rooms are always clean, well stocked and well maintained. This hotel is an easy two block walk to Bourbon Street. The staff is always exceptional and very helpful. We are locals but I have seen the staff many times go out of their way to take time with travelers explaining the best restaurants and attractions to visit. Would recommend this hotel!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "British Columbia", "Title": "“a lovely hotel”", "Author": "janiecuz", "ReviewID": "UR117838772", "Content": "we stayed here for 5 days and loved every minute of it. I had read the reviews complaining of the cost of parking (pretty standard from my research), that the pool was too small ( we found it perfect to cool off in). We had an outside view and could see the river and down Bourbon street. I have no issues with the staff and found them to be responsive if we needed anything. The room was very large and quiet. The hotel is in a perfect location to explore all areas of the city and we did exactly that while we were there. We actually stayed in one night and ordered room service and the food was delicious and hot when it arrived at our room. No complaints!", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Mixed Bag”", "Author": "lima33", "ReviewID": "UR117765699", "Content": "The location of the hotel is ideal, if you want to be within walking distance of the French Quarter, but away from the noise and revelry. The building itself is not much to look at - a converted 1950s mid-rise office tower, with parking taking up most of the lower floors. The street entrance is somewhat shabby, and the hotel lobby and reception is on the 11th floor. The rooms are larger than average, and in good condition. I was able to get a room with an exterior view, which I am sure was much nicer than the rooms looking into the internal light well. However, it was a smoking room, and had a stale smell. The staff member at the front desk was not particularly helpful when I asked if the room could be changed - apparently all rooms were booked, even though I had reserved a non-smoking room 3 weeks earlier, and had said I wanted a non-smoking room in in the morning when I had left my luggage. I had the sense the staff will not go out of their way to accomodate requests of guests who book through Hotwire.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Pensacola, FL", "Title": "“Nice, but really expensive parking $30, no alternative”", "Author": "emeraldskye", "ReviewID": "UR117517049", "Content": "The hotel itself was nice. We liked the air adjustment beds. I have a bad back, and it was good for me. They also gave me enough pillows to properly adjust my knees, etc. The hotel is pretty much two blocks from Bourbon street, easy walk, a little bit dark close to the hotel entrance and the first block. The one complaint I have, and I don't know, this may be normal for the area, but the parking fee seemed outrageous to me. It was $26 per night plus taxes which totaled $30. There was no alternative for us to park ourselves, even though they have a 10 story parking garage which is the lower 10 stories of the building. I don't generally stay at the most expensive hotels, and have only been to one other that offered valet parking which was $20 per night, but even there, we had a choice to park ourselves. So, if you have the money, it's a pretty good location.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manassas, Virginia", "Title": "“Very good price, Great location, excellent service”", "Author": "BigDaddy3n", "ReviewID": "UR116969683", "Content": "I'd first like to say that some of the previous reviews seem to be tainted with unreasonable expectations of the level of hotel this is. This is a above average level hotel in the Hilton chain created to meet certain needs of an assortment of clients for a reasonable rate. So be fair not emotional with your reviews. Now my review....My wife and I found the staff to be very accommodating, professional, friendly every interaction we had with them. We must first thank the front desk staff, we wrote cards for almost all of them. The bellman \"King\" was a walking wikapedia about NOLA everything, every place he sent us too was perfect. We came with a list of sites, and dinning spots to go to, he scratched out half of them. This guys knows cooks, chefs, and managers of almost every hot spot in town. It was great that every major attraction, or site was within walking distance or a short drive away. The breakfast each morning was good, with lots of choices, included in the rates. We had a great view of the city from the 16th floor, it was nice to not have the city noise, because the hotel guest rooms start at the 12th floor. Our only complaint would be that we wish the pool was a bit larger, but the rooftop pool was cool. Again for the price, location, staff and accommodations, we will be staying there on all our next visits. PS......The gumbo in the hotel cafe was great, one of the best we had in a week in NOLA", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "daphnepoco", "Title": "“Ok place”", "Author": "daphnepoco", "ReviewID": "UR116809107", "Content": "This Hilton was very low standards for the Hilton hotels. I stayed in a lot of Hilton hotels and this one was the worst for their standard hotel. It was a nice hotel but nothing special. Very basic. Had desk, chair. 2 double beds which were doubles, small fridge, microwave was nice to have. Very clean, staff nice. Easy access to Jackson Square but still about quarter mile away. It is off from canal street where you can catch streetcar but it is not directly in the happening parts where you see photos off since it is a high rise and the French quarter is more low rise buildings. It defiantly beats places like scummy model 6 and super 8 but just not as nice as a Hilton should be. No balcony but nice high rise. Roof top pool was very small and not that clear of swimming pool water which was also disappointing, did not look refreshing to jump into. On pool balcony there was a loose piece to the fencing around it so watch little kids very carefully. No room service for breakfast or lunch just dinner which was bad. Food in restaurant was good. Not a fancy place, just a cafe beside the check in counter. TV in room was old, not even a flat screen. I know the TV really does not matter just complaining since it was a Hilton. Hotel overall was very clean and safe. Not a new Orleans charm to it. If looking for that you probably need to stay more directly in the French quarter. Directly in the French Quarter around Jackson Square there isnâ€™t any high-rises plus it is more noisy around there. Depends on your needs.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "nashville, tn", "Title": "“Just OK - Can't believe it is a Hilton Prop”", "Author": "jvines", "ReviewID": "UR116762195", "Content": "Nice Hotel and great location for us. We requested an outside room and received it. Using the room key for the elevators was not an issue at all. The room was nice and the bed was very comfortable. Canal St /Trolley/ Bourbon St all within 3 blocks and we walked nearly everywhere. Hotel does not have concierge service. Staff was helpful, but there is so much to do in NOLA that it would have been nice to have hotel staff dedicated to advising on restaurants, etc. King was helpful and the closest thing to a concierge, but his role is unclear: bellman we thought? Room cleaning is pretty much non-existent here. We arrived to a clean room that had not been vacuumed (candy on floor when we arrived). Sheets are changed every 3 days, unless your request otherwise. We were fine having same sheets for our 3 night stay, but they don't make bed or turn down sheets. We are pretty clean and straightened the bed before leaving for the day. When we returned the first day, the bed was as we left it and room was still not vacuumed. It appeared that all housekeeping did was update bath supplies, replace towels and empty the trash. We were hardly in our rooms but even so on the second day housekeeping never even showed up. We just reused our towels and made it work. We've received better housekeeping from discount hotel chains. Definitely, not up to Hilton quality in service department.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Not a bad choice”", "Author": "WhiteMale", "ReviewID": "UR116404076", "Content": "We chose this hotel based on a cheap deal from expedia and we had a nice stay in New Orleans. The Hotel isn't IN the French Quarter, but rather CLOSE TO the French Quarter. It's only a few minutes walk, but I thought the name was a bit misleading. That said, this hotel is right next to Carondelet street which, on the other side of Canal Street changes name and is the famous Bourbon street, so the location of the Hotel is still very good. You can't be much closer to Bourbon Street, unless you are directly on Bourbon Street, which I wouldn't recommend if you plan on sleeping at night (Bourbon is EXTREMELY noisy at night). The rooms are large, clean and quiet (assuming you have quiet neighbours, which, for us, was the case about every other night). People seem to get very excited and loud when they are in New Orleans :) But this isn't the hotel's fault, this could happen in just about any hotel in that area. There is a pool in the Hotel , but it is very small (maximum depth is 5 feet, so it's more of a kids pool). Still, since it is on the rooftop, it is pleasant to go in the pool for an hour or so on hot summer days and you get a nice view of the city as a bonus. We didn't have any major problems during our stay and the cleanliness was very good (that's always a key point for us), so I think the hotel is a decent choice if your planning to visit New Orleans.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Louisiana", "Title": "“Great location in French Quarter, nice place to stay”", "Author": "LouisianaSuz", "ReviewID": "UR116119153", "Content": "We stayed here for two nights during the last week of July, 2011. We were very happy with the accomodations. The location was excellent. It was easy to find from Interstate 10. It was really in the middle of the French Quarter but on a quiet side street. We were two blocks from the action Canal Street and Bourbon Street, and both the Canal Street Street Car and St. Charles Street Car stop. The valent parking was convenient and easy to use. The front desk staff were extremly helpful and courteous. We never utilized the restaurant, but many people did. It was queit. The rooms were clean. Our only complaint would have been that the beds were very, very firm. However, that is a matter of taste. We favor softer mattresses. The price was exceptional. We would stay here again, if they had softer mattresses that is. Maybe next time we will try one of the other (many) hotels in that same area to see if their mattresses were softer.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "hamilton", "Title": "“Ok”", "Author": "ljb1974", "ReviewID": "UR116108240", "Content": "I have to say that this is the first crtical review i have given for a hotel. Also, will be upfront that i am a \"hilton honey\" (gold member) and pretty much will always seek out and stay at a hilton chain...and to date, have never been let down-great and consistent service, cleanliness and value. This hotel isn't that bad....it just isn't up to par with the other HGI's i have stayed in. More specifically-the rooms are a little dated...teal green carpet, tv from the mid 90's and shabby but clean bathrooms. All was clean however..and the cleaning lady did an amazing job sorting, tidying and cleaning. Staff was also friendly and went out of their way to help and assist..kudos to them. location is good, but if i was here on my own and not with my boyfriend who looks like a linebacker, i would feel uneasy coming back to the room by myself (and i am a person who travels alone internationally). About a 10 min walk from the main action.. the pool...well, although the rooftop offers some breathtaking views at night and the pool is also very pretty, it has to be the smallest hotel pool i have ever seen. I believe it is about 9ft long by 5 or 6 feet wide. More like a dipping pool than a swimming pool. And it was cloudy and greenish looking..very surprising for a hotel pool. We went up to swim but did not as the look of it made us nervous... So there you go, hope it was helpful. Don't let my review stop you from staying, overall it was good....just trying to help manage your expectations of this hotel.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Pleasant surprise”", "Author": "kutiepie74", "ReviewID": "UR116037832", "Content": "I was pleasantly surprised with this hotel. It is a couple of blocks from the French Quarter, the Riverwalk, shopping, and dining. The room was very spacious, clean, quiet, and comfortable. The hotel staff was exceptionally friendly and eager to help. Customer service was definitely their priority. The view from the rooftop pool was breathtaking, especially at night. My only complaint was the valet pricing. I felt it was on the high side as it is the only type of parking offered at this hotel. Other than that, everything else was great. Would definitely recommend this hotel!!!!", "Date": "July 30, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lumberton, North Carolina", "Title": "“Walking distance to Harrah's”", "Author": "fatubus", "ReviewID": "UR115927232", "Content": "Nice property and it looks like they are doing some renovations so it will probably end up being better. Took no time at all to walk to the casino and the cab rides to the quarter were not that expensive. It may not seem like a good location, but its not that bad.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "orlando", "Title": "“Great Location and service”", "Author": "lisarollison", "ReviewID": "UR115535129", "Content": "We visited for JazzFest 2011 with family. The Hilton Garden Inn FQ is in a really nice, convenient location. There are lots of good restaurants within walking distance and the shuttle to JazzFest is close by. The area was nice and clean and we always felt safe. We had a corner suite, which was really roomy. The customer service was excellent and the breakfasts were plentiful and tasty. As we plan on visiting New Orleans many times in the future, we will definitely want to stay at the Hilton Garden Inn French Quarter.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Incredible Customer Service!”", "Author": "richiedix", "ReviewID": "UR115486885", "Content": "I had a wonderful weekend stay at this property! Right from the start, I was greeted enthusiastically by the staff at the front desk and MOD Aaron eager to make my stay a memorable one.....and that it was!! Check in was smooth and friendly, the room comfortable and clean. Breakfast is fantastic with plenty to choose from and a very attentive chef (thank you Wright!). The staff is more than helpful here...so I find it odd that someone wrote something negative about them. Oh yeah, to the person who wrote that the hotel's wi-fi gave their computer a virus (highly doubtful)...how about checking the sites you must have been trying to access, there's where your virus came from, not from the wi-fi (it's only the gateway to the net, not a source of computer viruses). OK, so the pool ain't nothing to write home about...but I didn't come to New Orleans to swim in an olympic sized pool...Bourbon Street is right around the corner! And yes, parking can be a little pricey...but it is for ALL properties in this area. For business or for pleasure, this is a great spot to be in the centre of it all; c'mon down to the Big Easy and stay in comfort here!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“We'll be back again”", "Author": "Weittle", "ReviewID": "UR115344169", "Content": "We stayed here for 4 days and the front desk personnel were willing to receive a shipping package for us even though we checked out yesterday. There was even a printer in the business center which allowed us to print documents. Location was fantastic. Close enough by foot to Bourbon Street but far enough to not get disturbed by the loud party-goers. The rooftop pool was amazing - beautiful view of CBD surrounded by historic architecture. The only bad thing was that the pool and gym closed at 10 pm.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Blacksburg, Virginia", "Title": "“Best hotel in NOLA!”", "Author": "Alisonma04", "ReviewID": "UR114889618", "Content": "Perfect location, close to everything but away from the noise. The accommodations are nice and the staff is wonderful!!! The pool sounds great, although I was too busy this week to venture up there. The bed seemed really firm at first but I slept incredibly well every night.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Overcharged and Incompetent Customer Service”", "Author": "chite85", "ReviewID": "UR114581579", "Content": "Prepaid for 2 nights via Hotwire and was subsequently charged $103 by the hotel after I had checked out. It took a week to actually get someone on the phone who could fix the problem. I was bounced between front desk staff, accounting and the general managers answering machines. Mistake was finally corrected by GM Carla, but it still took her 2 additional days to call me back to inform me it was fixed. The room was large and clean but unfortunately housekeeping never came after the first night and after calling and asking for housekeeping service or at least towels I was disappointed to find that this too was not done. After calling twice towels were brought to our room at 10PM. Parking is outrageous, $26/day. Find another lot just a few blocks away to save $$$ Find another hotel for your NO stay!", "Date": "June 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best hotel in New Orleans”", "Author": "Ihateu2224", "ReviewID": "UR114450385", "Content": "We stayed here on vacation June 16-19. Our stay was very pleasant. Everyone in the hotel was very nice and very welcoming. King was the first doorman we encountered very helpful. Very nice and treated us as if we had been friends for a long time. The hotel was very clean and a comfortable home away from home. The rooftop pool was very nice and was very clean. We had a small incident that was taken care of right away. Everyone was very helpful with that. The restaurant was very nice even though we showed up just a lil before closing time no one seemed to be upset about it. The next night we got room service and it was the same guy. Wright I believe was his name, very nice guy. Also treated us as if we were friends. Valet was very fast. Everyone we encountered in valet was very courteous. The last doorman we encountered as we were leaving was very nice and very helpful with loading up the bags. I can't remember everyones name. But everyone we came in contact with was very friendly and very helpful. As we were leaving everyone wished me a happy fathers day and also wished us a safe trip home. We will definitely be stayin in this hotel again. Awesome hotel, awesome people, friendly service. Just great hotel all around. Great location as well. Bourbon street is just a couple blocks. The aquarium was in walking distance. Which was great because we had the kids with us. It was the kids first time in New Orleans and they enjoyed every bit of it. Even they enjoyed how friendly everyone at the hotel was.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nice hotel, good location, parking pricey”", "Author": "JWassmer", "ReviewID": "UR113152781", "Content": "I stayed here for a bachelorette party and it was great. We had drinks on the rooftop pool to start off the night and they even brought us room service up there. The rooms are spacious. My luggage was damaged while waiting to be checked in but they politely reimbursed me which I'm grateful for. Very close to Bourbon steet and near the French Quarter tourist areas. Parking is very pricey.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Enjoyable stay although reception staff could use some happy pills”", "Author": "ckwc", "ReviewID": "UR112803931", "Content": "We stayed here for 5 nights. We chose this hotel because it had a fridge and microwave in the room, very important when travelling with a toddler. The room was quite spacious and clean and the bed quite comfortable. We had an inside room so the view out the window was almost straight into the opposite room, but that didn't bother us. We did use the pool, even though it was rather small. The elevators were fast but swiping the access cards to gain access to the room floors was very annoying since the swipe wouldn't work 1/2 the time. The location was great, just a couple of blocks from the French Quarter and felt safe walking at night. No complaints about the speed of the wifi. The breakfast was quite good with lots of variety and the wait staff at the restaurant were very friendly and attentive. The reception staff, on the other hand, were not the most friendly although all of our requests were dealt with adequately except for one: they missed our 3:30am wakeup call on our last morning when we were catching a 6am flight and when this was pointed out, not much of an apology was given. Thankfully we set our own alarm. Overall though, we enjoyed our stay at this hotel.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Bixby, Oklahoma", "Title": "“Not impressed”", "Author": "osucarson", "ReviewID": "UR111913879", "Content": "The staff was not friendly at all. They weren't rude, but they didn't act as if they appreciated your business. I didn't get the room I reserved, and the room was outdated and stoic. Towels were old and thin. The breakfast was not as good as other HGI's I have stayed at, and I am on the road 100 nights a year. The location is good, and that is the best part of the hotel. I won't stay here again as it was not up to the typical standards of a Hilton Garden Inn.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Whiting Indiana", "Title": "“Pool is soooo small”", "Author": "amysmom50", "ReviewID": "UR111080854", "Content": "Just got back from NOLA stayed at this hotel which was OK, location is not bad, exercise room was clean and ok but the pool that looked nice from photos was so small it was a joke, I thought I would swim daily because it is so hot but that was not an option.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“The real deal...”", "Author": "nfrasercolumbia", "ReviewID": "UR108397105", "Content": "I just got back from a 4 night stay at this hotel. I was with 2 other business colleagues and we all stayed here. I stay at this hotel from time to time for work as I travel often and stick with the Hilton family hotels. I also like the doubletree downtown and either of the hampton inns in the french quarter/convention center. I enjoy this hotel bc of the central location. It is only about two blocks from canal and the french quarter. it is great for trips on bourbon street. On this most recent stay, I had a good experience and all of my needs where met. This stay i was really impressed with the service I recieved from the hotel staff. Upon arrival, I valet'd my car but had lots of luggage due to work equipment for a convention. One of the valet's took half of my stuff to check in and then to my room with me. It was very helpful. Later on my stay, I was waiting in the lobby for a friend and sparked up a great conversation with a hotel employee named King. King overheard me speaking of a steakhouse we were going to that night. King pulled out his Iphone and showed me the best way to get there, then offered some advice on other good dining options. We also had a great conversation on some of the great chef's in the area. I very much enjoyed the conversation. He was truly knowledgable of the area and great dining. Another instance of great service was on my last night I lost my valet ticket and called the front desk for assistance as I had to leave early in the morning. It was about 2:00 am on a sat night. The hotel actually didn't have a charge for valet for me so the front desk called valet and they were able to quickly find my car and ticket number. They also arranged to have a bellman at my room to help me with my luggage in the AM. King showed up the next morning with the luggage cart. Valet had my car in minutes. The rest of the good... good sized rooms great location maid service was good/daily and didn't bother me early in the morning to clean room. free breakfest for being a hilton diamond member Some of the bad. My AC made a repetitive clicking sound, I didn't call about it however. Valet is expensive ($29 a night), parking anywhere in the area isdifficult and also comparably expensive. all the hotels are expensive in new orleans so you don't have a choice but it still sucks to pay that much. smoking rooms, make sure you request a non smoking room! the restaurant serves breakfest but doesn't provide room service in the AM. bottom line. you will find the standard amenities you will need for a 3 star hotel.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, LA", "Title": "“Jazz Fest Weekend”", "Author": "darylwi", "ReviewID": "UR108373402", "Content": "I booked here after everything else around me filled up for the second weekend of Jazz Fest (Arcade Fire, Jimmy Buffet). So I wasn't looking forward to spending $300+ a night, but honestly, it was well worth it. The hotel is on Gravier, about two blocks west of Canal. Wasn't that hard to find, especially being familiar with the area. The valet service was extremely helpful with everything. You unload and then go up to the 11th floor to check in. The hotel rooms are 11-18. We stayed on the 15th after being moved. We requested two beds but initially only got one. The change was easy to make since we left our bags and went to jazz fest anyway. When we came back, our room was ready and they brought our bags up for us. The pool up on the roof looked nice, didn't try it though. Also a fitness room and a balcony to look out over the city. Great views of the quarter and superdome. Can't see the river, too far away. It was easy to get a taxi there. The French Quarter was about 3 blocks away, Bourbon Street also. Easy to get to and felt safe the entire time. Would recommend it to anybody, but of course there were enough people rambling around as well being a popular weekend. Breakfast at the Streetcar Cafe on Carondelet is a must. Great food and southern service. For dinner, we ate in the quarter, Oceana Grill and the 424 Pier Restaurant. Both wonderfully good seafood places with Oceana being slightly more expensive. Expect closer to $80 for 2 people with drinks. But the hotel, I can't really say enough good about it. From top to bottom, start to finish, the experience was great. Clean rooms. My worst thing I could say, in the bathroom the toilet paper rolls are under the sink and a long stretch away from the toilet itself. Not a great design, but like I said, gotta be the worst thing I can even think of. Well, the room view also. We had no view from the room itself (just an outdoor atrium to another building). But the view from the roof was fantastic, so not a huge deal. I'd be tempted to book here again for next Jazz Fest if I don't book sooner and maybe something cheaper, but the beds were very comfy so who knows. Like I said, well worth it just for a two day weekend and convenience. Never had to move the car, easy walk to everything, including close stops by taxis and streetcars, and buses (which we used also).", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "KY", "Title": "“Exceptional customer service”", "Author": "IRGPT", "ReviewID": "UR102563531", "Content": "This is a solid HGI in a good location in New Orleans. It's a couple of blocks over to the French Quarter and an easy walk down to the convention center. It has an unusual layout. The lobby is on the 11th floor. Really cool pool on the roof with great views of the CBD and back toward the quarter. The rooms are about what you would expect from this brand, and I wasn't disappointed. What I wanted to point out more than anything was the staff. They were fantastic. I had a couple of special requests and had to make a change to my reservation. They took care of everything with a smile and were eager to assist. I have stayed in quite a few hotels in New Orleans (Sheraton, Hilton, Hampton Inn, Marriott, Doubletree, and the Roosevelt). I would definitely recommend this hotel and I will certainly consider it for future stays in the Big Easy.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Good Location”", "Author": "XNAGirl", "ReviewID": "UR101672974", "Content": "This was a good location in New Orleans, not very far from the St. Charles Streetcar. The rooms seemed outdated and not up to par with the price of the room. The view from our room was looking at another brick building. The pool looked very nice although small. The fitness room was wonderful.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Wonderful, quiet New Orleans hotel with a great location”", "Author": "butterandjelly", "ReviewID": "UR101624450", "Content": "This hotel's location is perfect - about two blocks outside of the French Quarter so you can easily escape from the noise and chaos but are close enough to walk to nearly every major attraction. The staff was courteous and helpful, the rooms were clean and comfortable, and the rates were quite reasonable.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“a nice hotel in a great location”", "Author": "Ken K", "ReviewID": "UR98536253", "Content": "Like they say, \"Location, location, location.\" This hotel is on the edge of New Orleans' central business district and the French Quarter. Just far enough off Bourbon St. to not be crazy or loud, but just a couple of minutes away. All of the tourist areas are within walking distance. The hotel itself is spacious and very quiet. The matresses are adjustable, so you can dial in the firmness on each half of the bed. This made for great sleep! The staff is very friendly and always has suggestions and tips for the out-of-towners. Make sure to catch a cookie at the front desk in the afternoon -- they are yummy! and go up to the top floor pool deck for a nice view of downtown and Bourbon St. The only drawback -- and it is very slight -- is that the hotel occupies the top eight floors of an 18-story building, so the front desk is on the 11th floor. So you're riding elevators all the time. But it is not much of an inconvenience.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "minnesota", "Title": "“OK - but lack of attention to detail means you can do better”", "Author": "mholder37", "ReviewID": "UR97229607", "Content": "For context - I booked two rooms. My first room was on the 14th floor. The good: The room was surprisingly spacious and clean. The bed was comfortable and the staff was friendly. The shower was hot and water pressure was plentiful. Checkin was easy and wireless was free and worked well. The location is okay - a 5 minute walk to catch the St. Charles street car. Or a 5 minute walk to Canal Street (cross it and you're in the quarter). These are the most critical things about the hotel, so my non-recommendation is based on what's below. Now for the less important, but the bad: breakfast isn't worth the relatively low cost. Seriously, much of it was not even edible. Sausages were burned. Eggs were swimming in what had to be a cup of salsa. Grits had lumps the size of ping-pong balls. Pre-fixed hot items must be served to you. This means waiting in line behind those asking for custom orders to get something you could easily grab yourself. Took 15-20 minutes to get the food that was mostly bad. My wake-up call came two hours early. Not the end of the world, but I couldn't get back to sleep and was tired all day as I'd been up at the crack of dawn for my inbound flight that morning. The elevators had trouble reading the key cards. We were warned that this was an issue with one elevator at checkin - but the problem was with all elevators. Finally, I booked two non-smoking rooms and was given one non-smoking room, and smoking room, which was disgusting. Changing rooms the first night was impossible as the hotel was full. My colleague ended up in the smoking room, which I didn't find out was smoking until the next day. I would have switched hotels before allowing her to stay in a room that was like sleeping in a bar. The second night the smoking room was switched out for a non-smoking room. That room was fresh and nice, but very hot - the thermostat didn't work to cool down the room. My room was also hot, but I was able to adjust the temp to cool it off just fine. This really an average to nice HGI where a few details were allowed to bloom and overshadow otherwise fine rooms. There are MANY choices in New Orleans, therefore, I recommend you look elsewhere but rest assured that your hotel stay won't be terrible (just unremarkable at best or frustrating at to worst) if you book here.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Would recommend”", "Author": "Alloves2travel", "ReviewID": "UR97031392", "Content": "We were pleased with our stay. The rooms were large and clean. The location was great for our needs - between the convention center and Bourbon Street. The staff wasn't helpful for recommending restaurants. I would recommend utilizing Trip Advisor to assist with restaurants and attractions.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Looks can be deceiving”", "Author": "Tieon-P", "ReviewID": "UR94608590", "Content": "Looks can be deceiving!!! From looking at the pictures on the website I thought we were getting a great room!! My room had a odor of cigarette smoke.The carpet was very dirty. I had to wear my shoes even while in my room. I will never stay in here again!!!!!!!!!!", "Date": "January 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great location and watch out for the breakfast buffet”", "Author": "Sunluvnn", "ReviewID": "UR92929665", "Content": "Great location and service! However, the costs for the breakfast buffet are misleading. The price varies. Ended up paying $7 for a muffin and a danish. Use the valet parking.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Average hotel... nothing more.”", "Author": "MarkHChicago", "ReviewID": "UR89451698", "Content": "This is an average hotel by about every standard. Check in was smooth, but housekeeping was spotty (stayed three nights, housekeeping only came once). Luckily it was just myself, so it wasn't the end of the world. The rooms were quiet, but my window looked almost directly into another room - so ask for an outside facing room, or be careful to completely close the blackout blinds. The beds were extremely uncomfortable... the adjustable comfort level beds aparrently only go from hard as rock to slightly less hard. Free wireless internet worked well. Overall, could do worse, but I have stayed at 3 other hotels in the same area that would gladly stay at before this one.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sunbury, UK", "Title": "“Good hotel a couple of blocks from Bourbon Street”", "Author": "SPaPP", "ReviewID": "UR88816846", "Content": "Strangley located with reception on the 11th floor of the building in the CBD. Large lobby/reception area. My room was very comfortable with two big double beds. Breakfast was good. Although only a short walk to Canal Street and then on to Bourbon, New Orleans does not feel a \"safe\" place to walk around alone.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Hattiesburg, Mississippi", "Title": "“Great location average hotel”", "Author": "Linnemj", "ReviewID": "UR88378495", "Content": "We loved the location for a weekend visit to New Orleans. The hotel is only a short walk to the French Quarter and the St. Charles streetcar. The hotel seems to be behind on upgrading - TVs and business office equiptment is not what you expect in this level hotel. Since the property is above commerical space it is \"soul less\". There are better choices with character while in the area.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "houston, tx", "Title": "“Great hotel, great price, great location”", "Author": "Traveller R", "ReviewID": "UR87622687", "Content": "Great hotel. Very clean, updated rooms. Great location, within walking distance of the French Quarter, but close to downtown.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rhody", "Title": "“Good location, you're getting quality basics for a decent price”", "Author": "JoeK49", "ReviewID": "UR85283743", "Content": "Probably more like 3 1/2 stars. Nice room, 14th floor, good view of downtown/Superdome. Refrigerator and microwave were very handy. Only a few blocks from Bourbon St, an easy walk for anyone without disabilities. Close to the streetcar lines also. In all, a very convenient location. I thought the beds were very comfortable and I slept just fine; not so my girlfriend. Housekeeping was great a couple of days, not so much the other day. Breakfast was just okay, a little pricey compared to what you can get in about 15 mom/pop type places within a block or two. Room service was strange. Wrong menu in the room, not too helpful in making substitutions for what they didn't do any more. But when the food came it was very good. Don't get too excited about the lounge, it is a lobby bar open only a couple hours. The front desk staff were young, enthusiatic about their city and hotel and very helpful and informative. I would stay there again - location can't be beat, it's quiet and the desk people were great. And of course new Orleans is great.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Orleans", "Title": "“Suited our needs”", "Author": "deaniedapper", "ReviewID": "UR83303739", "Content": "Nice, quiet hotel in CBD close to French Quarter. Appears to be a remodeled office building, nothing spectacular but suited our needs.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Nice hotel in a good location”", "Author": "screenname46", "ReviewID": "UR81502574", "Content": "I stayed at the Hilton Garden Inn French Quarter as a solo female traveller, and thought it was great. I had a problem with the online booking company, but the hotel staff were able to sort it out very quickly, and the hotel staff were very friendly generally. Rooms were clean and comfortable, and the hotel is in a great location - about a 1 or 2 min walk from the St Charles and Canal St street cars and the French Quarter. I felt safe walking around the area. The hotel internet was a bit sketchy for a few days while they were upgrading the system, which was frustrating, but was fine after that. There is a coin laundry in the hotel too. The restaurant was ok, but not great, though this didn't bother me as I ate out most of the time.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rancho Cucamonga, California", "Title": "“Great room and convenient location.”", "Author": "Rugger Hugger", "ReviewID": "UR80781440", "Content": "We checked into this hotel last Saturday night and were immediately upgraded to a corner suite. The room was outstanding, and the front desk personnel were helpful and friendly. There is valet parking at the hotel. It is a short walk to Bourbon St. and most sites in the French Quarter. We walked to Jackson Square for beignets, and along the waterfront, saw the galleries on Royal St., and never missed our car. It is a good place to stay if you want to experience Bourbon St. madness, but still want a quiet place to sleep!", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Good service. Otherwise, pretty average room accomodations...”", "Author": "lcnyc123", "ReviewID": "UR74025860", "Content": "Great service. Everyone was super friendly to me. Actually, hotel staff was much nicer than other hotels I have stayed at in New Orleans recently (and those were 5-star hotels!)... Hilton Diamond member ... so got breakfast for free. Nice hot made-to-order breakfast. you can get omelettes, eggs, sausage, pancakes, breakfast potatoes, etc. Not sure I would have paid $12.95 for it though ... Room was fairly basic. Nothing fancy. But it was pretty clean. I was on 16th floor and got a good city view... Gym could use some updating / cleaning. only 1 treadmill and it said belt needed to be rewaxed. The elliptical machine looked like it had dried soda on it at the base (at least I hope it was only soda). Hotel didn't have any cleaning wipes to wipe the machines down when done... so just beware of that it you have germ issues. Good view from the gym and the small pool area on 18! This is the kicker .. they have a sign on the in-room safe saying \"$3 daily charge to use the safe\". Huh? What hotel charges to use the safe?! This after other earlier postings by guests on travel advisor for this hotel warn of stuff missing from rooms? That did not make a good impression on me. I did use the safe, but ultimately at the end of the day, they didn't charge me on my bill... I think this was because I wasn't using the safe when hotel staff came to clean the rooms. So, that's probably when they check. I only used it to put my computer + wallet in when I went to the gym...", "Date": "August 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Hamburg, NY USA", "Title": "“Not impressed, not nearly as nice as the nearby Homewood Suites”", "Author": "Preds1", "ReviewID": "UR73332017", "Content": "I booked a couple nights at the HGI FQ last weekend for my family and had a mixed experience. We had booked the Southern Summer Rate. A rate that included valet parking, a movie, popcorn and 2 sodas. We arrived Friday evening around 7:30pm. The valet parking was easy enough, check-in is on the 14th floor. Got there, waited a few minutes to be called on by a pleasant receptionist. So far so good... unfortunately things went downhill from that point forward. I asked about any available upgrades as a Hhonors Diamond member. Was told nothing was available. Kinda a disappointing start, but whatever, unfortunately it was the start of a downward trend. We were offered breakfast coupons we didn't use, and a couple bottles of water. Felt just like a HI minus the nice welcome letters from the GM's with chocolate bars in the room. We were then sent to the pantry to pick out some popcorn and sodas that were included with our rate, only they had no popcorn left (not a big deal), and no diet sodas (ok, so we go with water, again, no biggie), the downward trend continued. We got to our room on the 17th floor (1712), and it was... well, disappointing. The room had a very ordinary, OLD 25\"TV with poor reception (I try to avoid hotels that don't have flat panels at a minimum... whoops). The room was worn and dated. Definitely in need of upgrades. The bathroom was flat out terrible. Amongst the worse we've experienced (only beat out by a terrible worn bathroom at the ES Phoenix). The tub had significant scratches that flat out looked grungy, and a large indentation (dent, warp, something weird) in the middle of the tub (not near the drain) that forced you to be careful where you stepped while showering or risk slipping and getting hurt. As for the beds, wow, they were uncomfortable, and my neck still is hurting from the pillows. The first night we couldn't tune in the menu button on the relic of a TV, so we could get a list of available movies to see what the kids could watch with the free movie included in our rate, so set that aside for the next day. I tried using the WIFI to finalize our plans for Saturday, but the connection was terribly slow WIFI. I switched to a corded connection and couldn't get any internet. So settled on the very spotty, slow WIFI. Ultimately giving up entirely for the evening. Saturday I took the family all around New Orleans, and we had a great day riding Segways, walking the Garden District, and enjoying some great meals. Got back to our room around 8 or so with plans to let the kids watch their free movie. The menu system was finally working, so they selected and watched Clash of the Titans. Meanwhile mom and dad crashed early since we had to get up at an ungodly 3:30am to catch an early 6:30am flight out of MSY. We got up the next morning, and were ready to go by about 4am... apparently we were too early to get the checkout bill delivered to the room, so I sent the wife and kids down to get the car from the valet and got off at the 14th floor to check-out at reception. Unfortunately, NOBODY was there. I tried saying HELLO, knocked on the counter, no response. The office door was open behind the counter but there was no sign of life in there, though I couldn't see in too far. I suspect the desk agent was catching a catnap. After 15-20 minutes of making noise and trying to get someones attention, a receptionist finally strolled out of the office. I asked for a copy of my bill to checkout, and the woman tried to charge me for a number of items from the pantry that were sitting on the counter but not mine. Innocent enough mistake I guess (though it tells you that someone got tired of waiting and left). Anyhow, I politely inform her that I just want my receipt, those aren't my items. She printed it up, handed it to me, and to no surprise, it was wrong. I was charged for the movie that was to be included in my rate. I politely advised her that the Southern Summer special rate included valet parking and a movie, and she immediately got defensive and said not that movie. Only movie's $12.99 or less. Huh? Nowhere on the rate did it stipulate a maximum allowed rate. Nor was I advised of that at check-in. So I challenged the validity of that and the receptionist eventually took the illicit charge off my bill. All this time, my wife is texting and calling asking where the heck I am... it was over 30 minutes before I finally got downstairs to meet back up with them. Overall, we enjoyed New Orleans, but didn't enjoy the HGI FQ. The location is decent, but the service is inconsistent, the rooms are dated, and the staff is a mixed back. We've stayed at several other Hilton properties in New Orleans.. I recommend the nearby Homewood Suites on Poydras (had an awesome stay their last summer), or the Hilton Riverside, or if in town for a convention the ES... but I'd suggest avoiding the HGI FQ.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria, VA", "Title": "“Nice hotel with great staff”", "Author": "keut", "ReviewID": "UR66480752", "Content": "This was a very nice hotel, close to the French Quarter (about 3 blocks from Bourbon and Canal). The staff was so nice and helpful. The rooms are fairly large--we requested two queens (one for husband and me; the other for our college-age son), and still had plenty of room. There was a fridge, and a safe. Our room didn't have much of a view, but there's a great one from the rooftop pool and fitness club, and another good one from the lobby which is on the 11th floor (garage takes up the lower floors). The business center with computers very nice; and the lobby bar also nice. We would stay here again next time in New Orleans.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "washington", "Title": "“Perfect Location”", "Author": "stbeachlover", "ReviewID": "UR65099431", "Content": "Just got back from a vacation in New Orleans. This hotel's location was perfect. It was close to Bourbon St. without the noise and the craziness. It was clean and their breakfast was very good. We tried to go to the pool which is really small but it was so windy up there on the roof. Our room was quite spacious with a beautiful view of the city. The staff was friendly and helpful. I would definitely stay here again if I come back.", "Date": "May 23, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Irvine, California", "Title": "“Avoid this place; thieves have access to your room!”", "Author": "peadles1998", "ReviewID": "UR62403324", "Content": "My wife and daughter and I stayed here for 2 nights just after Easter. We were surprised to find a hair styling flat iron missing after returning to our room. We contacted the hotel manager to report this and got a luke warm response; understandable since it's just a $70 item. Then after checking out my daughter looks through her backpack and finds her iTouch, my MP3 player and other small items were also stolen. We contact the hotel manager again and report the addtitional losses and they tell us they will look into it. Long story short: we are told that only authorized persons went into our room, none of our items can be found and it's just our tough luck that this happened. New Orleans is a fun place to visit, but do not stay at this hotel, the thievery that goes on will sour your experience.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Clean, safe, and quiet”", "Author": "Karluk_10", "ReviewID": "UR62190721", "Content": "We picked the Hilton Garden Inn because of the great reviews on Trip Advisor. We rented two king suites for two couples and paid in advance with no refund. The service was great and one of the rooms was fine. The other suite was just so-so. Both were quiet. The pool was crowded and noisy, even though we were between festivals and the hotel was not full. The valet parking was good and at $26 per day was the same as other hotels. The hotel was within easy walking distance of the French Quarter and the St. Charles streetcar to the Garden District. Also, close to the Roosevelt Hotel, which is worth a trip to the Sazerac Bar and the Blue Room.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Quiet, comfortable and handy”", "Author": "brissotravellers", "ReviewID": "UR61715466", "Content": "Good location being just out of the French Quarter (no noise problems late at night) but close enough to be an easy walk. Its on a small street which may be a bit of a concern for some at night but we had no problems and felt safe. The rooms are quiet large and well mainatained. Clean, comfortable with all the faculties we needed. Being located above floor 11 the rooms are quiet and have all the facilies needed. Decor is a little dated but fine.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Great location for walkers”", "Author": "TagAl0ngWife", "ReviewID": "UR59680418", "Content": "This was our first trip to New Orleans and we were looking for a reasonably priced hotel where we could park our car and walk everywhere. This unique hotel has the lobby on the 11th floor with rooms above, and the floors below are all parking. We put in our car when we got there Saturday afternoon and didn't use it again until we left on Tuesday morning. It's an easy walk to the French Quarter, the Riverfront area, the Superdome, and the Canal St. streetcar line which will take you to the WWII museum & Garden District. The $26/night parking fee was reasonable and we would have easily spent that much to park in the various attractions if we had to drive there. The hotel was clean, quiet, and comfortable, and we enjoyed our stay. We didn't have a view from our window, but we went up onto the roof where there is a very tiny pool, and were able to look out over the city. There were no non-smoking rooms available so we accepted a smoking room, but the smell was minimal. We would definitely recommend it to our friends & family.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brownsburg, IN", "Title": "“You can always count on this chain and this one was the best of the chain I've stayed at”", "Author": "KCandAJ", "ReviewID": "UR57805936", "Content": "Staff was wonderful. They were very prompt and assisted me with everything I needed. I lost my phone charger and they even assisted me with trying to find one that would work in their lost and found and when we could not they looked online and located the area stores that sold a charger that would work on my phone and even compared prices at each location. Each dining recommendation they made was fantastic. My room was very spacious and clean. The location is very near the French Quarter but located in the CBD which was perfect as I was there for work and could conduct my meetings in the day and then take a short walk to the Quarter for dinner but also avoid the noise during late night. I'm in New Orleans 3-4 times a year for work and will check availablity at this location for every future visit. I learned a valuable lesson on this trip to stay somewhere you can trust and I won't forget it in the future. Most Hilton locations and certainly this one are somewhere you can trust for a quality stay. Roof top pool was also very nice. It's heated and I was able to enjoy it on a 60 degree day.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eastern Iowa", "Title": "“Safe, clean, restful place to stay that is close to French Quarter”", "Author": "hitagacamper", "ReviewID": "UR57579451", "Content": "We were traveling with one son and his family(wife and 15 mo. old child) and adult daughter and her boyfriend. We wanted non smoking king rooms. We found this hotel was all it advertized to be. The valet parking seemed expensive, but we found it to be excellent and very secure. The staff at the hotel were excellent and attentive. The breakfast met everyone's needs. It is not located in the French Quarter, but is close and walking could be an option. It is within an easy walk of the World War II Museum and the Aquarium. We thought something was missing from one of our cars and the hotel responded to our inquires and followed-up on everything. It turned out the item had been misplaced and we called the hotel and told them we found the lost items and thanked them for all their help in the matter. We were very impressed by their due diligence in the entire situation. The pool is an outdoor pool, but it is heated so we were able to swim in comfort even though the temperatures were cool.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Hotel for the budget minded”", "Author": "PeghandleMike", "ReviewID": "UR56716404", "Content": "We stayed here in November since the price was right we stayed here again in February just after Mardis Gras. Normally, we are able to check in early however on this trip we were told to come back at 3pm. We were able to check our luggage and return later without a hassle. We did encounter a problem with the cooling system in our room. The thermometer read 68 degree but it was clearly closer to 78. This concern was addressed promptly. We did have the exact same problem when we stayed in November. The rooms are clean and comfortable. They provide free wi fi. They cater to the business clientelle so it's nothing fancy. There is a mini fridge and microwave. The hotel itself was very quite. We did encounter a noise problem whenever someone took a shower/flushed it made a loud noise of rushing water for the duration. Like woke us up at 4:30am. Valet parking was exceptional.( Yet pricey) My wife left her phone in the car and the attendant litterally ran up and retrieved her phone promptly. When we checked out the car was waiting for us by the time we got down on the elevator. The hotel is on the quiet side of Canal St which is a big plus. The drawback can be location for some who don't enjoy the walk. An additonal problem is If you're in the middle of the Quarter and decide I should have grabbed my coat you have to hike back to your hotel.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX.", "Title": "“Excellent staff and comfortable bed!!!”", "Author": "katpatpas", "ReviewID": "UR55674359", "Content": "We stayed at this Hilton for 3 nights to see the Mardi Gras parades and for the Super Bowl game. The staff could not have been better, We arrived at 9:30 a.m. and had requested early check-in. We were upgraded to a suite with a couch and were checked in immediately. The Super Bowl party in the hotel lobby was very enjoyable and every staff member from the restaurant to the front desk clerks, to the housekeepers, and the parking attendants were wonderful, courteous and helpful. We have stayed at this hotel previously and will definitely stay again. The breakfast buffet was delicious as was the dinner menu. The bed was very comfortable also. You can't go wrong with this hotel.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens, Ga.", "Title": "“A Supergras-super hotel”", "Author": "hbwhit", "ReviewID": "UR55569325", "Content": "A couple blocks from Canal and Bourbon. We never mind the walking; makes up for all the eating! Quiet...unless you have Super Bowl/Mardi Gras party animals next door, like we had one morning :) The room was plenty big and it had fridge and microwave (plus!). Staff was accommodating and hotel amenities were great. The roof top pool (heated to hot tub temperature!) was awesome as well as the view!", "Date": "February 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ewa Beach, Hawaii", "Title": "“Staff: Excellent - Management: Friendly but NOT well organized or staffed”", "Author": "Boeing767", "ReviewID": "UR55258287", "Content": "As a leisure traveler, you will find that this hotel MORE than meets your needs. The rooms are clean and spacious, the front desk staff is warm and accomodating, and the amenities a cut above many hotels (i.e. microwaves, refrigerators). HOWEVER (there is always a HOWEVER), if you are a frequent or business traveler, and you have certain standards that are not negotiable - you may want to pass on this location. We arrived on a Sunday at 2:00 PM to find our room not ready; annoying but understandable since their posted check-in time is 3:00 PM. I asked the desk clerk when it might become available, and she said that she had to check with housekeeping (okay, understandable). She radioed and radioed, with no response. Finally, she dialed an extension, and the person on the other end of the line evidently told her to radio - which produced the same result. Frustrated, I just stood at the counter until she got it resolved. We got into our room at about 2:30. Meanwhile, I had asked that a manager call me - because there was none on site (WHAT??!! - NO MANAGER at the hotel???). A manager did call, and she was contrite, and understood the frustration - and explained that the radios don't work all that well in an old building (solution: don't use them, use cell phones instead; I had 4 bars). They comped a movie and snacks for my son - I appreciated that effort. So, if you are a type-B traveler (easy going), you will really like this place - it's close to the French Quarter, the staff is accommodating, the rates seem reasonable. But, if you are more of a Type-A, the minimal staffing and lack of constant on-site leadership might get under your skin. There was nothing that would keep me from returning, although I might contact the hotel in advance to make sure that everything is on track. Mariana, the desk clerk is a GEM!", "Date": "February 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ms", "Title": "“Excellent place to stay, great location and outstanding amenities A+.”", "Author": "luv2shopntravel", "ReviewID": "UR51738215", "Content": "This is a great location for shopping and walking distance to all the excitement on canal and bourbon street. In addition, walking distance to Harrah's casino, Aquarium of the Americas and River walk. This hotel has an outstanding staff. At five in the evening, home made cookies along with fruits are free to the customers. There were no fees for late check out or for the use of the hotel's computer using thier internet.services.", "Date": "December 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bixby, Oklahoma", "Title": "“Wonderful Hotel!!”", "Author": "JHallermann", "ReviewID": "UR49787791", "Content": "It was beautiful, the staff was very helpful and nice. The rooms were amazing with very comfortable king size bed, with flat screen TV. There's 18 floors with a pool on the roof over looking the French Quarter. Wonderful breakfast in the morning everything you could ask for in a hotel. Especially on your honeymoon!! PERFECT!! I would most definitely recommend. Only a five min. walk to Rue Bourbon. Amazing!", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A Great Place to Call Home in the Big Easy!”", "Author": "007CubsFan", "ReviewID": "UR49071052", "Content": "I had read some of the reviews here before booking my trip. I arrived a bit early but they were happy to let me check in. The front desk staff were very friendly, pleasant and professional. They gave me an upgrade to a mini suit, which was nice. I took pics of the room. I was on the 16th of 18 floor - I like it high up!! The room was nice and cozy, with a microwave and mini fridge - great to have some snacks. The view could have been better. The bed and bedding were amazing! Very comfortable - I did not want to get out of bed in the morning. Everything was clean and it working order. The furnishings were a bit old and dated but that was okay. The pool is small but heated, out doors and on the 18th floor! Check it out - nice view of the city! Nice small gym too. Breakfast was good - they make about whatever you want and it is all one price. Free wired internet and free WiFi through out the property! Location was also great - about 3 blocks from the French Quarter so very easy to get around and see the city! I would certainly return to this location and it is by far superior to the Doubletree and Hilton which I have also reviewed.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alabama USA", "Title": "“Great hotel with only ONE problem.”", "Author": "Mikafe", "ReviewID": "UR38906719", "Content": "This Hilton Garden Inn is a great hotel. The location couldn't be better because being in the Business District of New Orleans makes it more affordable than the hotels of the same category that are located in the French Quarter. At the same time, it's just 2 blocks from the French quarter, so it's perfect for someone who is going to visit New Orleans for either leisure or business. The hotel is elegant, the staff is great and the rooms are very comfortable. One thing that makes it different from all the other hotels I have visited is the fact that it is built on top of a parking building. The administration offices and front desk are situated on the 11th floor! . That probably makes the hotel safer and also the fact that in order to use the elevator the use of a card is needed, so no stranger can go to the hotel floors. It has a nice restaurant. We only had breakfast there but it also offers lunch and dinner. Breakfast was very good and the staff was really friendly. I can't find anything I didn't like about this hotel as far as service, room, staff is concerned. The only thing we didn't like was the fact that every guest HAS to use the valet parking service. There's NO other choice and it is NOT cheap. As a matter of fact, it was very expensive in my opinion. We paid $26 per night, even though we didn't use the car everyday and it stayed parked most of the time we spent at the hotel. This, of course, made our stay more expensive that we expected. This is the reason why I gave a rate of only 4 for 'value'.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bergen, Norway", "Title": "“Hilton is almost nice, isn't it?”", "Author": "beadro", "ReviewID": "UR38029107", "Content": "Great service, overall happy with the hotel. Stayed on the business level, which was excellent.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Not a bad place to stay”", "Author": "gmk1214", "ReviewID": "UR30176447", "Content": "The rooms were nice, close, but not too close, to the French Quarter. Street Car stop 1/2 block away. The desk attendants, although very friendly, knew very little about the city they were in, in regards to transportation, restaurants, sightseeing. As this was our first trip to New Orleans, we we sort of hoping for better information. The A/C in the room never seemed to be quite cool enough, so beware if you are traveling in the summertime. All in all, for the money (we went for JazzFest), a good deal, walking distance to the French Quarter and seemed to be in a safe neighborhood.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "North Dallas", "Title": "“Great hotel. Take advantage of amenities not advertized.”", "Author": "bronco_5", "ReviewID": "UR28529664", "Content": "First of all...do yourself a favor and if you have a car, take the valet service. Now, whether or not you have a car, do yourself a favor and use the massage chair in the garage area. It's there for you to enjoy. I wasn't sure, so I went and sat in it. When a parking attendant came by, I asked if it was a problem that I was there. He stated, 'That's why it's here, for the customers.' I used it everyday. Hotel was quiet and the room was clean. I had a bathtub that was backing up and called about it. Within minutes, maintenace was there to fix it. Great JOB! Another bonus - Free Internet! Here's the bad....First, the ice machines don't work on every floor, so you'll have to go to the floor with the working ice machine. Not a biggie in my book. Second thing....Don't bother with the breakfast on the 11th floor. I went and looked...horrible.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Kihei, Hawaii", "Title": "“An average stay at a Hilton Garden Inn”", "Author": "KeeKeex2", "ReviewID": "UR27878664", "Content": "A friend and I chose to stay here because of Hilton membership, and the rate wasn't bad either. We also chose to stay here because of other reviews on tripadvisor and from the said location (only a few block from the french quater). The hotel itself was unique, quiet, and clean. The rooms were very basic and somewhat on the small side, but we weren't in NOLA to stay in the room. In any case, I was happy with the cleanliness of the room and the fact that it had a small refridge and microwave. The website states that the hotel is only a few blocks from the French Quater, which it is. However, as two females in our mid twenties, we did not feel safe walking to the french quarter from the hotel during the daytime. We knew to take a cab at night, but even the day time walk made us feel uncomfortable. Also, I had gone to NOLA to experience the culture side of it and not necessarily to stumble back to my room at 3am. From the location of the hotel, I would have preferred to stay near the water which also seemed to be a much cleaner and more upscale area of the french quarter. In any case, if you are a traveler looking for the party scene, this place may just work for you. If you prefer to see the sights and enjoy the food in a cleaner part of town, I would recommend that you stay near the water. All in all, I wouldn't stay at the hotel again, but at no fault of the hotel's. After a small incident with our trip, we had to check out a few days early. The staff was very understanding and made it a smooth transaction. We drove to NO and parked our car at the valet service at the hotel. Each day is around $29 including tax. When we checked out, we paid our days for the valet and left. However, a few weeks later, we received a charge on the credit card from the valet service at the hotel for the remainder of our original stay. In other words, we were charged for our car being parked there after we had already driven home. We immediately contacted the hotel, and they credited the account without any issues.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Best of both worlds”", "Author": "Pete--from---NYC", "ReviewID": "UR27542409", "Content": "I just spent three nights at the Hilton Garden Inn New Orleans French Quarter/CBD. It was a great stay. The Hilton is clean, with large open rooms. This was the quietest hotel stay I have have in a while , with no hallway, wall, or outside noise. The hotel is well situated for the French Quarter, and for Harrah's. It is a few blocks from the French Quarter, but a nice break from the noise/action of Bourbon Street. The rooftop pool is tiny, but we spent some time on the roof hanging out.. While you are in the FQ, be sure to hit the Acme Oyster company for a lunch/dinner, and NOLA for a great dinner.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Not a typical Hilton Garden Inn in terms of service - very poor”", "Author": "spregflyer", "ReviewID": "UR27301145", "Content": "After arriving and not being impressed by the hotel, the manager actually argued with me. The check-in person was great, but for some reason the manager has issues with any kind of discounted rate (I'm an airline employee). If we had better sense we would have gone somewhere else. The rooms are OK and clean but just basic when compared to other hotels at similar prices. The location is a couple blocks off Bourbon Street but the street and parking ramp is really run down. The breakfast staff could definitely use some customer service training, but then again considering the manager, they are par for the course. We stayed a couple nights here and really wished we stayed elsewhere. After not being able to make it on our flight out of MSY, we ended up staying another night in New Orleans and we stayed at the Crowne Plaza Astor - a much better hotel all the way around and the rate is not that much higher. I would recommend you stay there rather than the HGI.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Everywhere", "Title": "“Good Location, Quiet”", "Author": "skurny", "ReviewID": "UR25958259", "Content": "Some friends and I just spent the weekend here and overall, it was a good stay. It's on a quiet street just off Canal, which is great because there wasn't traffic on the street or screaming drunk people at 5am. They also gave me some complimentary breakfast coupons for the friends staying with me, which was a nice touch. There were a few small disappointments, though. First, the mini-fridge in our room didn't work. I called the front desk and they had someone up to the room within 15 minutes to remove it...about 5 minutes later he returned with a working one. Problem solved efficiently. Second, the ice machines on 12 and 13 were both down so we had to go to the Hotel Bar to get ice...not a huge issue but a bit inconvienent. Third, the \"pool\" on the roof is more like an oversize hot tub without the jets. The view is nice and my friends and I had drinks up there one night before dinner. Don't plan on doing a lot of swimming at the hotel, though. Then again, it's New Orleans and you should spend your time walking around, eating and drinking...not swimming in the hotel pool! The staff was friendly and the weekend rates were cheap ($95 a night). The hotel was clean and I'd recommend it and stay there again. Positive: Location, Quiet, Clean, Friendly Staff Negative: Fridge, Ice Machine", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas", "Title": "“Great location and Great Value”", "Author": "TXTravelPublisher", "ReviewID": "UR18893806", "Content": "At first glance, an odd property since you really never see the hotel and enter through the garage with hotel occupying top floors of old office building. I visit New Orleans often and prefer staying near but not in the French Quarter and there are plenty of hotel options that fit this description but for the location and price you will be hard pressed to find a better option than the Hilton Garden Inn. Very pleasant and helpful staff, and extremely well managed property that offers all the amenities of typical Hilton Garden Inn brand including free wireless internet, and breakfast. Parking here is very expensive at $30 a night with seems excessive to me but generally on par with other city garages. Rooms are very clean, and modern but small work out room share the top floor of property adjacent to small rooftop outdoor pool. Location is great only blocks from French Quarter, Poydras, and Canal.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "atlanta ga", "Title": "“Great Location and Nice Overall Hotel”", "Author": "taprennoc", "ReviewID": "UR17385547", "Content": "This was my second stay at this Hilton Garden Inn in the French Quarter. I booked it primarily because of the price (around 90.00) and since I had stayed there once before and I am a Hilton Diamond Member I knew what to expect. The hotel is kind of secluded, so be careful or you will pass right by it on the narrow one way street it is located on. Valet parking only is kind of expensive, although not as much as the Doubletree just a couple of blocks down. Lobby is on the 11th floor, and the rooms are from 12 on up. It strikes me odd that you can do a daily park there as a tourist for 6 to 10 dollars a day, but as a guest it was 28.00, plus tax. But with the low rate I didnt see a reason to complain. Hotel check in was fast and friendly. Room was clean, nice, and quiet with a slight view of the water. Breakfast was good, and as a diamond member it was complimentary. I don't know if I would have paid 10.00 for it. Valet was quick to bring the car down and assisted with luggage. Harrahs Casino is only about a 4 block walk and Canal Street if only about 2 blocks away. I would definitely stay here again if I could get the same low rate, even with the parking feee.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Nice Hotel - Not Quite in French Quarter”", "Author": "NUCat_in_TN", "ReviewID": "UR16818092", "Content": "My family stayed at this hotel when we came to New Orleans for a graduation (got a group rate of $99). The hotel is clean and comfortable. The staff was polite. However, if you try to check in early and they say they will call you when your room is ready, don't believe them. PLEASE NOTE: This hotel is NOT in the French Quarter - it is about 3 or 4 blocks west of Canal Street. It is an advantage because it quiet. It is a disadvantage because there is nothing around. If you want something quick for breakfast, something from Starbucks or an ATM, you'll need to go for a walk unless you want to eat at the in-hotel \"restaurant\", which will charge you an arm and a leg for a bagel and a Coke. Also note that parking is about $25/day - about standard for NOLA. I would stay again but would bring walking shoes.", "Date": "June 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "flyonblue", "Title": "“A Strange Neighborhood”", "Author": "flyonblue", "ReviewID": "UR16404859", "Content": "The Hilton Garden Inn is located on a side street of Canal Street. Though this is very close to the French Quarter itself, the somewhat sketchy walk through these side streets made me wary of staying there alone. Beside its location, the hotel and its staff were wonderful. There was a tendency for loud yelling at 3am in the morning as college-age students returned from their shenanigans on Burbon Street. I would recommend this hotel if you have someone to stay and walk with and if you can get a special deal that includes free parking (it is a 26 dollar fee otherwise).", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "ma", "Title": "“Nice”", "Author": "mtbk", "ReviewID": "UR16352499", "Content": "This is a nice, clean place to stay if you don't want to pay the high price of the French Quarter. We stayed for 6 nights so the fridge and microwave came in handy. The staff could have had better knowledge of the streetcars and a little better at directions but we had maps and were able to get around fine. We ate at the restaurant twice because everything around the hotel closes by 2 pm and we didn't feel like going back into the French Quarter. We both liked our meals but we also had enough sense not to expect a top notch meal. We ordered sandwiches and salads. We had a different waitress both times and thought they were great. My only complaint is the room wasn't cool enough. They did send someone and it got a little cooler. They called a few hours later to make sure we were happy and to see if we needed anything else. I felt it still was a little warm for me to sleep but since I'm from New England and used to cold nights I figured it was more my problem than theirs.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Morris County, NJ", "Title": "“Great Hotel, good location”", "Author": "seayou99", "ReviewID": "UR15052919", "Content": "An excellent hotel although the location is a little misleading. The property is actually in the central business district about 1-2 blocks from canal street which is the western edge of the French quarter. I felt safe in this area and it was a bit of a hike to the converntion center, my place of business at the time. The hotel lobby is located on the 12th floor which is a bit odd but it works. The rooms were clean and the buffet breakfast with omlet station is just fine. I would stay there again.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“A not so bad hotel in new orleans”", "Author": "tapebackup", "ReviewID": "UR14333242", "Content": "I just was in this hotel for a week. Overall, I would say it's an \"averagely nice\" place to stay in New Orleans. On the positive side, the rooms are quite big, well equipped and clean. The beds are nice and comfortable. The room had a small fridge as well as a microwave oven (although I used none of them). Also, the hotel is quite conveniently located, very close but not inside the (noisy) French quarter. The staff at the reception was professional and efficient. However, everything was not perfect. First, the internet connection was *amazingly* slow. Both wired and wireless connectivity was available, and both were slow. Moreover, the wireless signal was very weak in most of the room. Food taken at the hotel's restaurant was really \"average\" and the restaurant staff was really painfully slow. In summary, this hotel is not extraordinary, but if all you need is a simple place to stay then it's probably a good choice.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good, but don't eat here!”", "Author": "Daniel_Lon", "ReviewID": "UR13994514", "Content": "OK, now this was my first time in New Orleans so I took a bit of a flyer on the hotel. Location was good, quiet and just off the main Canal St and close to Bourbon St (without the noise) - I don't think in hindsight I would stay anywhere too close to Bourbon... Hotel was clean and easy to find and I would stay there again, price was reasonable at $159 a night however there were a few niggles. Firstly, there is a compulsory $2.50 charge per day for having a safe in your room. C'mon people, be honest - just add it to the total room charge upfront. This is just cheeky. Also, we had problem with never getting shampoo as the cleaning staff couldn't read the labels in English and got the mouthwash confused with shampoo. I know this because we asked them! Finally, whatever you do, do not eat at the 'Great American Grill' their in house restaurant. The food is very very poor, overpriced and the service dreadful. The waiter and waitress had to call over the manager to open our wine because they had never used a corkscrew before!!!! The steak was so over cooked I felt like re-soleing my shoe. No, no, whatever you do go out and eat. Food and service aside I'd stay here again.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Memphis, TN", "Title": "“Excellent Stay”", "Author": "misitemd", "ReviewID": "UR13895337", "Content": "We stayed at this hotel for a weekend in New Orleans. The location is great - a few blocks from Canal and Bourban Streets. We had a corner suite with a king bed. We had lots of windows with great views. The room was very clean! Parking was $26 per day. We would certainly stay at this hotel again in the future.", "Date": "February 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Richardson", "Title": "“Great Deal for New Orleans”", "Author": "MayYeah", "ReviewID": "UR12452624", "Content": "My wife and I stayed overnight at the HGI CBD/French Quarter on December 30, 2007 and was pleasantly surprised with our accomodations given our rate of $84 plus $26 for parking. The size of our standard king room was exceptionally large by New Orleans standards and comparable to what you find in new construction HGI's around the country. The hotel is a conversion and not very welcoming from the street level entrance which is a parking garage. However, once you reach the lobby via the elevator to the 9th floor, you know you are in an HGI with the exception of a much larger common area than most. I can attest to the earlier reviews that the location is both quiet and convenient. In fact, Harrahs is only four blocks and the French Quarter maybe three. The pool area on the roof provides a nice view of the city and the smallesh fitness center overlooking the terrace is a nice touch. There is very litte wear on this hotel at least on the surface. What a deal for $84 and in New Orleans during peak nights a deal for at least twice that. Oh, did I mention they threw in free breakfast for my wife and I given my Gold Hilton HHonors status? The only problem we experienced was a fussy thermostat that resulted in us waking to a warmer than desired room. After fooling with it a while, things cooled off. Not a big deal to this frequent traveler who has experienced his share of problem temperature controls in hotels costing 3 to 4 times as much.", "Date": "January 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Chester, Pennsylvania", "Title": "“Good Hotel”", "Author": "KGKDH", "ReviewID": "UR12267313", "Content": "This hotel is great for a weekend stay. We had a large, clean room. It is not a luxury hotel but this was fine for us because we were not spending a lot of time in the hotel. There is a great view of the city from the pool at the top of the hotel. I would recommend this for business travelers as well.", "Date": "January 2, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Houston", "Title": "“Very Good”", "Author": "Smart40", "ReviewID": "UR11078983", "Content": "The Hilton Garden Inn on Gravier was a life saver for me and my family. During the Bayou Classic I had to find a place to stay after arriving a another very disappointing hotel, I called the Hilton and they were able to accomodate us. Check in was quick and very courteous. I felt very secure with my children because you have to have key card entrance to the floors. The rooms were immaculate. I could say so much more, but to sum it all up I was very pleased and would stay here again.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Another Great Stay at Hilton Garden Inn”", "Author": "PatriciaF", "ReviewID": "UR10227741", "Content": "This was our second stay at this hotel. The first time was Mardi Gras 2005. The location is conveniently located to the French Quarter--two blocks from Canal St and 1/2 block from Carondelet which becomes Bourbon across Canal. Rooms are a good size. Very clean. Very quiet. Beautiful view of New Orleans from the roof patio/pool area. Only downside is that the restaurants across the street from the hotel are not open during the weekend as this area is the business district. There is a restaurant in the hotel open for breakfast and lunch. We used it for breakfast the last visit and it was fine. Service was a little slow. For those thinking of coming to Mardi Gras 2008, remember that Canal St is usually closed due to the parades. If you are staying in the quarter, your cab will have to drop you off at Canal St and you will have to drag your luggage across the street to the many hotels. While it might be fun staying in the quarter if you are on 24 hour party mode, its much quieter at the HIlton Garden Inn.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great stay at the Garden Inn”", "Author": "travelinillinois", "ReviewID": "UR8419036", "Content": "I recently stayed here over the weekend with my teenage son and adult niece. Good location - only a few blocks walk to the heart of Bourbon street. We got a great rate when we booked on the website. The rooms are large - there was plenty of space for the 3 of us. Beds are very comfortable. The entire hotel - lobby, hallways and rooms were all clean - looked almost new. It was so quiet it was hard to tell if there were other guests on our floor. Housekeeping was great - you couldn't tell they were on the floor until you saw their cart. We went out on Saturday a.m. and when we returned, in addition to cleaning our room houskeeping had neatly lined our shoes along the wall, placed our toothbrushes in a glass and organized our toiletries on the bathroom counter. We did eat breakfast at the grill there - buffet is $10.95 - and they make omelets, pancakes, french toast, etc. to order. The staff there is very friendly and attentive. Also this is one of very few hotels there that offer free high speed internet in the room. I would recommend this hotel for a great stay that is close enough but not in the Quarter.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Nice Stay during Jazzfest”", "Author": "Hortkie", "ReviewID": "UR7586175", "Content": "Hotel is a nice quiet almost hidden gem. Stayed here for 2nd weekend of jazzfest. Easy walk to Harrahs, stinky bourbon st., plenty of cabs drive by, friendly staff, nice free breakfast (diamond hhonors benny) , room always made up nice when I returned, small pool but had it all for rmyself - just right. Small little bar for a quick drink and good bartender. I'd stay here again.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lansdowne, PA", "Title": "“Great Hotel!”", "Author": "intl_realist", "ReviewID": "UR7348391", "Content": "We choose the Hilton Garden Inn as our pre-cruise hotel. Everything about the hotel was to our liking. Check-in was a breeze; the rooms were clean and spacious. Internet was free. And, of course, the hotel was a short walk from the French Quarter and the Riverfront. My only disappointment with the hotel was the fact that the fitness facility was small and many of the machines were broken and the outdoor heated pool was filled with dirt and debris. Other than that the hotel was great and we will definitely be staying here again!", "Date": "April 13, 2007"}], "HotelInfo": {"Name": "Hilton Garden Inn New Orleans French Quarter/CBD", "HotelURL": "/ShowUserReviews-g60864-d320080-Reviews-Hilton_Garden_Inn_New_Orleans_French_Quarter_CBD-New_Orleans_Louisiana.html", "Price": "$144 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">821 Gravier Street</span>, <span class=\"locality\"><span property=\"v:locality\">New Orleans</span>, <span property=\"v:region\">LA</span> <span property=\"v:postal-code\">70112</span></span> </span></span></address>", "HotelID": "320080", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2e/59/2e599393b3b7a06f9bd00ab9139a3e1d6large.jpg"}}