{"Reviews": [{"Content": "You get what you pay for. I dont understand how and why people get upset when they pay such a low rate for a hotel and expect so much. My experience at the Garland Hotel was rather charming. Sure, its not in the best part of town, but even many other nicer hotels are only 1 block away. I was travellin on a budget and this hotel met all of my needs.The room was comfortable and clean, and although the TV was rather small the hotel staff was polite and made up for it. I would definitely suggest the Garland to other travelers looking to stay in San Francisco without breaking the bank.", "Date": "Aug 18, 2007", "ReviewID": "UR763481649", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Billyonski"}, {"Content": "Avoid staying in this Hotel       The room was okay, the hotel itself and the neighborhood a survival trip", "Date": "Oct 27, 2006", "ReviewID": "UR579364485", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "1"}, "Author": "Reini_74"}, {"Content": "avoid at all costs! The Photo of the Garland looked OK, and it was cheap, so we booked to stay for 5 nights from June 23rd.The 'foyer' was filthy, smelly and was full of flies. It was our first trip to the USA, it was 7.30 in the evening, we didn't know what to do. We thought that the room couldn't be that bad so we booked in.We were wrong. On our way to the room we noticed that many of the doors appeared to have been 'forced' and had had hasty repairs carried out.The door to our room was of a flimsy 'interior' type, not what you would expect in a hotel, e.g. fireproof. The room was cramped, dirty and smelly. My husband tried to open a window, this caused it to crack. The bath and sink were full of hair. There was one towel.We were terrified. There was no way we could stay there, we would have been frightened to leave our belongings in such a place. (I forgot to mention, there was also loud music blasting from a nearby room).We left our suitcases, took what we could carry, and found a decent hotel nearby. Be warned.", "Date": "Jul 10, 2005", "ReviewID": "UR347119974", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "josieof"}, {"Content": "Poor condition, bad neighborhood..however, close to UNION SQ and CHEAP. Probably my worst hotel experience ever...let me tell you how it went. Well, ivisited the website and it looked fancy and really nice but... when i arrived, it was old, all the stairs creaked and were uneven, the elevator had duct-taped doors (because it was shattered), paints chipped on all surfaces, bedroom windows have no screens (even on 5th and 6th stories up) -NOT SAFE! Nor do they close all the way or lock, tv has at most 3 channels that work. I was also given used toilet paper. The grossest thing was when i found hair on every towel (luckily i had my own in my trunk) and the blankets smelled like cigarettes. Not to mention the bad neighborhood although the HILTON is 2 blocks down as well as Union square. It kinda felt like those apartments from the movie THE PUNISHER. If you have children, be smart, pay a lil more and get a family friendly hotel with service. Also, there were no phones in the rooms. What if theres an emergency or fire?! Will the walls echo my yelling? Needless to say, i slept with my towel over the pillow and on top of my own beach blanket that i always keep in my trunk...cuz you'll just never know when youll need it.", "Date": "Apr 17, 2005", "ReviewID": "UR222413512", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d320147-r8447272-Garland_Hotel-San_Francisco_California.html", "HotelID": "320147", "Price": "$52"}}