{"Reviews": [{"Content": "Nice and clean hotel! We stayed at the Sunlite Hotel for one week in early Dec and we were thrilled with the hotel! Even though the hotel is about a 10 min walk from the JR station but it's only a few minutes walk from the Shinjuku Sanchome Metro station. We booked our room through the hotel website and was able to get an attractive rate. Even though the room was small but it was extremely clean and best of all, the staff at the hotel spoke very good English which is rare in Japan! There are some restaurants and convenience stores nearby so it was quite convenient! We will definitely stay there again in future!", "Date": "Dec 14, 2008", "ReviewID": "UR496724077", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "McJo"}, {"Content": "Great Value I stayed in this hotel in late october 2006. It is an above average business hotel with lots of budget minded tourists staying there. Nice clean room, on small side but average for Japan. Easy to find from subway. Staff is very helpful and answers e-mail. Looking forward to spending a few days at this place in 2009.", "Date": "Oct 29, 2008", "ReviewID": "UR413885832", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "SandManCalifornia"}, {"Content": "Just what you need. We've stayed here twice now and will be going back in a few weeks. At first glance it's a typical Tokyo business hotel. The rooms are on the small side but they are clean and comfortable. Very friendly and helpful staff, with some English spoken. There's a small restaurant in the hotel annex, the food's not brilliant but it is filling and cheap. However, there are literally hundreds of great eating places within a few minutes walk. There is no room service (how could there be at this price) but there are some vending machines on most floors. For all your late night emergency buys there is a Lawson convenience store 2 minutes walk away.By the way, although the hotel has a 2am curfew, only the front door is locked. As long as you let them know, there's no problem coming in after 2 by the side door.The hotel is in a very convenient location. Just 10 - 15 minutes walk from Shinjuku Station and only about 4 minutes from Shinjuku Sanchome subway station. A few minutes walk takes you into the heart of the shopping, noise and neon that everyone associates with this part of Tokyo. Just across the road is an interesting little shrine, Hanazono-jinja and a little bit further is Golden-Gai with its tiny bars and Kabukicho with its noisy entertainment and interesting night-life. Shinjuku Gyoen National Garden is also only 10 minutes away - a must see - especially in cherry blossom season.If you want the full, pampered hotel experience then this is not the place for you. Try one of the bigger hotels and be prepared to pay for it! However, for mere mortals who want a clean, comfortable, convenient and affordable base for exploring Tokyo, this hotel is one of the best.Highly recommended", "Date": "Jun 12, 2008", "ReviewID": "UR947473289", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "MickeyTheFixer"}, {"Content": "Inexpensive business hotel Booked single room in the Annex on rakuten for under 7000. Business hotel room with modular bathroom. Translucent window that cannot be opened in room. Fully individual climate control. Location is far from Shinjuku station, but 2 blocks from the underground walkway system. 2AM curfew. One of the best priced business hotel in the neighbourhood.", "Date": "Jun 9, 2008", "ReviewID": "UR592990545", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "bibimbob"}, {"Content": "Convenient to Shinjuku       Hotel Sunlite on Meiji-dori Street", "Date": "Apr 22, 2008", "ReviewID": "UR434629408", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "WisconsinVagabond"}, {"Content": "Small Rooms but well located Stayed 4 nights early March 2008, great location, about 15 minutes from Shinjuku station. Room we booked was a semi-double. It was what I expected from reading other reviews, however I was still a little surprised from the size. It's small, but adquate. We booked this hotel because of the price (cheap $AUS95.00 per night) and location. Great restaurants and shopping close by and the added advantage of being close to Shinjuku Station which is on the main JR Loop line. You also have the added advantage of having 4 subway lines close by giving great access to Tokyo's sites.", "Date": "Mar 24, 2008", "ReviewID": "UR538113237", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "MudgeeJo"}, {"Content": "Pleasantly surprised I booked the Hotel Sunlite Shinjuku in May 2007 for our Dec. trip - at the time they had a great online special for 11550 yen a night for a twin room (roughly $105/night). I expected a tiny room, being in Tokyo, but was really surprised to get a decent sized room in the hotel annex across the street. It was comfortable and no frills, bathroom was smaller (again, as expected in Japan). The main building has two computers with free internet access. Location is perfect - within 5-10 minutes walk of Shinjuku Station and close to all the craziness and shopping! Staff was very helpful, though a few basic phrases of Japanese would get you far as it seems like the hotel is more geared towards Japanese business travelers. Traveler tip: if you are taking the Shinkansen to points outside of Tokyo, I strongly recommend the takkyubin (luggage forwarding service). Shinkansen trains only have room for luggage that would fit in an airplane overhead compartment. For $25, we shipped two large, heavy suitcases from Tokyo to Kyoto and they got there before we did. Make sure to have your forwarding address written out in Japanese ahead of time as it will make the process smoother. This hotel's reception even called our next hotel for us to confirm the delivery!", "Date": "Jan 17, 2008", "ReviewID": "UR573555102", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "DriftwoodNYC"}, {"Content": "Neat and tidy budget hotel Hotel Sunlite (the Annex immediately across the road), certainly is small. And to add to that, it is clean, safe and in proximity of the Metro.It is a good budget hotel for the single (and female) traveller. I booked a Single room Type C, for three nights, directly with the hotel website (I believe you still receive a discount on your first night).You have easy access to the Tokyo Metro to visit main tourist areas like Asakusa (Edo period tourist market), Maranouchi (Imperial Palace and Gardens) and Ginza (flashy shopping and famous fish market). Not to mention, being in walking distance to the night-life and shopping in Shinjuku itself.Whilst you don't receive champagne on arrival or the offer of a porter, the hotel's reception desk is a friendly and accessible resource. This is helpful for the times when you need assistance with your Japanese, in addition to providing local maps and timetables.Also to note: after a day of travelling with heavy bags, I sustained a neck strain and used the in-house massage service. I managed to get someone almost immediately.This was an interesting experience as I lay on the bed of my room, with the masseuse sharing my limited space. She was extremely courteous and didn't speak a word of English. It certainly wasn't a day spa by any stretch, but it did the trick.I would definitely consider staying again, and recommend this hotel for the thriftier traveller, perhaps though, not necessarily the taller/bigger ones.", "Date": "Jan 11, 2008", "ReviewID": "UR331900827", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Ithacles"}, {"Content": "great value, great location       the tiny bars of the Ni-chome district, Shinjuku", "Date": "Mar 14, 2007", "ReviewID": "UR441574716", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "rachel612"}, {"Content": "Pleasant~       the tiny bars of the Ni-chome district, Shinjuku", "Date": "Jan 8, 2007", "ReviewID": "UR329873518", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "ashchiang"}, {"Content": "small rooms Very central-good location for exploring Tokyo. It is a budget hotel. The rooms are tiny-especially for a westerner but very clean. Breakfast is served accross the road-either 'western' or Japanese-good value.", "Date": "Oct 17, 2006", "ReviewID": "UR561013647", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "bomaolciarain"}, {"Content": "Great value for money! The Sunlite Shinjuku is in the heart of Tokyo's bustling entertainment district and a good 7 to 10 minutes walk from Shinjuku station (if your coming from Narita airport, Shinjuku station is on the direct JR Narita Express line). Alternatively, the hotel is only a 3 minutes walk from Shinjuku Sanchome underground station (if you manage to find the right exit...).When I booked the room for 6 nights (directly on their own website) I was lucky. They were offering all rooms at a discounted rate (during 2006) because the hotel had been open for 30 years. This meant I only ended up paying about 7200 yen per night for a single room.My room wasn't big, but this is Tokyo so I didn't expect a royal suite before I arrived. The shower isn't big at all, but again, I didn't expect something big. With this in mind, I wasn't disappointed at all. There was a fridge, water cooker, slippers, night gown, tooth brush, soap and towel in the room. So all in all well equiped.The cleanliness of the hotel and room was excellent. Housekeeping was excellent. Also, a big plus is the free internet access in the loby area. There are 2 pc's (with Japanese/English keyboards), but if you bring your own laptop, you can ask for a LAN cable so you can use your own pc.I once made use of the hotel's breakfast facilities (I bought a breakfast voucher the night before for 1050 yen). I wasn't impressed by the breakfast. There are three choices; an American style breakfast (sausage, egg, toast, coffee) or Japanese style breakfast (fried salmon, rice). The quality was below average and the quantity quite meager. So have breakfast in Isetan or the nearby Starbucks. It might not be very 'cultural' but offers better value for money.The hotel also offers a washing machine which you can use free of charge. You can buy washing powder in a nearby convenience store (open 24 hours a day) for only 120 yen.The reception staff were very friendly and helpful.I have to add one down point though. The doors of the hotel close from 02.00 to 05.30 in the morning, so if you're going out keep this in mind.I would recommend this hotel!", "Date": "Jul 28, 2006", "ReviewID": "UR458554931", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "traveller1972"}, {"Content": "HIghly Recommend it I paid about $70 a day and I did enjoy my stay. If you are not claustrophobic (I had to take a shower with the door open, and I am 5'5''), this is a great place for its location and price. The staff was very friendly, and the hotel has free internet access.", "Date": "Nov 20, 2005", "ReviewID": "UR580462107", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice Hotel We stayed at Sunlite for 4 days. The stay was great, it is about 15min walk from the Train station. It is near all most shopping centre in Shinjuku. The hotel is neat but the room is small and not internet in the rooms. There are two computer with internet at the lobby. The staffs are nice and can understand simple English. Overalls, we have a good time. Thank you.", "Date": "Nov 16, 2005", "ReviewID": "UR478908886", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "SunLite Hotel Shinjuku : Yala's guide to... Stayed there Aug'05 with family in triple room for 7 days avg@ JPY 17,820 /night in main bldg. Hotel Main Bldg: Appearance = average. Overall, it's a very clean and efficient hotel. Rooms are OK sized (I've seen much smaller in Japan). Bathrooms are small (like all of Japan). Windows are good-sized (1陆m x 1m) and can open. Room carpet colour could have been more cheerful.Facilities = good. Main Bldg: Lobby is roomy (for Japan) with double height ceiling and presentably business-like. Lounge is small and cute with 2 PCs giving free high-speed internet access (yes, I said free). Annex Bldg: Lobby is similar if a little smaller with standard height ceiling. Restaurant Floret (breakfast is served here) is medium-sized and quite nice in appearance. I am told the rooms in Annex bldg are smaller than main bldg.Staff = good+. Most speak good english, are very helpful and courteous.Location = average+: Hotel is north-east of Shinjuku JR station appx 15 mins walk. Shinjuku is an excellent location but the walk to the hotel can be tiring in the August sun. If you took the Airport Limousine Bus (JPY 3,000 to Shinjuku BusStop23), I'd take a taxi (JPY 750) if you have big luggage. Normally, you'd take Shinjuku JR station east-exit, go straight onto pedestrian walkway; at road, turn left and you'll be on the main road with the main Isetan dept store on your right; walk to Isetan and follow it round to the left; the hotel is now straight in front of you appx 7 mins walk. When taking a taxi, it helps to mention Hanazono Jinja, the shrine in front of SunLite.Useful Tips :- Pre-buy some breakfast vouchers for JPY 1,050 as it costs more on the day. Breakfast choices are American [fried egg, sausage, salad, carb, big toast  a hot beverage], Japanese 1 [grilled fish, soup, rice, pickle] or Japanese 2 [grilled fish, rice porridge, soup, pickle]. - If you get bored of this breakfast, Cafe Veloce is nearby (cross the road, turn left) with coffee and danish.- Nearly all restaurants will offer a lunch promotion which is excellent value. Nearby restaurant MiSenSo (exit hotel, turn left appx 20 steps) has korean-style cook-it-yourself BBQ meats with lunch buffet at JPY 1,000 (yes, all you can eat).- Want to try Unagi (eel)? Go to nearly and inexpensive Meshiya-Don (cross the road, turn right, walk appx 100m) where you use a vending-machine to buy a meal-voucher which you hand to the chef [the vend-machine is the cashier].- SunLite hotel's restaurant Floret a'la carte menu is medium priced. But for dinners, you can buy a dinner-voucher from reception which gives much better value for money.- Get to know the big department stores like Takashimaya and especially Isetan (good for short-cuts through the store). Most dept stores have very reasonably priced restaurants and/or food court. I recommend Takashimaya's 13th floor Studio Fresco restaurant (italian).Other General Tips :- Japan isn't as expensive as it was but you have to look a bit. Especially with restaurants, you sometimes just have to walk in and have a look. We ate in some great restaurants where no-one spoke much english, where there wasn't even a restaurant-name in english, and we did things by pointing at the plastic foods in the window or the photo-menus. You have to be brave, then the fun starts.- Instead of a few luggage bags, consider just one large luggage bag for Japan as rooms can be small and the luggage takes up space.- Wherever you go, pick up any free maps/ brochures as these are really useful. It's quite easy to get lost... especially in Shinjuku station.", "Date": "Aug 18, 2005", "ReviewID": "UR208631197", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "Yala"}, {"Content": "Start Your Trip at the Sunlite Hotel Sunlite Shinjuku was a quick start to Japan for my wife  I. We found our way in the rain to the hotel the evening we arrived in Japan, with help of maps and the recognizable hotel sign. The room we stayed in was in the main building not the annex, but was probably the smallest of our seven hotels while visiting the country. We kept running into each other while getting ready in the morning. There was no place to hang clothes (or wet raincoats), but the hotel served it's purpose - function and location. The hotel is on the wild shinjuku side of the tracks, and has plenty of nighttime activities nearby. The hotel bill ended up at 34,413 Yen for three nights in a double with no meals. Internet access was free in the lobby. Walking time to the main train station was no less than 5 minutes.", "Date": "May 31, 2005", "ReviewID": "UR670551922", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "pablitoway"}, {"Content": "Tr猫s bon rapport qualit茅 prix   showReview(14854062, 'full');", "Date": "Apr 7, 2008", "ReviewID": "UR962860523", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Yasaka"}, {"Content": "Volver铆a a este hotel   showReview(10081803, 'full');", "Date": "Oct 15, 2007", "ReviewID": "UR740858329", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "canoa"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066457-d320612-r22718882-Sunlite_Hotel-Shinjuku_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "320612", "Price": "$105"}}