{"Reviews": [{"Content": "Good Price/Quality Ratio ! The Omori Tokyu Inn is a very good value ! It's a 2-stars hotel by Japanese official standards, but i would give it a 3-stars rating.Hotel is situated just upside the Omori Japan Railways Station: very easy to find, and very convenient for moving around with the JR network !!!The Omori neighborhood is very good: lots of good restaurants, as well as shops and convenience stores, scattered around the JR station. Omori is a residential area, so it's very interesting to see how the Japanese people live on a day to day basis. You will never understand the Japanese way of life if you stay in Shinjuku, where most tourists hotels are situated.Hotel's staff friendly and helpful.The rooms are not very large, but, for Tokyo, they are of a good size.Hotel's cleanliness VERY good, as you will see by yourself, Japan is a super-clean country.We had breakfast at an independent caf茅, which is situated inside the hotel, on basement floor: very good value and very good quality !If you are looking for a luxury hotel in the center of Tokyo, then the Omori Tokyu Inn is NOT for you.If you are looking for a good 3-stars at a good price, with nice staff, good room and good location, then the Omori Tokyu Inn will be perfect !", "Date": "Jan 10, 2008", "ReviewID": "UR592372733", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Tiquinho"}, {"Content": "sehr gute Lage   showReview(11314185, 'full');", "Date": "Oct 26, 2007", "ReviewID": "UR368645318", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066454-d325632-r12491301-Omori_Tokyu_Inn-Ota_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "325632", "Price": "$197"}}