{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "East Alton, Illinois", "Title": "“Great Hotel!”", "Author": "buzybee150", "ReviewID": "UR126547882", "Content": "Rooms are always clean and the beds aren't too bad either.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Corydon, Indiana", "Title": "“Not a bad location and place”", "Author": "Michael M", "ReviewID": "UR124844630", "Content": "When we first got there, there was no parking. The hotel clerk was very nice though. The hotel is located slightly outside of the city; however, pretty easy to get downtown without using the toll roads. The hotel was quiet and we had no problems; the carpet and other fixtures were a bit more used than most Country Inn and Suites hotels.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Lawrenceville, Georgia", "Title": "“Awful experience! Terrible service! Avoid this property!”", "Author": "30043ron", "ReviewID": "UR122322058", "Content": "Because of this property's good Trip Advisor reviews, we booked a room through Hotels.com for December 27-30. Day one was uneventful, although I agree with a previous reviewer that this property could use an upgrade. Nothing special. Surprising, in fact, due to the good Trip Advisor reviews. At about 11:30 p.m. the second night, we were abruptly awakened by a screaming fire alarm. Somehow the ceiling fire sprinkler went off in a guest room two doors down from our room and across the hall. Water came streaming out of the room and before long, two fire department trucks arrived. By the time the water was cut off, it had streamed down the hall to our room's door. We hurriedly packed the van, sloshed down the hall to check out, and met \"George\" behind the counter. I asked for a refund for the two remaining nights and for check-out documentation. He asked if would like to be moved to a room on the second floor. When I declined, he replied that I would have to contact Hotels.com for a refund, and further, they didn't give check out documentation in this case. After I got home, I called Hotel's.com and have received no satisfactory service from them or Country Inn and Suites Champaign-North. I called Hotels.com and when they failed to work out a compromise, I called \"Penny\" the manager of the property. So I ask you? You are aakened by a fire alarm, two fire trucks, and ambulance, workmen trying to stop water from flooding your room, the smell stinks and I should not be able to check out early for a refund? (By the way, my reservation was not an advance, no changes reservation!) Some service! For those interested, Wingate, right next door, was so much nicer in facilities and staff for the same price. Unfortunately, unless I can win an appeal with my Discover Card, I guess consumer satisfaction is not the paradigm with either Country Inns and Suites or Hotels.com", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Wonderful stay & service”", "Author": "Dick K", "ReviewID": "UR122298396", "Content": "We wish to express our gratitude to Bryan, the manager over Christmas weekend, for the outstanding service we received. The hotel was quiet, clean, and the entire staff was very responsive. Food (breakfast) was very good and the serving staff kept things clean and inviting.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "springfield", "Title": "“Excellent experience in Champaign”", "Author": "lizzybaby230", "ReviewID": "UR120940671", "Content": "We recently visited Champaign, neither of us having been there before. We were very pleased when we were offered to upgrade to a room with a jacuzzi for no extra charge. The staff was friendly and extremely helpful, offering directions to local restaurants etc. The rooms were spacious and comfortable. We will definitely return!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monee, Illinois", "Title": "“Nive value”", "Author": "David56Chicago", "ReviewID": "UR120761811", "Content": "This is one of the better Country Inns we have stayed at. Room was clean and staff was attentive.The service in the breakfast restaurant was 1st class. We spent 2 nights and were impressed with all of the staff. The night clerk even brought the cookies out for us at midnight when we came in. We will stay there again!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pleasant Garden, North Carolina", "Title": "“Excellent Stay”", "Author": "rickey-n-gina", "ReviewID": "UR120474812", "Content": "My wife and I were in town for three days and very much enjoyed our stay. The lobby, halls and room were all VERY CLEAN, and did not have any \"cleaning\" oder. Our room was very nice, like a small studio apartment. The hall noise is the only complaint we would have, as on the weekend you could hear it in the front part of the room. The noise was not noticeable in our \"bedroom\" area. There was a small fridge, small microwave, couch, chair, office chair and table with tv in the front living area. There was a small open sink and the bathroom in the middle area/hall. The bedroom area was seperated by a french style door and provide a very nice home style feeling. We were very happy with the stay and would stay again.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charleston, IL", "Title": "“Clean, nice rooms; excellent customer service”", "Author": "jtoothman", "ReviewID": "UR120459319", "Content": "I stayed at this hotel for one night and the room and service were exceptional. The beds were very comfortable.", "Date": "November 11, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“HORRIBLE SERVICE!!!!”", "Author": "SFoxTraveler", "ReviewID": "UR119681557", "Content": "Hands down some of the worst service I have experienced from a hotel and I am a meeting planner / hotel buyer for a large corporation who has a fair look at the industry and hotels in this area. The General Manager wont respond to calls and Brian at the first desk was rude. Stay away from this property.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Jackson, TN", "Title": "“2nd VISIT AND WILL COME BACK AGAIN”", "Author": "Retired-fun-travelin", "ReviewID": "UR119353216", "Content": "We stayed at this Country Inn and Suites 2 years ago on our way North and were very pleased so returned for another stay a few days ago. Again this hotel lived up to EVERYTHING we expect. Easy to get to, friendly helpful staff, neat clean inviting, comfortable beds...AND THEY WERE SOOO COMFORTABLE. What we also enjoy is that they have a really nice hot breakfast buffet with many selections. Our room had a microwave, refrigerator, coffee pot, large desk with comfortable desk chair and another living room type chair. We could not ask for anything more. It is also located near many stores and restaurants.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“What you would expect...”", "Author": "Time4Scuba", "ReviewID": "UR118935125", "Content": "The title says it all. If you are familiar with the Country Inn & Suites properties you will find that the look and feel of this hotel is a cookie cutter of all the rest. I personally like the familiarity of the Country Inn & Suites, I don't worry about what I'm going to walk into on arrival. We had a late check in and apparently they had some computer problems so the desk clerk wasn't able to check to see if they had an upgrade for us, but it really wasn't a big deal as we just needed a place to sleep, shower & eat as we passed through this area. Breakfast area was HUGE with a big screen TV that matched the area. If you have a large group traveling this is the place to stay just for the huge breakfast area. I've been at some C.I. & S that there were only a few tables and I had to take my breakfast back to my room- not the case here. My only complaint would be that housekeeping knocked on our door at 9AM (not happy since we didn't check in until 1AM) - we didn't have the DO NOT DISTURB sign on the door, but we had a one night stay and check out wasn't until noon, why the rush? Lesson learned at this hotel - be sure to use the door signs! I would stay here again.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hudson, Iowa", "Title": "“Consistently clean and excellent upgrades”", "Author": "iaillini", "ReviewID": "UR118912800", "Content": "I have been coming to Champaign to attend University of Illinois Homecoming games for 34 years now, and since switching to this hotel in the past 10 years, have never been disappointed. Every service person and front desk staff member always offers a friendly smile and a \"hello\" when you see them. Their rooms are always clean and well maintained, which is something to be said in a University town where hotel rooms are typically beat up and old before their time. The pool area is also kept spotlessly clean, as is their dining area. One of the best additions has to be the use of real silverware, coffee mugs and dinner plates for their breakfast. There is just something about eating your cereal out of a real bowl instead of a cheap paper one that is satisfying! We will continue to return to the Country Inn and Suites for our Homecoming stays.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Best pool & breakfast buffet ever!”", "Author": "FarmRescueVolunteer", "ReviewID": "UR118251207", "Content": "We've stayed in several different hotels in Champaign, IL, and will now make this Country Inn our first choice. If you have children or if you yourself like to swim, you'll love this pool. The water was warm and comfortable. In fact, so many people were enjoying the pool during our Friday night stay that they ran out of pool towels. The staff was quite accommodating, however, and gave us extra regular bath towels to use instead. Some reviews had mentioned the noisy ac. For us it was just right - enough noise to give us \"white noise\" in order to sleep and an ac which stayed on all night instead of going on and off. Speaking of noise, we were right across from the busy pool, but once we closed our door, we never heard a sound. Must have great noise-reduction insulation in the walls. As if all these thing were not great enough, breakfast this morning impressed me the most. Rarely does one get to eat breakfast at a hotel on real, solid dishes with real, heavy silverware. What a treat! By the way, they also have a later checkout time than most hotels: officially 12 noon, but 1pm was fine we were told. My only \"complaint\" was seeing cobwebs where the ceiling and walls met. I mentioned it to the mgr on duty this morning and expect that we won't see that again during our next stay! Can't wait to return.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "3", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Manteno, Illinois", "Title": "“Quite Rude Management”", "Author": "libertybear2", "ReviewID": "UR118034586", "Content": "As a chain I really like Country Inn and Suites. However, this particular inn is run by tyrants. The room was clean, that is about it. The water pressure was bad, the a/c was powered by a blower that sounded like it was powered by a diesel. Don't question anything, the management staff will roll thier eyes at you and dismiss you. I travel for a living and this ranks right up there with the most rude place I have stayed. If trip advisor would allow a zero star, this particular Country Inn would rate it. If you want to stay in a nice Country Inn go to Manteno, IL.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Iowa", "Title": "“Great place to stay and we would definitely stay again.”", "Author": "DBIOWA", "ReviewID": "UR117181143", "Content": "My husband and & stayed at this hotel on Aug 12, 2011 and were impressed. We have stayed at Country Inn & Suites previously and have always been completely satisfied, but this had even more features. We had a very clean room, comfortable bed, and the room was nicely furnished. The staff was very professional, friendly, and helpful. The breakfast had a great variety of food, tasted good, and the lunch room was kept very clean. The nice surprise was eating from glass plates, cups, glasses and silverware. Also, we appreciate being able to apply some of our points earned from previous stays to lower the price of the room. With most hotel chains, by the time you have built up enough points, they expire and there are no benefits. We highly recommend this hotel.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Green Bay, Wisconsin", "Title": "“Nice Hotel”", "Author": "Familyof597", "ReviewID": "UR117077118", "Content": "We enjoyed our stay. This was our third stay at this location. We had found a great rate on their site. The room was clean and the beds very comfortable. The kids really enjoyed the warm pool. The breakfast buffet was great with plenty of hot and fresh food. The breakfast attendants were very friendly. The only downside of the visit was the air conditioning unit in our room was very loud.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“AWFUL service with attitude”", "Author": "freelibran", "ReviewID": "UR115671679", "Content": "NEVER again. Was given the wrong room and then relocated to a room with a broken thermostat. Only one person on staff who was so disrespectful and said she couldn't give us the right room \"because now we have to clean the one you're in.\" Excuse me? As we waited hours to resolve this, we were forced to sit in a room that was 85 degrees with a TV that was probably from 1970. Oh yes - the pool and spa had probably 100 children playing in it with no supervision. Don't waste your money!", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lakewood, Washington", "Title": "“A great place to stay. Get a whirlpool if you can!”", "Author": "Jenwee", "ReviewID": "UR115266747", "Content": "I have to disagree with the previous reviewer. We had excellent service at this hotel. We stayed here for one night on our trip across country. I was promptly greeted by a friendly person at check-in. She even helped change our rooms to one on the first floor since we had a lot of luggage to haul. Our room was very clean and spacious. We did splurge for the king size bed with a whirlpool. There is a hot tub in the hotel so you dont really need it, but it sure is nice to watch tv from your bathtub :) Breakfast was good with some hot items and standard items. This morning they had biscuits, gravy, eggs and chicken patties along with the waffle makers. So I made myself some chicken and waffles for breakfast (and that my friends is not something you see at a standard breakfast in a hotel). ;) The hotel does offer a homecoming snack during the week which we missed out on since we came on a weekend. But all in all I received the service and standards that I know I can came to expect from this chain of hotels. A great place to stay, near plenty of restaurants, a target and a grocery store.", "Date": "July 11, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Rude service from Brian”", "Author": "megam0m", "ReviewID": "UR110623754", "Content": "I have traveled in many countries and never received such a rude reception as I did from Brian at the check-in desk. He was incredibly rude, continually interrupted and talked over me and wouldn't help me with what was a very simple problem. With so many hotels to choose from Champaign, you would think that the people who work would try to be a little bit helpful, or at least not be exceptionally rude!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“A pleasant stay; excellent location”", "Author": "travelnews4U", "ReviewID": "UR102110019", "Content": "The Country Inn and Suites Hotels provide comfortable no-frills accommodations for travelers on a budget. My one night stay was pleasant. I had a king whirlpool room. Though the decor was dated (but definitely country) it was clean and comfortable. The whirlpool jets were weak, but the tub is deep and extra towels were provided. My room also had a small frig and microwave. Wireless internet worked great! Breakfast was just OK as they had run out of cereals and the waffle maker was not working. I had the basic toast, eggs, and fruit selections. Coffee was decent. The location of this hotel is convenient to I-74, shopping, and restaurants. Staff are friendly and helpful.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Great place! FANTASTIC breakfast & great service at breakfast.”", "Author": "XJ650Rocks!", "ReviewID": "UR96762597", "Content": "Stayed one Saturday night in order to see a play at the college. Checked in with Penny who was pleasant. Rooms clean, neat. Nice to have microwave and fridge. Cute little hotel. I was absolutely BLOWN AWAY with the breakfast on Sunday morning. Not only were there items to choose from other then carbs, carbs and more carbs.....everything was spotless, neatly arranged & CLEAN. Love that some hotels offer breakfast, but always disappointed when the menu doesn't include any protein. Candace, the young woman in charge of the breakfast area, was amazing. Friendly, quick, kept everything well stocked and very clean. That was so nice. Thanks again! Wouldn't hesitate to stay again.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tennessee", "Title": "“Very good!”", "Author": "wattsbarbob", "ReviewID": "UR86781904", "Content": "We were very pleased with the helpful staff. The evening (small) dinner of hamburgers and salad was free and good. The free breakfast was really wonderful, with hot eggs and sausage, waffles, sweet rolls, coffee, etc.. A very good place to stay.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico, USA", "Title": "“Quiet, peaceful, comfortable.”", "Author": "mpsena", "ReviewID": "UR74473561", "Content": "I was in town to look at the university. The hotel's location was great -- very close to a really good pizza place -- the room was clean and very comfortable, and the staff was very cordial. I would stay here again in the future.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Neenah, Wisconsin", "Title": "“Quiet and comfortable”", "Author": "MMJ01", "ReviewID": "UR70547172", "Content": "Enjoyed a one bedroom suite - very comfortable and quiet. Breakfast selection was pretty good. Staff was helpful and friendly.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Van Nuys, CA", "Title": "“The Country Inn in Champaign is an outstanding hotel.”", "Author": "dianeballowe", "ReviewID": "UR68857232", "Content": "I thoroughly enjoyed my stay at the Country Inn. The staff was very friendly and helpful. The facilities were clean and inviting. I particularly appreciated Dawn in the breakfast room, who kept the food well-stocked and the room spotless. I will definitely stay there again.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mukwonago, WI", "Title": "“GREAT PLACE TO STAY”", "Author": "Mihly", "ReviewID": "UR66076873", "Content": "From check in to check out everything was great. Staff \"Kacie\" went out of her way to keep everyone on the baseball team comfortable. We had a team dinner and the dining facility was perfect and roomy along with a nice area with a sofa and chairs to watch tv as a group - just like a great room in your home. We brought grandma with us and she even commented on how comfortable the pull out sofa bed was. Rooms were clean and well layed out. Baseball team had fun in the pool area. I would recommend this hotel for anyone staying in North Champaign. Breakfast that is served daily was awesome. Very good food and something for everyone on the breakfast bar. The only recommendation would be for tournaments that they have maps for the teams to get to all the diamonds since they are spread out for tournaments. All staff was very helpful at all times of the day and night. GREAT PLACE TO STAY!!! Cindy M, Mukwonago, WI", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glenview, Illinois", "Title": "“Friendly, service-oriented. Will make this a regular stop in C-U.”", "Author": "Sleepyhead52", "ReviewID": "UR62186095", "Content": "Having a son at the U of I we get down to Champaign fairly often. This place has made us feel like regulars, from Kacee at the front desk to Steve the building guy. Biggest problem is the LOUD AC in the locked closet, and the alarm that went off in the closet at 7 am. The other gripe is the TV reception--the signal lost color for most of our recent stay (plus, I'm beginning to expect to have LCD TV's in my room when I travel, which this hotel does not). Our service experience, especially with Kacee, trumps these problems, however, and we look forward to future visits.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "cullom,il", "Title": "“Poor Hotel, No Maintance”", "Author": "v213809", "ReviewID": "UR59468556", "Content": "nothing good about this hotel .worst country inn and suites i have ever stayed at .first room smells bad like smoke,computer chair is broken,go to the bath room in a strobe light ,bathroom light keeps flashing off and on , then we go down to the pool and the hottub is cold and only 1 or 2 jets work and the swimmong pool is colder", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Franklin, Wisconsin", "Title": "“Nice quality hotel - would stay here again”", "Author": "epsharon", "ReviewID": "UR57471743", "Content": "We enjoyed out stay during the last weekend of February. It was a good location just off of I-74 but far enough away that you couldn't hear the traffic. Check-in was quick and efficient and we helped ourself to a cookie from the plate in the lobby. Our room was quite big and the beds were comfortable. Even the pillows were nice quality. The room was clean and the shower head had good pressure. These are the things that will make us come back. The indoor pool, fitness center and included breakfast are nice pluses. The only things we were disappointed in was the fact that the hot tub was out of order the night we stayed, there were lots of kids running through the halls at 10pm and then again at 11pm, there was no one manning the front desk when we checked out at 10:30am so we had to wait aournd for 5 minutes and our main complaint: the breakfast didn't have fried or scrambled eggs, bacon, sausage or hash browns. I would think most people would expect an included hot breakfast to have these things. At the very least you should have a type of egg available (sorry, hard boiled doesn't count) and either bacon, sausage or a potato. The morning we ate, there were pancakes and waffles, why both as they are essentially the same thing and the pancake spot in the warmer could have had eggs instead. All in all, this is a very good hotel for Champaign and one we would stay in again. If it weren't for the few things we were disappointed in, it would have received an \"Excellent\" rating.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas, NV", "Title": "“When can I come back!!!”", "Author": "Agiant", "ReviewID": "UR50769082", "Content": "I was given the pleasure of visiting this wonderful place and stayed at the BEST hotel! I am a flight attendant and was selected to work on a flight that took us to Champaign where we had to spend the night and leave the next afternoon. When we checked in the thing that most impressed me initially was one of two people that were at the front desk, checking in the flight crew. When one agent (Lisa Gengelbach) began the check-in process, the other (Bryan Hardin) immediately jumped in to get us all checked in. He asked for my last name and immediately recognized that I had a reservation. That has never happened to me in this circumstance and it was so nice to know that the staff expected us and was prepared. Secondly, the entire crew was exhausted and wanted to rest before venturing out for dinner. The hotel dining room was primarily for breakfast, so they suggested a variety of restaurants in the area. Lisa offered to shuttle us to wherever we wanted to go AND pick us up when we were finished with dinner. I'm sure the look on our faces was as if she was speaking a foreign language because every other hotel where we have stayed only offers shuttle service to the airport. We were so impressed with her kindness, eagerness and her willingness to basically chauffeur us to the location of our choice. Ultimately, we had alternative transportation, but we were so grateful for the suggestions from her and Bryan and the fact that she was so considerate. Lastly, the rooms were the perfect accommodation. The bed was so comfortable and extra pillows and blankets were tucked into the closet, so you don't have to call and wait. If I had any neighbors, I didn't know they were there. This visit was for business, but I will absolutely stay at this hotel again. As, I didn't get to see enough of Champaign during my short stay.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Munster, IN", "Title": "“best hotel out of 5 trips to area!”", "Author": "anyaMunster", "ReviewID": "UR48153864", "Content": "Recently returned from a week stay, where I found this hotel to be very charming. The staff was very friendly and accommodating. Rooms were spacious and clean. To sum it up I have listed the pros and cons. Pros: very clean, nice decor with a lounge and fireplace complete with large flat-screen on the wall. Besides the plate of free cookies, perhaps the best feature was how quiet it was during my stay. No running down the halls, slamming doors and talking I found to be bothersome at other hotels closer to the university. Free WI-FI in the rooms. Feather pillows (nice touch). Cons: TV is a bit dated in the room and there is not a large variety of channels. Closet was a bit small (but I made do). The small refrigerator and microwave sat on the floor. Overall, I really enjoyed my stay. I was looking for a quiet relaxing hotel far enough away from the \"college scene\" to get a good night sleep and I found it here. If I travel to the area again, I will definitely be returning. By the way, the hotel is less than 10 min to the UoI.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Highland Park, Illinois", "Title": "“Diligent Service, Delicious Food, Dirty Hair”", "Author": "Hpmicks", "ReviewID": "UR47549439", "Content": "My 17 year old son and I recently stay at the Country Inn and Suites in Champaign on a college visit to the University of Illinois. The hotel is fairly convenient to campus and the admissions office was easy to find. We arrived around midnight and were happy to find attentive staff and fresh cookies in the cookie jar. Check in was a breeze, there was plenty of parking for the car and the room was easy to find. The lights, TV, and heat/air-conditioning all worked and the beds were super comfortable. Our only problem was that housekeeping had failed to replace the shampoo that my son was depending on for his morning shower. The complimentary breakfast was excellent and included eggs, sausage, waffles and the usual pastries, bagels and cereal.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Love everthing about this hotel, but...”", "Author": "wisconsingravylover", "ReviewID": "UR47112180", "Content": "My husband and I have enjoyed our past experiences at this hotel. Staff is courteous and helpful, rooms, halls, etc. are very clean and inviting, pool area is well kept, beda and pillows are among the most comfortable that we have experienced anywhere and we have found the free breakfast abounds with choices and was very good. However, we just returned from another stay, and have found some disappointing changes in the breakfast. Several items we had enjoyed in the past were missing and the gravy for the biscuits no longer has any pork sausage in it. It is now strictly a \"pepper gravy\"--very gooey and bland to say the least! Please return to the original menu which helped to make yours a truly outstanding free breakfast.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great, friendly Champaign hotel.”", "Author": "ferf1223", "ReviewID": "UR47064777", "Content": "We have family in Champaign so visit once or twice a year and have had a chance to stay at a few hotels in the area. For this trip, we saw that Country Inn had a special offer of 30% off for 3 nights or more. This put the cost of a one bedroom suite at less than a standard room at the neighboring hotel we tried (and liked) last trip - so we thought this was a great chance to try Country Inn. The hotel is well located for travellers as it is quite near to a variety of dining and shopping options and allows easy access to any number of destinations within Champaign - though having grown up there, I do know my way around so may be a bit biased. Check in was quick and easy and the front desk clerk very friendly. We were allocated a one bedroom suite on the ground/first floor right by the elevator. The room was very nice, having a refrigerator was important to us and having a microwave was an added bonus (as far as I know these are only availble in the suites, but have read they can be requested for the standard rooms). The bed was extremely comfortable as was the bedding. The toiletries provided were good quality too. We did use the pool and found it to be generally empty during the day (weekend evenings it was crowded with lots of kids, though). It was very nice overall. Nice buffet breakfast and nice dining room. Very large widescreen television in the breakfast room/lounge with a nice comfy sofa in front of it - we saw people watching various sporting events, etc. there in the evenings. NIce touch. We did have trouble with the free wireless connection - very slow and dropped out a lot, but when I called the front desk to ask about it they offered to give us a cable to plug directly into the connection - this worked perfectly for us and we were very pleased and having a wired rather than wireless connection was not an issue for us, though I suppose that anyone who wanted to use their laptop in the bedroom might. On the 2nd floor there is a coin operated washer and a dryer for guests to use - this was one thing that our last hotel did not have - and a big bonus as we were travelling on from Champaign for a further 10 nights - so really nice to be able to do a load of laundry. The front desk clerk didn't have enough quarters to give me change for the machines, so be sure to have enough with you if this is the case. I got around it by buying a ridiculous number of packs of Big Red gum from the vending machines and getting quarters in change. :) The business center is very handy, though as another reviewer indicated you do have to go to the desk to get a key for the room. If you are a light sleeper or go to bed quite early as we did as we were quite jetlagged, I would recommend requesting a room that is not by the elevators and not between the elevators and the pool. Two of the nights we were there there were a LOT of kids staying in the hotel for various sporting events and they made quite a lot of noise running and yelling in the hallway on the way to or from the pool and the elevator - I mean a LOT. As we had a suite and the bedroom was at the back of the room, we were able to get away from the noise and get to sleep, but I would think that in a standard room without the option of closing the bedroom door it could be quite difficult. We never heard any noise from the rooms on either side of us at all -just from outside the door so I think we were unlucky in where we were placed. All of the staff we encountered were very friendly and helpful - I would say moreso than any other hotel we have ever stayed at in Champaign. We will absolutely stay here again.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Houston, TX", "Title": "“service is lacking”", "Author": "wizofwoz", "ReviewID": "UR45514658", "Content": "The room was very clean and beautifully decorated, beds were very comfortable, room was also very soundproof (we were located right next to a busy pool and never heard anything) and price was fair. BUT the front desk personnel were basically non-existent. When we checked in, there was no one there and no bell to ring. We waited a short time and someone showed up. A short time later, I went to the front desk and again no one was there. I waited several minutes, then went looking around for someone, ANYONE who could help me. I finally yelled \"HELLO!\" towards a open back door and the front desk lady apparently was right in the next room and I startled her. I don't expect the front desk people to just stand there waiting for a customer to show up but if they are in a back room, there needs to be a tv camera to alert them they have a customer or at the very least a bell to ring. A guest shouldn't have to stand there waiting for someone to happen upon them. Then the other gripe I have is their business center. Every hotel I've been to uses the room key to access a business center but the Country Inn and Suites chooses to make this difficult. You have to go to the front desk to get a special key and you must then return the key. This normally would not be such a big problem but then I refer back to the problem of no front desk people....you can't get a key or return a key if nobody is there. And the business center was FREEZING! The one lady who was in there trying to get some work done was wrapped in a blanket. I was just in there to print out boarding passes so just jogged in place to keep warm. But I will clarify that when the front desk people DID show up, they were very pleasant and friendly. One recommendation if you visit Champaign, print out or bring a very good map. I unfortunately booked the Country Inn and Suites thinking it was an airport hotel. Luckily I had a map because there are no signs to the airport and from the hotel it was a slow, stop and go ride and even with the map, I would doubt myself....you drive through the downtown and then find yourself on a dark road that looks like you're in the middle of nowhere and then all of a sudden you see a lighted airport sign....and that's it, you can't see the airport, just the sign. Maybe it's better in the daylight.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "TN", "Title": "“Great hotel and location”", "Author": "Retired-having-fun", "ReviewID": "UR39362258", "Content": "We just returned from our trip North and enjoyed 1 night at this Country Inn & Suites, as we were passing through the area. Easy to find, near the highway but out of the highway noise. Neat clean hotel with large room, VERY comfortable beds, and nice buffet breakfast. Many restaurants right near by. Yes, we would return if ever in the area again. We always try to stay in a Comfort Inn & Suites if there is one in the area and have never been disappointed.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "IL", "Title": "“We had An Excellent Stay--Only a Couple areas Could use Slight Improvement”", "Author": "kotzg", "ReviewID": "UR36259074", "Content": "Excellent things about our stay: Room was great, noise was minimal to non-existent, our kids had a great time using the wonderful rocking chairs on the front \"porch\" outside the inn, we all enjoyed the pool, and the the generous, well-stocked, healthy and FREE buffet breakfast was excellent. The front desk and buffet staff were all very courteous, attentive, and helpful. Hotel pool and whirlpool were both great and very clean. Small areas for improvement: 1. Breakfast buffet: Could use a second 4-slice toaster and a second waffle iron, as it slowed our breakfast having to wait in line or watch for these items to free up (each guest toasts their own toast and also pours the available pitcher of pre-prepared waffle batter into the waffle iron to make their own waffles). The lobby and the \"front porch\" were both charming, and they welcome visitors to \"sit for a spell\"--very nice touches. 2. Both men's and women's first-floor bathrooms (near the pool), in the summer, were literally about 50 degrees or colder. My husband inquired at the front desk about the extreme chill, and hotel staff said there was no way to control the AC in there, it was all part of the AC for the entire hotel. A shame, really, because our small children couldn't even go in there and us it, it was so cold, and I got a bad chill changing in there with a swimsuit on you can imagine how cold that was.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Take a hike”", "Author": "root9900", "ReviewID": "UR32238856", "Content": "Booked my room with hotwire and ... was thrown that in the face right at the front desk. --Hotwire customers get the worst rooms. And the fact that my family has some basic special needs (we have a one year old)... they don't really care. I mean com ON... All I need is a room with one bed away from the elevator and the vending machine... For the record: Hotwire and priceline let hotels pocket my money weeks, sometimes months in advance. Those reservations are also cancelation-proof, so SHUT UP, mister Hotel Manager and the very rude Ms. Front-Desk-Watchdog. I deserve a little respect for choosing to spend my money with you. I won't stay here again and would discourage anyone from booking a three-star deal for a \"hotel in Champaign.\" Shame on the Coutry Inns and Suites chain, too. I always thought of them as hospitable and nice.", "Date": "June 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Central Illinois", "Title": "“Of all the hotels in Champaign, I choose Country Inn and Suites”", "Author": "Illinois09", "ReviewID": "UR27670591", "Content": "As a business traveler, I am in Champaign frequently. I have stayed at other nice hotels but I always come back to this one. The entire staff is incredible! They will do their very best to make sure everything is just right. The rooms are very clean. Much of the hotel has undergone updates. The business center offers internet access as well as a printer. For my money, I think this hotel is the best!", "Date": "April 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "chicago", "Title": "“College town home-away-from-home”", "Author": "vicChicago", "ReviewID": "UR25725824", "Content": "Stayed one night for a campus visit at the University of IL. Extremely pleasant and comfortable furnishings and Alana at the front desk was warm and welcoming. The lobby, hallways and room looked and smelled fresh and clean. There's a nice indoor pool that we did not use. Our room was a one-bedroom king suite, so the teenagers could watch tv in the living room and my husband and I could close the door and watch tv in the bedroom. The room included a microwave and small fridge. I thought the bed was really comfortable. The only down side was a heating vent in the corner of the room that was kind of loud when we turned up the heat. We requested additional towels and the front desk brought them up immediately. Room rate includes a wonderful hot breakfast in a very pleasant dining room: Fluffy scrambled eggs, bacon, toast, and a huge variety of cereals, waffles, yogurt, fruit, juices, biscuits and gravy, etc etc...There are a bunch of hotels in the area--easy to get to off the highway, and just minutes from campus. I didn't see a restaurant within walking distance, but we had pizza delivered to the room. Our son will be a freshman, and we plan on making this our home-away-from-home for the next 4 years--at least as often as he lets us visit!", "Date": "March 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beverly Hills, CA", "Title": "“Should have been much better”", "Author": "AriGold69", "ReviewID": "UR23474751", "Content": "Parking lot was a sheet of ice upon arrival and departure. Our room was right across the hall from an ice machine which made an amazing amount of noise. The wireless signal was very spotty. The breakfast buffet had very few healthy items, including fruit. The jacuzzi and pool had way too much chlorine in it and were closed for maintenance on a Sunday morning!", "Date": "January 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rutherfordton, North Carolina", "Title": "“Best Handicapp Access”", "Author": "travelbugwesternNC", "ReviewID": "UR22647305", "Content": "We were so pleased with our accomodations and the service we received during our week-long stay. The suite had plenty of room and made wheelchair navigation much easier than in most hotel rooms. The bathroom also had plenty of space for the wheelchair. There was a handheld shower faucet and the tub had a flip-down bath bench, items rarely found in handicapp accessible rooms these days. The hotel lobby was nicely appointed and very comfortable, although it would have even more so had the fireplace been operationable during our stay. Although the food was standard hotel fare (biscuits & gravy, scrambled eggs & bacon, etc.), the breakfast room was very pretty and easily accessible even during the busiest period of the mornings. All the hotel staff we encountered were respectful and professional; they treated us as though we were special guests and we would definitely stay again.", "Date": "December 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Good for families, but expensive!”", "Author": "rakawa", "ReviewID": "UR20973529", "Content": "The location was good. It is near the mall, Meijers, a Starbucks with a dirve-thru, Wal-Mart, Target, and numerous restaurants. There never was that much traffic so driving to see relatives about 6 miles away in Urbana was not a big deal. We paid $169+ tax to get what was billed as a jacuzzi suite. We really only wanted to guarantee we would have a king bed. Strangely, the giant jacuzzi tub was literally in the sleeping area about 4 feet from the bed. Frankly, all of the prices at this hotel seemed steep for what it was. The room was OK, but we could never get the temperature right because of the old time a/c-heat unit. There were dark brown stains on box spring on both sides of the bed. On the second day of our stay they did not leave any shampoo, but rather two conditioners. A mistake anyone could make in a hurry, so no biggie there. The common areas are nice enough, but were constantly overrun with kids. The breakfast area was fine as were the pastries. Free breakast is a nice treat, but the selection was not that great. Pastries, waffles, and other sugary sweet things. The coffee was not hot which was disappointing, but there isa small coffee maker in the room. I would recommend this hotel for families with kids (if you can get a decent room rate) because of the following: pool; free breakfast; rooms have a small kitchenette area with fridge; and it is close to lots of shopping and food.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manteno, IL", "Title": "“Not impressed”", "Author": "Manteno", "ReviewID": "UR20946701", "Content": "This was my first Courntry Inn and Suites stay. Have to say I was not impressed. In need of a good rehab. Carpet, bedding and towels very tired. Breakfast was decent. Had to laugh that someone else come back to a room with the doors wide open. I went and told them I forgot me key and went back and locked it up. It is crazy as I had not checked out. Never had that happen before. Several new hotels going up in the area. Many better options in town.", "Date": "October 16, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Liked it, comfortable stay.”", "Author": "fluffystella2004", "ReviewID": "UR20479164", "Content": "I just needed a nice, guest friendly hotel to stay at. This hotel was all of that. The bed was comfortable, the room and bathroom clean and the staff was pleasant. My one complaint would be that the walls were too thin and the guests' TV next door was pretty loud. There was breakfast but I slept in and didn't get a chance to try it out. The Country Inn & Suites was a good fit for me.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Ready for Rehab”", "Author": "chemicalphil", "ReviewID": "UR20196841", "Content": "At first glance, this hotel was identical to all of the other Country Inns in which I have stayed and been very happy (once I learned to overlook the cutsie dated decorations). Once in the room the similarity ended. The furnishings were worn, the mattress worn out and the towels thin to the pooint of transparency. It took three of them to dry off after I showered. It sounded like a band was practicing in the next room all night but it turned out to be the TV in the breakfast room that right below my room. The clerk said that sometimes she had to turn it down. Sometimes??? One the plus side, the breakfast bar had a big bowl of the mixed fruit that you but in the big bags at Costco so I didn't have to eat the usual high fat/high carb offerings. Also, they let me in fifteen minutes early while they were still setting up as I had an early start. I hope that they are planning on a remodel/rehab for this property soon. It is in a row of newer hotels and I would probably stay at one of them next time.", "Date": "September 19, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Westport, CT", "Title": "“Great Value, Friendly Staff”", "Author": "momof2boys52", "ReviewID": "UR15415479", "Content": "Our son is going to U of I so we have stayed at several other area hotels. This is one of our favorites. It is a little further from campus than some of the others but worth the extra few minutes. We have stayed here 3 times in the last year and have made reservations for two future visits. The rooms are comfortable and clean. The staff is very warm and helpful. They have a nice indoor pool and fitness center and access to computers in the business center too. Their prices are very reasonable for the level of service they provide. If you are looking for value and comfort, I suggest staying here.", "Date": "April 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Good motel, good chain”", "Author": "dler", "ReviewID": "UR14573615", "Content": "We stayed in Champaign on Easter eve to be by family. Had stayed at a Country Inn in Gettysburg last year, liked it. This was very similar. Everything you want in a moderate chain: clean, comfortable, good value, good breakfast. Not luxury, but some extra touches that have made it a terrific option for people that look for Hamptons, Holiday Inn Express, etc. Cookies at desk, books to borrow, coffee 24 hours a day, and above average friendliness from staff. I also like the real stairway from lobby to second floor--not dingy, end of the hall fire escapes that most chains use. Overall, a very nice place to stay.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "indiana", "Title": "“nice place”", "Author": "smoky1", "ReviewID": "UR12275391", "Content": "a nice clean motel--clerk was very pleasant-room was very clean-pool area was nice-breakfast area was larger than most and nice--close to restaurants and walmart--will stay again!!!!", "Date": "January 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "central Illinois", "Title": "“a good choice”", "Author": "Ibird2", "ReviewID": "UR10719109", "Content": "Bottom line: the room was clean, the bed was comfortable, the motel was quiet, the breakfast was good. I would stay here again. However, when I called to book the room there was a mix-up. I asked for a room in a block that had been set aside for my group. The desk clerk had trouble finding the block, then told me the rooms were all taken. Even though I told him this couldn't be possible, he insisted. I was able to book another room however, at the same discounted rate. Later I found out he had made a mistake, of course. But, it did turn out all right. Upon check-in there were about 10 people trying to check in all at once, but only one clerk who seemed flustered. The property is in a good location to get to food and to the interstate. This part of the city is very busy, but the motel is off on a less-traveled frontage road, with easy access onto the main streets.", "Date": "November 9, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“Good lodging option if in C/U area”", "Author": "islandexplorer", "ReviewID": "UR10079133", "Content": "I reviewed the Trip Advisor reviews and decided to try this one. Convenient location, near the interstate, but noise was not an issue. Appears to be a fairly new hotel. Registration was fast and friendly. Put us in a room on 3rd floor to avoid the noise from the pool, since they were filled with small soccer players all weekend. Rooms was very clean. We took a pass on the morning breakfast. The room was filled with all those soccer players and there are many good breakfast options in C/U (see Courier Cafe). All in all a typical chain hotel, with nothing negative to report. Would select it again.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cheshire, Connecticut", "Title": "“Home from Home in the Mid West”", "Author": "Pam_Shapiro_2004", "ReviewID": "UR10027927", "Content": "We are staying here at the moment for 3 weeks following the birth of my first grandchild, here in Champaign, Illinois. My son and daughter in law came to check out this hotel before I booked it, but they didn't really do it justice as to how nice and friendly and how clean and welcoming this hotel is!! The staff could not do enough for us. The rates (for extended stay) are very reasonable, and they include a very comprehensive breakfast, over and above the usual \"quick continental type\". There is also a small indoor pool, and a small gym. Rooms are serviced every day, lots of clean towels. The Housekeeping is excellent and the whole place is very clean. We are delighted with a random choice, really. We have been here for one week and have another 2 weeks to go. I would recommend this hotel for anyone passing through this part of the USA, or for a longer stay on business, etc. Also, although it is quite a large property, on the whole it is very quiet. Also, very well run by the Management. At the moment, I cannot praise it highly enough!! Trip Advisor Member, Cheshire, England ps: my granddaughter was born safely on 28th Sept 07!!", "Date": "October 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pekin, IL", "Title": "“Stay here if you want your expectations exceeded!”", "Author": "fballwidow", "ReviewID": "UR7269567", "Content": "We were very impressed with this 3-day, 2-night stay. Our room was very clean (non-smoking room w/ two queen beds.) We were supplied with iron and board, hair dryer, desk with office chair, and a comfy club chair. We called to say we were coming in earlier than check-in time. The staff person was more than accomodating, and said our room would be ready shortly after the lunch hour. Upon our request, they had furnished us with a refrigerator and microwave oven. These items were not provided in this room, but they had them ready and waiting for us! What service! The fridge was already cold when we got to the room. Our room was on the first floor, and directly across from the pool area. The pool room was bright and clean, very well supplied with towels, and the spa was emptied and cleaned daily. There was a fitness room with 3 machines, but the treadmill was out of order. We were given access to the business center with a separate swipe key, and were able to access the internet and check our e-mail daily. We also appreciated the free USA Today and daily local newspaper: The News-Gazette. The hotel was booked every night, but it didn't seem too crowded. We stayed one weekday morning and one weekend morning. The breakfast choices were more than you see at continental breakfasts. There were omelets with ham and cheese - being kept hot with flames. There were do-it-yourself Belgian waffles - yum! Other items: bagels, English muffins, several danish options, hot and cold cereals, fresh fruit, fruit cups . . . coffee, juice and milk. All served in a cozy breakfast room off the lobby. Wow! Upon check-out, we failed to get our receipt to turn in for business purposes. We called to ask them to mail the receipt to our home address and the always-helpful staff agreed. Once we arrived back home, we received a phone call from the person who took our request. They explained that because we booked through Expedia, they would not be able to follow through with our request, as the rates we contracted through Expedia would not match their rates. It was not suprising to know that the staff went the extra mile ~ again ~ to contact us to say that we would not be getting the receipt and did not want us to be looking for something in the mail that would not be coming. We would definately stay here again, and would highly recommend to other travelers.", "Date": "April 2, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Midwest", "Title": "“Our Credit Card Was Used By The Front Desk Clerk To By Rock Tickets!”", "Author": "mikie12", "ReviewID": "UR7246052", "Content": "After a long day driving, we finally arrived at the lodging establishment. I went to check us in, and my spouse got the car parked and unloaded. The motel was clean and the front desk help, friendly. However, regardless of how clean this was we were shocked when we got home and found out that our CC had been used by the front desk clerk to purchase $530 worth of tickets through Ticketmaster. I contacted the motel, the manager said they had fired her, but never once offered to comp us for the night. Apparently they did not check out her history very well, as according to the police she had done this before. However, she had only been employed there for five weeks. Not recommended", "Date": "March 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Great Deal in Champaign”", "Author": "AHS06", "ReviewID": "UR6230963", "Content": "I stayed in the CI & S this month and loved it. The minute I checked in, the front desk clerk called me about a fax I received and brought it right up. The room was clean, smelled fresh, and had a long hallway because I had a lot of gear. It was perfect because they also put me next to the elevator. I used the pool and Jacuzzi too and both were clean and hardly used. The breakfast was excellent with a lot of choices and friendly staff. I asked them about restaurants in the area and was pleasantly directed to a variety of them with good directions. i would definitely stay there again.Wat a bargain", "Date": "November 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oak Park, IL", "Title": "“Excellent, Service Oriented, Comfortable Hotel”", "Author": "Chayadina", "ReviewID": "UR6110045", "Content": "Since I began visiting the area for work in July 2006, I stay at the Country Inn and Suites regularly (as well as when we are out of town in Indiana and Wisconsin). This location in particular is especially consistant with its service and accomodations. Breakfast offers a wide variety of items, heatlhy and indulgent. Rooms are clean, comfortable, large. When my husband comes with me we usually get a suite which is super-large and has a refrigerator and microwave, at a very reasonable rate. There is a nice, clean work out room, pool and office room with two Internet connected computers. Best of all a free shuttle is available most days to take you to campus or the airport if reserved.", "Date": "November 12, 2006"}], "HotelInfo": {"Name": "Country Inn & Suites Champaign-North", "HotelURL": "/ShowUserReviews-g35790-d444210-Reviews-Country_Inn_Suites_Champaign_North-Champaign_Illinois.html", "Price": "$85 - $199*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">602 West Martketview Dr.</span>, <span class=\"locality\"><span property=\"v:locality\">Champaign</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">61822</span></span> </span> </span> </address>", "HotelID": "444210", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/41/0d/410dac9703a145ad64f79c3d3bc092d73large.jpg"}}