{"Reviews": [{"Content": "One Word - Overpriced.       Swimming pool", "Date": "Aug 29, 2008", "ReviewID": "UR324489670", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "1", "Rooms": "2", "Location": "1"}, "Author": "kidcouture"}, {"Content": "Shabby villa....stay away !!       Lobby/reception", "Date": "Jun 11, 2008", "ReviewID": "UR206791828", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Eeklin"}, {"Content": "a bit dissapointed. website is misleading. Stayed at one of the lagoon villa for 4 days. I have to say whoever did the website did a fabulous job (especially the photographer). For the price, the size of the villa is generous, but it's connected with our (noisy) neigbour! (thin walls). There is NO sofa/chair in the living room... which is weird, we ended up sitting on the floor. (??!?!?)Bedroom is ok, could use darker curtain/blinds... we couldn't stay up because it was too brightKitchen is fairly large, but who needs a large kitchen when you only have mugs and sink? where's the stove? microwave? Air conditioning is terrible, clearly not enough for the double deck villa. Breakfast is poor. Bathroom is ok. The only good thing is probably the lap pool, (although no chairs for sunbathing - also weird) connecting every villa, but that's about it. oh and.. this is a great area to stay in... seminyak rocks!", "Date": "Jun 10, 2008", "ReviewID": "UR373781998", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "4"}, "Author": "traveljunkieJakarta"}, {"Content": "Peeping tom staff spoilt honeymoon Room inclusions weren't generous for the price but we were quite comfortable and happy with the hotel - until we found three male hotel staff on our villa roof spying on us in our private villa pool. Hotel managers apologised but didn't take it at all seriously - another staff member told us it was endemic at Villa Seminyak. The incident obviously tarnished our honeymoon and our view of Bali and Indonesia.", "Date": "Jun 9, 2008", "ReviewID": "UR937363980", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "jlg10"}, {"Content": "What a crappy \"Villa\" If you are interested in exploring a mosquito and lizard-laden holiday villa, then this is the perfect place for your adventure seeking self.If you are seeking to find a place where there are no seats in the villa, nor a sundeck outside the pool area, then this is again a perfect place for you.If you are seeking to find a place where the bed is upstairs by itself, with no TV or other conveniences then this is again a great place.If you are interested in sleeping under the veil of a mosquito hanging from the ceiling to your bed, then this Victorian style is surely up to your liking.If you are interested to sleep in hot conditions, then look nowhere else. The 2 aircons do a great job of keeping you warm.If you are worried about missing your breakfast, worry not because the birds staying on top of your villa will ensure a daily wakeup call at 5am.If you are interested to be left all alone, and have little English speaking crowd serving you, this is a great place again.If you are interested in bad service where the management ignores your reasoning for an early checkpoint and insists on charging you the whole fee for a completely unsatisfactory experience, then once again test your patience here.Best bit....we paid USD150 for every night!!!!", "Date": "Jan 6, 2007", "ReviewID": "UR386664017", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "chubbyrain"}, {"Content": "Villa Seminyak (Lagoon Villa). A little dissapointing.       All the Lagoon Villas", "Date": "Nov 16, 2006", "ReviewID": "UR208573075", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "nil777"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g469404-d450868-r19495887-Villa_Seminyak_Lagoon_and_Spa-Seminyak_Bali.html", "HotelID": "450868", "Price": "$485"}}