{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Don't follow the online directions”", "Author": "angela123go", "ReviewID": "UR128243556", "Content": "Don't follow the hotel's online directions to the hotel. You will be lost, lost, lost. But, that is what happens in Venice! Just not so much fun with your bags. Also, try to get as close to ground floor as possible unless you like to climb stairs. They are quite a climb. Other than that, it's so quaint and nice. The bathrooms are great and the rooms are huge. I loved sitting at night in the square drinking wine and conversing with other guests. (Oh, don't eat at the restaurant across the square from the hotel. Beware. MUCH better places to choose from.)", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Akron, Ohio, United States", "Title": "“Great Value and great location”", "Author": "Molly W", "ReviewID": "UR125209712", "Content": "The Scandinavia has so much charm and is in a great location. The staff was so helpful and we enjoyed a true Venetian experience. They gave us maps and explained everything to us. The rooms are spacious and there is a beautiful lobby to sit in. Also there are chairs right outside so you can sit outside and enjoy the square. Breakfast is good. The room decor is a little old school and mattresses are a little uncomfortable, but for us totally worth the whole experience.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Paul, MN", "Title": "“What a happy accident.”", "Author": "fischerpat", "ReviewID": "UR122635086", "Content": "After a disappointing bait and switch experience in a nearby apartment near the square (Ca Zora Guesthouse) We stopped at the Hotel Scandinavia and hoped they would have an available room. They did, and not only was it beautiful and comfortable, it was also reasonable. They let us eat breakfast right when we checked in. They were all so nice and accomodating at the desk, they stored my insulin in their refrigerator as well as a bottle of wine. We had such good advice about local sights from everyone that worked at the desk. The breakfast was very generous and better than a typical 'continental breakfast' as it included yogurt as a protein food. Campo Santa Maria Formosa was 5 minutes from San Marco, but far enough away that it wasn't overly touristy. There is a nice little bar on the campo and lots of people watching. If we return to Venice, This is where we are staying.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tresco, United Kingdom", "Title": "“fantastic discovery”", "Author": "David R", "ReviewID": "UR122142748", "Content": "after booking an aweful hotel originally (Corte Dei Greci). We found hotel Scandanavia whilst walking towards San Marco' square. We asked to see a room, but to be honest the receptionist could have showed us a corner in the cellar and we still would have stayed there, the staff are just SO nice there and instantly made us feel really welcome. As it turned out the room was great. A large double room overlooking the square. The design is classic italian without being too frilly or garish. It was a really nice view. The square itself is quite a find. It must be the quietest area in the same proximity to the centre. i think it took us 5 minutes to walk to San Marco square and 10 to Rialto bridge, but we probably could have got there quicker. The breakfast was a nice continental buffet. Even if you don't stay here it is worth visiting the staff, they have to be the friendliest in Venice. They even organise a free water taxi and glass blowing factory tour for us. it is exceptional value", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Lovely!”", "Author": "Candace W", "ReviewID": "UR119772031", "Content": "This hotel was great! And the staff was sooo friendly and delightful. It is located in a residential area so when we were sitting in a little cafe next door, enjoying our wine, we could hear the children coming home from school and playing in the piazza; mothers strolling with their baby carriages; families enjoying the outdoors. Charming! The room was more than adequate and the bathroom too. We had a little trouble finding it at first but soon got familiar with the territory and soon no problem. I will return!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cornwall", "Title": "“SUPBERB!!!!!”", "Author": "DuchessofKernow", "ReviewID": "UR119450179", "Content": "Just got back . . . . Had a brilliant weekend in Venice to celebrate our friends birthday, Hotel very easy to find , Rooms excellent in size, beds super comfy, bathroom slighty dated but our friends was brand new, luck of the draw i guess. Very very clean. . . Hotel staff very friendly, some people are moaning about the breakfast but we found it perfectly adaquite, tea, coffee, cereal, fruit cocktail, breads,biscuits and yoghurts. What more do you need. . . . . The croissants are not from the microwave. . . i watched them come out of the oven!!!!! Venice is a lovely city, we found it easy to get around, sometimes we got a little lost but thats part of the cities charm. Highly reccommend going over the big bridge (Ralito} to the other side meals and drinks alot cheaper. . . Everyone must must must try a Bellini Also unlike others we found the locals very very friendly and helpful!!! Enjoy this city.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Good location and staff”", "Author": "Rousesonholiday", "ReviewID": "UR119171730", "Content": "The staff made this hotel. They were very helpful and pleasant (something that we found rare in Italy). The room was a good size and bathroom more than adequate. Wifi was free and only worked downstairs in the lounge. The breakfast was average. The hotel is only about a 5 minute walk to the Rialto bridge once you work out the streets of Venice!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Krakow", "Title": "“Great location shame about the breakfast...”", "Author": "thosthetourist", "ReviewID": "UR118837734", "Content": "The hotel is in a great location and our room overlooking the square made for an atmospheric stay. The hum of noise as we observed the comings and goings of tourists, workers and Venetians going about their day to day business made you feel part of this vibrant wonderful city. The hotel room was clean and well maintained although the shower pressure was pretty low. The temperature of the room was perfect both at night and late afternoon/early evening when we were getting ready to go out for the evening.The staff are excellent, friendly in nature and always with a welcoming smile which to me counts for a lot. Now for the breakfast...my Wife and I both expected more from such a hotel. The croissants were nice but stodgy from the microvave and the buns that supported the scanty procesed cheese were hard enough to rattle any persons teeth fillings. For the price of the room we expected the breakfast to be just right - just some more effort into the start of the day and it makes all the difference.", "Date": "October 2, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Oslo", "Title": "“Bra!”", "Author": "RaymondOslo", "ReviewID": "UR118138256", "Content": "A typical Venezian hotel, centrally located close to most of Venice attractions. Next to a open square and away from the big crowds of tourist`s. The hotel has small rooms, no elevator. But mostly clean. Free WIFI in the lobby area. Eat your breakfast elsewhere, if you are not in to sweets for breakfast.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Clean hotel with a good location and a great breakfast”", "Author": "Dan K", "ReviewID": "UR117506724", "Content": "Hotel Scandinavia is a nice and clean hotel in a good and central area of Venice. Rialto bridge and San Marco square are within walking distance. It lies on a cute square with a church (which has classical concerts in the evening). The hotel provides seats outside, so you can drink your coffee while watching Venice wake up. This leads me to the breakfast, which is absolutely great according to Italian standards. They have large variety of food, like cornflakes, (brown) bread, crackers and even croissants! However, do not dine at the restaurant across the square, because that will be a disappointment. If you don't know where to go, ask the staff. They are very friendly and helpful. The rooms are small, but comfortable, (very) clean and generally with airco. Perhaps this is one of the reasons why we did not encounter any mosquitos there (even though it was summer). All in all, Hotel Scandinavia is a great place to stay.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "San Francisoco", "Title": "“Good service/staff, very small room, just a little too far from most things”", "Author": "Temp94611", "ReviewID": "UR117225747", "Content": "Fmaily of four (8.10) Last minute trip to Italy. This hotel worked out fine for us. Room a little small, particularly bathroom, compared to our other hotels on trip. Very skimpy breakfast (compared to other hotels on trip). Little far from most things. 20 minute walk, compared to 10 from our other hotels on the tripl. Staff was very friendly and helpful. As a last minute selection it worked out fine. I beleive, we could find something better at this price point.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Brillient choice of Hotel”", "Author": "Just_Being_ME29", "ReviewID": "UR116362900", "Content": "TRAVEL to HOTEL If you are familiar with the area the walk from San Zaccaria to hotel will be 10mins, if not then its a minimum of 30mins. There are a few bridges to cross, so pack lightly or prepare to lug your things up and down many mini bridges. (this is the case no matter what hotel you go to) GREETING Main Staff speak fluent english! Are extremely welcoming. Will even take the time to point out the Venice attractions and locate them on the map and make sure that your stay is pleasent 10/10 service! HOTEL & LOCATION; There is NO lift in the hotel BUT they do have a bell boy for your bags if require it. A few foot steps outside of the hotel is a cash machine, Gondola point, a church which performs Vavaldi 4seasons every night for 29euros. Execellent location as it is a 10min walk for either the Vaporetti stops or St Marks Sq (Bacillica, Doge, Watch tower etc) Hotel is in a nice open area which feels safe and inviting. Surrounding area of Casttello is the nicest part of Venice; very pretty and good for shopping and resturants & main attractions. QUALITY of HOTEL The exterior doesnt seem that pleasent but the inside is cosy, simple but very clean with a flat screen tv. Hotel provides Free Wifi but can only be used in lobby. A simple room though very clean. A clean, modern, stylish bathroom; they provide complimentry shower cap, soap, shower gel and hair dryer. Hotel provides a mini fridge but is not very good as it keeps drinks cool (slightly cooler than room temperature) and no coffee machine in the room. FOOD Complimentary continental breakfast of croscants, jam and coffee. BUT there is a fruit market a few steps from the hotel & a cafe next door which seemed to be open every time i walked past from the hours of 7am -10pm ROOM with a VIEW I was given room 10 on 3rd floor. Terrible view!!! over looked a brick wall and a roof. BUT at the same time was not an issue as it meant we had privacy.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“We rubbed shoulders with real Venetians.....”", "Author": "Rearview50", "ReviewID": "UR115698152", "Content": "and we found them to be welcoming, helpful and very friendly. We enjoyed our stay at Hotel Scandinavia but particularly enjoyed the view over Campo Santa Maria Formosa. We found the hotel to be good value for money and would be happy to return. The hotel is in an excellent location for the major sites but it was the access to the less commercial nooks and crannies of the city that lingers in our memory.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Cancun", "Title": "“Dirty”", "Author": "daybee1", "ReviewID": "UR115434268", "Content": "The stairs to the second floor and carpets were dirty, the room was awkward, poorly laid out and the bathroom needed deep cleaning. The staff was somewhat helpful but seemed to be pre-occupied and uncaring.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Penn Yan, New York", "Title": "“Scandinavia will greet you with a warm smile!”", "Author": "justvisitingkids", "ReviewID": "UR110151407", "Content": "We started our trip in Venice with 2 nights at the Scandinavia. The hotel is a simple little place. The rooms are small (which is to be expected in Italy) The personnel were all so friendly and helpful. The gentleman at the front desk greeted us with a huge smile and welcome. We felt as though they truly were happy to have us as guests. The morning breakfast was also very sweet and simple. The hotel sits in a wonderful little plaza. There are lovely vendors that set up their wares each morning. A small restaurant next door sets up tables and umbrellas each day. You can see folks strolling with their children a playing catch with their dogs. It was a lovely relaxing little square and we enjoyed returning each afternoon. I would be oh so very happy to return for another stay at the Scandinavia and I am sure I would be greeted with another warm smile.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Quaint, friendly and clean. Great location.”", "Author": "Polar_bear77", "ReviewID": "UR108893369", "Content": "Spent 4 nights here. Staff were friendly and were happy to help with restaurant suggestions and booking water taxis. Over looks Saint Maria Formosa church and piazza. Wake up to markets and cafes. Room was adequate with a modern clean bathroom. Explore Venice from this old style european hotel. The feel and style added to the whole Venice experience. Most staff spoke english. Note there is no lift so be prepared for stairs.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“friendly and clean”", "Author": "Helen52", "ReviewID": "UR104285494", "Content": "At first glance inside the hotel, it looked as if we had made a mistake booking it. It is quite dated and the rooms are not particularly attractive. I know it is an old hotel, but the old blankets on the beds and ancient furniture made it quite unappealing. That said, however, our rooms were really clean, had lovely white sheets on the beds and the bathrooms were spacious and nicely decorated. The staff were very, very helpful and really nice . Breakfast was adequate with cereal, rolls, jams, teas and coffee, so it is enough to set you up for the day. It is near the main attractions of Venice and, you are never really in your room, so it is a nice hotel to stay in for a short visit.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Good value for your money”", "Author": "thierry_grenade", "ReviewID": "UR103935737", "Content": "very well located. Staff very friendly. Rooms are nice and clean. Go there !", "Date": "April 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Desborough", "Title": "“Down to earth hotel”", "Author": "RealAlers", "ReviewID": "UR99968376", "Content": "This is a nice no frills hotel a few minutes walk from St Marks square. The room was nice, bright and clean. The staff are freindly. Breakfast is very much help yourself but adequate. We had a great time.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "HCMC", "Title": "“Avoidable”", "Author": "raivikas", "ReviewID": "UR99718358", "Content": "Stayed for 2 nights with my wife and 3 year old daughter, Location is fabulous, next to a church so you get the church yard in front so it gets a rare open space in Venice. There are a lot of toys kept behind the church and lot of kids playing in the afternoon. The hotel had provided us with a baby cot, but there was absolutely no place to move in the room once the baby cot was put. What was worse is that the cot broke while she was sleeping on it :-( It has 4 floors with no lift, so if your traveling with a toddler - keep this in mind. Toilets are incredibly small, I'm a medium framed and got a few bruises in the shower closet :-) so beware. Breakfast is basic, has no kitchen so expect only packed stuff for breakfast - no eggs!", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Fantastic location and great value for money”", "Author": "Caitkirs", "ReviewID": "UR75634041", "Content": "Myself, husband and two children used this hotel for an overnight stay in Venice in July. It was great value for money, the location was perfect for all the sightseeing within the centre of Venice. The breakfast was basic but just what was required, the rooms were clean, although the fold down beds weren't too comfy but were okay for a one night stay. We would not hesitate to return to this hotel should we return to Venice.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Aussie", "Title": "“Very old hotel that gives a true Venician feel.”", "Author": "Aussietraveller61", "ReviewID": "UR62264632", "Content": "We stayed at this hotel as a family of 4. The welcoming staff were most co-operative at all times. The building itself is reallveils, very typical of architectural style in VEnice. So that was perfect for us, exactly what we were looking for. The windows overlooked the square and one could watch the day events..children playing, adults relaxing, dog walking and of course, tourists. The staff wil provide you with a tea or coffee whenever you feel like one. Breakfast basic but enough. Bathroom good and clean. Beds comfy. Restuarants and cafes near by. Plenty of shops in nearby streets. 10 min walk to central sight seeing things, a great bonus! It is not close to station. As first time Visitors we did get lost on arrivebut finally got around it. If you come by train, best to get public water taxi to rivolti, then walk remaining distance. We had to leave very early in morning so a private water taxi picked us up in nearby canal. Venice is expensive everywhere, so in spite of distance we were extremely happy with this true Venician hotel and would most definately stay again. I also heard that it was the place Othello and Desdemona met.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich", "Title": "“Thank you for all your help”", "Author": "HazelNorwich", "ReviewID": "UR62214235", "Content": "A fellow teacher and myself moved to this hotel when our booked accommodation couldn't renew our booking, and sent us to the Scandinavia . We could not get home because of the cancelled flights due to the volcanic dust cloud over Europe . The night manager met us with coffee , 'cake' and kindness. Despite not knowing from one day to another how long we needed the room we met nothing but support, kindness and professionalism. The hotel is in a lovely square, close to all you need and safe and suitable for solo, family or friends to stay. A real gem and a hotel we would happily return to.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Belo Horizonte", "Title": "“Good hotel.”", "Author": "Skilobh", "ReviewID": "UR59928411", "Content": "Good location and good breakfast. Rooms are old, with old furniture and the bathroom is very old, but Venice is known for old hotels, so thats a common thing there. ItÂ´s not a bad choice.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“very pleasant reasonably priced”", "Author": "bernEngland", "ReviewID": "UR38880508", "Content": "Hotel Scandinavia is ideally placed just outside the centre of all the landmarks but within a ten to fifteen minute walk, the staff are friendly and helpful, the self service breakfast consisted of fruit juice, croisants, yoghurts, rolls and cereal there was a vending machine for tea and coffee.The room we occupied was small but adequate and clean. A fruit seller in the square outside sells lovely produce. The food in the restaurants was extremely expensive,you would need to spend over Â£100.00 per couple for a good meal, we would reccomend the ciabatta rollsand sandwiches and a selection of the gorgeous cakes for a mid day lunch their are lots of fountains throughout the city to fill up your water bottle.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Didn't work for us”", "Author": "DAGA1", "ReviewID": "UR38194437", "Content": "Air condtioner didn't work. Refrig. didn't work. No cups, etc in the DIRTY bathroom. Room finally changed after we called the travel agent in U.S. Because of an earlt flight, we left hotel at 4:45 A.M. The nighr clerk did not turn on the lights in the lobby. We had to walk in the dark. Was safer for us to wait outside. Wonderful location. Friendly staff.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "san diego", "Title": "“a typical Venitian gem”", "Author": "flyawaySanDiego", "ReviewID": "UR34231843", "Content": "This quaint hotel sits on a plaza about 5-10 min behind St Marks Square. It was very charming, and our particular room was on the 4th floor with a front facing view over the Maria Formossa Piazza and bell tower. The room was large enough for our family of 3 with a rollaway bed. There is no elevator- so be mindful of how much luggage you have. They do have a porter to assist. The front desk staff was very helpful. It was difficult to find when we arrived by water ferry getting off at the Rialto Bridge- so many little streets and bridges to transport your luggage over. I would suggest just paying for the water taxi till you have your bearings- wise money speant in the long haul. Once you know your location- it is always 2 bridges and a left to St. Marks...no matter which bridges you choose. Breakfast was a plentiful continental breakfast.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bucharest", "Title": "“Cold rooms”", "Author": "anica_ro2005", "ReviewID": "UR31638539", "Content": "I was in February and it was cold, not going radiator and air conditioning is not heated room. There was noise from air conditioning. The rooms were spacious and clean. Hospitable staff", "Date": "June 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Virginia", "Title": "“Would not stay here again”", "Author": "Javo1234567890", "ReviewID": "UR29250179", "Content": "We werent expecting this hotel to be great but after spending $200 a night we though it would be decent enough were we could just sleep in and enjoy Venice. Boy were we wrong. If you have never been to Venice you will encounter that everything is hard to get to until you understand how the streets and signs work. After walking for like an hour we figured out how it works and were able to find the hotel. The hotel location is really good but then again Venice is very small. We got to the room and saw that it looks like the furniture had been there since the death of Marco Polo in the 1300's. One the chairs looked like it had been chewed by a dog and the bed was just two twins put together to make a full bed and the headrest was filthy and ugly. The bathroom was the nastiest bathroom i had ever seen. There was a blob of toothpaste on one of the walls, the shower was full of mildew and soapscum and it did not drain properly so needless to say that my girlfriend and me took showers with sandals on which we threw out when we left the hotel. We were mad about it cause it said it was a 3 star hotel and I would rate it a 1.5 star hotel. The hotel included breakfast which was nothing more than a cold coffee, fruit salad and croissants and french bread. Try to eat the first morning there and ended up leaving and going to a restaurant. However, outside the hotel there is a fruit stand so you can avoid breakfast there and eat some fresh fruits outside. I would not stay there again and my sister told me a similar story about her hotel from 4 months before so if you go to Venice make sure to spend more money if you can and get a good hotel.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oregon", "Title": "“Expensive rooms/hotel, but nice.”", "Author": "LuvCHOCOL8", "ReviewID": "UR28531256", "Content": "Venice is expensive...period. Definitely didn't get the 'hotel for the money' like in all the other European cities we visited, but enjoyed the Scandinavia. Breakfasts were good, staff exceedingly helpful, location was good, although the alley way is very noisy in the mornings. We slept well, though; comfy beds. Bathroom set-up was strange, but we worked it out. Overall, nice hotel.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "usa", "Title": "“Very nice hotel...”", "Author": "mas62", "ReviewID": "UR25473140", "Content": "This hotel is very nice to stay in venice, I was there for two nights an it was nice experience. The hotel is 7 minutes walking to the Rialto bridge and 5 minutes to the San Marcos Square. The Staff in the hotel is very friendly giving information about the city. The breakfast is good, and the rooms are a little small but comfortable. I really recomend this hotel, if some day I come back to venice I will stay there again.", "Date": "March 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Weybridge, United Kingdom", "Title": "“A lovely surprise!”", "Author": "hummingbird444", "ReviewID": "UR20510636", "Content": "We spent three great nights at the Scandinavia in early September, the previous reviews were extremely helpful as I find it difficult to go up loads of stairs and having just become a Senior, was able to use this when we booked, we were given a room at the front of the Hotel, which was fantastic. Andrea and his Staff at Reception were extremely helpful, recommending different things, I was looking for a particular Church, he showed us on a map where to go and led us the gem of the Santa Maria dei Miracoli Church. It was very hot during the first week of September so the air-conditioning in the room was a great plus. The location was amazing, really easy to get to St Marks Square and the Rialto Bridge, we enjoyed watching \"life\" go on in the Square outside the Hotel.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oregon City, OR", "Title": "“Good location, price, hard to find for newbies”", "Author": "Fred_n_Aaron", "ReviewID": "UR17912510", "Content": "This hotel is in a great location, but hard to find for 1st timers. I would recommend coming from San Marco's vaporetto stop rather than the Rialto. There are less stairs and bridges if you have luggage. The breakfast was mediocre and the espresso machine (instant) tasted like Salami to me. The eating area was very claustrophobic so we sat outside. Our room's A/C broke on the 2nd night so we gritted our teeth for one night with open windows. The next night we were put in a single room plus a roll away because the hotel was full. The third day they fixed it. All in all, it was a good price for our budget. Next time I'd search for a bit for a different hotel just because I'd like to explore. But if all were full or too pricey, we might consider staying again. This hotel had a nice-sized shower and bathroom.", "Date": "July 15, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Loughton, Essex", "Title": "“Impressive 3 star hotel in Venice”", "Author": "CorkyMaggie", "ReviewID": "UR17574452", "Content": "I have just returned from a 3 night break in Venice, staying at Hotel Scandinavia. When booking, I was aware that good hotels in Venice can be pricey and was a little anxious about what I had booked. I needn't have worried though as our stay at the Scandinavia surpassed all my expectations. The building is lovely, the rooms spacious and comfortable (with excellent cleaning services), and, for us, none of the problems mentioned in other reviews here. In addition, the staff were all very friendly and accomodating and the breakfast was good. As has been previously mentioned, the location is excellent with all the main attractions within walking distance. The only possible downside is that there are four floors but no elevator. However, we are all fairly fit, so our fourth floor rooms didn't present any real problems (and gave some much needed exercise!) If you might have difficulty with all those stairs, get in touch with the hotel to request a room on a lower floor. All in all, a pleasant stay in Venice - I would book again.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“Quaint & Rustic, Close to St. Mark's Square/Rialto Bridge”", "Author": "jenum24", "ReviewID": "UR17465068", "Content": "We stayed at this hotel for two nights from 6/22-6/24. Upon arriving, the staff was very friendly and helpful, but unfortunately we were on the 4th floor and there's no elevator. They insisted on having the porter carry our luggage up for us and after a long day of traveling in the hot weather, we couldn't argue. Our room was small with a medium sized balcony and AC. The interior furnishings are pretty old, but it's a 1,000 year old building, so I guess it comes with the territory. The bathroom is a decent size, however there is only a bathtub and no shower head (other than hand-held), which can be a little awkward if you're looking to clean up quickly. The hotel provides free wireless internet, but it only reaches up to the second floor - they have a couch, desk and some chairs to sit on on the second floor for this very reason. Their breakfast buffet consists of fruit cocktail, yogurt, cereal and croissants. The hotel is a few minutes walk to Rialto Bridge and St. Mark's Square as well as a number of restaurants, shops and a laundromat (around the corner). Overall it was a decent stay. The staff gave great restaurant recommendations and helpful tips.", "Date": "July 3, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Albuquerque NM", "Title": "“Very Venetian”", "Author": "Tangarini", "ReviewID": "UR15640544", "Content": "We stayed at this hotel for four nights in the middle of April. I've read somewhere this is the place where Othello met Desdemona so as a Sheakespeare lover, I was very happy to stay here, anyway. The location was great, close to everything you might like to see. I especially liked the fact that the hotel is in Campo and our room was overlooking it. By the way, our room was Room 1 and right outside the door is a cozy and lovely lounge. The interior of the hotel is very Venetian and we liked antique furniture here and there and beautiful light (chandelier) and the ceiling. We enjoyed watching every day life of Venice that was happening in the Campo and surrounding area. Children come to play, dogs walk around as if it were their own backyard and people stopped by at a fruit stand. We watched how they collected garbage and took it away. Eveything reminded us of by-gone days. The front desk staff spoke very good English and helpful. Breakfast was just fine for us. The only thing is that there is no lift, but hotel staff is happy to help. We enjoyed the stay very much. One recomendation: if you are a senior, ask for a room on the first floor (which is actually the second in Italy).", "Date": "May 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cambs", "Title": "“Perfect for 2 nights!!!”", "Author": "wolfiesmith", "ReviewID": "UR14487703", "Content": "Blimey - you want a flash hotel in Venice then pay the money for 5 stars. I cannot fault this hotel - apart from poss the gaps in the doors but who cares, the location is fantastic which to us was most important thing. All roads/bridges led to scandinavia, couldnt get lost!!!!! Breakfast perfect for me, pastries and coffee plenty. After all Italy is about eating out!!!! I went thru Hotelclub and got a mega bargain deal in carnival week. As I say if you want luxury then go somewhere else. If you want a cheap, well located, clean, comfortable hotel then this is the place for you!!", "Date": "March 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "northern ireland", "Title": "“Scandinavia 3 star Hostel”", "Author": "jamesbond333", "ReviewID": "UR12962851", "Content": "When we arrived in Venice we were horrified when we seen our Hotel, the outside had a scaffold outside and when we got to our room it was even worse it was in a word a tip! it was dark dreary small smelly and dirty and had an inch wide gap in the front door! when we complained the guy on reception gave us another room it was worse, a few hours later we got another room it was just about ok so we had to make do. The breakfast was very very basic tea from a machine not the standards of a 3 star hotel. Venice itself was great to see but this hotel sucked!!!", "Date": "January 24, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Very pretty, not that comfortable”", "Author": "Louisthe12", "ReviewID": "UR12805715", "Content": "The good thing about this place is it very pretty inside and looks just like an old Venetian building. The problem is it IS an old building. None of the doors or windows seem to line up properly and I couldn't open the bathroom door to get out by myself. The water was turned off both mornings we were there with no warning - so no toilet or water to brush teeth, shower etc. The breakfast was fine for a typical European breakfast - croissants, bread, tinned fruit, cereals, juice, coffee machine, yoghurt. We had to climb 4 floors of stairs but enjoyed the exercise. It was not very well heated and quite noisy - both outside in the mornings, and inside from people in other rooms. But everywhere in Venice is expensive and this location is great - 10 minute walk from St Mark's square and easy to find from the train station using the directions on the hotel's website (but the Vaporetto from the station is costly - 6 euro for a 5 minute trip)", "Date": "January 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Shame About The Breakfast”", "Author": "coachmark", "ReviewID": "UR12446196", "Content": "I have to agree that this typical Venetian hotel is well situated but is not value for money in my opinion. The room we had was large but seriously basic I.E no tea making facilities although this is pretty normal for continental Europe. The bathroom however was modern, clean and there was hot/cold water. The main point I want to get across to readers is the breakfast. This was the most basic of all continental breakfasts I've had (and I've had many). Just cereal and pastries. No eggs, cheese or cold meat which is more usual. So don't expect much on the food side. To finish - a nice basic but overpriced hotel which leaves you with an empty feeling (lack of food that is)!", "Date": "January 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Could probably stay somewhere else...”", "Author": "mandys97", "ReviewID": "UR10078510", "Content": "The pros of this property have already been mentioned on tripadvisor and primarily consist of its location. It is in a great location on a very quaint Venitian square.... pretty much imagine what you think Venice looks like and its directly outside the door of this hotel. The hotel staff was very nice and helpful. The negatives are a few too many. The rooms are old and small. I realize this is Venice and that most everything has a renaissance feel to it but a few modern conveniences wouldn't hurt. I stayed in a room with my wife while our extended families stayed in two other rooms. One of these rooms had no shower curtain... just an old tub. One of the rooms had mosquitos (didn't confirm that until I read some reviews here - I thought they were being paranoid)... they complained of itching for those 2 days and had red marks on their necks. There is no lift. The breakfast is completely average. And I just didn't feel 100% clean getting into their beds each night.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New Orleans", "Title": "“Great Location but cramped and dirty”", "Author": "watertraveller", "ReviewID": "UR10017347", "Content": "My wife and I stayed here on our honeymoon. Pros: The location is excellent! It was a short, charming walk to just about anything in Venice. Right outside the hotel there were cafes and fruit stands in the piazza. Maybe 10-15 minute walk to St. Mark's Square. Cons: Like most places in Europe - the room was cramped The breakfast was not good We found mold in our bathroom and wore sandals when taking a shower Overall - it was average - we spent most of our time outside the hotel anyway. But it would've been nice to have a clean room and bathroom. It didn't stop us from enjoying our Venice stay.", "Date": "September 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Phoenix, AZ USA", "Title": "“Nice hotel, polite staff”", "Author": "WorldTravelr", "ReviewID": "UR8716730", "Content": "My review is delayed because I wasn't sure what to compare this hotel to. After a few visits to Venice, I can say this hotel is all about LOCATION, LOCATION and a nice breakfast even for an American, somewhat snob, like myself. I work in the travel industry and have traveled the world...I can tell you that there is only ONE Venice (forget the Venetian Las Vegas) The rooms in old Europe can be small and you are lucky to have an elevator. (\"lift\" in their lingo) I really enjoyed my stay here, liked the staff, and wished for a little bleach in the shower. My advise is NOT to piss off an Italian no matter where you stay. (God love them)", "Date": "September 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Excellent stay, fantastic staff”", "Author": "rednwhitetractor", "ReviewID": "UR8617417", "Content": "We had 2 nights in the Hotel Scandanavia en route to Lake Garda. The hotel is fairly close to the vaparetto stops and is minutes walk from the Rialto and San Marco square. Excellent location. The hotel is located in a beautiful piazza with a nice little bar just outside. Inside the rooms are extreamly clean and very spacious. The vintage look of these rooms is very quaint and everything you would expect and want from a hotel room in Venice. The staff were superb. I had left my mobile phone in the safe and only realised this after my departure. I called the hotel and they not only located my phone but then posted this onto me back home in the UK. I cannot fault this hotel and would recommend anyone to stay there", "Date": "September 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“Renaissance living in Venice!”", "Author": "Ozdreamer", "ReviewID": "UR8112121", "Content": "My Mom and I stayed here for two nights in July '07. Once we figured out Venice's confusing system of little streets, we realized how central the hotel was to everything. It was far enough out of the heavily touristed area to be quiet in the evenings, yet within easy walking distance of everything you need. When we first rounded a corner and caught sight of it across Santa Maria Formosa Square, we couldn't believe our good fortune! The interior is very tastefully decorated, with tons of antiques and pictures that make you feel like you've stepped into Renaissance Venice. The hotel staff are friendly and helpful, and they put on a terrific breakfast buffet. It was excellent value for the money, and we would both love to stay there again. Highly recommended!", "Date": "July 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Canterbury", "Title": "“Great Location, bad hotel.”", "Author": "rpnj", "ReviewID": "UR8030626", "Content": "My wife and I stayed 2 nights at this hotel in June/2007. The hotel's location is just perfect. It is about 5 minutes walking from the Rialto Bridge, and about 10 minutes from San Marco's square. The area around the hotel is rather nice, with bars and restaurants. But the hotel is very bad. The only good thing we have to say about it is that the room was clean. The breakfast is quite poor (we decided not to have breakfast there on the second day), and there is no lift. It may sounds lazy-talk, but we were on the 4th floor, and had to carry our bags through kilometers of steep stairs... In adittion, we didn't have a shower in our bathroom. It is worth mentioning that the hotel is full of mosquitoes. Although the rooms are air-conditioned, they manage to get in your room somehow!", "Date": "June 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Charming Hotel in Perfect Location”", "Author": "jww50", "ReviewID": "UR7756148", "Content": "My husband and I just returned from a wonderful trip to Italy. We went to Rome, Florence, Cinque Terre, and our last stop was in Venice. First, we had three days in Venice, and people told us this would be too long. I disagree and am so happy we had three days in this romantic and charming place. It was relaxing and slower paced than Rome and Florence in terms of sight-seeing for us. Hotel Scandinavia was very clean (important to me), in a great location, and the staff were helpful and nice. The breakfasts are basic - cappuccino machines, croissants, rolls, some cereal, and canned fruit cocktail (but there is a nice vegetable stand right outside where you can buy fresh fruits/veggies). The location is perfect - close to Rialto Bridge and St. Mark's Square, and there is a supermarket, awesome gelato store, and calzone/pizza place in the same block. We enjoyed sitting in the Santa Maria Formosa Square and watching kids and adults pass by. We went to San Vino Pinto Restaurant (right across from the fish market) and had our most memorable dinner. I highly recommend Hotel Scandinavia. Also, if you have time, go to Burano for the cute, colorful houses.", "Date": "June 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dunfermline, United Kingdom", "Title": "“Nice Hotel - Typically Venetian”", "Author": "Fife_Flyer", "ReviewID": "UR7741254", "Content": "We stayed here for 3 nights in May 07 whilst in Venice to plan our wedding later this year. Having stayed at the Ca' Formenta two years ago we have come to the conclusion that if you definately want a room with a view then you have to pay extra. Also (unless you pay big money) there are very few hotels in Venice that have a view of any substance. Whilst this was not a factor in our stay this time, the room we were allocated (35) on the first floor was certainly big enough and had two windows, however when these were opened they looked out onto a brick wall which was literally within touching distance. We politely asked if another room was available and we were shown room 34 on the other side of the building (left as you look at the picture). Slightly smaller and had a more open aspect onto the narrow street below. The air conditioning unit was on full and without a knob, was not adjustable. The bathroom looked very dated and lacked a shower curtain and rail making taking a shower impossible unless the floor was soaked. Other fittings such as the towel rail and shower head holder were loose to the point of almost falling off. Although made up as a double, the bed was two singles pushed together with single sheets and a double blanket and cover. These comments are not complaints and may not be representative of other rooms in the hotel but submitted for the benefit of others. Breakfast consists of coffee from a vending machine (good enough and could be used throughout the day if you ask), cerials, mixed fruit compote, small marmalade filled croissants, bread rolls, yoghurt, soft cheese and preserves. Staff were very friendly and helpful to the point that when the photographer failed to turn up for a meeting with us they let us use their internet and sent a fax on our behalf. The same member of staff also took us to another photographer he knew of after he finished work. The hotel was perfect for our needs and located 10 minutes walk for San Zaccaria vaparetto stop and 5 minutes from Rialto. If you are coming to Venice for that once in a lifetime trip, this may not be the hotel for you.", "Date": "June 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wakefield", "Title": "“Good place to stay in Venice”", "Author": "TJ_and_PC", "ReviewID": "UR7191463", "Content": "We visited Venice for our Silver wedding and choose the Scandinavia because the deal seemed good after reading reviews and looking at prices. We were on the second floor in a nice room overlooking the square. The room was furnished in a traditional style, the bathroom was modern and, we think, brand new. Looking at other rooms that gave on to the narrow alley we thought they did not seem as inviting. Breakfast was adequate. Staff very friendly and helpful. No lift so if stairs are a problem look elsewhere. We thought the location was excellent, just 5 minutes max to the Rialto and St Marks Square, plenty of restaurants and a mini-market close by. Ideal tourist hotel â€“ we would stay here again", "Date": "March 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, UK", "Title": "“Great hotel, great staff, great location...”", "Author": "UKBookworm", "ReviewID": "UR6901393", "Content": "We went to Venice last year, and stayed in Mestre to get cheaper prices. This year, I booked in September to benefit from cheaper rates during Carnival times, and my search found this little gem. I contacted the hotel before travelling to request a room with easiest access, as previous reviews showed it to have quite a few stairs and no lift, and I have mobility problems. I also asked for a room with view on the plaza if possible. They immediately responded agreeing to both. This was very reassuring and pleasant. So to the stay itself. Only one word: delightful. The staff are smiling, day or night, always with a few cheerful words or ready to help and advise. The hotel is ancient, and yes, it has an air of shabby decadence in places, but then so does the whole of Venice, that is its charm... The room was clean, with a smallish, but more than adequate en-suite bathroom, and an amazing wooden ceiling. This is not the height of luxury, but neither is it lacking, and I couldn't fault it for the price we paid. Breakfast is included, and will satisfy all but the most finicky: a buffet of plain croissants, apricot-filled croissants, bread rolls, all freshly baked, 2 types of cereals (trust me, this is good for Europe!), dry toast, rye bread, butter, jam, yogurts, different types of juices, hot drinks, set at the front of the hotel behind great windows from which you can watch the bustle of the piazza. The cherry on the top is the location: Set on a charming piazza with a canal on 2 sides and one of the oldest Venetian churches across the square, it is less than 10 mns walk from either the Rialto bridge if you turn right, or Piazza San Marco if you turn left. For us and our Carnival costumes, it meant we could nip back very easily to change or rest before setting off again. Finally, the price: by searching through Trip Advisor and booking early, we paid Â£562 for a triple room for 6 nights, B&B. This was at Carnival time, remember. It doesn't get much better or cheaper than that. We're already planning to go back next year with better costumes. Will we be going back to Hotel Sandinavia? You bet. ;-)", "Date": "March 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Perfect location! Perfect!”", "Author": "Hakf", "ReviewID": "UR6490304", "Content": "I organised a photo trip to Venice and we stayed here in Jan of 2006, but I forgot to leave a review, so I am leaving one now. The location is absolutely perfect. Seriously, it's so good. There is even a small market in the morning outside the hotel selling fresh fruit, which is nice. The rooms are cool, they added an extra bed in my room as requested which was great. Ensuite bathroom was very nice. The only thing I didn't like about the hotel was the continental breakfast - fruit and bread really. But I think that is more Italian culture than the hotel itself so it won't get negative marks for that. Great location, very good hotel, nothing bad to say at all.", "Date": "December 24, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bristol", "Title": "“If you are thinking about booking this hotel; just do it”", "Author": "Billy2homes", "ReviewID": "UR6083119", "Content": "This hotel is affordable and just a few bridges away from San Marco. go for it. Its to a good standard. clean basic rooms and very helpful staff. But what made it for us was that it was located in a plazza with church, bars and easy connections to other parts of Venice, bars, shops and local cuisines. It all felt very non touristy and that is a good experience in itself. We sat outside the hotel and watched the locals go about their business and the gondolas go past. Breakfast was standard; but the cooks regularly delivered fresh warm bread rolls. The Breakfast room was a bit squashed due to more clients wanting to eat at the same time in relation to number of tables avaialble. All minor stuff. I would book again..", "Date": "November 7, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "vernon, bc., canada", "Title": "“great location”", "Author": "redsox", "ReviewID": "UR5888972", "Content": "I am Trip Advisor member. My wife and I stayed at this hotel Sep 11-12, 2006. We got dropped from the water taxi about 3-4 blocks away from the hotel with only limited instructions on how to get to the hotel! However, we managed to find our way with all our luggage and were pleasantly surprised at the location. It was located on a large square across from a cathedral. The staff were very friendly and courteous. There is no elevator in this building but we got a room on the 1st floor so had a small flight of stairs to go up. The room was OK and the windows opened on to a very busy narrow street. This made for quite a lot of noise well into the late evening as the restaurants and cafes in the neighborhood stay open until around 11:00 pm. The bathroom was clean and serviceable but interestingly enough had no shower curtain! The buffet breakfast was an above average continental style. The coffee machine had several options and it was a challenge to know which spout that your choice was going to come out of. You had to have your cup ready or you would miss the liquid! My wife gave this hotel an above average rating whereas I think it was average. It was very pricey for what you were offered. We stayed at a lovely hotel in Barcelona for less money that I would rate as excellent. Staff helped us with our luggage to the water taxi that came right up to the landing across the square. I have no idea why the other water taxi did not come to this location. Although the location was nice, we would not stay there again due to the price.", "Date": "September 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lake City, Florida", "Title": "“Okay, But Not Great”", "Author": "rmcl26", "ReviewID": "UR5882507", "Content": "We booked a room with a shared bathroom. Didn't want to, but everything was so expensive. At check in they gave us a rather nice room with a private bathroom and a great view. Upon realizing their mistake, they moved us further upstairs to a much smaller room with no bathroom. It was not nice at all. They're were two tiny twin beds pushed together, but with seperate sheets and one queen size comforter. Not very comfortable. The room was also not overly clean, and could use some help. If you get a room with a private bath that go for 260 Euros a night, then I think this hotel could be nice. For us with a standard room with a shared bathroom, I would have to pass next time.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great central location - once you find it!”", "Author": "Karen7", "ReviewID": "UR5834925", "Content": "We had a great time at the Scandinavia, highly recommended! Due to a delayed flight, we arrived exhausted at 1am but the night clerk was friendly and helpful. The room was spacious and well furnished, and breakfast good the next day. This is great value for central Venice, though there's rarely bargains to be had in this city! Only drawback is finding it - Venice is a maze so prepare to get lost and just go with it. We were grateful that as the hotel is in a big square, we had a better chance of finding it than the hotels down the numerous identical medieval alleyways and dead ends! A truly magical city and great to wander in at night - so atmospheric.", "Date": "September 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brussels", "Title": "“Mixed experience”", "Author": "LOLBee", "ReviewID": "UR5829270", "Content": "I spent five days at the hotel Scandinavia, and it wasn't terrible, but it certainly didn't merit 3 stars. Positives: good location, pleasant staff. Negatives: no elevator, and I was on the 5th floor (4th in European system). When I complained, I was given a room on the 4th floor. Both rooms were quite small, but clean. The shower in the room I ended up in had the disconcerting habit of changing temperature every two minutes. Breakfast buffet was particularly disappointing. Some cereal, yogourt, croissants. Outside the door was a fruit-stand with beautiful fresh fruit, but our buffet, every day, had nothing but a bowl of canned fruit cocktail. I expect better than that for a room that cost me 190 euros a night. Also, be prepared. Unless you want to spend a lot of money, you will need to take the vaporetto. The hotel's website says 5 minutes to the hotel. It took at least 10 for me, and you need to carry your bags up and down the stairs of 3 bridges to get there. Fortunately, friendly people saw I was having trouble and helped.", "Date": "September 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cornwall, UK", "Title": "“Lovely hotel, great location”", "Author": "happylady2", "ReviewID": "UR5612359", "Content": "Was slightly concerned after reading some of the previous reviews, but we had no need to worry! The location is superb; our room (No.1) overlooked the square, which was lovely. The room itself was clean, with a perfectly adequate en-suite, fridge, good air con and TV. We were given a map on arrival, and told of the various vaperatto stops for different excursions. The reception staff were fantastic - very friendly and extremely helpful as we were due to fly home a couple of days after the terrorist scare at Heathrow, and they checked by phone and Internet that our flight would be going for us. Breakfast was light - but everything was there that we needed. A lovely little drinking area is outside the hotel and you can watch the world go by. It really is a great location to reach all the sights of Venice. Only a few minutes walk from virtually everywhere. If we go back to Venice, I would definitely stay here again.", "Date": "August 15, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicestershire, England", "Title": "“Fabulous as always”", "Author": "LaDuchess", "ReviewID": "UR5579754", "Content": "I've been visiting Venice a couple of times a year for the last 5 years and this is where I always stay. The location is great - a few minutes walk each from St Mark's and the Rialto. However it's away from the main tourist areas so not horribly crowded. If you get a room on the front or side, you can look out over Campo Santa Maria Formosa and watch the world go by. The rooms are not luxurious (although some are fabulous with carved ceilings etc) but are clean and functional. There is no lift but the reception staff (who are there every year!) always offer to carry my case up and run away before I can tip them. Breakfast is simple - help yourself buffet with hot drinks, juice, cereal, croissants. It's served in the front room on the ground floor which can be a little crowded if the hotel is full but you can take it to your room or sit at the tables outside in the campo. This isn't a luxury hotel but why would you want one when the most fabulous city in the world is outside the front door?", "Date": "August 9, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester. England", "Title": "“Great location and good value”", "Author": "JoeKilroy", "ReviewID": "UR5558773", "Content": "Well located on picturesque square. Stayed here twice, 20 July to 23 July 2006and then on 30 July 2006. First room on top floor. No lift. Heavy bags but carried up by reception staff. Many thanks. Air con was superb. Last stay on 30 July. Stayed in first floor room with a view again with air con. Breakfast was continental but perfectly adequate. I have read reviews mentioning \" mosquitos Never bitten. Someone mentioned smells and animal excrement in the square. I don 't doubt them but we had no problems at all. Square was very pleasant. Staff were very helpful and friendly. All reception staff spoke excellent English. Where will I stay on my next trip to Venice? Hotel Tulip Scandinavia without a doubt . Great value for the money.", "Date": "August 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Sussex, England", "Title": "“Great location”", "Author": "Willowchilla", "ReviewID": "UR5420107", "Content": "Stayed here for a couple of nights on a short visit to Venice in November. Had read previous reviews which weren't too favourable but wasn't put off. Brilliant location, in a pretty piazza just a few minutes to San Marco. The room (one of the attic ones) was clean and comfortable, however it was very cold as they never turned the heating on until late evening - no temp control in the room for this. The hotel was a bit shabby around the edges but in my opinion this just added to its character. Great value for money.", "Date": "July 3, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Small dark Hole”", "Author": "A TripAdvisor Member", "ReviewID": "UR5323344", "Content": "Family Three stayed 25/5 to 26/5/06. This Hotel is a so called 3 stars which is beyond comprehension. We stayed on the 3rd floor no lift in this place in a room about 10feet X 10feet again mozzie infested but they do give you mossie zappas that smell awful. The bathroom/shower also makes a terrible noise each time you use the water. The Hotel is in a square that smells terrible with animal droppings everywhere.", "Date": "June 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Barnstaple UK", "Title": "“WHAT A GEM”", "Author": "A TripAdvisor Member", "ReviewID": "UR4523899", "Content": "Like everyone booking on the Internet, we were apprehensive, but what a find! Yes it's quite small but for the 5 days we were there, could not fault it. Rooms were clean, well kept, staff polite and helpful. Breakfast - the usual continental selection. The hotel is in a perfect position for seeing the city. For the price we paid - great value.", "Date": "February 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Malta", "Title": "“Small but nice”", "Author": "Melitensia", "ReviewID": "UR4241779", "Content": "Have just returned from Venice and I must admit I was a bit apprehensive about staying at this hotel due to some of the negative reviews on this site, but I should not have worried. It is fairly easy to find (even at 11.00 pm at night), quite central (four/five minutes from San Marco and two minutes from Rialto)and the Campo it is in is elegant. The hotel looks shabby but the room we had was quite roomy and clean as was the bathroom (shower). B'kast was basic but good, everything very fresh especially the warm croisants. The staff was quite helpful as well. Pricewise not too expensive considering that this is Venice (I had paid much more in London). We were also lucky that the weather was beautiful, blue skies and sun, although very cold.", "Date": "December 14, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Studio City, CA", "Title": "“Very Cute Hotel”", "Author": "Cathy0055", "ReviewID": "UR4146069", "Content": "I loved this hotel. It was our first stop in Italy and we were so happy. just a tiny place but the front desk all knew us and were happy to show us how to get around. The hotel is in the maze of streets a bit but really once you figure it out, only 5 minutes from the Rialto and 5 minutes the other way to St. Marks Square. The breakfast was basic but good, and the Campo it was in was quaint and great. The rooms were big by the standards I expected. Its not the Ritz or an American Marriot. Its more on par with a traditional Venetian experience which is what we wanted. Big thumbs up.", "Date": "November 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Stafford", "Title": "“Oct 14-17 2005”", "Author": "Carol3054", "ReviewID": "UR4044307", "Content": "We found this hotel ideally situated close to Saint Marcs Square and Rialto Bridge. The hotel was very comfortable and our room was very clean. The breakfast was good. Would stay there again. The only downside was we got bitten by mosquito's in our room. Need to take mosquito repellent with you.", "Date": "October 22, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Lowell, Arkansas", "Title": "“Weak Italian Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3943032", "Content": "Four flights of stairs (no elevator), light fixtures that don't work, small space -- not enough to stretch out and do a yoga routine. This was rated a \"3\" out of \"5\", but it was really a \"2\". Be careful of Internet pictures and descriptions, and ask about elevators. Americans on tour get shorted on these rooms.", "Date": "September 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Excellent hotel !!!”", "Author": "Johra", "ReviewID": "UR3318593", "Content": "We've just got back from Venice. We stayed in hotel Scandinavia and I have to say it was absolute fabulous! The hotel couldn't be on a better location: only a 5 minutes walk from the Piazza San Marco and the Rialto bridge. The hotel is located on a very charming square (S. Maria de formosa), not too crowded with tourists. And we had a room with a view, nr. 24 (I did send an e-mail to the hotel in advance to ask if it was possible to get the room with a view... and we were very lucky)! The rooms where a little bit old but charming, venetian style (the way it should be in Venice) with a very clean bathroom (wc, douche,...) Breakfast was very nice: croissant, fruits, yoghurt, cake,... The staff very friendly, always ready to answer your questions. I would definitely recommend this hotel to everyone !", "Date": "April 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "BOSTON, MA", "Title": "“nice stay in venice”", "Author": "A TripAdvisor Member", "ReviewID": "UR3295854", "Content": "I stayed in scandinavia hotel for five days in March 05. The location is great as it is located in the piazza of Santa Maria Formosa which is always full of life. It is a short walk to both the Rialto and San Marco. The staff was very helpful when it came to giving directions to attractions and even arranged day trips for us to Murano and Lido. They even gave us helpful tips for finding good nightspots. Overall the room was nice and always kept clean. And the breakfast every morning was always pleasant as you can eat out on the piazza and take in the beautiful like of venice.", "Date": "March 23, 2005"}], "HotelInfo": {"Name": "Hotel Scandinavia", "HotelURL": "/ShowUserReviews-g187870-d472033-Reviews-Hotel_Scandinavia-Venice_Veneto.html", "Price": "$142 - $266*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Campo Santa Maria Formosa, Castello 5240</span>, <span class=\"locality\"><span property=\"v:postal-code\">30100</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "472033", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/97/46/97469182e6ec3d922ca085087942dcb35large.jpg"}}