{"Reviews": [{"Content": "Better than these reviews After reading these various reviews, I was thinking that I stayed at a different Barclay Hotel. The hotel I stayed at was more than I expected. The room was larger than expected with a foldout couch; very spacious area to set up luggage and tv to watch from bed. The bathrooms and linens were clean  we received extra towels when asked. The neighborhood is nice in the daylight, but not for children to walk around at night. All in all, I'd stay here again. The staff was also very friendly!", "Date": "Apr 29, 2007", "ReviewID": "UR586931356", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "chihai89"}, {"Content": "Worst accomodation I have ever stayed in I stayed in The Barclay Hotel, Sydney in December 2006 for a week and couldnt wait to get out. The whole building is falling apart with damp, slugs were living in the walls of our room  I got a chest infection within 2 days of staying there, on day 4 I asked to move because the smell of the room was keeping me awake at night, the staff were helpful but insisted that they did not have similar complaints ffom other guests (very hard to believe) and moved us to a different room, it was an improvement but not by much. The bedlinen and bathrooms were clean but everything else was awful. Our room cost 3* hotel prices but I have stayed in $20 hostels in Australia that were far superior to this place. I have no idea how this hotel got a 3* rating, its Awful, dont stay there, it ruined my stay in Sydney.", "Date": "Mar 15, 2007", "ReviewID": "UR574386268", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "enol"}, {"Content": "Anyone who is shotlisting hotel stay in Sydney, keep this out of your choice I had a very very bad experience stay in this hotel last dec. Right now I am filing a claim against them from Dep. of Fair Trade.I shall not disclose the content of my complaint, but please don't choice this hotel because of it price or location, you can get a much better hotel nearer to the city at a bit of higher price, but I can assure you its all wotrh it, because this hotels really turn anyone off. The service, the condition of accomodation, the rules and regulation they have for the guest.Unless you want a bad experience stay where you cant wait to check out or go back to the hotel as late as possible every night for a sleep and wake up the next morning, quicking get out; DO NOT BOOK THIS HOTEL!!!!!!!!!YOU WILL REGRET IT!!!!", "Date": "Feb 2, 2007", "ReviewID": "UR443252727", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "NothingbutTruth"}, {"Content": "budget hotel A budget hotel, staff were very friendly and helpful. Room was very clean and was above average for the price. Though is in a noisy part of Kings Cross for the budget traveller it is good value.", "Date": "Sep 19, 2006", "ReviewID": "UR709951703", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "loder59"}, {"Content": "Absolutely Disgusting!!! My husband together with my 2 kids stayed in this hotel last April 2004. We were supposed to stay for 6 days but we decided to cut it short by 3 days. When we checked in, we were given a room at the back with a view of an abandoned building next door. The shower stall had a small dead cockroach in it. The walls in the bathroom as well as in the room were moldy. The airconditioning were very noisy.The room smelled pretty bad.The beds were filthy with hairs in the middle of the bed.. We requested to be transferred to another room and was given a room further than the first room. The room wasn't much of an improvement from the first room that we got. The walls were still moldy and some parts were peeling. The bathroom smelled awful. The room smelled musty.The linens were still dirty with hairs as well. Although the frontdesk staff were helpful and friendly, I could not say the same with the cleaning staff. They were very rude and unsanitary. On our way out of our room on the 2nd day of our stay, I caught one of the cleaning maids sitting on the bed of the next room and wiping her feet with the blanket. After wiping her feet, she placed the blanket back on the bed and proceeded with her cleaning. The couple staying on the next room was an elderly from America. That's when we decided to look for another hotel.This is definitely not a 3 star hotel. Health officers should look into the condition of the hotel. Upto this day, I still feel nauseated every time I think of our stay there. Our vacation was almost ruined because of this hotel. Every time I think of Sydney, I think of our horrifying stay at Barclay.", "Date": "Mar 2, 2006", "ReviewID": "UR431685351", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Don't go there Worst hotel I ever experienced (and this was part of my world trip)! Not a 3 star hotel!!! Very noisy area (red light district). Just don't go there. It's not worth the money!", "Date": "Sep 15, 2005", "ReviewID": "UR604147103", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "more than i was expected I recently stayed in barclay hotel , 2 weeks ago,and i have to admit that the hotel was more than i was expected..great location, 10 min walk from sydney city centre ..professional and helful staff (the one with american roots was amazing)..very clean room ...i personally work in this business so my review about staying in this hotel is very high.......the location is on the red zone but it's fun anyway..not dangerous at all", "Date": "Jan 29, 2005", "ReviewID": "UR263915510", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not a 3 star The advertising for this hotel was quite misleading. The staff was accomodating, but not overly helpful. The area is seedy, and some of the residents seem a little strange. Its quite a distance from the exciting areas of downtown. When we ended up getting a room in a stairwell, we immediataly went back to our booking company at the airport and had it changed. I would call it a 2 1/2 star at best by North American standards. Definately not a 3 star as advertised.", "Date": "Dec 28, 2003", "ReviewID": "UR569647056", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "绶忓悎銇欍倠銇ㄨ壇銇勩儧銉嗐儷銇с仚銆?#x201d;   showReview(19884755, 'full');", "Date": "Dec 7, 2006", "ReviewID": "UR744111271", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Assez de莽u   showReview(11371290, 'full');", "Date": "Oct 15, 2006", "ReviewID": "UR105039844", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g255060-d472217-r7480360-Leisure_Inns_Barclay_Sydney-Sydney_New_South_Wales.html", "HotelID": "472217", "Price": "$85"}}