{"Reviews": [{"Content": "Good land, good intentions but get the Gordon Ramsey of Hoteling to help I stayed at the Gazebo with my familly for 4 nights. It is on prime land in Sanur extending from the shopping strip to the beach. We went there because our driver said it was good (he has been used by our extended familly of 20+ yrs and isn't connected to Sanur) so he was being genuine.The staff - as usual - are well meaning and friendly but whoever operates it hasn't a clue. Given the wealth of artistic ability and the precedents for great hotels (some almost neighbouring this property) it is a wonder that it ends up the way it is. Beautiful bonsais in pots are then lifted onto breeze blocks, hoses and equipment is left out, shiny white tiles cover the outdoor restaurant allowing for an ice skating effect from pool to beach, Internal toilets in rooms with poor ventilation, masseur onsite hassling guest!!, dark corridors, drab food, etc... etc... It has huge potential but needs to have a skilled team to get that potential out - hire a hotel consultant or sell.This review is based on the fact that the listed price was US$130, we paid US$80. If it was US$40 then it would be a fair deal for this type of place and I wouldnt write a review.", "Date": "Dec 29, 2008", "ReviewID": "UR839277902", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "4"}, "Author": "sunshiny_8"}, {"Content": "Faded Glory We really liked the Gazebo, and would stay there again, but there are some things which need improving, and some aspects which are advertised that actually do not exist there. Our first room, 216, was really not up to the standard we were expecting, with the pipes below the bathroom sink leaking, and the toilet seat very loose. However, we brought this to the attention of the engineers and it was fixed within a couple of hours. The room was tired, and clearly had not had any maintenance for some time. Our second room, 304, was much nicer and that was the standard I would expect. When we were there, the hotel was very quiet as the Bali bombers had just been executed and the travel warnings were dire. Despite this, people were not put into the best rooms available, which surprised me.All rooms had a fridge and TV, but we weren't watching much anyway. We never did see one of the pools featured in the ad and the bakery is no longer there. We also didn't encounter any entertainment in the bar or restaurant.I wanted to book extra days, but since the manager was very inflexible on price ($US 60-65), even though they were under booked, I elected to stay at Swastika Bungalows.Having said all that, the garden setting at Gazebo was lovely, the pool is nice and the staff are absolutely lovely. Dika, the wood carver, is wonderful, and will patiently and carefully teach you or your children woodcarving techniques. Rani worked hard to help me with airline reservations, and they allowed us a late checkout at 9pm, when we had only paid until 6. Warta and Made helped me find an excellent tailor. Poolside massage, pedicures and manicures at no more than you would pay on the beach was a plus, and we enjoyed the food, particularly the breakfasts.If management were a little bit more flexible and started maintaining the rooms they have instead of building new ones, they could restore this hotel to its former glory so it is once again excellent value for money.", "Date": "Dec 21, 2008", "ReviewID": "UR729504412", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "SweetOtter"}, {"Content": "Gazebo was just okay While the Gazebo was on the beach, we found the overall premises to be somewhat rundown, could hear our neighbors in the next room, breakfast was mediocre and we were in the path of mosquito spraying. However the staff and location were quite nice, and the room was large. Sorry to say, it just had a strange vibe to us.", "Date": "Dec 1, 2008", "ReviewID": "UR648932854", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "Hpadove"}, {"Content": "Old style bungalow charm       Two storey bungalow", "Date": "Sep 3, 2007", "ReviewID": "UR269638495", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Sioseeker"}, {"Content": "Great Hotel After looking around Sanur (I booked one night at a hotel then wandered along the beach strip and went into different hotels), I chose Gazebo for my family. We had a lovely free standing little cottage of 2 bedrooms and 2 bathrooms. Balcony out front looking onto a lovely garden. There was also a courtyard off the main bedroom with a shower, a line to hang washing, and space to lie down and sunbathe if you wanted privacy.Both rooms came with small fridge, TV (though only 2 international channels: CNN and HBO plus an assortment of Indonesian channels), couch, lounger, desk, coffee table, chairs. The rooms have a connecting door in between using two doors thus allowing either side to lock their door if they want to. However, the second room also has its own entrance and balcony on the side. There are two single beds in the second room plus a couch which can also serve as a third bed. The beds were comfortable, and the children slept well. Both bathrooms were clean, large and the bathroom for the main bedroom was bright and sunny as it had sliding doors opening out to the private courtyard. There are heaps of different rooms available at Gazebo. Reception was happy to show me around and look at the different configurations. Some lovely large suites, smaller rooms, cottages and upstairs downstairs type rooms. I found that by walking in and discussing it a bit we got an excellent rate with them, US$75.00 per night for the entire cottage including breakfast. Very good value for a family. Breakfast was included and while simple was filling and tasty. One of the managers told me it was popular with Australians thus on the menu they had some dishes that would suit. They serve imported Aussie sirloin which was just brilliant, one of the best I've had in Indonesia, 300 grams for just US$6.00. Fish and chips however, were disappointing. Cocktails etc are reasonably priced, and sitting around the bar watching the sea is a nice way to spend a couple of hours. Beer is cold and while service at times was a bit slow, they were all very friendly. We found that the food was reasonably priced thus had a number of meals there and just kept a running tab paid on the last day making it easier to not have to carry around cash. For sheer indulgence food however, walk along the beach to the Beach Cafe. Excellent food, gourmet quality, beautifully presented. Jugs of Heineken only US$5.00! The gardens were a bit overgrown when we arrived, but it may have been because of the low season but in the last two days we were there gardeners were out busy tidying them all up, probably in preparation for high season which starts at the beginning of July. The pools were great, a small one safe for young children, a larger deeper one for the adults, and a third one set back on the property for those wanting a quieter swim. The gym was disused and neglected. Equipment was mostly broken and it obviously had been left for quite some time. A pity as it would have been nice to have a workout. Books in the cabinets were mostly in German etc, very few in English thus I would advise either bringing your own or wander up to the main road in front of Gazebo and along a bit. There are a few bookstores dealing in seconds with reasonable prices. The tide goes out in the afternoon making the beach a delightful place for our young children to splash about, find crabs, watch small schools of fish up close, go shell hunting, build water pools and sandcastles. For a young family, I truly believe Sanur is one of the best spots. It鈥檚 safe, calm, and peaceful and there are enough restaurants for the parents to get out and enjoy in the evenings. Gazebo is well placed, away from the crowded end, just a short three minute walk to Circle K, a small but handy shop selling everything from toothpaste to hotdogs. Overall, we found Gazebo to be an excellent hotel for our family. Highly recommended.", "Date": "Jul 1, 2007", "ReviewID": "UR812297691", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Aussiexpat"}, {"Content": "Great Location Booked this hotel with Bali-Discovery.com for a good price ($52USD inc breakfast per night). Upon arrival we were presented with welcome drinks and garland of flowers. There are many different types of rooms in the hotel, we opted for a split level Mezzanine room. Downstairs is a seating area and fridge, wardrobe (with plenty of hangers) and dressing table with mirror, and a large bathroom with walk in shower and wooden sink. Upstairs was a king size bed, single bed, TV, another fridge, air con, and small balcony. The TV only showed 2 english channels (CNN and HBO) but we weren't there to watch TV. Bed was very firm, as were the pillows. The floor was a bit creaky if you had to get up in the middle of the night, as everything was made of wood. Good size room for the price. Safety deposit box was provided at reception free of charge.Two pools (plus childrens pool), a garden and beach pool. Both were quiet and didn't have any problem getting a sunbed. Beach/pool towels provided free of charge. There are a number of sunbeds on the beach right outside the hotel for use by guests. Pool was good size. Next to the beach pool was a small massage shack where you can get a 30 min Balinese massage for 30000Rp, or manicure/pedicure for 35000Rp.Restaurant and Bar areas overlooked the beach, and the bar was quite cheap for drinks, with occasional live music on a night time. Only really ate breakfast in the restaurant; all breakfasts are Halal so no pork products, but a reasonable choice, with some lovely fresh fruits, juices, tea/coffee (with regular top-ups), and cooked breakfasts (eggs, nasi goreng, nasi lemak, bakmi goreng, french toast, pancakes, croissant). A good choice of restaurants/bars in the immediate vicinity, both on the beach and on the main road Jalan Danau Tamblingan.The hotel provided free afternoon tea/coffee between 4-5pm at the Gazebo Bakery, although we didn't try this. There are also a couple of small libraries in the hotel containing books left by previous guests. There's a small fitness room, and pleasant gardens. Bungalow rooms looked pleasant; some of the older looking ones looked like they may be dark, with small high windows, but looks like there were some new ones with large windows and great balconies looking onto the gardens (Rooms 206-210 looked like they were new).Transfer to the airport took about 30 mins from the hotel using a driver we got talking to on beach - cost was 70000Rp (cheaper than the taxis).Overall a good 3 star hotel in a great location.", "Date": "May 20, 2007", "ReviewID": "UR559888115", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "Happynoodleboy_uk"}, {"Content": "Sympathetic Bali Stayed here when traveling with a group of people after a wedding in Indonesia, including the bride and groom. The bride picked it out, who is Indonesian. The value is good and the place felt authentic.There is a very lush interior yard (pictured below). I liked it because it was very easy going and the hotel staff were very, very nice and happy to see us. It is quiet there like a reviewer said.The location is good, there is some beachfront where the hotel has a bar and dining area. The breakfast food and selection is good, western style and Indonesian. The service was very gracious.  Along the beach where there are small restaurants and a convenience store, all nicely laid out.", "Date": "Apr 20, 2007", "ReviewID": "UR217697120", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "TMD3453"}, {"Content": "relaxing stopover       Our upgrade suite.", "Date": "Dec 27, 2005", "ReviewID": "UR947733792", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Ok Nice lttle hotel in Sanur right on the beach rooms very basic.Food ok easy to walk to some good restaurants down the beach very cheap.Not a place to stay for a week but good as a stop over hotel.Had problems with the pool very cloudy.Value for money", "Date": "Mar 13, 2005", "ReviewID": "UR370462997", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "t2311ps"}, {"Content": "銈偧銉溿儞銉笺儊銉涖儐銉?#x201d;   showReview(19169545, 'full');", "Date": "Mar 16, 2008", "ReviewID": "UR433975055", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "鍙ゃ亜銇с仚銇岃惤銇＄潃銇勩仸瀹夊叏   showReview(19163101, 'full');", "Date": "Aug 12, 2007", "ReviewID": "UR236190573", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈傘亞灏戙仐娓呮綌鎰熴亴銉涖偡銈ゃ€?#x201d;   showReview(19161479, 'full');", "Date": "Jun 20, 2007", "ReviewID": "UR290681318", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "娉娿伨銈嬨仾銈夈儭銈俱儘銉冦儓   showReview(19161400, 'full');", "Date": "Jun 15, 2007", "ReviewID": "UR735498204", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈广偪銉冦儠銈傛皸銇曘亸銇с€佸椋熴伀銈備究鍒┿仾銉涖儐銉?#x201d;   showReview(19159920, 'full');", "Date": "Jan 9, 2007", "ReviewID": "UR361379411", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銇倱銇炽倞銇椼伨銇椼仧   showReview(19159834, 'full');", "Date": "Jan 5, 2007", "ReviewID": "UR416191890", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈点儗銉笺儷銇ц秴銇婂嫥銈?   showReview(19929634, 'full');", "Date": "Feb 8, 2005", "ReviewID": "UR535119546", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銉愩儶宄躲伀銇傘倞銇屻仭銇?..   showReview(19916944, 'full');", "Date": "Feb 9, 2003", "ReviewID": "UR158564208", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297700-d479529-r23085642-Gazebo_Beach_Hotel-Sanur_Bali.html", "HotelID": "479529", "Price": "Unkonwn"}}