{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Pleasant stay”", "Author": "Susan S", "ReviewID": "UR127455909", "Content": "Unlike the previous guest we had a room in an annexe adjoining the hotel. Access to reception was gained by ringing a bell. No balcony, a small room and the shower was temperamental in the morning but fine at night, however it was clean, modern and the bed was big and comfortable. Staff were helpful and the breakfast was good with several choices. Overall, I'd say this was 3 star and not 4. It is no more than a 10 minutes walk to Cornelia Metro and if you buy your ticket from the newsstand across from the hotel it saves time in the station. Line A closes at 9.00pm so staying in the City Centre means you are dependent on taxis. Beware of unscrupulous taxi drivers. The set fee of €30 from the airport is to the city centre, not Via Aurelia. There is a surcharge after 10pm so even after agreeing a price at the airport our driver wanted much more than the agreed fee. On the return journey to the airport I recommend taking the bus from Termini station. It is only a 20 minutes journey. As long as you don't mind being on the outskirts I'd recommend this hotel.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chelmsford, United Kingdom", "Title": "“OUR INTRODUCTION TO ROME”", "Author": "alastair m", "ReviewID": "UR127074624", "Content": "We arrived at the hotel and thought we had been upgraded ,but learnt that our room with private patio size balcony was indeed ours. Five star quality at three star prices.We urge all to try this jewel in the crown in Rome", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Baumholder, Germany", "Title": "“So worth it, we loved it & hope to go back again!”", "Author": "Gaither2010", "ReviewID": "UR120927197", "Content": "I have worked in hotels for 16 years, started out housekeepering in a Comfort Inn & worked up to management in a Four Diamond, JD Powers awarded hotel, so I can say I have seen it all & heard every hotel complaint in the boom! I always go in with the worst expectations. You know prepare myself for the worst, but I was pleasantly surprised! Staff was cordial, not over polite. They were efficient. Only ONE problem entire three nights, when we asked for the directions to the closest Metro. We were told go right about ten minutes, you can't miss it! Wrong! Go right from hotel cross street walk about ten minutes & turn left @ the McDonals, Metro is two blocks up! Thats it my only issue & I am a super picky person. If you are not prepared to use public transportation, pick another hotel closer to town.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Zlin, Czech Republic", "Title": "“Really pleasant stay”", "Author": "Roman813", "ReviewID": "UR119967444", "Content": "I stayed at this hotel for 5 nights, because of the big world-conference, which was organized in the nearby Ergife Palace Hotel. This hotel is located near a busy street Via Aureliano, but I did not hear any bigger noise during the night. Rooms are very modern, clean, well equipped. I had a room at the highest floor (I guess) with lovely terrace and with garden table and swing, and of course with the great view. (see photos) Breakfast is rich and tasty (for Italy), staff was friendly and helpful, they always helped me with the busses, metro, sightseeing plans etc. Teh location of this hotel is more suitable for business purposes, so you simply do not care, that you stay 20 minutes of walk or short journey of bus No. 246 or 247 (stop 50m from hotel) to Cornelia metro station (Linea A) or Bus 916 to Pza. Venezia. Or if you looking for a safe location out of busy city centre or Termini area, it is a good choice. This hotel is also a good choice for those who travels by car, because Via Aurelia is easy accessible by car, and you do not have to be worry, you lose nerves in traffic jams in central Rome. There is a great traditional restaurant just across the street, or Pizzeria (Pizza Bar) 100m from the hotel. The big supermarket (In Grande) is located near Cornelia metro station. The hotel offers a free Wi-Fi service. In conclusion, it was a pleasant stay there.", "Date": "October 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Service": "2"}, "AuthorLocation": "Salvador, BA", "Title": "“We'll never be back”", "Author": "SuzanaMD", "ReviewID": "UR116865703", "Content": "We've stayed at Hotel Aureliano only for 3 days but it was enough. Despite the room was clean and new, it was cramped and, the worst thing, outside the main building and the wi fi and phone wasn't working. One of the days, it was raining and we couldn't leave the room because of the water volume in front of our door. Besides, we cant say the staff were friendly, actually, sometimes they seemed to be very rude. The hotel is far from the metro station and there were few buses available and they were always crowded. It was not a good place to stay in Rome.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Hobart, Australia", "Title": "“A lovely little hotel”", "Author": "gotthetravelbug123", "ReviewID": "UR116698884", "Content": "My wife and I stayed here in May 2010 mostly because it was very close to another hotel where we were starting a tour and this was definitely the better of the two. We actually loved it. If you don't mind a 30-odd minute walk into central Rome then it's a great spot. We enjoyed being able to see a bit of suburban Rome before we stumbled across the Vatican and city central by foot. It's a well maintained building with a lot of character and the price was very reasonable. We found the staff very warm and helpful.", "Date": "August 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Thessaloniki", "Title": "“Pleasant Stay!”", "Author": "DespoinaThessaloniki", "ReviewID": "UR100845533", "Content": "Hotel Aureliano was clean, pleasant and convenient, although not a really 4 star hotel. The staff was helpful, but they could be more friendly (smile, say good morning). Cornelia metro station is 15 minutes away, but there is a bus station near the hotel (only 2 minutes away). Bus No 246 takes you to the metro and vice versa. We sent an email to the hotel to tell us ways to reach the hotel but no one told us about the bus. Also metro line A (the one that is for cornelia station) stops at 21:00 (except Saturdays) due to the construction of metro line c.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice hotel but too far from the city centre & metro”", "Author": "Ellane", "ReviewID": "UR76863707", "Content": "Firstly, the young guy at reception was very nice and helpful throughout our 5 day stay. I arrived in the middle of august with my parents an teenage daughter. The rooms were very nice with clean and had a bright clean bathroom. (Bit stingy on the toilet tissue though) We were very comfortable there. However i now realise the importance of having a swimming pool and restaurant facitilies in your hotel grounds. As we were there in the middle of august, its blazing hot and would of been nice to have the swimming pool to relax in in the evening. Not having a restuarant did cause us problems as we didnt particularly want to east pizza and pasta everyday of our stay. I am aware that that is an italian stable food, but being from London i am very use to multiculturalism and having a variety of foods and supermarkets to hand. The location of Hotel Aureliano is not the best as there wasnt much around apart from a mc d's near the metro station and a kebab shop also near the metro station which is roughly a 15 min walk. And in the sun with temps of 30c+ in the shade, it wasnt the easiest of things to do. Once you make it to the metro station (Cornelia) traveling to the centre of rome is quite easy. Buses are more tricker and we stuck to metroing it around For ease and convenience with parents who are getting on a bit i would not really recomment Hotel Aureliano as an ideal located hotel. If you dont mind staying out of the hussle and bussle then maybe this is for you. But if you want to be near to attractions and want to enjoy a night life nearer to the centre of Rome, then unfortunatley i can not recomend this hotel as nice as it is. Thats just my honest opinion", "Date": "August 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "5"}, "AuthorLocation": "Rovigo", "Title": "“disappointing for the second time”", "Author": "oneRovigo", "ReviewID": "UR31990967", "Content": "I returned for the second (last time) in this beautiful hotel ruined by management that does not exist except for a manager (tiziana Colucci), which is very far from the professionalism that makes even a simple receptionist, never come back here, i'm disaippointed because the hotel is remarkable and the only person truly professional on the desk is Riccardo", "Date": "June 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Diego", "Title": "“Out of the Way”", "Author": "stringman25", "ReviewID": "UR13264276", "Content": "If you are looking for a cheap hotel in Rome and don't mind a little inconvenience, this is the hotel for you. Although they advertise being close to the Metro line, it is really about a 10-15 minute walk. We knew this going in as I did extensive research, and although we didn't mind, it can be inconvenient. It is also towards the end of the metro line, several stops outside of most of the tourist attractions. This makes it difficult to stay out in the city until too late in the night as you can miss the last Metro and have to take an expensive cab ride. Also, you may not be comfortable walking 10 minutes in the dark at midnight. As far as the hotel is concerned, the staff was friendly and let us check in early. There was always at least one staff member at the front desk who spoke English. Breakfast was included in the price and we took advantage of it. It was mostly cereals and breads, but they also had yogurt and hard boiled eggs. The room was small, consistent with most European hotels. It was kept very clean and we had a small balcony that looked out towards the city. No complaints on service, cleanliness, etc... We would most likely not stay here again, but only because we would like to be in the heart of the city and experience all Rome has to offer after dark. We only paid about 110 US per night and so it was a good deal. Too much more than that and the inconvenience would definitely have outweighed the cost effectiveness.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Nice hotel”", "Author": "mfire2", "ReviewID": "UR8703076", "Content": "The hotel itself is very nice, clean, updated. The rooms were big and clean, also. It had restuarants close by and a definite plus, a bus stop right in front of it. The breakfast was very nice and had a huge selection of items. The people at the front desk were helpful, but it wouldnt hurt if they smiled a little more... If you are coming from the airport it is a good hour metro ride. You can take the airport express to termini and then pickup metro red line to cornelia stop. From Cornelia you can take bus 246 or 247, but you might need to tell the bus driver you want to get off at the stop near hotel aureliano or keep an eye on left side for the hotel, i believe it is 3rd stop from train station. A taxi from hotel to airport was 50 euros! We took the metro to the airport without any problems, just need extra time! Overall I would give it an 8, just cos i thought the people could have smiled a little more and the distance was a bit more than we wanted to travel. But overall great!", "Date": "September 12, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Staffordshire, England.", "Title": "“Ok hotel out of centre of Rome”", "Author": "hfry", "ReviewID": "UR8523261", "Content": "I stayed in this hotel in March 2005 the main problem I found was the location. In my opinion it's too far out of the centre of Rome for a relaxed sightseeing holiday. We booked our three night break last minute though Expedia and didn't do much planning or research before going which we regretted once we got to Rome and couldn't find the hotel. I only had the directions provided by the hotel and a guide book which weren't adequate not knowing Rome. We got the train from the airport to the Termini train station and then the metro to the Cornelia stop but then we couldn't find the bus stop and were lost so I had to go into a shop to ask for directions the shop owner called us a taxi but we ended up getting charged 15 euros to go round the corner! We paid it as we were so glad to get there but even if we had found the bus stop we still wouldn't have known where to get off the bus as the hotel does not have much of a sign outside and it's on a busy main road. I found the hotel itself to be ok, our room was clean and the bathroom was fine we also had two double beds in our twin room which was good. The breakfast was good and there was a lot of variety but the concierge wasn't very helpful. It's freezing at night in March in Rome and we couldn't figure out how to turn up the heating but asking the concierge seemed like it'd be more trouble than it was worth. I don't know if he didn't speak much English or had an attitude problem but he wasn't very helpful. The nearest restaurant to the hotel is a chinese, when we asked for a recommendation for a good restaurant we were given a bus map and told to get three buses to the La Trastavere area! We tried it but it was complicated and nerveracking, La Trastavere is a nice Covent Garden like area but two out of the three restaurants we ate in there weren't that good. We then had the problem of getting back to the hotel as we couldn't find any taxis and the buses stop running at midnight. We ended up having to get off the bus at the second bus change on the way back and walk about a mile to the hotel in the freezing cold this happened twice during our stay which really tried our patience. The area is urban and was fortunately pretty quiet but as we were two females in our twenties perhaps it was not the best suggestion by the concierge. On our last night we found the taxi rank in La Trastavere and were only charged 8 euros to the hotel! During the day time we got the bus to the Cornelia metro stop and the metro to the main sites which was ok. We had a good time in Rome despite the location of the hotel and soon became accomplished Rome public transport users. However I definitely would not stay at this hotel again or recommend it for sightseeing in Rome due to the location. I would not book flights and a hotel again through Expedia either. At the time we booked we thought our three night break was a bargain but we had interconnecting flights, flew into Rome Ciampino airport which is not the nearest airport to Rome and the location of this hotel was far from ideal. Given hindsight I think we should have checked the details more closely as I think it would be a lot cheaper to do some research and to book flights and hotel separately. I recently went to Venice for three nights and flew with Ryanair and stayed in a really central hotel that was lovely which I booked separtely and paid less in high season than for the break in Rome in low season.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Norfolk, VA", "Title": "“Very Accomadating”", "Author": "l0vet0travel2007", "ReviewID": "UR7924639", "Content": "We stayed at this hotel upon arriving in Rome for a three night stay. Once we arrived at the hotel, the staff was very courteous and helpful and everyone spoke at least a little bit of English. The rooms were quite small but no different than many other hotels we stayed at in Italy. The staff was great to recommend restaurants to eat at, help with directions, and arranged for taxi service for us when we needed one. The bus stop was right outside the door of the hotel and there was a metro stop a short walking distance up the street. We never felt unsafe walking to and from the metro station to the hotel. We were always just a short metro ride away from anywhere in the city. We would definitely recommend this hotel to anyone traveling to Rome that wants to stay a little outside of the city.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cork, Ireland", "Title": "“Enjoyed the stay.”", "Author": "CorkBarry", "ReviewID": "UR7434989", "Content": "Stayed here in March. The room was quite nice with a nice balcony. The location is not very central, but the advantage to that was the price of drink and food, In comparison to city centre, the prices in the bars and restaurants were pretty reasonable. Loved Rome but hated the rip off culture there.", "Date": "April 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich", "Title": "“good quality-price deal”", "Author": "NatBo", "ReviewID": "UR6902041", "Content": "stayed 3 nights there in 2005. a walk distance from the nearest metro station. very satisfied with the hotel, everything perfectly clean and new, nice view, balkony. breakfast was very good.", "Date": "March 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Juneau, Alaska", "Title": "“Nice breakfast here!”", "Author": "LWL", "ReviewID": "UR6053778", "Content": "Our group of three stayed here 4 nights in early October, 2006. The day we arrived in Italy, the hotel was being transferred from one owner to another. The management declined our request for early check-in but during the rest of our stay they were generally accomodating to our needs. Wireless internet, though advertised, was not available. The hotel is close to several eating places and it's about a 15 minute walk to the nearest metro stop. Room decor is attractive; single rooms are more spacious than doubles but the single beds are small. The cooling/heating system worked fine, the rooms were quiet, and there were plenty of outlets. The bathroom was spacious with plenty of hot water and pressure. The shower stalls are small and there is no shelf, so don't drop your soap! In our month of travel throughout Italy, we found this hotel had one of the best breakfast offerings. The coffee was good and plentiful and each day the breakfast buffet included different foods. We would certainly recommend the restaurant for dinner. TIP: window screens are generally not used in Italy, so if you want some fresh air be prepared to deal with a few flies and mosquitoes.", "Date": "November 3, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "london", "Title": "“is there a manager??”", "Author": "gandalf73", "ReviewID": "UR5877649", "Content": "i decided to stay in this hotel for the cheap offers i've found, once i got there and entered the room it smelled of dead animal i asked to change the room but they refused to give me another one then i asked to talk to the manager and after three days of hiding in the back office i manage to talk to him and guess what, he doesn't even speak english( unbelivable for a 4 star hotel) and when i asked again to change the room he told me that if i didn't like the room i could go somewhere else and that i'll never get a refund for that. by the end of the day i'll never go back to hotel aureliano and i'll tell all my friends not to go there too and of course to all those people that'll read this review", "Date": "September 26, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Cheltenham, England", "Title": "“Do not stay here!!”", "Author": "Peteyestefa", "ReviewID": "UR5771993", "Content": "I have used TripAdvisor on many occassions and have often read critical reviews with a bit of sceptism, surely it cannot have been that bad. Well this hotel is. Let me clarify, it is not so much the hotel but the staff, who for want of a better word are a nightmare, talk about unhelpful. On arrival we were given a room down by the carpark, requiring us to take the fire exit from reception to get there. The room was very small but clean and modern - no problem. However, on asking for a second key card we were told 'no' we can only issue one, really helpful if you are returning to your room at different times. But for me is was not so much the fact that we could not have more than one key, but that the reception staff almost enjoyed being unhelpful. As I was attending a wedding on the Saturday I asked on Thursday for an iron, only to be told that they were not allowed in the hotel. On asking for a laundrette, I was eventually given directions which were clearly wrong. The breakfast was poor. We made a phone call to Spain for 6 minutes on our last day, and on checking out were presented with a bill for 35 euros, on complaining we eventually got the bill down to 17 euros. We checked out at 11am but our flight was not until 6pm so we wanted to leave our bags somewhere safe, the only option was in the corridor. We then went and brought a sandwhich as the restaraunt was shut, on returning to the reception we were asked to not eat the sandwhich in the hotel and instead had to sit outside next to the main road until we had finished. Honestly dont stay here.", "Date": "September 5, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "UK", "Title": "“okay hotel facilities, but terrible staff!!”", "Author": "julytraveller", "ReviewID": "UR5506130", "Content": "I stayed in this hotel for 3 nites this july. The hotel itself is quite nice, good air-con, clean room (though not changing bedsheet every day), nice bathroom. But the service here is just terrible. I booked 2 rooms and were given 1 double room for i and my husband and 1 twin room for my mother and sister on different floors. As the construction site next to the hotel had its cribwork extended very close to the room window on the first floor, my mom feeled extremely unsecure so swap room with me. Thus we asked the staff if we could change for another double room on the next day. The guy there seem nice and polite and promised for the change and assured he would leave a message for the staff next day. We double check this when we left hotel in the morning and everything was fine. But when we got back, a lady manager Ms Tiziana Colucci's attitude was just terrible. She insisted that she never heard of anything nor see any message about our request, and that their rooms were fully booked so she could do nothing about that. When we told her we noticed her talking to 2 people searching for hotel saying 2 double rooms still available, she got annoyed and said whether they really have available rooms was another matter and her hotel never change room for customers because of these reasons. And also we didn't talk to her directly the day before(but she's not there?!) , so she's not responsible for the change. The funny thing is that she said she was the manager and the guy staff wasn't and had no right to say about changing room. But do they expect a customer to differentiate whether a staff have the responsibility of doing what? And is it expecting them to pass on a message among the staff so difficult? We said we would like to make a complaint and she said we have made advance payment to Hotels, so please complain to the agent, not her hotel! Interesting! Finally we never met the guy staff again and couldn't chase about the missing message. Actually not chaging room is not a big issue, but just the bad attitude of the staff can really ruin your stay. When checking out, we asked that lady manager if we can have our passport copy back (they made copy of passports of every person staying when check in, i doubt it's a normal policy?) But the answer was really funny: \"sorry, we have thrown away the copies already.\" She can explain it's hotel policy to keep the record, but 'throw them away\" before customer checking out? what can i say, funny. And our television got some sound problem and we notified the reception and they promised to take a look, but until we left, nothing happened. About the location, though there's 246 bus stop outside, but isn't that reliable, we once decided to walk after waiting for 45 mins. And the bus is extremely crowded, even after 8pm. Not recommended!!", "Date": "July 24, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Inflexible staff, strange policies”", "Author": "Rufino1969", "ReviewID": "UR5451762", "Content": "I stayed at the Hotel Aureliano because I had to attend a conference nearby, but I see absolutely no reason why anyone who is not constrained by necessity should stay here. Price? Unless you get a super discount rate, you can find something equal or better nearer the center of Rome. Location? It is in the outskirts of Rome, and you have a walk of about 10 minutes to the nearest metro station. The surroundings of the hotel are ugly and there is nothing worth seeing nearby. It's neither green nor urban. Amenities? The hotel has none: You get a room, a lobby, and a mediocre, charmless restaurant. But the worst was the inflexible, bizarre policies they seem to have. First of all, they required a 30% deposit that they actually charge! So, if you stay three days, they will charge you for one day whether you cancel a week in advance or not. To make matters worse, upon check-in they asked me to pay the full bill for all three days, before I even put my luggage in my room!!! If you are not a frequent traveller, let me tell you: This is highly unusual. Normally, hotels may take your credit card details to secure the reservation, but they do not actually charge you before they have provided the service. Most times, there is no penalty if you cancel at least a day or two in advance of your stay. But not this hotel!!! I don't know who they think they are, treating guests like suspects who may not pay their bills. This is bizarre and unwarranted. Needless to say, I quickly made arrangements to stay at the Hotel Locarno in the heart of Rome. More expensive, but much better service, location, and with normal policies!", "Date": "July 11, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Atlanta", "Title": "“Disappointing experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR4601348", "Content": "I believe this hotel should treat everyone regardless of race the same equal way. My wife and I made the reservation from the US. When we got to the hotel, we were required to sleep outside the hotel ( in a room reserved for some of the employees who have to spend the night over). When we spoke to the hotel representative, we were told that there was nothing they could do for us. My wife and I were to leave and get a room in a different hotel at our own expenses. I would not recommend this hotel to anybody, specially if you're not white.", "Date": "March 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“The concierge is the hidden gem”", "Author": "A TripAdvisor Member", "ReviewID": "UR4385048", "Content": "We have booked our stay in Rome via hotels. Hotel Aureliano was very good, nice clean rooms, parking within walking distance - a real value in Rome - a great breakfast in on-premises restaurant. However the real value was the concierge. He not only gave us great tips on what to see and how to get there, but also suggested several restaurants which were very good (doesn't mean expensive). It was a nice change from a tourist oriented food you find in a lot of places in Rome. We took his advice and in every instance it was very good. This is a seldom found value when making reservations on the web. Mark Schindler", "Date": "January 24, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Wigan, Lancs, UK.", "Title": "“Good hotel but on the outskirts of town”", "Author": "A TripAdvisor Member", "ReviewID": "UR3795224", "Content": "Having spent 4 nights here recently... Pros: - great value at £47 per double room per night (expedia) - friendly and helpful staff - very clean & modern rooms & bathrooms - reasonable breakfast - superb air conditioning Cons: - 10min brisk walk to nearest metro stop (Cornelia on Line A); this is not a pleasant experience with luggage in the heat. Get a taxi if you have luggage. - although the bathrooms are sparkling, the water temperature of the shower would alternate all the time, from cold to scalding. - we got trapped in the lift on arrival (!) and had to be let out by the receptionist. Thankfully this only happened once.", "Date": "August 21, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Give this one a miss”", "Author": "Nicifive", "ReviewID": "UR3724300", "Content": "We stayed in this place in April for 2 nights before we caught a cruise. We booked for 2 adults and 1 child through wotif. At 85 euro plus 10 for cot per night. When we arrived we were asked if we wanted to check the room as it would be very tight with a cot and we would be better with our son sleeping in the bed. We agreed and after travelling for 6 weeks had got used to occasional sharing with the 2 year old. We were a little disappointed that we weren't informed before we arrived. The room was very small even for just two people. We had other problems such as the metro being further the we were lead to believe before we booked, staff not knowing where sights were that we advertised by the hotel as things to do when staying with them. Our car was not parked in a secure area as advertised when booking. But it was close to the airport and easy to get to. The real problem came when we decided to stay there the night before we flew to Singapore. We decided to stay there as it was close to the airport and we would be arriving late and leaving early.We booked again through wotif.com. A few hours later we received a email from the hotel informing us that they didn't accept children sharing beds with parents. I was shocked as they had suggested it last time. We were also told we could not have a cot in the room for our child. They were just cancelling our booking. When I contacted wotif.com we were told that the hotel told them they could not have us in the room for Health and safety reasons. The story changed after I informed them that we had stayed with them before in the same room and booked through wotif. We were told that our money would be refunded with no charge but when the credit card company refuned the money it was less than what we had paid due to there charges and conversation rate. We had also made our travel plan from Venice to Rome based on the fact of where we were staying. So when they changed our plans it end up costing us an extra 200 euros. Also since we were travelling we didn't find out about the cancellation until 2 days later. One other note I would not recommend the chinese restuart next to the Hotel. Both my Husband and I got food poisioning. Luckily our son wasn't eating that dish as well.", "Date": "July 31, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, UK", "Title": "“Perfecto! :)”", "Author": "kristlosa", "ReviewID": "UR3557737", "Content": "My girlfriends and I stayed in this hotel for three nights and it was awsome! it is a little bit out of town, but the standard of the hotel was something really amazing. Rooms clean, air-conditioned, comfortable. And the breakfast? Feast in the morning!! Highly recommended, we will come back in the future, that is certain. PS the receptionist was nice too, a real flirt! ;-)", "Date": "June 15, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Krakow, Poland", "Title": "“The airconditioning sounds like the extractor fan in my kitchen!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3523523", "Content": "Ok, the Aureliano is a new hotel and on first appearances all seems fine, but there were a number of problems during our stay which definately but the hotel in the 3 star category and not 4th. First of all, whether it was our deal through wotif.com for 85 euros per night that has us relegated to the annexe down the side, I don't know but the rooms down there were miniscule. There was no bathtub as mentioned in the specs, and the shower was pathetic. No pressure and governed by usage from other residents - in other words, one minute it was hot the next cold. The loo wouldn't flush properly and no luxuries such as the bathrobe mentioned in the specs! The airconditioning sounded like my extractor fan in the kitchen and it was impossible to sleep with the thing on. When we callled someone from reception, they did oblige us with a visit, but after a brief inspection declared the noise level to be normal. I defy anyone to sleep in a 70+ dB racket! Breakfasts were average, uninspiring, if not poor. Coffee yuuk!! If I didn't know better, I'd say it was instant. For Italy that's sacrilege! The hotel is situated on a VERY busy road and the walk from the metro is sufficiently long to make it just a little too inconvenient in terms of location. Plus the Metro to that particular station closes at 9pm every night due to ongoing repairs to the line, so your'e forced to return home in the evening on the bus anyway. Don't bother choosing this hotel if you're after a quiet romantic spot in Rome. Hotel Aureliano is far from any of those. I've stayed in far better 3 star hotels with worse facilites and far more enjoyed the experience.", "Date": "June 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "2", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Great hotel for great price!”", "Author": "ovaltinemaster", "ReviewID": "UR3519017", "Content": "I read the wonderful reviews about this hotel and decided to try it out. Let's just say I wasn't disappointed. The hotel was modern, clean and comfortable. The rooms were adequate in size with all the furnishings expected for any decent hotel. The bathrooms seem newly renovated and most importantly CLEAN. The air conditioning was functioning and kept the room at the right temperature. The breakfast was great, with scrambled eggs and fresh fruits highlighting a wonderful meal. Do get there early as the eggs do run out quickly. The dining room staff were polite. Unfortunately there were a few short-comings. Some of the desk staff were rude and unhelpful, which seems to be common at Italian hotels. However, one of the more helpful staff did provide me with a great map of the city. There is no storage room to hold your luggage if you show up at the hotel earlier than the 2 pm check in time. They just told us to leave it at the hallway, and it was up to us whether to guard the luggage or to leave and to hope nobody else takes it. This hotel is a bit far from the Centre of Rome and gets a bit seedy at night, but it is about a 15 min walk to the Metro station. Overall though I had a wonderful stay at this hotel and if you don't mind travelling for a bit on the Metro to get the the centre of Rome, I would recommend it.", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Constanta, Romania", "Title": "“Excellent hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3517032", "Content": "The best place to stay in Rome! Quiet, very, very clean, nice wonderful personnel! We will come back!", "Date": "June 1, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR3459954", "Content": "The city of Rome of course is breathtaking and requires no comments other than you must go there. I cannot recommend the Hotel Aureliano highly enough in particular the staff and in particular one fantastic receptionist by the name of Barbara! The food was divine and in a city reknown for it's gastronomic wonders it was a amazing surprise to experience such brilliant hotel food. Brilliant", "Date": "May 11, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel”", "Author": "Nids", "ReviewID": "UR3458126", "Content": "We stayed at Hotel Aureliano recently for my birthday 8th May and I would certainly recommend this hotel to anyone and we'll certainly be staying there again. Ok the room we had wasnt spacious but it was spotlessly clean, very comfortable and a convenient location (5 min drive into Vatican City). If your looking for something traditionally Italian then dont stay here but if your looking for somewhere modern, clean and comfortable then I recommend it. The breakfast whilst not being awesome (as previously described) was substantial and the staff very helpful. One helpful hint, take your own travel adaptor as the hotel does not provide this. At the time of booking we had checked on Tripadvisor for reviews and at that time there was only one, which was extremely helpful, especially in advising of the website wotif - we paid 75 euros per night - bargain. So I hope this is helpful to anyone reading this - just one more thing enjoy Roma its bellisima!", "Date": "May 10, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Good price for 4*”", "Author": "DmitryS", "ReviewID": "UR3426182", "Content": "We stayed in this hotel for several days in April 2005, and I have mixed feeling about it. It's a good, four star hotel, with a very reasonable rates. It's clean, service is ok, and breakfast is kind of ok too. So, overall quality is good and I recomend this hotel to business traveler. (Though the hotel doesn't offer any type of internet connection.) From the other hand, I would not reccomend it if you are in Rome for vacation. You see that the hotel was renovated recently into a four star hotel, so it has all the things that are required for 4 stars hotel. But it doesn't have anything esle! It defenetely lacks some personal touch and you will not have any memories about your stay. I would choose some 3* hotel that is closer to the city center.", "Date": "April 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "VA", "Title": "“Very nice, conveniently located”", "Author": "CrazyBananarama", "ReviewID": "UR3414370", "Content": "Cheap and nice. Helpful staff. You can take the bus to the metro which takes a few mins or you can walk (10mins). for the price i will definitely go back there again. Free breakfast is also awesome.", "Date": "April 25, 2005"}], "HotelInfo": {"Name": "Hotel Aureliano", "HotelURL": "/ShowUserReviews-g187791-d482640-Reviews-Hotel_Aureliano-Rome_Lazio.html", "Price": "$73 - $1,253*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Aurelia, 619</span>, <span class=\"locality\"><span property=\"v:postal-code\">00165</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "482640", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ff/2c/ff2c90c378ca33ce20b27418b4776d345large.jpg"}}