{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Algeciras, Spain", "Title": "“good hotel”", "Author": "anissia10", "ReviewID": "UR128112254", "Content": "jonico is a good hotel clean, and quiet, with spacious rooms and bathroom clean the breakfast is average, italian cappuccino, coffee, milk , tea, juice; the negatf point is that the hotel is far from the city center, you can take a bus N105, or the Tram, it take 20 to 40mn to arrive to the center, is a good hotel just for small budget.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“very poor”", "Author": "kevin s", "ReviewID": "UR121597850", "Content": "The room was noisy because the window was brokem and it was by a main road. the location was bad: an hour from the historic parts and an industrial area. we don't recommand.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Guildford, England, United Kingdom", "Title": "“Bloody awful!”", "Author": "Samantha F", "ReviewID": "UR119980098", "Content": "We booked through easyjet and was a bargain however when we got there .... Eventually there were broken paving stones so much so my partner fell over! The appearance was unappealing and the guy behind reception was arrogant rude and very unhelpful. When asking for directions to get to Rome he shoved a map in my face and that was it! The room smelt like cigarettes and the decor was old and very dated the bath was stained and there was mild on the celling. The noise was awful with traffic bellowing past from the main highway. The view was of a multi-storey car park. We checked out the following morning and checked in to a wonderful hotel in the centre of Rome. It's a bargain but don't ruin ur holiday!!!!", "Date": "October 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good Rooms but toooo far!”", "Author": "Travel_0pini0ns", "ReviewID": "UR112898055", "Content": "Hello! We stayed at Hotel Jonico for 4 days and I can tell you the rooms were fine! But unfortunately there was a very limited breakfast. Reception management was good but nevertheless english was not well spoken. According to the website if you are coming from Fumicino Airport you just get on 105, but that is wrong, I would suggest anyone coming or going from this airport should either take a taxi, or the train service to the main tube station \"Termini\", from there get on the red line to Anangina and get off there. Afterwards use buses 20 from then on it will be easy. But for daily travel to the sight-seeing places it took more than an hour to get to the city. Overall if you do not care about distance or time it was a good Hotel.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“In a trading estate!”", "Author": "dawson1989", "ReviewID": "UR106368083", "Content": "awful location to the city centre and was basicly in italys verson of industrial estate with a very busy road outside.Rooms were clean and tidy and the beds were changed everyday, the breakfast consisted of juice and a few buns so not much choice and the staff could speak very minimal english so it was difficult getting any knowlege of how to get to the city! the main way of getting to the centre is the buses which were packed like sardines everytime we went on one! the city itself is beautiful and i recommend anyone who wants to see rome to stay closer to the city!", "Date": "May 1, 2011"}, {"Ratings": {"Overall": "1.0", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Terrible experience. Ruined my trip.”", "Author": "Teachem23", "ReviewID": "UR105607818", "Content": "The location of this hotel is EXTREMELY far from the center of Rome. In order to get to the Termini station you must cross a very dangerous intersection to catch the bus. After a a 50 minute ride on a crowded and dirty bus you get off and then jump on a train to reach your destination. I was so disappointed with this hotel that I paid over 300.00 to change my flight. We left a day earlier.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kraków", "Title": "“very nice but far away from center”", "Author": "Aga2319", "ReviewID": "UR86410121", "Content": "Hotel and staff are very nice. Rooms are clean. Breakfast is nice. Eerything is ok. Center is far away but it's not problem because near is metro.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“Pretty basic, Very unhelpful staff at night.”", "Author": "mjflo", "ReviewID": "UR31330288", "Content": "Hotel is a good 45 minute tram ride from centre. Located in an industrial area. Breakfast is buffet, cake, or pastry. There appears to be only one member of staff on at night, so if you want a drink at the bar when somebody is booking in you have to wait. On our last night the guy pretty much ignored us, when he finally acknowledged us he told us we would have to wait about 10 minutes untill he could serve us because he was busy! To be fair we had received good service on previous nights. Rooms were ok and the place was clean.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Value for money”", "Author": "TomjMumbai", "ReviewID": "UR28664248", "Content": "While the breakfast cafe at the reception is a lil unappetising, the overall experience is worth the fare. While the hotel is located away from the city centre, the bus stop is 5 minutes away and is well connected to all the main routes. Rooms are spacious enough, although the bathroom is a little cramped for my liking. Particularly loved the bakery down the road owned by a Punjabi man and his Italian wife.", "Date": "April 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“Lovely approach to the hotel”", "Author": "anusuyajohn", "ReviewID": "UR28441733", "Content": "The charming garden out front welcomes and gives you a good feel as you enter this hotel after the long drive from the airport. The rooms are spacious enough and the bathroom is compact yet convenient. No problems with the room per se. The cafe at the lobby that also serves breakfast requires improvement. Styrofoam cups and plates to collect your croissants from the counter on a first come first serve basis, is probably the hotel's major faux pas. on your first morning, you are unaware of the system and late comers are left with no refills! While the hotel is located away from the centre of the city, there is a bus stop 5 minutes away that connects you to the main bus stand/rail station. The receptionist speaks limited english but is very helpful, will even draw out your entire must-do day tour on the city map for you!", "Date": "April 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Ballina, Ireland", "Title": "“Too far out, rooms clean, breakfast miserable”", "Author": "MayoMaz", "ReviewID": "UR16963966", "Content": "We booked this Hotel for four nights. On arrival we found that there were no tea/coffee making facilities in the rooms (we had late flights and did not check in until 1 in the morning). Breakfast was fruit juice, cold coffee and sticky buns. Staff I have to say were unpleasant and rude and didn't want to be bothered by guests. The so called \"bar\" did not open while we were there and when we requested some hot water for tea, they would not give us any saying all was shut since 10am!!! The rooms were a good size, the beds were very clean and very comfortable. a good size wardrobe and a safe which you programme yourself also in the room. The bath room was clean but a little dated. Needs to be refurnished. Each room had a fridge with bottles of water and soft drinks put in each day (although the one in our room did not work!). The corridors were not lit and only waited lit up for about 15 seconds when you switched the lights on. Overall the location of the hotel is too far out from the city. The 105 bus takes between 30 -45 mins depending on traffic. This was normally very crowded. The tram also runs beside the bus stop to the city. Quicker to get there but not by much. It will not bring to the main train station (Termini) like the bus will. Overall I couldnt recommend this hotel.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "South Africa", "Title": "“Terrible stay at Jonico”", "Author": "PoundsSouthAfrica", "ReviewID": "UR16425191", "Content": "We stayed 4 nights at Hotel Jonico and i must say that it was absolutely terrible. The first room we were given smelt terribly of smoke. We asked for a non-smoking room, only to be told there were none. The second room was slightly better, but still smelt. The room was small but fairly clean, however the bathroom was full of mildew, from the shower mat to the ceiling, was covered in mildew. The breakfasts were a total disappointment, being only fruitjuice, coffee, biscuits and sweet buns. It never changed at all in the four days we were there. The worst was that we were totally ripped off with two phone calls (1 to South Africa and 1 to London). We were charged 130 Euros (In Venice, the 'same' calls cost us 16 Euros). Via e-mail, I have asked for a breakdown for over a month, including Renato Rossi, the hotel director, with NO response. Absolutely disgraceful. The hotel is also a hour's bus trip form central Rome. Rob Pound South Africa", "Date": "May 27, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Rome", "Title": "“Horirble hotel - I wil explain why!!!”", "Author": "sashacompa", "ReviewID": "UR16375087", "Content": "As I mentioned, Hotel is horrible. The main reasons, among others, for that conclusion are: 1. really, really, really far away from city centre 2. very, very poor breakfast (lets say no breakfast) 3. unkind working staff First of all, you should never book this hotel because of his location. You will need at least one hour and 25 min to city centre. By the way, bus is always full, but always. You will have to share the space in bus with a lot of people who are not so polite. Driving from hotel to city centre and than go back (the last one is around midnight) will ‘cost’ you 3 hours. You will be nervous and unwilling to do the same next day. Or maybe you like torture?!!! Second thing is breakfast. Just one sentence is enough regarding this remark. NO BREAKFAST!! Some bread with artificial jam and juice. Do you like that???? Third, staffs who works during the night is not polite. During the day situation is better. All in all, if you don’t want to spoil your holiday in beautiful city, such as Rome, you should never book this hotel!!! All the best, Sasha", "Date": "May 24, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "brisbane", "Title": "“too far out”", "Author": "123blondie", "ReviewID": "UR10878957", "Content": "Staff were rude and generally unhelpful. Hotel was too far from city 45min to 1h20min depending on traffic. Got a weekly bus pass from newsagents. Fantastic restaurant across from bus stop called El Patio ate there every night food was great and quite cheap.", "Date": "November 17, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Barcelona", "Title": "“Disappointment Roma..very dirty..I like its lakes....”", "Author": "Rossanna", "ReviewID": "UR8693511", "Content": "First of all, MANY THANKS to people that write to Trip Advisor, as thaks to their advertising ( about how to manage to get the hotel), my holidays in Rome wasnt' totally ruined: I booked hotel Jonico throught a web page of a very well know agency (fly+hotel) and in the Hotel Jonico web page all seems to be very fine. BUT the fact is that hotel Jonico is MAINLY FOR TRACK DRIVERS, or for any one that HAVE A CAR......but not for turist arriving in train or fly, to visit Rome. It is not only the fact that it takes more than 1hour to go from the hotel to Rome by bus (a taxi can cost more than 50€ ) but that the hotel actually is localled in a very dirty and dangerous area, and the bus IS ALWAYS VERY BUSY....which means to do all the trip stand by. ...and not throught nice views at all..... But I can say, on the contrary, if anyone wants to visit the outside landscape of Roma (Roca del Papa, p.e, which are beatiful, magnific...!) , that hotel IS VERY SUITABLE: It's fine, comfortable, and have all in the perfect way one may expect...you can park your car in the parking of the hotel. On summary: forget about that hotel if not have a car, but very suitable, if have one, and the idea of visiting the landscape out of Roma.... Mariola / Barcelona", "Date": "September 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Nottinghamshire, England", "Title": "“Jonico hotel - great hotel at a very low price.”", "Author": "Italiaman", "ReviewID": "UR7341613", "Content": "I had read many reviews before going and feared the worst. However, my wife and I were more than pleased to discover it was all nonsence. The hotel is excellent, en-suite rooms are wonderful. For the price you pay you really are getting an excellent 3 star hotel. The staff were very nice and very helpful. The continental breakfast was toast (continental style), cappucino/tea and any number of fresh pastries you cared to consume - fab! This really suited me because while on holiday, like many, I love to indulge. All rooms were very clean with excellent fitted furniture, satellite TV and a well stocked mini-bar. The hotel staff cannot speak any English - please bear this in mind because you are in Italy's capital and it is their native language! Learn a little Italian before you go - it is a must. I did and was able to converse a little with the staff and out and about. The hotel is a little way out of Rome (about 9 K) but providing you sort out the busses you are fine. From Ciampino airport the No 64 Coteral bus will take you to Anagnina station - change here for a No 20 Atac bus that will take you to Via Silicella along the Casalina road - BUT make sure you ask for the stop or it will go past. The bus drivers are very helpful and even gave us directions to the hotel. To conclude - this hotel is a must if you don't mind travelling in to Rome each day. Brilliant hotel, food, etc....fantastic time. Highly recommended. David.", "Date": "April 12, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Isle of Wight, United Kingdom", "Title": "“Could have been worse”", "Author": "pobjol", "ReviewID": "UR5370935", "Content": "I had read many reviews of this hotel before we left (Stansted to Ciampino) and hence was quite nervous as to what to expect. As we flew with Ryanair, we were able to take advantage of the Terravision shuttle service from the airport into the centre of Rome (very much cheaper than taxis), which was particularly useful since we arrived in Rome at 9am but couldn't check in to hotel until 2pm. Having spent our first day in Rome we took the bus from Termini (central bus station) to our hotel. One website we looked at before hand said the bus needed was No. 20 but it was in fact No. 105. Be prepared for a 'fun' journey- this bus can be very crowded in the evenings.The bus stop is on the Via Casilina but be warned- this is a VERY long road and in actual fact, the bus stop seems further away than you think- past all the busy retail areas, towards the GFR (ringroad). I always looked out for a shop called Kourno (the first 'o' of this word had a ^ on top), a cross-roads, and a big Renault building. The hotel isn't very well signposted so keep a look out. From the centre of Rome, Jonico is on the Righthandside of the road. Another thing, it isn't exactly on the main road, its a few minutes away on a side street, but you can see a sign post directing you to it (Via Sillicella). Bus services are available until midnight in the summer and after this there is a nighttime bus service (but I'm not sure how frequent these latter buses are). The bus can take between 30- 60+ minutes, depending on the traffic, so try to get a seat! As another review has pointed out, you need to pre-purchase bus tickets (not available on the buses)- we got ours from a tabacconist in Termini station. E11 for 3 days, E1 for unlimited travel for 75 minutes. Make sure you validate your bus tickets using the on-board machines- we saw other people getting fined >E50 by inspectors for not having validated tickets. The hotel itself is fine, very clean and well maintained. We didn't have a problem with noisy neighbours or anything but did find the main road traffic a little noisy, particularly since there appears to be many ambulances about. Breakfast... well what can I say? It consisted of coffee, fruit juice and a donut/ croissant but we weren't expecting much anyways! In terms of service, the reception staff were quite 'frosty', however we seemed to encounter this throughout our stay in Rome, in bars, restaurants and by the general public- I don't think its the staff at the hotel in particular. I get the general impression that we would have been more kindly treated if we could speak some Italian (I'm a bit ashamed to say I didn't know a single word!) so I would definitely recommend you learn a few phrases before coming here. Having said this, the cleaning staff were terrific- really friendly and welcoming. There didn't appear to be a hotel restaurant or much of a bar and in fact there are not many restaurants/bars in the viscinity and so it might be a good idea to eat before returning to the hotel. Overall, I don't think Hotel Jonico is the ideal choice for a stay in Rome because of the distance from the centre of Rome but was fine for budget travellers (probably best of no child0ren), who don't mind bus travel and who don't plan to spend too much time in their hotel.", "Date": "June 21, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Grimsby", "Title": "“Hotel to far from centre”", "Author": "A TripAdvisor Member", "ReviewID": "UR5025360", "Content": "Firstly when arriving at the airport do not get in a taxi if a person comes towards you and offers you his services,cue in the taxi rank .My wife and I jumped in a taxi thinking it was just like the U.K.unfortunately it is not we got well fleeced from the Airport to the Hotel it was 55 Euros for a ten minute ride.This left an extremely bitter taste in our mouths however as I dont try to dwell to much in the past I thought I will not let this ruin our holiday .The Hotel in general is quite nice but very basicbut be prepared for 30 minutes bus ride to Rome Centre.The staff do not speek much English neither and you can only get breakfast which is continental ,quasants and cappuchino.We arrived on the Thursday and on Friday the Buses and the Metro where on strike so getting aTaxi to come to the Hotel was impossible and most dont bother as it is to far out.So if you do fancy Rome get a Hotel in the centre near the Termini this is where all the buses and trains run into .If you do decide to stay at the Hotel you can get a bus into Rome Centre it is the 105but do be prepared to be sqeezed in almost pilchard like, you can get the bus tickets from the shop Tabichini these are like our newsagents and cost us 22 Euros for a 3 day pass this entitles you to travel on the buses and metro,however it does not allow you to get on the tour buses.The bus that takes you back to the airport stands behind a large orange building in the Termini centre and the tickets can be obtained in the main Termini centre.Hope this may be of some use so be careful not to get to fleeced and try to stick to buses also do go and see the sights on the 110 tour bus which you can book a ticket for in the Termini information which is in the centre of the bus depot.The Sistine chapel and the vatican museum are a must but be prepared to cue .", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Orlando", "Title": "“Far from the City Centre”", "Author": "A TripAdvisor Member", "ReviewID": "UR4326247", "Content": "I have no kids, I'm ok with public transportation, and on a limited budget. A friend booked this hotel for our trip. Orbitz says it's just outside the city Centre. Try taking a 30 min bus ride each way your whole trip. The bathrooms were nice...breakfast was definitely continental...lady at the front desk was very nice. My biggest complaint was the distance you have to travel to get in to Termini.", "Date": "January 5, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Minneapolis", "Title": "“Never book this hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4127984", "Content": "I had booked this hotel with a friend through Orbitz online, thinking that it would be cheap and near to the centre of Rome. Online, it said that the hotel was about 0.3 km away from the historic centre- on the map provided it looked as though it was between the train station and the centre. When we arrived in Rome, we found out that it was actually about an hour outside of the city by taxi, about 9 km away. We never actually went there because it sounded very shady and turned around to find a different hotel instead. The hotel was very unhelpful because no one there spoke English when we called them to ask if we could get a refund and to say we were not coming. Because of the decietfulness of this hotel, we ended up losing a lot of money for our room there, the taxi ride, and finding a different hotel within Rome. All in all I would not recommend this hotel.", "Date": "November 20, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Spangdahlem. Germany", "Title": "“Disappointing”", "Author": "A TripAdvisor Member", "ReviewID": "UR3662480", "Content": "My husband and I booked this hotel because we read that it was only 3km from the airport (Rome Ciampino) and that it was a family friendly hotel. First of all, the hotel was about 30 minutes away from the airport, and the directions to the place from the hotel's website were confusing. We brought along our 1-year old son, and immediately I knew the hotel was not kid friendly. We had reserved a child cot which did not exist, and when my son got sick on the bed, the hotel staff was incredibly rude about giving me clean linens. The noise level of the place was awful, the walls had to be made of paper, and the hallways were very poorly lit. There was no alarm clock in the room, and our wake-up call did not happen. Thank god we had a cell phone with us, otherwise we would have missed our morning flight. The hotel website claimed to be located in a palace overlooking gardens, more like an industrial building overlooking an abandoned street. Cleanliness was not an issue. The place is a good 40-50 minute drive away from all of the Roman attractions, taxi's cost a fortune, and renting in this city totters on the side of suicide. I would not stay here again.", "Date": "July 13, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "newcastle upon tyne", "Title": "“too far out, taxis don't want to know!”", "Author": "fancypencils", "ReviewID": "UR3315387", "Content": "We had a cheapie ryan air flight to ciampino airport.... and booked this because it was reasonably close to the airport. However, Rome taxi drivers do not want to go anywhere except rome central, big fares, and so we had taxi after taxi refusing to take us, it wasn't worth it to them.... these were all official taxis. Eventually one took us, after negotiating a fare upfront and NOT turning his meter on, 50 euros. The hotel is a long way from rome, buy bus tickets, 1 euro each at ciampino airport, before you go to the hotel, there are very few shops that sell them round the hotel especially on a sunday! Getting back from rome to the hotel is easy if you can get the bus, we took an illegal taxi who charged us 35 euro...negotiate up front, legal taxis were going to charge between 70 and 80 euro! The hotel itself is fine, clean enough, we slept with our keys in the otside of the door, we were very tired, and lived to tell the tale! Just don't expect eye contact or much in the way of pleasantries, this is a cheap hotel in an awkward place. Would i use it again...no, I would book somewhere near terminus and get the bus from ciampino straight there! What you may pay extra on accom you save on transport.", "Date": "March 31, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "wellington.NZ", "Title": "“Location dissapointing”", "Author": "A TripAdvisor Member", "ReviewID": "UR2580456", "Content": "The hotel is in a very bad location. We made the mistake of booking it through lastminute. It was a nightmare getting into the sights and I would definately choose a more central hotel in future. We used both bus and taxi's- bus is cheap but unreliable -approx 1 hour into town and taxis about 30 euros. Lesson learnt!", "Date": "September 17, 2004"}], "HotelInfo": {"Name": "Jonico Hotel", "HotelURL": "/ShowUserReviews-g187791-d482637-Reviews-Jonico_Hotel-Rome_Lazio.html", "Price": "$63 - $191*", "Address": "<div class=\"amenFloat\">", "HotelID": "482637", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/53/ec/53eccb6ce0ba817f814c9b1347e1f5488large.jpg"}}