{"Reviews": [{"Content": "good overnight stay This hotel was recommended to us by friends. We looked on the internet but wanted to reserve a parking place which we couldn't do online so we phoned the hotel direct. They first quoted a higher price but accepted the internet price when I mentioned it. However, we couldnt book a specific parking, but there were plenty of spaces anyway, at a very reasonable 鈧?0 for 24 hours. (Satnav got us there - tricky one way systems and traffic lights!)Hotel lobby nice, check-in simple. 4th floor room, small but very clean and overlooking the river. (The usual German comedy pillows - only one, very flat per person. ) Breakfast buffet good value at 鈧?.50. No restaurant though and the bar area not welcoming and a bit grim.High floors good for views but not for Wifi - it peters out after the 3rd floor apparently, but free internet access in lobby.Over all, good budget choice for an overnight stay in a central location.", "Date": "Nov 1, 2008", "ReviewID": "UR141149912", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Figgysfriend"}, {"Content": "Good value Friendly and nice hotel located conveniantly close to the main trainstation. Good value if you book in advande for 鈧?9 per night. We had rooms with nice overview over the river Main.The privat bathroom was very small, but did the job.", "Date": "Jul 9, 2008", "ReviewID": "UR266058035", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Derby1884"}, {"Content": "Simple near the station Ok. If you want a simple and relatively budget place to stay near the central station and yet want to say away from the red light district than this could the a good choice. It's only some 5 mins walk from the central station's south entrance. Walking distance to old town area of Romford is only some 20 mins.The price may be considered cheap in Frankfurt, but you pay for what you get. It is a very simple budget hotel. Room is rather small, but equiped with basic amenities.The surronding is good: River straight in front, and there are pubs and a small corner shop nearby.", "Date": "Jan 4, 2008", "ReviewID": "UR162034458", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "3"}, "Author": "JerryMJT"}, {"Content": "Clean, not expensive, good location This hotel is now the Ibis Centrum.Right next to the river, 10 min walk to Main Train Station. Couple of pubs and eating places around, even a laundromat. NOT a seedy area as another reviewer states; solitary yes, but you don't feel unsafe.Room clean, in very good condition. Bathroom very small, especially the shower; very akward to get in and out because of the doors. They keep your luggage up to 2 days if you're returning to the hotel. No charge. Has restaurant/lounge but didn't use it. Free internet station in lobby.Very quiet. No noises whatsoever.No smoke odor. I understand this is a smoke-free hotel.Would stay again, and recommend it too!", "Date": "Nov 29, 2007", "ReviewID": "UR832951727", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "pitias"}, {"Content": "Beside river This hotel offers a good location and is located on the river. It is about 10 minutes walk from Zeil which is the main shopping street and five minutes walk from the train station. There is only a snack bar and breakfast is average. Although if you have small children there are playgrounds located under the bridges on the river and on the the river bank. The rooms are clean and parking is 鈧?0 a day although there is free parking on the street outside for free i.e. if you keep an eye out.", "Date": "Jul 4, 2007", "ReviewID": "UR658192779", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "2", "Rooms": "4", "Location": "3"}, "Author": "PCorduff"}, {"Content": "very good budget hotel We found you can always depend on the Ibis Hotels in europe and we stayed in a few of them. Great because you can phone ahead and someone will always speak english. We stayed here because we could not find accomodation in Wurtzberg. We consequently arrived at 9.30pm. The area the hotel is in is a little seedy at night but we were never threaten or even approached. The staff were very helpful and we had a triple room over looking the Main river. We had 3 windows and the room was very pleasant and quite roomy as Ibis standards go. There was no restaurant but the hotel made two recommendations nearby. They were both excellent. Breakfast was very good. It was a short walk to the train station but a little further to the central city. We were there on a weekend when we were surprised to find Frankfurt actually seems to close down almost. Very few shops and a number of pubs/restaurants aren't open. We also went to Frankfurt zoo which was terribly run down and a disappointment.", "Date": "Nov 5, 2006", "ReviewID": "UR210879322", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "stretchs"}, {"Content": "Very Convenient, Average Rooms This hotel is a good choice for anyone who wants to be near the train station or near the river Main. It was a 5 minute walk to the train station, which was very convenient for us, but to get downtown was about a 30 minute walk. The hotel in itself is pretty nice, there is a cute lobby and a handy luggage storage room for when your train comes in early and your room isn't ready yet. Our room was pretty much average. It was clean and a good size (a 3 person room), and had an actual bed instead of a pull-out couch for my daughter (3rd person) to sleep in. The bathroom shower was excellent, because it had one knob for pressure and one knob for exact temperature (35 degrees, 40 etc.). The bathroom door wouldn't close, probably because of the high humidity in Germany it had expanded and couldn't be shoved into the frame. It didn't really matter because we were all family and would just not go into the bathroom if we knew someone was in there, but it could get uncomfortable if it were two friends staying there instead. All in all, this was an average but very conveniently located hotel that I would recommend to anyone planning on taking the train the next morning.", "Date": "Aug 9, 2006", "ReviewID": "UR212676097", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "dogbone1002000"}, {"Content": "Depends on room This hotel is within easy walking distance to the main train station. We found the rooms very clean. The only draw back depended on which room you had. Our room #315 had a nice sitting area as well as huge bathroom and sleeping area. The second room for our kids, #309 was so small someone had to get on the bed so the second person could go by to the bathroom. Plus your breakfast was an extra 9 Euro per person.", "Date": "Jul 12, 2004", "ReviewID": "UR148611081", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Karen-Larry"}, {"Content": "Licht und Schatten   showReview(22326441, 'full');", "Date": "Nov 30, 2008", "ReviewID": "UR477696841", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "3"}, "Author": "PuzzelKarlsruhe"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d483622-r21446600-Ibis_Frankfurt_Centrum-Frankfurt_Hesse.html", "HotelID": "483622", "Price": "$222"}}