{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“A great find in Venice”", "Author": "Jerry L", "ReviewID": "UR128009079", "Content": "We arrived later than expected only to find that they had upgraded us to a suite with great canal views from six windows and large marble bathroom. Definitely not the normal European experience! Great staff and great food combined with great location.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent Hotel - ideal location”", "Author": "Nickysunshine", "ReviewID": "UR127878606", "Content": "We booked the hotel after reading such good reviews on trip advisor and we were not disappointed. We arrived straight to the hotel by private water taxi, a bit extravagent at Â£120 euros but a real treat and makes the trip from the airport to the hotel effortless. The reception staff were all very pleasant and spoke great English. Our room was huge and overlooked the canal which was lovely. We found the room extremely clean and despite another review saying it was noisy at night overlooking the canal we found it very quiet. The breakfast choice was huge cakes, eggs bacon, cheese meats fresh fruit lovely hot chocolate. The two staff serving at breakfast could not do enough to help they were brilliant. Location was great 3 mins from St Marks Square easy to find once you knew - the earlier directions given in another review were very accurate. The only thing that would have been nice was a busier bar area as we found it very quiet, only us there on both occasions we popped in but always open. The courtyard was really nice to sit in and watch the boats and gondalas go by. I would highly recommend the Dona Palace is you like small hotels with charm, friendly staff and want to be close to St Marks Square. It was very clean and despite the odd piece of furniture looking a little dated the hotel is very well maintained.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woodbridge, Virginia", "Title": "“Would stay here again and again!”", "Author": "Becky T", "ReviewID": "UR127021498", "Content": "Hotel Dona Palace is a lovely hotel at the intersection of a couple of small canals just behind San Marco. The area is quiet at night but the couple of surrounding streets have several restaurants and wine bars. No internet available in the hotel, but there is an internet point very close by and wifi in the wine bar next door. The location is perfect. Easy to find once you do it a couple of times. We were there on our honeymoon and the hotel very graciously had a wonderful fruit tart and bottle of prosecco waiting for us in the room. It was such a special touch! Our room was amazing and huge but I believe we were upgraded for our special occasion. The breakfast was incredible as many of the other posts have stated. Cappuccino or expresso available on request. Bread/rolls/croissants with jams/jellies, meats and cheeses, scrambled eggs and bacon, cereal, fresh fruit, yogurt and a variety of fresh fruit juices - the whole spread was wonderful and the room is beautiful. The entire staff was friendly and professional. We would recommend this hotel highly to anyone.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect location”", "Author": "Lizbee13", "ReviewID": "UR126943676", "Content": "The Dona Palace is very near to San Marco, but when you step into the side patio you could be a million miles away. It was one of the few places I saw in Venice where you could actually sit in a private area and watch the gondolas glide by - the tourists thought we were residents and kept getting their cameras out to take photos! We had a huge room overlooking the canal and the Bridge of Sighs - nice big bathroom. As everyone else has said, the breakfasts are amazing and the restaurant wait staff are very helpful and friendly. Front of house staff were very professional but not terribly warm and fuzzy. I would recommend The Dona Palace to anyone staying in Venice.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Derbyshire", "Title": "“Great little hotel close to San Marco”", "Author": "lobsterpotDerbyshire", "ReviewID": "UR126782623", "Content": "The hotel is located a few hundred yards from St Mark's Square and the Bridge of Sighs, and yet is in a wonderfully quiet position, down a small side alley. This makes it tricky to find at first, but the directions on the hotel's website are good. My room was spacious with a huge, comfortable bed. In fact the small, laptop sized TV was a little lost in the wide open spaces of the room. The decor in the room looked recently done and was in keeping with the area. The communal areas had a few worn carpets here and there but generally the hotel was well maintained. The staff were very courteous and helpful. Breakfast was great. Served in a marbled room overlooking the canal. I can recommend the warm croissants filled with marmalade.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“A little surprise in San Marcos square”", "Author": "WittyCutie", "ReviewID": "UR126205183", "Content": "The hotel is a stone throw from San Marcos, although not very easy to find. Shops and restaurants abound, starting within 50 meters of the hotel. The rooms are big, if you consider European standards, but would be average for US rooms. But the service is what takes it home. The staff is friendly and they bend over backwards to accommodate you. We were coming from Rome, by TrainItalia. So, we got off at the last station in Venice and took a vaporetto (you can take #1 or 2, but the #1) and get off at San Marcos-Zacaria (there are 2 stops called San Marcos). Upon getting off the boat, turn left and take the stairs. After the flight of stairs, turn in front of the church and go inside the alley. Turn right after the first store (I mean the store that is adjacent to \"Bar American\"). Follow that alley all the way, until you see an ATM machine of a bank branch. Take the turn on your left, in the narrow street, just before the bank branch and you'll see the sign that says Dona Palace. If you wait until you arrive to call the hotel for directions, you may get stuck listening to a recording. The person who is supposed to answer the phone is also the only person at the reception, i.e the one dealing with incoming guests, people leaving or going out and handing the keys, etc. So, more often than not. he/she will just let the phone ring and you risk hearing a femaile voice telling you repeatedly to press \"1\" for front desk, and getting the same voicemal again, when you do press \"1\".", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great location, great breakfast”", "Author": "kmbperdon", "ReviewID": "UR126155259", "Content": "We stayed here for one night in March 2012. We took a private water taxi from the airport so it was an easy drop off. The location of the hotel itself is fantastic! It is a short walk to St. Mark's Square and also not far from the public water transportation which we used when traveling to the train station for our next city. There are many restaurants around the area so finding a place to eat was not a problem. The reception was friendly, and when we had problems with our toilet, it was fixed immediately. We booked two rooms. Our room was huge! It had a king bed and a crib for our son, and we stil had a lot of walking space. The marble bathroom was also large. The other room was not as big, but adequate in size. I didn't have too much problem with the noise from the streets. Our free breakfast was delicious and had many options. Free wi-fi was also a plus. The only thing was that they charged us $90+/night for having an extra person in the room. The other room we booked was for 3 people, and the base price was only for 2 people. Make sure you check that before booking. You might get a better deal somewhere else. Overall though, this was a good bargain for us.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Good value but noisy”", "Author": "326sian", "ReviewID": "UR125764162", "Content": "I stayed here for 3 nights in March 2012. The hotel was a bit tricky to find at night but I was thrilled to find that our room overlooked a canal, little did I know that it would be the noisiest hotel I have stayed in! Don't underestimate the volume of traffic on these canals. It starts very early and seems to continue until very late, the engines on the boats roaring, people shouting and then there were the church bells!! None of the churches seem to have synchronised their clocks and seemed to ring forever. The room was large with an extremely high ceiling, the bathroom was very good and everything was impeccably clean. The breakfast was very extensive and generous and all of the staff were extremely helpful, polite and good humoured. I woul stay here again but would bring earplugs next time!!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Not one complant”", "Author": "ChrisandJess2006", "ReviewID": "UR123946059", "Content": "My wife and I stayed here for two nights in Jan of 2012 as recommend by the Rick Steves Italy travel book. As this is the off-season, we were able to walk in and book room 20 for just 99 euro per night which included breakfast and wi-fi. To get this Internet price we paid in full at time of booking. After exploring for two days, we've not seen a hotel better located. It is about a block from St. Mark's Square. The bed was comfortable, there are many, many lighting options, a safe, and plenty of furniture. There is a mini-bar stocked with drinks (coke e3.00, water e2.50). The bathroom is large and well equipped, and there was a small balcony to sit at where you can see a bit of one of the canals. It is our understanding that these rooms rent for way, way more during the high season. We had a very good experience here.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brighton, England, United Kingdom", "Title": "“Fantastic location for all the sights!”", "Author": "Kerrie B", "ReviewID": "UR123867764", "Content": "We stayed here for a 4 night birthday treat for myself in January. We arrived late after as a strike effected all transport in Italy. However, we arrived by taxi boat to san marco and found the hotel very quickly by foot! The hotel is fairly small and full of character! Staff were very friendly and even left a birthday tart with card and plates on by birthday! Breakfast room offered everything you would expect. The rooms very clean! The beds were a little hard but was still able to sleep comfortably. Location great for all venices attractions! Would recommended this hotel!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Super location, good value hotel”", "Author": "Laura W", "ReviewID": "UR121701849", "Content": "Our stay at the Dona Palace, Venice was very nice. Situated seconds from San Marco, the Dona Palace was exceptionally good value. Our room was lovely, very comfortable bed, linen and marble bathroom. I noticed excellent facilities if one was in anyway disabled - lifts, access routes, bathrooms etc. The breakfast had a very good selection. Staff was superb from reception (Farid), to bellboys and waitresses. They made the stay very pleasant. In particular, Farid found us a fantastic restaurant, 2 minutes away and made reservations for us.Charning helpful and funny. Taxi access from private hotel landing made a big difference when exiting the hotel with bags to the airport.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire Dales National Park, United Kingdom", "Title": "“Just what we wanted”", "Author": "Tom H W", "ReviewID": "UR121073007", "Content": "It is very well located for a Venice holiday as it is close to St Mark's Square and its \"waterbus\" terminal. The reception staff were friendly and always there. The size of our Double room was exactly what we needed. It was warm and clean with a good en-suite shower room. Breakfast was a wide range of foods and more great coffee than I could drink.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Very conveniently located”", "Author": "christiiiiine", "ReviewID": "UR120495411", "Content": "We stayed at the Hotel Dona Palace this spring and were reasonably happy with it. The location is great, right next to St Mark's Square but tucked a little out of the way (we actually had a little trouble finding it but the front desk at a nearby hotel helpfully pointed the way). The hotel itself is clean and quite cozy, and the staff were all very helpful and efficient. Our only complaint about the room was that it got very warm at night, but if we opened the windows, mosquitoes would fly in. Needless to say, we kept the windows closed and stuck it out in the heat! We departed the hotel from their own water taxi stop, which was so convenient. The taxi was a lot more fun than the buses! (A final note: don't eat at any of the restaurants on the main street near the hotel and the Square. We ate at one on our first night as we were very tired, and boy was it a mistake!)", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“A Jewel in the Heart of Venice”", "Author": "Konandreas", "ReviewID": "UR119839861", "Content": "I have just returned from the Dona' Palace and had a wonderful stay there. Both the architecture and the location provided exactly what I was hoping for - a feel for the history of Venice. It is just round the corner from St. Mark's Square, but in a quiet, secluded enclave that looks onto the same canal as the Bridge of Sighs. The hotel was charming, with a Breakfast Hall right out of a history book - high ceilings, marble floors, venetian windows and wood panelled walls. The breakfast was excellent, with courteous, friendly staff to provide efficient service. The rooms were large and the overall feeling was one of both comfort and luxury. The hotel really is very special.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Midlands", "Title": "“Coming back again”", "Author": "petespet", "ReviewID": "UR119429744", "Content": "Having just read the review from the person in Texas, I wondered if they were writing about the same Hotel. They obviously haven't done any homework on what to expect from Hotels on the continent. Very rarely do you get tea/coffee making facilities in your rooms and the hairdryers are nearly always the tube type, they get a bit too hot to hold but you can manage to dry your hair, so what more do you need. We have stayed at this Hotel twice before and are going to book again for March 2012, again coming with two lady friends who came with us last year and loved this Hotel. It IS OLD and the rooms are quaint and this gives the whole place an endearing quirkiness, which we love. If you want all modern stay at the Hilton. We have always found the staff friendly and professional and wonder how they keep their cool when spoken to like servants by some people. Do as you wish to be done by we say. The breakfasts are fine and have the same selection found in most Hotels on the continent. This Hotel is so central and in a busy area so you cannot wonder that there is noise of the locals going about their business, it's part of the life of Venice. We have stayed in at least three other hotels in the Venice, all central and all have street noise. We know that this Texan won't be staying at the Dona Palace again - good, save it for some nicer folk.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Inverness, United Kingdom", "Title": "“A Fanastic Location and Hotel and Staff”", "Author": "Seankane", "ReviewID": "UR119286710", "Content": "My wife and I arrived by water taxi to the hotels own water taxi stop we were greeted firstly by the beautiful secluded garden facing on to the canal a favorite off mine to have a coffee in the morning and watch Venice go by the gondolas and pace off life .We were greeted with a smile by the reception staff which was Farid a professional and vast knowledge off local information we were directed to our rooms our luggage was carried by a very cheerful and funny porter.The hotel is located close to San Marks Plaza and a short walk to the Rialto Bridge were both both locations a vast number off beautiful restaurants and bistros await you with music .I have traveled to Venice before and the staff off this hotel and accommodation were exemplary .On arriving at our room a complimentary bottle off champagne and strawberry dessert awaited us .The room was well presented and organised from the bath robes and slippers to the bathroom. .The breakfast outside on the balcony overlooking the canal got you set for the day a mix off beautiful Continental breakfast and selection of cereals and juices once again the staff were beyond the call off duty once again.Myself and wife felt like family more than guests from the point off arrival to Farid personal bidding us farewell as we took the water taxi to the airport.In the the morning from about 7.30 am the staff are busy preparing this fantastic hotel so you will hear noise but that said that takes away nothing from the experiences.I will return and look forward to seeing Farid and the staff as much as Venice.Thank you for a wonderful stay and good advice .Sean and Kathryn Kane", "Date": "October 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Seattle, Washington", "Title": "“Will Not Stay Here Again”", "Author": "Trisha P", "ReviewID": "UR118627714", "Content": "We stayed at the Dona Palace for 3 nights and while the location is central, it is also more crowded and noisy. The windows of the room we stayed in did not have adequate sound proofing, noise from the canal and outside would wake us up early in the morning. The breakfast was a nice bonus though, the two waitresses serving the room were always gracious and helpful. The front desk personnel however were rude and abrupt, so that wasn't pleasant to deal with. The rooms are dated and had a musty smell. The bed was uncomfortable, blankets were rough, and the shower drain did not work very well. Overall, I probably wound not stay here again.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Awesome ! Awesome ! Awesome !”", "Author": "Jinklex", "ReviewID": "UR118496642", "Content": "The location of the hotel is just fabulous. Its 1 minute to St Marks Sq and walkable to Rialto area. We booked the hotel based purely on Trip advisor ratings and stayed in the hotel the last week in Aug 2011. We were so glad that we picked this hotel. The set-up is not overly elaborate but very pleasant. The staff was ver accomodating. We were given a nice corner room with a view to a small canal. One one of the nights our air conditioning was faulty. The staff accomodated us by giving us another room for the night while they attended to the issue. By morning the issue was resolved and we had our room back. The breakfast was adequate. On the whole, if we were to vist venice again, we will definitely choose this hotel again.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Hotel Dona Palace”", "Author": "rmscache", "ReviewID": "UR118477797", "Content": "This was the second hotel we stayed at while in Venice, and it was not only more expensive, but also dirtier and more worn out. We had such a great experience the previous night and this hotel suffered greatly in comparison. Pros: The Dona Palace is in a prime location, about 2 streets off of St. Marks, and has a cute little patio in the rear of the property that sits along a canal. We enjoyed relaxing there while sitting outside and watching the gondolas go by. The room was more spacious than our first hotel and the breakfast buffet was also more extensive than the prior hotel. The bathroom was spotless! Cons: The hotel needs MAJOR renovation: carpets were worn and dirty (a little vacuuming wouldn't have hurt!), the walls in our room were badly scuffed and desperately in need of fresh paint, the banisters on the stairs haven't seen varnish in this decade...One reviewer noted quiet (soundproof) windows - I disagree. Maybe if you are in a room at the rear of the hotel, however we were in the front, along the street, and had to contend with listening to people talking in the street below, shopkeepers slamming their metal doors shut at night and then slamming them open in the morning, plus the bells of St. Marks go off long and loudly at 7:00 a.m. (I realize these sounds are no fault of the hotel - I am just saying that the windows are definitely not soundproof.) Bottom line: while the room was adequate and close to St. Marks, I wouldn't stay here again.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Lake Ridge, Virginia", "Title": "“A Bit Tired But Still Lovely”", "Author": "margie55", "ReviewID": "UR118312461", "Content": "We stayed on Dona Palace for three nights prior to leaving on a cruise. We had a lovely corner mini suite overlooking the canal and patio. The room was very spacious for a Venice hotel and clean but the worn carpeting throughout the hotel could use replacing. The beautiful garden on the canal was the perfect place to relax after a day of sightseeing among the crowds. The breakfast room was very nice but obviously not cared for very well as the shelves on the walls were dusty and sparcely decorated. We were relative late (9:30AM) for breakfast and there wasn't much left on the buffet but hot coffee was delivered to our table as soon as we sat down. While the location of the hotel was great relative to the sights we managed to get lost trying to find it a couple of times. We just chalked to it up to part of the adventure of Venice.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "new york, new york", "Title": "“Oasis in the Heart of Venice”", "Author": "franknewyork48", "ReviewID": "UR116674113", "Content": "Fantastic location just 2 minutes from Saint Mark's and about 12 minutes to Rialto Nice breakfast room and a fun terrace (that's great for evening drinks and where water taxis arrive) on a small canal with gondolas passing by all day Room was spacious and quiet with soundproof windows It was very hot in Venice when we were there and I'm glad to say the air conditioning worked well Good size modern bath with spacious shower Lobby is small but who cares?!! The evening concierge recommended a good place to eat seafood 5 minutes from hotel I would stay here again", "Date": "August 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“I was supposed to stay for a second time in 2 years.......”", "Author": "DWG10", "ReviewID": "UR116445337", "Content": "But the price changed 2 times before our stay to much higher....when I asked for a fair review I was told no that even though I had a reservation that they were now fully booked so I was free to cancel my reservation according to their reservations manager. I think that the hotel was nice but that you need to watch how you are treated", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Athens, Greece", "Title": "“avoid this hotel,unfriendly and ironic front desk”", "Author": "Philiposki", "ReviewID": "UR115983428", "Content": "i staid in room 22 in July 2011 the room is between the restaurant and the alleviator in the morning you wake up at 7.00 because the restaurant open. Wen i complain , The front desk was rood and ironic i never se that thing befor. the only friendly staff were in the breakfast. Bat the breakfast is poor", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Incredible Hotel”", "Author": "BlueMarlinDave", "ReviewID": "UR115249720", "Content": "I stayed at the Hotel Dona Palace at the recommendation of my travel agent and as part of a two day Pre-Cruise Package. Check In from the Water Taxi Stand was seemless and quick. I was also provided an AC Adapter and Wireless Internet Code at Check In. Diego at the Front Desk was extremely helfpful and we were offerred a free tour and water taxi to the Murano Glass Factory as part of our stay. We were given Suite 24 which was an absolutely incredible suite fit for a King and Queen. I cannot rave enough about this room and would request it again. The Hotel is located very close to Sain Mark's Square and their are countless shops and restaurants located outside the doors of the Hotel. It is perfectly located to explore all that Venice has to offer. We would not hesitate to book this hotel on a future trip to Venice.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Enjoyable stay”", "Author": "blairbg", "ReviewID": "UR114062071", "Content": "Although we stayed in February it wasn't too cold but rather sunny. Hotel situation is close to St. Marks and very comfortable. Would stay again for the off season price.", "Date": "June 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stuttgart", "Title": "“Loved the hotel - location, service and amenities”", "Author": "Chocaholic1001", "ReviewID": "UR113171887", "Content": "We stayed at the hotel for 2 nights, and once you get over the fact that all hotels in Venice are expensive, then you can relax and really enjoy this hotel! The front desk staff were all very helpful and friendly. The location is perfect - very central and yet surprisingly quiet. We upgraded the room to a junior suite, and it was huge - well worth the extra money! All in all our stay was fantastic, and I would not hesitate to recommend the hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London", "Title": "“Good value and great location”", "Author": "MarkLondonEngland", "ReviewID": "UR111251959", "Content": "I selected this hotel after checking Tripadvisor. It was part of a package from Expedia which included flights and hotel. Overall it was a good choice, with a great location very close to St Marks Square. In the context of the package, it was good value and I would stay there again if the price was right. Our only problem was that the air-conditioning could not be switched on, and it was quite stuffy in the room at times. The front desk was very unclear on the reason - it seemed to be hotel policy not to turn it on until the summer. The room was otherwise very comfortable and the staff helpful and friendly.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plant City, Florida", "Title": "“Great little hotel - very clean - with excellent staff”", "Author": "samsidoti", "ReviewID": "UR110741151", "Content": "We stayed 2 nights at the Dona Palace before leaving for a cruise to the Greek Islands. The service was great and the front staff was exceptional. They helped us recover our luggage after it had missed out flight. The breakfast was very good. Our room was huge and right off the breakfast room. The only complaint was the room temp. We were not able to turn the a/c down further and it was somewhat uncomfortable one evening. The sister hotel across the street had an excellent restaurant. It is close to everything. I would highly recommend staying there.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very close to St Mark's Square”", "Author": "ntrinidade", "ReviewID": "UR108066249", "Content": "My husband and I visited Venice in March, towards the end of the Carnival. We chose Dona Palace as it was near the main attractions - and it was. Be aware that the rooms are small and there is limited wardrobe space. The buffet breakfast is a mainly a cold breakfast, with more cakes than savoury items - all nice although.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“LOVED Dona Palace Hotel”", "Author": "cattynet", "ReviewID": "UR106680389", "Content": "Dona Palace Hotel is amazing - we were just there from 29 April to 2 May and loved everything about it. Location: Dona Palace is located just a couple of streets behind San Mark's square. Though the square itself is packed with tourists, the little street Dona Palace is on is surprisingly quiet. One issue though - do not follow the Google Maps location for the hotel. See attached photo, the entrance of the hotel is located around the corner from where Google Maps puts you. Getting there: From Marco Polo airport, there's really two ways to get to Dona Palace and it depends on how rich you are. You can take a water taxi which costs about 90 euro and will take you 20 minutes. Or you can catch the Alilaguna (water bus) which costs 15 euro per person and takes 1 hr 15 mins. The water taxi can take up to 8 or 10 people so if you have a big group this might be worth it. The hotel has its own private dock from the canal so the water taxi can literally deliver you straight to your doorstep. The Alilaguna will drop you at San Marco which isn't far either, about 5 mins walk. Rooms: I was worried after reading some reviews about the rooms being small. We booked through eBookers so didn't get a choice of rooms (so I thought we'd get a small one) but ended up with a really spacious room with a private terrace overlooking the canal! The beds are huge, bathrooms are amazing. We had an in-room aircon but didn't need to use it as we could open windows to get the breezes. Staff: the staff at the front desk are super helpful and friendly. They all speak English. Breakfast: breakfast is included - bacon and scrambled eggs, cold meats, cheese, cereal, pastries and fruit and yoghurt. There are also two tables for breakfast on the terrace which is nice if you're lucky enough to get one! Murano Island: if you want to go to Murano, ask at the front desk about how to get there. They can organise a free trip there via water taxi - the only catch is that once you arrive at Murano you have to view a glass blowing demonstration at one particular factory. Good thing is that there is no obligation to buy anything. Otherwise getting to and from Murano costs 6.50 euro per person. You have to find your own way back in any case. Wifi: there is free wifi :)", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Our Favorite Hotel in Venice!”", "Author": "TomR4012", "ReviewID": "UR104792229", "Content": "We stayed at this hotel last year and were pleased to be able to return. Despite its proximity to St. Mark's Piazza and to the popular tourist attractions, the hotel is very quiet and seems somewhat secluded. Most rooms look out onto a canal. There's a quiet garden right on the water where you can enjoy a glass of wine and watch the gondolas passing by. The breakfast is very tasty and generous. The staff is very friendly and tries its best to accomodate every request. Hint: If you stay here, be sure to have the hotel give you detailed directions as it's tucked away in a very narrow passage way.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Perfect location”", "Author": "Janna78", "ReviewID": "UR104598694", "Content": "We stayed at Dona Palace for three nights. I remember making a booking for a basic room, and it sure was basic, very small at least. There was a big closet for one's clothes, with hangers but no shelves. Bed was comfortable and bathroom big enough. TV had lousy channel choices, only one channel where you could here English.. Breakfast was very good, the choices were not too many but they were sufficient. And the coffee, well, I have nowhere had as delicious coffee as I had here! There is a balcony outside the breakfast room, from which there is a nice view to the canal and the Bridge of Sighs. We found the hotel easily, for we had read instructions on this site how to get there. We came from the airport by waterbus and got off at St. Zaccaria, the walk to the hotel took us just a few minutes. I don't recommend taking too heavy luggage with you!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Flower Mound, Texas", "Title": "“Comfortable room & great service in Venice”", "Author": "aggiebry", "ReviewID": "UR102964669", "Content": "My wife & I stayed at the Hotel Dona Palace in March of this year. Great location just a block off of St. Mark's square. One note - the entry is on the street just off the side of the physical address. The room was spacious (we were in the Jr. Suite), very clean and very quiet. The staff was helpful, especially the gentleman who worked the desk in the evenings. He went out of his way to make us feel welcome. Breakfast was included in our rate and was very good. In addition to the usual items you'll get in an Italian breakfast buffet (meats, cheeses, juices, pastries) there were also some hot items like eggs. Overall, a great place to stay. Venice is wonderful and the Dona Palace is a great choice for your stay.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Decent hotel, but didn't meet our expectations”", "Author": "fr3houston", "ReviewID": "UR100524532", "Content": "The location is excellent, but finding it for the first time is a little challenging (but that's the case with anywhere in Venice). It's near a Hell's Kitchen wine bar, on the same side of San Marco's square as the Doges palace. The service was all right, we arrived at 10 a.m. and they didn't have our room ready until 1:30, and they were not sympathetic. They basically implied that it was our fault since their check-in isn't until 2 p.m. The hotel is very small, but quaint. The rooms were the same, small - but very comfortable. Do NOT ask them to schedule the Gondola ride. They quoted 120 euros - we walked about 5 minutes to one of the small bridges, and with only a little negotiation, got a 3km ride for 80 euros. Also, to get to the hotel - make sure you take the Alilaguna and NOT a private water taxi. it was safe, efficient and much more cost effective.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Perfect location, great breakfast, helpful front desk staff”", "Author": "Travelers804", "ReviewID": "UR99057196", "Content": "Dona Palace is a great choice for central Venice! It's a five minute walk from Saint Mark's Square. The front desk staff provided helpful recommendations and maps. In addition, they held our bags when we first arrived and prior to leaving. The breakfast offered fruit, eggs, yogurt, pastries, and dessert-like options. The breakfast hall was spacious and had a full patio overlooking a small canal. Our room was cozy with a small view of the courtyard and canal. The bathroom was clean and provided good bath products. We would recommend Dona Palace to others and would stay again on a future visit to Venice.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Close to San Marco Square... but anything in venice is close”", "Author": "Arpetizor", "ReviewID": "UR98171288", "Content": "We were booked from 12th July 2010 to 14th July 2010 in a Junior Suite triple. By the name we thought it was an old palace of some sort. Just off San Marco sq [a minutes walk away] tucked into one of the narrow lanes. Small clean hotel with simply appointed rooms. Ours was a suite with 2 rooms a bedroom and a lounge with a sofa-bed. The complimentary breakfast was good but not lavish. The staff was friendly and helpful. The only grouse was the 250 euro/ night tariff - excessive for the class we felt. BTW we also had a cycle bike in our \"suite\" which did not work. Do remember .... in Europe most hotels do not have iron or electric kettles in rooms. In the website they mention internet but there was no internet available at our hotel we were asked to go to a nearby hotel and use their lobby for internet . Most of the hotels in venice are of the same type therefore i will not have any reservations to recommend this hotel . Our room face the water and could see the gondolas going by.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Perfect! Fabulous location and spacious rooms - definitely worth going to”", "Author": "Czaee", "ReviewID": "UR96682870", "Content": "The Dona palace - its actually a 17th century palace, and is just a minute from St Marks Square and the Doge's Palace and the Grand Canal, so you cant beat the location. The hotel is charming, and our room and bath was surprisingly large, clean and well-maintained. The hotel has its own private dock for gondolas, so you can get right to its doorstep easily. The breakfast was also lovely - a good selection of cheese, cold cuts, pastries etc. Would stay there again happliy.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“A nice surprise”", "Author": "Andre_Mattos", "ReviewID": "UR92338920", "Content": "We booked our stay in Venice at the Al'Angelo hotel, which belongs to the same chain as Dona Palace; amusing hotel, with a entrance right on one of the canals. When we arrived, the concierge said that there was a problem with our booking and we would have to stay at Dona Palace, on a premium room; oh my, how that sounded so good. The staff was perfect, the hotel room exquisite and everything else went smooth ... will stay again on next trip to Venice.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Highly Recommend It!”", "Author": "lfptravel", "ReviewID": "UR90434372", "Content": "Great location - super close to St. Mark's Square - right on the canal. We took a water taxi to the airport right from the \"backyard\" of the hotel. Large breakfast space and nice bar in the hotel. Nice outside terrace area. Very helpful staff. MASSIVE hotel rooms - truly huge bedroom and bathroom. Great Find! Wouldnt stay anywhere else in Venice!!", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great find close to San Marco”", "Author": "bluevoter", "ReviewID": "UR89518124", "Content": "The hotel is located about 2 minutes from San Marco and about 5 minutes from Rialto, so it's very convenient. My room was large, clean, and modern, with free WiFi. The breakfast was well above expectations. I also found it to be a good value for money - at least at this time of year. I also discovered that it's right near the edge of the high tide area, so you might need to wait or buy some boots from the front desk if you want to venture out at high tide.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Perfect location, nice people!”", "Author": "TravelDreams", "ReviewID": "UR87887951", "Content": "A friend and I spent 6 nights here in October 2010. I chose the location because I like to be close to the action at night, and I did not want a lot of bridges to go over to get to the hotel. We both really enjoyed our stay here, and will be recommending to others, and probably go back in the future. Location wise, it is so close to St. Mark's, yet down a quiet alley. I think no matter how you do it, from the airport Alilaguna boat there will be 1 bridge to go over to get to the hotel. We enjoyed chatting with each day and night desk attendant, they were very helpful in recommendations, very pleasant. Our room was nice and spacious compared to most European rooms. We had 2 windows overlooking the courtyard, a little bit of the canal, yet it was super quiet- good quality glass on the windows. The beds/ bedding/ pillow were super comfortable. The bathroom had one of the best showers I have ever had, and an appreciative heated towel rack. We never heard a peep from our neighbors, I think the walls and ceiling are very solid. Breakfast was good, even after 6 times we never got bored, a decent selection of cereals, scrambled eggs, very good juices. I loved the beautiful high ceiling breakfast room. Accessability wise, there is an elevator, but a few steps up to the breakfast room. Most of this area has bridges to get anywhere of course. We did eat at the hotel restaurant once and as soon as we sat down we felt we were in a tourist trap. It is difficult to find a restaurant in the St. Mark's area that does not feel this way - I recommend eating dinner elsewhere in Venice, or for a quick Pizza and drinks, try the close by Planet Pizzaria! We actually ended each day there- just around the corner from Dona Palace. Free Wifi! Worked well in our room- though not fast enough to do a great Skype video call.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Gig Harbor, Washington", "Title": "“OK Hotel”", "Author": "THW_777", "ReviewID": "UR86951064", "Content": "Value is defined as; Expectation/Price. Dona Palace is a 2 to 3 star hotel, at 275 Euros/night; at that price I expect 4-5 stars. Dona is located close to San Marco. The reception staff is not friendly, not unfriendly but not friendly. The rest of the staff was truly extraordinary, what you expect in the best hotels. The maintenance of the hotel is abysmal, carpets need replacing, walls need to be filled and painted, it is beyond a cleaning staff to clean what needs to be repaired. Our room had beautiful marble flooring, with 5 meter ceilings. The furnishings were in need of repair or replacement. The bed was uncomfortable, (felt like you're sleeping on box springs) the pillows were old and flat, the bed linens were of the cheapest variety. It's all about value, I expect more for what we paid.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stratford-upon-Avon, United Kingdom", "Title": "“Central location - quiet spot”", "Author": "june_baby19", "ReviewID": "UR86081273", "Content": "Just returned from a lovely stay. Very pleasant staff, comfortable room, good breakfast, great location yet quiet, save for the odd singing gondolier!", "Date": "November 5, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dallas, Texas", "Title": "“A Little Gem in Venice”", "Author": "sally49er", "ReviewID": "UR84642719", "Content": "Don't let the small reception area fool you. Our room was huge- approx. 20 feet square! My husband and I just returned from a 7 night stay at the Hotel Dona Palace in Venice, Italy. We couldn't have been happier with the hotel. The staff was courteous, friendly and very helpful. Everyone spoke excellent English which really helped. Our room was very spacious. We had a junior suite with a king-sized bed, couch, large desk, sitting area with a small table and chairs, good sized closet and safe. We had a little view of the small canal just below our window, too. The bathroom was its best feature. There was a large bath tub with a jacuzzi that was big enough for a MBA basketball player to stretch out in. It was all marble and the hotel even furnishes slippers so your feet won't get cold on the marble floors. There was a shower, bidet, double sinks and best of all heated towel racks, too. Probably the best feature of the hotel is its close proximity to Plaza San Marco. It is literally 1 block away. A 5 minute walk from the hotel gets you to the vaporetto, or water bus, that can take you practically anywhere you want to go in Venice. There is even a gelato store next door to the hotel! Given its location, you might expect the hotel to be noisy, but it was surprisingly quiet. My husband is a very light sleeper and he didn't even need his earplugs. There is a full breakfast buffet provided with the room and it as very good. Our last morning, we had to leave for the airport at 5:00 a.m. Our hotel provided us with a sack breakfast with bagels, a croissant, an apple and orange juice that we could take with us. Our water taxi that morning picked us up right at the hotel because it has a private dock. We were very pleased with the Dona Palace. I would highly recommend it to anyone who is going to Venice.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Pleasant, quiet, and well managed.”", "Author": "PaulGofBoston", "ReviewID": "UR83489484", "Content": "The Dona Palace is a very pleasant hotel very near St. Mark's square. Stayed for four nights in early October in junior suite 23 (talking the recommendation from another reviewer). The room was very spacious and clean with a large bath including whirlpool tub and shower. Immediately outside the room is a common area where breakfast is served and at night there is a small wine bar next to the common area. The breakfast is fairly general, nothing special. The hotel is on a very narrow side street, however, once you find the hotel it's easy to locate. We arrived and departed via water taxi to the train station as one side of the hotel is on a canal and there is a private dock and small, very pretty courtyard. You can sit out there and watch the gondolas go by, very pleasant. I recommend this hotel - you can't beat the location and the room rates are in the reasonable range compared to some other Venice hotels. Rooms 23 and 24 are on the second floor - 24 overlooks the canal, 23 is on the street but with the windows closed there was no noise at all. The hotel staff was always helpful and accomodating. The hotel also owns the HK wine bar across the street which had very reasonable by the glass wines.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Standard amenities, standard fare, location, location, location”", "Author": "simone949", "ReviewID": "UR82214659", "Content": "A smaller hotel very close to the 'action' - but Venice is entirely walkable. Room was average and hotel had standard fare - European breakfast that was more than adequate.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Wales", "Title": "“Absolutely fantastic hotel!!”", "Author": "VolvoC30", "ReviewID": "UR80853263", "Content": "We were booked into the sister hotel the All 'Angelo but on arrival we were upgraded to the Dona Palace. From the moment of check in until departure we were made to feel special by all of the reception staff. The hotel is an example of superlative customer service. We were located in room 51 at the top of the building; it was a suite with excellent facilities including an upstairs terrace that overlooked Venice! What can I say about the breakfast room? it is one of the most beautiful rooms; lots of marble. The breafast itself was excellent with plenty of choice and superb service even though it is a buffet. On departure we had booked a water taxi from the terrace (another gem right on the canal); the front desk guy was alert to the fact that our taxi hadn't arrived on time so he made it his business to follow up the reservation; it arrived in seconds. If I were visiting Venice again I would not consider any hotel other than the Dona Palace. Thanks for a great stay", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Loved Dona Palace”", "Author": "ljones3900", "ReviewID": "UR80314381", "Content": "the staff at Dona Palace really made us feel welcome. the beds were very comfortable and loved the robes the hotel provided. the location is terrific and the breakfast room was so beautiful. would reccomend for sure and go back if ever in Venice again!! this was a clean hotel and again the staff was very helpful in all areas! Thanks for having us Dona Palace!!", "Date": "September 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A clean, attractive and well-located...”", "Author": "AliRuth", "ReviewID": "UR76913777", "Content": "A clean, attractive and well-located hotel tucked away behind St Marks Square, but with a quiet ambience and attractive good-sized rooms. We stayed in a junior suite which was roomy and comfortable. A great central location from which to explore the city on foot, and not too far from water bus stops to and from the railway station and airport. Our only minor gripes were not enough clothes storage space in the room and the bar wasn't open in the evenings for some reason. But apart from that we liked the facilities this hotel offered.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "cornwall", "Title": "“Convenient location”", "Author": "bex00", "ReviewID": "UR75797044", "Content": "We have just come back from a 4 day trip to Venice. I travelled with my husband and 5 year old daughter. The hotel is very conveniently located to the major sights. We stayed in a suite which was very spacious but it had no sound insulation between the 2 bedrooms as there was no door. It had 1 bathroom with a spa bath. We could also hear a lot of noise from the room upstairs. We were disappointed with the breakfast which was very basic and had a menu where you could pay more for items which are normally standard e.g fresh juice and boiled eggs. The hotel had a lovely garden where you could sit and watch the gondolas go by. We did use their water taxi to get back to the airport but this was 80 euros. The staff were very friendly and helpful and spoke good english.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indian Wells, CA", "Title": "“Dona Palace a Definite Yes & Book the Junior Suite”", "Author": "desertprincessofca", "ReviewID": "UR75349179", "Content": "We just spent two weeks in Italy and Venice was our first stop. The Hotel Dona Palace is small, quaint, easy to access-once you know where it is, and is certainly a winner. The reception desk is manned 24 hours straight, so there is always some one available to you. Secondly, the front desk reception is friendly and professional and you feel safe from the madness that takes place outside in those busy alleys of Venice. Breakfast is served on the second floor in a charming setting with an open terrace and pretty ambiance. If you stay in the Junior Suite Room 23, your room is separated from the rest of the hotel and breakfast is just outside your bedroom. If you choose another room, there are lots of steep steps and a narrow elevator. Take the Junior Suite, you will be glad. The room is large and the bathroom has an immaculate large tub. The convenience to San Marco Square and the good shops and restaurants can't be beat!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moraga, California", "Title": "“Location Great-Service even Better”", "Author": "Eurotraveler280", "ReviewID": "UR71048166", "Content": "We had booked a jr. suite at Dona Palace and were not disappointed in the room size. We had wanted a canal view so we were upgraded (yes, at a slight extra cost) but the hotel was very helpful getting us a room we would like. Later in the day the aircon went out in our part of the hotel. Here is where the staff did everything possible to help. They brought in portable fans and airconditioners as well as keeping us up to date on the repair process. While the problem was not remedied during our stay the staff service and focus exceeded expectations and we did not feel our 3 day stay in Venice any less diminished. Hotel location is excellent, 300 meters from San Marco piazza and on a canal. Rooms are quiet, breakfast room and breakfast are very good, bathrooms ample size and modern. Hotel has its own boat which can be booked for ride to airport at a reduced rate from the regular water taxi's. We would highly recommend taking a water taxi from where ever you arrive from (airport, rail terminal, car rental) to Dona Palace or whatever hotel you book that is on a canal. Likewise when departing Venice. First of all there is no better way to see Venice and its uniqueness than by boat and the water taxi docks right at the hotel so only a few feet to hotel check in. Yes, the water taxi is a bit pricey (Euro 65 to 90 depending upon distance) but you will not forget the experience. Forget the guide books that say it is easy and cheaper to take the Vaporetto (the public boats). Not if you are carrying or wheeling suitcases behind you and have a backpack as well. For example, the San Marco Vaporetto stop has about 5 stations and they are about a quarter mile apart so unless you are lucky to get off at the stop nearest the hotel and are very good at navigating the narrow streets of Venice along with the tourists in San Marco square, go for it.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "bergamo", "Title": "“Charm little hotel”", "Author": "licahil", "ReviewID": "UR69250315", "Content": "Nice little hotel close to San Marco Plazza.We have a large room with two beds and also had a sofa and a table.From window we could see acanal. Nice and clean bathrroom with shower/tub combination.They provide free WI-fi internet acces,and from front desk you can get all sort of maps and brochures. Overall very pleasant stay good quality for the price.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Recommended”", "Author": "wattsontoday", "ReviewID": "UR68162969", "Content": "My husband and I had a standard room overlooking the canal, and although well presented and appeared refurbished, wasn't overly spacious. As we spent little time in the room during the day, this didn't matter. We also had the same issue over the air conditioning, and I was bothered by biting mosquitos, as we too needed the windows to be slightly open. I won't repeat the positive comments about breakfast and location, as they are the key selling points of the Dona Palace. Following earlier reviewers, we ignored the retaurants promoted by the hotel, but followed eating recommendations on this website. I had a birthday during our stay, and a welcome touch from the management was the strawberry tart left out for us. There were a lot of other English speaking guests, but I was disappointed that the only accessible English tv channels were Sports and a Chinese news network. As a bit of a news junkie, I would have liked some access to the outside world in English. As the hotel clearly is active in the English speaking markets, I would have thought that this is something that needs resolving. I hope that the management read and respond to this posting (and not ignore it as I only gave four stars!) All in all a good find.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great little hotel”", "Author": "Mordonian", "ReviewID": "UR67974632", "Content": "This hotel was chosen mainly because of it's location (2 minutes walk from St. Mark's Square) and price for the rating, and I can honestly say that I wasn't disappointed. Compared to other hotels I've stayed in over the years this is a relatively small hotel and as a result it has quite a laid back and relaxed feel to it. All the staff were very friendly, polite and helpful. The room was very spacious, quiet, clean and had good en suite facilities. Buffet breakfast was served in pleasant and spacious surroundings, and gave you a good choice of good quality items. Another nice touch with always gets thumbs up from me is free Wi-Fi access.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Greenbush, New York", "Title": "“Excellent location!”", "Author": "MCHayes", "ReviewID": "UR67914466", "Content": "We stayed our first night at Dona Palace in a junior suite. Upon arrival at the airport, visit the Vistors Information Desk and purchase tickets for the water bus. Exit the airport building andtake a left, following the covered walkway and signs which will bring you to the water (about a 7 minute walk on flat ground). Take the water bus (vaporetto) operated by Alilaguna- red line. Get off at St. Marks Square stop. When you get off, go to the right, towards the square. Make a left into the square (the Basilica will be on your right). Straight ahead of you will be a zodiac clock over an arch. Go through the arch. Take a right at the bank. Immediatly past Al Angelos restaurant take a left. The hotel is on your right, Al Angleo hotel is on your left followed by Hells Kitchen. We arrived early, around noon and could check in (they photo copy your passport). The room was not ready until 2pm, so we freshened up and were able to store our luggage while we started our adventure and found lunch. The front desk even allowed me to call home to my Dad to let him know I arrived safely. Upon returning at 2pm a bell hop (carrying our luggage) escorted us to our room and showed us how to use the small magnet key to get in and turn on the lights! We tipped him 5 Euro. The room (24) was just off the breakfast room (kinda weird, especially in the morning when we opened the door to a room full of people eating!). It was very large, grand! It had a small twin bed, desk and closet in one room, then the master room had a king bed (really 2 twins stuck together), three (flat) pillows, 2 robes, a (closed) fireplace, dressers, large mirrors and headboard, and two windows which one overlooked a canal (so beautiful!). The bathroom had a sink, 2 pairs of slippers, a tub with jets, shower, bidet, another sink, and toilet. Friends were staying at Al Angelo, and it did not compare to my room one bit! Upon leaving the next morning, we again were able to store our luggage with them. So nice. Breakfast was decent. There was cold cereal, yogurt, pound cake, croissants filled with marmalade, yummy potatoes, watery scrambled eggs, bread, lunch meat and cheese. The hotel is very close to St. Marks Square and all the hustle and bustle. Having the junior suite was a nice treat and the size of the room was exceptional! I was surprised to receive a bathrobe and slippers which made it even more luxurious! I would definitly recommend this hotel!", "Date": "June 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Dona Palace hotel - Excellent Rooms, Great Location”", "Author": "TX_Vic", "ReviewID": "UR67409986", "Content": "We had been in several cities in Italy with our trip ending in Venice. We stayed 3 nights at this very good hotel. We had booked the Junior Suite because it wasn't that much more than a standard room. I am glad we did. It was a very large room with 2 couches, a desk, and large bathroom. The bed was comfortable and large. The room was very clean but a bit warm as with most hotels in Italy don't turn on the AC until June. We opened the windows even though I feared letting in mosquitos with the fresh air. This was never a problem and we felt comfortable at night. The room was also very quiet even though it faced the street side. Breakfast was the best we had in Italy. There are lots of choices. If you can't find something you like then you must be really picky. Some breakfasts in Italy do not include eggs, sausage, and potatoes. Plus the regular fare of fruit, cereals, meats, and breads. The staff was friendly and helpful. They offered us a 15% discount at restaurants owned by the hotel but I suggest you pass on those as they are very touristy and we felt service at the restaurants was rude and the food mediocre. The Location couldn't be better. It was a 2 minute walk from St. Marks Square. Easy walk with your bags from the Vaporetto stop at San Marco/San Zaccaria (the stop after San Maco). It is perhaps a 10 minute walk to Rialto Bridge. Much faster than taking the No 1 Vaporetto. If I return to Venice or friends ask for a hotel I will certainly recommend Hotel Dona Palace.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Okay hotel but not sure that I would stay here again”", "Author": "annaj11", "ReviewID": "UR65938375", "Content": "We stayed at this hotel for 2 days in late May. We had a Junior Suite. It was a large room with a sofa and small table in the same room as the beds. The beds were comfortable. The bathroom was small but was well appointed. The decor and paint of the room have seen better days though. The breakfast buffet had meat, cheese, yogurt, bread, pastries, eggs, potatoes, juice etc. It was great. We ate on the little balcony over the canal. It was a lovely setting. The service at the buffet was excellent. The location is very close to St. Mark's Square so it was moments away from the main tourist attractions. They offered a coupon on checkin for 15% off at 3 restaurants owned by the same company. We found the food to be very touristy and overpriced even with the discount. On arrival, our room was stifling hot. We could hear a fan running so assumed that they had just turned the air conditioning on in our room. We closed all of the curtains in order to help. We went out to sitesee for a few hours. When we returned, despite the fan running and the curtains being shut, our room was still stifling hot. We were told that the AC was not turned on yet for the summer. They indicated that it isn't turned on until June 1. Somehow though over the next 2 days, we had AC off and on. It would work for a couple of hours and then turn off. We stayed at 3 hotels in Italy during our stay but this was the only one that did not have reliable AC. With the exception of one of the daytime front desk attendents who was rude, the front desk attendents were helpful and friendly.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great location, friendly staff, nice room”", "Author": "sgreenwood", "ReviewID": "UR63571160", "Content": "The hotel is in a great location near St Mark's Square. It was very helpful to stay near a landmark in Venice as the streets are very confusing, but there are signs everywhere to point you to the majors sights. My room was very nicely decorated, spacious and quiet. The staff was helpful, and recommended which shows to see. Some of the front desk staff did not speak any English, though I didn't find it to be much of an issue since I used the free WiFi to look up anything I needed. The breakfast room was very nice, and the selection was great. Eggs, sausage, bacon, croissants, fresh squeezed juice and more. I would definitely stay here again!", "Date": "May 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Very nice hotel at superb location”", "Author": "andre_in_oz", "ReviewID": "UR57959271", "Content": "We went for a week to this hotel. Upgrade to Junior Suite is worth its money as it offers much space and a sofa. The breakfast buffet is very nice. Around the hotel there are some good offers for restaurants, shops etc. and by foot it's just 2 minutes to San Marco and about 5 minutes to the Vaporetto. The staff has always been very helpful and friendly to us. Can only advise to go to this hotel as I will again when I travel next time to this wonderful city. Go off-season!", "Date": "March 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Perfect place to stay in Venice”", "Author": "scrg06", "ReviewID": "UR54028033", "Content": "We stayed in three different hotels during our European trip, and this was by far our favorite. The location was relatively easy to find (a BIG plus in Venice, where it's infamously tough to find anything) and is just off St. Mark's Square. We found it quickly and when we checked in they gave us a coupon for 15% off a few of the wine bars and restaurants in the area (we used it at a restaurant around the corner, which was delicious!). The staff was nice and polite and very helpful when we had questions. Our room was much roomier than we expected, very clean, extremely well decorated, well lit, a lovely view, great working thermostat (apparently a rarity in Europe), and generally comfortable. The bathroom was huge and had a towel warmer (a big hit with our in-laws who came along for the trip). The bed was super comfortable, the free internet worked like a charm, and it was very quiet and relaxing. Our favorite part was the free breakfast, which was huge and awesome. Freshly cooked scrambled eggs, bacon and sausage, tons of pastries and cheeses and cold meats, cereals, juices, fruits, everything!! Best included breakfast we had in Europe. All in all, I highly recommend this hotel. We really enjoyed our stay here and would happily stay here again.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Calgary, Alberta, Canada", "Title": "“Nice Stay in Venice”", "Author": "Grums", "ReviewID": "UR50061491", "Content": "My husband and I stayed one night November 14th and after re-reading the reviews I guess we got the basic room. #44. We did arrive early after a cruise so it was nice to be able to leave our luggage as we had already dragged it from the water bus stop (which is way cheaper than than frequently noted water taxi) across San Marco and down the street and over a bridge we didn't need to go over and back because the directions as rather poor. Anyway the front desk was very polite and as stated, the room was large enough. 2 windows and a view if you leaned out far enough.The canal side we were on was quieter but the room can get warm even when the controls are turned down. Open the windows and you can get mosquitoes even in November. The breakfast room is lovely and we thought the breakfast was just fine. We'd stay again...now that we know where it is.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Fantastic”", "Author": "badtraveler45", "ReviewID": "UR49940584", "Content": "I highly recommend this hotel. We arrived late at night with our 7 year old almost asleep and we were greeted with smiles and helpful info. We ordered a junior suite (no canal view) but it was very large with room for everyone. The beds were comfortable and the jacuzzi was great!! The best thing about this hotel was the breakfast - absolutely delicious with the best coffee I've ever tasted. The hotel is located right off San Marco square but was quiet and secluded. We will stay there again. The restaurants on the nearby street were not too good so after one bad meal we were a bit more careful.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston, USA", "Title": "“Good Hotel and Location”", "Author": "RNPai", "ReviewID": "UR49857800", "Content": "My wife and I stayed here from 11th to the 14th of November and found the location great with the accessibility by the water taxi as a result we did not have to drag our luggage through the streets. The breakfast was good and the staff very helpful. The location of the hotel is great and is just a two minute walk to St. Mark's Square..", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Good Hotel”", "Author": "Jools08", "ReviewID": "UR48630672", "Content": "Staff friendly and helpful, breakfast was ok, would suggest you eat all you can as eating out can be very expensive. We stayed in room 40 which is a nice room, the only problem being it is dark so you need the lights on during the daytime. If you are going to Venice during the months of Nov/Dec be prepared for floods, most people who had been before had wellies.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Haslemere Surrey", "Title": "“Romantic Luxury”", "Author": "Cranleigh", "ReviewID": "UR48184313", "Content": "Modest sized hotel with an attractive courtyard and private water dock three bridges up from the Bridge of Sighs which we could see (under its tarpaulin) from our room. We had a junior suite with antique furniture and mirrors and (closed) fireplace. Beautiful large room full of character with high celings and views onto the canal. A subdivided area contained another small bed/couch and writing desk. Free wireless internet was reliable, Unusually we had both a shower and a bath. Our teenagers had a superior double, fairly small but with a generous modern bathroom and a balcony with views of the courtyard. Staff were always pleasant and helpful (even offering to set a table when I appeared at 5mins before end of service at 11am in the breakfast lounge). This is on the second floor and is an unusually relaxed attractive room with an evening bar to one side. Once you find the hotel its central location is excellent. (Through Zodiac clock arch from Basilica then first right at the bank and left almost at the end after Angelos restaurant-hotel entrance hall up on the right). We took a private water taxi but high tide meant we were dropped off at St Marks Square on arrival-the boat couldnt get under the canal bridges. Not really a problem as it is only a few mins walk but delightful to be picked up at the private dock to return. We never ate at the local/associated restaurants as reviews were poor.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Amazing views, awesome location and great outdoor patio!”", "Author": "TravelBug1331", "ReviewID": "UR45494885", "Content": "This was one our favorite hotels in Europe. Our room (number 26) had the best views of the canal and the outdoor patio. My husband and I would leave the windows open at night and hear the gondolas go by. Great location, the hotel is a few steps away from St Marks Square. Their outdoor patio is so pretty at night with candles, greenery and bar service. Dona Palace had by far the best included breakfast, we were growing tired of the European cheese and cold cuts so my husband was stoked to find eggs, bacon and even mimosas for the last leg of our trip. Would recommend to anyone.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brookline, Massachusetts", "Title": "“Great hotel in Venice near Piazza San Marco”", "Author": "jbp19", "ReviewID": "UR43194186", "Content": "We stayed at this hotel for only 1 night before leaving for Florence, but it was an unforgettable stay. The hotel is tricky to find, in a maze of narrow pedestrian walkways near Piazza San Marco--we had to ask for directions twice. Our room was spacious, with comfortable beds, and an extra large bathroom. Our room overlooked a canal with a constant flow of gondolas...very picturesque. The breakfast was great, with a large selection of breads, cereals, yogurt, and a few hot items. We took ours outside, and ate on the adjoining terrace which overlooks a canal. the staff was helpful with stowing our luggage since our train left late in the day. We had a great stay, and would stay there again if we had the chance.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Lovely! Would Stay Again! Handicap-Friendly!”", "Author": "EdenSprings", "ReviewID": "UR37735051", "Content": "Chose this hotel due to proximity to St. Marks (VERY close!) and that it offered handicapped access rooms (traveling with companion in a non-motorized wheelchair who can stand & take a few steps with support). Did we LUCK OUT! First, do yourself a favor and take a Water Taxi from the airport--it's the way to go! Requires a moderate walk from baggage to the taxi dock, but they handle all the luggage. For wheelchair access, dock at the Hotel al Angelo, which is a sister property to Dona Palace--their front doors are just steps away from one another and they will handle your luggage transfer. The Angelo's dock is easier access for a wheelchair or if you can't climb steps. BTW, the wine bar at the Angelo is to DIE FOR! Fabulous food and even better service! If you dn't find what you want ont he menu, just ask. It's a Hell's Kitchen graduate, and was the BEST food on our entire trip! Bonus: The prices weren't extreme, either. Our room had plenty of space for the chair, the bathroom was enormous with a roll-in shower and dual rails for the toilet. We even had a small balcony (no chair access). Lots of closet space and very clean. Don't miss the continental breakfast on the 2nd floor! The room is ligh-filled and the food and service are excellent! The hotel offers a chair lift for those with limited mobility to be able to reach the breakfast room (the bar is also on this level). Tip: Call the front desk when you're ready to leave your toom and ask them to send someone to run the lift. It requires a key to operate it which is kept at the front desk. One of the best-kept secrets in all of venice is the first-floor courtyard on the canal. Cool and lovely--bring your camera for a never-ending parade of gondolas and taxis, a cup of coffee in the morning or a cocktail at the end of the day. Very private and rrestful! Just a short walk to St. Mark's, the Doge's Palace and the Bridge of Sighs (currently sporting a rather ugly advert sign). Be sure to take an evening stroll along the canal in front of the Doge's Palace and watch the gondolas bobbing in the moonlight--very lovely! This is an extremely old building that's been renovated, so some of the rooms are kinda funky in their layout, but they have high ceilings and lots of light. We were booked into a similarly-rated hotel in Rome at the end of our trip, and it was a total disaster, probably made worse because it failed in every cmparison to the Dona! Their Angello sister property also looked sumptuous, and I would consider it as an alternative.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Camberley, UK", "Title": "“Not quite the 4* billing it promised...”", "Author": "MarkRMC", "ReviewID": "UR37045650", "Content": "I booked the Dona Palace Hotel for a 3 night stay for my wife's 40th Birthday through the Airmiles website. I then contacted the hotel direct to arrange an upgrade to a suite (Room 12) at a reduced rate and to arrange for their 'Special Guest' Package (welcome drink, gift, biscuits and private taxi back to the airport). Prior to arrival the staff were extremely helpful by email and things boded well for the trip (our first to Venice). We used public transport to get to the hotel (San Marco Alilaguna stop) and after a shortish stroll through St Mark's, we found the hotel easily. We arrived about 9pm and were quickly checked in and shown to our suite. The Hotel. In a good location just off St Mark's Square and by the canal running up from the lagoon under the Bridge of Sighs. However, too close to the tourist traps (see below). The Room (12). Allegedly the best suite in the hotel. Clean, tidy and spacious bedroom with views overlooking the canal (and Bridge of sighs if you lean out!) and the hotel's courtyard. Bathroom fine, but nothing special and separate 'lounge' area, which was actually pretty useless with just a sofa in it. Breakfast. Part of the reason we booked the Dona Palace was for its inclusive full breakfast (unlike many other hotels). This was taken in the 2nd floor lounge and was excellent. Cold and hot buffet and possible to sit on the balcony overlooking the canal or in the air conditioned lounge. Sets you up well for the day, cutting down on the need for an expensive lunch! One drawback is that if you want breakfast in bed it is a 20 Euro (per person) room service charge! Service. The service in the hotel let it down. The hotel is part of a family of hotels and the main one appeared to be the hotel on the opposite side of the street (Di Angelo or something). This meant that there were limited public facilities and the hotel bar was not always open (not at all on the Mon of our stay), which is not good enough for a 4* hotel. Often staff were absent in the other hotel and even getting a cup of tea (at 5 Eruos!) was a chore mid afternoon. The hotel had also not arranged our pre-booked 'Special Guest' package and when I reminded them about our welcome drink (et al), the bar was closed! It was not disastrous, but we'd expected better. Restaurants. There is no restaurant in the hotel, but it has a deal on 3 local restaurants linked to the other hotel (a pizzeria, a standard restaurant and a swanky wine bar (HKs)). You get a 15% discount at these, but I would strongly recommend you don't use them! We tried Angelo's restaurant and even after the discount paid 120 Euros for a decidedly average meal. This was because the hotel and restaurants are just one street back from St Mark's. The second night we headed off the beaten track to a restaurant we found through Trip Advisor (Mascareta), which was half the price and 10 times as good (see separate review!). Departure. Checkout was 12pm and the hotel will look after your bags if you are leaving later. We left from the hotel courtyard on the private water taxi, which was excellent. A bit of weaving through the canals of Venice and then a blast across the lagoon to the airport (20mins in all). Overall. Although we expected Venice to be expensive, this hotel charged 4* rates for what was 3* service at best. You don't get any of the facilities of a modern 4* hotel either and we therefore felt a bit let down. However, it was in a great location, was comfortable and we still had a great trip to Venice once we escaped the main tourist traps. If location is your main consideration, then fine, otherwise I suspect you can find a better hotel slightly further out from St Mark's.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cary, NC", "Title": "“Great location and value”", "Author": "Jim_Cary", "ReviewID": "UR36993691", "Content": "We stayed at the Dona Palace for three days before an Adriatic Cruise. Only a few blocks from the P.San Marco, it was still out of the bustle, but an easy walk to the major sites. Staff was very helpful and spoke excellent English. We had a double on the front of the 4th floor. It was larger than I expected, clean and nicely furnished. The breakfast room featured a balcony overlooking the same canal that runs under the Bridge of Sighs, and is bathed in sunlight during the morning. A very nice garden and private dock also backs onto the canal. Breakfast was ample and could be supplemented for those who desired an even bigger meal. The same management runs two other hotels within a few yards as well as three restaurants. We didn't eat in any of the restaurants, but a nice discount was available to hotel guests and all looked reasonably priced and of good quality. Best likes: quiet, comfort and cleanliness. Least liked: Navigating the crowd in P.San Marco with our luggage to get to and from the Vaporetto. You could avoid that with a water taxi to the private landing.", "Date": "August 7, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Malta", "Title": "“Excellent.....”", "Author": "Married_Couple_Malta", "ReviewID": "UR36452116", "Content": "A very good hotel. Recommendable. Location was excellent, just a 2 minute walk to Piazza San Marco. We had a Junior Suite (Room 45) for 9 nights. The room was very spacious with LCD and 2 large windows overlooking the canal and hotel garden. The bed was huge and comfortable with crispy white bed linen every day. The bathroom was very functional and spacious with jacuzzi bath and shower including a window overlooking the canal. The breakfast was american buffet style with a good selection. Everything was very tasty and fresh. The coffee and desserts were exceptionally good. The staff in breakfast room and reception desk were always polite, helpful and efficient. With regards to bathroom cleanliness however, we did not expect to find brownish/green grout showing in corner tiles of shower and jacuzzi bath. Nothwithstanding, there was nothing we really disliked and overall the Dona Palace is a very recommendable hotel offering a comfortable stay within easy reach of major sights.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cincinnati, Ohio, US", "Title": "“Very nice stay, will go back!”", "Author": "carmella19", "ReviewID": "UR33952125", "Content": "This was our first night in Italy and we were spoiled. The location can't be beat, it is literally right off San Marco square. Our room was very nice but we were upgraded to a larger room than what we had booked, so I think the normal room would have been smaller. Very nice bathroom, mable everywhere, and everything clean. The breakfast was my husband's favorite out of our entire trip. For dinner I would recommend walking a little further away from the square, the restaurants within the block surrounding are too touristy - not great food. We loved Venice and would definitely like to go back. Would stay here again!", "Date": "July 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "England", "Title": "“Comfortable and good location”", "Author": "LovableLadyinEngland", "ReviewID": "UR33119727", "Content": "We went to celebrate our 10th anniversary....we pretty much were in the city during day time and only used the hotel to change and night time. As everyone would know, Venice is quite expensive and hotel is quite basic and clean and comfortable for where it is located. However, I would not consider it as a 4 star internationally....may be 4 star for Venice! Concierge services were most of the time helpful but as usual with any place, it always matters who is on duty at any particular time...i.e. some more helpful than others. Location was very good and for that reason, the price was fantastic compared to a lot of other similar hotels.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Plymouth, Devon", "Title": "“Nice but nothing special”", "Author": "LizNPlymouth_Devon", "ReviewID": "UR32677828", "Content": "We booked through Expedia, and chose this hotel because of its excellent reviews. Although it is in a central location and our room, while small, was very comfortable, and if we hung out one of the windows we could see the canal below! However, I was a little disappointed and considered it was pretty average compared to other 4 star hotels. The breakfast was nice, but we avoided the cooked options as we felt they were unappetising. We celebrated a special anniversary while there, and an acknowledgement of this by the hotel would have been nice. A bottle of sparkling wine would have cost them very little, but might have made us feel more special. We will probably try another hotel next time", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Terrific choice for starting our vacation!”", "Author": "JuanitaDallas_Texas", "ReviewID": "UR31912615", "Content": "Wonderful location, courteous and friendly staff, delightful ambience, outstanding breakfast, top-notch accomodations, a stone's throw from St. Mark's and right on a canal with a patio---ideal for relaxing and watching the gondolas go by---WHAT MORE COULD YOU ASK FOR?! I DO recommend arriving by water taxi. It's just too easy and so worth it!", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Poconos, PA", "Title": "“Perfect Location, Large Rooms, Helpful Staff, Clean and Quiet.”", "Author": "Bookman54", "ReviewID": "UR28005437", "Content": "This hotel was a splurge, but delivered! Right next to St Mark's Cathedral, private boat landing near the Bridge of SIghs, immaculate. My better half is a paraplegic in a wheelchair, and the spacious accessible suite, with extra roll-in shower, well suited us. Lavish and tasty breakfast buffet. Friendly staff. Location, location, location!!! We were able to walk/roll throughout the San Marco area, and the close docks for the very accessible waterbuses allowed us to get around to other Venetian neighborhoods and islands. Made an easy visit to a city that, with the bridges and steps, would have otherwise been difficult in a wheelchair. Money well spent to ensure a memorable visit to Venice!", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "st petersburg", "Title": "“great place”", "Author": "AH1908", "ReviewID": "UR23869301", "Content": "Great time beautiful juniorsuite with good view. very very friendly staff. as we decided to prolong our stay in Venice they booked us in their sisterhotel without hazzle, again upgrade to juniorsuite. good rate.", "Date": "January 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Fabulous Hotel in the heart of Venice”", "Author": "Lynne_Ken", "ReviewID": "UR23681922", "Content": "Fantastic Comfortable Stay. The rooms were huge! We booked a Junior Canal View Suite, and we were so impressed .It had 4 opening windows overlooking the canal. The main bedroom was huge with an oversized King bed and great pillows! There was a smaller 2nd bedroom, which we used as a dressing room. There was also a huge marble bathroom with spa bath! We felt so spoilt, but how many New Years Eve do you spend in Venice? The hotel was clean, had a great lift, a wholesome breakfast, friendly & helpful english speaking staff. It was very close to St Marks Square, yet felt quiet and secluded.", "Date": "January 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Very good location, incredible deal!”", "Author": "colbuck", "ReviewID": "UR23557621", "Content": "I confirm all positive reviews on this hotel. Rooms are nice and they are big for Venetian standards. Free wifi connection, too. Staff is very helpful, especially a maid named Angela who made every effort to feed my daughter (getting her a cup of strawberries in January!). Location is unbeatable: your are really 50 steps away from San Marco Square and the Rialto area can be reached in less than 10 minutes (walking). As others wrote, the restaurants connected to the hotel do not live up to expectations, at least the one we tried, which serves Italian style-food and pizzas across the street: however it must be said that the San Marco area is only for tourists, so these restaurants mostly cater for these customers and on the whole they offer the so-called \"tourist menu\" which is a 3-course meal for 15 euro. For a better culinaire experience, move to the Rialto area, crossing onto the west bank of Canal Grande. I recommend this hotel to anyone!", "Date": "January 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "uk", "Title": "“great experience”", "Author": "tim064", "ReviewID": "UR22422254", "Content": "Stayed at the Donna palace for a three night weekend break to venice with my wife and daughter. location is great, one minute walk to st Marks. Room was fabulous, v spacious with balcony, high ceilings and great full size bath. Staff were generally very courteous and helpful throughout the hotel. In general the service level and staff attitude was first class. Nothing was too much trouble and the service ethos of the hotel was very impressive. Definitely stay again if we visit again and would wholeheartedly recommend this hotel if you are contemplating traveling to Venice.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Angra do Heroismo, Portugal", "Title": "“Excelent”", "Author": "Miguel C", "ReviewID": "UR22204984", "Content": "It has an amazing location, 2 minutes from St. Mark's Square. Compared to many hotels in Venice, it worths it's 4 star rating. Good room, with excelente bathroom, elevator, extremelly nice staff. It was the perfect ending for our honeymoon. Miguel and Sandra.", "Date": "November 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago, illinois", "Title": "“\"Perfect in Every Way\"”", "Author": "chicago_young_couple", "ReviewID": "UR21671507", "Content": "1 minute walk to St. Marks square. Friendly staff. Big, clean and nicely furnished room. Breakfast was free and excellent. Stayed here for 2 nights in November with my wife (My wife and I are 30 years old). We paid 130 euro per night. Worth every penny. Stay here!!!", "Date": "November 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Neath, United Kingdom", "Title": "“wonderful!”", "Author": "lunalamb", "ReviewID": "UR21596062", "Content": "Just returned from 3 nights at the Dona Palace, it was marvellous. We had a room on the fifth floor up in the eaves so there were lots of wooden beams - full of character! The room was large for a standard double with 4 windows on one side. The bathroom was great and the beds were turned down each evening before our return. We had lovely complimentary fluffy dressing gowns and slippers - great for the colder November evenings after a shower! Breakfast was great and the service was excellent, both at breakfast and in the lobby. Would definitely recommend this hotel.", "Date": "November 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Just wonderful!”", "Author": "sammyjoo", "ReviewID": "UR20629165", "Content": "My husband and I stayed at the Hotel Dona Palace in August, and I can't adequately described how wonderful our stay was! The positive experience began even before we left Australia, as the contact at the hotel that I was making bookings with via the internet& email was very polite and thorough, and it was this level of efficiency that contributed to us making the decision to stay at the Hotel Dona Palace, as we had never stayed there before. Once we arrived in Venice we splurged on a water-taxi from the airport, and had a very romantic arrival at about 10.30pm, landing directly at the back entrance to the hotel (it has it's own mooring for taxis). Quick check-in, and the porter took us to our room, which was exquisite (from memory, room number 45?)! It was on the 4th floor with windows on three sides of the room. I was absolutely thrilled to find that when I leaned out of our window over the canal I could see the Bridge of Sighs (although sadly it was undergoing renovations and surrounded by scaffolding). We asked for a Junior Suite, and it was one of the biggest rooms we've ever had in a hotel, anywhere. Management had also arranged the chocolates and chilled wine that I requested, so everything about our check-in was perfect. With the windows and blinds closed, there was no sound from the alleyways below, although it was wonderful to open the canal windows in the late afternoons to hear the sound of singing gondoliers. It is literally a two minute walk to St Marks (ironically, it took us a couple of days to find the fastest route of all, but it was still taking less than 5 minutes going our 'long way'). And the immediate shopping area seems to have something for everyone (from traditional restaurants, to souvenir shops, to Venetian sweet stores to McDonalds!). The quality of the accommodation was great - the bed was very comfortable, the bathroom was terrific and there was lots of room for storage. The air-conditioner worked a treat as well, which we were grateful for in the heat of early August. Breakfast was included, and it was delicious. Served on the second floor in a beautiful, high-ceilinged room that had a balcony overlooking the canal, there was a selection available to suit most nations, and the quality of the food was first-rate. And the coffee was heavenly (even my husband, who rarely drinks coffee, was having it every morning in the breakfast room). We thoroughly enjoyed our stay at the Dona Palace and I would recommend the Dona Palace to anyone!", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nicosia", "Title": "“What an excellent hotel!”", "Author": "LoveToTravel1210", "ReviewID": "UR20445412", "Content": "This is such an excellent hotel! Recently refurbished, everything looks brand new and clean. I had requested a triple room and they gave us a suite with a beautiful bathroom and a double extra bed! Everything was so clean and well kept. The dining room is a beautiful room with a balcony over the canal, and the breakfast served was excellent. The staff at the front desk was so helpful and professional I was very impressed. The hotel owes two of the restaurants in the street where residents of the hotel get a discount. We had dinner in one of the restaurants and the food was great. And, last but not least, the hotel is in a great location, only a 2 minute walk from St. Mark's Square!!", "Date": "September 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, UK", "Title": "“Fantastic! Loved the Dona Palace”", "Author": "SJE1000", "ReviewID": "UR19571604", "Content": "Had a wonderful three night stay at the Dona Palace. I have been to Venice on a few occasions now and this has been by far the nicest hotel I've stayed in. Venice is an expensive place to stay and consequently, some of the hotels are a bit on the small and grotty side, however the Dona was well maintained and had a really nice feel about it. Location couldn't be better. The hotel is situated just a very short walk from St Marks Square. Nearby are some really good restaurants which are worth trying. The room was large and had a comfortable bed, a seating area and coffee table. The bathroom was also a really good size and had a separate shower unit. The bar area is impressive with marble fittings and fixtures and overlooks the canal. The breakfast was fantastic. Really good choice of cold buffet items and hot foods including eggs, sausages, etc. Overall, a great experience, lovely hotel and friendly helpful staff. Can't wait to go back!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Thumbs up!”", "Author": "chrisinsd", "ReviewID": "UR18896322", "Content": "We stayed at the Dona Palace for five days at the end of July 2008, and were so happy we chose this hotel. Check-in was a breeze, and the front desk clerk was extremely polite. Our room (33) was large, and air conditioned. It was a welcome relief from the mugginess outside. I was a little worried at first because our room was right above the bar area, but it wasn't a problem. The room was very quiet. Other good things about the hotel: The outside terrace is lovely. We spent a couple of late evenings drinking a glass of wine and watching the gondolas go by. Its location to San Marcos Square can't be beat. It's literally one minute to walk there, yet the hotel itself is extremely quiet. The breakfast buffet was good, and had ample choices. The one thing my husband and I found a bit odd was the music played during breakfast. For three days straight it was 70s hits. It got to the point where we were playing \"Name That Tune.\" We were actually a little sad when they moved on to more traditional music ... All in all, it was a great vacation, and the hotel was a large part of it. You won't be sorry if you stay there.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Hidden Gem”", "Author": "Lorrainefox", "ReviewID": "UR18275410", "Content": "Stayed here last year post cruise for 3 nights. The hotel was a hidden gem tucked away behind st marks square. The room was enormous with 3 sets of floor to ceiling windows overlooking the canal we could see the bridge of sighs from our room.The staff were very helpful and the breakfast was nice Would stay here again for sure.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location!”", "Author": "Sharon39", "ReviewID": "UR17910988", "Content": "We stayed in this hotel from July 11-July 14th. The location is amazing. Just two minutes from Piazza San Marco and smack bang in the middle of the San Marco district but you would never know it. It was so peaceful, once you closed the door we heard absolutely nothing apart from the occasional early morning \"traffic\" on the canal behind.The staff were extremely helpful and accommodating - which is more that can be said for some of the people we encountered in other restaurants and bars during our stay ( I got the feeling that some of them were more than a little tourist weary - but then whos surprised with over 12 million a year!) They found out that it was my birthday during our stay and delivered a beautiful gateau to our room with a small card. A lovely touch. Our room was on the small size (we stayed in a standard double) but it was beautifully kept looked out over the canal to the rear of the hotel. We would definately go back.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fantastic hotel.”", "Author": "LuckyMonky", "ReviewID": "UR17635630", "Content": "I stayed at this hotel in August 2007. This hotel is a beautiful quiet gem right around the corner from St Marks Square. Upon arrival in our room we found a welcoming letter greeting my travel buddy and I as Mr & Mrs. That was amusing considering we are both female, and no, we're not those kind of friends :) The hotel staff were courteous. The bartender served us a complimentary drink in the evening. The courtyard downstairs goes out into a small canal, and it was lovely to sit there and watch gondolas float past. Our room was spacious, clean, and comfortable with air conditioning, a balcony overlooking the water, and all facilities in good condition. Dona Palace is a great place to retreat to after wandering around Venice all day; itâ€™s so peaceful youâ€™d never know there is a busy St Marks Square just a few meters away. Couldnâ€™t find a fault with it - aside from our relationship status getting lost in translation, but that was a good laugh! I highly recommend this hotel.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "manhattan beach ca", "Title": "“Dona Palace was terrific!”", "Author": "ailee", "ReviewID": "UR16465909", "Content": "We stayed in Room 51 at the Dona Palace for two nights on our honeymoon. The room is at the top and can be reached by private lift from the 4th floor (or stairs). It has a private rooftop terrace with a full size jacuzzi tub. The room itself was extremely unique and large, with a modern bathroom. The decor was nothing terribly special, but who cares when you have a private rooftop terrace with jacuzzi? The location of the hotel is exceptional, and perhaps because we were on a top floor, we didn't notice any noise issues at all. What really made our stay special was the staff. Our luggage was lost enroute from Heathrow, and they were very diligent in checking on status for us. When we asked to have the jacuzzi tub filled and heated for use, they were very prompt. They arranged a gondola ride and dinner for us, and also, an extremely timely transfer to the cruise ship terminal. Everything ran like clockwork. My husband is diabetic and had neglected to collect his insulin from the minifridge when we checked out, but the staff found it and returned it to us before we left -- thank Goodness for that!! The breakfast may have been the same items every day, but, there were a number of choices so no need to get bored with it.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Great Hotel, location and value”", "Author": "finsda", "ReviewID": "UR16212773", "Content": "Stayed at the end of February 2008. Location was fantastic, only about 3min walk from St.Mark's Square. Hotel staff very friendly and efficient. Room large as was bathroom and very clean. Stayed on bed and breakfast with a typical buffet style breakfast which was fine. Brandy and coffee in the bar before bedtime was a treat in lovely surroundings. We booked a private water taxi from the airport which took us directly to the hotel jetty - fantastic way to arrive. (100euros) On the way back to the airport we booked a water taxi through the hotel. Surprisingly this was only 80 euros, 20euros less than the one we booked from the airport. Hotel does not have a resturant but they do give you discount vouchers at 2 nearby resturants. This didn't bother us though as we like to find our own way. Venice was fantastic and we will no doubt return at some point where we will definatelky book again at the Dona Palace.", "Date": "May 19, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "West Bloomfield, Michigan", "Title": "“Dona Palace is not a palace - don't go!”", "Author": "themidge714", "ReviewID": "UR15735312", "Content": "My husband and I stayed at the Dona Palace for three nights in late April/early May. We had just come from Amsterdam and Prague, where we stayed at two lovely hotels. Dona Palace was, to say the least,tremendously disappointing for the ranking it has been given and for the money that we paid for a junior suite. While the room itself was very nice - large, clean, etc. - the shower leaked into one part of the room and there was constant wetness, i.e., a puddle, on the carpet on that side of the room. We could have dealt with this if it was not for the noise and the heat. Venice was wall-to-wall tourists - and our hotel was located very close to San Marco Plaza, which should have been a plus. However, because of this, the noise from the tourists, the restaurants, the canals, and other commotion started at 9 AM and did not let up until 11:00 PM. If we shut the windows (which is what the hotel advised to keep out the noise), the temperature in the room soared to 80 degrees F - it was stifling, but quiet. If we opened the windows, we had a draft but could not sleep. However, hotel would not turn on the air conditioning. We spent two nights feeling either uncomfortably warm and unable to sleep, or disturbed by the noise and unable to sleep. Our room was also located by the hotel bar, so the loud music from that (although totally empty) was another disturbance, although reception did turn it off immediately when we asked if it could be turned down. At a room this expensive, all of this was just unacceptable. Breakfast was included in the price of the room. As I mentioned before, we had just spent time in two hotels in two different countries with large buffet breakfasts that were excellent. The breakfast at Dona Palace was horrible - the coffee was watered down and cold, the eggs may have been powdered, the yogurt was not that lovely Italian yogurt in glass containers, but a garden variety grocery story kind, cheese was in little foil packets, the bread was stale and the croissants certainly did not come from a bakery, and on and on and on. Above all, the total indifference of the front desk - with the exception of one person, who arranged for us to see a different room -was maddening. They were less than helpful when we asked what to do about the room on more than one occasion, and overall, we felt that the attitude was one of: \"Well, there are lots of tourists - we don't have time to please everyone.\" This was so different from the accommodations, concern, and friendliness that we received in the other two places that we were taken aback. We read TripAdvisor reviews all the time and our travel agent selected the hotel mostly based on the high ratings given Dona Palace. We usually think that those people who give low ratings to hotels are just \"whiny\" if all the other reviews are superior. This is the first time that we have written and now we see why. I would not recommend this hotel to anyone for any reason. Perhaps if it was after 5/15 and the AC could have been used, we would have had a different experience, but then, that would not have changed the service.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brighton, England", "Title": "“Good but not quite a \"palace\" for us”", "Author": "paob", "ReviewID": "UR14740081", "Content": "Good points: This hotel is in a great location, the staff were very friendly and helpful. The whole hotel is very well kept, very clean. Our room was on the 5th floor, so very quiet and quite spacious. Top tip: make sure you know where it is, stand in front of the Basilica in St Marks square, go down the alley to the left of the Basilica and take the 2nd or 3rd alley on the left (the last one before the bridge. Not so good: My friend and I booked a twin, but the 2 single beds were pushed together, so it was like a double. The beds were so hard and the room too warm so we didn't get much sleep. We would have liked to have a drink in the bar but it was empty every night that we were there. The breakfast was OK. We stayed for 4 days and it was the same every day, would have been nice to have had some variety. Tried to book a water taxi, through the hotel, back to the airport but it was 90 euros so didn't bother. One of the other reviews mentioned that there are no English channels on the TV, I thought this was funny as didn't think we would be watching much TV, but after a day walking around venice all day it would have been nice to just chill in the room and watch a program with a nice cup of tea (no tea making facilities in the rooms). On balance, I would stay at this hotel again but ask for a different room.", "Date": "April 2, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Paltz, New York", "Title": "“Good Hotel-Good Location”", "Author": "mschneider", "ReviewID": "UR14332590", "Content": "Stayed off-season at a discounted rate. Had no problems with the hotel at all. Room was perfect and surprisingly big for cramped Venice. WiFi internet was free (you have to get a password at the front desk), and the breakfast buffet excellent. My only interaction with the staff was at check-in/out, and they were very friendly and efficient. Location was excellent-just off St Marks Square. Finding the hotel was tricky. The map on the hotel's own website links to Google Maps, and it screwed up on the location big time. I spent almost an hour looking for the hotel. Rick's Steves guidebook has the location accurately on it's map- if you pass by a McDonald's, you headed in the right direction. Be warned that the food in Venice is mediocre! Most all restaurants in the tourist areas cater exclusively to tourists so they don't have to rely on repeat business.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Great Hotel”", "Author": "bschwed", "ReviewID": "UR13074784", "Content": "We stayed at the hotel Dona Palace for 3 nights. It was wonderful. Easy access to all of Venice, very helpful staff, and a nice breakfast buffet. The rooms were great, with nice beds and a TV. Our room did not have a view though. However, with it's great location in Venice, we were able to have plenty of fun and easily get anywhere and do what we wanted. Great Hotel!", "Date": "January 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great location, but not a whole lot else for your money”", "Author": "EPJD", "ReviewID": "UR12883052", "Content": "We are a family of 6, youngest is 15, and we stayed at the Dona Palace for four nights over New Years Eve. Overall, the hotel was adequate, but not great value for the money. We reserved two suites. The suites were large enough and each had a separate sitting area with a pull-out couch that served as a second bedroom for our purposes. The rooms were clean, but not very comfortable. The pillows weren't very good, and the two pull-out couches were very uncomfortable. We had to ask for a second mattress for each pull-out just to get a good night's sleep. The rooms didn't have any furniture other than the bed, a small table with 2 chairs, and a desk with a chair. You would expect a suite to have more comfortable furniture for sitting and relaxing. We were more comfortable in other hotel suites and junior suites where we stayed during other parts of our trip. The rooms were not very well-lit. The bathrooms were fine. As we were warned by other reviews, the hotel really pushed their own restaurants. This was frustrating because we were there over New Years Eve and had hoped for some good recommendations for the holiday. The staff at the front desk was not helpful; they said we should walk around and see if we found anything appealing on our own. Even when we asked about restaurants weâ€™d read about, they didn't have anything helpful to offer. They directed us to a very touristy dinner show and acted annoyed when we asked for advice. When we asked them to call to make reservations for restaurants we found on our own, on two occasions they forgot or just never did it. However, service outside of the front desk was very good. The buffet breakfast that was included with our rate was in a beautiful room. The one young woman who waited tables was very helpful and friendly. The breakfast spread was very adequate and tasty. The hotel was a little difficult to find, but when we arrived we called the front desk and they walked us through it step-by-step. Of course, if you don't have an international cell phone, this would be a problem. Once we arrived, the location was great. Very close to San Marco's square and the vaporetto stops, and in easy walking distance to other neighborhoods. The view of the canal out of our windows was beautiful, and we could even hear the gondoliers singing. It could get noisy, but shutters on the windows helped. Overall, the hotel was clean and in a great location. But at the rate of 580 euros per suite per night, it was lacking any extras and certainly had no examples of â€œluxury.â€� We expected much more comfort and service at such a high rate.", "Date": "January 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Huddersfield", "Title": "“Fantastic location”", "Author": "Sar_hudds", "ReviewID": "UR12377901", "Content": "What a fantastic location!! It makes so much difference being really close to absolutely everything. The hotel is a little tricky to find, down a back street off the North Eastern corner of St Marks square. I recommend printing off the Expedia directions to the hotel before trying to find it. The (standard) room was really clean with good decor, appropriate to the general style and periods one would expect. The beds were comfy and the carpet clean. In our room the carpet even seemed new, very plush! The bathroom is also very clean and included a bidet, the only downside being there was no bath (rm 11) which is disappointing when the weather is really cold. The hotel is very quiet, however you can hear the bells of St Marks from the room and occasional activity/singing from Gondoliers on the canals at the back of the hotel. The staff were really friendly and very helpful and spoke very good English. The restaraunts in the immediate area varied greatly. We would definitely not recommend Da Celio which was overpriced and virtually inedible!! Airport tip: Turn left out of the airport building and follow the white semi-covered walkway to the ferry (Alilaguna) 12 Euros to the mainland, instead of getting the bus which takes forever and is usually crowded!", "Date": "January 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riverside, ca", "Title": "“Excellent location, great staff. . .”", "Author": "adelaidetaylor", "ReviewID": "UR12359840", "Content": "We booked this hotel through a tour, along with plane, train, and transfer reservations for Rome, Florence, and Venice. We were very pleased with the location, and feel we got an excellent room for our money. We didn't ask for an upgrade even though our elegant room faced the outer wall of another building over a narrow walkway. There were plenty of views of the city to be had by just walking a short distance. The breakfast was fine, with hot choices as well as juices,cold cuts, cheeses, yogurts, fruits, cereals and pastries. We were within moments of St. Mark's Square and could hear the New Year's Eve celebration going on. Our phone didn't work properly, which was a problem because we had some money / credit issues to resolve, but the management dialed all the numbers for us. Also, our TV didn't work, but the staff also promptly replaced it. Overall, we would recommend this hotel as a value considering the outrageously high prices in the city of Venice. Do not plan on eating in the All'Angelo restaurant, even though you can get a discount from the hotel. The food is overpriced and not as good as it could be.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Wonderful find”", "Author": "MarkNYCity", "ReviewID": "UR12201934", "Content": "A small hotel hidden just off St. Mark's Square. Beautiful large room, with a large marble bathroom. The room where breakfast is served has a balcony overlooking the canal. A real gem.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N. Ireland", "Title": "“Rooftop Hot tub Amazing!!”", "Author": "Amca123", "ReviewID": "UR11883219", "Content": "Booked the executive suite for last two nights of our honeymoon. A little more expensive than the suite but worth evey penny. Room was huge!! Few steps up to super private rooftop terrace plus hot tub. Amazing view across the city. Didnt want to leave the rooftop but had to do a bit of sightseeing! Staff were excellent, especially considering the bank machine swallowed our card on the final day of our honeymoon = no money to pay bill!! Staff were more than helpful . Will def return to dona palace, would recommend arrive/depart by water taxis!", "Date": "December 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Loved the suite, worth the money”", "Author": "tavia14999", "ReviewID": "UR11105303", "Content": "Wanted to stay centrally and the Donna Palace has an amazing location. Going in November meant we could take advantage of the low season and get a good deal. We went for a canal facing suite which at 195 Euro wasn't the cheapest room we could get but were paying for extra luxury and we were very pleased with the room with three windows onto the canal, we were regularly treated to singing gondoliers going past. (only at sensible times though). The rooms were a nice temperature and it was lovely to have the extra sitting room to relax in. Breakfast was nice, although the cooked element wasn't brilliant but it isn't very italian thing to do. The rooms were clean and had lovely furniture in it. The staff were helpful and very attentive. They tried to go out of their ways with extra touches like a free welcome drink and leaving drink. The only downside was a slightly dodgy whirlpool bath. I had to get someone to show me how to work it which involved switching on the power at the circuit and then it kept coming on and off. It was funny though and very bubbly. Got the hotel taxi to the airport and absolutely loved leaving in style. Much more glamourous than the aliguna which we got on the way into Venice. It was 70 euro through the hotel which was a good saving. I loved Venice at the end of November, I've been at the end of October before and found November much more pleasant. It is much quieter, the queues for historic sights were smaller and actually non existant on the Monday. I'd recommend eating at the Alle Testierre if you like fish and Trattoria da Arturo (also listed as vina da arturo) if you want meat or vegetarian food. Both are tiny though and very popular with locals and visitors so will need to be booked in advance. Also they aren't cheap but the food is beautiful", "Date": "November 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Super Central Hotel”", "Author": "galavanter", "ReviewID": "UR11001896", "Content": "This hotel was so handy to everything. We arrived via Alilaguna boat from Marco Polo airport & found the hotel quite easily given the directions in a few minutes.The room we had was small but perfect otherwise - we heard that some of the other rooms were bigger but we were happy enough. Breakfast was very good & goes through to 10.30 am should you fancy a lie in. They did not give us free Bellinis as stated in previous reviews just 20% off a drink on the day of arrival - we did feel like using it that evening but did have cocktail on the last night - nice little touchs added . We did not use the hotel's 3 local restaurants as we wanted to go to other areas. Tourist menus varied from 12 - 22 euros but the wine can catch you out - we paid 38euros for a bottle of Pinot Grigio .Each evening whilst we were out our beds were turned down & the weather/welly forecast was left with some sweets. We did not need the wellies but San Marco square was prepared for high tides with foot high bench walkways stacked up waiting. The hotel is quiet but you can hear the bells from the square & the gondolas early in the morning . We took the vaporetta to Murano - don't get off until the Murano Museo stop or you will be 'invited ' to a tiny little glass factory - there are others bigger better & more central. Hotel Taxi to airport 70 euros", "Date": "November 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Belfast", "Title": "“The Smallest Hotel Room in Europe”", "Author": "honeymoonjb", "ReviewID": "UR10593860", "Content": "After much deliberation I booked Dona Palace for Halloween for 4 adults and one child, based on reviews in Tripadvisor. I booked a double and a triple room. I was led to believe that the hotel would do everything it could to make a special event, special - upgrades/wine on arrival etc. It was both an anniversary and a birthday celebration, so I contacted the hotel directly to check if an upgrade was available, or at least a room with a canal view. I was sent a price list, but emailed prior to arrival again requesting the upgrade and said it would be worth it. I read on Tripadvisor that the rooms were \"palatial\" - ours was the TINY room trapped between the lift (noise all night) and the bar/restaurant (clanking glasses all night and the smell of food from 6am) on the third floor. The bathroom - to reach the toilet we had to close the door to avoid injury, as the toilet was actually behind the door which swung open all on it's own. Our room was directly above the main door of the hotel. When we arrived I requested a room change immediately, but was told there was nothing available and to check again in the morning, so I did. I was told that this would cost 150 euros per night extra for each of the 2 nights. The staff checked I'd emailed and whilst they were apologetic, they did nothing to even change our room to another of the \"same\" standard. The other couple and their daughter who travelled with us also had a \"standard\" room - but this was on the fourth floor and was huge in comparison - fair dues, but the receptionist told me that theirs was the same standard as our room - it wasn't even in the same league! Oh, and the view - on the website it states that EVERY room has either a view of the canal or courtyard. There was no mention of the wall of the opposite building, which we could nearly touch - out of BOTH windows. I was so disappointed with this hotel. On the plus side, the hotel was close to San Marco.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "reefscape", "Title": "“An Authentic Venice Experience”", "Author": "reefscape", "ReviewID": "UR10389456", "Content": "If there is one hotel experience I wouldn't hesitate recommending, it would be Dona Palace in Venice. It probably ranks amoung the best when it comes to situation in Venice. We actually divided our stay in Venice between two hotels. The other hotel was much less central and, although they had nice rooms and a very decent breakfast, we wish we would have spent the whole week at Dona Palace. Dona Palace, as we understand it, was once a residence for one of the Doges. It is right on the same canal which runs behind the Doge Palace. We had a side-view from our room onto the canal and a small bridge over the canal. When you step out of the hotel you are a stones-throw to Saint Mark's square and if you go the other way you will encounter several small bridges over a fork in the canals running behind the hotel. The breakfast room was also amazing, adding to that true Venice experience. It is probably in what was once the \"grand sal\" of what was once that Doge residence. The included breakfast was, in my opinion, of 4 star value, and in the afternoons it was possible to order a wine and sit on the balcony overlooking the canal underneath. As most hotels in Venice are expensive, you will have to spend some extra money anyway for lodging, and I believe that the difference between what you pay at a \"cheaper\" location will not make up for what you will lose in terms of a very authentic Venice experience.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Decatur, GA", "Title": "“Wonderful location -- huge room!”", "Author": "The_Madcap_Gadfly", "ReviewID": "UR10203788", "Content": "The Dona Place is located couple of blocks off of St. Mark's Square. It's a great location for sure. We had an extemely large room, a suite, I think. It's furnishings were maybe dated by design standards but in great condition. I guess some people care about these things -- not me. The bathroom was also huge. The hair dryer are tube had a few holes in it due to it being yanked around, but what the heck. Wonderful breakfast included. The staff was friendly and very helpful and spoke great English.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great hotel and location”", "Author": "Travelkit", "ReviewID": "UR8687414", "Content": "Stayed here on the first leg of our honeymoon for four nights during August. Booked a junior suite. Fantastic room overlooking hotel terrace and canal. Had informed hotel that we were staying there as part of our honeymoon and when we arrived there was a bottle of asti spumante in our room and a congratulatory note for us. Huge room, very clean and comfortable with spacious bathroom. Only a short stroll to St Mark's Square. Found staff to be helpful. Only downside: no iron in room (not permitted under Italian law, apparently). Laundry and pressing service was available, but it's off-site. We rang one evening about 7.30pm to get some clothes pressed before we went out for the evening and were told the service wasn't available until the next day as the cleaning staff had left for the evening. So be warned: bring a travel iron. Apart from that, no problems. Very generous breakfast buffet and if you're early enough and the weather's ok, you can sit out on the balcony overlooking the adjacent canal while you eat. Late one afternoon we sat there and ordered cocktails, which arrived with a tray of canapes, and other snacks. Next day did the same: no canapes that time. So, lack of consistency that way. But generally can't fault the hotel at all. Really a fantastic spot.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Carolina", "Title": "“A Palace in Venice”", "Author": "nucleon", "ReviewID": "UR8496542", "Content": "We came to Venice to pick up a cruise, and stayed in the 555 Euro/night Westin the first evening. It was quite nice, but one doesn't need to spend that kind of money for a nice room. At the end of our cruise, we took a water taxi from the port to San Marco Plaza, as the driver didn't know how to go directly to the Dona Palaces dock (or wouldn't attempt it for whatever reason). So we ended up walking with our bags, but fortunately, the hotel is only about 2 blocks from the northern edge of the square. The hotel was delightful. This was indeed an old palace, which had most recently been a bank, but was converted to a hotel 4 years ago. The room (#24) was palatial, with high ceilings having intricate wood work, and a huge though capped fireplace. The bath was entirely new and modern, and had a separate 2.5x2.5 foot shower. I mention this because the shower at the more expensive Westin was LESS than 2x2 feet square! There was a modern wood divider separating the huge room from a smaller second bedroom area. Not much of a view, but you can walk outside for that. The only glitches involved the front desk. They could not cash a traveller's cheque, and there was considerable pressure to take a \"free\" trip to the glass factories at Murano. The internet went down one evening, and I could not convince the fellow at the desk that it was their system and not my computer at fault. It came back up later in the day. The breakfast was included (although we were charged 40Euro for the morning we arrived), and while not particularly lavish, it was quite good with considerable variety. Overall, this hotel was delightful, and I would stay again if I should ever return to Venice.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Close to Piazza San Marco”", "Author": "TrapezeFlyer", "ReviewID": "UR8422801", "Content": "This is an absolute \"find\" for Venice. An honest 4 star hotel located on a quiet street, only 3 blocks from the tourist center of Piazza San Marco. Ask for room 26, a corner suite on the second floor. The HUGE bedroom looks out on the central courtyard while the living room window is directly above the same canal as the fabled Bridge of Sighs. In the afternoon you will be seranaded by the gondoliers passing just beneath your window. The bathroom is all marble with a jacuzzi tub. The breakfast, served in a lovely dining room is adequate. At 250 Euros (booked on Venere.com) it's not a bad deal for very expensive Venice. You can save the 100 Euro water taxi (which deposits you directly at the courtyard entrance) by taking the vaporetto (the nautical equivalent of a public bus) to the San Marco stop and then walking 10 minutes to the hotel. However don't try this if you are overloaded with baggage (a great reason to travel light) as you'll have to negotiate the steps of 3 bridges which cross the canals between the vaporetto and the hotel.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Book this Hotel--You Will Love It!!!”", "Author": "trvlnywr", "ReviewID": "UR8378751", "Content": "Great Location, great staff, great food, clean. The location is superb, just off St. Mark's Square. Would definitely stay there the next time we travel to Venice. Stayed at the Donna Palace late July, just returned from Italy and none of the other hotels we stayed in came close to the Donna Palace. Little did we know we were seeing the best there was at the time.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“lovely place , excellent”", "Author": "Steve_G_W", "ReviewID": "UR8350646", "Content": "Loved the place , great room , great view of the canal. It is not the biggest place by any stretch of the imagination , however the rooms are a good size. There is a pleasant lounge , I am actually here now writing this review. The breakfast is ideal , something to suit everyone. It is located less than a minute's walk from San Marco Square , which is the centre of Venice. Breathtaking place. Can I recommend going to the Lido. It is beautiful and there are numerous beautiful beaches. It is 16 kilometres long !!! Can I recommend to those wishing to go the lido to hire a pedal bike from the shop opposite the water bus station. It is only 8 euros for the whole day. A great way of getting around. Enjoy the hotel all. I would put photos but the last set I tried to put on for this review crashed my computer so I wont bother this time. And also my girlfriend is asking why I dont go and buy her a drink.............. ciao !!!", "Date": "August 4, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Best Location in Venice!”", "Author": "conntraveler_7", "ReviewID": "UR7972067", "Content": "Just returned from a Celebrity Millenium cruise ending in Venice. After reviewing a myriad of reviews of Venice hotels, we selected the Dona Palace. The location is ideal away from the noise and hustle of San Marco yet only two minutes walk away. The rooms are modern and upscale with amenities you would expect from a four star hotel. The hotel had a modern elevator and the air conditioning was fantastically cold. The hotel staff were all courteous and efficient. We along with another couple had trouble with our reservations (our travel agent's fault) and the front desk handled it with ease. The hotel has two distinct advantages: there is an expansive breakfast buffet (7:30-11:00 A.M.) included in the room price and an outdoor courtyard right off a canal where you can relax, read and get bar service. We used a private water taxi from the marine terminal that the ship uses for luggage pick-up (one minute walk from the terminal - 95 euros) which took us to the aforementioned dock of the hotel. Given four people and eight pieces of luggage, what a blessing! The hotel also ordered a water taxi to the Venice airport leaving directly from the hotel (85 euros up to 4 pieces of luggage then 1.5 euro extra per piece) again what a relief! We did not try the restaurants owned by the hotel. A block away parallel to the hotel is the upscale Di Forno. Finding the hotel: go the upper right corner of San Marco Square towards the canal. Before you reach the bridge you will see a large kodak sign hanging on the right side, turn left there and go straight a block and one-half and there is a small sign for Dona Palace on the right!", "Date": "June 23, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lisbon", "Title": "“Excellent location”", "Author": "lionbravo", "ReviewID": "UR7869850", "Content": "We stayed at the Donna Palace on our honneymoon 14 till 17 May. The hotel is very nice (not very big) with nice clean rooms toward one litlle chanel. It has one pretty litle courtyard facing the channel where you can rest and see the gondolas movement. The better is the location near St. Marks but far fom the big crowds.In the zone are many restaurants one of the better is Al conte pescator . But in the castell zone there are much more an cheapper. The better way to get the hotel from the airport is by alilaguna boat till san marco and then walk 10 min. The breakfast is very good and served in a spacous and wonderfull place. Only thing we regret is staff that is not very calourous - they didn't do nothing after we told them that we are in honeymoon.", "Date": "June 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Great Little Hotel”", "Author": "Mylisa1", "ReviewID": "UR7830303", "Content": "We booked this hotel by reading other peoples experience on Trip Advisor. The hotel has it's own dock so the water taxi was able to drop us off right at the hotel. We were greated courteously and my husband and I were upgraded to the Honeymoon Suite. We had a whirlpool bathtub and seperate shower, sitting room and the ceilings must have been 3 stories high. My mother-in-law and brother-in-law had regular rooms but they were very nice as well. Hotel and rooms were very clean. Breakfast was very good and complete. Also the location of this hotel is hard to beat. We would stay at this hotel again", "Date": "June 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Great Value”", "Author": "MiriamX", "ReviewID": "UR7701053", "Content": "Spent a long weekend at Dona Palace. Very pleasant stay. On arrival we were allocated the largest room we have ever had in an Italian hotel . Our room was a corner room with three windows overlooking the canal. Breakfast was great and the hotel was steps away from St Mark's Square. Well worth the visit!", "Date": "May 26, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great location”", "Author": "Esther32", "ReviewID": "UR7554570", "Content": "We stayed at this hotel for 5 nights in April 2007. We booked a junior suite (Rm 48) which was quite large and had a view of a side canal. The room was very large and well appointed with free wifi. Two of three people at the front desk were very helpful and nice. The third person just had no warmth. The location of this hotel was perfect. 1 minute walk to St. Marks, a five to ten minute walk to the Vaporetto (depending on crowd density). The hotel has its own dock so if you take a water taxi to or from it, it is very convenient. They have their own water taxi that you can book with them at quite a lower rate than usual (50 euros to the cruise port for example). The breakfast reom is beautiful and has a full spread including eggs and bacon as well as pastries, cereals, fruits and yogurt. We would stay here again in a minute if we want to be in this part of the city.", "Date": "May 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool UK", "Title": "“Great Place the Palace”", "Author": "Will_30something", "ReviewID": "UR7283525", "Content": "Just returned from a perfect 3 night stay in Venice. This was partly due to the location and quality of the Dona Palace. We were in room 26, it had a jacuzzi bath, sitting room and large double bedroom with views over the canal behind. For 880 Euros we thought it was lovely. The staff provided us with great recommendations for restauants every night and the included breakfast meant we were well filled up every morning. The only problem was finding the place initially. The street on which the hotel is on is not on any of the maps that I had sight of, however it was perversely quite easy to find. Just get off the vaparetto at St. Marks Square and walk in to the directly opposite corner, walking next to the palace patricale, then before you cross the bridge take the last left turn and if you head up that alley 50m, which then crosses another alley, then the Dona Palace is on the right hand side. It is much easier than it sounds and you will be grateful of its easy accessibility. Rialto Bridge is also within 3/5 mins walk, depending on your shop browsing! On the last night had one of the best meals ever at the Restaurante Antico Pignolo where Giovanni took extra special care of us. We arrived 5 mins early for our 8pm reservation, the table was not ready so we were asked to wait. Not really a problem, especially when we were given two glasses of champers each, then olives, then mozarella and tomatoes, then bread, then some wonderful risotto, by this stage we were thinking that we didn't need a meal. We were very pleased that we did though, superb melt in the mouth steak and sea bass, v. pricey, but so worth it! When arriving and leaving the best thing to do is catch the hotel's own water taxi, for 35 Euros. It is very cool pulling under the bridge of sighs and being dropped off only 75 metres away! All in all a wonderful weekend where my princess was pleased with my choice of palace!", "Date": "April 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "berkshire,uk", "Title": "“Fantastic hotel and service”", "Author": "KammiB", "ReviewID": "UR7153751", "Content": "After reading the reviews I booked this hotel for a surprise weekend away for my boyfriendâ€™s birthday. We went for 3 nights from March 9th 2007, and the whole stay was fab. We had a standard double which was a reasonable size and nicely decorated, the only thing we found was it tended to get very hot in the room, which wasn't a huge problem as we opened the windows, although be aware of the mosquitoes. Also the room we stayed 34 is directly above the kitchen area so it can get a bit noisey round breakfast time, which can be a problem if you don't intend getting up so early or are a light sleeper. The staff were very nice and helpful, I wanted to surprise my boyfriend on his b'day with a champagne breakfast in bed, however my boyfriend is a coeliac so obviously can't have the usual breads and pastries etc. The staff were very friendly and accommodating and made sure his breakfast was gluten free, they were also very discrete about the surprise. The day after the surprise breakfast, when we went down for breakfast as normal the waiter bought out some gluten free crackers for him so they must have bought them esp after they found out he was a coeliac which I thought was very sweet. The hotel is 5 mins away from the st marks square and very conveniently located. For food we didn't go to any of the restaurants near the square, recommend walking a bit further away and going somewhere where the locals eat. We found our best meals were at the two places we went on our last two nights. One was an Oestria (family owned) and another modern restaurant. Both places had locals eating there and their menus were in Italian, no translated menus to attract tourists. The staff are more then happy to translate the menu for you, and these places were not as pricey as the other restaurants we came across near the square or the one we ate at on the first night which had average food but highly priced. Also to any other coeliacs out there worried about going to Venice, the food is not a problem. Restaurants know about the allergy and seem quite informed (the places we went to were). Alot of the tourist places do mainly pizza and pasta dishes but majority of restaurants do a fair bit of seafood and not as much pizza and pasta as you may expect. So food was never a problem for my boyfriend.", "Date": "March 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Isle of Man", "Title": "“Great All Rounder”", "Author": "Cowley", "ReviewID": "UR6917330", "Content": "I was taking my Mother for her 80th Birthday, so needed a Hotel in a good central location. The Hotel Dona Palace was just that, just off St Marks Square. We had a junior Suite (room 45), very comfortable and spacious room with jacuzzi bath (no tea making facilities though) good view onto the canal. Reception Staff very polite and helpful. Roberto the breakfast waiter and his staff were very attentive & the breakfast provided had a great choice. A lovely terraceed area to enjoy drinks on and also provides a docking stage for their own private boat. (which we went back to the airport on) They provided a free water taxi trip to Murano and glass factory, provided a free complimentary drink on our first night. The whole trip was great and the Hotel was conveniently situated for all attractions.", "Date": "March 5, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wales, UK", "Title": "“Excellent for a first time to Venice”", "Author": "kristaWales", "ReviewID": "UR6906703", "Content": "We are 2 female friends in our 40s and travelling for the first time independently - i.e. booking our own flights and hotel. We wanted to be safe and comfortable and the reviews about this Hotel hit the mark. We were travelling from Treviso and were advised to get a return bus fare and 3 day vaporetti pass. When we got to Venice we found the right stand to get 'into town' after some confusion and it was raining. We had been advised the hotel was equidistant to Rialto and San Marco - we got off at Rialto but found it quite confusing to find the hotel. My advice is to get off at San Marco - longer on the boat but shorter on the legs! We had a standard room that was snug - the beds were singles (I had requested a twin room) but pushed together - we're good friends but not that good. There was some room to move them apart but not much. However the room was a minor niggle as we weren't in it much and actually paying for a basic room in a good hotel meant that we had the facilities that one would expect of a hotel with deluxe suites - the breakfast area and breakfast was excellent, as was the courtyard. Our room was very quiet. We would definitely go back. We ate at one of the affiliated hotel restaurants and would not recommend it - very ordinary and the discount still does not make it value for money. For other meals we followed recommendations in guide books and had great (if dear) food. I would recommend the Doges palace for a visit (beware we spend 5 hours there and missed lunch - but worth it - there is a coffee shop well worth a visit to break up the trip) Best bit of the trip was the Vaporetti - we spent one whole day on it and it was a wonderful way to see Venice", "Date": "March 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great hotel”", "Author": "lizarm", "ReviewID": "UR6893988", "Content": "Venice: Dona Palace February 2007 Reviewer: Three Female Trip Advisor members Three of us - all over sixty and interested in painting - stayed here in February. The hotel has been converted from an old palace and is very well placed, just behind St Marco's square, making sight seeing and shopping in that area very convenient. You could just about see the Bridge of Sighs from our window! The rooms were large, elegantly furnished, comfortable, well appointed and spotlessly clean. Everyone in Reception was very friendly, spoke excellent English and gave us helpful tips on finding our way round. We had free Bellini cocktails the first night and the breakfasts were delicious. There was no restaurant but the hotel owns several restaurants close by where they offer 15% discount. The food here, however, was pretty standard tourist Italian fare. The hotel has its own landing stage and water taxi but unfortunately this was broken when we were there. They fixed up for us to have a water taxi from the airport through another firm but it was expensive - 120 Euros. The return taxi from the hotel was cheaper at 85 Euros. We would all go back and stay at this hotel. The location is incredible and it has a friendly intimacy and elegance that makes a stay very relaxing.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“outstanding hotel & service”", "Author": "macfamilyNj", "ReviewID": "UR6842504", "Content": "We stayed for 2 nts at this beautiful hotel & we cannot say enough good things about it. it's in a great location.the hotel is beautiful with great amenities. the breakfast included was incredibly good. They even offered a welcome coktail! But it ws their service which really won us over. We forgot our passports in our previous hotel & they called them & made all the arragements to have them express mailed to us. We received them in less than 24 hrs! we'd definitively would go back.", "Date": "February 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“wonderful location”", "Author": "jayjaygee", "ReviewID": "UR6832534", "Content": "We have just returned from a whirlwind 3 days in Venice. We stayed at the Dona Palace which is a delightful small hotel located just behind St Mark.s Square and within easy walking distance of all the main attractions. We followed instructions on how to find this hotel from a previous review----thankyou very much. We were there in minutes after landing at the water taxi rank at San Marco. Our room was ready and was delightful. Large beautifully furnished and with a huge luxury bathroom.. We were offered a welcome drink and shown to the bar. We had breakfast here and that too was lovely. A combination of Italian and American.......wide selection and in a lovely setting.. After 3 days of wonderful sight seeing I was able to check in online at reception and also booked a private water taxi for our return trip to the airport. This ended our break in style and we highly r ecommend this hotel.It was perfect.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“nice hotel, good customer service”", "Author": "poodleby", "ReviewID": "UR6438202", "Content": "overall a good experience apart from on the third day i had a problem with the shower cubicle: the perspex door was unsecured and slid off its runners, falling onto the other side of the shower. the hotel reacted way beyond my expectations: within 10 mins i was upgraded to a suite and later when i came back to the room the hotel manager had provided a bottle of brut on ice and a luxurious cake with a personal apology. clearly the hotel takes this kind of thing seriously. the hotel itself is spotless, breakfast is nice and includes scrambled eggs and bacon, the reception staff are incredibly polite. i couldn't have got better value for money anywhere else in venice during december and i'd done enough research before i went. the proximity to the square is very convenient for the vaporetto stop.", "Date": "December 13, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hove, United Kingdom", "Title": "“Absolute perfection”", "Author": "Bren H", "ReviewID": "UR6124461", "Content": "My husband & I returned from our first trip to Venice yesterday and I have to write to say how wonderful this hotel is. It is so closely located to San Marco and yet, being in a side alley backing onto a small canal, it is very quiet. We checked in and the porter took our luggage to the room (23). We were a bit concerned because our room was directly off of the lounge bar/dining room but we need not have worried. Apart from hearing the breakfast being prepared at about 7am each morning, the noise was very minimal. The room was amazing....it was so big and lushly carpeted in red with a huge king size bed and loads of lovely brass lights. The huge bathroom was also amazing.....2 basins, a shower cubicle and a whirlpool bath. We had a curtesy room safe and a well stocked mini bar with very good red and white wime and bottles of sparkling wine as well as every spirit and mixer you could require and it was replenished daily. The room was scrupulously clean and the bed sheets were changed every day. The complimentary 'American' buffet breakfast was faultless. As previous reviews state there was fresh fruit salad, yogurts, croissants, rolls, jams, marmalade, cheese, boiled eggs, scrambled eggs, bacon, cold meats and a selection of cakes every morning. They supplied any type of coffee you request. we requested decaffeinated and it was no problem at all, equally you could drink cappucinno....whatever and the gentleman who oversaw breakfast truly was a gentleman who made you feel very important. Sadly, it being November the weather wasn't warm enough for us to benefit from the charming courtyard but I imagine it would be wonderful to enjoy a drink sitting there on the canal at sunset as it is a lovely setting. Reception staff varied. When we asked about help with our on line check, one receptionist simply directed us to the nearest Internet cafe although they clearly have Internet access on the desk. Later that day when the shift had changed I asked Stephanie the same question and she willingly logged on to BA.Com and checked us in on line, it taking only a fews seconds. It pays to check who is on duty. Overall we could not fault this hotel, would not hestitate to stay there again or to recommend it. Its is the best, definitely a 4-star and very reasonably priced for its location.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cyprus", "Title": "“Just Perfect!!!”", "Author": "sdimitri", "ReviewID": "UR6013300", "Content": "This hotel was perfect for my wife and i. We went to Italy for our honeymoon and stayed at Dona Palace for 2 nights, the best nights of our honeymoon!! The only mistake we made was not to book a water taxi to transfer us infront of the hotel. After we arrived at the train station i asked the water taxis and they wanted 100 euros!!! So we took the water bus. It was ok but crowded. After getting off at the San Marco stop we followed the instractions other travellers left in this site and despide the fact we had to climb two bridges with steps to get to the San Marco square the hotel was not that hard to find after that. Because we stayed for 2 weaks in Italy we had heavy suitcases and it was hard to carry for that distance, specialy for my wife. The hotel has a water taxi and transfers you for 35 euro. I recoment you to book that taxi. We took it after we left from the hotel to transfer us to the train station. I book a normal double room and they upgraded us to the suite for free. What a surprise!!! The room was excellent, very clean, large, lcd and the best of it a private veranda with view of San Marco and Venice. It also had a hot tub and it was really nice relaxing with the view of Venice. People working there where very friendly and helpfull. Our second evening we ordered a room service dinner from the restaurant of the hotel, which is near the hotel (prices are logical for Venice) and we had it on the private veranda of our room. That was really romantic and one of the best moments of our honeymoon. Just Perfect!!!", "Date": "October 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great place, great location”", "Author": "ElvisinLA", "ReviewID": "UR6010693", "Content": "Visited Venice for three nights in early October. We really enjoyed our stay here. Arrived on the private dock via water taxi like many other reviewers. Also arranged for water taxi to airport with hotel. Price was a reasonable (for Venice) 55 Euro for two. Our room and bed were large, clean and comfortable with a nice side view of the canal and patio. Great A/C, plenty of hot water and an excellent breakfast were all big pluses. Staff was helpful and accomodating. Only one complaint: Had drinks on patio one late afternoon and the bartender/waiter kept the change when we paid. It was 3+ Euro. Not the end of the world, but there was not doubt he wasn't bring it back. Bad form and very rare. Location of this place is great too, just off of a fairly quiet little street and literally a stones throw from St. Mark's. Really no need to bother with restaurant recommendations from the hotel, there are dozens of good restaurants all over Venice. Just do a little exploring and you'll find them.", "Date": "October 25, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bibury, Glos", "Title": "“A Hidden Gem”", "Author": "JackieMH", "ReviewID": "UR5819135", "Content": "Arrived at the hotel by water taxi which had been arranged by our tour operator. First impressions excellent. All the front desk staff were polite and courteous and extremely helpful. Small outside seating area overlooking canal. Room was very spacious, beautifully decorated and clean. Bathroom tastefully decorated with shower, bidet, loo and sink. Rooms spotlessly cleaned every day. On the second floor is the breakfast area which doubles up as an area to drink in the evening with a small bar at one end. Breakfast was adequate and waiting staff were friendly. Bar open in the evening and bar staff very pleasant. There is a small balcony with a couple of tables and chairs to sit out and take in the view of the canal. Hotel is situated just round the corner from San Marco and only 5 minutes to the Rialto Bridge so well placed for all sightseeing. Hotel does not have a restaurant so found some lovely ones on our wanders. Can recommend the Trattoria alla Madonna which is over the Rialto bridge, turn left and 2nd alleyway on the right. This restaurant is used by lots of locals and prices are reasonable. Will definitely use this hotel again.", "Date": "September 20, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Super honeymoon!”", "Author": "mcconaj", "ReviewID": "UR5810540", "Content": "Fantastic palace! Rooms! Staff!! Ambiance!!! Incredible breakfast buffet with a gentleman supervising the breakfast show that is shear perfection! We lost our luggage for three days and the staff was exceptional in assisting us in our situation. Rooms were perfection. If in Venice, and you want to avoid the clutter of the Grand Canal, stay close to San Marco, and receive exceptional service. Tthis is the only place to be!", "Date": "September 17, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Great Hotel - would return tomorrow!”", "Author": "P_B-Scotland", "ReviewID": "UR5789276", "Content": "Stayed for 4 nights at end Aug 06. Room was perfect, really large, lovely red carpet, great bed. Bathroom was spotless and huge - great double shower. The room for breakfast was so nice with a little balcony if you were lucky enough to get one of the tables. Breakfast was great. Has a lovely little terrace with it's own dock where you can sit and watch all the gondola's go past. We even bought our own wine & bread, cheese, cold meats etc.. and sat there whilst the sun was setting which was great. Location is perfect, couple of minutes walk from St Mark's Square which couldnt be better. Was really reasonable - best hotel during our whole stay in Italy and would only book there if and when we return to Venice.", "Date": "September 11, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Luxury and location!”", "Author": "Cruise_Addict", "ReviewID": "UR5715191", "Content": "Having never been to Europe, we had no idea what to expect. We were pleasantly surprised by this wonderful hotel, located on one of the canals and just off of St. Mark's Square. The rooms are nice - luxurious. There were six of us who stayed in this hotel, in three rooms. We were in room 11 - spacious room, the bathroom was nice but on the smallish size, two windows with a nice view of the courtyard. We saw room 50 (at the top floor of the hotel). It wasn't as nice as room 11, but it was larger. The other room we saw, 21(or was it 20?), was large with a very nice balcony. The person from our group who stayed in this room was in a wheelchair/on crutches and able to get around in this room very well. Don't miss the sumptuous breakfast offering delicious continental fare (parstries, croissants, juice, coffee, fresh mozzarella, etc.) as well as scrambled eggs and bacon. The dining room is very pleasant and has a balcony where you can eat and enjoy the sights and sounds of the canal. The small courtyard (that others have mentioned) is a really pleasant place to relax any time - day or night. We loved watching the gondolas go by. The location is fabulous. There is a bank (with ATM), wonderful restarants and teriffic shopping right next door. A few tips: 1. As in most European hotels, you have to put your room key in a slot inside the room to turn on the electrical. 2. If going to the airport from this (or any other Venice) hotel, check your taxi options. Six family members and their 20 pieces of luggage paid only 60 Euro at 3pm. My husband and I, with four pieces of luggage paid 85 Euro at 7am. 3. Avoid the little courtyard right at dusk as that seems to be when the mosquitos come out. We will definitely make this our hotel of choice whenever visiting Venice.", "Date": "August 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ambler, Pennsylvania", "Title": "“Wonderful location!”", "Author": "Nikkidog", "ReviewID": "UR5563650", "Content": "After reading some of the reviews for this hotel, I was a little skeptical, but upon arrival we were pleasantly surprised! We, out of necessity (too many bags and small children), had to take a water taxi from the train station. It was wonderful, esp. when we were able to be delivered right to the hotel's \"dock\". We found the people at the front desk fairly helpful and friendly. Our rooms were enormous!!! We were on the 4th floor.....both rooms faced the canal, one of which was a corner room because we had a \"triple\". The views were amazing! After some of the nightmare rooms we'd experienced during our stay in Italy, this was a welcome relief!!", "Date": "August 6, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orange County, California", "Title": "“A Palace Not Fit For a King”", "Author": "MistressofthePark", "ReviewID": "UR5534644", "Content": "To be fair, this is a 3 star hotel and we generally stay in higher quality hotels, so our expectations may be above the norm. Once we found the hotel, no easy task, the location was great. It was within steps of St. Marks square and other major attractions. The rooms were small, clean and efficient. The hotel has a pretty courtyard on the canal, but it was not very user freindly. Some of the rooms, we noted, were accessed through the dining area/breakfast room. If you don't want everyone staring at you while you access your room, you may wantt to request one with access through the hallway and not the diningroom. While the hotel is very close to heavily trafficked St. Marks, it was quiet. The staff knew only the restaurants with which they were affiliated. The food was ok. For those who want to be within a short walk of St. Marks and the Grand Canal at a very reasonable price, this is a good deal. If you require a little more luxury, look elsewhere.", "Date": "August 1, 2006"}], "HotelInfo": {"Name": "Hotel Dona Palace", "HotelURL": "/ShowUserReviews-g187870-d488758-Reviews-Hotel_Dona_Palace-Venice_Veneto.html", "Price": "$193 - $720*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">San Marco 391</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "488758", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b4/14/f6/royal-suite.jpg"}}