{"Reviews": [{"Content": "Great Location, So-so Room We traveled with our two adult sons, renting two rooms, using Rick Steves' book for recommendations. This hotel was more pricey than others in its class in Rome or Venice, but was conveniently located within easy walk (with baggage) of the Santa Maria Novella station and all the central city attractions.The hotel is very pleasant but the rooms were cramped, dark and not laid out in a user-friendly manner. For example, the commode was facing the sink so that your face was in the sink when you sat on the throne. Unfortunately, that was the only place where we could read Steves' book, as the bathroom was the only place with sufficient light for reading.The breakfasts were really good. The staff was friendly and helpful. There was a coin laundry across the street, which proved very handy.", "Date": "Jul 12, 2008", "ReviewID": "UR718110871", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "5"}, "Author": "Engrpas"}, {"Content": "Superb! We loved our visit! The hotel is truly in the heart of Florence and the staff was beyond wonderful! The hotel offers roomy accomodations--even for three per room and the view outside of the window was intoxicating! The staff offered unlimited assistance in terms of directions, reservations, and recommendations in terms of museums, NOT TO BE MISSED SIGHTS, and restaurants.We relied heavily on Rick Steves books for our overall plans--which was a very good plan, but the hotel staff truly supplemented his work with recommendations.The breakfast is varied and filling--you name it and they have it--I just can't wait to go back! Hopefully, that will be soon!", "Date": "Oct 25, 2005", "ReviewID": "UR224300704", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d496877-r17819724-Galileo_Florence-Florence_Tuscany.html", "HotelID": "496877", "Price": "Unkonwn"}}