{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Small is beautiful”", "Author": "BigPanther", "ReviewID": "UR124061839", "Content": "The small hotel (-+ 50 rooms) has nice and large rooms with an extra-large flatscreen (Loewe). It is located between Madeleine and the Opera and next to l'Olympia (the famous concert place). The staff is very friendly and helpful. Perfekt breakfast with fresh coffee and bread. The design and decoration of the hotel and rooms is very funny and well done, you'll see !", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Eclectic boutique hotel on quiet street close to restaurants and shopping”", "Author": "HarmonyInMyGut", "ReviewID": "UR118393765", "Content": "Staff spoke English and were very helpful with dinner recommendations and how to use Metro; quiet hotel, in nice part of DT Paris (District 9); Cleaned daily. I felt very safe in the area with my daughter and lots of shopping (food and Gallerie Lafayette) nearby. Sundays 99% stores and restaurants r closed, so FYI.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whitby, Canada", "Title": "“Very nice”", "Author": "BMorris2011", "ReviewID": "UR118330368", "Content": "My wife and I stayed at this small hotel for three nights. While the room was small It was neat, clean, modern and well equiped. It even had a small fridge but that had to be removed from its cupboard in order to get it to work. Staff were very friendly and professional. While the room was small and the price high, that is what is to be expected in central Paris. The location is excellent with easy access either by foot or Metro to all the major sites. We did not partake of their morning breakfast, seemed a little expensive, so we can't comment on the food but the breakfast facilities looked pleasant. We would stay here again without hesitation if we return to Paris.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quirky but cute”", "Author": "MLC1234", "ReviewID": "UR117495637", "Content": "I work in Paris on average 2 days per week and have a list of preferred hotels. However this week they were all massively overpriced due to Paris events so the best price i could get was in the Triangle D'Or. Overall i was impressed by it and i would stay there again. I work about 2 mins away and can confirm this hotel is in a very upmarket district. There is one boarded up sex shop across the road but this is not a sleazy area of Paris. The rooms are quite small but not the smallest i have had in Paris and adequate for a short trip. The decor is very quirky including bright yellow hands on the front door, the sequined lift with a glass door, the piano tiles in the shower and the painted music decor on the walls. Overall the effect is quirky but charming. This isnt a massive hotel with lots of amenities like big bars and restaurants. But it has all the basics and its newly decoated so everything is clean and tidy. I also liked the IPOD docking station on the TV so i could play my music. I dont know if they responded to previous comments or whether i was lucky with my room but i had a shower screen - no flooded bathroom like previous reviews.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Manhattan Beach, California", "Title": "“Small rock n roll themed hotel close to all the sites, has wifi and decent breakfast”", "Author": "Chris_helen90266", "ReviewID": "UR117425897", "Content": "I stayed in the Rickie Lee Jones suite and enjoyed the vibe, if your are looking for something elegant and grand, this is not for you. Reasonably priced and close to the Metro it worked well for a short business trip.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Horrible Employees”", "Author": "dropzoner", "ReviewID": "UR116185351", "Content": "Rude place. These front desk booked the wrong night for me, and the hotel still forced me to pay an extra night even though they promised that they wouldn't on the phone. The rooms are tiny. The amenities are non-existent. The location is in front of two sex shops. The rooms is generally not that romantic. They also have one the smallest and slowest elevators I have ever seen. Luckily, I only stayed one night at this extremely over-priced place before heading to a much nicer rental apartment.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Geneva", "Title": "“Great new small design hotel”", "Author": "ABroadAbroad", "ReviewID": "UR114621421", "Content": "A spankingly new, uber-hip, but quiet hotel in a great Paris location between Madeleine and Opera, just two minutes from the Metro. Triangle d'Or is a music-themed hotel that's a bit of a museum itself but manages not to be annoyingly chic. Our room was small, even for Paris, but comfortable and quiet (we requested a room on a high floor facing the courtyard and had one waiting when we arrived late on a Friday). Good beds, brand-new bathrooms, a/c, gorgeous design. The staff is extremely friendly and helpful. Only a few drawbacks: not a lot of space for the price. If my husband and I had had luggage -- instead of small overnight bags -- we'd have had trouble moving around. Also, there's no shower curtain or door, so the bathroom flooded whenever we showered. The bathroom needs more hooks for towels. It's a new property, so they may still be getting the kinks out. Overall, it was a delightful place to stay. We were happy to come back to it each night -- and will come back again.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Paris 2011”", "Author": "aldobab", "ReviewID": "UR114582901", "Content": "Everything is just right with this little hotel; Location, Cleanliness, Staff Rooms are so cute but small (Paris)", "Date": "June 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Englefield Green, United Kingdom", "Title": "“Convenient”", "Author": "rubikon", "ReviewID": "UR97179761", "Content": "booked this last minute and was taken by its quirkyness. Enjoyed my stay. The quirkiness though is superficial -nice ideas but did not have the vibe portrayed. But a clean room and bed in a conveneint location was enough for me. One word of caution - it is in the middle of a corner with 4 sex shops. Wasn't expecting that...and would not advise for families !", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Can only recommend this place!”", "Author": "SvenFromGeneva", "ReviewID": "UR94274104", "Content": "Fully agree with the other positive reviews. Very well located; nice, modern and clean rooms; friendly staff; nice shower! We will come back!", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "athens", "Title": "“An OASIS after the HELLder Hotel in Paris”", "Author": "GREEK_TRAVELER_11", "ReviewID": "UR91371241", "Content": "Very clean, great location, experienced and helpfull stuff. I surely would stay there again. Worth paying 140 euros for double room. Thanks God i found this hotel after a nightmare lived in Helder Hotel for 12 hours, that i afford it.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kauai, Hawaii", "Title": "“Funky and quirky hotel”", "Author": "Dr Benjamin P", "ReviewID": "UR82522703", "Content": "While we were there, the hotel was still undergoing renovations and updating and while normally, that would have been a hassle, having been through the same thing for 8 weeks at home in Sydney it was merely more of the same! The design details of the hotel are lots of fun and rooms are very individual in their design details. The beds are really wonderful! We loved the hotel and its Madeleine locale where there are great shops, good local restaurants which are also reasonably priced and of course, right around the corner, Fauchon which has very good coffee and food at a premium price. (Paris is notorious for very bad coffee virtually everywhere!!) (Tip within a tip: really great coffee can be found at the cafe restaurant atop BHV, rue de Rivoli, which has to be one of the best department stores anywhere - better than Printemps and Galeries Lafayette!!) Hotel du Triangle d'Or offers a 15 E breakfast which is a great way to start the day and this includes good coffee! Staff are excellent and personable. The lift in the hotel can be in demand at certain times and being small will take two and some luggage at a pinch in a silver glitter cocoon.", "Date": "October 7, 2010"}], "HotelInfo": {"Name": "Hotel du Triangle d'Or", "HotelURL": "/ShowUserReviews-g187147-d497189-Reviews-Hotel_du_Triangle_d_Or-Paris_Ile_de_France.html", "Price": "$159 - $332*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6, rue Godot de Mauroy</span> | <span class=\"extended-address\">9th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75009</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "497189", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a1/10/a110b26ec9b93e6cc3df4130a93d57ba1large.jpg"}}