{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "israel", "Title": "“try to find something better!”", "Author": "mishakolot", "ReviewID": "UR127178837", "Content": "The hotel is so far from the center that does not seem to be in Rome. The area is shabby, so it's not an attraction to go around after prolonged meeting. 4 stars hotel does not have swimming pool, spa, pool table. The meals were quite poor, little selection of everything, no fruit, no tea, for hot breakfast there was an omelet once in four mornings! Rooms are clean, but ac system does not work even in meeting room. I have found nor kettle, neither single glass or cap (even plastic) in my room for four nights stay. Reception people are extremely unpleasant except of blond one (seems to be Laura). They pretend to be very busy and you have to wait for their attention for a long-long time. There are numerous 4stars hotels in the world which could be used as schooling for Idea Hotel Roma Nomentana keepers!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Ontario", "Title": "“Great renovations”", "Author": "Adventure2009", "ReviewID": "UR126011993", "Content": "I stayed here 2 years ago and again this year with student groups. They've done some great renovations in that time. This hotel has nicely appointed rooms. The breakfast is great. The staff were helpful and found one of my students a new room late at night when one of the cots broke (it was fixed when we returned the next day). The only downside is the distance to the city centre and that there doesn't seem to be much in the area (although our tour director said he had a great meal nearby). I can't comment on the public transit as we were bussed everywhere.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "St Andrews", "Title": "“Good Hotel, but pretty far from anything”", "Author": "jl747-13", "ReviewID": "UR125535327", "Content": "It was a very good hotel, by far the best I had on my trip to Italy. The staff was helpful and nice. The rooms were pretty modern. It had wifi and a decent breakfast. The only problem is that if you want to get into the centre of Rome it is difficult. It either means catching a bus and a train. Or paying a good deal of money for a taxi.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Rhodes, Greece", "Title": "“Nightmare..”", "Author": "savvas189449", "ReviewID": "UR124489318", "Content": "This was the worst hotel ever in my life.i have been many timesa in rome and the most of the times staying in idea z3.so we thought idea nomentana will be the same.it was tottaly awful and with no relation with the other hotels.the hotel is far from everything the rooms are dated and the hotel has no life and no lights at all.i believe this hotel needs an absolutely renovation.it was smelling,cold a night mare.we were booked another 2 times in the same month in the same hotel but we immediattely cancelled them and we stayed in z3.much better.avoid it", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“loved it”", "Author": "marta b", "ReviewID": "UR120009314", "Content": "we went in end of September 2011. was hard to find at first but later we find it very easy About 30min from centre of Rome To get to hotel take line b metro and get of on rebibiah metro station (its the last one anyway) then go to big pedestrian crossing and find up the road bus 451, 311 and get off when u see big building with TREME sign on it Then just go across the street down the road and you found it. Great breakfast very tasty Selection of cereals, cakes, eggs and many more. room basic but nice and clean Would recommend it and would go back", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for young travellers”", "Author": "PeepJC", "ReviewID": "UR118512675", "Content": "I stayed here for two nights with three friends. We had a large room and we all had separate beds and they were quite comfortable. The bathroom was also of a decent size. We had a bit of trouble finding the hotel at first though due to the sign at the entrance being tiny and the sign at the top of the building is for something completely different. The free parking and nice new TV were great bonuses. I'd read that it was far from the centre of Rome but it isn't as bad as I was expecting. Just a short walk down a few roads (max 20 mins) to a Metro train station which takes you really quickly into the centre. The train was only 4€ for an entire days use which we thought was great value. The breakfast (which was included) was nice but due to the amount of peeps it all disappeared quite quickly. Luckily the amazing staff members were around to continue bringing out more food. One of the staff members was generally amazing and was so awake, cheerful and polite it was really infectious and a great way to start the day.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“DO NOT stay in this hotel.”", "Author": "Mr_DLR", "ReviewID": "UR105328610", "Content": "During a 10 day stay in Italy, my wife and I and another couple booked a room for one night that we were told would sleep four. Well, instead of two double beds or even a double bed and sleeper couch, we got what we were told- four walls (a room) with four literal cots, a desk, and a 20 year old television. The walls were dull eggshell color and were scuffed and damaged. The bathroom was tiny. We complained that this was unacceptable, but were told there were no more rooms. About 30 min. later we got a call that they had found another room. This room was the same size, however recently renovated. The bathroom was much larger and it had a flat screen TV. However, the sleeping situation was still deplorable. Somehow they define cots as \"beds\". There were two singles and one full size double. They barely sat 12 inches off the floor. It is evident that this building was originally office or even industrial space that someone has tried to convert to a hotel. This results in atleast two two-foot diameter concrete columns invading each room. In addition to the aesthetical shortcomings, you must take a bus to get to the subway to get into town-very inconvenient location! In spite of the foregoing, the staff was polite and courteous, but this did not make up for the overall poor experience we had while staying in this \"hotel\".", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "italy", "Title": "“really disappointed at this time”", "Author": "mrdj", "ReviewID": "UR89673651", "Content": "This is my fourth time staying this hotel, but they have a room preferation problem. The room is very nice and clean on 3rd floor, but they put only 3-single bed instead for 4-person as per my room reservation (quadropla 2-singole & 1-matrimoniale). I suggest to put additional 1-single bed but they says that no more chambermaids on duty. All they have to do was to a find a room that suit to my reservation - room 114. A very ugly, dirty painted, broken door on c.r., bedit water leak and defective beds. A great experience for us, but there's nothing we can do instead to be content because we're only temporary - 2 nights huh! Please upgrade your service in term of room preferation.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Craiova", "Title": "“Nice hotel, big confortable bed, great breakfast”", "Author": "Raluca L", "ReviewID": "UR89625689", "Content": "I've been in Rome in December 2010 and I've chosen this hotel because it had a very low price. I've payed 125 E for 3 nights and in my opinion the distance to the city center is compensated by the good price and the conditions offered for this price. I've seen some negative reviews for this hotel but i have to say that my experience was positive. I had a big, clean room with a clean bathroom, the breakfast was great and the public transport was good as well. The trip from the hotel to the city center takes about 35-45 minutes and costs 1 E. One has to take the bus (341,350 or 311) to Ponte Mammolo or Rebibbia metro station and then the metro to anywhere else. The bus station (Galbani Negroni- second stop on Galbani street) is a few meters away. Near by there is also a small complex (super - market , gas station, sweets store, pizza restaurant).", "Date": "December 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "NSW", "Title": "“Good Hotel and Room but WAY to far out of Rome city”", "Author": "Krissishi", "ReviewID": "UR76582634", "Content": "The hotel was clean and modern, and our room was comfortable modern and clean BUT to get into rome you need to get on a public bus and go on a trip through the residential streets just to get to the metro/subway. The subway stop is like the last one on the line. If you want to have nights out in Rome itself (lets face it - there isnt much AT ALL happening around this hotel) , you'll have to get a taxi and they arent cheap - and the drivers are crazy. The hotel is just too far out if you are going to Rome for sightseeing as you take up too much time trying to get in and out of Rome - at the end of the day when you are exhausted and your feet hurt you dont want a whole nother adventure just to make it home. Wouldnt stay here again for that reason.", "Date": "August 23, 2010"}], "HotelInfo": {"Name": "Idea Hotel Roma Nomentana", "HotelURL": "/ShowUserReviews-g187791-d497528-Reviews-Idea_Hotel_Roma_Nomentana-Rome_Lazio.html", "Price": "$70 - $145*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Benigni, 7</span>, <span class=\"locality\"><span property=\"v:postal-code\">00156</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "497528", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/93/5a/bc/hotel-view.jpg"}}