{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cabarita Beach", "Title": "“Good value, convenient to university”", "Author": "Sam_I_Am_All_4_1", "ReviewID": "UR127899746", "Content": "We recently stayed here to attend a conference at the nearby university. Excellent free shuttle service to university (and also Anagnina metro station - which is about 30 mins to central Rome). There is also a nearby bus stop if the shuttle is not available with regular service (500) to both these locations. We found the staff friendly and helpful. Included free continental style breakfast which had adequate choices for us - not a huge buffet, but certainly appropriate for the price. Free undercover car parking and wifi also positives about this hotel. We had a triple room - quite spacious, very clean, comfortable beds, selection of sky TV channels, large wardrobe and luggage rack, small in room safe, desk and chair, hairdryer in bathroom. Note no fridge in or tea / coffee facilities in room (although there is a coffee vending machine in the lobby which produces a reasonable coffee for about 1 euro) - this may commonly be the case in Italian hotels(??) The building, rooms, and linen were obviously older and a little worn, but were obviously very clean. In our opinion presented excellent value for money. There is a mid size supermarket in the same complex (EuroSPIN - at first glance we thought it was a casino!!) which is open until about 8pm. A number of nearby tasty Pizzerias to choose from - we discovered l'Arte della Pizza (on corner Via Giovanni Dupre and Via Alenda) where you by tasty pizza by weight (about 12 euro/kg - and a kilogram is a lot of pizza!). At first glance the neighbourhood seemed a bit run down, but we observed a number of women walking alone in the evening, so it seems that it is a reasonably safe area. Also a bonus was a number of nearby playgrounds - great for occupying a 2 year old!!", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "London", "Title": "“Very satisfied”", "Author": "CRISTINA D Posted by an Easytobook.com traveler", "ReviewID": "UR126529260", "Content": "The hotel was lovely, very clean and spacious rooms, very helpful staff. We really enjoyed staying there but unfortunately the location is not the best, so I would only recommend it to young people who don't mind travelling outside the town at night. It is also perfect if you have a car. Despite the distance I would use this hotel again though, as it is very good value for money.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Luton, United Kingdom", "Title": "“Good budget hotel if you don't mind not being in the centre of Rome”", "Author": "DrewB_10", "ReviewID": "UR89848186", "Content": "A little hard to find (but what isn't in Italy?!) but worth the stay. We were looking for a hotel with reasonable amenities that wasn't in the centre of Rome (hence cheaper) and this is exactly what we got. While the Citta is not grand by any means we found it to be clean and friendly. At the time of our stay it was a 10-15 min walk to the nearest train station into central Rome, however a new station much closer to the hotel was due to open this year. We stayed 5 nights in a 3rd floor room - the room was clean and somewhat basic - a bit like an italian travelodge really - everything you need with enough space, but no extras. We found the breakfast good - not a huge selection but enough to charge us up for the day no question. All in all this is a great hotel for anyone looking to stay outside of the centre of Rome to save a little money for more important things.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Brisbane Australia", "Title": "“Terrible location - not close to anything & not safe to venture outside.”", "Author": "dragonflyhealing", "ReviewID": "UR85009014", "Content": "We selected this hotel as it seemed a reasonable price close enough to the airport. It was not cheap at all once you added the trip to the airport next morning - far enough away to almost require a cut lunch. Our tour bus would not drop us there and the taxi driver had terrible trouble finding how to get there and basically asked why we were in such a bad location. To top it off, it is too dangerous to leave to find food as thhere are no footpaths, only busy roads so you are stuck with eating in.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Not the best”", "Author": "amberharty", "ReviewID": "UR63943362", "Content": "I stayed a couple of nights at this hotel with my young child. Rooms were not too bad but the staff was rude and not helpful at all. They advertised free internet but I could not connect with my laptop and their one computer was broken. The breakfast had such little food to choose from. They advertise only being 10km from the Colliseum but it took us over an hour and a half to drive there because of bumper to bumper traffic. Would not suggest anyone drive there when you could have walked there faster. I wish that I knew we could upload pictures from our stay at the hotel as I would have to show others what the hotel really looks like.", "Date": "May 12, 2010"}], "HotelInfo": {"Name": "Citta 2000", "HotelURL": "/ShowUserReviews-g187791-d497536-Reviews-Citta_2000-Rome_Lazio.html", "Price": "$58 - $145*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via della Tenuta di Torrenova 60</span>, <span class=\"locality\"><span property=\"v:postal-code\">00133</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "497536", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/88/6a/886a1b945d5ee707262545d253f3707e6large.jpg"}}