{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“4 nights in Dubai”", "Author": "Sunil S", "ReviewID": "UR125731890", "Content": "One of the place to avoid if possible. I stayed 4 nights, service is way below poor. The room was below average. They have a few restaurants to choose from.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "newdelhi", "Title": "“great property just enjoyed my stay”", "Author": "vriditour932", "ReviewID": "UR123584420", "Content": "for those who are budget consicious this can be a good property locatd at a gud location where travel also becomes easier....Service is also quiet good but since most of the time one stays our on sightseeing it actually does not matter ..as for me i found their service upto mark in whatever time i spent in this Hotel and enjoyed my stay with my better half to make aade my dsf experience better.......", "Date": "January 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mohali, India", "Title": "“An Average 3 Star Hotel”", "Author": "kichi22", "ReviewID": "UR121788102", "Content": "Me and My Husband were in Dubai this December for our Anniversary.We had booked a Standard Room. But one look at it and we wanted out. The room was Suffocating and without any proper ventilation. The carpet gave an unpleasant Wet clothes stink. It was divided into 2 parts, One as bedroom and other as living with an old tv. We immidiately requested the reception to upgrade us or we would change our hotel. Fortunately, The hotel staff was helpful so they upgraded us to a better room with no division. this room was clean with no unpleasant smell of any kind and a better bathroom. Food in the buffet on the 8th Floor Ballroom was good but with limited variety. Pool was under construction. Overall, An Average Experience on Stay.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Value for money”", "Author": "SJAIRATH", "ReviewID": "UR120245245", "Content": "This is a good hotel if you are travelling with family. Very cooperateive staff, reasonable travel desk who will give you good offers for sightseeing. This hotel is surrounded with lots of shopping options, Indian food, and has public transport option. Airport pick-up was complementary. Breakfast is very good with Indian cuisine. Rooms are very spacious and that too for such an attractive rate. But please bear the loud music that can be disturbing.", "Date": "November 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pune, India", "Title": "“Ok Hotel”", "Author": "Rahulnahata", "ReviewID": "UR119134109", "Content": "Hi, I stayed in this hotel last week, Hotel is budget hotel types, a smell of cigarette is Continuously there in lobby. there are two dance bars in the hotel (Indian & Pakistani) but no crowd. they don't allow guest in the hotel. if u want to enjoy night life & want pickup this hotel is not for you. i feel this hotel is appropriate for families no problem Thanks", "Date": "October 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“best rooms...in this cost.”", "Author": "abhiee26", "ReviewID": "UR117119582", "Content": "before booking this hotel i have chked lots of hotels in dubai. specially in Bur Dubai area. At price of AED 200 for 2 ppl in one room & 275 for 3 ppl in one room was the best rate for 3 * hotel. but when we reached the hotel we were surprised seeing the rooms they were double rooms. as in one hall & bedroom... not like any standard hotel where only bed room is provided. The place is again in bur dubai...close proximity with meena bazaar, burjuman mall..metro...so it was ideal place to leave.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Jalandhar", "Title": "“Nice Hotel”", "Author": "arvind7421", "ReviewID": "UR115146012", "Content": "A good hotel at budget price...There is a bar lounge open until wee hours but as my room was on 5th floor it hardly mattered....BIG spacious rooms....separate sitting/TV lounge room...worth much more than I paid for...good food...i enjoyed eating Chinese food at the Noble House.... I went there on week day...i think that made my stay more comfortable....i heard a lot about the hotel and its surroundings when i got back from there....but i guess its your call any way... it was nice and comfy for me....and maybe weekend would be different i do not know about.....", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "jammu", "Title": "“busy hotel”", "Author": "karunesh", "ReviewID": "UR110861750", "Content": "good hotel for budget travellers, nice night clubs full with friendly females. enter around 11 pm wen its full. they charge 60 AED entry with a free drink. supermarkets and indian restaurants nearby hotel. good location and spacious rooms.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Doha, Qatar", "Title": "“Good Value for Money”", "Author": "forry71", "ReviewID": "UR94335616", "Content": "The hotel is ideally located in Bur Dubai with a range of vegetarian options on walking distance. The rates inclusive of Breakfast & airport transfers make it a very good deal.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Staff were excellent, always ready to assist.”", "Author": "chrissyfran", "ReviewID": "UR93339653", "Content": "The hotel was in good location. But the water was cold, after few days we informed the Manager who was really excellent I think his name is Mohammad he arranged for that to be fixed and also gave us a fruit basket to make up for it. The rooms could do with a kettle, tea and coffee facility. I went to the night club next door just once and was astonished there were so many asian women waiting to pick up men (more like prostitutes). Expats come in to unwind, the moment women see these guys, they all crowd around them, most disgusting. The expats refuse them, then the women make fun of the guys. Don't trust the tour company Starlite Tours, they rip you off if you are an expat, make sure to haggar.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Pigsty”", "Author": "whateve62", "ReviewID": "UR91278647", "Content": "The hotel is absolutely horrible. The smell in the rooms and all around the hotel is so bad that you cannot sleep. The rooms are extremely dirty. The hotel is full of prostitutes. its like one hours love hotel in hell. Its incredible to believe that so lousy hotel can even exist.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Excellent value for money/cleanliness”", "Author": "Mitto_m", "ReviewID": "UR82698770", "Content": "Worth the money for the stay. Except if you are with family, do not prefer to be in 1st floor . Rather take from 3rd floor and upper floor onwards. Rooms are neatly maintained and clean. Except for the complimentory breakfast. It is just ok only. Free airport transfer service and the chauffeur was well mannered. Location is excellent.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colomba", "Title": "“Value for money in Dubai”", "Author": "Dharmasena", "ReviewID": "UR69708225", "Content": "Excellent Location and Luxurious Rooms. Easily accessability to DWTC , Metro Station and the place has plenty of supermarket which is opened 24 hrs. I found room are spacious and good. Music lounge on the Lobby level is excellent which goes until early morning. Staff are quite courteous and helpful.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kolkata (Calcutta), India", "Title": "“Great rooms - great night life”", "Author": "Subid", "ReviewID": "UR68384734", "Content": "Very conveniently located and extremely cozy rooms. Good food and breakfast. It has good restaurants and a pub offering great night life - if you are will to spend other wise good food and music for the less adventurous. Every room consists of one spacious living room and a cozy bedroom.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Mumbai", "Title": "“BEWARE BEWARE BEWARE ALL FAMILY,SOLO & DECENT TRAVELERS”", "Author": "Travelloholic888", "ReviewID": "UR67236727", "Content": "This hotel is so bad and it is only for PIMPS,S E X ENJOYMENT AND FOR W H O R E 'S & S l u t . As i am solo business traveler to Dubai And working whole day and need good sleep all night but in this hotel all the nigh is like NIGHTMARE all the s e x workers in bur duabi is available in that hotel. THE WORST HOTEL ARE YORK INTERNATIONAL ,RAMADA & IMPERIAL SUITES. If you stay for long time period you will see the same weekend peole coming from Mumbai ,Delhi & Ahmedabad for 2 day sex visit. And owner of the hotel is also from bad background. I WILL NOT RECOMMED FOR FAMILY ,SOLO OR DECENT BUSINESS PEOPLE.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Not unless you stay for nearly free!”", "Author": "Sir_Top-Hat", "ReviewID": "UR66942657", "Content": "I stayed twice at the Imperial suites (the 2nd time was an unavoidable accident) The rooms are indeed very large (sometimes with a separate TV/lounge area) and might be handy for large families willing to room together. However, for a single traveller, they have absolutely no added value. There is a very loud nightclub at the ground floor. And you cannot escape the noise, even in the top most floors. If you must stay there, at least try to get a room in the opposite wing to the nightclub for a (reasonably) quiet night. Maybe there are reasons to choose this hotel. I just cannot imagine what they could be?", "Date": "June 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“All in all, a safe bet”", "Author": "SurbhiSheth", "ReviewID": "UR60710751", "Content": "A double room cost us Rs 5000 during the shopping festival, but the room was actually a luxury suite with a separate living room. It was comfortable and clean. The breakfast buffet spread, however, was disappointing. I had read about late night music coming in from the disc which was a tad true as our room was almost directly above it, but it wasn't loud enough to be seriously distracting. A good idea would be to ask for a room on the opposite side of the disc. Meanwhile, the disc really is somewhat of a pick-up joint as is the dance bar next door, but their entrances are separate from the hotel. The hotel has other decent restaurants as well as a lounge bar. All in all it's a safe bet, especially with the innumerable Indian tourists staying there. The location too, is great. It lies quietly in the middle of the street, surrounded by decent malls and eating joints. It's conveniently located vis-a-vis other attractions in the city too. A word of advice: Avoid Star Tours that has a travel desk in the lobby. We found them expensive and unreliable. There are other travel agencies around the hotel or a call away. The Sun & Sky agency, about half a kilometre to the left of the hotel on the same road, was especially good.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“Forgetable Experience”", "Author": "grj11188", "ReviewID": "UR59340437", "Content": "Although the suites are clean and decent as well as the food served being good, this hotel has a bar downstairs with blaring loud music till late at night. The bar also serves as a pickup point for call girls so the hotel is an absolute no no for families..", "Date": "March 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Stckholm", "Title": "“Not recommend to stay here!!!”", "Author": "AnsarStockholm", "ReviewID": "UR52215907", "Content": "Mywife and I stayed on the 6th floor of this hotel but even that didn’t help us to evoid the loud music downstairs and kept us awake. The room was comfortable and spacios but very stinky and smelly and it didn´t help very much to open the window. The smell came actualy from carpet and curteins. The bed was comfortable and fresh and the pillow was comfortobly soft. The bathroom was not fresh and nead updating. The housekeeping staff were very obliging and frendly, as were the reception and breakfast staff. But we found the manager of the hotel not helpfull at all and unfrendly. Swimming pool was small with a small seating area and only a few charirs surround it. The pool bar was out of order and the whole pool area was bad organised: no towels, constant noise from an generator or hotel AC system did make it hard to relax. We found the hotel to be central situated and it was never problem to find a taxi.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Mumbai", "Title": "“Hardly Imperial!”", "Author": "TravelExotica", "ReviewID": "UR48235447", "Content": "We stayed in a suite of the hotel. The room was quite clean and so were the bathrooms. The terrible thing about the hotel was the loud music from the bar downstairs - which would go on till early into the morning. Also - the bar appeared to be a pickup point and the crowd did not look great. I would definetely not recommend this hotel for families but if you are a bunch of guys looking out for fun in Dubai and dont want to pay too much for acco - you may wish to consider this hotel. And if you do end up staying here, i recommend that you stay in the upper floors - as the thumps of the music reverberate much less.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "UK", "Title": "“Absolutely Apalling”", "Author": "MainstreamUK", "ReviewID": "UR20627719", "Content": "Chinese \"Ladies of the Night\" by the barrel load - they are obviously not of a high calibre either. This nasty hotel is in the seediest part of Dubai (Bur Dubai) which is across the creek from Deira. Please, take my advice, this hotel is not for families or any poor unfortunate holidaymaker who would be well advised to give this hotel a miss- it is very downmarket and in an altogether undesirable area, the shopping amenities are terrible there too. The hotel bar is dark and dingy (so that you don't see the faces of the prostitutes plying their trade?). The whole place smells. I would definately not recommend this hotel to anyone. I can not understand why a couple of reviewers state that the hotel isn't all that bad - they must be on the payroll or need their heads examined. Next time I go to Dubai I will research my chosen hotel thoroughly and stay on the other side of the creek.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ahmedabad", "Title": "“Fantastic Fun”", "Author": "Jopport", "ReviewID": "UR7728361", "Content": "Wonderful Rooms, very clean, Chinese resturant fantastic, you must try the lunch buffet, very helpful staff, room service food goo and not to pricey, there is a nightclub next door that has a huge line of ladies awaiting you every desire (for a price). We had a group of 31 10 ladies 21 men, we danced all night an were not bothered by any of the ladies or there customers. We had a fabulous time, and cannot ask for a better hotelif you want to have fun, good food and great hospitality", "Date": "June 1, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Northern Ireland", "Title": "“Never ever EVER stay at this 'hotel'”", "Author": "HolywoodJon", "ReviewID": "UR6053152", "Content": "Where do we start, it was just TERRIBLE! We were robbed within an hour of our arrival. We put our cases in room, took a short walk around the block and up to the rooftop puddle they called a pool. When we returned, an hour later, a valuable mobile phone/PDA had been taken from the room. We had turned off the air-con and opened a window when we arrived and when we returned the aircon was on, the bed straightened and the window closed so there had obviously been a member of staff in the room. When we spoke to the manager he just didn't care. There is no safe in the room but if you read all their literature (clearly the first thing you do after an overnight flight) you will discover they have safety deposit boxes at reception. Since the manager didn't care that he had a theif on the payroll, how much safer your goods would be in a box at reception that the staff have access to is anyone's guess. The manager didn't even say that he would speak to the member of staff who had been in our room- apparently it was our responsibily to look after our goods and if he employed thieves then that was just our bad luck.We reported the theft to the police who just rolled their eyes when we said what hotel we were in. As regards everything else - the bathroom was filthy, the food terrible and the staff unhelpful. The bar was closed when we were there due to Ramadan but a knock at the door to the side of reception (if you pleaded the need for a drink with the two massive bouncers) got you into the brothel that operated from the hotel. We just can't say enough bad things about this dump - DON'T STAY THERE", "Date": "November 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“nice place for singles”", "Author": "A TripAdvisor Member", "ReviewID": "UR5440497", "Content": "Good and relaxing place for singles with excellent disco and pubs.Rooms were fantastic.", "Date": "July 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“If the price is right”", "Author": "soarfoot", "ReviewID": "UR5057677", "Content": "My girlfriend and I stayed on the 6th floor of his hotel and although the loud music downstairs didn’t keep us awake it was quiet loud and noticeable. The room was excellent a sitting room/bedroom arrangement. Room service was inconsistent but once we started using the door sign for ‘room ready to clean’ things got better. Some days we did not get all our towels and had to ask. Swimming pool was small but adequate and seating area around the pool was small but quiet. We had it to ourselves most of the time and could order food or drink from phone by pool side. The pool bar did not open until 7 which I felt negated the whole point of a pool bar. My girlfriend had a bad first impression of this hotel as she had stayed in Dubai before and had expected better. We soon realised though that Dubai is very spread out and we were as central as anyone else. The hotel bars were dark and seedy with prostitutes haunting the place. The drink was surprisingly good though. There are excellent supermarkets either side of the hotel where there is all the usual western food stuffs etc. We found these very useful for breakfast where we bought plastic bowls and spoons for our cornflakes. There is a tourist guide in the hotel lobby who will grab you at some stage or another during your stay. He gave some good advice and arranged the safari and tickets to wild wadi and a cruise on the creek. Avoid the city tour though, this is done in a cramped 4 x 4. There are plenty of tour buses in the city, try and get one of those. All in all this hotel is probably OK for the money you pay.", "Date": "May 12, 2006"}], "HotelInfo": {"Name": "Imperial Suites", "HotelURL": "/ShowUserReviews-g295424-d497636-Reviews-Imperial_Suites-Dubai.html", "Price": "$68 - $116*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Al Rolla Rd</span> | <span class=\"extended-address\">Bur Dubai, PO Box 52444</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "497636", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ab/85/ab8596d966bc50ee72bf08e2513ea1dd6large.jpg"}}