{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Connecticut, USA", "Title": "“What's Not To Like”", "Author": "no818528", "ReviewID": "UR128387364", "Content": "Just spent 2 nights at the Hotel Icaria and cannot express enough what a top class hotel this is. From the moment of my arrival, I felt that the entire staff went above and beyond to ensure that I enjoyed my stay. The hotel is spotlessly clean, and has everything you could ask for. The rooms are more than adequate, and the breakfast is superb. In addition, they offer very competitive rates. If there is one drawback, it may be the location, as it is not centrally located. However, it is so easy to get in and out of the city centre, this should not have any bearing on your decision. A great hotel!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dundalk, Ireland", "Title": "“Modern, clean hotel with helpful staff”", "Author": "Chozz", "ReviewID": "UR128117980", "Content": "We spent a weekend at this hotel with a group of lads. We arrived early from our flight, but the staff did their best to check us in early. In the end, we were eager to investigate the city, so left them bags in storage. The rooms were neat, tidy and compact. I had requested a quiet room, and was given an end of corridor location on a high floor which was great. Staff were all very professional and very helpful with information about the area, all spoke great english. The location is decent, within a 5/10 minute walk of the port area, which has plenty of good bars and restaurants. From there its a slightly longer walk into the city centre, but still is a nice area along the beach. The only slight concerns I had with the hotel was the expensive breakfast at €12pp - there is a great bakery within 2 minutes walking distance which was much more reasonable. But overall I would definitely recommend this place for all types of vistiors.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Datchet, United Kingdom", "Title": "“Great hotel, great location”", "Author": "AnnTune", "ReviewID": "UR128072563", "Content": "Stayed here for my birthday in 2011 and had a great time. Close to Icaria beach and Olympic port for super restaurants. Relaxing pool and breakfast a little busy but still would go back. Tried for my birthday this year but fully booked. Staff, bar and restaurant very good.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frankfurt", "Title": "“Very recommendable, especially for families”", "Author": "FrankfurtDennis", "ReviewID": "UR127972108", "Content": "Quite good value. We liked the location close to the beach and not to far from the center of the city.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Our Stay - March 2012”", "Author": "SDSPhotographycouk", "ReviewID": "UR127072302", "Content": "Myself and my girlfriend recently stayed at Hotel Icaria (March 25th-30th 2012) Our flight arrived in Barcelona at 9:30pm which meant it was dark, so we opted for a taxi to the hotel as we didn't fancy any hastle. The taxi cost 28euros which included all fayres/additional charges. We managed to return to the airport on our way home using public transport (very easily) as we had more idea of where we were going and it cost 50% less than getting a taxi. We were pleasantly greeted by the staff who were friendly and very helpful throughout our stay. Again, as it was late and we didn't know the area, we decided to get some room service - pizza & sangria (a must) which was lovely. ACCOMMODATION: The hotel is brilliant, really modern and well looked after in every way. Lovely bathroom with all the amenities you need including: free wifi (hit of miss, but still works fine) air con (we had problems with this, however as soon as we informed the staff they fixed this from the reception desk) tv (with a couple of english channels - channel 4 and some news stations) ice machines on every floor. & a mini bar LOCATION : The hotel is situated along the newly refurbished costal area, which may not be slap bang in the middle of 'La Rambla' however if you want to get into the city centre you have 2 great options a) By Foot - Take a 30-40 minute walk along the beach into the city centre. We did this most days as we are more than happy to walk places b) Metro - the metro station we used was 'ciutadella vila olimpica' this station is a 10 minute walk away from the hotel and takes you into the city centre in a matter of minutes Also, if you choose to get an open top bus tour, there is a pick up / drop off stop within 1 minutes walk of the hotel TIPS: - Cheap food/booze - if you go to la rambla (which is a place we found ourselves visiting every day) you must go to a supermarket called 'Carrefour express' where you can buy 6 small bottles of cider for 1.30euros and wine from as little as 0.93euros! (it depends how fussy you are as to what you think of it, but we really liked the wine, even more so as it was so cheap!!) ** we found ourselves eating out for lunch around 3/4pm then taking some food to the hotel with us from this supermarket to eat for tea e.g baguettes, salami, olives, crisps and salad - all for very cheap!! ** - Eating Tapas & Paelle on La Rambla - This was one of the top 10 things we were told to avoid by our 'top 10 Barcelona' book however you can get plenty of good deals. One thing you need to confirm before sitting down is that you can choose your tapas dishes as we were given random dishes on our first experience. We were more sure of ourselves the second time around and got exactly what we wanted. Its a brilliant experience sitting in the sun, eating gorgeous food, drinking sangria with your partner and enjoying the views and sounds. definitely do it! - Shopping / BARTER, BARTER, BARTER!! - if you want to get souvenirs, DO NOT BUY ANYTHING FROM THE MAIN STRIP ON THE LA RAMBLA! across the road (either side of the strip) there are plenty of souvenir shops where the shop keepers will offer you discounts to literally anything inside their shop if you pick an item up. most items we managed to get for around 40% off the labeled price. It makes a massive difference to your trip :) KEEP AN EYE ON YOUR POSSESSIONS - we read loads of articles of advice stating how dangerous Barcelona as an area was for people getting their items stolen. I don't think it is any different to any other capital city i've ever visited, you just have to be vigilant and careful/sensible with your items. Don't panic! I hope this review comes in useful to your trip. It's a beautiful city. You can view mine and my partners photographs from our trip here: http://sdsphotography.co.uk/barcelona-2012/", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "Simonandkaren6569", "ReviewID": "UR126986314", "Content": "Very clean, nice rooms, lovely breakfast lots of choice. Leisure facilities bit limited, jacuzzi did not work and there are no changing rooms. Good location for Port Olympic, 20min walk on sea front into town. Beware there are pickpockets at port Olympic not just on la ramble so be careful.....", "Date": "March 30, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Oxford, England", "Title": "“Chaotic front desk, small hot rooms: not so great”", "Author": "Opera-loverOxford", "ReviewID": "UR126673966", "Content": "There's nothing very special about this hotel. It's quite a walk into the city centre and it's not near a Metro station. The breakfast buffet looks tempting, but the hot dishes are strangely cold. The coffee comes from a self-service machine. The rooms are small, and their air conditioning system doesn't work very well. The wifi is slow. And the front desk is simply chaotic. Checking out was taking forever and I had a plane to catch: three staff were on duty but seemed unable to process other guests in less than 20 minutes each. So finally I just plonked my room key down and said I had to go, having already given a credit card as a guarantee on arrival. At first nothing happened. I was sitting in a taxi about to set off when one of the clerks rushed out and accused me of trying to leave without paying the bill. The room was pre-paid, so all this fuss was for a few bottles of water from the minibar and one light lunch. Didn't leave one with a good feeling. The clerk was unable to explain why the card they'd already had was unacceptable, and I used the same one when I went back inside.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "drogheda", "Title": "“good location”", "Author": "wardlawlifecoach", "ReviewID": "UR126587343", "Content": "Stayed in this hotel for 4 nights. It is clean, staff are friendly, but only negative is hot breakfasts were never hot. This is not a hotel with a wow factor, but fine for the price. What it has going for it is location. Only a 10 minute walk to the beach, 5 minutes to a great shopping centre with supermarket, cinema and good restaurants. Also, number 14 bus from just outside gets you to the city centre in 15 minutes for only 2 euro. I will stay here again.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“Nice Hotel”", "Author": "Frank-Carol-Yeshua", "ReviewID": "UR126125908", "Content": "I am in our room(315) getting ready to check out and so I thought I would take the time to post this review while everything is still fresh in my mind. First let me say that the people who work here are very helpful and friendly. From the front desk personal all the way to the ladies who clean the rooms, they are all very professional. As for the hotel..it is very clean and in a very good location. It is only a 15 minute bus(14) ride to downtown Barcelona. We did have a problem with the A/C which in the afternoon couldn't keep the room cool. The management did offer to move us to better room. The ice maker machine on the 3rd floor doesn't work so I had to walk down to the 2nd floor. The breakfast price is a bit high by our standards. But all in all we did enjoy our stay at Hotel Icaria and we recommend it if you ever visit Barcelona you won't be disappointed.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Omagh, United Kingdom", "Title": "“Honeymoon”", "Author": "RMcK_12", "ReviewID": "UR125985478", "Content": "We stayed here to start of our honeymoon a few days R & R before heading on our RCI Cruise. The hotel itself is lovely nice rooms breakfast was good. But there was very few sun beds around the pool so we never got to lounge by it. We walked to the beach a few days about a 10min walk and when i booked it I specifically asked for a hotel near/in the centre as we love all the nightlife but it couldnt be more wrong had to get a taxi in every night and pay usually 15-20 euros at the start and usually 20euros on the back. If your looking for a quiet break then this is for you sadly not for us.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tarragona, Spain", "Title": "“Good Location”", "Author": "Mike20122012", "ReviewID": "UR125838878", "Content": "Chose this hotel because of it's location near to the Razzmatazz club for a Noel Gallegher concert. It's a ten minute stroll to Port Olympic's many bars and restaurants and the same to Razzmatazz in the opposite direction. The hotel itself is modern and clean with a nice outside pool and bar area which I would imagine would be really nice during the warmer months, not so useful for our March visit! There is an underground car park but there is also plenty of free parking in the roads around the hotel. Was great value and would consider staying again.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Isle of Man", "Title": "“Lovely Hotel, Would Recommend and Will Return to Icaria Hotel Again”", "Author": "Amandamanx", "ReviewID": "UR125671247", "Content": "The Icaria Hotel is pretty nice, and as said by a previous Review with a little fine tuning it really could be absolutely spot on! We took a taxi from the airport to the hotel - took about 20 mins and was 32 Euros. We did the same on the way back to the airport - there is always a taxi either outside the hotel, or not very far away, so getting a taxi wasn't a problem. We arrived on the 1st March for 3 nights, so you are still looking at it being pretty quiet at this time. Check in at the Hotel is pretty slow as far as check-ins go, I really don't know why it was so slow, they just seemed to take ages in dealing with every Customer, it was slow for us, and we also noticed it on several occasions when new guests arrived, I would imagine it would be pretty chaotic when really busy. But, Reception staff particularly the ladies were very helpful and friendly, the male receptionists weren't quite so user friendly!! We have stayed in both the Junior Suite and the Jacuzzi Suite and if you are torn between which one to book! Go for the Jacuzzi Suite - gorgeous. Very large bright room with massive super king bed, mirrored walls, and large Jacuzzi Bath. One point about the bathrooms which I think could be improved on is that they have a soap dispenser on the wall and a shamphoo/shower gel dispenser in the shower (both of which were hopeless and never worked, despite being full), the dispensers are pretty tacky and I think toileteries would be a nicer touch - or dispensers that worked? The Jacuzzi Suite was on the 6th floor and pretty quiet, but, the Junior Suite was on the 3rd Floor, and we found the road noise pretty noticable, the traffic never stops outside the hotel. We stayed Bed and Breakfast, I was surprised at the variety on offer at breakfast - very good, although, the cooked breakfast items were usually just pretty luke warm. One thing that was a little strange is that the bar is in the breakfast/restaurant room, so, we did find that of an evening it lacked in atmosphere, I think if they invested in a separate bar area it would be more appealing, you almost felt like you were having a drink in a cafeteria. The outside Pool area is nice, particularly the large gazebos with comfy sofas, although pretty cold of a night, perhaps some heaters would be nice out there? The swimming pool water was absolutely ice cold, no way was anyone going to be using it, Jacuzzi in the same area, and a small gym with sauna and steam room. Again, this area is a bit weird, no proper changing rooms, you had to get changed in the toilet, you are not allowed into the hotel in swim wear, so you have to get changed at the pool area, although there isnt really anywere allocated to get changed. There are 3 computers in the reception area, which are free for guests to use for upto 15 mins per time, which is really handy, we did out on-line check in on these and they even printed out boarding cards for us. All in all a lovely hotel, which was absolutely spotlessly clean - I dont think you could have found a speck of dust or muck if you crawled around all day long on your hands and knees! - so well done to the Cleaners - excellent job - would definately return and would recommend this hotel - not right in the centre of things, a block away from the beach and a good 15/20mins walk into City Centre.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great hotel”", "Author": "meromh", "ReviewID": "UR125580713", "Content": "hotel is great, location is a bit away from everything.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nairobi, Kenya", "Title": "“Nice location. Management needs focus on the little things....”", "Author": "Blueskyguy", "ReviewID": "UR125560127", "Content": "Icaria is a decent mid-range hotel, a block from the beach, and a few blocks from Barceloneta. The location provided great access for strolling along the beautiful and bustling Barcelona coastline. We stayed at Icaria during a major event in the city, and paid premium prices. The hotel, however, struggled with the \"small stuff\" that makes the difference between an enjoyable stay and a slightly frustrating one. Toiletries were not refilled once used (and even after requesting from the front desk); the hot water was out one morning; the breakfast buffet food was often cold; the laundry service was ridiculously expensive. With a bit of fine tuning, this could be a very nice place - hope the management gets on top of things.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Berkshire", "Title": "“Saggy squeaky beds”", "Author": "MagicDawn", "ReviewID": "UR125533165", "Content": "The beds were old and saggy. We had a twin room. My bed sloped off to the left and my friend's squeaked very loudly every time she moved a muscle. We could feel the springs in the mattresses. The pillows were hard, lumpy and very deep. I had to go and buy a travel pillow to use for my 3 night stay, as the first night there I slept little and woke with a painful neck. I was very disappointed with the overall quality of the rooms. Our first room, despite being on the non-smoking floor, had been used by a smoker. The receptionist changed the room immediately. I know hotels in Barcelona aren't cheap, but for what we paid I had assumed we would get a quality nights sleep. The weather was warm and sunny (18 degrees) and the airconditioning system would only heat our room..to a huge 26 degrees...no cold air was possible. This meant sleeping with the window open all night, with loud traffic outside our window. We were on the street side of the hotel. We didn't have breakfast. The hotel website stated that if you had booked your room more than 20 days in advance that breakfast was free for your stay. We had booked 7 weeks in advance via Booking.com and were told we were not entitled to the free breakfast as we had not booked directly through the hotel. The hotel is 20 minutes by bus from La Ramblas. Adjustable lighting in the room - we never mastered that. In our 4 day stay. Standard naff hotel hairdryer that takes forever to dry your hair. Lovely hot tub. We ran the Barcelona Half Marathon and had a lovely 2 hour soak in the hot tub. This was the deciding factor on choosing this hotel over others. Pool not warm enough to use at this time of year. If it's too cold for children it's definitely too cold for adults! Noce outdoor seating area for lunch or drinks. Amazing burger and chips! Staff friendly and helpful.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Helpful staff”", "Author": "sandersandrew", "ReviewID": "UR124871928", "Content": "We stayed for one night as a couple. There was an odd situation in that as we arrived we were behind two gents who had attempted to book a room for 2 but a reservation had been made for one - we noticed that we had the same problem. I'm not sure if we had missed something on their website, or perhaps there is a technical problem. Anyway, the staff at reception were very helpful and sorted out the problem for us. The hotel is a short walk from the Ciutadella via Olympica (excuse my spelling) on the yellow metro line, which you can pick up in the city centre. There are no real street signs that are immediately obvious, but when you come out of the metro station, you basically head straight up the road that is almost directly in front of you - this is Avinguda Icaria. There is a large shopping centre with a supermarket and a few dining options inside (as well as a cinema) close to the hotel, on the opposite side of the road. The hotel is pretty nice and clean. Our room was also clean and the facilities were all very clean and functional. The area is quite quiet, although our hotel neighbours (ie the other residents) were loud and made a great deal of noise arriving back at night. It is only a short journey into central Barcelona from the hotel on the metro line - although you could also take the promenade along the beach past the yachts to Barceloneta and the bottom of Las Ramblas.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Udine, Italy", "Title": "“No bad but could be much better....”", "Author": "fra1973", "ReviewID": "UR124287002", "Content": "No bad overall the hotel.nice lobby.good breakfast.too noisy the family room in front of the elevator.the sauna and the fitness are across the outside pool and when is cold is a problem to get there walking outside.anyway a good hotel that i suggest!is also very close to the beach.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Good price”", "Author": "Ela M", "ReviewID": "UR124274060", "Content": "This was good hotel for good price. The rooms are beautiful and have everything you need. The spa is really good too! It is a hotel not too far from the center of Barcelona and very close to the beach! My only compliant was the room service meals, not so in my favor but the food in the restraurant downstairs was very good.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pamplona, Spain", "Title": "“Great stay”", "Author": "Bjorn P", "ReviewID": "UR124217861", "Content": "Great value. Close to the beach and restaurants. Rooms are great and people are friendly. i go to Barcelona almost every week for work and for me this hotel provides a place where I can meet people, get work done, and be comfortable.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Close to beach...Why prefer this hotel?”", "Author": "Teja R", "ReviewID": "UR124026824", "Content": "I went during weekdays...its was good close beach and olympic port area most of the clubs and restaurants are around there...Receptionists speak good English and hard working. They literally manage everything...i went there like 1000times still they had good patience...Make full use of jacuzzi, spa and gym its free....", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Isle of Man", "Title": "“JUST WHAT WE WANTED”", "Author": "georgiaanteneyhoare", "ReviewID": "UR123899419", "Content": "3 of us stayed in Icaria Hotel Bracelona for 2 nights whilst on a city break in Barcelona. the hotel met all our needs and at an excellent price. We booked a triple room and it was excellent with sufficient space and comfortable beds even the 3rd as not a sofa but an actual bed. The hotel was however about a 15 minute walk from the nearest metro stop although this was fine it did take us a while to figure out where the hotel was when travelling from the airport. A taxi to and from the airport was around €30-€35 which was worth it on the way back and we had an early start. The only thing to be weary about is the PICKPOCKETS I had been in Barelona half an hour before someone tried to steal my purse luckily I noticed and the man ran off. Overall we had an excellent stay in the Icaria and would recommend it for those looking for quality with a low budget.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paphos, Cyprus", "Title": "“excellent choise”", "Author": "angelocyp", "ReviewID": "UR123768139", "Content": "Stayed there for a week in January at a very reasonable price. The staff were very polite and helpful, the rooms clean and the breakfast excellent. It's in a very convenient area away from the noisy center but close enough to everywhere really. The bus stops for both the Touristic Bus and the Public Buses are only a few meters away. Only one small complaint- even though the wifi is free, its signal is very week. I would definitely stay there again.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "stuttgart", "Title": "“Off the beatin' path”", "Author": "WaywardTravelor", "ReviewID": "UR123722874", "Content": "We ended up at Icaria on recommendation after the hotel we booked (3 stars) ended up being a dump. We were happy to upgrade to Icaria the only draw back is location. Hotel Icaria is very clean and modern. The only draw back is that it is far from the tourist areas and at least 1/2 a mile (1km) from the Metro. The bus stop is right around the corner. I do not like taking buses to get to the Metro to get to where I am going. If you stay here you will need a Metro pass. Like others stated, get the 10 pass ticket. Little known fact: you can use the 10 pass for more than one person by passing it back after the first person crosses the barrier. Perfectly legal! We even did this right in front of Metro security with no issues. The Metro pass will get you from the airport to where ever your hotel is, even on the bus as long as you do not exceed 75 minutes. Going from the airport train to the metro (and back) is a little hairy but do able with light luggage. During summer the Icaria Hotel's area is probably better as the hotel is only one bock from the beach. We went in January so the beach was not of much use, although my morning runs were beautiful on the nearly vacant boardwalks.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Buckingham, United Kingdom", "Title": "“Decent hotel, close to the beach but a bit far from the city center”", "Author": "Shashmi", "ReviewID": "UR123606446", "Content": "We had booked the hotel thinking it was close to the city center, but turned out its not. Definitely the beach is very close by, but we went in January so it wasnt of great use. The hotel is about 15 mins walk from the nearest metro station indeed not a 2 mins walk (as indicated on some other reviews). Alternatively, You can get a bus from right outside the metro and the hotel is just 2 stops away. The actual location of the hotel isn’t great, the ally next to the hotel has car repair and other mechanic shops and looks like a sad place. On the positive side, the city sighseeing bus comes just around the corner so if you plan to take that tour you can board the bus from walking distance. Note there are two different operators running the open-top sight-seeing bus service and our general observation was that frequency on the tour operated bycitysightseeing.com was lesser than the other one. Coming back to the hotel review, the interiors of the hotel are good, the reception staff were nice, we liked the outdoor swimming pool and the pool side table setting – note the hotel charges 3 euros per person for towels supplied at the pool (this is for the entire trip as opposed to 3 euro per swim). The room itself was nice, we got a pool facing room but it also overlooked upon nearby residences and shops. The room was spacious, and the amenities and room service were excellent. The first day we had ordered dinner in the room, enjoyed the food, and the almond cake was awesome :) The breakfast options were good as well, they had lot many options to choose from. Overall it was a good experience, not an extravagant 4 star hotel, but if you are looking for just a comfy room away from the hustle-bustle of the city center and still easily connected to the city you will like Hotel Icaria.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kathmandu, Nepal", "Title": "“Manish Thapa”", "Author": "Manishthapa293890", "ReviewID": "UR123243061", "Content": "It is a great hotel. We are very happy with our room and the service they provided to us. Friendly staffs, prompt service as well as calm atmosphere is what it attracted us. The hotel is 2 blocks from the beach and you can catch a bus to center from just the corner. The city tour bus is also within 200 meters. and above all it is on a very quite environment which is the best aspect of this hotel.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wroclaw", "Title": "“medium”", "Author": "Pawel_EPWR", "ReviewID": "UR123220151", "Content": "Beach is only 5 min. Receptionist was friendly and spoke good english. The room was clean and clean towels every morning. Breakfast buffet was poor, compared to other hotels we have stayed in. Food menu was very expensive, limited choice. No tea coffe in room. Parking was too expensive, no airporter service.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great Hotel, but a 7-10 minute walk to the nearest Metro.”", "Author": "phogsky", "ReviewID": "UR122967506", "Content": "The rooms are very nice, clean, and modern. The staff is very welcoming and helpful. Everything about the place is nice and seem to be worth the value. The only negative is that it does take a little walk to get to the Metro. There are 3 Metro Stops all equidistant from the hotel. I may be spoiled, because I don't like taking buses. Buy at the same time I avoid using Taxis. Overall great!", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Icaria Hotel, Barcelona”", "Author": "joebloggs j", "ReviewID": "UR122555874", "Content": "Excellent Hotel, Friendly and worth a visit. Make sure you take advantage of the pool and spa area. Staff very helpful and friendly. Close to city centre", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel”", "Author": "PIKEYno1", "ReviewID": "UR122506840", "Content": "Myself, my Wife and 2 kids aged 12 & 8 stayed here for 3 nights over New Years Eve. We had booked a family suite for our stay, but upon our arrival, we were told that all the suites were gone. I think this was because of our late arrival from Dublin due to the delay with our flight. The hotel gave us adjoining rooms on the 4th floor, rooms 412-413. These rooms had one main door entrance at the end of the hall, and two excellent rooms leading from this door. The kids could not believe they had their own room, TV, safe and toilet to themselves. They felt like little adults but beware of the mini bar as our 8 year old daughter thought all her birthdays had come at once. The staff were excellent and polite, and nothing was too much trouble for them. Close to promenade, and beautiful walk to Ramblas etc.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Castle Cary, United Kingdom", "Title": "“Almost Perfect”", "Author": "Gumbetoldtimer", "ReviewID": "UR121466693", "Content": "This is a very good hotel, good location, very clean, good rooms, helpful staff. Close to the beach and very near to a bus stop. Just one small complaint I like a cup of tea in the morning with milk & it was very difficult to get them to put milk in the room. Apart from that everything was perfect.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Valencia, Spain", "Title": "“Stay”", "Author": "jmmlee", "ReviewID": "UR121250451", "Content": "Excellent room and facilities. We were really pleased. Just a small thing: it was practically impossible to get shower gel out of the dispensers, perhaps that could be addressed..? Thanks for a lovely stay", "Date": "November 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bekescsaba", "Title": "“poor quality service”", "Author": "Gabor240", "ReviewID": "UR120449095", "Content": "The hotel is located not far from the beach, but defenietly not walking distance from any tourist attraction. Public transport is a way to get around if you choose this hotel. The area itself is mixed, I guess it used to be an industrial area and it was partially renovated for the olympics. The hotel itself is nice and clean (apart from the gym, the pool and the sauna which were in a not acceptable condition), room is okay. Breakfast was good, but the restaurant was very cold (march) while at dinner we had to wait an awful lot of time for the waiter to get the orders and for the food as well... There were some misunderstandings with the reservation and the staff was showing no felxibility at all that was a bit annoying.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Clondalkin, Ireland", "Title": "“nice hotel, very ignorant security”", "Author": "dubliner57", "ReviewID": "UR120295074", "Content": "A group of us stayed here at the start of October. The facilities are nice and the staff at the desk are very pleasant, but there is one middle-aged man working security for most the day who is the most ignorant person I have ever come across. During our 5 days here he gave out to myself and a friend for talking too loud in the swimming pool at 3 o clock in the day even though there was nobody else around! I also witnessed him having a go at several other guests for ridiculously petty things. Having a drink at the bar was very uncomfortable for many guests as he was constantly standing watching you, and if you got up to use the restroom he would watch to see where you were going! From talking to many other guests they all had the same experience. I would never stay in this hotel again because of this man.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Vacation in October 2011”", "Author": "jlusic", "ReviewID": "UR119959238", "Content": "We were in Barcelona from 09.10 - 16.10.2011. The whether was perfect, somedays even too warm. Hotel has great location - 5 minutes from the beach, 2 minutes from the bus station, 5 -10 minute walk to Metro (Villa Olimpica). From there,5 minute to centre (Plaza Catalunya). Just perfect! Rooms were great,just enough space and big bathroom. Although, we were in the room with the view to the street, we didn't hear nothing! The staff was excellent-kind,warm and friendly! Special thanks to the girls at the reception! Breakfast was great - wide variety of foods which was very satisfying to us! Our experience in the hotel was overall excellent, but still we feel that we need to mention several things that need improvement: -wireless is not available in all rooms -service in the bar is very slow (we noticed the same thing in all bars and restaurants - maybe is just the way of life :) ). -in the bathroom, there is a big unused space for shells for examples (just one or two for girls makeup, parfums and etc.). To conclude, we are very happy we have choose hotel ICARIA for our stay in Barcelona and we would visit the same again, if we have such opportunity ;). Thank you for your hospitality:) Josko and Katarina Lusic from Zagreb,Croatia", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“First class service and quality experience”", "Author": "suarezforever", "ReviewID": "UR119874615", "Content": "Took a long time picking this and pleased with the result. Close to the beach and olympic port and not far to city centre and attractions by bus and metro. Very clean everything works well food nice and service excellent. My son even used the pool in the dark!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oudenburg, West-Vlaanderen, Belgium", "Title": "“Excellent”", "Author": "Christine L", "ReviewID": "UR119320478", "Content": "For the second time, i visited your hotel. We really like the situation, because it's close to the beach and the distance to the centre ( ramblas ) is also very good. Or you can make a walk along the beach and the port, or you can take the bus 41. The hotel is very clean and nice, the rooms large , and a wonderfull bathroom. We had also a perfect breakfastbuffet ! When we came back in the late afternoon, we had a drink at the terrace beside the swimming pool , we really enjoyed our holiday very much. We will surely come back again, but then we will ask a room with view on the swimming pool, and not beside the street. That was the only problem, it was very noisy in the night of the trafic and the people in the night.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Aalborg, Denmark", "Title": "“Cold”", "Author": "Oestergaard", "ReviewID": "UR119319762", "Content": "We vere visiting easter 2011. The reasturant was cold. the food was average. The pool ok, but you had to change at the room. It was not allowed to wear swimsuit in the elevator....We got a room with moisture on the walls from the window and down to the floor. We were not sattiesfied and got a new room. The hotel is situatet near the beach and bus. in a calm area.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ash,Kent", "Title": "“As good as it gets...”", "Author": "WillHamilton", "ReviewID": "UR119138208", "Content": "This is really nice and as good as it gets at this price. I can see why it is so popular. Staff are friendly and helpful; we arrived early Saturday am before check in and so they locked our bags away while we went out. The pool is cold but refreshing and there is a hot tub next to it. The bar is lovely with an ouside terrace. The rooms are modern and smart and the bathrooms amazing. We had the two rooms at the end of a corridor with another door across the width of the corridor so we could leav our doors open to talk to each other. The breakfast is reallgood; there is an enormous spread. My only criticism of the entire stay is that the scrambled eggs were only lukewarm; maybe nobody turned on the warming dish!! It's a short walk down to the beach with its lovely restaurants right by the sand. We walked back from the Ramblas on Sunday. It's not far from anywhere! I'll be back!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Close to beach...”", "Author": "Kiwitraveller1983", "ReviewID": "UR119008519", "Content": "I booked this hotel for my boyfriend's birthday and we very happy with it! I had requested a bottle of white wine for the room as a suprise for my boyfriend...the wine was brought up to the room about 10minutes after we checked in (it was red but the lady was only to happy to swap it for white as I had requested). The beach is only about a 5minute walk away and the water is crystal clear-the hotel lends you towels for the duration of your stay for 3 euros which is much better than having to pack towels. Reception staff were very friendly and only too happy to help. The room was larger than I expected with a big bathroom and it was of a high standard. As mentioned in the last review the metro is 10mins walk and the buses 41 and 14 stop very close to the hotel which both go to the centre of the city. We had the same experience with the coffee and milk...I asked every day for more coffee sachets and the man who was in the bar did not seem overly pleased to oblige. The hop on hop off bus also stops around the corner from the hotel. We had a couple of snacks at the hotel which were nice but did not eat breakfast there. We chose this hotel because of the close proximity to the beach and we were not disappointed! We would definitely stay again.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Amazing, great value hotel”", "Author": "Jen N", "ReviewID": "UR118584151", "Content": "I went to this hotel in September 2010 with my boyfriend. We had a fantastic time there and have nothing to complain about at all. We booked it through a superbreak deal and got a really good offer which I don't think exists anymore but if it did I'm sure we'd definitely go back. The hotel was much nicer than we thought it would be for the price we paid and we were amazed at the standard as soon as we walked in. The room is a great size and was very clean and the bathroom was also lovely. The pool area was great and was never too busy. The staff were all friendly and helpful and we used room service a couple of times which was also excellent. We stayed at the hotel for 7 nights and for us, the location was perfect. The nearest metro station is only a 10 minute walk and it takes 5 or 10 minutes to get to the centre of Barcelona. It is an amazing city with so much to do but we felt it was nice to go back to the quieter area of the Olympic port at night out of the business of the centre of Barcelona. There are good places to eat and nice areas to go for a walk at the beach. During the day you can spend your time sightseeing using the metro or having a relaxing time at the pool or beautiful beach 5 minutes away so you get the best of both worlds. However, if you are staying for a shorter time you may prefer a more central location. I'd also recommend a visit to the Parc de la Ciutadella which is about a 15 minute walk from the hotel and is near the houses of parliament and the zoo. There is a small shopping centre nearby that has a good supermarket across the road from the hotel too. With all this to do we didn't get to try out the spa facilities unfortunately. We would love to go back!!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Nice hotel and good location”", "Author": "sarahknny", "ReviewID": "UR118556356", "Content": "We stayed here in september, there was 8 girls in total. The hotel itself was lovely, really nice staff and the rooms were spacious and spotlessly clean (especially the pool area they were constantly cleaning this which is a really good sign to me!). The pool area was nice although it was shaded until after 1pm, due to the highrise buildings surrounding it. The location was excellent we were only a five minute walk away from the beach, resturants and pubs and clubs. The only negative really was we arrived home one night to sit in the resident bar which was supposed to be open until 3am and this was 2am but they were closing up, but with all due respect the girl behind the bar said she would sell us beer or shorts but no cocktails and that we had to drink them in our room which was ok with us. Overall it was a very pleasent experience, clean rooms, pleasent staff and great location what more could you want.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nenagh, Ireland", "Title": "“Noreen Ireland”", "Author": "Noreentm", "ReviewID": "UR118535602", "Content": "We have just returned from a week in the Hotel Icaria. The Reception Staff were excellent and gave us a quiet room as requested. We found the staff always ready to give directions and were very helpful. Amy in the dining room was delightful and is a great ambassador for the hotel. There was a very good selection of food at breakfast. The rooms were very clean and the linen and towels were changed daily. We didn't use the metro as the 14 and 41 buses stopped outside the hotel and went to the city centre. It was very convenient to the beach and resturaunts. A shopping Centre with Cinema (films in English) and a supermarket is a five minute walk from the hotel. We felt the area was very safe and would have no hesitation in staying there again if in Barcelona. Thanks Icaria!", "Date": "September 24, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Bridllngton UK", "Title": "“hotel icaria barcelona”", "Author": "Trevor C", "ReviewID": "UR118273022", "Content": "Modern hotel built we believe for the 1992 Olympics. Reception staff spoke excellent English and were peasant and helpful Staying two nights after cruise and arriving at 10.30am we were allowed immediate acces to the large air conditioned room with hugh bathroom and walk in shower, pool facing and quiet. Our 2 day package included breakfast at an inclusive cost of 108 euros per room night.A good choice of cold and hot food but unfortunately the hot food wasn,t. There was also a problem in finding crockery for late risers as tables remained uncleared The pool was clean and popular with too many 'reserved' sunbeds from early morning although the sun didn't reach the pool area until after mid day Ate in the hotel the first night with a reasonably priced menu well presented. The hotel is on;y a short strol from a lovely beach and the Olympic sailing harbour with many fish and tapas restaurants. The number 14 and 41 buses stop close to the hotel for access to the centre of Barcelona and the route show many of the sites. The hotel offers luggage storage for late departures We would definately use this hotel again", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“fantastic hotel”", "Author": "Dan L", "ReviewID": "UR118246371", "Content": "Just got back from a week long stay and the hotel was faultless. Not sure what the below review is complaining about as I found the reception staff were extremely polite and helpful, room was spacious, cool, quiet, comfortable and clean. Beach towels at 3 euros for your entire stay definately doesnt seem unreasonable to me. There was a bus stop right outside the hotel which was served regularly and meant a quick 10 minute ride to the centre of town (La Ramblas/Pl Catalunya). The hotel was a 2 minute walk from a very nice beach. There's a supermarket 1 minute up the road so you can stock up on food and drink for a cheap picnic on the beach. Free wifi throughout the hotel was slightly temperamental but it was free so can't really complain. There's also 3 computers for guests to use in the lobby, very useful for looking for things to do in the city and printing things such as boarding passes. To top off a fantastic hotel there was also a beautiful pool, hot tub, sauna, steamroom and gym which were perfect for relaxing after a day of walking the city (which incidentally didn't seem to merit all the concern about safety - just act as though you would in any city and you'll be fine) Already recommended the hotel to family and if I ever go back to Barcelona it will be the first place I look for.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "1", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Disappointed the reviews are not accurate”", "Author": "MissieMom07", "ReviewID": "UR118205443", "Content": "This hotel is run down and in a bad part of town for safetly and cultrue. As for the important stuff the beds were so so the linens were nice though, but the shower was aweful it would get really cold and then scolding hot randomly.I would have rated it just averate because i got a good rate on the hotel but the less than helpful and honest staff made it a poor rating. We asked a non smoking room and was put in a smoking one anyways and when we asked the staff they lied and said we were in non smoking yet the whole floor was smoking. Then when our AC in the room wasn't working the front desk said they would send someone immediatly but after 3 hours of nothing we went to bed and when we asked again in the morning the front desk, same person, said she didn't know what we were talking about and that there was not a a service call for our room. I should have known we were in from trouble when at check in despite the fact that we were the only people in the lobby we had to wait until the two receptionists were done giggling and joking with eachother and then still didn't even ask us if we needed anything standing infront of them holding all our luggage. The area is bad and extremly unsafe as well it is a 10 minute walk to the closest metro and the streets are lined with cops and people have been hit in the cross walks here! There is no where to eat worth while over on this side of town. The beach is just across the street which is why we stayed here and it was the only highlight, but if you need a beach towel which you will becasue they claim they will cancel you reservation if you take a room towel to the pool or beach, you haveto rent if ro 3 euros a towel! What service!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ireland", "Title": "“Fantastic hotel for families”", "Author": "Leeca1", "ReviewID": "UR117994967", "Content": "Stayed in this hotel for a few days and its really stunning, pool area fab, Bar area lovely, do great cocktails, food is lovely and very reasonable priced, would def recommend this hotel", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "", "Title": "“Nice location, modern hotel, with some flaws”", "Author": "Oaltun", "ReviewID": "UR117538544", "Content": "Good hotel in an ideal location between port olympic party nights, the beach and the center. We were overall happy, however there were some small problems: 1. The wireless internet does not work in the corner rooms, so ask for a room close to the elevators if you will need it 2. there was no shower gel - cleaning forgot to replace the big bottle. Not a nice surprise at 2am in the shower.. 3. The breakfast could be better 4. The bed was too hard - had a stiff shoulder the next day", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Warwick, United Kingdom", "Title": "“Very nice clean hotel”", "Author": "Andy G", "ReviewID": "UR116850385", "Content": "The hotel is very close to the beach and it is very clean. A nice patio area out the back for sunbathing and using the pool. The staff were very helpful and overall well worth the money.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Johannesburg", "Title": "“The smells were aufull!”", "Author": "StefT", "ReviewID": "UR116732624", "Content": "The biggest drawback, and hence the low scores we give this hotel on cleanliness and comfort, was the terrible smell of both the 6th floor passage and the rooms themselves. We were, appreciatively, upgraded to suites on the Hotel's top floor, yet the smell of cigarettes (we think) was unpleasant, pervasive and completely over-powered us and our kids. Also, the general condition of the carpets in the foyer was not great. In addition, the air-conditioning could have worked a lot better and the soap dispensers in the suite just did not allow for enough, and ease of, soap to be dispensed, which was frustrating. On the positive side, the hotel was located well within easy reach of the beach and the staff were extremely helpful - something we did not generally experience in Spain.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“We won't return to Icaria”", "Author": "edew4", "ReviewID": "UR116676777", "Content": "We stayed in hotel Icaria for a week. I would not recommend this hotel and do not think it is worth 4 stars. Our room was not ready when we arrived at 10 pm(!); At last the extra bed was ready, but on the nightstand we spotted an empty cereals box and in the closet a half eaten bag of nuts, from the previous guests. After two nights without sleep because of the noise of our neighbours (french teens) and early mornings because of the broken curtains (light), we moved to a better room. But still: the hotel is very noisy. The mattresses are very hard and uncomfortable. The reception staff is nice but the waiters (breakfast and terrace) are very unpleasant, almost rude.(exception: Fouzia). If they don't like to serve people why do they choose a job in the hotel and catering industry? They hardly greeted, it seemed like you had to be grateful to get a drink, when ordering a cup of coffee the saucer was full of coffee, they charged double and we were rudely approached when one of my daughters dared to drink a brought can of coke which she had not ordered in the bar. Regarding the fact that the terrace is the only possibility to sit outside (no balcony) and regarding the prices this is not very guest friendly, when the terrace is almost empty. And yes, the soap dispensers were not refilled, the one downstairs, next to the terrace and restaurant remained empty during our stay. The music played in the breakfast room is horrible and they play the same songs over and over. The positive comments I can make are about the reception, fresh fruit at breakfast and the location, near to the very nice and quiet beach and near to the busstop to the city center (14, 41). We won't return.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Ireland", "Title": "“Nice modern hotel”", "Author": "fifidIreland", "ReviewID": "UR116649698", "Content": "Stayed at this hotel for 1 night before, embarking on a cruise. hotel spotlessly clean and very modern. Free wi-fi. We were upgraded to a suite {free of charge} which was lovely and spacious. Very quiet at night no entertainment, which did not bother us too much as we were only staying for 1 night, and had an early start next morning. Only thing I can fault is the breakfast next morning, which was jusy okay. Fiona.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Location perfect, hotel ok.”", "Author": "edmar1971", "ReviewID": "UR116375888", "Content": "Our stay at Icaria for a short city trip was okay. The location is near the beach and a lot of restaurants. Perfect boulevard for a walk after busy day in the big city! breakfast was good room was good, except there was no soap, the dispensors were broken. We asked kindly at the reception and someone from housekeeping came directly. She told us she could not repair it and left. Was not repaired in the 3 days we stayed here. swimming pool was too small for too many people, it also needed some maintanance and cleaning. Parking was flooded. At night a lot of noise I guess from people coming back from a night out.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Galway, Ireland", "Title": "“If Carlsberg did hotels...”", "Author": "CorynneC", "ReviewID": "UR116341730", "Content": "Having read some bad reviews about the receptionist staff, I was somewhat skeptical about meeting them. However, I have no trouble in admitting they were some of the kindest and most helpful hotel staff I've ever met. The only staff in the hotel that didn't provide an 5-star service was the breakfast host. I am aware that the breakfast rush is a stressful time for the hotel, but his mannerisms were rather curt and by comparison to his co-workers, his work/efforts were sub-standard. The room itself was gorgeous. Spacious, clean and just beautiful. My only complaints here were the following: 1. The light fitting over the desk was broken. Also hung low so my (tall) friend kept hitting his head on it. 2. The 'Double Bed' was actually two singles pushed together, which was fine, but, while not an issue for this trip, obviously one could not sleep near a companion. 3. The mini-bar was not fully stocked with everything that was on the list. 4. There was no 'intro pack' in the room. No information about pool times, dinner times, numbers to call for reception, no TV channel listing. Also only 1-2 channels were in English, which is fair enough, but it would've been nice if we could have taken advantage of the technology in the room. The TV also had no USB port, which would be nice. Again, these are only minor complaints and nothing that detracted from the actual experience. Personally, I loved the location. It was one of my favourite parts about this hotel. It was so close to the beach (2mins to Bogatell/Nova Icaria), and when you realise how compact Barcelona is, not at all far from the city centre either. It was ideal for me because it was quiet. The swimming pool was also very nice. It doesn't however have a \"shallow end\" and a \"deep end\". It just gets a bit deeper in the middle. I'd recommend putting up some safety and warning signs. I saw many children, and even some adults diving into it. For something as shallow as that, it really is an accident waiting to happen. While I understand why, it was a shame that the jacuzzi and pool close at 9pm. 10pm would be fairer, I think. It would give the adults some time to enjoy it without all the children around. Also, a few more loungers wouldn't go amiss. Lastly, 'The Vanity Room' Cocktail Bar was absoloutely stunning and the adjoining terrace was a pleasure to sit in. However, I was disappointed by the lack of variety in the cocktails. There were approx. eight. Not exactly what I would have imagined in such a high class bar. I would most certainly stay here again on a return trip to Barcelona.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Second Visit - and still excellent”", "Author": "Alexander028", "ReviewID": "UR116337153", "Content": "Second visit. Excellent standards maintained here. Well managed. Don't see how anyone can fault the reception staff - they were considerate, helpful and kind at all times with us and we had our cases carried to the taxi on departure. They take no nonsense from anyone who spoils enjoyment of others. Witnessed three male teens (French) getting a massive telling off about something they did by the pool, just short of being ejected. The place is spotless and efficient. Great buffet breakfast. Main lunch/dinner menu is very limited but well-cooked. Cross the road for the beach and Port Olympic; turn right for the city. Metro is about 10 minutes to the right, just before the Zoo. Consume supermarket to the right. It's an upmarket trendy residential area and is very quiet.", "Date": "August 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Thumbs up”", "Author": "Jetsetterlover", "ReviewID": "UR116320170", "Content": "Good location to the beach! Not far to central by metro Rooms are big and clean! Definitely would recommend! Nothing to fault this hotel", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Oulu, Finland", "Title": "“Nice place!!!.”", "Author": "Quimico40", "ReviewID": "UR116175549", "Content": "Good place for families and solo staying. Good conections to donwntown by bus, metro a little far. Nice staff. Breakfast good, but allways same food. A´l carte menu was good too, but only few choices on whole week. Swimming pool is for children, very small. In general is nice hotel.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Limassol, Cyprus", "Title": "“Couldn't get any better”", "Author": "gmp123", "ReviewID": "UR115957525", "Content": "The best hotel in Barcelona regarding location. It is situated in the middle of the city, bit more quiet and safer than city center locations...very close to the beach, to diagonal mar shopping center, to la rambla city center, in a few words...close to everything that Barcelona has to offer.... Great service, clean rooms and towels every day, mini bar, free internet access or computer use...elevators work only with room key so its safer, nice spacious bathroom etc etc....Stayed there twice and would stay there again! A+...would recommend!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Sydney", "Title": "“Good location, awful reception staff”", "Author": "sergeyvzn", "ReviewID": "UR115594129", "Content": "This hotel is great if you want to combine sightseeing with a bit of beach holiday, it's about 3 mins from the beach of Nueva Icaria, walk out, cross Icaria Avenue, walk along the pedestrian bridge and there you are. The greet route of Barcelona's hop-on/hop-off bus is in 50 meters and if you want to go to the centre, there is a bus stop just outside the hotel Nice comfortable rooms, great amenities, free wi fi and a great breakfast However, their reception staff was bad, when I arrived and walked to the reception, I was met by a surly sitting girl who said she'd finished her shift and I had to wait for her colleague to show up! All the while browsing something on the computer...if this happened in Australia, she'd be sacked on the spot. My twin room request was not honoured, I was given a double room, of course. That was discovered when me and my mother (we were travelling together) went up to the room we were allocated. So I had to go down and ask for a twin room, pointing out my \"twin room, please\" request in the reservation. THe check-in girl said something in Spanish that sounded like \"oh you funny tourists you make funny reservation requests that no one reads here anyway and you want your preferred bed type allocated upon check-in, dream on\"...however, I got my twin room after all. Their breakfast guy was very unfriendly too, he checked and double checked my name to make sure I would get charged for the breakfast (it was not included in the rate), the next morning he made me stand and wait at the restaurant entrance desk while he was printing a breakfast docket for me to sign before I was even allowed to enter and sit down. Appalling service! The hotel is fine but needs to do something about its staff", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Close walk to the beach with a great pool”", "Author": "Athena2003", "ReviewID": "UR115536657", "Content": "We stayed at Hotel Icaria for one night upon arriving in Barcelona. This hotel is in the Port Vell and La Ribera area of the city away from the busy downtown. It was less than a 5 minute walk to the beaches and the pool was great. The employees at the front desk spoke some English, and we were permitted to check in a couple hours early. The only downfall of this hotel is it's location since it's so far from the heart of the city. Although a short walk from the beaches, it was 5-6 blocks to the metro, and a 20 minute walk to Barceloneta.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oskemen, Kazakhstan", "Title": "“The exellent Hotel that is worthy of the most beautiful city Barcelona!”", "Author": "Vikt0r_P", "ReviewID": "UR114907378", "Content": "We liked the hotel a lot. There are several minutes to the nice beach. A shopping center where one can get the essentials is situated nearby. It takes about 15 minutes to get to the subway however we considered that fact being an additional walk along amazing city. There is a very good service there. Breakfasts are superb and diverse. The hotel's swimming pool perfectly complements sea bathing. The \"Bus Touristic\" which has a stop near the hotel is a good way to see the places of interest of the city. We will certainly stay at this hotel next time we visit Barcelona.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Espoo", "Title": "“Great hotel”", "Author": "Mr_Matti", "ReviewID": "UR114894706", "Content": "Very good breakfast. Swimming pool and jaguzzi were in heavy use (6 year old daughter + parents). Quiet and peacefull neighbourhood. Close to the beach. Helpfull people at reception. Only negative point was strange smell in our first room but problem disappeared when we changed the room", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“relax, enjoy and make yourself comfortable”", "Author": "funkygirl01", "ReviewID": "UR114802602", "Content": "we really enjoyed our stay at the hotel. the room was clean, the staff very friendly and patient. they spoke very good english which is not that common in Barcelona! we did not take breakfast,lunch nor dinner at the hotel but went to local restaurants, bars etc.. which turned out cheaper for 3 single girls on a budget:-) all interesting areas to visit are within walking distance of the hotel but if you would want you can also take the metro which is 5 min away an very easy to use. And when you are tired of visiting this lovely vivedly city, you can relax at the hotel's swimming pool with a glass of excellent wine or cava! those were the days:-)", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "aberdeen", "Title": "“Loved It - Would Recommend To Friends”", "Author": "dferguson", "ReviewID": "UR114762499", "Content": "Stayed there on 10 June 2011 with members of my family prior to going on a cruise. Ideally situated near to cruise terminal and not far away from city centre. Near to a bus stop for the Barcelona Tourist Hop On/Hop Off Bus and only 5E in a taxi to Las Ramblas. Rooms very spacious, clean and comfortable. Staff helpful and breakfast plentiful with a wide variety of food. Hotel is in a safe area and is good value compared to those in the centre near to Las Ramblas. Would highly recommend it to others.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "NW England", "Title": "“Spot on!”", "Author": "Reesemeister", "ReviewID": "UR113404602", "Content": "Spent a couple of nights at the hotel Icaria in June, the hotel is approx 20 mins transfer from BCN with a taxis costing approx 35 euros e/w. We were able to check-in at 11:30 althought the rooms weren't supposed to be ready until 14:00, the room was clean and spotless and nicely done, the views are a bit naff but that really wasn't an issue for us. The breakfast was great, lots of choice (hot, cold, fruit, cakes etc.) although it did tend to get busy round 10ish. The pool is a bit on the small side but with the sea a 5 min walk away again that really wasn't an issue, it also has a patio area alongside the pool which was quite handy, as we were able to sit and have a \"few\" drinks without hunting for loungers/chairs. As the Olympic port (10 mins walk) is just down the road, this is pretty handy for eating/drinking without having to go all the way to La Rambla. If you did want to go into Barcelona/La Rambla etc. then its approx a 30 min walk or an even easier option is to get the bus! During our stay not one of our party (13 of us) had anything but complimentary comments to say about the hotel, if I was coming back to Barcelona, I would stay here again.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Saint Louis", "Title": "“Fantastic Base for Exploring Barcelona”", "Author": "OAA_STL", "ReviewID": "UR111613517", "Content": "Hotel Icaria is ideally situated for exploring the city as it's just out of the way enough to be peaceful at night and just close enough to the beach, one of the stops on the city bus tour, and the Metro to provide you access. The rooms in which I stayed were spacious, airy, and comfortable, and both were on the pool (back) side of the hotel which meant I could leave my large window open all night long. They do begin cleaning the pool area at a very early hour, but the only thing I noticed was the music they played while cleaning - mid-tempo Sting and Sinead O'Connor hits. Free WiFi was rather handy for email and Skype and Anna at the front desk was just delightful. Were I lucky enough to return to Barcelona, I would not hesitate to stay at Hotel Icaria again.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "glasgow", "Title": "“Lovely hotel, great location”", "Author": "misstee83", "ReviewID": "UR111089082", "Content": "Ater travelling for two days due to the volcanic ash delays, we finally made it and we were not disappointed. It is also important to mention here that the hotel did not charge us for the night we missed due to flight cancellation as we kept in touch with them and advised of our delayed arrival - this was an unexpected and pleasant surprise! The hotel is in a great location, five minutes from the lovely Icaria beach and a nice walk from the Olympic port and Marina. There are some lovely tapas and seafood restaurants and beach bars nearby, and staying here really made us feel as though we were on a relaxing beach holiday, despite being close to La Ramblas, Sagrada Familia, Parc Guell and and all the bustle of Barcelona. Taxis from here to the centre of town were frequent and cheap, as was the bus service that passed the hotel. We were here for the Primavera Sound festival, and were within half an hours walk from the venue, so would definitely stay here again if we return to the festival next year. The room was slightly small, but the bathroom was huge and well equipped, and the decor of both were lovely - could not complain at all about the cleanliness or appearance of this hotel, The pool was great, never too busy, as was the heated jacuzzi. The buffet breakfast, at 12 euros, was slilghtly expensive given that there are beach bars nearbv offering sandwiches for half that price, but had a good choice and ideal for filling up on before a long days sight seeing. We will definitely return to the Hotel Icaria - cannot fault it in any way.", "Date": "June 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Fantastic”", "Author": "turner_nay", "ReviewID": "UR110012134", "Content": "Excellent staff who were incredibly helpful and professional. Situated 3 minutes walk from the beach and on the main bus routes to all areas of interest. Lovely breakfast and cocktails. I will definitely use this hotel in the future.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Ticked our boxes!”", "Author": "shandy00", "ReviewID": "UR108227333", "Content": "We arrived at the hotel on a Sunday afternoon. Taxi from the airport was 28Euros. We recieved a friendly welcome from the reception staff. Room 506 overlooks a road in a mainly residential area. The road is quite busy but the noise did not bother us. We enjoyed a tasty breakfast with a good choice. Although the food could have been somewhat hotter or served on heated plates. The reception staff advised us on transport into the heart of Barcelona, a bus 14 or 41 stops literally outside the door of the hotel, every 10-15 mins. A little further down the road there is a Tabac where one can purchase a bus ticket for around 7Euros, this will provide 10 seperate bus journeys, so excellent value for money. Ride into town is around 10-15 mins. On the way to town you pass the most amazing park, visit the park it is so beautiful, with amazing sculptres, water features and a boating lake. If you get the 92 bus opposite the hotel it will take you to Gaudi gardens (again with the bus pass) 40 mins and well worth a visit. On first arrival the hotel seems a little off the beaten track but the Icaria has the best of everything in my opinion. nice pool area, short ride to town, a stroll to the Olympic Port which has a lovely selections of restaurants. A cinema complex and restaurants over the road including Turkish, Chinese etc and a supermarket. Safe area, away from the hustle bustle of the Ramblas. The room had a slight technical problem with the TV and the staff couldn't have been more helpful. As the problem couldn't be repaired the reception sent chocolate covered strawberries, fruit and cava to the room. A really lovely touch. I would not hesitate to stay at the Icaria again and would reccomend it to anyone who is looking for a nice comfortable place to stay.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Great Hotel & Staff”", "Author": "UkMhamilton", "ReviewID": "UR107840719", "Content": "Good service. Excellent breakfast, near to the beach. Ok, a bit far from town but Taxis and bus stops near to hand (only 15-20 minute walk to centre). Would happily stay here again.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Doncaster", "Title": "“Highs and Lows”", "Author": "inntheknow", "ReviewID": "UR106660267", "Content": "Stayed here for four nights and some experiances were good and some bad. The room overlooked the swiming pool at the rear of the hotel,was quiet and so we slept well. It had blackout curtains, mini bar, flat screen TV with 4 english channels,safe, good size bathroom with bath, shower and bidet. Our room had tea and coffee tray but the other three rooms did not! We asked for extra coat hangers and they arrived promptly. Breakfast had a wide choice of food, but everything was self service! As in most hotels the hot food was cold e.g. fried eggs,bacon (very fatty) and sausages (though they sometimes had two types) and cold plates. The breakfast room is a bit like a cafeteria. As in some of the restaurants they never put a cruet on the table! Service wise the female staff were excellent (especially Reception) but the male staff were very indifferent and even the Manager walked around, doing nothing in particular and talking to nobody! On the Friday evening we arrived back late and decided to eat in the hotel and were informed that there was only one chef on and there would be a 30 to 40 minute delay. The meal took two and a quarter hours and the main courses appeared sporadically (which happened in other restaurants as well!) The waiter then gave us as compensation four 10% discount cards to be used in the cocktail bar. The problem was that on the Saturday night it was closed for a private function and it closes on a Sunday and Monday! The food when it arrived was not that bad. Overall a mixed experiance. It is certainly not 4 star but a good 3 star one.Paid the same price as a 4 star hotel in London except we got breakfast which was a special offer on the web site. Had some excellent recommendations of local restaurants from the reception staff.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "cork", "Title": "“when reviewing a hotel the main question i would ask is if i would stay here again, the answer would be no”", "Author": "gordon75Cork", "ReviewID": "UR106332226", "Content": "firstly on arriving at this hotel i had requested a Club Room with a double bed, when i got to the room it was a room with 2 single beds shoved together so was giving a new room, cant fault the room although a little on small side. A Club Room is supposed to have all the high end ammenities but dont expect to make a cup of tea as it has no kettle, it also doesnt have a working towel rail, found the pool area to be quite noisy with a load of kids running wild yet there is a notice saying that pool is a relaxation area. Cant fault breakfeast you can have a fry,cereal,fruit,croissants,cakes and rolls.Had a 3 course meal in hotel on 1 night for 21euro, starter was fine the main was a piece of meat and half a potato which was a joke, if i could go back again i would try somewhere else because this is supposed to be a 4 star hotel but in my mind it falls short, although cant fault the staff who where always helpful but the hotel just falls short", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely, clean, pleasant staff in a quiet part of town.”", "Author": "A TripAdvisor Member", "ReviewID": "UR105251848", "Content": "Was a lovely hotel and would def stay there again. Le rambles is at least a 40min walk. There are restaurants near the port and most look very nice. We ate in a couple of Italians and they were lovely.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Peaceful, clean & comfortable hotel”", "Author": "Tarmum", "ReviewID": "UR104819075", "Content": "Located near Olympic Port in a peaceful area. Just 3 min walk to a lovely beach and bars. Taxi to centre of town quick and only 5-7 Euros! Didn't try the walk as with children. Tourist bus stops near by - but be warned the morning queues were dreadful - bus constantly arrived at the stop full, Recommend you walk back a stop to Port Olympic (5 mins) for an easier time. The breakfast buffet was great - lots of local and standard choices - seemed to be topped up very quickly with fresh supplies when busy. Definetly worth doing a B&B rate (also no other breakfast choice nearby). Small pool and terrace a nice extra - good for a relax/cool off after a busy day. Only one complaint - a 3 Euro charge for pool towels - spoilt an otherwise great experience (noticed post people used their room towels even though we were told it was not allowed). Would not hesitate to return", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St Austell, United Kingdom", "Title": "“Pleasant, clean, convenient and friendly”", "Author": "pottering_pasty", "ReviewID": "UR103188741", "Content": "Stayed on business for a conference. I had a quiet room overlooking the pool at the back of the hotel, so had a good night's sleep. Comfy, practical rooms - and very clean. Breakfast was good - plenty of choice and good quality. Had room service one night too and that was good - prompt and good quality. The hotel is not far from the beach and public transport makes it easy to get about. However, it's a bit far to walk into the main centre.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Fantastic hotel”", "Author": "paulaannedon", "ReviewID": "UR103131879", "Content": "Slightly off the beaten track. Our room was fantastic with a lovely view. Good tea making facilities. Within easy walking distance to port and felt safe at night walking back. Staff very helpful and friendly.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“A bright modern hotel which is clean and comfortable”", "Author": "Satisfied031", "ReviewID": "UR103013769", "Content": "A very pleasant hotel with helpful staff and which was near to public transport so that all areas of the city could be reached without difficulty", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“This hotel grew on me”", "Author": "00runningalison", "ReviewID": "UR102048410", "Content": "Hotel Icaria is a good 10 minute walk from the nearest Metro. Get a cab from the airport - I will do that on the way back. The staff here are all very helpful and friendly, recommending restaurants and giving directions. There are lots of good restaurants at Port Olympic which is just a few minutes walk away and I easily walked into the centre of the city, but not sure that my 66 year old mother could do the same. It is a long (but flat) walk with plenty to see on the way. This hotel does not have sea views but is close to the beach. Would I stay here again? Possibly. It is a bit far from the centre of town, the pool is outdoor and unheated so not useable at this time of year. The breakfast buffet was good but they didn't have porridge, meusli or granola or any soya milk. Still, there is plenty of food on offer and otherwise a good selection. Overall, a great place to stay if your priority (like me) is to be near the sea and within (just about) walking distance of the city. Next time I would probably look to stay at Port Vell which is both close to the beaches and close to the City Centre with more choice of bars and restaurants.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Ystad", "Title": "“Not the best hotelexperience I've had”", "Author": "Appelgren", "ReviewID": "UR98394689", "Content": "Our first visit to Barcelona was a nice experience if it hadn't been for the hotel. It looked OK, price was OK, breakfast more than OK but the bed seemd to be covered with some plastic under the sheet, the AC was hard to get working, the remotecontrol for lightning didn't work and - worst thing about Icaria Hotel - the rooms were not made unless we asked them to it at 5 PM on two days... The Nightclub was open on Saturday, or at least we thaught so. We will certainly not recommend this place to anyone else", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Very good hotel”", "Author": "Mike_J_F", "ReviewID": "UR97107609", "Content": "this hotel is perfect for anyone to behoest, its only ten or so minutes to one of the main hotspots in Barca, port olympic is the main strip, if you dont know where you are going the hotel will get you a taxi. The rooms are of a typical hotel style with a bed, desk mini fridges and a bathroom. We went in December and it wasnt the warmest or the coldest. The swimming pool was not in use this could be due to the fact it was December. here are computers that are free to use. Room were cleaned every day. This is a very good hotel over all and i would recommend it to anyone staying in Barca.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Nice hotel, shame about the staff.”", "Author": "MooandJu", "ReviewID": "UR94122034", "Content": "Our room was so hot, due to a broken climate control. That it was impossible to sleep. The following afternoon we informed reception about our problem and were told it would be fixed promptly. We waited for over an hour and a half for maintenance to come and eventually had to call down to reception to find out where the supposed maintenance person was! (This in itself was a little unusual as the only available phone was on the wall next to the toilet) Upon calling we were informed by the same curt and totally unresponsive girl that we had spoken to earlier. That the heating system had been turned off in our room. (nice of them to tell us) And that night we spent another night in an overly hot room with the heating still mal-functioning. Another thing. Why when you pay so much for your room, (especially a sweet as we had) is the breakfast extra?", "Date": "January 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Utrecht, The Netherlands", "Title": "“value for money”", "Author": "bergfietser", "ReviewID": "UR91371093", "Content": "Good hotel for a reasonable price. Location close to the beach, a bit outside of the centre (20 min walk) in a quiet neigbourhood. Rooms were clean and spacy, great breakfast buffet. Recommended. Booking directly on the website of the hotel is recommended because on other sites you can't include breakfast.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lisbon, Connecticut", "Title": "“Kind of pricey, but very nice and GREAT breakfast”", "Author": "CJDamien", "ReviewID": "UR91219543", "Content": "the front door glass looked like someone hit it with a bat, and the reception didnt speak great english, but they were very helpful. The pool was under construction and the Jacuzzi had freezing water in it. The breakfast was AMAZING! The restaurant didnt open until 8:00 pm, but was pretty good. Rooms were spacey.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Interesting visit....”", "Author": "love2traveltogether", "ReviewID": "UR87923308", "Content": "My husband and I selected the Hotel Icaria Barcelona for 2 nights stay. One before our cruise and one at the end of our cruise. We took at taxi from the airport to the hotel and it cost approximately 40 euros. Upon arriving at the Hotel Icaria from our long trip to Barcelona, we were given a nice room. Though not large it is modern, mostly clean, except for a small opened bottle of nail polish remover that was left on the night stand. O.k. so we threw it away and got ready to spend what the rest of the day was left visiting the Olympic Port and having dinner. The Hotel Icaria is in a somewhat desolete area of Barcelona, however a quick walk away and you will find the Olympic Port, which is located on the beach. The Olympic Port is a great place to dine and to just walk around. The walk to and from the hotel to the Olympic Port is approximately 10-15 minutes. We had a pleasant nights sleep that night, as the bed was comfortable and we were definitely exhausted from our travels. The next morning we slept through breakfast (due to jetlag and time change) so we got up in time to get ready and catch a cab to our cruise. The cab cost approximately 15 Euros to the port. It is a very convenient location if you are spending only one night before a cruise. We then did not return to the Hotel until the end of the week. We got off the ship in the morning so we did not expect a room to be ready but they graciously did give us a room. We were in room 217. This room was larger than our last and again very nice and modern and it faced the lovely pool. We dropped our stuff off in our room and went out to enjoy the beautiful city of Barcelona. We opted to purchase tickets on the Bus Turistic and the bus stop is a block and a half away, so it too is very convenient. We spent the whole day seeing the beautiful sights that Barcelona has to offer. Upon returning to our room, we prepared for our early flight out the next day and went out to dinner. We came back early because we had to be up at 5am to catch our flight. Upon arrival back to our room, 7:30 p.m we heard a lot of noise at the pool. We hoped that by 8pm the noise would stop but it did not. We had to get some rest for our long flight home, so we chose to put on our t.v. to drown out the noise. It helped and within an hours time we were asleep. No sooner did we fall asleep that I heard someone trying to open our door. I woke my husband who jumped out of bed at the same time that a man walked in our room. He had a key and was very apologetic. He immediately left the room. I was so upset, and called the front desk to advise. They were extremely apologetic and shut off all keys to our room and brought us new ones. At that time the noise at the pool was still going on and it was now 9:30 p.m., our time to sleep was becoming less, so I inquired as to when the pool area would close and I was told that it would close by 10p.m. Once again, we put on our t.v. and tried to sleep some more. The noise did not end until very, very late and needless to say if having someone walk in your room does not make for a peaceful night, I do not know what does. In the end we got a little bit of sleep and the next morning we spoke to a lady at the front desk who was so apologetic over what happend that night. We asked for the managers name and she gave it to us. We have since contacted management and they have been nothing but accomodating and understanding. In the end, I just think that it was bad luck for us that night. I honestly believe that the Hotel Icaria is a nice hotel, nice rooms and a very nice staff. Even after all that we went through, I would still recommend it.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "barnsley", "Title": "“ola great hotel”", "Author": "frajil", "ReviewID": "UR86147140", "Content": "This hotel was great.True it was a little way out of city but it was nice and safe. Afive minute walk to the port with restaurants.shops and casino. The staff were good and hard working. Be vigilant on la rambles first day someone tried to get in my bag.I walked around with my hand on the zip all the time.Reported the description of the pair to police saw them everyday.Must go to the hard rock cafe 15 euros for the biggest and best burger ever. went to nou camp on metro had to change easy when hotel staff told us where to go. Magical city and a lovely hotel would stay again if the breakfast was hotter it would have been perfect filled up on other things. zoo worth a visit and shops to die for.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good Hotel if you want a quieter location”", "Author": "Cfcsccc", "ReviewID": "UR85580064", "Content": "We stayed for my sons 21st birthday celebration with a group of 6 of us. The rooms are clean and comfortable and the breakfast buffet is very good if you can get it included in your room rate. When we were there the evenings were quiet with none seeming to eat or drink at the hotel. Pool area vey good although with a full hotel it could be a bit crowded. There are 3 pc's for internet use which while they remain free are a good facility. A bit of a hike to the main town Ramblas etc but it is only a short bus ride away. The beach is only 10 mins and is very good as is Port Olympic with its eateries. Just be careful as the metro etc are full of pickpockets and we did have an incident on our arrival. All said this is an ideal hotel for a break if you prefer a base out of the centre.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Modern, clean friendly staff - a little out of the way”", "Author": "LindanPeter", "ReviewID": "UR84574061", "Content": "The location is a little out from the centre of the city but the bus services are close,frequent and cheap. The city tour busses also pass by the front door. The rooms were clean and modern.We had one of the balcony rooms with a view of the whole city.The beach was close.We found the reception staff very helpful and friendly not so the restaurant staff although the problems are not of their making. The buffet breakfasts were Ok if you didn't want hot food as the hot food frequently wasn't hot and the coffee machines struggled to give a reasonable cup of coffee.This was probably due to the large number of guests and the low number of staff.We stayed for dinner one night, as there is no where close for a meal. There were only two waiters and a number of guests had also decided to eat in. The service was slow and the food ordinary. However this was a pleasant stay for us and we would certainly recommend the hotel with the proviso that it's a little out of the way. Hopefully the breakfasts can be improved as this is an essential requirement for anyone staying.They can always have their other meals elsewhere", "Date": "October 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "west yorks", "Title": "“Ideal if you want a city break/beach holiday!”", "Author": "hippo35", "ReviewID": "UR84328259", "Content": "Stayed at the Icaria for 4 nights, very clean modern hotel, nice outdoor terrace area which is the only area you can smoke in although info on the web does not state it is a smoke free hotel! The hotel is a ten min walk from Port Olympic and metro, there are a few restuarants and an indoor shopping mall on the avenue but really you have to walk to the port for any life! The area does seem quite safe...saw lone females jogging on the beach promade at 10pm! The bars and restauarants on the port were quiet but id imagine in the summer months would be very busy, because of this i,d probably stay at the Icaria June to Sept when its warm enough to go to the beach etc", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Goodyear, Arizona", "Title": "“Good value and good location”", "Author": "JuneAZ", "ReviewID": "UR82666595", "Content": "I spent hours looking for a hotel with a family room and the reviews on TripAdvisor led me to selecting this hotel. The front staff were very welcoming and very helpful during our stay. The first day we caught the bus in front of the hotel to Las Ramblas but trying to locate the stop to make the return journing was very difficult so we opted for the metro and this turned out to be just a few stops on the same line. The second day we spent on the beach which is just a few minutes walk away. There are also some excellent fish restaurants in the vicinity of Olympic Village. The room was somewhat small for three but it was very clean. The only thing that disappointed us was the breakfast; frankly, we thought it was pretty dreaful but overall a great experience.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“excellent hotel near port”", "Author": "Yvonnehiggins", "ReviewID": "UR82092937", "Content": "Great position. Very modern hotel, nice sized rooms. Huge bathroom. Outside pool with decking. Breakfast very good value includes spanish omlette and loads of other hot and cold foods including cheesecake and other cakes!!! Not always the hottest.... Taxi from airport approx 20mins costing 30 euros. Bus stop outside hotel and metro only 10min walk. Buy T10 ticket fro approx 8Euros allows 10 journeys on tube, bus or metro. 10min walk to the beach which is ok for near to a city swim. Excellent seafood restaurants at Port. 23euros for set menu includes wine and lobster!! Lots to see and do in barcelona, ramblas easy to get to on the bus (no14). Metro takes you to any of the famous tourist spots, gaudis familial garda, parc guell filled with gaudis sculptures etc", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“excellent stay, nice decor, location and staff”", "Author": "autumn007", "ReviewID": "UR81369012", "Content": "We were pleasantly surprised. The hotel was clean with modern decor. The staff friendly and helpful. The tour bus and regular buses stopped right out front and we could walk to the beach. The lobby nice and breakfast wonderful. I am quite picky and this was definitely great especially for the price.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Bad location...”", "Author": "mustang1047", "ReviewID": "UR81087142", "Content": "First a few good things about the hotel. The room was big and the hotel staff was great. They were really helpful with the metro, taxi's and restaurants. Here is the bad: it is a 10 minute walk to the metro, a 10 minute walk to Port Olympic and a 20-25 minute walk to town. There is nothing around the hotel. I mean NOTHING...The hotel itself was just okay. The lobby bar was bad and their \"nightclub\" was empty. If it rains your room will smell like rotten eggs for most of the night, they have NO wash cloths, they don't really clean your room (the never picked up any Coke cans or room service stuff from the room, and hot water for the shower was hit or miss, and the bed was very hard.. Also if you wanted a towel by the pool it cost you 3 Euros. Overall very dissappointed for the hotel. I would not stay there again. I would suggest staying closer to town. I was fooled by the \"it is only a ten minute walk\" it really stinks when you are walking in an empty part of town at midnight.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great hotel - everything you need for a city break”", "Author": "barnettrt85", "ReviewID": "UR78191678", "Content": "This is a fab hotel for those on a sightseeing break or families with kids looking for a beach holiday. We were able to purchase a T - 10 multi-use train/bus/metro/tram ticket and use it on the many buses that passed right past the hotel to the main tourist spots (La Ramblas, Parc Guell, Nou Camp stadium etc). The beach was only 5 minute walk max with lovely restaurants and bars along the seafront. Great for some food and drinks at night. The hotel itself was ideal with sleek interior, free internet in the lobby (15 minutes maximum in one go), great pool. Free safety deposit box in the rooms which was easy to use. The rooms were modern with flat screen TV, good shower, air con (although the air con was a little noisy to have on at night). The only downside was that we had to ask for more pillows but these were provided almost immediately. Staff were great - we showed them where we wanted to go and they advised us on how to get there quickly and cheaply, mainly using the bus - a 1/3 of the price of the 'Bus Touristic' (which also passed by the hotel if you wish). Breakfast was a buffet which had everything to suit all tastes. Great selection, only point which could be improved was that the milk for cereal was warm and the cooked breakfast bits were sometimes cold. On the whole though, great place to return to after a day in the hustle and bustle of Barcelona, you could relax by the pool after a manic day of sightseeing.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“What more could you want”", "Author": "3saf", "ReviewID": "UR78160533", "Content": "All staff very helpful. Close to seafront but not obviously so. Excellent rooms with good TV, including English services if wanted. Good breakfast but not very warm for the cooked range. Bed very comfortable. Lucky to be allocated a room with a terrace - no extra cost but an excellent bonus. Although METRO is some distance away - but not unacceptable - connections o all parts of Barcelona is easy. Would happily stay there again.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "co down", "Title": "“modern hotel close to beach”", "Author": "leahCoDown", "ReviewID": "UR77017118", "Content": "We stayed here for 2 nights to see Barcelona. Quite a good walk to center, but near to beach. Lovely modern bed rooms good size no tea or coffee facilities. Swimming pool nice and hot tub great to have a steam room and sauna. Breakfast was very nice a good choice of everything and freahly prepared. A great hotel.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poznan, Poland", "Title": "“superb hotel”", "Author": "dyszki", "ReviewID": "UR76666871", "Content": "Beatiful modern rooms equipped with everything You need. Nice location, close to subway.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Brilliant hotel can't wait for our next visit.”", "Author": "LeoEdinburgh", "ReviewID": "UR74412303", "Content": "This is our 5th visit to the beautiful city of Barcelona and we would not stay anywhere but the Hotel Icaria. The hotel is ideally positioned for a relaxing time stay only a short (10 mins.) bus ride from the centre. The hotel is bright and spacious. The bedrooms are a good size and the bathrooms have all the mod cons are bright and spotlessly clean. It's true breakfast can be busy busy but the our experience has shown that nothing is too much trouble for the lovely hard working staff. The breakfast included everything you could wish for representing very good value for money.Most days we did not bother with lunch as we were still full after b'fast. The hotel is spotlessly clean, well run and the only room for improvement might be in the area of the \"Vanity Room\" the cocktail lounge. It appears to be under utilised which is a shame because it is lovely. On this visit it was open twice, but once only to a small private party. The time we did use it the waiter was not at all helpful! He did not want to serve us and his opening remark was \"Here's the menu many of the items are not available\" Not the best welcome. We ordered a jug of Sangria at 20 euros but were told it was unavailable it was only after I caused a fuss and we threatened to walk out did the waiter suggest he could go to the other bar and order it but he could not guarantee they would serve it to us. I found this very strange and off putting particulary as we were his only customers for the whole hour we were there. Please be assured this did not in any way spoil our stay. I only mention this as I feel it is an area of the hotel that is under utilised and must be having a negative impact on the hotel's revenue? With a nicer staff this area could be a credit to the hotel. All in all you cannot go wrong in this lovely, friendly hotel: I would recommend it to everyone and we will back next year. Thank you to all the staff who helped make our visit an enjoyable experience and a special mention to the cleaning staff, who obviously take a great pride in their work.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "derby", "Title": "“We loved Icaria Barcelona”", "Author": "JanaDerby", "ReviewID": "UR71960658", "Content": "We went to Barcelona for the first time to celebrate our 10th year wedding anniversary. Icaria Hotel was a great choice. It is only 5 min from lovely beaches, 5 min from the shopping centre and a 25 min. walk by the sea to the centre of Barcelona. Staff, rooms, location, all was just right. The only minus, I would say, the drinks were not cheap and yes, the light system was not perfect. We did not eat in the hotel. Barcelona has too much to offer for a good day with a very tasty meal. We thank you to the hotel Icaria for a wonderful 5 days in Barcelona. Good luck and we hope to see you all very soon.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Convenient, Comfortable, Clean, &Quiet”", "Author": "MonicafromFriends", "ReviewID": "UR70460448", "Content": "The best thing about this hotel is the location. Just a short v. pleasant walk to the beach boardwalk where there are plenty of open air restaurants at the Olympic area and a great place to get away from the hustle and bustle of Las Ramblas. We toured the city in the daytime and were relieved to get back the the beach area and hotel in the evenings. We walked to the zoo from the hotel with a 6 yr old and it was no problem. The metro is a bit further walk in my humble opinion than some of the other reviewers had mentioned...but perhaps that is because we have a little one. Thank god we packed her scooter in a duffle bag-- we highly recommend this for families with children. We took it everywhere--the boardwalk, zoo, parks, even on the open air buses and I highly recommend this since there is usually alot of walking involved. The open air tour bus is just around the corner from the hotel and this is a good way to tour with children. The pool is small but at least there is one and it was a great way to wind down after a long day. Also, the sun beats down on the pool area pretty much all afternoon so many people were sunbathing. I tried out the \"gym\" once and never set foot in it again as it was much much nicer to run on the boardwalk every morning. There are only 2 treadmills and some weights I think, no cross trainers or any other equipment really. The buffet was much more than we had expected. There was a wide variety of fruit fresh sweet fruit, cold meats, hot meals, breads and muffins...pretty much anything you would want and we really filled up for our day. We left our windows cracked open at night as it felt a bit stuffy and ended up with v big mosquito bites. OUr daughter had huge welts on her face for weeks. The bathroom was spacious enough, we had no view to mention(just faced buildings) but we were on a lower floor, and the lighting system was a bit of a pain. Our daughter was asleep on one side of the room and we were unable to get just our bedside lights to stay on without lighting up the entire set of room lights---a real shame. V complicated and not efficient. Staff seemed ok but we did not deal with them very much. The computers are in the lobby but very much exposed so no privacy when writing emails. However, there is internet in every room w/out charge which is more than I can say for many hotels. It did take reception awhile to bring up extra toilet paper and blankets, but this didn't bother us much. Shower/bath could use updating but it was v clean and v good value for the we paid, esp. since it included the great buffet breakfast. We are very happy we did not stay near Las Ramblas as it was fun to visit but so much more relaxing at Icaria. BTW, best zoo we've ever been to(even better than san diego zoo, albeit smaller)--animals very alert and active, and grounds very lush and pretty.We truly enjoyed our stay. One tiny last thing, no cartoons on hotel tv in English so if your child likes a show in the morning, bring a dvd. ;) Enjoy your stay!", "Date": "July 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bath", "Title": "“Good hotel but food and some of the staff let it down.”", "Author": "cg26Bath", "ReviewID": "UR68820398", "Content": "Overall it was a good hotel in an excellent location. It is in effect a commercial hotel rather than a holiday hotel and for a 4* hotel was very reasonably priced. Our room was spacious, serviced extremely well, and was very well equiped (apart from not having tea and coffee making facilities which seemed odd for a 4* hotel). The air conditioning was brilliant, and although it was centrally controlled you just asked at reception for them to turn it up/down depending on your requirements. The location was excellent; it was in a quiet area, but the no 14 and 41 bus took you right into the Ramblas and stopped outside the hotel. The tourist bus which you could get on and off all day for €22 euros stopped just round the corner. The beach was 5 minutes walk away (up a slight hill) and there was a 'Tabac' shop just up the road that sold water papers etc. The main disadvantage was the breakfast and the kitchen staff. Although they had a brilliant choice of food they did not seem in a hurry to replace empty trays, if you asked for say a fried egg to go with your bacon you were told to come back in 5 minutes, and this happened a lot. The food was also lukewarm and not cooked very well. The dining room staff were lovely and helpful, but the kitchen staff couldn't care less. We got a deal where breakfast was included in the price, which is just as well because if we had to pay for it I would have asked from my money back. Presumably the dinners weren't great as most nights the dining room was empty and there were very few people on the terrace. Having said that I would go back again as long as I didnt have to pay for breakfast!", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fife, Scotland", "Title": "“Excellent hotel, very close to the beach with fab poolside restaurant”", "Author": "Travel-Diva-KD", "ReviewID": "UR65807820", "Content": "We stayed at this hotel for a week back in September 2007 (just catching up with reviews!) and had an amazing time. We were very happy with our room and the location of the hotel was excellent if you like the beach. We went to the beach once, the rest of the time we walked the ten minutes or so to the metro stop which takes you right into the centre of Barcelona. The bus tours stopped just around the corner from the hotel, so that was also handy. We did not have breakfast included so we only had the hotel breakfast once. The poolside restaurant was excellent, serving tapas dishes like scrambled eggs & asparagus and cheese & ham croquettes, and amazing cocktails. We discovered caipirinhas here and have never looked back. We spent most of our days sight-seeing in the morning then came back in the afternoon to relax by the pool. Unfortunately, there was some building work going on at the nextdoor building, which overlooked the pool area. It was sometimes noisy, but I was very impressed that the builders never once appeared to look down at the pool area and just got on with their work (unlike what might happen in the UK!) and I felt very comfortable under the circumstances. Hopefully, the building works are all finished with by now. Really loved Barcelona - lots to see and do, weather was fab and this is the perfect base from which to make the most out of it. We would happily return to this hotel.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maidenhead - UK", "Title": "“Good location but the attitude of the hotel staff let down the hotel”", "Author": "Adam_in_the_UK", "ReviewID": "UR65409756", "Content": "I was at a conference at this hotel and would recommend the hotel location, facilities and cleanliness for either a business trip or city break. However the hotel equipment was temperamental and the staff preferred to get on with any other tasks than help the guests, at least that was my experience. Do not try to check in before 2pm because you will not be able to!", "Date": "May 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Good business hotel, no character but handy for beach and city, very poor customer service.”", "Author": "AndK", "ReviewID": "UR65361901", "Content": "The hotel is very much a business oriented hotel and is very well located for the beach and city. Room facilities were good. The conference area smelled of sewage. The staff were very unhelpful and even rude at times. Unless you are getting an excellent deal and are not planning on spending much time at the hotel I think you could do much better elsewhere.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Awful Hotel”", "Author": "BobBestLondon", "ReviewID": "UR65095298", "Content": "OK -the rooms were ok but that was about it. The reception was incredibly slow - kept us waiting for thirty minutes only to tell us and other colleagues that the rooms would not be ready for another couple of hours once we got to the counter - could have saved us all time by just annoucing it to everyone. We were on a conference and the food served at lunch time was positively dangerous. One of my colleagues got raw chicken in the middle and the staff were disinterested in sorting out an alternative and could not care at all. Generally all meals on the conference were warm and not hot and this caused all of us concerns when eating. Then to cap it all on the last night, for no reason at all, the barman refused to serve us. if the owners of the hotel are reading this they should have words with him - he should not be in hospitality as he basically dislikes people. He was portuguese who spoke good english as he had lived in england for 8 years but on the night in question he seemed to be suffering from some sort of misplaced aggression to us - perhaps he was happier before we arrived when the bar was empty. Other than that the hotel is in a good location and the restaurants / bar close by were great. Barcelona is a great place", "Date": "May 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cornwall", "Title": "“Great start to our holiday.”", "Author": "llovetravelling", "ReviewID": "UR59686339", "Content": "Stayed here prior to cruise 2 nights with family ranging from 6yrs, teenagers and disabled Mum in Wheelchair. All rooms were spotlessly clean, modern and very comfortable. Bathrooms spacious, very clean and modern. As others on review sites have stated the lift system was a pain at first. Card in, let it register, then you can select your floor. Breakfast brilliant, great choice of everything hot and cold. Tried the restaurant at hotel they offered a la carte & 3 course with coffee 25 euro menu, that was good value and we really enjoyed the dinner. Across the road and a little way down the street there is an indoor mall. Inside various eateries, including a chinese buffet, Burger King, Mexican and others. The Mexican was good. Really nice pool area, small but adequate and enough shade if needed. Great spot 5 mins walk from the beach and promenade. We had a really happy stay and would return anytime. One downside, one of the rooms had a problem with the aircon and as it was August it was rather hot, we didn't complain as we thought it wouldn't be resolved before we left and the other two rooms were fine. Being too hot after always being cold in the UK is really a joy wouldn't you agree?? Buses stop regularly almost outside the hotel and 5 mins you are in the centre of Barcelona very cheap and easy, they even have a ramp that lowers to the pavement and was brilliant to be able to get my Mum on the bus without a problem. 10 mins by taxi to cruise port cost 25 euro as we hit traffic, thousands of others heading to port at Lunchtime. Tip cheaper to prebook with A2B Taxis,", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Resita", "Title": "“We spent our summer vacantion here and it was great!!!”", "Author": "Julya-Bella", "ReviewID": "UR58891604", "Content": "Great location, near the beach, this hotel is perfect for visiting Barcelona, and having fun at the beach! Breakfast very good. Free Wifi Free pool access", "Date": "March 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "", "Title": "“Find another Hotel”", "Author": "ChicaTexas_USA", "ReviewID": "UR58366843", "Content": "Recently stayed at the Icaria - we had reserved multiple non smoking rooms and upon arrival were told the only rooms available were smoking. The smell of smoke was so bad... Staff could not find one of the reservations and upon being shown a confirmation email simply shrugged! After a discussion another smoking room was available. This room was terrible - there was 1 towel no toilet paper and the shower water was cold. We thought we were just unlucky but upon speaking with other guests we learned they were having an equally bad experience. In fact they told us they did not have enough bedding in their room. The bar was closed during our entire stay for private parties and the hot tub was not hot! I will say the buffet breakfast was good with plenty of choice and the location of the hotel is great - not much around the hotel but easy walk into the city. Staff behind the desk were not great but the general staff were very good. However, I would not stay here again the rooms are just not good enough", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wales,UK", "Title": "“Good hotel, great location”", "Author": "SuecWales_UK Posted by an OctopusTravel traveler", "ReviewID": "UR57874943", "Content": "Nice rooms, lovely outside area and pool, enjoyed the buffet breakfast, plenty of choice. Staff at reception pleasant and helpful. 5 minute walk to beach and marina area, plenty of restaurants there. Buses stop right outside going into the centre of Barcelona, tourist bus round the corner - good value for money - worth doing we had 2 day pass and went on all 3 routes. Cash machine just down the road from hotel.", "Date": "March 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“lovely hotel great location”", "Author": "AdrienneC4", "ReviewID": "UR53161874", "Content": "close to the beach area and easy reach of city via public transport", "Date": "January 11, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Nice”", "Author": "HakanG2", "ReviewID": "UR51071942", "Content": "Nice hotel, close to the olympic port and the shopping center La Rambla and catalunya Plaza...Room was more than sufficent and the service was satisfying:)", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Newcastle", "Title": "“Excellent Hotel”", "Author": "stevemNewcastle", "ReviewID": "UR50361068", "Content": "The Icaria ,though about 10-15 minutes walking distance to the Ramblas, is well served by regular buses just across the road. The hotel is very clean with friendly and efficient staff and proves excellent value. We took breakfast in the dining room which was also very good. The hotel has a swimming pool and gym facilities also", "Date": "November 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Corona, California", "Title": "“A nice, new, clean hotel”", "Author": "NikolayT", "ReviewID": "UR50183492", "Content": "A nice, new, clean hotel a block from the beach. Being a bit away from all the Las Ramblas action wasn't that bad to have a peace and quiet. At night a short taxi ride would get you back home.", "Date": "November 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great hotel for a short break”", "Author": "AMTLondon", "ReviewID": "UR48423462", "Content": "We booked this through a package with British Airways and didn't know anythng about it. I was a bit worried when looking at some previous reviews but I found it to be an efficient, friendly hotel with all the facilities we needed. We liked the fact that it was nerar the beach, and particularly the restaurants and bars in the Olympic Port areawhich was only 5 minutes walk away. It was a quiet, safe area with a few local restaurants and bars, and a small shopping centre / cinema complex just up the road. We swere happy to walk everywhere during the day - it was about 40 minutes to Sagrada Familia, and about 30 minutes to the Rambla area. The room was a reasonable size with comfortable bed and nice furniture. The bathroom was a good size. There was a flat screen TV and wi fi access in the room. The safe was easy to operate and was big enough to take our laptop. There was a large buffet breakfast, ( which was included in our package price ) although it wasn't the highest quality. The coffee and juice weren't great but it was still extremely good value. The pool wasn't available ( it was nearly November ) but the outside area was pleasantly furnished with tables and chairs and would have been nice for my smoker husband if we had found it before we were getting ready to leave. We would be happy to go back for a couple of days but the location might be a bit boring for a longer stay. BUT BEWARE - BE VERY CAREFUL IN ANY LOCATION AS ROBBERIES ARE ENDEMIC! We were walking around near the seafront close to the Olympic Port and a young man broke away from his friends and tried to speak to us. When we didn't respond he started trying to make conversation about English football teams while trying to trip up my husband by doing some false football tackles. I would imagine if my husband had fallen over he would have helped him up and helped himself to his wallet. Fortunately he was able to swerve away with the help of some cigar smoke but it was very unnerving. Barcelona is great but always be careful and take the minimum out in your bag / wallet.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Sleek design, attractive & clean, but only convenient for Beach”", "Author": "missy176", "ReviewID": "UR47002005", "Content": "Beautiful hotel with ample buffet breakfast. The only drawback is it was not convenient to the metro to get out of the Olympic Village area and into the other parts of Barcelona. There was a bus line near the hotel, but the trip seemed a roundabout way to get to the center of the city. Hotel charged for pool towels and would fine you if you used a room towel.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Efficient Hotel”", "Author": "Alexander028", "ReviewID": "UR39202599", "Content": "Friendly and convenient hotel in a safe business area a few mins from beaches and restaurants. Clean and stylish. Very helpful well-trained staff. Massive help-yourself breakfasts. As a frequent business traveller - but this time with family - also noticed that it gets conference business and that's a competitive market. Free internet in lobby. Tips: note that you pay 3 Euro for a pool towel but you keep it for your stay. You must slot your key-card into lift buttoms to go up - but you must wait until door closes and is frustrating if you just arrive. Expensive mini-bar in room, but aren't they all. Shower controls in bath are hard to reach before you enter because the shower enclosure is fixed. Very expensive drinks in restaurant. Menu is international but the cooking is good. Not at all processed. Not very Spanish so also try \"Mango\" on the beach. There's a family Italian five mins to the right called La Vela, opposite a shopping centre and Consume supermarket. I would stay again.", "Date": "August 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "london", "Title": "“Excellent”", "Author": "ddmLondon", "ReviewID": "UR38881773", "Content": "Spent five nights at this hotel recently and can find very little to criticize. Bed was very comfortable. room smallish, but adequate, bathroom palatial. The staff were extremely helpful and the ambience of the hotel was very pleasant. The hotel is very near the beach and a short bus ride from the main town. Very happy with this hotel.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newcastle upon tyne", "Title": "“Great place to stay pre cruise/city break”", "Author": "h0lidaymad", "ReviewID": "UR36129183", "Content": "This is a very nice hotel. Close to the beach and close enough to walk/bus to city centre. It has a swimming pool and a very nice area in which to relax with a drink after a days sight seeing. Very handy for the hop on hop off open top bus which is a great way to sight see. Rooms are very comfortable and a good size. Highly recommended!", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "driffield", "Title": "“Comfortable clean and convenient location, good value at discounted rate”", "Author": "donnyman", "ReviewID": "UR36126069", "Content": "The staff all spoke good english and gave sound advice. Service was good. The room was kept clean. Spent 8 nts there. The location on Icaria ave. is about 20 mins from the 1st stop in the Ramblas with a regular 10 min. bus service. The seafront restuarant area is some 10 mins walk away with plenty of choice and price. The hotel pool area is small and only gets the sun at certain times being enclosed by the hotel. The tce. below he pool is pleasant to sit in with drinks and snacks available. Breakfast buffet is OK but not great. Had my pocket picked while walking on promenade 1st night, my own fault was aware of problem as stated in guide books, he only took cash and threw wallet back when I chased after him. On last day walked away from 2 men on Icaria ave. who were trying plant and policeman scam, the supposed policeman didnt try and stop me and my wife leaving.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Edinburgh", "Title": "“First Class Hotel in the Port area of Barcelona”", "Author": "LeoEdinburgh", "ReviewID": "UR35810121", "Content": "This is the 4th time we have stayed at this hotel and it only gets better. Not in the centre of town, not trying to be anything it isn't. This hotel and it's staff are great. It's about a 40 min walk to the Rmablas or 10 min on the no 14 bus. Buses run every 10 min and stop right outside the hotel. This hotel is a gem of a find, has everything you need for a trip to Barcelona and you will discover the Port area too. Hotel spotless, reasonably priced and the breakfasts are amazing and included in the cost if you book 30 days in advance. My thanks to the staff for all their hard work and we'll be back next year.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sligo", "Title": "“Very Good Hotel”", "Author": "Cotard", "ReviewID": "UR35732093", "Content": "I stayed here for a week in June with a friend, and the Hotel Icaria was the perfect choice. It's out of the way enough to be a quiet, peaceful and relaxing place, while also being very accessible to the city centre by public transport, or even by foot. As an avid walker, I'd easily walk into the city centre from the hotel most days, but it would probably take about 20 minutes I guess. There is a Metro stop just a few blocks from the hotel, however, and I believe there is a bus-stop even closer, though I never took the bus. I must say that the public transport, particularly the Metro, is superb in Barcelona and gets you to pretty much anywhere within a few minutes. The hotel is also quite close to a number of beaches, and the Port Olympic village. We didn't have breakfast or eat in the restaurant so can't comment on that, but we did order in room-service a couple of times and it was grand. Arrived pretty late at night to the hotel but check-in was very quick and room was ready, as booked. The room was kept very clean throughout the duration of our stay. The front-desk staff were multi-lingual, and spoke English to us. We didn't make many requests of the staff but any interaction we did have with them we found them to be friendly and helpful. I found the bed to be very comfortable, and air-conditioning was unobtrusive and just right (ie, not too noisy or too cold). The room was spacious enough and the bathroom was quite fancy. There was free Wi-Fi in the room which was very handy. The room was good overall. This is the perfect choice of hotel for those who want to explore Barcelona but might want to avoid staying in the nightlife hub of the city. It's a peaceful area, and I thoroughly enjoyed my stay at the Icaria. - Cotard", "Date": "July 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sweden", "Title": "“Very disapointed”", "Author": "VavaBaguette", "ReviewID": "UR33724074", "Content": "Hotel Icaria is an ok hotel though the staff of the hotel was very unhelpful. Me and my boyfriend stayed at Icaria for two weeks and after a few days one of my dresses was missing from our room. I contacted the staff about it and they did nothing to help me. All they said was 'come back tomorrow' over and over again. I even spoke to the manager himself who was very unpleasant and did nothing to help me. The day before our checkout I told them I could not wait any longer since we were going home the day after but all they said was that they couldnt do anything to help me. No help from them whatsoever. Very disaponting. I know it was just a dress, but when Im staying at a hotel I want to be able to leave my stuff in the room without anyone taking it. Anyway over all the hotel was ok. Nice breakfast. Rooms are ok. I would not rate this hotel as a 4-star though. It is more like a 3-star.", "Date": "July 2, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "london", "Title": "“shoddy icaria”", "Author": "miana01", "ReviewID": "UR33376531", "Content": "Disapponting after staying there for 2 nights. Appalling services we received. Lying on the sun loungers tried ordering drinks you would not get hold of any staff within 20meters. They say you can only drink at the terrace when some sipping their jugs of cocktails beside the pool. They do have a jaccuzzi but I'd call it a very cold children's padding pool, mini bar not fully stocked up, no shower gel unless requested, no dressing gowns, no slippers, and don't expect a hot cup of tea there are no tea bags in the room.. Would definitely not call it a 4 star hotel", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "SE England", "Title": "“Would recommend!”", "Author": "MrsSS01", "ReviewID": "UR31879060", "Content": "very helpful staff - made a restaurant reservation for us (try Los caracoles just off the Ramblas!), good size, clean rooms, great pool, breakfast served till 11am which was lovely. Good security too - you cant go up in the lift without a key card. No traffic noise at night Not far from bus stop (staff very helpful with tourist info)", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Lovely hotel- not a great location though!”", "Author": "KP58", "ReviewID": "UR31326966", "Content": "Stayed here for 3 nights on business and then over the weekend as my husband joined me. The hotel is fabulous- extremely helpful reception staff, spacious rooms, good breakfast which is served till 11am but it's just not where you want to be to explore beautiful Barcelona. The closest metro is a 15-minute walk away - there's a bus stop round the corner though but the routes weren't straightforward to figure out and only took you to Plaza Catalunya. Its location makes it limited to choosing where to eat as there's no where decent closeby. Having said that it was a great chance to walk to Barcelonetta (25 minute walk) along the beach- don't think we'd have gone there if were were closer to the centre. This hotel would be perfect if the metro was a bit closer!", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast", "Title": "“Brilliant Hotel... Could Not Fault It!”", "Author": "TravelAgentReview", "ReviewID": "UR29461750", "Content": "Stayed in this hotel for one night on 29th April for a pre-cruise stay in Barcelona. Me and my friend have never been to Barcelona before and we got a brilliant deal on this hotel so thought how bad could it be? It was actually a brilliant hotel. Reception staff were lovely, calling a taxi for you when you needed one and check in was a breeze. Room was lovely, very modern complete with plasma tv (although no English channels) and very clean. Safe in room was easy to work and there is an ice machine on every floor so u can fill your ice bucket in your room up without having to call someone. It was a scorching day when we arrived so we went out to sunbathe, pool deck is gorgeous, all wood with sunbeds and a few umbrellas. Lovely pool and jacuzzi. Small gym and spa for whoever wants it. Lovely outdoor patio area with sofas to chill out and some tables and chairs where u can eat your lunch outside. We did eat lunch in the hotel, not a lot on the menu but enough for a light snack. Drinks were quite expensive but thats the case in hotels everywhere. A little bit out of the centre but only approx 7 euros from Catalunya square. We got the bus from the airport to Catalunya square which was 4,25 euro each way. Catalunya square is at the top of La Rambla so its handy being central to it. I work as a travel agent and I was very impressed with this hotel. If ur maybe staying for a longer duration then maybe something a bit more central but this hotel is perfect as its not to close to everything (we met another couple who had paid a lot of money to stay on La Rambla but they moved to the Icaria after they had a sleepless night due to the noise) I would def recommend this hotel to anyone who is considering a night or two in Barcelona.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bucharest", "Title": "“Very good Hotel”", "Author": "Casian", "ReviewID": "UR29429975", "Content": "No problem at all. Very pleasant hotel, near by public transportation stations, good staff, good breakfast, nice and clean area. I would reccomend it to anyone that wants to have a good holiday in Barcelona. For us the quality of the hotel contributed a lot to the very good impression that he have left with. Congratulations !", "Date": "May 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Italy", "Title": "“Good position, good hotel. Not so good fitness/spa area”", "Author": "leo_ant", "ReviewID": "UR28610005", "Content": "The hotel was exactly what we expected. Nice position far from noise and crowd, close to see shore. Not too far from Metro stop (600 m. routhly), but 3 buses stop in front of the hotel, each with daily schedule every 10-15 minutes. Staff spoke good English. The only remark is about fitness and souna, which is outside for access, cold for undressing (no heating in a common space), and both sauna and turkish bath were just warm when working, so really unusably at all. So, dont' choose this hotel for the relaxation/spa, but for the rest it is ok.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Andorra", "Title": "“cold rooms and cold staff”", "Author": "djstu77", "ReviewID": "UR26931004", "Content": "Stayed one night in march. Check in was quick and the rooms seemed nice. Even tho it was hot outside it soon became clear that our room was not. The room was freezing cold and it didnt help that I had a bad cold. I asked the reception about any heating and explained my sitiuation and was met with a NO, that was it. The only way to get warm was to have a shower but that just created a lake on the floor and with no fan there was a very damp smell. Friends in another room had a kettle and tea making items but we had none. There was also the previous guests comment card which echoed what I have said about the room. The location was good for the port and the beach but that ws it. I would not stay here again.", "Date": "March 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Lovely Hotel, Clean, Friendly Staff just a tad out of the way”", "Author": "bexxxx", "ReviewID": "UR26403104", "Content": "We stayed at the Hotel Icaria for a week in March 2009 and found it a lovely hotel. The staff are very friendly and helpful and the rooms spacious, clean and modern. The location is about a ten minute walk from the beach and has shops and bars about a 1 minute walk away. The restraunts and bars in the area are extremely expensive, the cheapest places closting upwards of $30 each per meal exc drinks which are around 4 - 5 euros and higher for a lager/beer. The hotel bar seemed cheaper and that seemed expensive until we ventured out. Id advise if you arent taking anything out of the mini bar to have them empty it as things went missing out of ours, although we told the staff and they didnt ask for payment of the items so i assume they are aware the cleaners must have a dabble. To get there from the airport, take the blue bus outside the airport arrivals to the centre of catalunya then a furthur bus i think it was the 42 which drops you directly outside the hotel. A taxi from the Ramblas costs around 1 euros to and from the hotel. I stress when walking around the Ramblas do NOT walk down the alleys at night, we di having heard about pick pockets and just thought we'd be careful but its organised gangs of in excess of 20 men following you trying to get you alone to rob you....very very scary. The area of the hotel however is in a nice quiet place and feels very safe walking around at night. Overall a great experiance and if we ever went back to Barcelona wouldnt hesitate to stay there. For good deals go to booking.com", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rijeka", "Title": "“Great value, quiet place”", "Author": "sanjinv", "ReviewID": "UR23318609", "Content": "The stay was great, I can only cite user adt52's comment: \"The Hotel Icaria is a fantastic place. The staff were very friendly and helpful and the breakfast which was included in our cost was second to none.\" The room was nice and clean, very comfortable - though some might be a little annoyed by the technology (hint: the key-cards). Location is quiet, near to the beach and Port Olimpic, bus stops for lines 14 & 41 that take you to the centre (Monument Colom, Placa Catalunya...) and 92 (to the Park Guell)are in front of the hotel, and a shopping mall is some 100 m away. Taxis are all around and relatively cheap, metro works really great. From the airport (besides a taxi of course) you can take the \"Aerobus\" to the Placa Catalunya (4 EUR per person) and from there bus 41 across the street (or 14 that stops in famous La Rambla some 100 m further), but the Renfe train line from the airport to Estacio de Franca would be the best solution as you can use a single ticket for the ride (unfortunately, at the time of our visit this line was not accesible). Check the Bus turistic lines as they seem a good option (not personally tested), one of the lines stops near hotel - othervise take advantage of the cheap T-10 bus/metro/Renfe/tram ticket. And of course, prepare yourself by searching the 'Net for all the info you can absorb before you embark! :-)", "Date": "January 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucks", "Title": "“Worth a Visit”", "Author": "adt52", "ReviewID": "UR21664240", "Content": "Just returned from a visit to Barcelona. Not sure that the last week in October was a good time to visit Spain and get good weather, however we were not disappointed 4 beautifully warm and cloudless days out of 7 wasn't bad. The Hotel Icaria is a fantastic place. The staff were very friendly and helpful and the breakfast which was included in our cost was second to none. Full English or Continental and as much as you wanted. Our room was a triple and was well appointed although the air conditioning seemed to have a mind of it's own. Having wireless internet in the room was also an advantage. The hotel was spotlessly clean and although there were conferences taking place in the hotel while we were there, the relaxing atmosphere within the public areas of the hotel for non conference guests was not disturbed. It was a shame that I wasn't able to speak to the hotel Manager to offer my compliments before we left to return home.", "Date": "November 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Quiet locaton, close to the beach...”", "Author": "Indiragold", "ReviewID": "UR21190443", "Content": "We had a 4 night stay at this hotel which was overall ok. I realized this was more to do with the fact that we didn't have to encounter the staff who seemed to want to help but a bit confused when a problem was raised by another guest. We had one minor problem, I say minor because we left the next day but our bathroom ceiling all of a sudden started dripping water quite fast, I called the reception who assured me they were sending someone but never did, we mopped up the water with towels. The leak stopped, I assume because the person above finished their shower and we left the next day. The lifts are a bit of an experience. You have to put your room card in the slot to go up - not down, but they fail to tell you this. My cards kept getting demagnetised for some reason over the course of our stay and I repeatedly traveled up and down in the lifts until fellow guests saved me. Amusing at first but very tedious after my tenth trip... Some other guests had problems with their room bookings in not receiving what they had requested, they seemed to have alot of hassle trying to find the right person to sort it out and were waiting in the pool area for a good few hours. The room was quite small I found for a 4 star, but it was clean and the bathroom with it's green marble is pleasant. There's no balcony however, a problem if you smoke and want a glass of wine in your room, but the lounge area to the left of the pool is lovely. Simple, but very comfortable, with deep, wooden sofas and if you're there early, you can loiter there the whole day ordering light snacks and drinks. I loved breakfast and am not sure why previous guests have been disappointed. There's a huge spread, something for everyone I thought and they even provided Soya milk much to the delight of my friend! The hotel is a short trot from the beach. It's in a quiet location and is easily accessible by bus. We tried to take a bus from the airport when we arrived but there was major confusion when we got to Catalunya bus depot. The tourist information queue snakes round and you'll be in it for half an hour at least. Many places were closed for 'the holidays' , which annoyed me as it's a holiday destination. By all means take your vacation, but staff your shops in the meantime! La Ramblas is a very busy street with stalls and entertainers as you see in Covent Garden. Watch your bag/wallet, there's alot of silver/ethnic/gothic/I made it myself jewelry and fridge magnets on sale on nearly every stall which is great, if you like that sort of thing - I don't. If you want nightlife, then this is not necessarily a good place to stay. The buses stop running after 10.30pm I think and the local bars/clubs are uneventful. It's also quite lonely walking back from the beach bars area to the hotel so take care... Go and see the Gaudi architecture, but go early otherwise you'll be standing in Madame Tussuad's queues, uncomfortable in the August heat! Note that if your speak a little Spanish, in this region the Catalan dialect is spoken! This hotel is fine for a short break but if i go again then I'll stay somewhere more central...", "Date": "October 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "belfast", "Title": "“Loved Barcelona”", "Author": "mello10", "ReviewID": "UR20586894", "Content": "just returned from a 4 day stay at the 4 star ICARIA hotel in barcelona and a really great time we had. the hotel was on a quiet and safer part of barcelona yet 5min walk and you where on the beach. also near port olympia with its bars and restaurants these i would not recommend but if you enjoy tapas and piella you will love it the hotel was spotless rooms cleaned every day the staff where nice and helpfull breakfast good out side the hotel doors their is a bus stop number 41 every 10 min and this takes you into the heart of the old gothic quater and las rambles the shops are amazing also port vell marina where you will find a irish pub with great food at very good prices any one going to barcelona i would recommend ths hotel for having the quietness and also the confience of the shops. If you have shoped to you drop then get a taxi their is plenty of them for the price of 4euro 50 enjoy", "Date": "October 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“not great......”", "Author": "LondonLisa_C", "ReviewID": "UR20198658", "Content": "We picked the hotel as we wanted to be near the beach but not too far away from the centre of things as we were staying for 5 nights. The location was fine, the beach and port (with all it's bars and restaurants) just a 5 minute walk away, but other than that the hotel was really isolated - but at least it was quiet at night. Check in was short and sweet, but they forget to tell everyone that you need to use your hotel key card in the lift or you won't be going anywhere..... luckily some other guests helped us out. The room was ok, but the bathroom door didn't shut, it took a few hours and phone calls to resolve but as the hotel was full and we couldn't change rooms, they did send someone to fix it pretty quickly. We had to go down and spend a couple of hours by the crowded pool area while we waited (it's VERY small, even smaller than the pictures on the websites so don't expect to get a sun lounger). Otherwise the room was ok & fittings new, just don't look too closely and so you don't notice the bathroom ceiling had a damp patch and the bedside cabinet tops weren't properly clean.... they do provide tea and coffee, but no milk and the plastic tea spoons disappeared after day 1.... be prepared to bring your own!! On the 3rd day there was a problem with a burst pipe so we had no water for a day - we called to complain and reception explained no one had water (hadn't had it all day, not that they bothered to tell anyone) and then brought us one 1litre bottle of mineral water to wash with (between the two of us). When the water came back on it was slightly yellow, so we decided not to use it. Breakfast was very mediocre (hot food limited and cold) - ok I think pretty atrocious for a 4 star hotel (coffee tasted like watery instant, and only herbal tea as an alternative) - & the rest was disappointing, suggest you head to the local shops or the port for a much better option (and cheaper!) So, to the main complaint, after day 1 we decided to cancel breakfast which we had pre-booked for one of us - and were told by an incredibly rude man at reception (he kept answering the phone without a single apology while talking to us), who told us we couldn't, it was included in the price (no it wasn't) and only when we got annoyed would he check our reservation and realise that we had ordered the breakfast separately and yes it could be cancelled. Reception in general were rude and unhelpful, not interested in helping or providing good service. We asked about the theatre tickets (as per the leaflet in reception) and they told us to go to the theatre ourselves and buy tickets..... the one notable exception was the very nice lady who helped us check out very quickly and ordered a taxi as our flight had changed, she was quick and efficient. The hotel is just about ok, although I think VERY expensive for what you get, I think you are better off paying a bit more for the hotels nearer the port/town - they are also that bit nearer to things as it's about 30 min walk to the old town from the hotel icaria -or picking something more reasonably priced nearer town - the public transport system is fantastic & cheap (don't go on the tourist bus, get on the metro/use taxis - it actually worked out much cheaper and far more flexible) Barcelona however is fantastic, worth the trip, but probably you should pick another hotel.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Good Location”", "Author": "uktravelller", "ReviewID": "UR20037310", "Content": "The staff on reception were helpful and polite, room was modern and clean, our room had a view of the pool and terrace, and a view of the city. Bar area was nice and relaxing on the terrace plenty of seats. Breakfast had a varied choice, but not so lucky the second morning, no cooked food, one of the coffee machines did'nt work and the othe one had run out of hot water. You also have to time going to breakfast at the right time, the hotel was full when we stayed, which meant that at one point there were no tables available, maybe we were just unlucky that day. Location of the hotel is good, its a 10 min walk to the nearest metro, and about the same time to the beach/marina area. In all had a good stay, would go back to the hotel and recommend it.", "Date": "September 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Positive overall”", "Author": "GMACz", "ReviewID": "UR19410797", "Content": "We stayed at the Icaria for a week in mid August, a family of five. On the positive, check in was fine & we found the staff generally friendly & helpful. Rooms were roomy & modern, a feature of the whole hotel & everything was generally clean. Breakfast was fine although cooked items tended to be cold. Other food provided was mostly good. The terrace area & pool were excellent & service quite good. There's a nice hot tub next to the smallish pool & constant steam room & sauna in the back areas. Location was good if you want to be near the beach & there's a decent choice of restaurants all within 10 mins walk. Taxis are cheap & only 6/7 Euros into town. Internet access was very good. On the downside, no porter, you have to lug your own stuff around which was a pain. Coffe/tea making facilities were advertised but no tea/coffee provided & requests met with blank expressions. Luggage is stored in an area next to reception - not particularly safe & I noticed this was the same with all guests luggage. Major hassle was the keycard system, room cards were needed for the lift & along with almost every guest I spoke to it worked only half the time sending us all over the place. Health & safety check is required on the fire escape/stair doors, floors 1 & 2 were sticking & would be dangerous in an emergency. All the family enjoyed the stay & we'd probably use the Icaria again.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "blackpool, england", "Title": "“Very nice”", "Author": "joanna_c_c", "ReviewID": "UR19154512", "Content": "Just returned from a weeks stay at the icaria. Loved the hyotel...modern, clean, well priced and good facilities. Have read some of the other reviewers comments and do not agree that staff are rude... i did overhear a few grumpy guests at the front desk but I would say the way they were treating the hotel staff was rude and obnoxious (in english) rather than the other way round. Either way we had no problems and found them to be helpful with any of our queries. Rooms good size, cleaned daily, and coffee etc replenished. We went for a beach relaxing holiday so it was ideal as literally a 5min walk to icaria beach. Metro stop is a 10 min walk. Very nice breakfast - all continually re stocked throughout the breakfast time slot. Pool area small but perfectly formed! Would choose this hotel again if we revisit barcelona.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Good hotel”", "Author": "CarolinaJuez", "ReviewID": "UR18343174", "Content": "Very good hotel. Near a nice beach. The turistic bus, stops 2 blocks from the hotel and the subway is 5 blocks away. Nice and clean rooms. Quite neighborhood.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Houston, TX", "Title": "“Not quite what I was expecting”", "Author": "1_to_travel_on", "ReviewID": "UR16391594", "Content": "It was fine for a one night stay before our cruise, but I can't bring myself to say it was above average. A quick rundown: Check in went smoothly and we were able to get our room around 1:00. The front desk staff somewhat answered our questions, but weren't overly helpful. It was a brisk 15-20 minute walk to the Metro, but the bus stop is fairly close. There were 4 of us, so we got the metro multi pass and shared it for our one day which worked out great. Breakfast was fine, but not $25 worth. Could not sleep because the room was so warm. The a/c was making a noise, but nothing cool was coming out. Unfortunately, it was raining, so we were not able to open the window for fresh air either. We asked the hotel to hold our luggage after we checked out. They have a locked room, but because they were busy, we were told to set it aside in the lobby and they would get to it when they had a chance. When we returned several hours later, I was disappointed to see it still sitting in the lobby were we left it. We saw notes that this was an up and coming neighborhood, not sure about that, it was quiet though and a good location for our port departure the next day. On that note, definitly watch out for the cab drivers. We were told by the hotel that the ride would be 20-25 euro, the cab meter said 18 when we arrived at the terminal, then he did some magic and suddenly it was 30 euro. We questioned him and he said it was because of our luggage. Not in the mood to argue, we paid it, but I wish we had been more firm. Heck, we were already where we wanted to be so what could he really do if we had refused to pay that amount.", "Date": "May 25, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Milan, Italy", "Title": "“Just about ok”", "Author": "ElaineCat", "ReviewID": "UR15818652", "Content": "Stayed at the Icaria during the F1 of Barcelona. I would say that the hotel was just about ok. I checked in on Friday afternoon, stayed at the pool for about 2 hours (you have to pay extra for pool towels) not on for a 4 star hotel, especially when you see all other guests with room towels. Anyway the cost of the room was €290 a night (corporate rate) in the three nights we stayed the sheets were never changed, no soap was put into the rooms, had to call housekeeping. Worse the rooms were done utill 17.00pm in the faternoon so if you do want to go back to the room for a while impossible. Having said this breakfast was ok even if we did have to pay €16 extra ahead.... Not close to the city ctr need Taxi, but very close to Barcelonetta, which, for who knows the area is good for going out in the evening.", "Date": "May 8, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rugby", "Title": "“Quiet rooms at the back!”", "Author": "Travelling_Light65", "ReviewID": "UR15074318", "Content": "This is a very modern hotel with clean minimalistic rooms. Good firm beds, laminate floors, clean dark green marble bathrooms and the best power shower I have experienced! On arrival we were offered a suite at the front of the building but after one night found it too noisy from the traffic on Avinguda d'Icaria and so asked for a quieter room. We were given a room, albeit smaller at the back of the hotel overlooking the swimming pool. 6th flloor and great view of Montjuic in the distance and a building site in the foreground but the room was lovely and quiet and so a small sacrifice to pay. If you are going to stay in April then note there is no air conditioning until May. We found it slightly stuffy as a result. I read on the Venere web site that this hotel is two minutes from the metro. Beware, it is not! The nearest stop is Ciutadella Vila Olimpica and it takes a good 15 minutes to walk to. However there is a bus stop outside the hotel and No 14 goes up La Rambla while No 41 goes a more direct route to Placa de Catalunya. Get the 10 trip card, valid on the bus and the Metro - good value as it will save you money on individual tickets and so much more convenient. Hope this helps with your hotel selection in Barcelona. Enjoy your trip.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Warwickshire", "Title": "“Second visit!”", "Author": "MarkA74", "ReviewID": "UR14774842", "Content": "We stayed at the Hotel Icaria in June of 2007. It was the second time I had stayed there (the first was a business trip in 2006), but the first time that I had taken my partner there. The staff are very friendly & even though I tried my (admittedly ropey) Spanish upon arrival, they immediately replied in excellent English! The rooms were excellently presented and my partner was very impressed with the overall quality of the hotel. Hotel Icaria is five minutes walk from a \"crossover point\" for the \"Barcelona Bus Turistic\" (the red / blue / yellow open topped hop-on / hop-off sight seeing buses), basically you walk out of the reception and go left (towards the car wash at the end of the road) and then turn right (the stop is across the road). You can buy a two day ticket on board the bus for 24 euros and we used this service to get around the whole of Barcelona during our stay. It's excellent value! As for the hotel's other amenities, the bar & restaurent are very good (although not that cheap) and the pool is fine (although being so close to the Olympic Marina & beach we didn't actually use the pool.) I would recommend this hotel unreservedly, it is great value for money, it's close to the beach and marina, has good public transport links and the rooms are excellent. Our flight wasn't until after 22:00, but we were able to leave our cases in a secure room behind reception whilst we went off having a final days exploring before heading back to pick up the cases and get a taxi to the airport with no problems at all. One tip I would give, don't take a taxi from the airport, get the blue bus from outside arrivals which goes to Placa de Catalunya, then pick up the Barcelona Bus Turistic on the Blue Line & then it drops you off minutes walk from the front door of the hotel! I'm looking forward to going back again!", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Uk", "Title": "“It's simply all you could ask for”", "Author": "dd123Uk", "ReviewID": "UR14156857", "Content": "I promised Marc Camps (The Manager) of the hotel I would write a review on Trip Advisor, and here I am. Im generally easily pleased anyway, but can say almost with complete certainty that you will not regret booking at this hotel. Yes it's in a quiet not in the heart of it location & a 30 min walk to The Ramblas (Dont know what the big deal is about this strip personally, sure it's worth a look but it's just the tourist \"Oxford street \" of Barcelona!) There is so much to see & things to do & sample that you might wish to venture further away from this area & enjoy some Tapas for 7 Euro in a bar full of locals, there are many! Travel is easy with the T10 ticket that has been mentioned gets you back to the airport too-Its really worthwhile for about £5 Anyway, for a balanced view the hotel has a slight business feel to it, not that I mind that.But for those that want a \"local run\" hotel may want to bear this in mind. I had a suite by the way, but I am sure the standard rooms are just a smaller version anyway. Book it- you cannot fail to appreciate this hotel does exactly what a modern hotel should. Darren", "Date": "March 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“Good value - pool, on bus tour routes, on outskirts”", "Author": "gillygeegee", "ReviewID": "UR13158501", "Content": "This is a good, clean, quite, hotel with a pool and good sized rooms (our room had a massive bathroom which was about the same size as the room space). Flat screen TV in room with reasonable channel selection. Internet access in the lobby. It is about 2kms from Sagrada Familia (which we could see lit up at night from our upper floor room, overlooking the pool) and La Rambla so about a 20 to 30 minute walk depending on your pace. It is less than 5 minutes from the beach which, when we visited in April was quiet. The hotel is located in a residential area so there are not a lot of facilities for the tourist nearby in terms of restaurants, although there appeared to be lots of cafes and sandwich shops around for day time use. There is also a small shopping centre nearby (a block away) where there is a supermarket to buy supplies. The hotel is also situated very close to the cross section between two of three hop and hop off open top open top bus top tours (with one of the companies) which is useful if you like that kind of thing. We did eat in the hotel restaurant which was fine and good, if standard grub. The buffet breakfast was good, varied and plentiful. Overall, although the location means you do have a reasonable walk to many things it is peaceful and of good quality.", "Date": "January 31, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NEWCASTLE", "Title": "“Our Stay At The Icaria-”", "Author": "LINDIE3", "ReviewID": "UR11300357", "Content": "My husband and I stayed at the Icaria for 4 nights at the beginning of November and had a wonderful time there. It is quite a distance from La Rambla and many of the restaurants but everywhere is easily accessible once you find your bearings. We have no complaints about the hotel but I would suggest trying to include breakfast in the price when booking as it is very expensive if you don,t want a big breakfast. Overall Barcelona is a wonderful place and I would definitely go again as there isn't enough time to see every thing. The taxi from airport cost us 28 euros going and 25 going back, so I think everyone must get charged different prices. I would probably use public transport if we go again now that we have been. couple from Newcastle", "Date": "December 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Morecambe", "Title": "“Elegant, clean and spacious”", "Author": "Michnield", "ReviewID": "UR10236316", "Content": "My husband and I visited Barcelona and booked the Icaria through Hotel Connexions. I was worried that it would be a bit 'out of the way' but as we like to use public transport, we found the hotel after a 15 minute train journey to Passeig de Gracia with a change to the yellow metro line taking us the 4 stops to Ciutadella Vila Olimpica. It was still a 10 minute walk from there but once we found the hotel, we felt comfortable with our choice! Although we were quite early, we were offered a twin room which was ready or the keys to view it to help us decide, or we could wait for the double room we had booked. The receptionist rightly said that the twins were slightly larger and we were glad that we decided to take the twin room. We never had to queue for the reception as there was always plenty of staff on duty, especially booking out time! Food is available all day with some options available all night as well. Breakfast was included in our room rate which we were glad about because quite a few people seemed surprised at breakfast that breakfast wasn't included in their rate and it was an extra 15 Euros each. You can eat 'bar snack' type meals which are reasonable or opt for the restaurant meals. Breakfast was ok for a Spanish hotel with plenty of fresh fruit and pastries, not much choice of cereal and no chance of a decent cup of tea!!! We enjoyed our stay, found the staff very helpful and able to speak good English, comfy beds, good bathrooms....we would love to go there again!", "Date": "October 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "birmingham,uk", "Title": "“still good”", "Author": "elestoban", "ReviewID": "UR10024709", "Content": "have previously reviewed this hotel - this time i took a group of 16 guys & they were all very pleased. met a group of 8 women who also seemed very pleased with the amenities. large twin rooms work well for sharing. nice spacious bathrooms - be careful with shower - has mind of its own! there is no question that the outside seating areas work really well for groups. service is friendly & quick although sorting out who ordered what / when can be a bit chaotic therefore best to pay or sighn as u go. breakfast is still good but a bit of a bun fight - it goes until 11.00 but they start clearing away at 11.00 on the dot. one big recomend was the restaurant El Asador de aranda at Tibidabo - about 12 euros by taxi - great for group in private room or just dinner for 2 nb meat eaters only !", "Date": "October 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Close to the beach!”", "Author": "14traveling", "ReviewID": "UR10012774", "Content": "This was a great place to stay! Everyone was friendly, it was very modern, the room was very large even by American standards, the beds were comfy, and they do have a great breakfast but it is expensive. The front desk staff was very kind. My husband had a work emergency and his cell had died, the front desk let him make a call overseas for free. The pool area was great and it was only 2 blocks from the beach! I was a little scared to stay there because of some of the reviews but we cancelled our other hotel reservations to stay there because we liked it so much. The bus is right out front and it takes you right to the metro. I would recommend this hotel to anyone!", "Date": "September 27, 2007"}, {"Ratings": {"Service": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Just as expected”", "Author": "carlw1968", "ReviewID": "UR8509047", "Content": "On arrival parked the hire car in the underground garage, just press the buzzer and reception will let you in. There is a lift to all floors and reception is located on the PB, don't know what it stands for. Room was ok and everything worked as it should, asked for extra pillows, delivered within 30 minutes. Not a lot of room by the pool and sun loungers are few but free to use, hotel will provide towels at 3 euro's each for use by the pool, do not take towels from the rooms. Breakfast was the only disappointment as the staff seemed unable to keep up with either food, plates, cups or coffee, there always seemed to be something missing even though we tried early (9 am) and later (10:40 am) times to see if it made any change.....it didn't. TV in the room is limited to 1 news channel in English (CNN) but most programs are in Spanish or the local Catalan dialect. We didn't stay to watch tv anyway! Hotel is located in the Olimpic Port area and is on 2 tourist bus routes so easy to get in to town as the Blue route stops in the central Square at the top end of La rambla where all the action is. Overall? ok but don't bother with the breakfast at 14 euros a go it is better to check out the cafe's locally or miss it and have a early lunch. hope this helps in your choice, we would go again?, yes because it is in a good location and is clean, staff a bit so so but this seems to be the norm for most hotels here, Enjoy", "Date": "August 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Castro Valley, CA", "Title": "“Great service and accommodations”", "Author": "Kathi_Expander", "ReviewID": "UR8497459", "Content": "First of all the location is fabulous. It is a 5 minute walk to the beach with many great restaurants, 10 minutes to the city business section and about a 30 minute walk to the end of La Rambla. The Bus Touristic has a stop right around the corner from the hotel. When making our reservations with Travelocity I had a \"triple room.\" For some reason I thought it was 2 rooms with a bathroom. I was wrong. Instead, I was given a one room with a king size bed and a small twin and the bath. I went to the front desk and they pulled my order. I told them what I thought I had ordered and they said, \"You have 2 adults and a child.\" I explained that the child was 17. They immediately checked and upgraded me, at no cost, to a business suite that had a room with a king bed and an \"office\" equipped with computer, desk, recliner chair, and coffee table, with plenty of room for a single bed. It was perfect. The bathroom was awesome. We were staying there for 3 days and traveling elsewhere for 2 weeks and returning at the end of our trip. The front desk reserved that same room for us on our return trip at no additional cost. The all-you-can-eat breakfast was great with all varieties of breakfasts from around the world. It was definitely enough to hold us over until Tapas time, with a gelato and espresso lunch in between. The staff was wonderful and accommodating. I give it 5 stars and will tell everyone to go there. By the way, the taxi from the airport was only 18 Euros, plus 1 Euro for each piece of luggage. I am not sure what the other person is talking about when they paid 38 Euros. Also, there is a train from the BCN airport to Estacio de Francia, and the cab from that station to the hotel is only 6 Euros plus 1 Euro for each piece of luggage. This hotel and it's staff is a real winner.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Woodstock, New York", "Title": "“decent hotel for the price”", "Author": "mlomagno", "ReviewID": "UR8464771", "Content": "Booked this hotel for one night when we stopped over in Barcelona. We've been to several hotels in this city and overall this was a pleasant hotel. Hotel is a few short blocks from the beach. Public Transport is also several blocks away but not too far. Hotel room was clean and roomy. One problem. Bathroom sink glass vanity which was attached to wall was falling off. Looks like they are not big on repairing. Noticed several things in room that needed touching up. This seems to be a recurring problem with these hotels. They put them up in lightening speed and tend to have contractors who cut corners or workmanship is not up to par. Regardless, hotel is recommended if you do not care about being in the center of the city, wish to spend less but not compromise on quality. By the way, I decided to book here based on the many reviews on here. They were pretty accurate. Thanks to them!", "Date": "August 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london, uk", "Title": "“A good hotel near the beach”", "Author": "patsyc216", "ReviewID": "UR8427814", "Content": "I base all my hotel choices on the reviews and ratings on tripadvisor and usually only book hotels that are ranked within the top 20. I don't know why I decided to go against this norm and booked the Icaria but I have no regrets whatsoever! Location: We took the train from the airport and changed to the L4 on the metro at Passeig de Gracia. You can use T10 tickets for the train as well as the metro. The walk from the metro station to the hotel is at least 10 minutes. But since one of us almost had his wallet pickpocketed, that was the last time we took the metro during this trip. Going back to the airport at the end of our trip we took a taxi and it only cost EUR23. The hotel is set in a quiet area with a bus stop right in front of it and the tourist bus is only around the corner. You can get to La Rambla on the 14 bus in about 10-15 minutes but a taxi ride will only cost EUR6 anyway. A 5 minutes walk will take you to the beach and a further 2 minutes you're at the marina. There's a good supermarket in the shopping center only 2 minutes away where there are also lots of restaurants. Hotel / reception: It has a nice lobby, well furnished with tropical fish tanks. As soon as you enter the hotel you can already see the terrace and the pool in the back. Apparently some non-guests also wander in to use the pool... People at reception are helpful. They sit quietly behind the desk but as soon as you walk up to them they will smile and do what they can for you. Check in was quick but one of our rooms wasn't ready until about 2 hours after we checked in. Room: Sufficient space, well furnished and clean. The bed was very comfortable. I've been having back pains for a few weeks before the trip and during the 3 nights there I always woke up the next morning pain free! (Once I got home to UK the pain returned... :P) The safe and fridge both came in very useful. We had a pool view room on the 4th floor and we could see the AGBAR tower clearly. No noise from the construction site next door while we were there. Maybe they have August off... Breakfast: A good selection of hot and cold items. Breakfast is served from 7 - 11 so it never got too crowded. Recommendation: There a \"seafood stall\" restaurant called La Paradeta near to the Zoo/Park on C/Commercial 7. You can get there on the 14 bus and it's also a stop on the tourist bus. You pick the seafood you want from the \"stall\", get it weighed, tell them how you want it cooked and they cook it for you. Really fresh and tasty and very reasonably priced. For the amount we ate it would have cost us at least double back in UK. It is down an alley way next to the old market, so mainly locals eat here. They open at 8, we finished our meal at 10:30 and there was still a long queue at that time, so get there early! Best meal we had in Barcelona. We did all the sights and ate too much food so I don't think we'll be going back to Barcelona anytime soon. But when we do go back I would probably choose Icaria again.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "North Devon, UK", "Title": "“Icaria Hotel,Barcelona a great find.”", "Author": "Shaz E", "ReviewID": "UR8369550", "Content": "Having seen the reviews for this hotel on tripadvisor and the excellent location to the beach and the port, plus the great price we got for two twin rooms with breakfast, myself and three girl friends booked 2 nights here a Sat/Sun at the beginning of Aug. The hotel was very modern and clean with a pool and jacuzzi and a lovely outdoor seating area with big, comfy sofas, ideal for sitting with a drink and book to chill out and de-stress. OK, like other reviews there is building work taking place next door but being a weekend there wasn't any work going on so nice and quiet, i wouldn't let negative reviews put you off using this hotel as the good points far outway the bad. The rooms we had were large with a big modern bathroom and a hot powerful shower and hairdryer, comfy twin beds, air conditioning, fridge/mini bar, flat screen tv and free safe. There is also a free ice machine on every floor. The rate we had included breakfast which provided more than enough variety of food to start the day, cereal, fruit, cakes, even a full english which we all enjoyed and the great coffee, a perfect start to a days sightseeing in Barcelona. Location, great for the beach and the olympic port, five mins walk where there's a sandy beach, a great beach bar and a good selection of restaurants with excellent sea food which are more reasonibly priced than the main centre. The sightseeing bus is a good way to see Barcelona which you can board close to the hotel, a hop on hop off bus so you can see all the sights without having to walk between each one also taxis are easy to find so don't be afraid if the hotel seems to be out of the centre of Barcelona, as we found it was nice to get away from the crowds to our area of Barcelona which we found very safe even late at night. In the short time we had we found this hotel and location to be excellent and would definetly use it again.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Paramus, New Jersey", "Title": "“Great beach location, hotel lacking”", "Author": "travelchatter", "ReviewID": "UR8238544", "Content": "The hotel is geared to business travelers, with wireless internet and breakast included. Both made the hotel a huge plus. The buffet breakfast was very nice with fresh fruit, juice, pastries, eggs, ham, toast etc... The hotel was clean and new-ish, I imagine built within the past 5 years. It was built on the cheap. The outlets were falling out of the walls, the furniture looked like it might fall apart soon. The bathroom tile was a fake marble look, which was really cheap. We had numerous problems and were in 2 different rooms. The first room the internet access didn't work on the floor and after 2 days of complaining they moved us to a second room. In this room the shower was broken and they promised to fix and never did. We rigged up our own fix and made it work, but not impressed at all with the staff. They were nice, but didn't go out of their way to help and I didn't see anyone helping with bags! The front desk lost numerous packages of mine, including ones I was sending, ones sent to me, and congress bags. It has a very lovely outside area with tables and couches. Also, a very nice pool and work out area. The location is close enough to the beach and port olympic to walk to, so that was the best thing about it! Before checking in here we stayed at the Hotel Avenida Palace, which was gorgeous and had great staff!! I would go back there, although the hotel Icaria looked like the best hotel to utilize the beach! Also, highly recommend La Fonda restaurant in Port Olympic. They had excellent fresh seafood and paella!", "Date": "July 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“A Barcelona beauty”", "Author": "theluds", "ReviewID": "UR8236773", "Content": "Just back from a 6 day family break at the Icaria and loved the hotel. We wanted a base in Barcelona that was outside the noise and bustle of the city centre and also offered easy access to the beach. The Icaria's location fitted the bill perfectly, being on the edge of town in the modern Port olmpic area just a few minutes walk from both the beach and marina. Most of the revews posted for the hotel were very positive and the pictures that were available showed good quality accommodation and facilities so we felt we were on to a winner. We weren't disappointed. I would offer the following comments for anyone thinking of going:- a). Location - we loved the fact that if offered the best of both worlds in our opinion, being close to the (great) beaches and also the town centre. There are metro and bus stops close by (bus stop just outside the hotel but metro a bit of a walk) but also numerous taxis passing the hotel. Taxis were good value with prices varying between 5 - 8 euros for the trip into town depending where you want to go. The neighbourhood also seemed very safe and clean and we had no problems walking back late at night from the metro station. Within a few minutes walk there is a small shopping centre and sundry other shops and restaurants. There are also numerous bars and restaurants down on thebeach and around the marina. We felt that the beach bars were fair value but were disappointed with the one meal we had in a restaurant down at the marina. b). Facilities and accommodation - we found all of the staff, but particularly the reception staff, to be very friendly and able to speak very good english. The bedrooms were great, spotlessly clean, a good size and with high quality fittings and fixtures. Must mention the lovely marble bathrooms! There are also free safes in each room which proved useful. TV wise there are nice flat screen tvs but limited english channels, but hey you're on holiday so you shouldn't be watching it anyway! Outside there is a relatively small pool and plenty of seating including comfortable soft seating areas. For those who want it there is also a small fitness suite. c). Food and drink - we thought the breakfast was great with a good choice to suit most peoples needs. Could get a bit busy at times but I suspect that we were generally in there at peak periods. There's a fair range of options for lunch, dinnner, snacks etc too and we felt the quality was very good. Prices seemed pretty fair, particularly when compared to the marina, but one thing I would say is that on both ocassions when we had dinner there we had starters and main courses coming out at different times for different people. This may be a Spanish thing as we also had this problem at restaurants in town, or maybe we're just unlucky! Another slight negative was the price of drinks. Personally we felt these were a bit high for beer and soft drinks. We were paying 4 euros for a glass that held about a third of a pint, which was much more than either the beach bars or other restaurants we went to in town. Yes I know it's a 4 star hotel, but.... d). Other matters - you can't miss it, there are buildings going up around the pool area. We weren't disturbed by the noise particularly as we had rooms on the other side but you have to wonder what impact they will ultimately have on the pool area. Obviously not the hotels fault but let's hope they don't build them too high and cut off the sun. So, that's it. Yes there are a few down sides but overall we loved the hotel, it's location and the friendly staff. Bearing in mind the price we paid we feel it fully deserves 5/5. A final quick word about Barcelona itself. It's brilliant. We hope to go back there and finish off the things we never managed to do this time. If we do we shall no doubt return to the Icaria.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "birmingham,uk", "Title": "“Close to Port Olympic”", "Author": "elestoban", "ReviewID": "UR8234785", "Content": "If you want to be close to Port Olympic,the beach & have a modern hotel with a swimming pool & nice marble bathrooms then this may well be the place for you.The hotel is only 4/500 yards from the beach & port olympic a further few hundred yards. Other than that the location is a bit of track for other districts. The rooms are modern,clean & spacious & the bathrooms excellent. Breakfast which is usually included in the rate is excellent although often a little chaotic. \" Please wait to b seated \" can mean please wait for us to cross your name of our list - then you are on your own !! Reception tended to be understaffed but friendly & efficient. IIf going to explore Barcelona rather than lie on a beach then I would suggest staying elsewhere.", "Date": "July 25, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Essex", "Title": "“Great apart from the Building Work”", "Author": "Juppsteruk", "ReviewID": "UR8220975", "Content": "We chose this hotel for a company conference in June 2007. The property was mystery shopped by my events team in March 2007 and we decided that this would be the venue for our 90 guests. I would add there was no building work when the booking was confirmed or any warning that this was going to start. Upon our arrival we were met with the sign of a very large crane and scaffoding directly in eye sight as you entered the swimming pool area. At 7.20am the next morning the building work started and the sound of a metal grinder made sleeping impossible. After very harsh words with the reception manager we were introduced to the hotel manager; an excellent man if ever there was one. He relocated all of our soon to be arrived guests at the front of the hotel, thus away from the noise. He visted the building site and warned the site officer that work wasn't able to start until 8am. He then made our stay as comfortable as he could with free cava in each of the 90 guests rooms, free breakfast the next day and a complementary stay for my events team to come back and sample the hotel, post building work. In summary, we experienced the Icaria probably at its worst. The building work is set to get less obvious and noisy. The conference was saved by the customer service of the manager and his team. When the building work is over (around October 2007 I believe) you will be hard pushed to find a nicer, friendlier hotel, nearer to the beach in Barcelona.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Alicante Province, Spain", "Title": "“A Hidden Jewel”", "Author": "vershine", "ReviewID": "UR8205614", "Content": "Our family of 3 travels quite often and are members of several major hotel chains. However, there are no major ones other than Hilton near the waterfront in Barcelona. We opted to try this hotel, Icaria BCN...4 star, 2 blocks from the beach, away from tourists and a 16 multi-plex that plays films in the original language. It is in the Olympic Village area which is very residential but taking #14 bus goes to Port Vell, Las Ramblas and Plaza de Catalunya. and it is only 1.25 euros. The hotel is walking distance to Olympic port with numerous restaurants. If you like to walk, the promenade will all along the waterfront. Now the hotel...It is very modern and chic without feeling pretentious. The regular room was large for European standards, sound proof, comfortable bedding and bed and good quality amenities. The suite includes a computer, so no need to drag a laptop. There are 3 computers gratis for your use in the lobby also. The dining was good. Breakfast was a buffet and dinner had interesting choices that are prepared fresh, so be prepared to wait. But it is worth it. Pricing is very good. We had also ordered room service in which pricing is better than any hotel I have seen in the past. Some items are available 24 hours. The hotel has two outstanding members at the front desk. They are pleasant, knowledgeable and very efficient. I know it is a difficult task when dealing with the public but they do so with ease and a smile, which is important. They make an excellent impression. We decided that this hotel is outstanding in price, comfort and location. We will definitely stay there in the near future.", "Date": "July 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belfast", "Title": "“Pros and cons”", "Author": "Loves-a-quiet-time", "ReviewID": "UR8185539", "Content": "Pros: Good sized rooms, Great location for Icaria beach and marina with it's numerous eating places but a littel away from the City centre, however tourist bus stop only 50 yards away and the metro 300 yards away, substantial breakfast from 7-11 am. Helpful staff. Swimming pool, Reasonable bar prices for a hotel. I paid £360 for two rooms for 3 nights, breakfast included for two adults. Cons: Building work next to hotel which is ongoing and will eventually cut out light and is a little of an eyesore at present. The new work is nothing to do with the hotel and not their fault. Originally given two rooms on separate floors for myself and my wife and my children. Private function on Saturday evening which substantially put pressure on barstaff. I heard one couple being told a barsnack would take 2 hours. The air conditioning didn't work well in one of the rooms. At checking in, my wife said for safety reasons we needed the rooms to be next to each other and to be fair to the staff this was sorted without any argument. In fact I foung the reception staff very helpful throughout. The building work will have an impact. Work stops at the weekend so I think this would be the best time to go. It is noisy early in the morning in rooms with the pool view. The road side rooms are very quiet but I think a little more expensive. To me the pros outweighed the cons, and I would go back to this hotel. My family had a great time in Barcelona. If I went back with my wife I would book a road-side room and and go at the weekend. I might skip breakfast. It costs £14 euro and there is too much. I am not a big breakfast person.", "Date": "July 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Newcastle", "Title": "“Thoroughly enjoyed our stay”", "Author": "membernewcastle", "ReviewID": "UR8099283", "Content": "We have just returned from a 3 night stay and unlike the previous reviewer we thoroughly enjoyed our stay, and hope to return to the hotel next year. There is no disputing that there is building work being carried on just next to the hotel but this did not really have much of an effect on us as we were up early and the workman had finished when we returned. I do agree however that sitting in the pool area will be much better when the work is completed. The hotel itself is very nice, the bedrooms are modern and have a mini fridge, safe and flat screen TV. There is also free Internet access in the room. There are only 2 English channels so your TV viewing is quite limited. We stayed on a bed and breakfast basis and there were a very good variety of foods available. My only slight complaint was that the bacon was just warm, but again this was only a slight niggle and didn't deter us from enjoying the actual breakfast. There is an ice machine on each floor, something we found very useful. The hotel is situated is a fantastic location close to the beach where bars and restaurants are situated. Getting to and from the airport was very easy, on arrival at Barcelona airport we took the airport shuttle bus at a cost of 3.90 Euros each to Placa Catalunya, this leaves right outside the terminal building and runs approx every 12 mins We then bought a T10 ticket at the entrance to the Metro Station, which gave us 5 journeys each, this cost us 7.90 Euros. The station was only 3 stops from the hotel. You could also use the No 41 bus also from Placa Catalunya. To get back to the airport we used the No 41 bus (which stops practically right outside the hotel) which took us to Placa Catalunya where we picked up the airport shuttle bus. During our visit we used the hop on hop off bus, this was 23 Euros for a 2 day ticket, again the bus stop was just around the corner from the hotel, the bus ran from approx 9am to 8pm and was a great means of seeing all the sights Barcelona had to offer. If you are a football fan the Barcelona Nou Camp is well worth a visit. Overall we had a great time in Barcelona and can really recommend this hotel, our main complaint was that we only stayed 3 nights, we could have stayed longer. We will certainly go back.", "Date": "July 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“A good base for exploring Barca !!”", "Author": "BlueFranky", "ReviewID": "UR7347918", "Content": "Just back from a 4 day stay in Hotel Icaria with my wife and 1 yr old daughter. Booked this hotel through researching online comments such as those on this page and I wasn't disappointed. First lets look at the bigger picture - Barcelona is a very big city which seems to be very geared towards tourism. The 'hub' of the city around the Ramblas is very busy (and much more expensive than elsewhere) and for anyone visiting they are going to explore the city using the tourist bus. Visitors want safe, clean and well located accommodation. Lets look at the positives: 1. Icaria is on the edge of town, placed in the excellent (and seemimgly very safe) Port Olimpic area. Beautiful beaches and hundreds of bars and restaurants are a 5 minute walk from the hotel. 2. There are 2 ATM's literally 200m down the street from the hotel. 3. There is a small shopping mall opposite these machines. 4. The tourist bus stops 200m down the other end of the street (10min ride from Las Ramblas). This means that travel to any tourist destination within the city basically leaves from your doorstep and drops you off there as well. Its away from the bedlam of the city centre yet within reach of it very easily. 5. The hotel is clean, well maintained and staff dealt with any requests in a quick, professional manner. 6. The restaurant food was very nice. 7. Safe in room very secure and used friendly. Now for the negatives: 1.The hotel seemed to have the feel of a 'business type' establishment, but there were other families staying there as well and we did not feel out of place. I have stayed in hotels all over the world and Icaria is as good as any. 2. The staff, while not overly friendly, are good at their job, which is the most important thing. 3. The pool seemed OK (it was too cold to use it) and the gym is basic (x2 treadmills, x2 cycles and a few free weights). 4. The lighting system in the room is wacky - 9 bedside switches and each one does something different each time its pressed 5. Mini-bar products massively overpriced (use the supermarket in shopping mall instead !!) 6. Only x2 English speaking TV channels (CNN World and Nat. Goeg.) 7. Shop around for best price - I rang the hotel directly twice - the first time they quoted me 200E per night then 1 hr later told me they had no availability. I then booked online and got a much better rate than this. So there you have it. In my opinion Icaria is as good an hotel as you will get in Barcelona for the above reasons. This being the first time we had taken our child abroad we were very happy with this Hotel and would recommend it to any friends or family planning a trip there.", "Date": "April 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Very so so, not worth the price”", "Author": "Noe_erfaren_turist", "ReviewID": "UR7289799", "Content": "The hotel was OK. Nice room, great bathroom (except the loose paneling in the roof, which made a terrible racket every time the door was opened.) The Good: The room, the bathroom, the breakfast The not so good: Not very central, but buses stopped just outside the door, and taxis came zipping when you extended an arm. No metro, though, and only two bus lines, with approx 20-30 minutes to get to plaza catalunya Very! expensive breakfast . Breakfast were included because of \"early booking\" but the \"breakfast-staff\" still tried to get us to sign off for it. When we asked why, they maintained it was not included. Sorted out quickly when we spoke to staff in the reception, but still a bit of an annoyance. The sorting out were probably helped by the fact that we had very good documentation that it were to be included.. Staff attitude and response to legitimate complaints. The bad: Broken A/C (set in \"winter position\" apparently), which were not fixed the whole stay (5 nights). Instead, it was set on approx 28 degrees, making the room hot!. With no A/C, the window had to be open, and the traffic noise then became an issue. Safe locked when we arrived, and it took way longer to get someone to unlock it than it should have (2 hours and three reminders and finally going down to the reception to get the staff myself) Swimming pool placed so you had to pass through the lobby to and from, no privacy to speak of, and a laughably equipped gym. I never used it even though I would have with a bit more privacy. Never saw anyone else use it either. The ugly: No apologies from the staff for the A/C, no effort to fix it. All in all: Not worth the (quite high) price. For peace and quiet you are better off getting a place in the Rambla, this would also be vastly more central.", "Date": "April 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "N Ireland", "Title": "“Modern and spotlessly clean”", "Author": "Bee40", "ReviewID": "UR7219244", "Content": "Hi, we booked this hotel thru Alpha Rooms having read some good reviews there, we wern't disappointed. The hotel is modern and staffed by very young people from reception to the catering and even the cleaning...that said, the reception staff are a little aloof...extremely helpful ....but still aloof. We had room 113 which overlooked the pool but was right next to where building work was taking place so was noisy from early am ...however as we wern't gonna be in the room all day we didnt bother changing. The room is spacious, had a fridge, a flat screen tv (only 2 English channels )heating/airconditioning unit which you could adjust yourself, a safe, a couple of comfy seats in addition to the roomy twin beds and a spotlessly clean fully tiled bathroom with a hairdryer in it. The pool/jacuzzi area is gorg with the pool up on a decked area and the terrace had big comfy leather sofas and squashy cushions, (a business meeting took place on the saturday and the pool was off limits )...very hip and trendy but this is overlooked by the building work. The dining room is large and the breakfast was scrumptious, cereal, fruit and yogurt, cheeses and cold meats, bread rolls and bread for toasting,and boiled/scrambled or fried eggs with bacon and baked beans. Also tea/coffee/orange juice and a selection of pastries. Plentiful and hot and just yummy and served from 7 am until 11 am...excellent service. Walk out the front door and turn left, 50 yards down the street cross over the road and then go left across the next road and you are facing the beaches which are just lovely. Before you go to the beach is the touristic bus stop...great value at 24 euro for 2 days and you get on and off them all day long from 9 am until 7 or 8 pm. You could walk into the city in 20 mins briskly but buses and taxis are cheap enough. I would return to this hotel and this area....enjoy.", "Date": "March 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Highly recommended”", "Author": "Klo2", "ReviewID": "UR7191217", "Content": "Choosing a hotel for a week in Barcelona was important given that it was going to be my ‘home’ for a 7 days and nights. Various relatives recommended staying near Las Ramblas, as you would be in the heart of the City. However I spent a fair while searching for a hotel in that area but couldn’t secure a hotel for the full 7 nights within the price and star range I wanted (4* around 80-100 euros a night). Then my search stumbled across Hotel Icaria. To be honest it looked too good to be true. The pictures looked fab. and for 5 of the nights I would be paying only 85 euros for what was a 4* hotel which appeared more like a 5* (for the other 2 weekend nights I would be paying a bit more). Some photos are attached. I then looked at Trip Advisor for reviews - overall positive, but with some negative comments about the attitude of reception staff. Also there were notes that it was a bit out of the city, but not too far/costly by taxi. So I went ahead and confirmed. This review was written on my last night. It really has been a fantastic stay and I can highly recommend the hotel. I’m as critical as they come so this recommendation isn’t made lightly! The hotel is very plush with rooms of a high standard. The standard room didn’t offer tea/coffee facilities though, which I discovered after searching every nook and cranny thinking “it must be somewhere!”. I didn’t use the outdoor pool but it appeared very clean and the spa was on whenever I looked. I can imagine it being very nice in slightly warmer weather. I think it’s real plus point is the location. It is so quiet and feels so safe. In fact, were I to live in the central Barcelona I could see myself in this residential area. The hotel is a bit out of town but not isolated with cafes and restaurants within 5-10 minutes walk. There is also a large supermarket within a few minutes (look for El Centre de la Ville). More so has been the ease of travel into the centre. The 41 bus stop is less than a minute away and takes you to Playa Cataluyna (and on route via other areas of interest). Taking the 41 bus the other way leads you to a new mall. The other main bus I used is the 36, which goes along the beach/harbour area and again the bus stop must be less that 2 minutes away. The bus is 1.25 euros but is cheaper with the travel cards. The hotel has the public transport maps available to take away and I would recommend studying them as I was pleasantly surprised by the ease of access to tourism areas. In addition, the Bus Touristoc stops less than a minute away. I did get a taxi from the bus station and it was about 8 euros. One back from La Sagrada Familia was 6 euros. Also for anyone searching the forum for the term disability/disabled I was really impressed by the bus’ disabled access. It all seemed so routine and quick, with people in wheelchairs getting on and off via an electronic disabled access ramp and having a space on the bus, with such ease. Also concerning location I walked past the Las Ramblas hotels I had looked at and now can only imagine them to be cramped, noisy and without the peacefulness of this area. Saying that on the third morning I was woken by the sound of drilling. On booking I had asked for a quiet room and was appropriately given one overlooking the pool, but it turned out that a building was being constructed next door. I phoned the reception and asked for a quieter room and within 5 mins a receptionist was at my door with a key for a room on the 6th floor, albeit on the main road but an upgrade and much quieter (and with tea/coffee facilities!). On that note, the reception staff have been very helpful and knowledgeable when approached. The technological side of the hotel has been good, but not quite as exuberant as implied by advertising. In both rooms the LCD TV had excellent quality, however they only have two and sometimes three English channels (CNBC and National Geographic and sometimes CNN), but that seems above average for the area. Neither room came with a DVD but I didn’t specifically ask for one (with the hotel info. stating that extras could be supplied when requested). As noted in other reviews of the hotel, the lighting system, was in principal, a bonus, but with no instructions I would find myself pressing a button on the panel by the bed, then finding that the light I wanted to turn off was still on. I would then get up and try the light switch itself, though sometimes that seemed to be overridden! Even working out how to get lights on in the first place was a bit like the Krypton Factor, until I realised you need to put your card key in a slot by the door. Very clever idea once you work it out! A real plus was the free internet access. From both of the rooms I was in I was connected within seconds. Overall, I would certainly stay here again, though do wonder about prices in high season given the beach location. If you find a deal here though that looks too good to be true I would go for it. Oh yes - Barcelona itself is a must see city! It was a great week.", "Date": "March 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wales", "Title": "“one of the very best!!!”", "Author": "red kop", "ReviewID": "UR6837685", "Content": "Have just returned from barcelona,and after reading most of the reviews on tripadvisor i knew i was booking in to a great hotel!!!well people you were not wrong,from the moment we arrived nothing was too much trouble to the staff on reception,bedroom with plasma screen + marbled bathroom fantastic,outside by the pool + jacuzzi,a class area to chill,check it out!!the hotel is only 5 mins walk from the olympic marina,but did'nt hear a thing at nite!!!plenty of bars + restaurants in the marina area,would reccomend one called the barnabier,great food + drink...Also walked along the promenade to the chair lift which gives you great views over the city..be very careful when you visit the ramblas area,as pickpocketing is a very real problem!!!enjoy Barca + the Icaria you won't be dissapointed!!!Oh and by the way i was there to watch my team Liverpool f.c. win in the nou camp once again!!!!priceless!!", "Date": "February 25, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "dublin", "Title": "“Nice,Clean and modern hotel”", "Author": "lenny1976", "ReviewID": "UR6781471", "Content": "Took a chance on this hotel based on previous reviews and i wasn't dissappointed. Its a nice, modern hotel that is super clean and with rooms that are quite comfortable and modern. The location is spot on with the Beach and the port olympic marina just a 2-3 minute walk from the hotel. The nearest metro stop is 5-10 mins away which is great for heading into the more vibrant Ramblas area. The olympic area is ideal for dining as there are numerous Restuarants there as well as many bars for the after dinner drink!!!", "Date": "February 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Excellent hotel”", "Author": "Weekend", "ReviewID": "UR6107811", "Content": "Stayed for 3 nights with 4 teenagers. Chose it as it had pool, gym and internet, all of which kept them happy when we had half an hour to spare! Most of the time however, was spent sightseeing and although the hotel was slightly out of the centre, it was only a ten minute busride away and not too long a walk - with the weather at 23 degrees most days, that was fine. The tour bus stopped close to the hotel too. It was walking distance to the restaurants and nightlife at the port which made a great night out . We found the hotel relaxing, and while the staff kept a low profile, they were there when you needed them. The full breakfast was excellent, high quality and with lots of choice, superb for ever hungry male teenagers. Overall, very good value and highly recommended.", "Date": "November 11, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“A treat for the eye”", "Author": "kaybxl", "ReviewID": "UR6025454", "Content": "I simply loved my stay at Icaria. The hotel is situated near the beach, but it didn't bother me having to take the underground/bus to get to the vibrant city centre. I like my hotels peaceful and quiet. The hotel also has a swimming pool. Excellent way to spend your little siesta. The rooms are very clean. Wooden floors, modern design, beautiful bathroom... On the downside: the airco in our room had its quirks and the bed was way to hard...", "Date": "October 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel”", "Author": "irelandtraveller26", "ReviewID": "UR5811690", "Content": "Stayed in the Icaria Hotel, Barcelona in September 2006. I was a bit apprehensive going, after reading a few bad reviews on Tripadvisor website but I can safely say I found the hotel to be very clean and staff on reception were very helpful and friendly. Rooms are very modern, with plasma and mini fridge in our room, and the pool area is nice. Nice gym too. Hotel is only apx 20 min drive (€30 in a taxi) from Barcelona airport and it's only a two minute walk to the beach and Port Olympic. Taxi to the city centre only costs between €5 and €9 and taxi to the Nou Camp is around €10. I was glad I didn't stay in the main La Ramblas area as Port Olympic is much nicer. Plenty of Irish Bar's around La Ramblas area and there's also one in the Port Olympic. Plenty of nice restaurants there too. I would defintely stay in the Icaria Hotel again and would recommend it to friends.", "Date": "September 18, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Beautiful Hotel, shame about the breakfast service..”", "Author": "Annora", "ReviewID": "UR5784918", "Content": "We stayed in this hotel at the end of August and it was absolutely brilliant aside from the breakfast wait staff ignoring us. Look at the pictures on the website above and they are exactly like that. We had a suite and it came with its own computer which was a major bonus - saved us from waiting to use the ones in the lobby. It also had a cd player and we had two rooms which was really nice. The bathroom is HUGE as well and there are a lot of accessories that you get too, so another bonus. I loved the pool area and the jacuzzi. Didnt get to use too much of it but we sat by the pool a couple of nights and drank Sangria so I was happy - the guys in the bar were just LOVELY and very helpful - even grabbing me a light snack that wasnt really on the menu and bringing it to me poolside! ANGELS! REALLY LIKE the fact that the tourist bus stop is just around the corner so you can get back to the hotel after a day cruising on the various busses looking at sites. The location is nearish to the Olympic port area (walking distance of about 5mins) which is nice - just dont stop at the first restaurant you see or like us you will have a dodgy meal. There are not very many options for vegetarians in Barcelona so make sure you get a few tips and maps on where to eat if you want to get fed properly and whatever you do - DONT EAT ON LAS RAMBLAS!! eeek.. the food was sooooo soooo bad!!! scary - wish we'd been warned before so now you have. The nightlife is awesome so have a blast and enjoy Barcelona folks, we did!", "Date": "September 9, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Good Hotel, Wonderful City, Fabulous Holiday!”", "Author": "loves_traveling15", "ReviewID": "UR5764868", "Content": "Upon arrival of the hotel it looked fabulous, very clean and well looked after despite the scruffy surroundings outside. Our rooms were spotless and ready on time when we arrived there at 2:30 pm! However the rooms could of been a little bigger but the bathroom made up for it. The restaurant and bar were lovely however the menu wasnt the most exciting and didnt have alot of choice and also did not have a childrens menu or food suitable for small children, luckily the breakfast buffet did, you could eat as much as you want but food did run out fast! The pool complex is very small! This was a let down as it appeared a decent size in the pictures, the gym is good quality but again very small. I did enjoy the sauna and steama room but they did not work for 2 days during our stay. The location of the hotel is perfect!!! just 5 minutes walk from the gorgeous beach and, thanks to the bus stop just around the corner, just 5 minutes drive from the city centre where there is lots to do and see. There is also a mini-mall just down the road where you will find a large choice of restaurants, clothes shops and a large supermarket. Overall, I had a very enjoyable holiday and would highly recommend this hotel to couples and families with teenagers.", "Date": "September 3, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belgium", "Title": "“Barcelona is the best city”", "Author": "Missing_barca", "ReviewID": "UR5612295", "Content": "It was my first trip to barcelona. Nice, busy city. The hotel is located very well because it's quiet at night. Not to far from the metro and a bus stop just before the hotel, close to the beach. For the hotel : very good airconditioning, nice pool and comfy seats outside, modern rooms, clean bathrooms. The breakfast was good, a lot to choose from, only there wasn't enough staff. You've to waited a long time till you got what you ordered. I was there from 7 august and I enjoyed my stay. Anyone who was there also during this time, feel free to contact me at guccilise@hotmail.com.", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel, Great Location, OK Staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR5380627", "Content": "We stayed there for 7 nights. The hotel itself was lovely, good sized rooms and bathrooms with great decor, the airconditioning DID work for us, rooms cleaned daily and the pool was fab. Didn't eat at the hotel at all so couldn't comment on the food although need to say the room service menu didn't look very expensive. The location of the hotel is excellent, 2 minutes from Boegetal beach and about 30 minute walk to la rambla. There is also the number 41 bus right outside the hotel which takes you to placa de catalonyia. The staff were ok, quick check-in but not exactly the most approachable bunch but at the same time did nothing really to offend. Like others said, there is a bakers just around the corner and the other way a large shopping centre which has various restaurants and a big supermarket on the basement floor. There are also plenty of banks close by and taxis frequently pass so there is no trouble in flagging one down. Overall I would definitely recommend this place, its near enough to the centre of town for easy access but also far enough out that you can appreciate the beauty of the fantastic beaches.", "Date": "June 25, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“SNOOTY SNOOTY SNOOTY”", "Author": "ginosesto", "ReviewID": "UR5344366", "Content": "We had an amazing rate that the hotel nearly refused to honor. It was a Friday night and they did not like that I was paying so cheap. Staff was incredibly snooty and rude. Room was GREAT. Internet access is free with a 10 dollar deposit for the cable. Breakfast was okay, nothing to write home about. Staff all over had an attitude. Felt completely unwelcomed from check-in to check-out. Overall it's okay if you don't mind rude people.", "Date": "June 14, 2006"}], "HotelInfo": {"Name": "Icaria Hotel Barcelona", "HotelURL": "/ShowUserReviews-g187497-d498018-Reviews-Icaria_Hotel_Barcelona-Barcelona_Catalonia.html", "Price": "$125 - $279*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida Icaria 195</span>, <span class=\"locality\"><span property=\"v:postal-code\">08005</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "498018", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e1/df/80/icaria-hotel-barcelona.jpg"}}