{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Castle, Delaware", "Title": "“What we expected/average beach hotel”", "Author": "MissPinkTrouble", "ReviewID": "UR139822252", "Content": "I would definitely stay at the Monte Carlo again. The rooms were clean, the rooms with the jacuzzi were really nice, the bed was comfortable and there was nothing to complain of. Great location very close to the boardwalk, and I definitely suggest paying the extra $20/day for preferred parking. This hotel is what I would expect of a \"beach\" hotel. There was a DVD player, flat screen TV, fridge, makeup remover wipes in the bathroom, and a microwave and plenty of space in the room. The outside pool was clean and definitely a nice way to cool off. I would recommend this hotel to anybody who isn't looking for anything fancy and top of the line. All that said - I think there could be a few very minor improvements. The upgrades they made in 2012 to the room furnishings were fabulous. However, I wish they would have upgraded the shower curtain in the bathrooms - it looks like $1.00 cheapee you pick up at a general store. The curtain itself is functional but I think something a little nicer looking would do wonders for the bathrooms. I know in our room the sticker on the fridge that indicates that the fridge is off for energy conservation was worn off making it nearly illegible. So I spent the first few minutes wondering why the fridge was warm until I was able to make out the sticker on the front. Those are really my only two suggestions. Otherwise we had a wonderful stay!", "Date": "September 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic labor day stay”", "Author": "dontastical", "ReviewID": "UR139468229", "Content": "Well our final trip to the ocean this season and the hotel once again didn't disappoint. Staff was friendly and clean rooms as always. This time they also did a movie showing of the hunger games poolside. Which was pretty great. I see some of these complaint reviews on here and think to myself theres just no pleasing everyone. Some people are miserable at home and seem to be taking that to the beach. Staff greeted us every time we walked by the desk. And even gave us some suggestions on some rainy day activities. It's a cute little beach place. If you like to enjoy the boardwalk and all it has this place is for you. The location can't be beat. If your already a mad bitter person I prob would advise just staying home. All the rooms are kinda new and contemporary. Parking is tight. But hey it is free.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Malta, oh", "Title": "“Never again!”", "Author": "Phillip M", "ReviewID": "UR139372486", "Content": "This hotel may of been the worst one we could of chosen! Pros: the lobby smells like subway, big plus! It has a rooftop pool It has a rooftop hot tub, this was clean and niceish Location, kind of you are one street down from the boardwalk but you are NOT on the boardwalk! Cons: Sand in the bed or something, I know others have said this but I assumed it was a one off item but that is not the case. This hotel clearly does not change their sheets regularly. Toilet was broke, I had to fix it multiple times myself because the back kept getting stuck so it would not fill up. One elevator that is slow as hell, the stairs are WAY faster. The parking: If parking could be any worse it would be clear off the island, nothing like driving around a place you do not know with vague instructions on where to park \"its a block down\". The Staff: it appears many of these people do not care about their guests and if you write a bad review on here they follow up with pure lies (I will be expecting one claiming we was kicked out, or re-booked, or tried to get a free room, neither of which we did, or ever will do). On top of all this I don't think they greeted us a single time when we went in or out. The door keys: some reason it took several tries to get them to work on occasion. This is the worst hotel I have ever stayed in, between the terrible staff and living area, and the price (which was the final straw) I will never stay here again, and not recommend it to anyone else.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Marietta, Ohio", "Title": "“Horrible”", "Author": "Redman6601", "ReviewID": "UR139371036", "Content": "Spend the extra money and stay somewhere else. The hotel staff is very unprofessional. Even after telling them of our problems, the room smelling of mold and smoke, they did nothing to cure this. We ended up staying because they would not refund our money and that everywhere else was booked.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“roomy suites with comfy beds”", "Author": "Jerry A", "ReviewID": "UR139202982", "Content": "We stayed at the Hotel Monte Carlo Suites on 11th st. this weekend for three nights. I had mixed feelings about this hotel due to some good and bad reviews. Check in was quick and easy, staff was friendly. We did a thorough inspection of the room for bed bugs and were happy to find no evidence, they did have one of the beds covered with a protective cover. The room looked modern and clean at first glance. However, we found crumbs, dirt and sand on the mattress and inside of the pull out sofa. This was discouraging since we drove a long way and were very tired (it was after 11pm). We contacted staff right away and they apologized and offered another room, we did have to drive back down to the main hotel to get the key. We checked out the other room and the pull out couch was in the same condition and there was a strong musty smell in the room, so we decided to stay in our original room. In the morning, housekeeping came and rectified the problem by replacing the mattress on the sofa bed. I would have preferred they cleaned it and vacuumed again but it worked and they were very nice. The screen door on the patio was also broken when we arrived and someone came out to fix that the next day also. The rest of our stay was great, one short block to the boardwalk, the pool was right outside our door with an outdoor shower and the beds and pillows were extremely comfortable! There were plenty of extra pillows. Parking is tight but staff offered that parking is allowed in the handicapped space to accommodate all guests. We were on the second floor and did hear footsteps and some noise from the neighbors but nothing that we lost any sleep over. The balcony is great with two tables and four chairs, ours was overlooking the Philadelphia Ave. Housekeeping came daily to ask if we needed anything. There were two tv's, one in each room with lots of channels that kept my kids busy when needed. The rooms are separated by a small kitchen, stocked basically, and large bathroom with a jacuzzi tub. For my picky taste, I didn't want my family to use the tub since it didn't look like it was scrubbed but it was clean enough to shower in and very roomy. Overall, I think this suite was a great value for the money and we would probably stay here again. Hopefully management can rectify the issue with the sofa beds being cleaning by housekeeping and a more thorough cleaning of the entire room regarding dusting, vacuuming and scrubbing the bathtub (behind dressers also). Compared to other places we've stayed in Ocean City in the past, this place is probably the best value for the money.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“NOT TO BE SLEPT IN”", "Author": "Koala B", "ReviewID": "UR139024613", "Content": "If you're looking for a place to store your bags while you hit the beach or boardwalk, the Monte Carlo is just the place for you. Otherwise, this hotel was one of the TRASHIEST holes in the wall that I've ever encountered. We walked into the room, and went back downstairs to check out. We originally booked for 3 nights, but we reloaded our car and high tailed it to the Clarion after seeing the room. Although we spent only a few minutes after checking in, the staff went \"????????\" when I came down to talk about a refund. I ended up only getting a refund for 2 nights--therefore I had to pay for 1 night. Im not griping about that, it does mention having to pay 1 night in their cancellation policy. Please see pictures, stay away from this hellhole. I wish someone had written this review before I sacrificed $170.00.", "Date": "August 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Altoona, Pennsylvania", "Title": "“Nicer than expected”", "Author": "Tiffany G", "ReviewID": "UR138702366", "Content": "Stayed here for one night with family. Our room was listed as a city view but when we went onto our balcony we had a very beautiful view of the bay and the ocean. The room was clean and I loved the colors. The walls were a creamy peach and a light greyish blue with dark chocolate furniture. It was very relaxing. I had never stayed here before so I was very worried about how the room would be but I was very happy with it. It is located near a good part of the boardwalk, has a nice rooftop area with a pool and jacuzzi and an area to just lounge. Front desk was nice. Inside pool was very small, it looked like people were just using it to wash sand off of them. There was only one elevator and it was very slow, but there are numerious locations for stairs if you choose to use them instead. Parking, isn't the greatest. It's across the street and another location for parking further down, if you are going to stay here I would recommend paying the twenty dollars for a reserved spot near the hotel. My only complaints about our room are the coffee pot was filled with water and coffee grounds and there was growth inside that showed it hadn't been cleaned out in at least a week. (however there are numerious places to buy coffee near by). Also on the back of the door in the hotel room it says the hotel is a smoke free hotel no smoking in or outside of the hotel. A man two rooms down kept smoking on his balcony, because of it I couldn't enjoy my balcony as much as I would have liked I called the front desk to say something about it and was informed it was okay to smoke on the balconies. If they are going to list themselves as a smoke free hotel they need to be a smoke free hotel. Other than those two things everything about our stay was great. I would definately stay here again and I would recommend it to those traveling down that way.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bethlehem, PA", "Title": "“Above average beach hotel room/property”", "Author": "JoelH549", "ReviewID": "UR138471097", "Content": "Keep in mind this place is one block from the beach just behind the boards on 3rd st. This is a great place to be if you like the business of the city, boardwalk, bars, beach, or any combination of these. We booked this property for the second time a week ago because it is nicer than most other hotels in that area. We wanted to be able to walk to a lot of bars and be within a few blocks of home base. The Hotel Monte Carlo fit perfectly. The room was still on the expensive side but a good value compared to others in the area. The room was clean and in good repair. King room with a jacuzzi tub by the bed. Nice balcony although it overlooks other hotels. Roof top pool was much nicer this year(only 3ft deep but big). It was not crowded and the breeze up there is nice when it's hot out. There is a tiny indoor pool that is open until midnight which is nice when you return to your room after a sweaty walk on the boards. The staff is nice and attentive. We enjoyed our stay very much and look forward to next year.", "Date": "August 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "College Park, Maryland", "Title": "“Perfect location with beautiful rooms to choose from...”", "Author": "david_e_14", "ReviewID": "UR138385230", "Content": "I never go to Ocean City, MD but this was a special occasion. The Hotel Monte Carlo caught my attention because of the way the room looked. It looked modern and clean. I was very happy with our stay there. The in room jacuzzi was an awesome addition to the room. The hotel sits very close to the beach, its basically ocean front. The parking situation can be a little disappointing. Also the hot tub on the roof was out of service during my stay which was unfortunate. The indoor pool was nice and warm. It was perfect due to the fact that the outside weather was a bit more chilly than expected and very breezy. I highly recommend this hotel. They were still undergoing some renovations during my stay so it may be even better now. Go check it out...", "Date": "August 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Federalsburg, MD", "Title": "“Nice Hotel”", "Author": "LisaB1966", "ReviewID": "UR137346028", "Content": "We had a nice stay. Clean newly decorated room. Small fridge and microwve. Close to the boardwalk and the beach. Parking is terrible but so is almost every place in that area. The pool was having issues during the time that I was there but we went to the beach every day. Great family vacation.", "Date": "August 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, Pennsylvania", "Title": "“Great hotel & location”", "Author": "Meowmixed", "ReviewID": "UR137182237", "Content": "Not sure where some of the bad reviews are coming from. We stayed for three nights and had no problems whatsoever. The front desk staff was courteous and helpful and even the maintenance man was super friendly. Clean room, clean bed, clean bathroom and we loved that the jacuzzi was in the room instead of the bathroom. Parking was a little tricky but not a problem and the location was fantastic. We would definitely stay here again.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Always nice”", "Author": "lisamshortt", "ReviewID": "UR136774683", "Content": "Rooms have been updated nicely. Love the rooftop hot top and pool. We love the rooms with tubs although we have rented both happily. It is our prefered hotel and we go to oc alot our teen girls love the location so close to the boardwalk. Staff is nice and remembers us many times, (also gives us orioles games score because they have heard us talking about it) the one and only complaint I have is that the lobby and elevator smell of old subway subs because there is a subway store attached so not really hotels fault .....really like this place wish i could buy a time share here :)", "Date": "August 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“No Bed Bugs here”", "Author": "dontastical", "ReviewID": "UR136010230", "Content": "After reading these past few reviews was scared of checking into hotel. Asked front desk about the issue and they produced a document from local health dept that said there were no bed bugs. Apparently some jilted customer who wanted a refund began these postings. I can safely say no issues at all why we were there. Room was clean and staff was great. Parking was interesting at times but all in all with the price and all the things the hotel offered we are glad we stayed. I wish the people posting reviews like that would think what that kind of stuff does to families like mine who read it and how it made for alot of aniexty that was needless We will be back and I thank the staff for taking the time to address our concerns with us.", "Date": "August 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jersey Shore, Pennsylvania, United States", "Title": "“Wonderful service”", "Author": "Ruth C", "ReviewID": "UR135843179", "Content": "I had a very favorable stay this past weekend. We stayed at the suites located between 11th and 12th street. The front desk staff were amazing and so friendly. We had a small probelm with our toilet flushing and when we called the front desk, they sent thier maintenance man over. He was friendly, explained what the problem was, switched out the problem part, and apologized for any inconvenience we may have incurred. He was a delight. We found our room very clean as well as the pool. I will be booking my next stay in Ocean City here.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cleanest hotel in Oc”", "Author": "dontastical", "ReviewID": "UR135628271", "Content": "Can't believe some of the other reviews I've read. This is our fourth time here and has always clean and great customer service. I'm not sure these other reviews slamming hotel are accurate. One day while exiting lobby i actually heard a guest tell the front desk if you don't refund my money I will post bad review on your hotel. Sounded more like blackmail to me. The staff at the front desk was very professional in dealing with the irate guest. Upon entering hotel we were greeted by the staff each and every time. This place isn't the Hilton but I stayed there once and can tell u I paid double only to have poor customer service. Since than we have always stayed at the hotel monte Carlo.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Filthy filthy and filthy. Under couch bed was garbage and wasn't vaccuumed . We looked in mattresses and there were black specs ”", "Author": "Masjsr", "ReviewID": "UR135553735", "Content": "Filthy filthy and more filthy !!!!!!!! Don't stay here! We have three children and the place was so disgusting . Couch bed was gross. Garbage was under neath couch bed. Black specs were all over mattresses I'm assuming from fecal matter from bed bugs. We got a full refund . We had to get out of there! Thank god we looked at room first or else we would have been bringing home bed bugs i think! Check underneath mattresses before u commit to your stay.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harrisburg, Pennsylvania", "Title": "“Phenomenal Stay!”", "Author": "PandaMia", "ReviewID": "UR134987412", "Content": "The Hotel Monte Carlo and it's staff get HUGE kudos from me and my husband! We had stayed there a few years ago, and had a nice stay, but this visit was even better as they have COMPLETLY redone all their rooms! This visit, we got a king size room (as last time, but), with a jacuzzi! Not only was the jacuzzi NOT in the bathroom--we could hang out in the main part of the room, while IN the jacuzzi, AND watch TV! It was a hot week in OCMD, so there were moments where we enjoyed the cool indoors, such as mentioned above. BUT, when we roamed outside, we got to enjoy the jacuzzi on the CLEAN hotel rooftop, as well as the sparkling waters of the rooftop pool! One evening, we were able to enjoy a movie at the pool area, compliments of the hotel! (another plus was having GREAT seats to watch the evening 's fireworks from the bay!) Some hotel guests had complaints of things that really weren't issues...my thinking is they just wanted a free stay...but all of their complaints were our applause to how well the hotel was run! It's a NON-SMOKING facility, so our room did NOT stink of stale smokers! And a non-smoking facility means no gross cigarettes butts everywhere! PLUS, they were LESS in price than the competitors all around! Brand new rooms, non-smoking facility, hotel wide wi-fi, kind and quick responding & knowledgable staff...OUR KIND OF PLACE!!!! All in all, I would TOTALLY suggest this hotel! It's close to the boardwalk, the beach, De Lazy Lizard, Fat Daddy's, and right outside is a bust stop, so EVERYTHING in Ocean City is just a short trip away! The Hotel Monte Carlo is DEFINITELY someplace we'll be staying on our next trip to OCMD! Thank you, all, for a sensational stay, a great trip, and in the end, RELAXATION!", "Date": "July 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manassas, Virginia", "Title": "“Average hotel, great location in Ocean City.”", "Author": "Manassas_VirginiaGlw", "ReviewID": "UR134027150", "Content": "We found the staff friendly and helpful. I was worried that the room might be hot as it was over 100 degrees last week in Ocean City, but the AC worked great! The beds were very comfortable. Glad we were on the second floor so we could take the stairs, seems like there were always people in the lobby waiting for the elevator. This hotel is OK, we had a great time in OC and slept well at night.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Old dinge, no customer service! Broken aminaties”", "Author": "amberVacationTip", "ReviewID": "UR133750968", "Content": "Fell from a broken steep into the pool. Scared to get stuck in the elivater it onlt worked half the time. No carts available to move bags to or from room. Housekeeping was the best. People were so nice.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Crosswicks, New Jersey", "Title": "“Always a good stay!!!”", "Author": "bronzeindian", "ReviewID": "UR133529038", "Content": "Went June 28th-30th. This was our 3rd time staying at the hotel, and the 1st since the renovations and remodeling of the hotel. As before, the location is PERFECT!!!! Boardwalk is just up the hill (very short distance) and is dead smack in the middle of all the attractions. The renovations gave the rooms sort of a Marriott feel than before. Before the rooms were a little dated but, what everyone doesnt seem to realize is that your paying for location. Nothing in Ocean City Maryland have Ritz Carlton qualities. If you're looking for that, then your sadly mistaken. All the places that are down there are hotel/motel quality. And Hotel Monte Carlo is hotel quality. If you're looking for a great afforable place in a prime location, Monte Carlo is it!!! Did I mention that returning guest receive a discount on their future stays????", "Date": "July 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Okay Hotel; Poorly Run”", "Author": "Net212", "ReviewID": "UR133056466", "Content": "We stayed at this hotel last week for vacation. I was prepared for poor management especially after reading the manager's responses to negatively written reviews on this site. The hotel is just off the Boardwalk which is good. The street view really is just a view of the street, there is another hotel blocking any glimpses of the ocean. There is also a bar at the Plim Plaza that plays music pretty loudly on a daily basis so if you're staying street side be aware of the noise. The location is great, easy access to the beach and Boardwalk so it has that going for it. The lobby is extremely small. It's really just the office however, you need to walk through it to get to your room. There is only one elevator which wasn't too bad because the hotel wasn't crowded however, around 2 or 3 in the afternoon there was always a line since that was when check in time was. The manager seems kind of cheap. We noticed that there is a very minimal amount of staff, perhaps why people's rooms don't get clean and if you needed something there was a good chance they couldn't help you. The maid service was never prompt. We left the room extremely early a lot of the days and would put the \"maid service\" sign up but would return a few hours later to see that the maid was still working at the other end. We noticed one man who was an employee at the hotel who was extremely rude to customers. I was in the elevator with him a few times and when people got on the elevator with sand on their feet he'd start talking about the audacity of them coming into the hotel with sand on their feet and that they should have to clean it up. This was after they left which made me really paranoid he would talk about me after I left. Overall, this hotel is no frills and absolutely nothing special. If you stay here be prepared for poor management and a lack of hospitality. It's basically just a place to go and sleep in, nothing more. You get what you pay for, nothing above that.", "Date": "June 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Another great stay”", "Author": "dontastical", "ReviewID": "UR132056251", "Content": "Another fantastic stay at my fave ocean city hotel. Location is just off boardwalk. We didnt move the car the entire time we were there. With a couple of kids loading and unloading the car can be a hassle sometimes but the monte carlos location downtown ocean side is the main reason we stay there everytime we come go to Oc. Rooms are very new and clean. Can't beat the prices for all u get including muffin and juice breakfast daily. Staff an mgmt have always been great.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Huntersville, North Carolina", "Title": "“worst management ever”", "Author": "151coreyt151", "ReviewID": "UR131841800", "Content": "I was very disappointed with the hotel management. The Manager of the hotel was rude and very unprofessional. Our room did not get cleaned which was no big deal but the next day, I went to the front desk to ask them if they could please make sure the room would be cleaned this time and the MANAGER told me that I needed to find the house cleaners and tell them myself. What kind of hotel says that to a guest? Secondly, they did not put enough towels in the room so I called down to the front desk to ask for some more towels and I was told that if I wanted towels, I had to come get them myself and that they would not bring them to our room. The management made what could have been am ok hotel horrible to stay at. I travel about 150 days out of the year and so I know what to expect from a Hotel service and this is the worst experience I have had to date. Now to show you that I am not just pissed off, I will let you know that the location was great. The rooms, when cleaned, were clean. The shower had no water pressure and the fridge had a bad smell inside. The overall experince would have been rated as average if I was not disappointed in the staff.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Nice hotel for the most part”", "Author": "BrittanyZ", "ReviewID": "UR131519511", "Content": "My boyfriend and I stayed at this hotel this past weekend. Upon arrival, we were told that we each needed to have a $75 security deposit that would be returned to us later after first taking $10 out of each for cleaning purposes. This was because we were under the age of 25, but we were not there for senior week purposes (We are 23). We weren't told of this over the phone in advance, so we had to run to an ATM and get CASH for the deposit. We ended up getting the money back at the end of our stay after waiting 20 minutes for them to check our room. Besides that, the stay was good. The room was nice. We had a king bed one on the second floor. Bed was comfortable, shower pressure was good. Housekeeping was quite nice as well and made sure we had fresh linens daily and made our bed. The garbage truck Comes at about 5:30AM each morning, so be prepared to be woken up. The location was great. Not ocean front, but was a short wall out the door. Wish there was another entrance besides the one in the lobby. Overall, not too bad and a good price.", "Date": "June 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Future brides beware”", "Author": "travellingtator", "ReviewID": "UR130803580", "Content": "My mother and I attended the ocean city bridal show because my fiance and I want to have our wedding in Ocean City in September 2013. A representative from the Monte Carlo was there with pictures of the rooms and the roof top pool. My mom and I were excited because it seemed the perfect place to hold our reception. We went to the hotel and check out a couple of rooms and the roof top pool. We've been trying to contact the hotel for the last 3 weeks to try to book the pool and a bunch of rooms for our wedding (we all will be travelling from out of town). The manager is always unavailable and he doesn't call or e-mail back. To top it all off, I guess the front desk was tired of us calling because I was hung up on. This was the final straw. They advertised something that they obviously don't want to offer, and i'll find somewhere else with better customer service to spend my money.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Martinsburg", "Title": "“Not too bad”", "Author": "Lynn B", "ReviewID": "UR129590887", "Content": "My family and I just came back from a 2 night stay at the Monte Carlo. Some of these reviews are misleading. Yes, you do smell bread baking while on elevator, but, who could complain about that? The lobby is smaller than what I am used to and the staff was wonderful. The bathroom was too small for my taste, so I gave the room average rating. You open the bathroom door and the toilet is right there. If someone opened the door while you were in there, it would smack you in the kneecaps. ha.. The room was clean. Not a fancy place, but, a place to sleep.The indoor pool was ok for my youngest to play in while in rained Tthe bed was good, not too hard or too soft. The only real inconvience was the parking. You have to park across the street and walk. It was good for a short trip. We had a pleasant stay.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Updated, super clean, good size rooms”", "Author": "Patricia B", "ReviewID": "UR125309194", "Content": "My family and I stayed here over the recent weekend. From the moment we checked in with the exceptionally friendly and attentive front desk staff up until check out every thing was perfect. The rooms are very nice, they are a good size, the furniture and beds appeared new, the beds are extremely comfortable. The room was very clean. If I had anything negative to say it would be that I wish the indoor pool was a little larger, but this did not in anyway negatively impact our stay. I will definately choose Hotel Monte Carlo again and hope to do so in season when the rooftop pool is open as this looked very nice!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“best boutique hotel I've ever been to”", "Author": "dontastical", "ReviewID": "UR125302815", "Content": "stayed this past weekend. hotel was sold out and very busy with cheerleaders. staff was friendly and accommodating. the newly decorated rooms were very contemporary. stayed at a lot of oc hotels. This was the best by far.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best oc hotel by far”", "Author": "Surfingjets", "ReviewID": "UR118420166", "Content": "Very clean family friendly hotel. Hotel was located just off boardwalk in downtown ocean city so everything was within walking distance. Hotel rooms were updated and nice flat panel tvs. Will def stay again", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Morristown, New Jersey", "Title": "“DO NOT GO HERE”", "Author": "susan b", "ReviewID": "UR117753319", "Content": "This hotel is awful and the staff is terrible and are not helpful. There are better hotels in the area that are of quality! Do not waste your money!!!!", "Date": "September 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cleanest hotel in ocean city”", "Author": "Steelersfan75", "ReviewID": "UR117656138", "Content": "Last year stayed at a large ocean front propert that was dirty. This year stayed at the hotel monte carlo on 2nd st. And what a great surprise. Staff was very helpful. But the room itself was very clean and spacious. Could t believe last year we spent double on a peppery that was so dirty and this year spent alot less and got a much higher quality hotel. Go figure! Outdoor pool and hot tub on roof deck were fantastic. Indoor pool a little small but just right size for the kids to splash around in. They also offered muffins and juice in the morning which was great with the group we had with us. Location on the boardwalk doesn't get any better. We will be back. !", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“woke up to bedbugs!!!!”", "Author": "kimberly m", "ReviewID": "UR117567084", "Content": "What an awful experince we had here. I was completely disgusted when i awoke at 4 am to change my 5 month old daughters diaper. I laid her on the spare bed and as i was changing her, i looked and saw these little bugs crawling on the bed.. i picked her up so fast and immediately woke my boyfriend up and told him that we have to get outta here.He thought i was nuts til he got up and saw them for himself. He then googled them on his phone and saw that thats what they were. We pulled our sheets down in the bed we were in to find blood spots all over the sheets, at this point, i was already packed up and he was on his way to get the car. By this time it was almost 5 am and we are driving around ocean city wasting time til we can get in to the hotel to talk to a manager. Needless to say, the owner/manager was the biggest jerk ever and would absolutely not refund our money until the \"inspector\" came and verified that they were definitley bedbugs. So i called the chamber of commerce who directed me to the board of health, who i believe went out to inspect..sure enough, we got our money back, it took two days but we got it back!! Do not waste your time here, it isnot worth it. The manager actually even said himself, \"if i gave everybody their money back that complained, i'd be out of business.\" what does that tell you?? We were even willing to suck up that nites stay but we had already paid for the next 3 nites..all we wanted was the money back for the next 3 nites,hewasnt even budging at all!! Terrible customer service if you ask me!!! We were not giving up til we got our money back.", "Date": "September 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Not a clean hotel”", "Author": "ashyden", "ReviewID": "UR117150467", "Content": "Stayed just over night. The bathroom was filthy. Looked like dried vomit on the back of the bathroom door. Beds were uncomfortable. The bill statement noted that there were showers and bathroom facilities to use after you check out. Couldn't find them anywhere. Not a good experience. Very dissatisfied. Will not choose them again.", "Date": "August 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Worst travel experience ever.”", "Author": "Vale19008", "ReviewID": "UR117024387", "Content": "I was looking forward to trip to oc very much. That was until I saw where we were staying. I have stayed in alot of motel/hotel room over last several years but I can honestly say none have compared to this. The first thing u notice when u walk in is the smell of the lobby, it is disgusting, then the service at front desk, they only speak to u if really necessary. Taking the elevator or stairs are equally as disgusting with the dirt and smell. The rooms are nothing like the website. We booked a queen or king size bed and ended up with a full. The room and smell and uncomfortable. We were booked to stay 2 nites but ended up leaving after one because it was to uncomfortable to stay not to mention the noise that comes from the bar across the car park that lasts well into the nite. Overall it was worst weekend break ever.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“LOVE IT!”", "Author": "Sunsation22", "ReviewID": "UR116919942", "Content": "My boyfriend and I are currently at this hotel and we LOVE IT! This will be our third night here, we were initially only planning on staying for two nights but it was so nice we decided to stay longer. The location of this hotel is great, the staff has been great, and the pools are both nice. They aren't big but they're very comfortable and not too crowded! Walking distance to great restaurants and right near the boardwalk. Great hotel for the price! Staying in a King room, city view. Bed is comfortable and room is clean. Only complaint is the live music at the pool a few hotels down gets annoying. Parking is right across the street and there is an overflow lot a mere 2 blocks away... very close and very convenient.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Glen Burnie, Maryland", "Title": "“bike week”", "Author": "wendy c", "ReviewID": "UR116830639", "Content": "poor parking for bikes.... was not organized and threatened to tow the bikes because they wanted parking for cars in spaces that weren't marked.... won't be returning!", "Date": "August 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Would definitely stay again!”", "Author": "Lizzynyu", "ReviewID": "UR115554950", "Content": "We just came back from a family vacation and stayed at the Hotel Monte Carlo. We've been to Ocean City a few times and this is our first time staying there. The hotel staff was very friendly and accomodating since the moment we arrived. The hotel was very clean and the room was a very nice size for the price. The boardwalk and beach were less than a minute away. The pool was very nice although there should be a bathroom up there. We didn't try the continental breakfast but we heard it wasn't much. But you couldn't beat the price considering where the hotel was located. We will definitely be going back next summer!", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Southern Illinois", "Title": "“Would stay here again!”", "Author": "travelnuts2010", "ReviewID": "UR115487641", "Content": "Just returned from a family vacation to Ocean City, Maryland where we stayed at the Monte Carlo. Hotel is a 30 second walk to the boardwalk, a must see in Ocean City. The beach is just beyond the boardwalk. I was worried I would not like the beach in Ocean City as I grew up visiting the gulf in Florida with sugar white sands. I was so pleasantly surprised! I loved everything about Ocean City. Such a cute, east coast beach town!! Our room at the Monte Carlo was huge! With two queen beds and a sleeper sofa, there was pleanty of room for the 5 of us. However, the sleeper sofa was very uncomfortable. We took extra comforters from the other beds to create extra padding. The room was very clean and we really enjoyed the balcony too. The hotel only has one elevator, which takes forever on a busy weekend. You're better off taking the stairs. The morning breakfast consisted of oranges and pre-packaged muffins. We started skipping that and visited the local Dunkin' Donuts. We thought the rooftop pool and hot tub was great, beautiful views of the ocean and the bay. For the price and the location of the Monte Carlo, you can't go wrong! We would definitely stay here again.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cedar Grove, New Jersey", "Title": "“Clean, Excellent location, Great price….”", "Author": "ksabia713", "ReviewID": "UR115484936", "Content": "I’ve been coming to Ocean city for a few years now; this was my first time staying at this hotel. We stayed at the 3rd street hotel. It’s a great location, close to all the rides and the beach, and since it’s a block away from the boardwalk it was nice a quiet. They had an EXCELLENT staff, very friendly, very helpful. My son spilt a drink on the bed; I called the front desk and got new sheets in minutes. My son lost his shoe, they found it for me. When we checked out of the hotel, a few minutes later I got a call that we left a camera in our room, I thought it was so nice that they called me, I don’t know that another place would have done that. The pool was clean, the room was always clean. I thought it was a great place, for the price that we paid. Their continental breakfast needs some work, but we plan to go back again next year.", "Date": "July 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Very poor hotel with terrible staff at front desk”", "Author": "1sydneysmom", "ReviewID": "UR115226844", "Content": "Do not stay at this hotel! BIG waste of money! Pics looked great online, but doesnt even look like same hotel! Paint chipping off wall, floor boards sticking out further than wall, tub was dirty,outside pool was filthy &small! Front desk was very rude when asking for a refund & didnt grant our money back! I wouldnt ever, ever stay here again! Do not waste ur time or money! What a waste!", "Date": "July 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“close2evrything...loved it!”", "Author": "kimnpgh", "ReviewID": "UR114960842", "Content": "block from boardwalk, not crowded by hotels. we stayed in oceanview room&had church across from us&town hall on cornor. gave us great views of ocean&bay. great value too. only con kids had was they wished wifi was stronger in our room. strongest signal they got was 1bar(using 4th gen. ipod touch) hudled by the door lmao.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Average”", "Author": "bnfdms", "ReviewID": "UR114790203", "Content": "I stayed at the monte carlo with my girlfriend and my friend and his girlfriend. The experience started off rocky with the front desk check in. The lady was not very friendly unlike the other guy who was there. Then she told us there was a 100 dollar per person security desposit we had to pay. She said it was on the website but we never saw it. It also had to be cash. Needless to say we barely had four hundred in cash to give to them. It was just a big mess. Then we got up to the room it was cleanish. There was a booger on the wall and there were some stains on the linen n wall. Also when you went to the bathroom it reeked of pee. I thought it was just me but my other roomates smelled it too. When room service did come in. They did the bare minimum. Made the bed and changed the towels and left. Besides check in they were very friendly and very happy to explain the hidden fees. Parking is a mess like everyone says so i didnt move my car i walked everywhere. Overall this hotel was average to below average. Prices werent high but werent low either. Probably will never stay here again.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Columbus, Ohio", "Title": "“If you are a family with small kids...please read \"The Suites\"”", "Author": "ineedtolearntosayno", "ReviewID": "UR114746735", "Content": "We just got back from a 6 night stay at the monte carlo suite on 12th street on OC. Lets start with the cons first. 1) The staff who work the front desk(esp. the foreign ones) have no idea how to communicate. One of them kept telling me she was new which was really not my problem. The washer and dryer I THINK was broken, depending on who you talked to. AT BOTH hotels. Their was of dealing with it was to tell you there was a public laundry on 8th street. We learned after we put our money in that it was broken because there is no sign. The housekeeper told us they had been broken for at least three weeks. When calling the location on 3rd they would tell you they didnt know it was broken. Every person we talked to told us a different story. Just put an out of order sign on it. And if it is that easy to take four kids to walk 4 blocks to wait an hour for it to be done...maybe they should try it once. Don't even ask for a manager because anytime you need him he either has left for the day or off the following day.... 2) we thought the suites would be a family place...sleeps 8...perfect if you are traveling with kids...well....also perfect if you are 18 and can split the cost 8 ways...the hotel has no lobby, so there are no employees there, they give you a code to get in the door which can be passed around very easily. So if you like swimming in the pool area with the morning after contraseptive boxes laying around, and if you like getting ice thrown at you from the balconies and enjoy not sleeping because they are still partying at 3am, than it might be the place for you. Cig bud everywhere in the non smoking hotel and beer cans everywhere... Dont get me wrong the week was fine and we didnt have any problems until the weekend rolled around. But it came with a bang and ruined the last part of our trip. 3) We booked early. In Jan to come in June. BIG MISTAKE!!!!! They were offering the same room at 120 less a night than what we paid for it because they were trying to get the rooms filled. 6 nights at 120 less...you can do the math.. When I called, the foreign girl whom I mentioned earlier told me I should have considered it lucky they even had a room when we booked it and when I asked to speak to the mgr...guess what, he wasn't there. So serioulsy wait until about a week before you go..the vacancy sign was lit the entire time we were there....They wont refund your deposit unless it is longer than ten days before your arrival...so I guess book, and 11 days before you go cancel and odds are they will have a room a lot cheaper...720 cheaper to be exact. 4) the location was a great to walk to the beach and boardwalk, but again there were a ton of abnoxious kids and they just ruined everything... 5) the pool they had was beautiful but it was covered and FREEZING!!!! No one was ever in it...wonder why??? The Pros.. 1) the room was beautiful. Very spacious. Held 4 adults and 4 kids very well. The heated water was shocking! Never have I stayed in a hotel where 8 showers can be taken and not run out of warm water. Comfy beds. Jet tub. Deck had two tables and enought chairs. 2) the housekeeping gave us all the towel and washclothes we asked for. And althought we didnt request the service everyday, he was very nice and polite to us and always told us hello. 3)Easy access to the beach and boardwalk. It really is a shame this hotel is in the location it was. I have been to OC many many times over the years and usually stay further down the boardwalk. The teenage/college age kids there just really ruined it for us to the point where we might try going somewhere else. I'm not sure if it was the location or the time of year we went. We have gone this week for the last four years and never remember so many younger disrespectful kids. The location and cost of this location had to play a role! Overall the hotel was very nice but I would NEVER stay there again. They need to kick out the kids and get some staff to maintain the chaos there a little better. If I rated based on the kids, I would had given it a 1 but really the hotel is beautiful. And based on the look of the room I would give it a high rating. But who wants to spend 2200 to sleep in a beautiful room next to teenage kids who paid a lot less and are disrespectful...", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Not worth the money, will never return.”", "Author": "mkcheer", "ReviewID": "UR113331671", "Content": "We booked this hotel because it was close to the inlet for our daughter's soccer tournament. What a mistake! There is \"free parking\" but it is across the street or 3 blocks away, you could pay $20/day for onsite parking. There is only one elevator in the hotel which was always busy and dirty. The hotel room appeared clean, but was clearly the minimum. Our room has 2 double beds, which seemed like the smallest double bed ever. It made me wonder if they had any queen beds, as none of our friends got queen beds, even though they advertised double/queen on my reservation. Sheets were coarse and the comforters were disgusting with burn holes in them. The towels were extremely cheap, and they made a note of saying \"do not remove makeup with towels, if it is soiled, there will be a $3/towel charge.\" The towels weren't worth $1, let' alone $3. There were no icea machines (because they had fridges), but you could buy ice. Again, it seemed as though they were nickle and diming you. When we arrived the AC and fridge were off (to conserve energey), which seemed OK, but the AC unit could NOT keep the room cool, despite it being on high the entire stay. The hot tub was dirty and I didn't even want to change going in. The outdoor pool was nice, but the \"indoor\" pool was so microscopic small, I mistook it for the hot tub. What a joke. The staff were friendly, but honestly, it didn't matter. I paid $240/night on the weekend and friends paid $100 less per night for a nicer hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chestertown, Maryland", "Title": "“Clean, Friendly Staff, Fun”", "Author": "28poole", "ReviewID": "UR112188549", "Content": "I had read a few of the negative reviews and the price was one of the best in the city, so I was a bit hesitant to stay here. I have to say that I'm very glad that I did, and my wife, daughter and I will definitely stay there again. The rooms and common places were clean, the front desk staff was friendly and attentive, and there were 2 pools, which proved to be a very useful. From the beds to the bathroom, the room was very clean and nice. The front desk staff was always very polite with us, and one young lady proved to be very polite and composed when an irrationally upset guest screamed at her saying that she \"had lost sleep\" over the parking situation. To address that, the spaces/lot easily fit my full size Dodge Caravan with no problem and the lot was literally 30 feet from the hotel. Unfortunately, it sounds like another guest must have damaged her car, which I firmly believe the hotel cannot fix unless they provide free parking lessons with every stay. There are also VIP spaces that we chose not to pay extra for. The roof top pool was great, but my 18-month old and I were cold due to the windy conditions. In response, we just headed downstairs to the indoor pool, which was nice and warm. All-in-all, I feel like we had a 3-4 star experience for a 1 star price. Thank you again for a great stay.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Hidden issues”", "Author": "Sweetlyaimless", "ReviewID": "UR111370850", "Content": "First off the hotel is clean and neat. We did not have any problems with it. However after booking on hotels.com, and paying a decently high rate, when we checked in we still \"owed\" a resort fee. Which actually added up quite quickly. I still don't think that's quite right and will be an issue I'll call hotels.com on. Secondly parking is awful. When ww checked in we were told there were two parking lots. One across the street and another 8 blocks down. Well after parking at the further away one we discovered it was \"preferred\" parking and will be towed with out that special pass. So your options are try to find parking across the street in the total 20 spaces or pay the extra 20 bucks to park further away. There might be another lot, but as of now we haven't found it. Overall the hotel was nice and if you want to be steps away from the boardwalk it's great. Just expect to pay a lot of extra fees. Oh ya and there is no ice. Which is just weird. :)", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“It was just a plesanr stay.”", "Author": "paintlover77", "ReviewID": "UR111147760", "Content": "The rooms were clean. The service was great. I can't'wait to go back.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lititz, Pennsylvania", "Title": "“Great stay AGAIN !!!! Always a pleasure to go to this hotel !! )”", "Author": "mrcards58", "ReviewID": "UR110971872", "Content": "My wife and I stayed here for most of the week again this year. We try to visit Ocean City at least once a year and have been coming down the week of our anniversary - which is the week between the car show and memorial day. As usual, we booked the room with a king bed, jacuzzi.... and we had a great room once again. The rooms are great value and only having to walk out the front door and around the side of the building to be on the boardwalk is fantastic. I always park in the lot directly across the street and save the $20 a day fee that is charged to park under the hotel - I have never had a problem. Rooms are clean....staff is friendly.... and we always get a great discount by booking online directly from their website. If there are ever any problems during our stay - the staff resolves them immediately and considerately. Nice pool, hot tub and picnic area on the rooftop as well.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Crosswicks, New Jersey", "Title": "“Good Value and Great Location”", "Author": "bronzeindian", "ReviewID": "UR108661652", "Content": "This was our 2nd time staying at the Monte Carlo. I've noticed a lot of mixed reviews about this hotel and was very surprised. I am sure that those who have encountered problems during their stay may have happened, but for the most part this hotel is nice! Now if you are a person looking for Ritz Carlton quality at ANY ocean/beach hotel or motel, well, you will never find it at ANY of the properties located in Ocean City Maryland! But if you are looking for a good/great value hotel that is clean, has the basic amenities, a pleasant staff and that is centrally located right smack in the middle of the action spots on the boardwalk then the Monte Carlo Hotel is for you. If it was all that horrible the 1st time we went, we would have never came back to stay for a 2nd time.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Best Hotel Value EVER!”", "Author": "DCBBW", "ReviewID": "UR106503294", "Content": "This was my second year staying at the Hotel Monte Carlo and I was not disappointed again. For the prices they offer, you are wondering what is the catch, but it is wonderfully located, large spaciious rooms that were very clean and I love the indoor pool. THIS is my hotel of choice for my OC vacations.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pasadena, MD", "Title": "“Very Vanilla”", "Author": "cindycPasadena_MD", "ReviewID": "UR103630555", "Content": "We stayed at the Hotel Monte Carlo this past weekend. The hotel staff was extremely friendly and the room was clean. Don't go by the hotel website because it makes it look more upscale that it actually is. Very vanilla. The room has the basics but no more. Standard beds, standard bath and a small kitchenette. Some suggestions that I would make to bring it up to par with other basic oc hotels are: furnish icebuckets and ice for the rooms ( we were told to make ice in our freezer w/ the ice tray however they only provided one tray that was very very small. we were also told that we could buy bagged ice at the local 7-11 however that would never fit in the freezer), need a hook in the bathroom to hang wet bathing suit, need some kind of glass or paper cups on the room( we had to go down to the desk to ask for cups and they asked if 2 was ok, i asked for 4 and that was ok. they acted like they were rationing them per room ) and the chairs on the balcony need a major upgrade- very uncomfortable. The indoor pool was about the size of a large hot tub. More than 5 people and it would be crowded. The parking was quite unique as they had about 8 spaces under cover and just outside the lobby not including the handicap spaces. The rest of the spaces were across the street which is not unusual for OC hotels. However, if you wanted to park in the spots undercover ( not including handicap) you were required to pay an extra $20.00 per night to park there. I have never heard of a parking fee at any hotel in OC except this one. The handicap and parking across the street was free. Would I stay here again? Probably not. MY husband and I like something that is not so vanilla. All in all the stay was great but the hotel is not our cup of tea.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greencastle, Pennsylvania", "Title": "“Great value for off season visit.”", "Author": "Wiestling", "ReviewID": "UR102853137", "Content": "Staff was helpful and friendly. Rooms very clean and comfortable. Location ideal for downtown. Only thing better would be oceanfront.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great service, great rooms, great value, great location”", "Author": "bnj102106", "ReviewID": "UR102084482", "Content": "The hotel was right on the boardwalk and had a great view of the ocean. The people at the counter very friendly and helpful. The rooms were very clean. We always stay at this hotel when visiting ocean city. Its such a great deal and such a nice place.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore,MD", "Title": "“The value can't be beat”", "Author": "krisnjay", "ReviewID": "UR101798888", "Content": "The guys at the front desk were always friendly. We even had a mix up with the rooms which was completely our fault and they cleared it up quickly. One of them even gave me advice on where to eat and didnt do me wrong. The room was large and had plenty of amenities. It is located right on the boardwalk and is right in the middle of everything. The room was very clean.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Abingdon, Maryland", "Title": "“What a nightmare!!!!!!!!!!!! Renter beware..................”", "Author": "frankg2813", "ReviewID": "UR101025904", "Content": "We recently stayed at this hotel and what a surprise we got. the first night when we pulled back the bed covers the sheets had sand all over them so we slept on the comforter the first night. When we went the next morning and told the manager he acted surprised that there was sand in a supposedly clean room and made the comment that no one even is going to the beach??????????? Not my problem..............It led me to believe the room was never clean before we were rented the room so he sent up a cleaning lady to put on new bed linens while we were out. Upon returning my fiance' laid down to take a nap and when she woke up she put her feet down to get out of bed and cut the back of her foot on a piece of glass and put a one inch cut on the back of her foot. She then picked up two pieces of glass and we took it down to the manager. The boy behind the desk spoke to the manager on the phone and he came back and acted as if we planned this out. We went back up to the room and looked under the bed to find more glass there and behind the dresser, we then called back down to front desk and told him to come back up. He came up and we showed him the glass, his response was we have 15 minutes to vacate the premises and he will refund that night stay. We have traveled all over the U.S. and outside our country as well, and have NEVER experienced this before. We then drove around to find a new room for the night, We are very disappointed in the stay and the way it was handled. We have pictures and the bloody glass. We appreciate a quick response thank you", "Date": "March 21, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ithaca, New York", "Title": "“Worst customer service ever encountered!”", "Author": "evenparalan", "ReviewID": "UR97953773", "Content": "I had to cancel my reservation because we were trapped in a different state due to 14 inches of snow falling over night. Non-emergency travel was prohibited. When I called the Monte Carlo of Ocean City, MD, and talked to the manager, the following statements were told to me: (1) You're lucky I even wasted 15 minutes on the phone with you, (2) No refund for you! EVER! then the manager hung up on me.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Terrible”", "Author": "fdsmith", "ReviewID": "UR89006767", "Content": "First of all, this hotel pays guests $25 to write good reviews. They refund their credit card after a guest posts a good review. If you have a problem don't expect to talk to anyone that can actually do anything about it...the manager, Don, is always unavailable. This place cares nothing about customer service. This place seems terribly mismanaged. They seem to think since it''s a vacation spot that they'll book rooms whether or not you enjoyed your stay. Overpriced and poorly managed. I will never stay there again and would never recommend it to a friend.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northport, New York", "Title": "“Very convienent, just perfect”", "Author": "pilchard3", "ReviewID": "UR84494252", "Content": "This was our families first vacation together ever--and we had a really great time. The hotel was clean and very close to the boardwalk--just one block--the rooftop pool was perfect for the kids and the staff was very helpful.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great for family with small children.”", "Author": "Jill052204", "ReviewID": "UR83615549", "Content": "My Husband booked the suites on 11th st for the dates of Sept 27- 30th. We enjoyed our stay. We had a suite with 2 double beds and a king size bed and a sleeper sofa. Our bathroom was huge we believe it was a handicap access. The full frig and 2 burner stove and microwave were great. The downside was we didn't have a strainer. Being within walking distance of the boardwalk with a 5yr old and a 3yr old was very helpful. We definiley will try to stay here the next time we visit OCMD.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "East Rutherford, New Jersey", "Title": "“Awesome Hotel - Awesome Location”", "Author": "Nora8Nitin", "ReviewID": "UR78887969", "Content": "Our experience at the Monte Carlo Hotel was wonderful. Our stay was 8/28 - 8/30. It's a great hotel and very affordable. The staff was very helpful and pleasant. They helped with recommendation on restaurants and day activities. We were warned about parking before we got there, but parking was no problem at all. The front desk gave us a parking pass where we left our car the whole weekend with easy access to it if necessary. The location of the hotel was perfect! Just a block away from the boardwalk. I would recommend this hotel to all my family and friends.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Woodbridge, New Jersey", "Title": "“Good value and location for the money”", "Author": "hurley8792", "ReviewID": "UR78839966", "Content": "My girlfriend and I chose this hotel cause our vacation was a last-minute plan, and the hotel monte carlo was one of the only hotels in the area we wanted to stay at, so our choice of hotels was kinda last minute, however it was indeed a good choice for sure. The check in process was easy, parking was at 1 of 3 lots which the farthest was approx 1 city block away and not considered far at all in my opinion. The rooms were clean, the cleaning service was neat and fast, and the hotel seemed to be decorated very nicely. To be picky if you wanted to be were two small noticable problems; that i could really find we're that there was a slight chlorine smell hindering form the indoor pool, but nothing out of the ordinary considering its location. the other problem was the elevator, which there is only one and it can seem like its taking forever and sometimes the stairs (which the top level is only at floor 6) would be the faster more reliable mode of exiting or entering the hotel. But other than that it was in a great location, with friendly staff, and at moderately reasonably rates for a nights stay, especially if you can book and get the discounts online. I would recommend this hotel as a good leisure weekly stay and will be back if i decide ocean city, md is we're my next vacation spot is.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clearfield, Pennsylvania", "Title": "“OCEAN CITY FAVORITE”", "Author": "diehlam", "ReviewID": "UR77139484", "Content": "We vacation down in ocmd two to three times a year and every year but one we stayed at hotel monte carlo. we stay there for vacation and wine on the beach and love it, its not ocean front but good location for boardwalk and not as expensive as the boardwalk hotels. staff is helpful and gets you want you need if you dont have it. its a clean hotel and over all just a great place, HOTEL MONTE CARLO is where we stay and where we would recommend. check it out yourself!!!", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Perfect suite to stay with your friends and loved one”", "Author": "SHAZZY1125", "ReviewID": "UR77020323", "Content": "The staff was very nice at check in and since we were there early, they even got our room ready one hour before check in. We got to the place and it was spotless and gorgeous. That was my second time staying there because i liked it so much last year. It is very roomy and nice. I will stay there everytime i visit Ocean City MD, because the two years in a row i chose it, they did not disappoint us!", "Date": "August 26, 2010"}, {"Ratings": {"Service": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Best room in the Best location!!”", "Author": "MORG016", "ReviewID": "UR77004732", "Content": "So glad I walked into the Hotel Monte Carlo on 3rd St. Its location is right on the boardwalk, right in the middle of every place I wanted to go. The price was ideal for a 2night stay (unlike any other hotel on the boardwalk) Our room was awesome! It had a Jacuzzi Tub right in the bedroom! (not the bathroom) With great lighting we had a romantic bubble bath. When we got hungry in the middle of the night, SUBWAY was inside the building open till 4am! The front staff were so real with me and super friendly. My boyfriend and I had such a pleasant time were coming back in ONE MONTH! hoping for the same room! see for yourself what Hotel Monte Carlo has to offer!", "Date": "August 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bronx, New York", "Title": "“Disappointed”", "Author": "FirstMMarylandVisit", "ReviewID": "UR76487789", "Content": "We stayed in the Suites on 12th St. We selected this hotel based on a number of factors, one important being WiFi(internet). Internet was not available when we checked in and we were told they were working on it - for three days! On the third day we went to the main hotel (there is no staff available at the 12th street location) and were told the manager Don would contact us. He never did. Hours later we went to the hotel to wait for Don and his response was that that internet service is a free service that guests do not pay for and if we did not like not having internet service we could check out! VERY POOR Customer service. Guest were not told that there was no internet service when checking in to the Hotel and were told they were \"working on it\" when we called. Don told us it was a Verizon problem and they had no idea when service would be restored. He also told us that we should complain to Verizon. I would NEVER stay there again.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“High standards? don't stay at Monte Carlo”", "Author": "lucygirl17", "ReviewID": "UR76117807", "Content": "The pictures you see on the internet are not what you get. The room was ok and the beds comfortable. The place is old and needs refurbishing. Bathroom floor was dirty, especially around toilet. I took tissues and wiped around toilet bottom and got black soot all over tissues. They just run a wet mop around the floor to clean it. Areas around bathroom door and tub were rusting. Our door to room scraped the floor when we opened or shut it. Our phone did not work. Someone came to fix phone and could not repair it. Staff was friendly. One elevator that was very busy and slow. Parking spaces very close to one another in each of their 3 lots. Very tight! Our daughter and children stayed in another room. When they checked in, their door would not close unless you slammed it hard. Called about this and they did send someone to fix it. Wrong screws holding spring hinge on. Repair was successful. Very noisey front of hotel as it is on main street and you hear the traffic all night. Great location, but you have to be prepared to hear late night visitors of the boardwalk going by talking, yelling and cussing. Roof top pool, very nice. Rooms need paint. Refrigerator slow to cool but then worked fine. Would not stay here again for the price of $200 a night with taxes.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hagerstown, Maryland", "Title": "“Love the Hotel Monte Carlo”", "Author": "leeann94", "ReviewID": "UR75475140", "Content": "The front desk staff is warm and helpful. Check in was quick and our room was very clean, as were the refrigerator and bathroom. We stayed at another OC hotel earlier in the summer and it was nothing but problem after problem. The roof top pool is fun for people with smaller kids because the depth of the pool is only 3ft. There is also plenty of seating. The housekeeping folks were courteous and didn't start cleaning/vacuuming at the crack of dawn. They always kept the elevator and tiled floors mopped and free of sand. We will definitely stay there again and would recommend it to anyone. There is also a Subway located in the hotel which was great for a quick/cheap lunch. The hotel is located only steps away from the Boardwalk and Dough Rollers, a great place to eat.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamilton, New Jersey", "Title": "“Best Location, nice atmosphere, relaxing”", "Author": "diavola999", "ReviewID": "UR75167866", "Content": "Everyone at the front desk was pleasant and helpful. The room was nice and neat. It had a fridge, microwave, coffee & toaster. The roof top pool was great, and relaxing after a day at the beach which was only a half a block away from the heart of the boardwalk. We are planning our next trip again! Not really for the hotel, but I just wish we had more knowledge of the activities going on during our stay.There are lots of coupon books for restaurants and excursions. However, I heard about the bonfire and movies on the beach from others travelers. Better Information center needed!", "Date": "August 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Jim Thorpe, Pennsylvania", "Title": "“Disappointed”", "Author": "sacker20", "ReviewID": "UR74544909", "Content": "I guess my expectations were greater than they should have been. Firstly, there is no parking at the hotel. You can park in a choice of a few lots which are located close to the hotel. This was a first for us. We've never had to park away from our hotel. Secondly, the lobby had strong onion odors, as it was located alongside of Subway Deli. Probably no fault of theirs, but what an awful smell to wake up to. The pool on the rooftop was not very clean. What could I say; simply that you can't judge a book by it's cover.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Hotel Monte Carlo turned our vacation around...”", "Author": "PhillyRN2be", "ReviewID": "UR73828763", "Content": "Our trip to Ocean City started off horribly. We arrived to be devastated by the condition of a hotel (name I will not disclose) in which we had a reservations. That hotel misrepresented its establishment on the internet. It was so disgusting, my husband and I forfeited our deposit and slept in our car the first night of our stay. During that night, we searched and found the Hotel Monte Carlo. It was a pleasant surprise. We checked in on the second day of our trip and were greeted by the most pleasant and personable hotel staff. The Monte Carlo turned what initially began as a horrible vacation into a vacation in which we did not want to end. The hotel was visually appealing as well. The lobby was clean and nicely decorated. Our room was great too. Unlike many of the hotels in OC, the Monte Carlo had King size bed suites. The room had a kitchenette as well which allowed us to keep juices and snacks in the room during our vacation. The bathroom was very nice, spacious and clean. Finally, location, location, location....that you could not beat. The Hotel Monte Carlo is situated in a prime location, its right in the middle of all the festivities and activities of the boardwalk and OC in general. You have the boardwalk, restaurants, scooter/bike rentals, shopping, and etc. all at your doorstep. This was our first time staying at the Hotel Monte Carlo and I can definitely say it will not be our last. My husband has already asked when I wanted to go back. We had a wonderful stay at the Hotel Monte Carlo and I can't wait to go back.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Blacksburg, Virginia", "Title": "“worth the money, and great service!”", "Author": "meledoux", "ReviewID": "UR73663578", "Content": "This hotel had great service! All the people were very welcoming and kind. I travelled with my boyfriend for our anniversary, and we're only 19. They let us stay and didn't even charge a security charge because we're under 21. I was very impressed. The location was perfect because, being one block off the boardwalk, the noise at night was much lower.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great rooms and good location.”", "Author": "DonnaDC10", "ReviewID": "UR72414978", "Content": "The rooms are large in size, have kitchen in room also. Hotel is keep clean. Indoor and outdoor are a plus. Hotel staff are very friendly and helpful. Located just feet from Ocean City boardwalk. Leave your car parked and walk for a day of fun.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Winchester, Virginia", "Title": "“Great Location but could use improvements”", "Author": "jagalex67", "ReviewID": "UR72043608", "Content": "The hotel is in a great location for walking to the boardwalk and amusement park area. The indoor pool is basically useless. The outdoor pool is nice but only 3 foot deep. The room was spacious and fairly clean and smelled nice. The A/C system was great and kept the room nice and cool. The staff are very nice. Everybody at the front desk was very helpful, friendly and cheerful. Very nice people there. Parking was tight and cramped. I would recommend this hotel for budget minded travel. The pros better the cons.", "Date": "July 23, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "a-town", "Title": "“BEWARE...BE VERY AWARE...”", "Author": "rip-off-patrol", "ReviewID": "UR71646674", "Content": "This is in regards to several teenage boys that wanted to have a nice week vacation in Ocean City Maryland. I know we all try to let our kids handle things on their own to teach them responsibility. Don't do it with this hotel. A call was made in front of a me and my husband to cancel reservations within this hotels policy guidelines. The father actually dialed the telphone # to the hotel and handed the boy the cell phone to cancel. We know that 6/1 was the last day to cancel to stay within the policy guidelines. My son was ask for a reservation # which he did not have in front of him, so the person on the line pulled it up by the name on the reservation. It sounded like he was having no problems cancelling the resaervation and we thought it was a done deal. He said he was told they would get their deposit back. There was call made on that same evening by my son and he spoke with the same person. He said he and his friends were going to try and come for the week of July 17th(still trying to give the hotel their business) and hold the deposit instead on sending it back and then the boys having to return it if they were able to get together for July week. He said he would call back the end of the week which he did on 6/4 staing that the boys could not all get together for the week of July 17th. He was told he would get his money back, but less 25% and he agreed. He called on 6/7 to check staus on refund and was told that it did not go out yet, nothing about not be refunded. He called yet again on 6/14 to speak with Beth who told him that they would NOT be getting a refund because they did not cancel until 6/4. I was told how rude she was and when she was ask for a supervisor or mangaer my son was told she was the super or manager and the refund was not being sent. It is to my understanding that Beth is nor a supervisor or manager. I have phone records of 2 calls on 6/1, a call on 6/4, 6/7 and 6/14 from my sons cell phone. These were sent to the hotel and they have still decided to keep the boys approx. $700. I received the log and they have all the calls except the two on 6/1. My husband tried to make calls begin 6/15 but never got the general manager. He spoke to Beth and she told him to call the next day and speak with Roshani(hope spelling right). He did speak with her and she was going to look in to it and call him back. Not sure what she was looking in to but after waiting for some time he decided to call her back and was told no refund. Another angry father called and he was able to speak with Don the general manager and got VERY upset becasue the hotel stated they have no calll from 6/1 but only 6/4. The hotel was sent records of my sons cell phone and Don the GM stated that that meant nothing to them. Suggeated that what did we try and canel the reservations twince on 6/1, how stupid Don. The first call was to cancel and the second call was try try and come for July 17th and make your bosses more money then the $700 you kept. Where are these OWNERS, have they read any of the reviews on the mold, stench, crap on the toliets, taking money off of peoples charge cards after being home two weeks and not returning their monies either. They always seem to have an EXCUSE. PEOPLE read the reviews of this hotel. There are some good but the bad ones sounds like the hotel looks for every chance to get EXTRA MONEY. Read the reviw titled \" Monte Carlo Suites are not so sweet', sounds like other teenagers had deposit issues. I would suggest that anyone having problems like we did call the Better Business Bureau, Greater Chamber of Commerce and go on line to the Attorney General of Maryland and completed a complain form as I am doing. I tired to find out who the owners are or have them contact me but I was shut domw on that. Hank said this could only be done through Don the GM(that will gwet me nowhere fast). Don you should be ashamed of yourself and I am sure you will have some lame EXCUSE as always. All the facts are in this review people. The lesson these boys learned, was even when you do the right thing, you can still get ripped off. SHAME ON YOU Hotel Monte Carlo!!!!!!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burlington, Vermont", "Title": "“Great Location”", "Author": "RStoney", "ReviewID": "UR71174798", "Content": "My wife and I have stayed in this hotel 3 times, mainly for the great location. We love being able to walk less than a minute to the boardwalk. The rooftop pool/hot-tub is nice and has a great view.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Verona, NJ", "Title": "“Almost...But Not Quite”", "Author": "EdLuva75", "ReviewID": "UR70911744", "Content": "I stayed at the hotel for 3 nights with my wife and 2 year-old daughter. Like the title of this review the hotel was almost nice, but not quite. PROS: Great location, less than a block from the boardwalk and close to the bus stops. Room and bathroom were clean Rooftop pool was nice and 3' depth was perfect for playing with a toddler. CONS: Only 1 elevator led to long waits. Constant wet floors in elevator and tiled areas outside the elevator. Subway restaurant on the 1st floor made the entire hotel (but not in my room) smell like nasty baking bread 24/7. The indoor pool was tiny and the pool room was very hot, making it unusable. The sliding glass door to the balcony was a mess, old and in need of replacement. This was probably the biggest con by far. It wouldn't slide easily at all, you had to use a lot of force and push back and forth a lot just to get it to move. My wife couldn't budge it most of the time. When you were fortunate enough to get the door slid closed, a lot of the time it wouldn't close all the way and the top was left open a crack. At night even that small 1/4\" crack let in a lot of street noise. With the door closed the noise wasn't a problem at all. It sounded like most rooms had this problem because you could hear the noise of people struggling with the doors all around you. A real hassle. The room itself was ok, with 2 quuens beds, a couch, a small table with 2 chairs, and a small kitchenettte there was plenty of room for the 3 of us. The lobby was very small so it made it difficult to move around if there were people at the front desk. All-in-all, just an ok place. For the price I expected a little more.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“It's Ok”", "Author": "LuvOCMD30", "ReviewID": "UR68853090", "Content": "Went went to Ocean City, MD for a girls weekend. We are in our late 20's early 30's. We go to OC every year. The staff was very nice and pleasant. The view from the pool deck was great and the pool was very nice. The pool was very clean with plenty of chairs to use. The pool was never crowded. The convenience of being so close to everything on the boardwalk was great. The walk to the beach was easy. The carpeting in the guest rooms was new. Both beds in the rooms had 4 pillows on each. The downfalls to the hotel was first the parking. The hotel only has about 8 spaces underneath of the building itself. So if you are checking in on a busy day, like Friday, there is no were to leave your car while you unload. There were multiple other cars at the time of our check in already taking the small 3 car unloading spot along the curb. The parking lot is across the street from the hotel with minimal amount of spaces and the spots are super small. A full size SUV would have a very hard time parking in the space provided. Needless to say, we never moved our SUV thinking that we wouldn't have any spaces available once we returned. There is an additional parking lot available to guests but it is a block away from the hotel. The second downfall to the hotel is that the rooms smelled old and musty. It had an old cigarette smell. We sprayed the room with some air freshener and turned on the A/C. By the next day the smell had reduced. The bathrooms were somewhat clean and needed updating. The third problem was the shower is old. The worn out shower head would not stay in one place in the holder. One other thing to keep in mind is the hotel only has one elevator. So if you are going to be checking in on a busy Saturday I am sure the elevator would be a pain. If we were waiting to long for the elevator we would just take the stairs.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Damascus, Maryland", "Title": "“Thank You Monte Carlo”", "Author": "ksmpuddins", "ReviewID": "UR68438095", "Content": "I just had to write a review, we just return from a week long stay at this hotel and it was awesome! The room was nice sized, clean and relaxing! We spent our 25th Anniversay there and we couldn't be more pleased! The STAFF was so wonderful and helpful, we hated to leave! They went out of their way to serve us. I can not understand why anyone had a problem with the staff (must have been the visitors attitude). I will be back to stay here and I will be bringing all my family. Great location to everything in O.C. I was very happy with our stay no issues at all! Oh and the Subway in the Lobby is amazing!! Thank You Monte Carlo The Miller's", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "baltimore", "Title": "“A perfect family hotel!!”", "Author": "lovestar767", "ReviewID": "UR67133186", "Content": "i stayed at the hotel monte carlo this air show weekend!! we have been staying at this hotel since past few years and we never had a problem!! we have seen a lot of renovations already and it seems to be getting better and better every time. They have a very friendly and welcoming staff ....i would def suggest this hotel to every one especially all the families with teenagers like mine. ..it is close to boardwalk, they have pools ( the beach water is still not warm enough), rooms that are clean and have comfortable beds, staffs with great customer service skills and price that you cannot beat..what else do u need for a memorable vacation!!", "Date": "June 10, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“BLATANT LIES”", "Author": "tonytone85", "ReviewID": "UR66885790", "Content": "I want to confirm that everything lindzloo has said it's 100% true 1) my card was never declined and to say that our card was declined without even knowing exactly what our full name and address is beyond me. I can provide credit card slips and bank statements that could prove in a court of law that my car was NEVER declined. 2)you did not even address a single issue that was mentioned in the review except that \"uneducated guess that our staff is from india\" cleary does not make a difference and not the issue 3)why would we be upset that \"we had to pay to stay\" isn't that the point of a hotel? 4)making blatant lies about your hotel is very unproffesional 5) there was stains check the other dozen reviews that confirm this...when we stayed there we did complain NUMEROUS TIMES and nothing was resolved just told us \"we'll call you\" i mean we didn't even have batteries in our remote and were told that quote \"uhhhh i dont think we have any but we'll call you\" unquote seriously?? i never thought this hotel would stoop this low jesus christ....", "Date": "June 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "wilmington, de", "Title": "“Terrible service, and extremely overpriced for the quality of room.”", "Author": "lindzyloo", "ReviewID": "UR66751428", "Content": "I want to start by saying if this hotel was much cheaper I wouldn't have cared as much about all these things that I’m about to complain about. But for the prices we paid we expected none of the problems we ended up having. Also, I did not report a lot of these things to the hotel while we were there because everything we did complain about to them they did not do anything to take care of or fix. (With the exception of the blonde woman at the front desk who was very nice) My boyfriend and I just stayed at this hotel for my birthday. We wanted to stay somewhere nice but we don't have much money so we were only able to stay 2 nights in the middle of the week. Our room was $270 for 2 nights and from looking at the hotel's website it looked like a great place so we figured it was going to be worth the price. But we were wrong and it was a horrible experience. As soon as we got into the room there was trash on the floor, a bunch of candy wrappers. There was a sour smell coming from the fridge, and water was leaking out of it. There were black stains in the ice trays that looked like mold and when I tried to wash them the stains would not come out. There were stains on the couch, chairs, sheets, walls, and ceilings. Thankfully I always bring my own sheets and blankets to hotels so I didn’t have to worry about sleeping on the stained sheets. There also appeared to be mold (more black spots) on the walls in the bathroom, which also had a bad smell. The towel bar in the bathroom was also broken. Although this is a non smoking hotel there were cigarette burns on the chairs. Both beds in the room squeaked horribly even when you made the slightest movement and were very uncomfortable. There were no batteries in the remote for the TV. I called and asked for batteries but the man at the front desk told me he didn't think they had any but he would call me back and let me know. He never did. $135 a night and we can't even have batteries for the remote? There was a TV channel list in the room, but we did not receive a lot of the channels we were supposed to, and since we never got batteries for our remote we could not try to manually enter in channels to see if we could get them. An Indian girl checked us in and we gave her our credit card and everything seemed to be fine even though her English was almost completely un-understandable. After we went to the beach we came back and our room keys didn't work. When we asked why the woman at the front desk (a different woman with blonde hair) told us they de-activated our room keys because we had not paid! They had LOCKED us out of our room. When we told her we gave them the credit card when we checked in, she told us she'd find out what was going on. Apparently the woman who checked us in never charged our credit card! Although it took some time the blonde woman was helpful and understanding and we eventually got back into the room. The hot tub was also broken as soon as we got there and we asked about it and once again they said they did not know when it would be fixed, and that they would call us and let us know but they never did and it was never fixed. The air conditioner in the room stopped working in the middle of the night, but the next day it started working again. When we checked out at 11am we asked if we could leave our car in the parking lot for one hour so we could go to the beach. Keep in mind check in is not until 4pm so there would not be new guests for at least a couple more hours. The Indian woman told us “no not really”. You would think for the price we paid and all the problems we had they could at least let us leave our car in the lot for one measly hour after checking out but no. I will say that the location of the hotel is good, and the pool/deck area on the roof is great (except for the broken hot tub) and most of the time we had the pool to ourselves, but there were so many other problems it was hard to make the best of it. What really upset me was that this was my birthday trip and not only were we not able to afford a longer stay, but the time we did have there was full of stress that I did NOT want to have to deal with on my birthday. Regardless of the hotel we still had a good time in Ocean City. But we will definitely never stay here again unless they offered us a free room that would be clean with no problems.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awesome two thumbs up”", "Author": "sandylouhd", "ReviewID": "UR66666576", "Content": "Everything was great location. Room the staff was very friendly. Big thanks to Nate. The rooftop pool was awesome they also have an inside pool. We needed to do a little laundry that was great. Close to the ocean and the boardwalk. We give 5* and what a value. . Thank you so much. We will definitely be back and stay with you. Again. Jeff and sandy from Mo .", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Nice spot near the Ocean City Boardwalk”", "Author": "KittyAB", "ReviewID": "UR66379270", "Content": "Its not a 5 star hotel but you cant beat the location. Its only a 1 minute walk to the boardwalk. The staff was very friendly & helpful. The beds are very comfortable. Nice shower. Our room was huge with a balcony. Would stay here again on our next visit to Ocean City.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Overall good, BUT...”", "Author": "Saharah99", "ReviewID": "UR66343357", "Content": "Upon first arrival we were pleased. The rooms were not what we expected but we made due. We had a squeaky bed, but when we notified the GM he sent us a new bed and miniature golf passes...We thought isn't this nice...Unfortunately for us we bought our bikes with us and kept them in our room for the first 2 days on the third day we were told that we could not keep our bikes in the hotel and had to store them outside on the bike rack...BIG MISTAKE...Needless to say our bikes (practically brand new) were stolen. We locked the bikes up, but that wasn't good enough. While the hotel called the police so we could file a police report. We still haven't heard anything...I hope they recover our bikes...So I say all this to say DON'T stay at this hotel with your personal bikes. They may get stolen. On a brighter note the hotel is making updates. If we ever stay here again, I hope the updates are complete (specifically the bathrooms). The hotel has potential to be a really great place.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ECBulls", "Title": "“Hotel Monte Carlo is worth every cent!”", "Author": "ECBulls", "ReviewID": "UR61298284", "Content": "My Family and I had a great experience with the Hotel Monte Carlo. Our room was clean and comfortable and we loved how close we were to the beach and Board Walk. We even had a chance to use the indoor pool which is small but not too small to have loads of fun!", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milford, Delaware", "Title": "“Much better than average and very close to boardwalk”", "Author": "carlag747", "ReviewID": "UR61201928", "Content": "Hotel staff were all friendly, welcoming and helpful. The rates were great. Would definitely stay there again.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Loved it - would stay again”", "Author": "cdjohnson23430", "ReviewID": "UR60748698", "Content": "My husband and I and my teenage daughter stayed in one of the new suites for a mini vacation. It was cozy and comfortable. It felt like home. Nice sized beds and bathroom. My only complaint was that were no doors for privacy to separate the sleeping areas from the kitchen. Everything was new and up-to-date ... the floors, counter tops, furniture, etc. Loved the balcony which was furnished with real patio furniture and not that plastic stuff. It was just a block over from the boardwalk.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Centre Hall", "Title": "“NASTY”", "Author": "PACouple22", "ReviewID": "UR60649225", "Content": "We booked a jaccuzi room with a King size bed. The room appeared to be clean when we checked in. The next morning we decided to straighten up the bed and to our disgust we found a dirty pair of red underwear between the layers of bedding. I called and complained, the man at the front desk said that he would have the bedding changed for us but did not apoligize. The bedding was changed but we found that they did not change the comforter, the underside of it appeared to be smeared with human waste! In the front lobby we also heard another guest complaining that the bathroom in his room was never cleaned and there was still waste in the toilet from the last guest!", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "PA", "Title": "“Great staff!”", "Author": "kagriff17", "ReviewID": "UR47833441", "Content": "I stayed at the Hotel Monte Carlo during the off-season in October. It was my first visit to Ocean City. I wanted a hotel that was close to the boardwalk, affordable and with an indoor pool. The Hotel Monte Carlo was exactly what I was looking for. I'd say the best part about my stay was the staff. They were terrific. They were very helpful to me and very kind to my daughter, who was sick our entire stay. In fact, at one point I went down to the lobby at 2am to find out if there was a doctor nearby and the person at the front desk gave me directions to the nearest hospital. During our stay they helped me find local restaurants and answered any questions I had about the area. I would definitely recommend the Hotel Monte Carlo to anyone else. The rooftop pool was very nice (albeit cold!) and the hot tub, also rooftop, was divine. My daughter and I enjoyed the indoor pool too. My only complaint about the room is that the toaster was broken and they didn't have a ready replacement. It certainly wasn't a dealbreaker for my stay, though. Our room was nice and big and the tv channels were great (we appreciated the Disney!).", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vestal, NY", "Title": "“I would recommend this hotel”", "Author": "traveler2596", "ReviewID": "UR46909435", "Content": "The rooms were clean, the staff was nice and the pool on the roof had a nice view.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "usa", "Title": "“Nice place”", "Author": "siminica", "ReviewID": "UR43603695", "Content": "Nice hotel , beautiful pool on the roof , clean room . Good job 4 the management . BY ; Ionut Simionca", "Date": "September 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“Dirty Rooms and Rude Staff”", "Author": "BeachG0er1", "ReviewID": "UR41463470", "Content": "the Subway attached to the Lobby seems to be the hotels main priority, the keys have the Subway logo printed on both sides. The bathroom had mold under the sink in the bathroom there was hair in the shower from the previous guests. we decided to upgrade to a \"suite\" it was new which is why it was clean i am sure. We misplaced a key in the room and did not have time to search for it, they wanted to charge us $250.00 and the non English speaking Romanian behind the desk was unable to explain why. The manager was rude and cursed at us and would not allow us to go back to the room until he could escort us 2 hours later. the indoor pool was a joke, and the roof top jacuzzi was so small 3 people barely fit.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Baltimore", "Title": "“To stay or not to stay”", "Author": "JourneyGirl22", "ReviewID": "UR40705893", "Content": "I'm not so sure why this hotel cares so much about tripadvisor.com. They give great emphasis on us leaving good reviews on this website. I will hand it to them that they have a very nice rooftop pool. The only downside of it is that it closes, I wish it could stay open twenty-four hours a day. They didn't have awful prices, but they did have awful customer service. I feel like these employees could be better trained in customer service. I have never worked in the customer service industry, but I don't think its too hard to please the customer. The woman who checked us in at the front desk was a tad bit snobby. I was expecting something more like a smile and a pleasant hello. I will not get my fifty dollar rebate for my stay, I wanted to be completely honest with my opinion. For you travelers, September is a fantastic time to stay in Ocean City. Its not too busy and places are still open.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Broomall, PA", "Title": "“Superb view, downtown location and excellent value”", "Author": "ajvandelay", "ReviewID": "UR40130553", "Content": "The registration process was easy and quick. Hotel was located in downtown Ocean CIty as website noted. Check in process painless. Three hotel parking lots within one block (or less) from hotel. Roof top view (including the hotels pool) was magnificent. Our room as very large and immaculate. Less than one block to boardwalk, multiple eateries and beach. We had a great time and look forward to going back very soon. KKlinger.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Glen burnie, MD", "Title": "“Not bad, not good.”", "Author": "John C", "ReviewID": "UR40111559", "Content": "The pictures on there site do not look anything like the room we got. We got a king jacuzzi room. The hotel is a little noisy, but not too bad. The bed squeaks (We are newly weds..) but for $99 after a holiday weekend. not bad.. Also they don't want you to cook popcorn in the room (wife loves low fat popcorn..). Cant get on the roof after the pool is closed (would have been nice to go up near the pool and sit outside and smoke a cigar or drink a glass of wine) Rooms are a little run down. Could use some new lamps and carpet is a little ripped. Bathroom has a hole where something is missing. Other wise not bad.", "Date": "September 8, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "ohio", "Title": "“great choice”", "Author": "beachymom09", "ReviewID": "UR39774360", "Content": "Room was CLEAN. The staff was very friendly and accommodating. The hotel is great location to the beach and boardwalk. Very nice Indoor and outdoor pool available, which was great for my little ones. Wish there was a bit more parking at the hotel. Would stay here again.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "DC", "Title": "“Stayed in August/Would like to go back soon!”", "Author": "linda1744", "ReviewID": "UR39279639", "Content": "Made last minute plans to go to OC. Stayed at the Hotel Monte Carlo on August 26th. Front desk service was great, room was fine, rooftop pool and hot tub were awesome at sunset. Very convenient walk to the beach. Great view from the rooftop of the city.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York CIty", "Title": "“Great Hotel, We Loved Our Stay...”", "Author": "DPC1207", "ReviewID": "UR39182364", "Content": "We had to book a hotel at the last minute and were lucky enough to get a room at a very decent price. We were a bit skeptical because of some of the not so great reviews we had read. We found them all to be false. The Hotel is awesome! The room as well as the bathroom was exceptionally clean and had a beautiful fresh scent. The maid service was fantastic. When we would come back from our day of fun, the room always smelled fresh and was cleaned very well. The staff at the front desk were exceptionally nice and pleasant and always ready to help for any reason. When we asked for suggestions for dining, all their recommended places to eat were exceptional. The hotel also provided all their guests with a ton of discounts to area restaurants and attractions. The pool and hot tub were very clean and never overcrowded. We will definitely recommend the Hotel Monte Carlo to our family and friends and plan on visiting again in the very near future.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“Great family hotel with a great location!”", "Author": "jcgirl19", "ReviewID": "UR39173659", "Content": "This was our second family vacation to Ocean City that we stayed at the Monte Carlo. We were very pleased with the cleanliness of the hotel as well as the very helpful and courteous staff. This is a great location with everything at your fingertips. Some of our family members joined us at the hotel to stay for their first time, and they were very pleased also. We have three children, and we found it very comfortable to stay with them in a room, and they loved the roof top pool!!! We found it to be very safe. The hotel is right near the Dough Roller where we would have our morning breakfast which we look foward to. I would recommend this hotel to anyone, and would definitely return. We look forward to next year!! Keep up the great service!! ENJOY!!", "Date": "August 29, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "pa", "Title": "“very clean and helpful hotel had a great time”", "Author": "beachbum1952", "ReviewID": "UR39134508", "Content": "the hotel was located in a nice spot steps from the boardwalk and beach. restaurants right beside hotel and shopping almost at our doorstep. would stay there again.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "hagerstown MD", "Title": "“Diamond in the rough, Very pleased.”", "Author": "skylane815", "ReviewID": "UR39059588", "Content": "I stay in OC 20 to 30 nights per year. Never at Monte Carlo before. I was very suprised by the clean neatness of the facility. I was shocked to learn of the roof top pool and patio area. Great views from the roof and wonderful staff willing to go the extra mile to help out. Now that I found this Diamond we will make them our first choice always when visiting OC.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NY", "Title": "“Vacation Getaway :)”", "Author": "JM71708", "ReviewID": "UR38864603", "Content": "My boyfriend and I came here for our anniversary and we were pleased with the hotel. It was just walking distance from the beach where we were at every day! Nice restaurants and entertainment are also walking distance from the hotel. Overall, it's in a great location which we liked. We also enjoyed swimming on the rooftop pool along with the great views. After we relaxed in the jacuzzi in our room which was very nice! We would definately recommend this hotel thanks to the courteous staff.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Reading, PA", "Title": "“Ocean City from a new viewpoint”", "Author": "sampson29", "ReviewID": "UR38818526", "Content": "We could not have been happier about choosing to stay at the Monte Carlo. WIth a 1 yr old we found the hotel to be ideally located for convenience of taking a quick walk to the beach or for a bite to eat on the boardwalk and back to the hotel pool again. Bye the way, the Dough Roller and Bull on the Beach are the closet and our favorites! The view from the roof top pool was amazing and in the all years traveling to OC, I had never experienced the view of getting to gaze at both the bay and the ocean. It was entertaining watching the fire trucks and ambulances from above as well. The pool is 3 ft the entire length and was clean and not very crowded. Even better is the roof top hot tub which we thouroughly enjoyed. We have no complaints about this place and feel the hotel staff were very nice and accomodating. We were able to check in early and they provided us with great breakfast spots each only walking distance from the hotel. This hotel was recommended to us by a family of five who stayed at the Monte Carlo in July 2009. After staying here we also plan to recommend the hotel to our other friends and family.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“NICE INTOWN HOTEL”", "Author": "beachbum808", "ReviewID": "UR38788541", "Content": "Nice hotel located directly off the boardwalk. close to all attractions. Room was very clean and beds were comfortable. Front desk staff very plesant. Parking was tricky. .", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "baltimore, maryland", "Title": "“Everything that you need in one place”", "Author": "nmdavies0202", "ReviewID": "UR38715129", "Content": "We really enjoyed our stay at the Hotel Monte Carlo. Everything was just a few steps away. The food, entertainment, and many activities. We would definately recommend the hotel to all of our friends. The price was just right and the staff was extremely courteous and accomodating. Nicole Davies", "Date": "August 25, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Silver Spring, MD", "Title": "“Hotel Monte Carlo was great!”", "Author": "Weezie74", "ReviewID": "UR38690389", "Content": "This was our second stay at the hotel, we enjoyed our first stay in August 2008 so much we decided we wouldn't stay anywhere else when we went back this August. The location at 3rd st, just off the boardwalk was great for us- we parked our car when we arrived and didn't use it again until time to go home! We could walk to the end of the boardwalk to the amusements, great for our 9 year old, and back to the hotel without trouble since the 3rd street location was a perfect distance from the attractions. We tried out the various restaurants along the boardwalk for dinners/lunch and of course looked at all the t-shirt and souvenir shops along the way. The room was great too, just right for our family of 3, with a microwave, small sink and fridge, all handy to have. And though the Hotel seemed full, lots of people passing in and out of the lobby and on our floor, the room was totally quiet when we crashed for the night after the midnight return up the boardwalk - these are the quietest rooms I've ever stayed at, no noise from neighbors above or on the sides!! Their staff are friendly & courteous and the rooftop pool (including a jacuzzi) was great - we loved the view to look around the area!", "Date": "August 24, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Baltimore, MD", "Title": "“Our vacation at the Ocean City”", "Author": "miraesh", "ReviewID": "UR38670219", "Content": "Me and my husband enjoyed our stay at Hotel Monte Carlo. We relaxed in the Jacuzzi in our room after a hot and humid day on the beach. Most of all it is close to the ocean, resturants, and the rides.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Amazinggg Trip!!! The perfect end to the summer!”", "Author": "WorldTraveler0926", "ReviewID": "UR38636773", "Content": "Hotel Monte Carlo is an amazing place to stay in Ocean City, MD. They have various amenities to please all guests. The staff is very kind and are always there to serve to all your various needs. This hotel is like a home away from home. I highly recommend it to all those who feel like having a ton of fun in a beautiful atmosphere.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hanover, PA", "Title": "“We will continue to patronize this hotel year after year.”", "Author": "nursefunky", "ReviewID": "UR38562406", "Content": "My husband and I always return to Hotel Monte Carlo each year for our family vacation. This past weekend we had the opportunity to visit Ocean City, MD without our children so we chose a smaller room, one with a King size bed and a Jacuzzi. The bed was so comfortable, we did not want to get up in the morning. When we first arrived you would have thought we were looking at the cover of a Home and Garden magazine, the way the bed had been made up along with the scenic picture on the wall above it. The staff at the desk was friendly and knowledgeable. We also stay here every year because of how close it is to the beach and the boardwalk. One has the option of using the indoor pool or the roof top pool, both of which are always clean. Also, we especially enjoy the beautiful view of the ocean and the bay from the roof top. We will definitely continue to spend our OC, MD vacations at Hotel Monte Carlo.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Hotel Monte Carlo is a great place to stay!”", "Author": "emeremer", "ReviewID": "UR38560459", "Content": "This hotel was great. The staff members were always pleasant and most helpful. They responded to our needs very quickly. The room was clean and ready upon our arrival. We made our reservations online and the room/amenities were just as stated on website. The view from our balcony was good (oceanside). Also, the hotel was very convenient to the ocean and board walk. My family and I had a great time and would definitely stay again.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pasadena, MD", "Title": "“Welcoming”", "Author": "Ticati13", "ReviewID": "UR38470981", "Content": "From our last minute reservation, our arrival and stay to our check out.....everyone was most welcoming. Even though the hotel is not right on the boardwalk it was still a pleasure to stay there. It is an easy walk to the beach. After our sun and fun on the beach, there was a roof top pool and jacuzzi to enjoy. We were able to relax and view the beautiful sunset. We enjoyed being in the older part of OC and within walking distance of most activities. The rooms were very clean and the beds quite comfortable. We have already planned a return get away weekend in October.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Oil City, PA", "Title": "“A great family place.”", "Author": "AnnOilCityPA", "ReviewID": "UR38353986", "Content": "Hotel Monte Carlo is located very close to the exciting end of the boardwalk. Our teenagers could come and go without worry. Subway is located on the first floor and a small convenience store just a block away made things easy. The staff is helpfull and friendly.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Philadelphia Pa.", "Title": "“Steer clear”", "Author": "mikoneg", "ReviewID": "UR38090945", "Content": "I booked a three night vacation at this hotel from August 13Th to August 16Th ,2009. I reserved an efficiency suite with 2 queen beds and a sofa bed . We were going to celebrate my wife's birthday on the 13Th . I planned on taking her to Restaurant Antipasti for a great dinner and then back to our suite to open a bottle of wine and listen to music. On the 14Th our daughter , her husband ,and our 4 year old grand daughter were coming down from Philadelphia to spend a couple of days at the beach and boardwalk. Imagine my surprise when after paying for the efficiency suite we were given a foul smelling room with two small beds . Where were the queen beds and sofa bed that we reserved and paid for? The employee at the front desk at first denied that we reserved that particular suite. My wife who had brought her lap top stated to this employee that she would go on-line and pull a copy of the reservation . Well I imagine this gentleman then figured out that his scam was not going to work. He then told us in a condescending manner that he would give back the monetary difference in room rates or we could go some place else and he would give us our money back. When my wife asked to speak with a manager she was told he's off and may not be in the next day, keep in mind that this was 3:39 pm on a Thursday. Well we then left with a refund and found a clean motel about a mile away, on the beach ,called the Ocean Mecca . The room was spotless and the employee who worked at the front desk went out of her way to accommodate our needs.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Waldorf, Maryland", "Title": "“You have got to be kidding. Does anything work around here?”", "Author": "lbg369", "ReviewID": "UR37949820", "Content": "For a rate of $300 a night, it was a complete joke. For starters, there was no toilet paper in the room. The \"ocean view\" room was ridiculous. I almost broke my neck trying to see the ocean. The ice and soda machines were out of order, and the indoor pool was \"temporarily\" closed for maintenance. A hotel staff member initially represented that it would be for a \"short while.\" When I insisted that she call the maintenance people for their estimate of how long the pool would be closed, they said 3 hours, which meant it would open 30 minutes before it was going to close for the night. The staff was unapologetic and insensitive. They represented that a manager would not be available for two days (after my check out date, conveniently). I will NEVER stay here again.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maryland", "Title": "“very professional front staff”", "Author": "tim2560", "ReviewID": "UR37876463", "Content": "Stayed here 3 times now made a reservation in May for July and had to cancel last minute because of illness hotel was very flexible with letting us change our reservation to another night so we would not lose our money. very good location close to boardwalk and easy to get to beach . Also very clean will stay here a lot more in future..............", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "cumberland, md", "Title": "“awesome hotel. dont listen to any of them bad reviews”", "Author": "alison d", "ReviewID": "UR37784408", "Content": "on a friday my husband and our one year old daughter went to ocean city on a whim without booking any hotel. when we arrived down there we stopped at the hotel monte carlo and decided to stay there. the price wasnt bad and it was near the beach. when we got up to the hotel room the room was awesome. very nice very cozy. and very large. the hotel was very very clean.the staff was nice. we had to ask for a pack n play for our daughter and though we were charged for it(anymore we just bring it down with us) it was very clean and the staff was happy to lent us one.in fact it was such a nice hotel , clean pools that my husband and i are going down in a month and staying there again. dont listen to any of the bad reviews cause i think they are just making up lies. this hotel rocks and i will stay there for many many times to come. i even booked my mom there it was that nice. and i woundnt recommend a hotel that i didnt back up 100% percent", "Date": "August 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Pittsburgh", "Title": "“Hotel Monte Carlo will take your money leaving you with horrible service and a bad stay.”", "Author": "ler5128", "ReviewID": "UR37262824", "Content": "As my friends and I got to the hotel, we parked in the parking lot closest to the hotel. Later we would have to park across the street and run across traffic if we wanted to safely make it to our hotel. Checking in was like checking in with a child who never had a math class. Counting our money was such a hassle for them. Just a tip, if you can't count, don't ask for the money in cash. Next we went up to our room with a pull out bed that you could couldn't even sit on, hard beds, and not enough towels. Room service hardly ever came and the workers there never knew how to solve any problems. The pools weren't even open when we were there and the free sub from subway they advertised was also a hassle to attain. Finally they gave us the money but it wasn't free because of tax, false advertising. There was hardly ever a manager on duty that I could speak with about all the problems. Upon leaving they could not give us our security deposit because a manager was not on duty. They told me to wait 4-5 weeks for it in the mail. I waited and waited and waited until I had to call. No one knew what the problem was, what a surprise, then they told me we never paid it. When we checked in they told us we did. This hotel needs to get it together. I would never stay there ever again and would never recommend it to anyone. No one should have to go through this hell.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Great! for the Price”", "Author": "GrandmaInTheCity", "ReviewID": "UR37259769", "Content": "Our arrival was delayed due to a storm. I called the hotel to confirm our arrival and they assured us they were waiting for us. The desk staff was friendly and helpful. The maid service was fine and the rooms were clean and appeared newly updated. The beds were comfortable. All appliances appeared new and were in working order. Soap and shampoo were refurbished each day as was the coffee, all at no charge. The rooftop pool was clean and fairy large in size as was the sundeck. Vending machines were conveniently located. The lobby was small, the elevator was large. A Subway restaurant was attached to the hotel and you could smell the baking bread in the lobby, but not in our room. Location and price was the deciding factor in booking this hotel as it was only 1/2 block from the boardwalk, beach, and the DoughRoller Restaurant. On-site parking was limited, but parking was provided across the street at 2 different locations. Private balcony was nice but had a view of a parking lot--but the hotel doesn't advertise as having an ocean-front view.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Ohio", "Title": "“Checked on... checked out. Dirty, run down apartment feel.”", "Author": "beckballs", "ReviewID": "UR36848248", "Content": "My wife and I checked in at the hotel on Aug 5. First time we had ever been to Ocean City. We called ahead and got a room with king size bed. First, the parking is horrendous, cramped, and separated into 3 small lots, and two of them make you walk across a busy roadway. Everything about the hotel just gives you this cramped, dirty, run down apartment feel. Don't let the name \"monte carlo\" make you think of anything nice. When we first got into the elevator, we both got this sinking feeling in our stomachs. Did we just pay good money to stay in this place? The hallways are narrow and feels like prison. The rooms are worth about $49 in Ohio which is where we are from. We checked out the beach and decided we didn't want to stay at the hotel. I told the manager that we decided not to stay, annd he replied, Oh I'm sorry we don't offer any kind of refund. Less than an hour and we were out $171. Thanks Ocean City and thanks Monte Carlo. Never EVER again will I stay at this hotel or recommend it to anyone. Maybe a little refund wold have kept me from writing this negative review. I repeat this is a $49 per room hotelfolks, nothing more.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hanover, Pa", "Title": "“A good stay at Hotel Monte Carlo”", "Author": "tfunky", "ReviewID": "UR36469732", "Content": "We stay at Hotel Monte Carlo every summer and going back in August. The room they gave us was top floor with the best view of the boardwalk and beach. The staff was helpfull, nice and made our stay great. The kids loved the roof top pool with the large deck over - looking the city. There were a few things they need to fix or upgrade. One was the ice machine (one for the whole building) and not having ice for the week because of it being used so much. Second, the room looked clean but we did find a pair of flip-flops under the bed. Third, the elevator is a little slow, but do have stairs. Other than those things we enjoyed our room, the hotel is located perfect in Ocean City . The hotel is just a block walk to the boardwalk and the price is in reason for the location. I would recommend Hotel Monte Carlo for everyone.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "baltimore, md", "Title": "“Friendly, clean, home away from home”", "Author": "beachgirl21087", "ReviewID": "UR36087654", "Content": "We have stayed at the Monte Carlo each summer since they opened and have found our stay consistently enjoyable. The rooms are nice, the ones we have been in each had a balcony. Hotel staff has always been friendly and personable. Hotel right off the boardwalk within walking distance of just about everything. Rooftop pool is awesome. Will look forward to staying there again!", "Date": "July 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Castle, PA", "Title": "“Great place to stay!”", "Author": "LeviNewCastle_PA", "ReviewID": "UR35990265", "Content": "This was my family's first visit to Ocean City. I liked the location of the Monte Carlo. It was super close to the boardwalk and ocean. The location was nice because with having two young children we were close to everything (within walking distance). The room was clean and the staff was wonderful.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "hagerstown", "Title": "“great place to stay”", "Author": "shellsnax", "ReviewID": "UR35708809", "Content": "the monte carlo hotel is a great place to stay with your family . the locate is so great ,right next to the boardwalk never a need to use your car .. no need to lug everything in your car and pay the parking meters, the staff was so helpful with my kids needs, the room was clean and cleaned up everyday of our stay . the roof top pool has a great view. I have been staying there for years and alway go back there", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Lots of fun, lovely stay”", "Author": "GermantownFolks", "ReviewID": "UR35624374", "Content": "Thoroughly enjoyed our stay at the Monte Carlo. The staff was very pleasant - ask to speak with Chris. Great guy with professional service attitude. Pools are great, short walk to the boardwalk and beach. We had a CityView Unit which was clean and well kept. The kids had a great time in the outdoor, roof top patio as well as the heated indoor pool. No restaurant but a Subway on the main level.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Virginia", "Title": "“Monte Carlo Suites are not so sweet”", "Author": "imaw13", "ReviewID": "UR34840977", "Content": "As a senior graduating high school, my friends and I were eager to head to our senior beach week trip, which we booked with the monte carlo suites. Upon first arriving to the suite, which does have a nice setup with a kitchen and full fridge, we were impressed. However, this impression wore off after finding dirty towels hidden in the kitchen cabinets, a nasty earing and necklace on the floor and a dirty diaper still in the trash can. Being naive and excited, we failed to report these things, as we didn't find them immediately. The help at the front desk is not help. They could not tell us where public parking garages. We had to call down numerous times to have the pool unlocked, which was supposed to be already openend. Also the distance, while not far, was somewhat of a hassle if we needed assistance from the front desk. We knew that checking out might be a little troublesome, but never imagined the crap the hotel pulled on us. Being seniors, we had to give them a $500 security deposit for damage done to the room and the cleaning service. Upon check out we were supposed to get $480 back ($20 for room service). We even read the manual in the suite which noted that $10 would be taken out for dirty dishes. So, I cleaned all of the dishes. We also took out the majority of the trash. I thought about cleaning the room more, but trouble arose with my car and I could not worry about cleaning it. The room was in no way destroyed or damaged, just messy--there were six of us living it for six days. Eager to make money anyway they could, the hotel took $200 out of our deposit, because the room was \"trashed.\" Yes, the floors the needed to be vacuumed, new sheets put on the beds, counters wiped off, and towels washed, but this in no way constitutes \"trashed.\" The manager took my friends back to the room and yelled at them, saying they could take the whole deposit if need be. We offered to go back and clean it more, since we checked out really early, but of course they wouldn't let us, because they wanted our money. I can't speak for the main hotel, but I would not reccomend the suite location for any graduating seniors hoping to enjoy beachweek.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "toms river, nj", "Title": "“don't go there!”", "Author": "jjlovescountry", "ReviewID": "UR34787261", "Content": "security is very lax, found room door unlocked and left open for easy enter by anyone. Busted towel bar in bathroom. Last night of stay, when turning down beds, found that bedspread was thrown over unmade bed with sheet and blanket at bottom of bed. Had night manager verify our complaint. We tipped everyday, and hotel did not even make an effort to make good by offering some sort of discount or apology. Have been staying at this hotel for 7 years - did NOT renew for Cruising weekend in May, 2010.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“AVOID THIS HOTEL”", "Author": "FatCatSushi", "ReviewID": "UR34690652", "Content": "The rooms they put on the website have two type - Side Ocean View and the City View. I booked the Side Ocean View room which is about $50 more then the City view room. I went there to check the surroundings before my real trip because I want to make sure my girl and I stay in a nice view hotel. I am glad I did cauz their side ocean view rooms are terrible, not even close to side ocean view. It was blocked by buildings and nothing special. They charged me $50 for the terrible view and they can't refund if you cancel it within 14 days prior to my booked day. 14 DAYS! I really don't think that's reasonable . Finally I was so mad and let them took my deposit and went to another hotel with only $60 more than Monte and come out with two private balconies, two LCD TV, top floor, nice clean room. I was glad I made that decision and we had so much fun.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "chantilly", "Title": "“My stay at Monte Carlo”", "Author": "prince2627", "ReviewID": "UR34652093", "Content": "Hi i just wanted to say that i really liked your hotel and i enjoyed my stay and would love to come again. Its Very clean and lots of activties to do . Thank you and definetly looking forward to it again.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "akron", "Title": "“nightmare”", "Author": "jagger36", "ReviewID": "UR34063259", "Content": "They took extra money off my credit card two weeks after we got home, won't give it back. So whatever you do, don't give your credit card number. Bathrooms were really dirty.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maryland", "Title": "“Loved the Hotel- Great!!!”", "Author": "beachgrle1", "ReviewID": "UR34021228", "Content": "My favorite parts of the hotel i enjoyed were the indoor pool, outdoor rooftop pool and jacuzzi on the rooftop, Our room had a hot tub inside our room, this hotel is very nice located a block from the boardwalk and beach but the only downfall is that this hotel is a tad pricey but i loved it and enjoyed it", "Date": "July 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Exton, PA", "Title": "“Nice rooms but very poor service”", "Author": "buzzlog", "ReviewID": "UR32997937", "Content": "We stayed at their newly opened suites on 11th street since they could accomodate us (5 adults and one child). The good thing about the suite location is that you get one free parking under the hotel. Also, it's all brand new and only a block away from the boardwalk. The bad thing about this property is that they don't have any personal on that property to help you with any of the servcies. We stayed three nights but we did not get anyone to come clean the rooms, open the swimming pool and provide us with towels and toilet paper for the first two days. We called their main property on 3rd street numerous times to request for towles, cofee, etc. and they said that someone will be there shortly. Needless to say, that no one showed up for the frist two days. We luckly ran into the assistant manager for the hotel on our third day and told her about the many problems we were dealing with and she finally on our last day had someone give us towels and toilet paper. The swimming pool was hardly open even during day time since no personal came from the main office to open it. The internet stopped working after the first day and they don't have phones in the room (at least none that work). I would understand the issue if this was 1 or 2 star hotel but they are priced like a 3 or 4 star hotel. I would not stay at The Monte Carlo again.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Delaware", "Title": "“Nice Hotel, great location!”", "Author": "SuzDE", "ReviewID": "UR32704771", "Content": "We have returned every year, for the past 4 yrs now....With two young boys, this hotel is convenient, close to attractions, and very affordable as well. The staff has always been quite helpful and courteous. Looking forward to returning this July!", "Date": "June 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Duryea, Pennsylvania", "Title": "“Needs Improvement”", "Author": "pubboots", "ReviewID": "UR32332057", "Content": "We stayed at this hotel during the weekend of the air show..Granted we decided to go the week before and this hotel seemed to be the only one we could find that was close and had a rather good price... Upon arriving the lobby smelled like commercial ovens due to a Subway being connected to the lobby and elevator...There is only one elevator which is very slow...We got a room on the 4th floor..ocean view side with two queen beds..one of the beds did not even have a sheet on it!!!!...The hallway had a musty smell. We had to ask for clean towels since the maid service never came into our room the next day. Towel rack in the bathroom came off the wall, toilet ran and shower head had a sqeaking noise....", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "MD", "Title": "“2 night stay”", "Author": "hm06129", "ReviewID": "UR32310380", "Content": "Thought the hotel was great, customer service at the front desk was great both nights. Really friendly and willing to help. Only problem that we had was parking which was in two locations. There were 5 spots right near the entrance of hotel which was covered but the other parking lot was on the other side of the street and really cramp. Also the room was clean only problem we had there was that the bathroom door would not close completely. other wise everything was great would definitely stay again.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Baltimore", "Title": "“Reasonable Price, Friendly Staff, Convenient Location”", "Author": "BeachBabe917", "ReviewID": "UR32076059", "Content": "My brothers and our significant others stayed at the new Monte Carlo Suites located on 11th street for the Import Weekend car show, June 6th thru the 9th. The hotel staff was very friendly and when we had any problems, they would do whatever they could to help us. Carlo, the assistant manager who was staying on our floor, came by to check on us to see if there was anything he could get for us. The rooms were very clean and spacious. With 7 people in the room, it didn't feel like we were on top of each other. The balcony was big and very relaxing. You could actually see the ocean from the balcony. The boys liked the balcony the best because they could watch the cars go up Baltimore Avenue. We enjoyed our stay and would definitely stay here again. We're thinking about booking again in July for my brother's birthday weekend.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maryland", "Title": "“Complete Satisfaction”", "Author": "dragonfly1289", "ReviewID": "UR31592748", "Content": "We have stayed here year after year for the fireman's convention and we keep coming back. The prices and the accommodations are just prefect! It's a great location, easy access to the beach, shops and food. The rooms are roomy, clean and do not have a smell of some of the hotels in the area. Keep up the great work and thanks for not raising the prices like some of the other hotels/motels. Its another reason why we keep coming back.", "Date": "June 4, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glen burnie", "Title": "“one of my faves”", "Author": "deedeeninja", "ReviewID": "UR29417259", "Content": "my favorite hotel in ocean city is the monte carlo. service was very good,the staff were very friendly and helpfull especially for being our first time in ocean city.the sites they suggested to visit was very good.the rooms were very clean.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Relaxing”", "Author": "MADDOG3712", "ReviewID": "UR29374048", "Content": "This is our 3rd year staying at the Hotel Monte Carlo, this is a great place to stay especially if you have little ones, Moms, NO worries about the ocean they have a roof top pool (very clean) which is awesome for the little ones , You can relax and enjoy the sun while they enjoy 10 hours in the pool. Everyone at the hotel was polite and generous on making our stay a want to return hotel. Plus they have SUBWAY in the hotel which the kids loved.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Enola", "Title": "“Great Trip”", "Author": "LMJEnola", "ReviewID": "UR29160774", "Content": "The hotel is in a great location. Just minutes away from the board walk. The hotel staff were friendly and courteous. They were helpful in giving ideas on where to eat and what was open. The room had a coffee maker, microwave, and refrigerator which was nice. The hotel was was clean and comfortable with a homey feeling.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Great Hotel + a Great Bargain”", "Author": "Sassygirl18", "ReviewID": "UR28971610", "Content": "We stayed at Hotel Monte Carlo in late April, 2009 off-season and were really pleased with the hotel. For a reasonable price, we had low expectations, but we were pleasantly surprised. The hotel was clean and modern, and our room was sparkling new - it must have recently been remodeled. We had one of the rooms on the side of the building with a view of the bay. Our room had 2 double beds which were pretty comfortable, and plenty of pillows. The room also had an efficiency \"kitchen\" area which had a sink, 2 kitchen cabinets, a microwave, small refrigerator, toaster and a small coffee machine. Coffee was included (no dishes, or utencils, so you will want to bring them). The room also had an iron and ironing board and of course a bathroom. Everything was in ship-shape and very nice. (See photos attached). The front desk staff was very friendly and the housekeeping staff was did a great job and also was very friendly. The hotel has a rooftop pool which is just beautiful (it had just been filled when we visited, so the water was too cold to swim in) as well as a small indoor heated pool in a heated room. The hotel also has an exercise room which we did not visit. We weere also told by the front desk staff that they have Wi-Fi, which we did not use. We liked the fact that the hotel was in a great location. It's not directly facing the beach...it's behind a hotel that faces the beach, so you are just steps from the boardwalk right in the center of the action (the hotel is on Baltimore Avenue at 3rd). All in all a great place to stay and we will definitely return.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "westminster md", "Title": "“excellant hotel and very friendly personnel and close to shopping and eating and cocktails”", "Author": "dknywest", "ReviewID": "UR28151521", "Content": "Our stay at the hotel monte carlo was wonderful. The personnel was very friendly and helpful. The rooms were clean and very roomy. We especially liked the balcony to sit on at night and listen to the music in the next hotel across from us. I would recommend this hotel to our friends and we will be renting again this summer as well as in the past years . Thank you guys you are the greatest. Karen Kuhn", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Clair, PA", "Title": "“I do recommend this hotel.”", "Author": "Jaxson2007", "ReviewID": "UR27877310", "Content": "The stay was nice. Activities close to hotel. Quick walk to the boardwalk. Enjoyed the indoor and outdoor pool.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Baltimore,Maryland", "Title": "“Rude staff,terrible maid service,rate was not what was quoted.”", "Author": "mikesroadhouse", "ReviewID": "UR27711687", "Content": "Made reservations for March 13th & 14th,4 rooms.Had to cancel one room and was told I would have to pay the reservation fee (one nights stay) and I agreed. Checked in and was charged a higher rate than was quoted over the phone,ok we can live with that were here. A friend called me and wanted to come down for the weekend with his wife and I said great I had to cancel one of my rooms and that they could have it,just tell them at the desk when they arrive. The following day all 8 of us went out around 11:00 am and returned around 11:00 pm. The beds weren't made,no trash removal,no coffee for the morning,no clean towels and our heat had been turned off,it was cold. Called the front desk and was told they would address the problem in the morning. Next morning didn't hear a thing. We decided to stay another night but booked a room at another hotel. We were checking out and were told we owed an additional $148.00. We asked what for and could not get a reasonable explanation or an itemized bill explaining the extra charges. We asked to see the manager but he would not come down to the lobby he would only talk over the phone. My friend talked with Mr. Bowden the manager and could not get any straight answers from him. Mr. Bowden was rude and hung up the phone. We did pay the additional money only because they had my credit card number. The couple that had taken the cancelled room were told when they were checking out that they would have to pay an additional fine of $200.00 for smoking in their room. They were held up a half hour while the room was checked out by the smoking police I guess. Anyway they didn't have to pay the $200.00. I filed a complaint with the Better Business Bureau with no results. Emailed the OC chamber of commerce,no response from them at all,so now I'm here venting. I have been to many hotels/motels and have never had any problems. If I were you I would stay far away from the MONTE CARLO HOTEL.", "Date": "April 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "baltimore", "Title": "“Pleasant Surprise”", "Author": "sasserbugs", "ReviewID": "UR27497755", "Content": "This was the first time in this hotel and it will definitely not be the last. The service and the room was great.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maryland", "Title": "“Great hotel with a pleasent staff. best location on the boardwalk”", "Author": "fordman02", "ReviewID": "UR26980089", "Content": "this hotel is in the best location on the board walk you can walk just about anyware that you like. the hotel is clean and the staff is very pleasent and helpful. and the rates are just as good.", "Date": "March 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "WALDORF, MARYLAND", "Title": "“The Hotel Monte Carlo was so convenient. The location was great.”", "Author": "VICBELLET", "ReviewID": "UR26899099", "Content": "The Hotel Monte Carlo was so convenient. The location was great. We stayed at there while attending the Sand Duels Soccer Tournament. It was my second trip to Ocean City in 15 years. I was totally unfamiliar with the area. The staff was great in giving us guidance and recommendations. The hotel was nice, we had a great view and were very comfortable during our stay. I'll definitely go back this year.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "bethlehem,pa.", "Title": "“great place to stay ,super local, going back again this year.”", "Author": "smokeum", "ReviewID": "UR26773066", "Content": "It was our first trip to Ocean City last year for the car cruise weekend. The Monte Carlo Hotel is in a prime location for all of the fiestivies of the weekend. Great room with an excellent view. Planning our return trip again this year. I'm sure our accomadations will exceed our expectations again.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Southern Maryland", "Title": "“All These Bad Reviews? Its Not Really That Bad”", "Author": "xxmikeinchainsxx", "ReviewID": "UR26366822", "Content": "I Was So Afraid To Stay At This Hotel Because Of All The Bad Reviews. Let Me Tell You, Its Not Bad. And For The Money, Its Actually Really Good. This Was My First Trip With My Girlfriend And Away From My Parents. We Usually Stayed At Really Nice Places With Them, Like The Hilton And Such, But Those Places Still Have Their Problems. I Get To The Hotel About 12, Check In Time Is At 3. I Park Next Door And Enter And The Lady KINDLY Says I Can Go To My Room. Then I Ask Her If I Can Park Next Door. She Says I Can Not, But I Can Park In Any Of The Parking Spots Under The Hotel, Or Across The Street. The Parking Lot Fills Up Fast (Only Like 10 Spots) But The Lot Across The Street Wasn't Bad, A Little Tight Though. I Unpack My Stuff And Park The Car Across The Street. I Get To The Room And It Looks Fine. I Don't See An Ash Tray So I Go Downstairs To Confirm That The Room Is A Smoking Room And The Lady KINDLY Says It Is On The Patio And Gives Me An Ashtray. We Decided To Get Some Dough Rollers (Because Its Right Under You) And We Had Left Overs, So It Was Nice Just Having To Go Upstairs To Put It In The Fridge. When We Get Back To The Hotel At Night, I Wanted Some Ice. I See That You have To Get It From The Front Desk. I Go Downstairs And Ask The Lady For Some Ice, She Turns Around And Gets It From The Cooler. She Didn't Say You're Welcome Or Anything, But Who Cares? I Go Upstairs And Watch TV (And The Remote Does Work), The Music From A Few Streets Down Was Drifting In, So I Decided To Sit Out On The Balcony And Listen To It For A While The Worst Things About This Place Are: Parking Is A Little Bad, But You're So Close To Everything, You Don't Have To Drive One Guy In The Elevator Said He Could Not Bring His Bicycle Inside Because His Bike Was Too Dirty, But He Said He Found A Pubic Hair On His Bed. That Made Me A Little Sick, But He Sounded Like A Drama Queen. Its Not 5 Stars, But I Paid Over Half Less Than What They Charge I'm Going Back Again In July And I'm Gonna Have A Blast Again", "Date": "March 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Stay Away”", "Author": "luv2travl08", "ReviewID": "UR21228944", "Content": "If I could say anything about this hotel it is STAY AWAY. The staff at this hotel are soooo rude. The hotel it self needs a serious cleaning. Too the point the first night we stayed the sheets on our bed had blood stains on it. Housekeeping should never put sheets on a bed that has blood stains(throw them out). Ok the hotel swears it is smoke free but you can see all throughout the hotel that it's not. Our comforter had cigarette holes in it, even the drapes had cigarette holes in it. The hotel had a musty smell, housekkeping really needs to do better. The pools were dirty. The hot tub was so dirty that the grot which is in between the tiles should be white it was black. I was so upset that we prepaid with expedia to stay at this hotel and it wasn't cheap. The pictures and the description really fool you. I wouldn't recommend this hotel to anyone. Holiday Inn as well As Comfort inn have beautiful hotels right on the boardwalk.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "St. Mich Md.", "Title": "“Our awful stay”", "Author": "Hollie135", "ReviewID": "UR20875564", "Content": "For the last 4 yrs we have stay at this hotel, and i must say this yr was ythe worse, we stay for a car twice a yr. for 4 days, on this stay it started right from the beginning, at check in , front desk was rude, one person i might add, she doesnt care anything about the ppl that stay let alone about the hotel, go up to our room , unpack and leave to reg car, get back at midnight to find our bed, has clomps of someone elses hair, and the sheets had not been changed from the last visitors, how nice huh. call front desk , night time person personally came and helped me change our bed, and was so sorry for what we had found, then, remotes to TV dont work , let alone match the TV set , doesnt take a high school grad to figure out the the tv and remote have to be the same, second one they give me, doesnt work, at this point i gave up. Coffee pots in rm, and we need to purchase coffee after the first night, fine, but when you go and ask for it, nothing but additde, in which you forget the coffeebecause of the anger that has built up inside, nasty staff, smart mouths , and bad part is manager stands right off to side and allows it, Ppl should be treated with respect and this hotel has none, and i want the world to know, im trying to find main headquarters number, if anyone can help plz do so, Park place right next door, was very understanding when we put in for our syat next spring, VERY UNDERSTANDING", "Date": "October 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“Very discourteous staff at the Monte Carlo”", "Author": "BeachLover1965", "ReviewID": "UR20817487", "Content": "We came to the hotel around 11:30 a.m. and we asked if we could check in, she said no not until 3:00p.m. Of course it was off-season and their were not many occupants in the rooms. We were allowed to check in at 2:00p.m. and we did. The manager asked how many people and we said 2 adults 2 children. She said she is going to charge us extra for our children. We said when we booked the hotel the woman at the desk at the time quoted us a different rate. My children are both under 18, so why would they be charged them as adults. We payed only the rate that was quoted and checked into our rooms. The rooms were o.k. a little small. I thought we would get ocean view, we had no view. Upon checkout the manager informed us we owed another $44.00 for our children. We said we were not going to pay it and if I had known that the room was that much, I could of gone somewhere else. Well guess what, she ran our card through after we left. I am very displeased and I feel the manager was very dishonest.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hagerstown MD", "Title": "“Average Accomodations”", "Author": "rspeaker67", "ReviewID": "UR19206697", "Content": "After walking out of the Commander Hotel (see my other reviews) we landed at the Hotel Monte Carlo. It was definitely an improvement, although nothing spectacular. We spent 3 nights here in the Summer of 2007 (8/12/07 - 8/14/07). The room was nice and spacious although the bed was probably the worst hotel bed I've ever slept (well, tried to sleep) on. The location wasn't too bad, it's on Baltimore Ave on the Ocean side, between 2nd and 3rd, so it's only half a block to the boardwalk and beach and a short walk to the Inlet/Pier area. There's a Subway attached to the lobby and a Dough Roller just up the ramp. The lobby is very small, there is 1 elevator and a flight of stairs. The hotel isn't very big, probably less than 100 rooms on 4 floors. The rooftop sundeck was very nice as was the jacuzzi. The pool, however, was VERY cold and only 3' deep. The indoor pool, accessed from a separate outside door or inside hallway, was warm but even smaller than the rooftop pool. Staff were all very friendly. Room keys are very easily demagnetized by cell phones or other credit cards, we had to have our room key reactivated several times over the 3 days. We asked for a quiet room, and got one at the far end of the hallway. The only complaint we had upon checking out was that the hallway music that played all night could be heard in our room. Otherwise, it wasn't too bad.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Best place to stay in oc”", "Author": "Lovestotravel1953", "ReviewID": "UR18328086", "Content": "My parents first stayed at the Monte Carlo and they loved it, so the next I made reservations that's where I made them. And they were right it is a very nice place to stay. It’s very clean and the staff is most helpful and pleasant and always greets you in the lobby. Since my first stay there we’ve been back several times. I have stayed at a lot of places down Ocean City and I can honestly say this is the nicest place to stay. Actually have reservations for September. I also like the fact that they have a outdoor pool as well as an indoor pool and only a block from the ocean and broadwalk. I would stay there again and again...", "Date": "July 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palmerton PA", "Title": "“Our first trip to OC MD”", "Author": "McGJJJ", "ReviewID": "UR18219463", "Content": "This was our first trip to OC, MD so I can't compare the Monte Carlo to other hotels in the area. I can say that all of the employees were very polite and helpful, and the room was clean and comfortable. All appliances and the air conditioner in the room worked well. The rooftop pool area had a great view, and the shallow pool (about 3 ft) was good for my younger kids... no deep end to worry about. The location was close to the \"busy\" end of the boardwalk with all of the arcades, another plus for the kids. We could see the ocean to the side from our balcony. The downsides were: very tight parking for an SUV, we walked from the lot across the street. The indoor pool room was extremely hot (I guess this may be OK if you're swimming, but it was hard to breathe just watching the kids from the bench so we didn't stay long) and the cardio-room/gym was also so hot it was not really usable. We had to wrestle quite a bit with the \"key card\" to get into our room until we got the hang of how the locks worked. I think this motel was good for the price and we would consider staying here again.", "Date": "July 24, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "maryland", "Title": "“They Screwed Me Over Before I Even Got To Stay!”", "Author": "vik85", "ReviewID": "UR18116630", "Content": "I called the first time to place a reservation for September of 2008. The young lady who answered told me I had to call back because the fire department was there and they had to evacuate (sign#1 that I should not have booked a reservation there). I called a couple of days later, made my reservation and was told how much the deposit would be, gave my credit card info and the amount that was charged to my account was higher than what I was quoted would be taken out (sign#2 that I should have not booked a reservation there). so I called to find out what happened and the night manager, very rudely explained to me that the young lady who told me how much the deposit would be was incorrect in the amount she quoted me(sign#3...) I informed the manager that I would like to cancel my reservation and she told me if i wanted to cancel my reservation I would still be charged the $15 cancellation fee plus tax!! Even though it was not my fault!! Now I have to wait 3-4 weeks for my money to be refunded back to my account. That money could be used to book another reservation... somewhere where the customer is more appreciated. I didn't get the chance to stay at the Monte Carlo and I'm glad I didn't, I can only imagine what it would've been like. Poor Poor Poor.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Very nice hotel and close to the boardwalk, well worth it.”", "Author": "MdVacation", "ReviewID": "UR18083234", "Content": "Just found out about this site, so sorry for this very delayed review. Very nice hotel with a nice website as well. The staff checked me in quickly and greeted me. Stayed in a jacuzzi king bed room. Very clean, spacious, and comfortable. The parking lots are not that far from the hotel at all, of course some people rather would not want to cross the street but the speed limit is like 25 mph in this location as well as plenty of lights and crosswalks. Never made it to the pool area, since I had a jacuzzi. In the middle of August nothing beats walking out and onto the boardwalk in under 5 minutes, you cant beat that! I had no problems what so ever. Check out was fast as well.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "West Chester PA", "Title": "“a little pricey.. but a nice place”", "Author": "stellar69405", "ReviewID": "UR17921204", "Content": "went 2 years ago for a stay with my boyfriend. decided to splurge for a jacuzzi room. the monte carlo seemed like the best price. check in was fine -- downside was the small parking area aT the hotel itself. very small, but they had another lot about 2 blocks down. we were lucky to find a spot at the hotel itself the first day... only moved the car once to go to dinner a few nights in and had to park in the other lot when we returned. yes.. the lobby does have a special aroma.. haha... the subway is convienient, but they COULD do something about the smell.. the last thing you think you'll be smelling when you go to the beach is fresh baked bread... then again... it could REALLY be worse. :-) went to the room and saw the jacuzzi... its NOTHING like the pictures on the hotels website. room was clean and big. bathroom was a little cramped but thats to be expected. bed was comfortable enough (i'm a picky sleeper). the view wasn't great, but we wern't expecting a oceanfront room anyway (at the time i dont think they had a ocean view room.. now i believe they do??) the worst part?? after we left i realized i left my FAVORITE sweatshirt in one of the drawers (i'm not the type to put things in drawers, but for some reason i did).. called about a hour after we left and told them the room number and told them that i had left a sweatshirt and that i would pay to have it sent back to me in PA. they took down my address and said they would have someone call after the room was cleaned. never heard from them, so i called the next day. was told i'd get a return call.. never heard from them. called a 3rd time and was told that they COULD NOT send it back to me and that i would have to come to pick it up. ended up taking a day trip down a week later, so i decided to stop by and pick it up..... yet NO ONE seemed to know what i was talking about, however the employees were the same ones that were there when i stayed!!! All in all.... it was a good place. a little pricey, but when it comes down to it.. if you're worried about what you might be sleeping in, this is the way to go.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reinholds Pa", "Title": "“Great customer service.,,,,”", "Author": "m0mmy2323", "ReviewID": "UR17886959", "Content": "We stayed at the Monte Carlo during mothers day weekend with our 5 year old daughter, , we Loved our room , it was spacious, all of the staff we came accross was very nice and helpful. The hotel was clean, There is parking at the hotel and across the street but you could drop off your things at the underway and move across the street instead of walking across the street with everything. We enjoyed our stay.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PA", "Title": "“loved it!”", "Author": "Brit06", "ReviewID": "UR17772701", "Content": "I have stayed in many hotels in OC and this by far is my favorite. it was CLEAN, the staff was super nice, our Jacuzzi was amazing, and the room was a decent size. Probably the only negative thing about it was that their parking lot is pretty small, and across the street. If its full(which it usually was) they have another one like a block or two away, but that wasnt really an issue, since you could pull the car up to the hotel and unpack your things. It was very nice that the beach, and boardwalk were only a block away, and you dont have to cross any busy streets to get there. I definitly plan on revisiting this hotel again next year!", "Date": "July 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "PA", "Title": "“Never again!!!”", "Author": "Hottips67", "ReviewID": "UR17628246", "Content": "We went & never even stayed for 1 night. We immediatley got to the room saw how dirty it was & got on the phone to stay at another hotel. The entry smells all the time because it is attached to a Subway sandwich shop. The pool indoors is more like a hot tub. This place should charge minimum price as it is as low class of a hotel as you can get.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "State College", "Title": "“The worst hotel I have ever been to by far!”", "Author": "jdcurtiss4343", "ReviewID": "UR17391809", "Content": "I strongly urge everyone going to Ocean City to avoid the Hotel Monte Carlo like the plague! Me and some friends stayed at the hotel a couple weeks ago and have never been treated worse. The customer service is terrible. The people who work their are rude and extremely unhelpful. The way they treat their customers is shocking. In fact, one night when we were staying there a friend came up to our room to get something that a friend in the room needed to give him and moments later we got a knock on the door saying we were being evicted (it was 3:30 a.m). Then while trying to figure out what we were going to do about being on the streets in the middle of the night two men approached us and pulled knives on us. After we reported the incident to the police the hotel manager had the nerve to call us in our room and threaten to evict us for lying to the police. After the threatening of a lawsuit the hotel had a change of heart and allowed us to stay in the hotel. A real nice move seeing that we paid over 1500 dollars for the week.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Very kid-friendly hotel!”", "Author": "justsmurfy", "ReviewID": "UR17306691", "Content": "I booked a trip with a local bus company but I didn't like the hotels they were staying at so after much research online, I chose the Hotel Monte Carlo. Even though there were some bad reviews, compared to what I had to choose from, I was willing to take the chance and I'm glad I did. I traveled with my 2 children, ages 6 and 9. We arrived at 12:30 and our room was not ready, but I expected that. They allowed me to leave my luggage, however, there was some hesitation by the staff member, but I told him I called ahead about that because I knew I was going to arrive early and he agreed to allow us to let our luggage there. We came back at 2:30 and our room was ready. The entire stay was wonderful. Everything the website said would be in the room was there...toaster, microwave, refrigerator, coffee maker, iron, ironing board, hair dryer, etc. The room was clean and very quiet, which were 2 things I was concerned about when traveling with my children. The staff we dealt with were very, very nice. The day we checked out we were not going to meet our bus until 2:45 and the lady at the desk was very happy to let us leave our luggage there until we were meeting our bus. The roof-top pool was wonderful, especially for children. It is only 3 feet deep so I could lounge poolside comfortably without worrying about them. We did not use the indoor pool, as that was pretty small and had too many people in it already. Besides, it was between 4 and 5 feet deep which is too deep for my kids. The hotel is also very close to the beach, much closer than I expected. This was a great plus for us. I'm very glad I chose to stay at the Hotel Monte Carlo. It was my kids first trip to Ocean City. They had a great time and loved the hotel. The price was great compared to surrounding hotels. You can't beat the price for what you get and how close you are to everything. We are hoping to return every summer! See you next June!", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Waynesboro, Pa", "Title": "“Great, Wonderful ,Awesome what more can I say.”", "Author": "crazyantdee", "ReviewID": "UR16916939", "Content": "This hotel was GREAT! Me my daughter and a friend went down for cruising weekend knowing the hectic and loud time it would be. The staff was Great.I have never stayed at a hotel where I got such great service and A good morning or afternoon. The staff was friendly and very helpful. We checked in early and told At 11:00 am our room would be ready and it was. As busy as this weekend is we got parking on the lot at the hotel and was told you could unload at door. We only once at the last night at our stay had to park 2 blocks down at the other lot and it is a bit small for bigger cars and suvs. It wasgreat Deb and Willy was great. Ity was nice to stay at a place where you can joke around and have a nice time with the staff. They were always helping people and always busy when we saw them, Which was alot since we are always coming and going. With the hotel only one block from board walk{if that}. You have everthing right there for you to do why leave.you have resturants allround carniaval at end of boardwalk. The indoor pools small but very nice the roof top pool is very big and the hottub is great. We used them all and it was wonderful. If anything do not miss out the view from the rooftop. At night it was just beauitful. I will be staying here again thanks to the staff Deb and Silly Willy .{hope willy is doing great at his police job. Will miss you Willy.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mck88", "Title": "“great place”", "Author": "mck88", "ReviewID": "UR16318467", "Content": "im only writing this cause i see a few negatives and i dont feel this hotel deserves it. i have stayed here 2 times. once last summer and once a few years before that. Both times i stayed i was there for a week. this is a great place. most places in oc, md arnt that nice, but this one is. all around. its a little pricey compared to most of the hotels in the south oc, md area, but it is worth every penny. clean rooms, good hotel service, and it does have a very safe feel.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "alexandria", "Title": "“When reading reviews on this hotel, please believe it”", "Author": "kishamichelle", "ReviewID": "UR14093395", "Content": "My husband and I stayed here in March of 2007, and I read the comments before I went. I even called the hotel and spoke to the front desk. He said those comments were not true. When we got there at 4:00, the subway next door had already closed. They make the rooms look great on-line. We got the room with the Jacuzzi, that was fine. The beds are old, and the rooms aren't that big. Please, and if you are going for the indoor pool, you minds well stay in your room and take a bath. That is about the size of the indoor pool. I think maybe 4 people could fit in a time.", "Date": "March 6, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Nice room for the $$”", "Author": "Luv2GoPlaces08", "ReviewID": "UR13858837", "Content": "Room was very clean, and rates very reasonable. Had a nice corner balcony view of the ocean. Good selection of TV channels. The staff were very friendly. Parking is pretty limited. Only went down for one night, but had a nice stay.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Nice Hotel”", "Author": "Baltimore2", "ReviewID": "UR10031891", "Content": "The hotel room was very big and clean. We only stayed for 2 nights and did not need maid service so we kept the do not disturb sign up. The maid service left us a bag of extra towels in front of the door in case we needed them. All rooms were efficiency with ironing boards and irons and refrigerator and hair dryers. We arrived at 12:00 and they let us go to our room early and did not charge us. The hotel staff was very friendly. The parking is an issue the spaces are very small if you own a SUV or truck. They do have two lots but both lots were not for people with big vehicles. The hotel manager let us park on the lot next door to their parking lot since that motel was closed for the season. Great location we could go to all the bars around and did not have to move our vehicle. Would definitely stay there again in the off season when there is more parking spaces.", "Date": "October 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Very Pleased with Hotel!!!”", "Author": "prices28", "ReviewID": "UR10024787", "Content": "My husband and I booked the Monte Carlo for a weekend away without our two small children. We had never been to Ocean City,MD and I was nervous after reading some reviews of the Monte Carlo. We arrived early and even though the room was not ready they called our cell phone to let us know when it was. The staff was very friendly. The room was a nice size and we had a nice balcony with a side view of the ocean. The location was perfect. My husband fished on the pier while I did some shopping. We also went to two of the bars and were able to walk. We never had to move our car. We will definitley be returning next year with our children and staying at the Monte Carlo!", "Date": "October 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Great hotel”", "Author": "towner609", "ReviewID": "UR7986739", "Content": "My husband, my children and I stayed at the Hotel Monte Carlo the week of June 17, 2007 After reading all of the \"bad reviews\" the hotel received, I was a bit scared that the hotel would not be nice. The \"bad reviews\" were wrong. The hotel was clean, the staff was very friendly and helpful. Our room was a nice size and clean. We had a wonderful view! The maid cleaned the room every time we put the maid sign out. The location of the hotel was very close to the boardwalk - there were no streets to cross to get to the boardwalk and the view from the rooftop pool was amazing! We would definitely stay at this hotel again.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Please do not waste your time energy or money it's not worth it.”", "Author": "mica679", "ReviewID": "UR7725749", "Content": "My friend and I stayed at the hotel during Memorial Day weekend. Parking is terrible, there are only 8 spots on the premises. If you are not there early enough, you have to park across the street or up the block in spots reserved for Monte Carlo guests. My friend and I returned from Midway Casino at 3:00 a.m. only to find that all of Monte Carlo's designated parking was full. Therefore, we had to pay for on the street parking. Donald, the hotel manager on duty, refused to reimburse us the $2.50 we paid to park. Maid service was horrible. We did not receive any service on Sunday and had to request service on Monday. We did not recieve fresh bed linens and we had to ask for maid service to return to our room for a second time to clean the jacuzzi and the bathroom. The mattress was horrible to sleep on as well. The indoor pool advertised is farsical. It is extremely small and resembles a kiddie pool. Maybe large enough to accomodate 6-8 kids at a time. We asked for an 8:30 a.m. wake-up call that we received at 8:45 a.m. Shop around before selecting the Monte Carlo. I will never stay here again.", "Date": "May 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "PA", "Title": "“Probably Not Again”", "Author": "babs550", "ReviewID": "UR6783969", "Content": "I will first say the rooms were very clean and the staff was very friendly. Would I recommend this hotel to anyone? No, we got an efficiency and we had a fridge, microwave and a small coffee pot. No utensils, no cups, plates no dish soap or anything else that comes in an efficiency in other hotels. SO I would not recommend it for any family vacation unless you want to bring all those extra things. You got one complimentary pack of coffee and if you wanted any more you had to purchase it from the office, that never happened to me before. The free samples of soaps and shampoos you can get at the vending machine for 1.25. There are charges for everything, calling room to room local calls and a rule book with all other kinds of charges. If you smoke make sure your balcony door is shut all the way because if your room smells like smoke there is a 300.00 cleaning fee charged to your account. There are no extra pillows or blankets for the sofa bed. The pipes leaked. I might stay again if I was just passing through for the night and thats it. I will not pay that price in season or out of season for a motel like that expecially so close to the boardwalk.", "Date": "February 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Virginia", "Title": "“Never again!!”", "Author": "OneBunches", "ReviewID": "UR5801803", "Content": "As soon as we arrived we started having problems....we had to argue with the front desk in order to get our AAA discount that they had promised when we made the reservation. Parking was terrible. The parking spaces were not only spaced too close together, but the lot was across the street or two blocks away. We left with our vehicle being dented. The lobby was very small and there was only one, slow elevator. It was quicker to take the stairs! Our room was only made up once out of a three night stay, and the bathroom was never cleaned. We were awakened each morning at 6:00 am by the garbage pick up underneath our balcony! The pool was too cold, the jaccuzi was too hot, and the indoor heated pool was too small. The worse part of our trip was discovering that there were nicer hotels in the same area that had lower rates! Next year we will be staying at one of them!", "Date": "September 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Upstate NY", "Title": "“Not even a little like I was afraid it would be”", "Author": "Mom2gkj", "ReviewID": "UR5769306", "Content": "We recently got back from our vacation of 4 nights at Monte Carlo. We stayed August 21-25, so being the end of the month may have made it a little less crowded, I don't know. I have to admit that I started to get scared reading all the reviews, even though I know that you can't please all the people all the time, and some people never, I got worried. I was very pleasantly surprised when we got there. Yes, the lobby is VERY small, and the elevator was ridiculously slow, we actually used the stairs mostly even being on the 5th floor. But the room was very clean, and although standing out on the balcony did not give us a direct, full view of the ocean ( we were on the side that overlooked City Hall) we got a pleasing view of the ocean and the bay! I enjoyed sitting out there every day and night watching boats in the bay and seeing the ocean/boardwalk to the right. We had vacationed to Ocean City before but were up around 43rd street, and I would never go back that far up again. We LOVED being so close to the boardwalk, the food, the whole scene. If we hadn't taken 1 day trip to Assateague, we would never have used the car. We did not at any time have a problem parking in the lot directly across the hotel. There was always a few vacant spots. We even had a woman come to ask if she could inspect to be sure the maid was doing her job, which she did. The rooftop pool is on a concrete slab, as someone stated before, but I am unsure what else it would be on? It was nice, clean, and the kids loved the pool. We loved to hear the live music drift up at night too. The indoor pool was small, very small, almost comical, but the kids used it once during a rainy afternoon and enjoyed it. Overall, the staff was very friendly, the place was clean, the location was perfect, and my fears were unfounded. I do admit, another elevator would be very nice, or even one that moved faster than a snail, but we liked the exercise after stuffing ourselves with funnel cake and fries all day. We would return again, probably without the kids since they were the only miserable part of the week!", "Date": "September 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“Stay somewhere else”", "Author": "Deb0413", "ReviewID": "UR5769282", "Content": "The Hotel Monte Carlo was advertised as the newest hotel on the boardwalk, but the only thing new was the name. Everything in the hotel was very old and in need of updating and repair. There was only one small elevator for the entire hotel, the lobby was very small and not air conditioned. Our room was out dated as well as dirty upon our arrival, which did not improve as the days went on, our bed was only made once and the bathroom was never cleaned. The indoor and outdoor pools were both very cloudy to the point that my children could not use their dive sticks because they could not see them on the bottom of the pool. The only redeeming quality about the hotel was the location, the location was great that is why we stayed at the hotel and did not check out as soon as we arrived, as well as there were no vacancies in any of the hotels in the same area.", "Date": "September 4, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Pennsylvania", "Title": "“It was like paying 20 dollars for gas and getting two dollars worth.”", "Author": "yadash", "ReviewID": "UR5602945", "Content": "I have just returned from the Monte Carlo. My family of four along with another family of four went on the trip. We were ther from Aug. 5th to 7th. We were very disappointed with the place based on what we paid and what the internet site showed about the hotel. If you look at the site, don't believe the description about the place or the pictures. They are very deceiving. We arrived late on Saturday night and was greeted by the smell of hoagies in the closet size lobby. There is a Subway shop on the other side of the lobby. After registering, I was given a map to try to find the other parking lots. There are only few spaces available at the hotel. Well, I finally found the lot that was about two blocks away. Being two blocks away is not that much of a problem, but finding the lot was very difficult because you had to go through a dark alley to find the place. Walking up to my room, I knew that this was not the same place that was advertised on the internet because the outside was not well kept, a bit dirty and run down. The room was very dingy. I will say that it was somewhat clean, but the couch was filthy with stuff hanging from the bottom. It was not something that you really wanted to sit and relax on. In our room, the iron was broken and i saw a few ants crawling on our bathroom floor. The next moring, I got up early and decided to take a walk up to the rooftop to see the pool. In the pictures that I saw of the pool, the water looked pretty clear. Well, the water was actually very cloudy. It really didn't draw me in. The same could be said for the hottub. There were a few lounge chairs around the pool. I will say that there was a good view but you could not see the ocean directly because of the taller building in front of you. By this time, the family that I went with and myself decided that this place was not the place for us. We were not happy or pleased with the accomadations. This was not was advertised or worth the money that we paid for it. We were very disappointed! I want to add that I realize places are sometimes not as good as advertised, and I could usually deal with it! But this was lower than I could stand. For the first time in my life, we decided to check out of this hotel and find another. We went to the desk and spoke with the girl. I have to say that the people who worked at the hotel were very nice and tried to do what they could do for you. Most of the people were young who were from other countries working in the United States for a few months. As I said, they were very nice and I know that they heard a lot of complaints from other people about the place. Well, we spoke to the manager and explained the situation, told him we wanted to check out. We were booked for three nights, stayed one, and wanted him to refund the other two nights that we were not goint to be there. The manager, who I thought was very unprofessional based on his dress and actions, told us that we could check out but he would not refund the money. So we would loose about 500 dollars. He said because we signed some sort of paper when we checked in, we were responsible for payment. Now, don't you think a good , honorable, professional business would just allow you to check out and do what is best for the customer? When speaking to this guy, we did not raise our voices and spoke rationally to him. Well, we tried to explain that we were not happy with the accomadations and service and want to leave. WE didn't want anything for free, we just did not want to pay for the two nights we wouldn't be there.After again giving us the speech why he couldn't do it, he just walked away from us. By the way, the speech sounded like he has done it several times before. Now at this point we could of really caused a scene, but we didn't because we are not that way, could have left and lost all the money, or stayed and enjoyed what we could. We stayed, but I WILL NEVER GO TO THAT PLACE AGAIN! I would encourage those of you who are thinking of going to this place, keep in mind that you are not going to get what you paid for. If the place charged about $150 less a night, it wouldn't be bad. Don't be fooled by thinking because it is only about six years old, it is in good shape. It is not! It needs to be maintained more. As I was checking out, a guy next to me was complaining about the airconditioning in his room and towels. I had to laugh and was thinking, it is not going to get better! It was like paying $20 for gas and getting $2 worth!", "Date": "August 12, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Havre de Grace", "Title": "“Terrific stay”", "Author": "lighthouse55", "ReviewID": "UR5577980", "Content": "I just came back from a stay in Ocean City. I have to say it was a very enjoyable experience. Everything from the reservation to the stay was wonderful. I got to meet the young lady who took my reservation. Her name was Staci. She was a very friendly young lady. She made me feel welcome from the minute I walked in the door. The room was very clean. I have to say the rooftop was great. What a terrific view of Ocean City. My children loved the rooftop pool. We got a lot of use of the indoor pool due to the heat last week. I have to say this is one of the best hotel experiences I have ever had. Don was very courteous when checking us out. If only every hotel could have a staff like this hotel. I would want to travel all the time. I liked that it is close to the boardwalk and beach. I will go back soon!", "Date": "August 8, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Berkeley Springs", "Title": "“Terrible, very deceiving photos”", "Author": "noah123", "ReviewID": "UR5505248", "Content": "We also were tricked by the beautiful photos & web site. First we had to be moved from our original room because of the pet stench in the carpet. Then our new room was not very clean, the balcony was filthy, the toilet felt like a amusement park ride when you sat on it & the handle was broke so it just ran all the time, after several complaints I gave up. The jacuzzi heater was broke the entire time, the rooftop pool was shut done for 2 days & the indoor pool (if that's what you can call it) can not handle more than 4 people & it is full. The staff, except for one very nice girl, are useless and really could care less about you. The simplest hotel task of requesting a extra coffee seem to be a bother for them. All the guest we spoke to in our week there were very dissatisfied with this hotel and staff. DON'T be fooled by the pics & web site for this place.", "Date": "July 24, 2006"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Maryland", "Title": "“The Reviews on Here Cannot be from Actual Travellers”", "Author": "traveling81", "ReviewID": "UR5501774", "Content": "We considered staying here since it was in the top 10 hotels in OC according to Trip Advisor, and is advertised as being pretty new. We decided however to wait until we got out to OC to pick where to stay just to be safe. All I can say is, see it in person and you will just keep driving. Compared to all the big, nice brand name hotels in OC, this looks like a run down old condo building in the Harrison Hall class. The prices are pretty high for this class of hotel also. Me and my wife just saw the hotel, laughed, and decided to go to Park Place instead since they had open rooms. The Monte Carlo is between another building, and the street...so the location is okay, but parking seems very tight. Also during our stay at Park Place there were two ladys standing outside late (like 2am) complaining because there was no one at the front desk to let them in. I really think that the managment of this hotel is loading TripAdvisor with fake positive reviews to lure unsuspecting travellers in (notice how they respond to anything negative blaming the customer)? I hope that anyone who reads this takes the other reviews with a grain of salt.", "Date": "July 24, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Virginia", "Title": "“Disappointed....”", "Author": "labatten", "ReviewID": "UR5491769", "Content": "I have mixed feelings about the Hotel Monte Carlo. I liked the location because it is so close to the boardwalk and the amusement parks. The rooftop pool, although nothing spectacular, was a hit with the kids. When I made reservations, I specifically noted that I needed 2 adjoining rooms or rooms next door to each other because I was traveling with children. When the hotel called me on the phone to confirm, the young man told me that this would be \"no problem\". When I get to the hotel to check in, I am told that not only do they not have adjoining rooms, but they can't even give me side by side rooms. Well, what could I do? The young man at the desk could have cared less. The rooms are sufficient, but definitely not the cleanest and the motel is very noisy at night. I know that I will be back to Ocean City, but not to the Hotel Monte Carlo.", "Date": "July 20, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Looks are decieving!”", "Author": "cindyrhall", "ReviewID": "UR5487473", "Content": "We chose this hotel based upon the information and photos provided on its website. Our stay was for only 4 nights and the only positive attributes about this hotel was the location which is a half a block off the boardwalk and beach the the young staff at the registration desk. Other than that our experience was extremely disappointing. The building's facilities which is only 6 years old is run down and in need of cleaning and repair. A number of the pool lounge chairs were broken and they we not even enough chairs for the registered guests. The website portrays much atmosphere but there was absolutely none including around the pool and the hottub. The hottub water was dirty and green in color and full of sand. At check-in we noticed our room's coffee pot was dirty and full of mold and mildew. The replacement was only rinsed out and still dripping wet. The third replacement was out of the box. Our shower head was broke and not usable for showers and it took two day of complaining before we were moved to another room but only after demanding it. No effort was made by the Manager to repiar in a timely manner. The young folks at the front desk were very polite and helpful but did not have the authority to do much without the Manager's approval which made it very difficult to resolve any issue. When we given a new room the air conditioner was in need of repair but since we were only there for 2 more nights we managed. This hotel has plenty of potential but is managed poorly and has absolutely none of the atmophere as portrayed on the website. I would not go back nor would I recommend it to a friend or acquantance.", "Date": "July 19, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Baltimore", "Title": "“Not worth the $$”", "Author": "Jazkat74", "ReviewID": "UR5430212", "Content": "I paid a lot of money for a romantic room with a jacuzzi. Yes, I got the jacuzzi but if you can envision a plain room, with dingy carpets, and a nice window view of a brick wall, then you can understand why this was not quite the room I expected. Also, the pictures on the website are somewhat misleading. The photograph of the pool on the roof makes it look wonderful. But in reality, its on a big cement slab (the roof) next to a little hot tub that can hold maybe three people comfortably. Parking is also extremely inadequate. They have three small lots. If you're lucky, you can get a spot in the parking lot thats more than two blocks away. And don't dare bring a second vehicle. They will tell you to park it in public parking. To the hotel's credit, all the necessary amenities were in my room: microwave, tv, refrigerator (not a very cold one), etc. If you want a romantic room with a nice jacuzzi that's in Ocean City, go to Comfort Suites located in the Ocean Gateway. I will not be returning here.", "Date": "July 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“The worst hotel in Ocean City”", "Author": "A TripAdvisor Member", "ReviewID": "UR5234222", "Content": "This was the absolute worst place I have ever stayed in my life. The rooms were small and dirty. There was noise in the halls all night, which the management staff did not have any control over. People were pounding on our door at 2:30 in the morning then again at 4:30 each time trying to get into our room. Customer service, these people do not know the meaning of customer service, when we asked for the name of the Owner, the manager just told us to get out and never come back, we never used profanity, and might I add, we are all women in our late 40's. The manager told us that he opens all the mail and throws away the complaints, when asked if he opens up mail that is not addressed to him, but the owner, he said yes. We ended up going to the Holiday Inn on 67th the next morning. The same price and much nicer atmosphere, we also had an oceanfront room.", "Date": "May 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Great Family Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5007417", "Content": "We just returned from a few night stay over easter break at the hotel monte carlo. This was our first stay and we were extremely happy. The room had all the ammenities perfect for our family of 4, which included a microwave, refrig., coffee maker, toaster, iron and ironing board, cable t.v. with disney and hbo. Inside the hotel there was also a subway which was perfect for lunch and they also served breakfast sandwiches. The indoor heated pool was definitely the kids favorite. The location being right off the boardwalk was probuly mine. Just a hop skip and a jump away from the amusements and games. It was actually quite busy during this week up to easter, but the hotel was always very clean. The staff quite friendly and engaged in conversation with us several times throughout our stay. We may not be back to Ocean City this year, however next year the family and I will return to the Hotel Monte Carlo.", "Date": "April 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Pasadena, MD", "Title": "“A pleasant stay at the Hotel Monte Carlo”", "Author": "OCB'Walk", "ReviewID": "UR4993804", "Content": "The Hotel Monte Carlo - A pleasant stay at OC, MD We stayed June of 2005 and overall it was a nice place to stay. Our room was clean, with a partial ocean view. We talked with the assistant manager several times during our stay and was pleased with the courtesy of all the staff we come in contact with. The only negatives were the small lobby and elevator and the smallish parking lots. Probably rate the hotel alittle better than average.", "Date": "April 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Stay every year!”", "Author": "Savanah", "ReviewID": "UR4499466", "Content": "I have just started using trip advisor recently and was so surprised to see a bad review about the monte carlo. My family and I have stayed at the Monte Carlo every year since it opened and we love it. I have a 5 year old and an 8 year old and I cannot imaging where else I would stay to be so close to EVERYTHING! The hotel is safe, clean and convenient. I highly recommend going to the hotel yourselves and seeing what it has to offer. Even if you have already booked somewhere else swing by there during your vacation and check it out. Maybe I am parcial to the monte carlo because I stay there every year now but I wouldn't keep staying there if it wasn't the best location for my family. Make sure you see the rooftop pool deck, that's where we watch the fireworks for the forth of July every year. Good luck with your vacation planning.", "Date": "February 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“horrible experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR4389522", "Content": "I saw all these 5 star marks and thought to myself are they talking about the same hotel that I stayed in? When I checked trip advisor couple of months ago they had all these bad reviews and all of a sudden they have all these 5 star reviews sounds fishy. Well let me start with the pool. Indoor pool is a joke, it is very small. Hotel rooms have no ocean view what so ever since there are 2 hotels in front of the hotel. I do agree it is located at a convenient place and really close to the beach and all other cool stuff but the hotel itself is horrible. Awful customer service. Tried to talk to the manager about our problem (housekeeping didn't clean the room as they were suppose to, bed sheet was filthy so was the bathroom), but couldn't get hold of him. It is so not worth the high price they charge. So my family and I have decided no matter what we are not going back to this place. For the readers, don't believe everything you read in the other reviews, ask real people who have stayed there. If you really don't believe me go there and check for yourself but please do write a review after you experienced it yourself so that other travelers can know the truth about this hotel.", "Date": "January 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Very Nice, Fun Time”", "Author": "A TripAdvisor Member", "ReviewID": "UR4334528", "Content": "I would suggest the monte carlo to all who want to have fun in the sun. we all went down from jersey last june. the pool and jacuzzi is where we hung out most of the time. boardwalk and beach were just a couple of feet from the hotel. this hotel is located in the heart of it all. very conveiniant to alot of fun and food.", "Date": "January 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Loved it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4192905", "Content": "My fiancee and I stayed at the Monte Carlo Hotel in August of 2005 and I must say, we definately loved it. We go to Ocean City often for a couple days here and there, but because of how nice our stay was, we have already planned to return for an entire week in August of 2006. The guest service was wonderful (All the way up from the time I reserved my confirmation and made payments over the phone until the time we checked out). The rooms were clean, and the service was very fast. We went out to lunch everyday for an hour and came back to change and in that hour, everything was refilled, beds were made and everything was spotless. The only small minor complaint I have is that the pool was shallow, but it's a very small price to pay for having a pool on a roof with a wonderful view. From the jacuzzi, you could see the ocean, the bay and at night the view of the downtown amusements was gorgeous. It was right around the corner from the boardwalk and beach right in the midst of all the fun! I would definately return again!", "Date": "December 6, 2005"}], "HotelInfo": {"Name": "Hotel Monte Carlo", "HotelURL": "/ShowUserReviews-g41298-d498362-Reviews-Hotel_Monte_Carlo-Ocean_City_Maryland.html", "Price": "$86 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">216 North Baltimore Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "498362", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/ad/32/08/filename-mcdd-jpg-thumbnail0.jpg"}}