{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good value, great view & ... remarkably peculiar!”", "Author": "nydp2003", "ReviewID": "UR126471685", "Content": "This hotel is not the easiest place to find (our cab driver was really confused...) since it takes only one floor of a building otherwise occupied by financial companies (Morgan Stanley is one floor below...). The good news is that all rooms are located in the 40th and last floor being impossible not to get a great view of Chicago. Plus, our room was huge and it had a nice couch just by the window to appreciate the view. It was also very quiet and at times we felt like we were the only two people in the building (although there were obviously other guests). The decor of the room was a bit odd with antique-oriented (or some just old-looking) furniture, faux(?)-marble in the bathroom and some more modern looking appliances (ugly bedside table alarm clocks, anyone?). That didn't really bother us but if you are into fancy-looking luxury hotels this is definitely not the place for you. Another peculiarity is that you need to switch elevators at the 39th floor to get to the hotel and when going down for breakfast at the 3rd floor \"athletic club\", you need to change elevators twice: once at floor 39 and another time in the lobby to go back up to floor 3. To compensate, breakfast and the use of the athletic facility (good looking pool, squash and golf areas; we didn't have time to use them) are included, which makes this hotel an even better value. Although the location is not perfect since the area just north of the river is much more interesting to go out at night, it is still pretty good: it's one block south of the loop, a few blocks from the Willis (Sears) tower and it has great access to transportation, including the El and the subway line to the O'Hare airport (important, since taking a cab or a shuttle bus from O'Hare sets you back 31-40 bucks+tip! Ouch!). As negatives, we should point out the low and variable pressure in the shower and the fact that the beds were too soft, although some people might like it. Otherwise, we had a very pleasant stay.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kentucky", "Title": "“I hope no one reads this review!!”", "Author": "KyDrew", "ReviewID": "UR126014904", "Content": "I will stay here every time I go to Chicago for a weekend. If you don't need a barista in the lobby, this is the place for you. Enter from S. Financial to lobby for ease of finding your way around hotel. The staff is excellent. Hotel is tremendous for romance, views, and inexpensive beyond belief. It has a great pool and athletic club but will have try that next time. Yes, I had the fluctuating water pressure for a few minutes in shower but everything else makes it great hotel to stay in. Views in my suite went from Soldier Field, Adler Planetarium to Lake Michigan to Chase Building to the Willis Tower that seemed right next door. The breakfast was fine, light and really healthy (like a real continental breakfast) fresh fruit, pastries, coffee and juices. If something ran out, the staff came and refilled. Minibar in room not expensive either. Room could you use mini fridge. I can't wait to go back!", "Date": "March 12, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Lovely views”", "Author": "shellyship", "ReviewID": "UR125301839", "Content": "I really enjoyed our 2 night stay here. Nice breakfast, lovely clean room, good wifi, lovely views ,lovely bed. The gym/pool looked impressive but we didnt have time to use it! Weird set up going up 2 different lifts but who cares, it didnt bother us... I would certainly stay here again.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Fantastic views!”", "Author": "GAJoe", "ReviewID": "UR122773611", "Content": "Spent one night at this very unique lodging in the heart of the Chicago financial district. The hotel occupies only the 40th floor of an otherwise upscale office building. As a result your room is 400 feet in the sky with amazing views of the surrounding skyline. Our room looked out to the north, enabling a view of the Willis (formerly Sears) tower, as well as a look toward the lake from our high perch. The room was beautifully appointed, had a couch with a bay window that facilitated our view all the more. Breakfast is provided as part of the room rate, provided at the athletic club dining room on the third floor of the building. If we had wished we could also have used the workout facilities at no additional charge. I highly recommend this place, you will love its location and the facility itself. One of the best hotel deals I've ever found.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Texas", "Title": "“Chicago 2011”", "Author": "NandM1982", "ReviewID": "UR118819164", "Content": "We were happily surprised. The staff was outstanding and our room was great. Beautiful view from our room. Room was very clean and very comfortable bed. Close to everything.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Cheap hotel in quiet area of city”", "Author": "W-Mark**", "ReviewID": "UR118388212", "Content": "The hotel is located right near the La Salle subway station which is on the same line as O'Hare airport although the trip is about 45 mins. The hotel reception is poorly sign posted when you enter from the entrance closest to the subway station. Most businesses near hotel closed on weekends. Rooms are big and cheap however are getting a bit tired. Dirty towels annoyed me however there were four in the room and most were clean. Breakfast is included however its a self serve arrangement with only 3 tables. You have to be fast to get anything decent and also time it right to get a seat at a table. We found it better to eat out. Good view of Lake Michigan from our room on the eastern side of the building.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great value, excellent view, good for a quiet business trip.”", "Author": "CaseyEllen", "ReviewID": "UR118145647", "Content": "I stayed with the athletic club because it was most affordable by far and fairly close (15 min walk) to my office. Location is kind of strange and sleepy since it's within a financial services building on the 40th floor. However, hotel was clean and very quiet. Decor was simple and slightly dated but experience was good. Staff is really nice an helpful. Would recommend for a tired business traveller.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Niles, Michigan", "Title": "“What a View!”", "Author": "sethsdad1", "ReviewID": "UR116355733", "Content": "This is a special boutique property. The suite facing east had a super view of Lake Michigan and the city. Directly in line with Buckingham Fountain. Bed very comfortable. All of the hotel staff was helpful and friendly with directions and finding the swimming pool and hot tub. Easy to get to Chicago attractions (like the ball park and shopping) with public transportation. We will stay there again.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Salem, WI", "Title": "“Great find in Chicago, this is our new standard!”", "Author": "pad_lake", "ReviewID": "UR115256804", "Content": "This hotel is very interesting. It occupies the top floor of an office building. As a result of this, the check-in, parking, finding, going up (and up then up again), etc procedure are a little clumsy. All that clumsiness (which considering they only have 21 rooms is managed expertly) was worth it once we got into our room! The room, a standard room, is spacious and had a fabulous view. We had a north view with Willis tower on the right and the lake on the left, and at 40 floors up, it's impressive. The room was also very quiet. With only 21 rooms at the property, even at capacity, this place would not be noisy. Our stay was a Saturday, so I would imagine that considering this hotel is located in an office building near the Chicago Board of Trade, it might be a little noisy during the week, but I can't comment on that. The bathroom was spacious with a deep tub and separate toilet room. The \"hall\" of the room had a wet bar but no fridge or microwave. Opposite the wet bar was another counter with the coffee maker (pretty good coffee) and some counter space we used to hold a cooler. The bed was comfortable, and while the El is below you, you only barely hear it if you really try (remember how high up you are). The \"athletic\" club is an executive club located on the 3rd floor of the building, was only open till 6 on Saturday and was closed on Sunday. We were able to get some use out of it, and it was very nice. Would have been very disappointed if it had been closed the entire time were there (i.e. if we had checked in after 6 and only then maybe had Sunday - club claims seasonal hours on Sundays). The travel procedure to the club is similar to the parking, involving three elevators. I don't think the club and its amenities are well designed for kids, as we don't have any, but you may want to call and find if kid friendly. The parking garage (oh yeah, they say it's $32 / day - we only paid $21 - not well marked with accurate pricing) isn't well marked where you need to go, but once parked had to buzz a security guard to open a door, then cross another basement, then up the first elevator to the lobby. Deal with the nice and helpful security guards in the lobby, then the lobby desk to the hotel. Once checked in, took a second elevator to the 39th floor, transfer to the hotel elevator to go up one floor, then finally there. The lounge is nice and equipped with an office computer and a southern view. The ice machine really needs to be higher powered as it barely kept up. The continental breakfast was good and sufficient, no complaints. The wireless internet (free) seemed sufficient and fast enough for what we used of it. We peeked into the restaurant (smelled fantastic) and it seemed very upscale (we were concerned with dress code). Looked at a menu, and it was a little out of our price range for the evening - they provide \"course\" meals starting at 90 / person, but the selection looked great and the guards in the lobby were chatting it up between themselves. Overall, the view and seclusion of this hotel give you a nice homely feel, and it quickly became our \"place in the city\" when we come visit.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“GREAT stay in Chicago!”", "Author": "Patricw03", "ReviewID": "UR114969902", "Content": "First of all, I haven't read any of the other reviews, so please forgive me if I repeat something. My wife and I stopped through Chicago for one night on our way back to Atlanta. We stumbled upon this hotel online and decided to give it a try. It was great! Finding it was a little tricky.....our GPS took us right to the front door, but we had to call to find out where the parking deck was. Once we parked, it was a little troublesome getting to the front desk, as the valet wasn't there at the time. Obviously, the valet parking would have made things easier. Everyone we encountered that worked for the BAC was wonderful. We checked in about an hour early and our room was ready. You do have to transfer elevators to get to the 40th floor, but it's really not a big deal. The room was spacious and comfortable and the view was just amazing. We were facing towards Lake Michigan, with the Buckingham Fountain right in front of us. But when you are 40 floors up, any direction has a great view. We were only there for a night, but the hotel was very close to the SkyDeck and some GREAT chicago deep-dish pizza. We went to the Field museum, which was not within walking distance, but the concierge was helpful in telling us the best way to get there (by car and by the train). Breakfast the next morning was simple, but perfect to get us going. The only problem we had was finding the actual athletic club. We wanted to take a swim, so we went to the 3rd floor. However, we were unknowingly on the wrong side of the 3rd floor, with a bunch of offices. This isn't clearly specified in their welcome packet, but again, the concierge was very helpful telling us how to get there. Once we were there, AMAZING! Th pool was huge and a nice cool (but not cold) temperature. The spa was enormous and relaxing. There is a giant \"relax\" room with a tv and couches around the perimeter. We only wanted to swim so we didn't try any of the other work out related things, but it was all very nice. One thing that was a little strange.....the hotel is on the 40th floor of an office building. So during the day, you will constantly be sharing the elevator with businessmen and women dressed in their suits and ties and briefcases. Being on vacation, we felt a little underdressed in our sandals and t-shirts. Of course, around 5PM the business people leave for the day and it is much quieter. Not that big of a deal....just a little strange. Overall, we thoroughly enjoyed our stay. It was a great price and a wonderful hotel!", "Date": "July 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Amazing views!!”", "Author": "peterbell1", "ReviewID": "UR84871040", "Content": "I was in Chicago for a business conference and found this hotel as part of a flights/hotel package from the UK. It is on the 40th floor of an office block in the Downtown district. There is a reception desk on the ground floor and you then take two separate elevators to the top floor where the hotel rooms are located. My room was large, clean and comfortable, with large TV, cable channels, mini-bar, desk, lots of seating and fabulous views (my room faced north so I had Sears Tower on the left and Lake Michigan on the right). You get free wireless internet access in your room and a free continental breakfast which is served in the lounge, which also has fantastic views. There is a leisure club on the 3rd floor which I didn't have time to use. There are only 22 rooms so the hotel is quiet, but it is very safe because access to the building is controlled by security and there is also someone at the reception desk 24-hours a day. It is located in a business area so there isn't much in the way of nightlife in the immediate vicinity but there are plenty of shops, bars, theatres and restaurants only a short walk away. The hotel is easy to get to from O'Hare airport as it is next to a Blue Line \"L\" station, and there are also lots of other \"L\" lines very close, as well as a Metra overground rail station. A ten-minute walk takes you to the Van Buren Metra station which takes you direct to the McCormick Place conference centre. I'd definitely go back to this hotel if I was in Chicago for business or leisure.", "Date": "October 26, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Eeklo, Belgium", "Title": "“Turned out to be good value for money”", "Author": "PatrickMerlevede", "ReviewID": "UR76159698", "Content": "Th egreat thing about this hotel was the view, especially from the French Suite (Room 4011) in which I have been staying. On top of that, I was able to get a rebate because this hotel is associated with the Athletic Club of Missouri - I think I'll go back there the next time I have to go to Chicago.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Beverly Hills, MI", "Title": "“I felt decieved”", "Author": "cgemmy", "ReviewID": "UR36119811", "Content": "This hotel was not at all what I thought it would be. I do not think it should be rated as a 3 1/2 star. The bed was rickety ane hard and also had no box spring. The bathroom was not as clean as I would have liked there was hair on the floor that was not mine. The furniture is old and all chipped and scuffed. And the top bedding looked old and dingy! It was a pretty good price though", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Good stay”", "Author": "docmjc", "ReviewID": "UR35922763", "Content": "I booked on travelocity so I got a really good deal on the room rate. The hotel is overall very nice. It is quiet and isolated and it does have an exclusive feel to it when you check in. The room was very comfortable and the bathroom was very pretty. The view from the room was excellent with a combination of city lights and lake (we faced south). However, there were some dissappointments. The TV was ancient and did not work well. The access to the healthclub was an awesome advantange, however, it has extremely limited hours. They close at 9pm weeknights, 6pm on saturday, and they were not open at all on Sunday. The continental breakfast was diaappointing. It basically consisted of a bunch of day old bagels and pastries kept in the refrigerator and set out in the morning. The breakfast was not well stocked and was frequently empty and without coffee. Also, I tend to notice things about hygeine. It was a little concerning that the breakfast is stocked by the housekeepers while they are cleaning the guest rooms. I didnt really see the house keepers wash their hands or use gloves before handling the food on the breakfast bar. Overall, it was a good stay. Its well worth it if you get a steeply discounted price online, but i dont think i would pay the \"full rate\".", "Date": "July 27, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NY NY", "Title": "“Lovely Business Hotel”", "Author": "lizew0613", "ReviewID": "UR20372331", "Content": "I scheduled a business trip into Chicago unknowingly during the Lollapalooza concert weekend, and was not looking forward to the crowds of kids, the noise and inflated prices that normally pair with such an event. I am so happy I found this little gem. The beauty of this hotel is that it is 40 floors above all the negative distractions I knew would hamper my sleep and distract me from my work. The rooms are large and comfortable, the views are spectacular, and the athletic club is top-notch. Yes, getting to the gym required getting on another elevator. Compared to the garbage I've been through at other hotels and considering how amazing the gym is, two elevators are really not a big deal. If you are looking for a modern hotel engulfed by crowded bars and too much hubbub, this is simply not your place. If, however, you enjoy getting your 6+ hours of sleep, want the beautiful views and like walking around the incredibly safe, historic downtown Loop/shopping district, do yourself a favor and book your stay at the Buckingham.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Not too Stellar”", "Author": "Niffermc", "ReviewID": "UR18606651", "Content": "We checked in around 11:30 pm. Bathroom toiletries were not replenished, and there was no bath mat. When we went to sleep, we took the pillows out of the closet, the cases had been used. They ran out of magnetic passes. We finally got one the morning we were to leave. This created a constant hassle because the hotel is incased in a security zone. Parking is expensive. The garage is run separately .The people at the hotel could not tell us the cost. I can tell you now, it is $32/24 hours and there are in and out fees, so if you take your car out, you will be charged more. Both times I left the garage, there was a problem. Once the card could not be read and the other, no receipt from the machine. Both times they had to hand write a receipt for me as I was on business. I'm still not sure I will get reimbursed as the receipts were written on scratch paper. Beware of the hot buffet breakfast. The complimentary pass only covers one person from the double room. And I did find all the switching of elevators inconvenient.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pataskala, Ohio", "Title": "“Wonderful 4-day get-away”", "Author": "HappyTraveler54", "ReviewID": "UR16636872", "Content": "We had a wonderful stay at the Buckingham. Room was very spacious and clean, we loved the use of the Athletic Club and did not find the transfer of elevators to be a problem. Everyone at the Athletic Club was very friendly and willing to make us feel comfortable. The free continental breakfast at the hotel was just enough for us to get started in the morning before we took off for the day. The hotel is close to a train station so we were able to hop on and get just about anywhere within minutes. We would definitely stay there again.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Can't recommend enough”", "Author": "CarolineMHG", "ReviewID": "UR14883022", "Content": "This really was a cracking find. I travelled to Chicago on business from London and for a single girl in her twenties this place couldn't have been better. It's bang in the middle of Chicago's financial district. Don't expect the area to be rocking at the weekend ('though it will be during the week) - it's akin to The City - but the view from the rooms is utterly spectacular. I had a city lake in one direction, and a lake view in the other. It's on the 40th floor, so you feel totally safe. You're also given full access to the Athletic Club downstairs, where the service and facilities couldn't be better. The pool/spa are lovely and there's a full towel/everything service down there. They also had a Wii in the foyer while I was there, but I'm not sure that's a regular fixture! A continental breakfast is served in the lounge every morning. You can take it back to your room if you want to - I took it back to the sofa in my room where I could eat and admire the view! I had a bar area and tea/coffee facilities in my room, as well as a TV and wireless internet and a big work desk (important!). The bathroom was very big, and the loo separate... basically I had everything I needed, and if I needed anything else, the staff were very helpful. I should point out that it's not brand spanking new, but if cool, boutique hotels are more your style than generic chains, this place may well be for you. Ring them directly for the best value deal. Considering all the available facilities, it really is great value. The location is in the financial district. The blue line train is a 30 second walk from the hotel and that goes straight to O'Hare airport (40 mins and costs $2). It took 25 mins and cost $50 in a taxi. Also, I walked to Millenium Park and the Art Institute (12 mins) and up to the Magnificent Mile (30 mins) - it's a very nice city to walk around (if a little cold at times!). I agree with all the previous positive reviews on this site - though not sure about the one that moaned about the access to the health club being awkward. You access the hotel and the Athletic Club from the ground floor. One lift goes to the hotel (40th floor) and a different one to the health club on the 5th floor - It's really not difficult or awkward and I think having a full 25m pool on the 40th floor of a building might be a little implausible!!", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Indianapolis", "Title": "“Enjoyable Stay”", "Author": "John_Hale", "ReviewID": "UR7841494", "Content": "We stayed at the Buckingham Athletic Club Hotel the weekend of June 8-11, 2007. It was a great experience. Located on the 40th floor of One Financial Place, an office building at LaSalle and Van Buren, the hotel was clean, quiet, and a perfect backdrop to a 30th anniversary trip. Although located in the financial district, the Buckingham is serviced by both elevated and subway lines located just north and south of One Financial Place. The Sears Tower, the Harold Washington Library, and Printer's Row are just a few blocks away. Going west on Van Buren are several restaurants, bars, and eateries, although many close over the weekend. Just west on Congress is Tutto Italiano, an Italian restaurant we enjoyed located in part in an old railway car. A listing of area restaurants can seen at http://www.urbanspoon.com/ps/2/212/Chicago/Hotels/Buckingham-Athletic-Club.html Staff were on the whole friendly and helpful. The elevator transfer on the 39th floor was no hassle. Views were fabulous from our north side room, but try to get one of the east side rooms; the views of Lake Michigan we glimpsed through open doors were fantastic. Our only concern was that a slowly draining tub was never repaired during our visit though mentioned to the front desk. But we would gladly return for a visit to the Buckingham.", "Date": "June 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Round Lake Beach, Illinois", "Title": "“Beware”", "Author": "RbrtJnc", "ReviewID": "UR7390529", "Content": "We live in the Chicago suburbs, about 40 miles away, and occasionally spend a weekend in the city. This hotel was horrible from start to finish. We arrived at their address on LaSalle on a Sunday late afternoon, and found that there is nothing to indicate that there is a hotel anywhere. It's called \"One Financial Center.\" So it's a business building in the financial district and the hotel is on the 40th floor. My husband had to run into the lobby and ask if this was indeed the Buckingham Athletic Club Hotel and where to park. He was told to go around the block where there was a parking garage. We drove around and found no valet or anyone with instructions about where to park. We finally just parked in a handicap spot (I am disabled, in a great deal of pain, and walk with a cane). Had no idea how far away the hotel was so left the luggage in the car. Finally found the lobby, loaded with security people, and were directed to a bank of elevators which would take us to the 39th floor, then we would have to change elevators to get to the 40th floor. Once there, we registered, were told we had parked in the wrong place and would have to move the car. No bell hop to help with luggage. The only hotel employee was the man at the desk, from whom we eventually got word that the restaurant was not open on the weekends! He had no suggestions for us, but when I called him back from our room, he finally discovered a couple of take-out menus that might deliver. No room service. There was nothing within walking distance except a Dunkin Donuts (and for me that was a long, painful walk). The hotel brochure gave almost no information. The room was fine with a nice view of a lot of buildings...been there, seen that. No big deal. So we had cold ribs and cole slaw delivered hours later to our room to the tune of $55.00. And the room was supposed to have a CD & DVD player but didn't. There are not many cabs that drive by and Mr. Frontdesk does not help in calling cabs. When our blinds were broken and would not come down, Mr. Frontdesk doesn't know how to fix them either and there are no other employees around, except the maids from 11am to 1pm. There is a Continental Breakfast consisting of bagels and Corn Flakes. Wow. To get to the famed Athletic Club & pool on the 3rd floor, you have to take the elevator from the 40th floor to the 39th, take another elevator to the 1st floor, and another elevator to the 3rd floor. If you are not a member of this Club, you don't get a lock for your locker. The pool is fine, there's lots of exercise equipment and crowds of Club members. We both arranged to have a massage, which cost more than the hotel brochure said it would. We are familiar with Chicago so we walked a lot to find cabs and had a great time hearing the Chicago Symphony Orchestra, eating at Joe's Seafood and Stone Crab Restaurant, and listening to music at Pops for Champagne. It would have been a great time except for the dreadful hotel. Stay almost anywhere else. I was in pain for a week afterward. A little advance information on this hotel's deficiencies would have warned me off. This is a 3-1/2 star hotel??", "Date": "April 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Best hotel view I've had”", "Author": "TheBigMog", "ReviewID": "UR5883542", "Content": "After asking for detailed directions from the CTA stop, the trip to the 40th floor went flawless. Using two elevators located 10 feet from each other is certainly not a hardship. The room was huge and clean, the bed was comfortable, the view towards the lake was magnificent. Very convenient to carry only the swipe card to get to the elevators (leaving the room key, yes an actual key, with the desk clerk. Had a nice soak in the tub, which was a good size, and had a sloped end to lean back on (with a towel for support of the head). As is the case with what I imagine is all the hotels in the Loop and Magnificent Mile, a lot of Chicago is in walking distance. I'd definitely stay here again.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Farmington, Utah", "Title": "“Gem for Independent Travellers”", "Author": "Danese", "ReviewID": "UR5816320", "Content": "Took the CTA from O'hare to Buckingham Athletic Club. Went across the street directly into the secure building, we took 2 elevators to reach the Hotel. Traveling with family we booked a suite. We contacted the Buckingham Athletic Club to alert them of our late arrival and request 2 twin rollaways placed in advance. Our suite was perfect with the beds already set up, plenty of room for the 4 of us. A view of the city, river and lake. The location was central to several \"El\" lines. We did need to leave the financial district to get to the lively spots of Chicago in the evening. I loved being so near the Library, it was a excellent marker and we never got lost. I really liked the style of furnishings and the marble bathroom was great. My only complaint was the glasses in our room were never cleaned. We'd have coffee with our in-room coffee maker and beverages in the evening. After maid service the glasses still appeared dirty. I just ended up going to the continental breakfast to swipe glasses. Even some of those were yucky, ended up going with styrofoam cups. The wireless internet was unreliable. The staff were impersonal, but we didn't need pampering. The property is supposed to have a marvelous gym, we were so busy we didn't have time to try it. It was closed on Sunday and only open til 9pm through the week. We did leave a little cosmetic bag in our room and after contacting the hotel, it wasn't located. In spite of those little things, I would still heartily reccommend the Buckingham Athletic Club for the business or independent travellers.", "Date": "September 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“Well-kept secret”", "Author": "Sarah555", "ReviewID": "UR4335570", "Content": "I found my stay at the Buckingham Athletic Club to be very comfortable. The room was a very good size with a massive bed and a nice bathroom. Wireless internet was free of charge and a basic buffet-type breakfast was served in the lounge every morning. Of course the best bit was the view from the enormous picture windows. I stopped shutting the curtains at night as the view of the skyscrapers lit up at night was so lovely. I was a bit concerned on arrival that being in the financial district would leave me a bit 'in the middle of nowhere', however found that it was not far to walk to find good restaurants nearby. Also, transfer to and from the airport was very easy as the hotel is situated right next door to the Blue Line on the CTA, which means you can get to and from the airport for less than $4 total, and without having to change trains. I can't say that the issue of needing to take two elevators to get to the hotel rooms was really cause for complaint. In fact I felt a lot more secure in this hotel that in many others, especially as you need a security pass just to enter the building. I did have an issue with the lack of signposts as I found myself wandering into the exclusive 5 star restaurant with my suitcase as I couldn't find my room on arrival. My only other gripe was that I could have sworn that I read somewhere that the hotel provided room service - this was in fact one of the reasons for booking a room there as I'm not that keen on eating out alone. It turned out that there is no actual room service but they will give you a list of take-out places that will deliver to the building. During my stay I bumped into somebody who was attending the same congress as me in Chicago. He said to me \"How did you find out about this hotel - I thought no-one knew about it except me! Promise you won't tell anyone else\". It seems the Buckingham Athletic Club is a very well-kept secret and I would certainly stay here again on a future visit to the city.", "Date": "January 10, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sherman, IL", "Title": "“Only for the single business traveler”", "Author": "GoFar6", "ReviewID": "UR4164288", "Content": "This hotel is really set up for one person, staying in the financial district for work. There is only one room with 2 double beds and the rest are singles. There is no lobby area and the staff seems befuddled with hotel guests. The security guard downstairs almost prevents you from reaching your room. The room is very nice but basic. Also, the fitness center is 3 elevator rides away. I definitely would not recommend this for people traveling with families.", "Date": "December 5, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago", "Title": "“wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR3208020", "Content": "I don't enjoy big chain hotels, so Buckingham was perfect for me. A discreet, boutique hotel that's close to one of my favorite parts of the city. Great security. Wonderful staff. Amazing views. Can't wait to get up there to see the fireworks on the lake this summer!", "Date": "February 18, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Chicago, IL", "Title": "“Never again.”", "Author": "TravelerChicago", "ReviewID": "UR3010639", "Content": "No room service, staff also very uninformed on area dining. Terrible hassle to get to the hotel through security. Large rooms but badly in need of remodeling. Our toilet was not working and it was not fixed for hours. Overpriced. The only good thing about the hotel was the view from our room of the lake. Would not stay again.", "Date": "January 16, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bandon, OR", "Title": "“Location, Service and 40th Floor. What a Value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2598588", "Content": "I stayed there a couple weeks ago....wow what a great location in the loop...Large rooms, Everest a wonderful restaurant steps away... Hotel Staff makes you feel at home.", "Date": "September 24, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great time”", "Author": "A TripAdvisor Member", "ReviewID": "UR2581485", "Content": "I stayed at The Buckingham Athletic Club for a couple days and had a great experience. The hotel rooms are very spacious and the views of the lake and the city are beautiful. The athletic facility is similar to a spa with the steam room and sauna and is a full health club. The location is good, and most of the museums and shopping are a short cab ride away. I will return.", "Date": "September 17, 2004"}], "HotelInfo": {"Name": "Buckingham Athletic Club", "HotelURL": "/ShowUserReviews-g35805-d498305-Reviews-Buckingham_Athletic_Club-Chicago_Illinois.html", "Price": "$160 - $266*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">440 South Lasalle Street</span>, <span class=\"extended-address\">40th Floor</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60605</span></span> </span> </span> </address>", "HotelID": "498305", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d7/55/d755ead4e5511e9eddf3c5082a9e499023large.jpg"}}