{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Aberdeen", "Title": "“Weekend away”", "Author": "John B Posted by an Easytobook.com traveler", "ReviewID": "UR128153657", "Content": "The Hotel is clean and very friendly but not a flashy joint. It is not to far from the centre on a 25 tram which leaves from outside the hotel along the road a short distance. There is a lovely park across the road and a cafe. Ok for a weekend away.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3"}, "AuthorLocation": "Parkersburg, West Virginia", "Title": "“Average Stay”", "Author": "emilymetz", "ReviewID": "UR128126437", "Content": "My boyfriend and I (we're both 20), went to Amsterdam for the weekend. We stayed 2 nights here. The Building itself is quirky, the very narrow steep typical staircase of the houses in Amsterdam. The bar is extremely well-kept and although we did't breakfast here (pretty highly priced) I can imagine that the food tastes pretty good and is also of good quality. The huge Mac PC's are a great thought, and are free to use! very big plus! The desk staff was EXTREMELY helpful!!! He answered every question I had, helped mark the way on a map, and ordered us a taxi for our early flight. The only complaint I have about the whole place is that I feel a little mislead by the pictures posted here. Our room was clean, but the overall appearance wasn't that great. But if you're not a luxury traveler, there's really nothing to complain about here. ALSO, the location is really good. Within walking distance of bars and pubs (but still a quiet stay), very close to a WONDERFUL street market that we loved, and not too far from the Heineken experience. Overall, good stay.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Argyll, Scotland", "Title": "“Good value, helpful staff”", "Author": "M00ndancer", "ReviewID": "UR127975369", "Content": "I stayed here just for one night with my daughter and grandson on a whistlestop tour of Amsterdam. It is a little out in the suburbs, but in a very pleasant green location and ideal or a visit to the Albert Cuyp market. It is about 15-20 mins by easy tram journey from the cit centre. We really ony slept and had breakfast there, but the room was very clean and nicely decorated, the beds extremely comfortable and there was also a lift in the property. The breakfats was an unlimited supply of breads, meats, cheese and cereals, a good start to the day. Staff were very friendly and helpfu. Would stay again.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Fine Hotel, nothing fancy”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR127664467", "Content": "The Hotel is ok. The rooms are tiny, but I guess-concerning the architecture- this is common in Amsterdam. The room was clean and the staff of the hotel is friendly. There is free Internet access. Some negative aspects are the noisy street, the walls are thin and the TV did not work properly. Besides that the area the hotel is placed in is nice, you can either walk to city center or take the tram right in front of the hotel. We did not book the breakfast, because we thought it was cheaper to buy something to eat somewhere else, but the breakfast buffet looks good and maybe it would have been a bit easier to eat in the hotel. Overall it was an ok stay.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice and clean”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR126172404", "Content": "Stayed for a long weekend in March. Didn't know what to expect due to various reviews but we had a spacious and clean room. Only negative was when we rented the bicycles the hotel offers. Our bicycles had flat tires so we had to turn around and exchange bikes,which took us over the 3 hr limit so the hotel charged us for the full day.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "North Wales", "Title": "“Great hotel for price”", "Author": "dawniewalsh Posted by an Easytobook.com traveler", "ReviewID": "UR126153412", "Content": "Great area, right by tram stop number 25, which you can get from central station. Nice park opposite hotel. Supermarket around corner, and nice cafe along the road. We were in a large group, we found the twin, tripple and quad rooms a decent size, double was small though (double had only a shower, other rooms had full size bathrooms, plenty of hot water). Beds were very comfy and rooms were spotless. Had no trouble with noise, had read it was noisy but we were not disturbed on our stay,", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Dam Good!”", "Author": "David M Posted by an Easytobook.com traveler", "ReviewID": "UR125800268", "Content": "Clean and comfortable, room a little small but we were only in there to sleep and get ready so exactly what we needed. Location - we knew where it was located before we booked so expected a walk to get there and we were in the Dam for sightseeing too so were happy the mooching around. Not a far walk from the Heineken Brewery, a must for a every visit.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Nice Hotel in a decent location”", "Author": "David P Posted by an Easytobook.com traveler", "ReviewID": "UR125118899", "Content": "I enjoyed my stay at the Aalbourg Hotel. Staff were very friendly and helpful, without being imposing. The Bar had two shiny imac's with free internet, which was very handy + free wifi throughout the hotel. My room was fine, I expected a work desk for my laptop, but the only place to put it was on the small bedside table. The shower/ bath design was very strange and awkward to use: it consisted of a deep and shallow end! For the price, facilities, staff and location: I think that this hotel is a good option and I would certainly stay there again.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“average, small room”", "Author": "dentart", "ReviewID": "UR124441368", "Content": "Too small room for 4 people (there was no space for our luggage). Clean. Staff friendly and helpful. No private parking (expensive parking on the street) Good hotel for one night.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Below the standards”", "Author": "czurczman", "ReviewID": "UR123011915", "Content": "The location of the hotel is really great. It's facing the park and is very close to the city centre (about 5mins walk). The neighborhood is quiet and typical old Amsterdam look. The breakfast does not makes you wow!, but still with the solid quality and standard - cereals,milk, yoghurt, some variety of bread, eggs, ham, cheese, cucumber, cherry tomatoes, honey, several kinds of jam, butter, tea, coffee,water, orange juice. The standard of the room, especially the quality of furniture and bathroom made me feel to be more in the hostel, not in the hotel, so don't be allured by the pictures - interiors do not look so glamorous. The room was very small - there was just the bed (pretty comfy, though), small desk with chair, very small space imitating wardrobe (it was hidden behind the mirror), few wooden shelfs and a tv (on the desk). The space designed to move from front door to the window was very narrow (standing there you have to sit on the bed to give other person free way) as well as from window to the bathroom (opened small suitcase was just enough to fit). Hairdryer did not work.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A bit disappointing.”", "Author": "Tess M", "ReviewID": "UR122828164", "Content": "We chose the Aalborg because it was a decent price for our budget in expensive Amsterdam. It was fine for a few days, but was really quite average and I think we could have found something better for our budget if we tried. The hotel is out of the city centre, about 30mins walk. The walk wasn't so nice in the pouring rain though, and hourly tram passes are quite expensive at â‚¬2.60 each. Our room was okay- I was expecting it to be small from reviews but was still surprised. There was barely any room for our bags, and very little space between the bed and wall. The bathroom door wouldn't close properly, and had a small hole in it anyway. Our tv was fuzzy and didn't give many channels, but the bed was fine and everything was clean. The staff were friendly, and gave good recommendations for dinner. Something that concerned us though, was security. We had to get buzzed in to the hotel from the street, but the staff didn't necessarily know us when they allowed us in. Then we told the staff member our room number and they simply handed over our key (which we had to leave in the office when we were out), not asking for a name or anything. Anyone could have said they were in our room, which made us a little uncomfortable. Of course, we never had a bad experience, but it was a concern during our stay. Having said this, our stay was fine. We didn't have a high budget, and we got what we paid for. Enjoy your stay in Amsterdam!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“GOOD LOCATION NICE HOTEL”", "Author": "wolfhen69", "ReviewID": "UR122413337", "Content": "Good hotel good level. Although we exchanged 3 rooms that first room was on the road, no heating and a TV remote control not working Second room with floating bath and room 3 was finally correctly. Reception manager was not nice and makes a face on each request and only after pleading changed us the room. No safes in rooms as advertised anywhere. Clean tidy hotel in a good place. Breakfast is worth the 9 euros take it. all over nice hotel price for those matters", "Date": "January 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bergamo, Italy", "Title": "“Cheap but not good value”", "Author": "fanharuka", "ReviewID": "UR119600738", "Content": "Business trip to Amsterdam and our travel agent booked me a room at Aalborg. Cheap of course (98,00 euro for a room without breakfast), but old and over used. Honestly it was clean, but room furniture really ugly and bathroom accessories original vintage pieces from '70! Furthermore, i had a room on the road side and it was so noisy. I think i never use again and I suggest to avoid it if you are not a younger in Amsterdam for happy adventures.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“As Dutch people we feel we may say this is BAD!”", "Author": "Liemtraveling", "ReviewID": "UR119325140", "Content": "Room on the ground floor was very dark and smelled like your grandma's attic. Bathroom full of mold and very humid. Matrass full of pocket springs. There is better places you can find if you're spending this money. Look further!", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location.”", "Author": "Peter C", "ReviewID": "UR118874767", "Content": "This hotel is located in a great part of town. Some of the rooms are small, but clean enough. The hotel can get noisy at times, particularly on the weekend, so wear earplugs. The staff is all very helpful and the area is quite a nice one, with lots of services and restaurants.", "Date": "October 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mount Dora, Florida", "Title": "“Great location”", "Author": "geeno34461", "ReviewID": "UR112483386", "Content": "Prime location opposite a park, many cafe's, restaurants within 15 min walk.The main street market of the city 10 mins away full of bargains. The museams were within walking distance, aswell as the Heineken experience a must visit. The only time we took the tram was to the central station apon arrival & departure. The hotel was clean & well run, the rooms are small like every other hotel I guess, just don't use the stairs unless you have too very narrow & steep.What a great city very laid back & freindly beware of walking in the bike lane though!!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Great hotel in a good location!”", "Author": "OmOmSplat", "ReviewID": "UR109228152", "Content": "The hotel is clean, the staff are friendly, and the location is great! There's a tram stop only 5 minutes walking which takes you to Damm Square in 10 minutes. The walls are a little thin though (just like all of europe) so it's hard to sleep in when housekeeping are cleaning other rooms around you..the rooms are also tiny, but you just go there to sleep anyways..", "Date": "May 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "3", "Location": "1"}, "AuthorLocation": "London", "Title": "“The Seediest Hotel in the World!”", "Author": "DreamingHeaven", "ReviewID": "UR102964213", "Content": "Rarely has a hotel made me feel like I could have scrubbed forever and still never felt clean. This was booked for me, so unfortunately didn't get to pre-view it. Having said that the website for the hotel looked quite nice, but I queried the black and white pics as they mostly make things look smart! On arrival my radar peaked as the entrance looked 'worn' the reception was cramped and an odd smell hit me as soon as we entered. The guy on reception was the only high point of the entire hour we spent there!! So much so that he even printed the details for the hotel we were moving to! The room was disgusting, and gave the impression that payment per hour was rather apt! There was mould on the bathroom wall, stains and cracks all over the walls and ceiling and a VERY suspicious stain on the throw. The lift was out of the 60's and lights flickered on and off continually. My advice DON'T GO THERE unless you're a travelling teen/backpacker who doesn't mind less than basic/standard accommodation. YUCK!", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Good value for money”", "Author": "Tamar_11", "ReviewID": "UR100239134", "Content": "Great service! The staff were very friendly and helpful with questions about where is recommended to go and how to get there. We stayed in a quadruple room, which was a bit small but large enough for us to get around it. The bathroom was spacious and comfortable. Location was a bit far from the city center but easily accessible with the tram, which is a 2 minute walk from the hotel. ( about 10 minute ride)", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Amslon", "Title": "“Tiny Tiny Tiny rooms”", "Author": "RobNIkAmslon", "ReviewID": "UR100120473", "Content": "Oke, I live in Amsterdam, Speak Dutch and I had decided stay at the AAlborg whilst I had my flat updated. I know AAlborg quite well, quite popular with amsterdam based peeps due to the fact we know our city/village:)) Ceintaurbaan is a great loacation, in the Pijp( bubbly 21-35yr crowds) bars & eatries galore & albert cuypmaarkt(famous street market) good for transport, various trams, tram 4 takes to you to the hotel as does 24 from centraal station, tram 3 takes you west side to The Jordaan(more relaxed vibe older crowds but very cool . oke Room 20 tiny cramped, a tiny TV(world worst remote control) with numerous channels that dont work or no clear picture. which amazes me in today's digital world. A bathroom that would fail any health and safety check, pls watch your balance when entering/leaving the bathtub which is for people under 2feet in height but the shower does work. Room was cleanish, sheets ish, in a nutshell the AAlborg is an 20yr +old boutique hotel that needs a overhaul badly... it could be so much better, I did see a double room, again not that big and also quite cramped in. Would I recommend it, well in a way I am torn, for me it was ideal but in a other ways IE TRAVELLER/TOURIST it could be and should be better. Having said that is it value for moneywise??, well single room 48Euro weekdays(yes) 65euros weekend (no)!!!! Double room(100E+) , NO way. overpriced and pls be advised 9 euro for breakfast total rip off and bike hire is cheaper if you walk 100 yards to left of the hotel to the bike shop.. Ps no roomsafe(poor) and the cleaning staff start early. esp on flr 2....and dont believe the photos of rooms, pls these were taken when it first opened......got me fooled too...:D Rx", "Date": "March 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Avoid this hotel if you can”", "Author": "Jeva8790", "ReviewID": "UR99650110", "Content": "Tiny, dirty rooms, an elevator that makes such a racket it wakes you up every time someone takes it and bad sanitation. Add to that the various misrepresentations: no working wifi, no parking anywhere near the hotel, 4% additional charge for paying by credit card..... don't judge Amsterdam by this dump - it has a North American owner.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Kiev", "Title": "“Living in a closet”", "Author": "MiKaKiev", "ReviewID": "UR95496874", "Content": "Room (at least single) was incredibly small. No room for luggage, no chair, no table. Hot water unstable and WiFi did not work. Sitting bath tub shower does not let you stand on both feet. Breakfast stripped to the basics. It might be good for the traveling students.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Right on the money”", "Author": "shibby", "ReviewID": "UR94371059", "Content": "The previous reviews for this hotel were very varied but it was cheap so we went for it and I\"m really glad we did. The location is good, out of the \"touristy\" areas but only a short tram ride (or longish but interesting walk) to the centre. There's lots of good bars and restaurants in the area and the Albert Cuyp Market is a few minutes away. The staff are friendly and helpful and the rooms are clean, they even have a lift so you don't have to brave the scary traditional Amsterdam stairs. O.K. other hotels have bigger rooms, fluffier towels and a bigger breakfast buffet but that's why they cost more. I'd definitely stay here again.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“You get what you pay for”", "Author": "jwqida", "ReviewID": "UR88232692", "Content": "Booked this hotel after reading several reviews. Went alone for a short trip to pick up some items. Location was good as it is along the tram lines. Easy to move about. Not central but the roads from here to central Amsterdam provides for a very entertaining walk. Hotel wise was ok. U get what u pay for. Rooms were super small but it was fine cos I only slept in it. The bathroom was dangerous though as the bath tub was small and spilt level. Very dangerous as there was not enough proper space to showeer in. Ideally remove the bathtub and turn it into a shower. Other than that, it served my needs very well. Oh, the free Internet wifi was good and fast!", "Date": "November 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Prague", "Title": "“Not too bad...”", "Author": "r8nat", "ReviewID": "UR87579525", "Content": "ok - being very picky here but I'll list the pros and cons. I was based in room 41 - so no idea how the others compare. Cons The room was tiny! one of us always had to sit on the bed so other could stand up. But if your out sightseeing all day (as you should be!) then this is something I can put up with. Walls were a bit grubby - fresh lick of paint would be helpful tiny cigarette burns in the bedding (well the cover they put over the end of the beds to make it look pretty!) Not many TV channels to select (but again you should be out most of the time enjoying Amsterdam!) Mould on the bathroom wall/ceiling - due to poor ventilation - bleach might get that off??? Low water pressure in the shower walls are a bit thin Pros Staff are very helpful. made us feel welcome! 24hr staffed reception the downstairs bar is for guest use only. again tiny, but quite modern and tastefully furnished was outside area (too cold to use when I was there) but can imagine nice in good weather appreciate the computers which are free to use. Nice area - close to albert cypmarket, and nice bakeries, bars and restaurants etc in area easy to find and use the trams if you don't want to walk (which is only approx 15mins to centre) room cleaned every day with fresh towels I didn't have the breakfast so cant really comment on that. Saw it out one day though - didn't look too bad. The pictures in the website are a bit misleading - but then they are not going to show pics of their smallest grubbiest room are they!?!? I had to agonise whether to give this hotel a average or very good rating. Size of rooms cant be helped (seems common complaint for A'dam) but it wouldn't take very much to get that small room sparkling at its best. In all - would I stay there again?? maybe I would - purely for the helpful staff and nice location.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wimbledon", "Title": "“One of the poorest hotels I've ever stayed in - the website is misleading”", "Author": "Puregenius", "ReviewID": "UR81444977", "Content": "The room was not big enough to swing a mouse let alone a cat. God knows how they managed to get the bed in there. The bed was cheap and nasty (my boss in the other room said he now had springs imbedded in his back) Noisy because there is no double glazing and the road IS noisy (don't let them suggest otherwise). The shower did not drain away so I had to stand in 3 inches of water - disgusting. Altogether, this is no better than the cheapest 'pension' of France (and that is doing an injustice to pensions). The best thing about it was the apple and slice of cheese for breakfast.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Perth, Australia", "Title": "“Trouble from the start.....”", "Author": "Oz70", "ReviewID": "UR79176488", "Content": "I booked this hotel to check in next day. Part of the booking conditions were for full payment which was fine, I expected Aalborg to â€œreserveâ€� payment on my CC. The hotel took the â€œfullâ€� payment out of my CC + 4% CC charges. Then I was charged another 85 Euro security for the first night from my CC. This security should not have been charged since full payment was already taken. So instantly I was out of pocket 85 euro, a simple mistake on their part that I thought could be fixed on arrival. On arrival I asked if I could pay in cash, this was refused. I was lumped with the 4% whether I liked it or not, full payment was already deducted. All Amsterdam hotels charge an extra % on CC, but they also give you a choice to pay in cash, all except Aalborg. Secondly they refused to refund my $85 which was their mistake!! The staff said the bank would reverse the security (reserve) after 1 week. When I explained I was short in funds and needed that money for my last couple of days stay, I was still refused and disregarded, being treated poorly. I approached 4 different staff members on this issue of the over charge, including the managers/owners, only to be told it was not possible. I contacted my bank, Aalborg can and should have reversed the â€œreserveâ€� of 85 Euro. This is poor form on Aalborgâ€™s part, they failed to deliver here and it was an easily reversible mistake on their part. Rooms in Amsterdam are noisy, but Aalborg would have to be one of the worst I have been in, there was constant noise from the rooms. It is also on a busy street, although that helped to drown out the room noise. Room comfort was ok, but the strange shower/bath tub where you stand on an angle is dangerous and I slipped over. I ended up showering sitting down as it was unsafe to stand. The free internet access was a joke, it was so frustratingly slow and it wasnâ€™t due to being in a bad part of the hotel, I tried a number of locations. I ended up going to a local cafÃ© to use my laptop. Hotel Aalborg will supply you with a room with additional non negotiable costs, but donâ€™t expect friendly staff or any type of service. It seems some people are just in the business of making money and not trying to establish a respectable business to attract return guests. This hotel is a dismal failure for me.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northallerton, United Kingdom", "Title": "“I don't understand some of the reviews...this place is fantastic!!!”", "Author": "jubolly", "ReviewID": "UR78937685", "Content": "People have complained about random things about this hotel and to be honest I don't know why. Small rooms is the only complaint I can seem to muster up...so what? if you actually look at all the buildings in Amsterdam they are ALL narrow which means the rooms are bound to be small. I also don't understand the shower comments....we had a small double room, it had a great shower, the decor of the room was even nice too, very modern and sleek. I thoroughly enjoyed my stay at this hotel...the guy at the front desk was so nice and recommended loads of things for us. My boyfriend really appreciated the ability to smoke out on the terrace/garden. Yes it is a bit of a walk to central station but we both loved meandering around on foot and if we were tired it was just a quick tram ride to and from! I absolutely loved this hotel and will return to this hotel on my next visit. It should also be noted that our room was very clean and very quiet, we didnt hear anyone from any rooms around us, yeah it's not the Hilton, but it definitely worked for us....so A++ to this hotel!", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bremen, Germany", "Title": "“Yes, yes, yes...”", "Author": "gian19670618", "ReviewID": "UR64695506", "Content": "3 times yes for a place which has the charme of the dutch early century buildings. Friendly staff, generous breakfast, 24h check-in ans above all clean! For my next trip to Amsterdam I'll have a good address.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Tipperary", "Title": "“Good value for money!!”", "Author": "Sinzano", "ReviewID": "UR54345859", "Content": "Hotel Aalborg offers basic accommodation at a really reasonable price. It has good tram links to the city centre, the bar is open 24 hrs and the staff are really helpful and friendly. The rooms are quite small though with barely enough room for the bed and while this suited us fine as we didn't spend much time in the room, it would probably be a pain for a young family.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Portugal", "Title": "“Big rooms, location ok, nedds a renwal”", "Author": "PortugalTravelerP", "ReviewID": "UR53758827", "Content": "The location is ok, near the Pijp and the Museum Square and 10 min distance by tram to the centre. I'm sure it has been a great hotel, but now it needs a renewal. The bathroom walls had some humidity. The rooms are big, the service and breakfast are ok - mainly you get what you pay for. It's a little noisy and the doors are not well isolated - you could smell smoke inside our room even though we didn't smoke. The receptionists were always very friendly and helped us every time we had a question. The room view to the park is very nice. There are better options in Amsterdam.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Southern Oregon", "Title": "“Maybe there are better hotels in AMS, but this one worked for me.”", "Author": "BobthedogOR", "ReviewID": "UR40653976", "Content": "Hotel experience was good overall. Staff was always friendly and helpful. WIFI was available (free) and connection speed was acceptable in my room. Location is good as you can walk to Dam and Central Station if you enjoy city street walks of 20-30 minutes. Tram station < 2 blocks away with quick access to Central Station. Not much in the area but there are a few cafes, coffee shops and bars. Tattoo parlor (Hanky Panky) 3 blocks away. Sarphati Park is across the street and is nice for a small park. As everyone mentions, the rooms are extremely small - bed, flat panel TV, single armoire. Less than 3m square, but I was comfortable in it. Place to store luggage (single rollerboard) was a challenge (it ended up on top of the armoire). Bathroom was a stool, sink and shower/tub (?). Tub was so small I could not turn around in it. Overall length of tub was 3 ft, but with the slope on the one end, the actual flat part of the floor was less than 1 ft. A lift is available (and noisy - you can hear it all night long, as well as all the other travelers on your floor) and recommended. The stairs are very narrow and very steep. Like climbing into an attic, only with curves). I will stay here again. Sufficient accommodation for the 60 Euros/night cost.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Good Little Quiet Hotel, You Get What You Pay For”", "Author": "ScotlandsChin", "ReviewID": "UR39261476", "Content": "Was a little unsure what to expect after mixed reviews but it worked out good for us. Was expecting a tiny room & steep stairs as we had booked a twin room but they gave us a spacious, ground-floor triple room like the one in the picture. Didn't bother with breakfast, just hopped on a number 4 or 25 tram instead. The bar is open 24hr but is completely dead, prob a good & bad thing depending on what you like! The garden was nice & also really quiet, bit of a ghost hotel really. Location isn't a problem, it's quite near the Heineken Experience so it's easily found. Also, the park across the road is a welcome change from the city centre. Stay here if you cant afford somewhere better or aren't particularly fussy & like quiet spots.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Melbourne", "Title": "“Good value-for-money hotel, on the edge of the old centre of town.”", "Author": "graesiep", "ReviewID": "UR29023152", "Content": "I booked this hotel at recommendation of a friend who lives nearby plus the favourable Trip Advisor reviews. My favourite boutique hotel located in the Jordaan district [Hotel Van Onna] was fully booked for the time of my stay. Hotel Aalborg is located south of the old centre of town, overlooking Sarphatipark. It is easily accessible by tram from Centraal Station. Tram #25 passes the door. The tram #4 stop is about 200 metres away. Travel from Centraal station takes about 15 mins. You can walk to Dam Square in about 30 minutes and to the Rijksmuseum & Van Gough Museum in about 10 minutes. Reception was courteous & professional. My room was located on the 3rd floor at the rear of the building, facing south. It was light and airy with sunshine all day. There is a lift to all floors, which is much better than using the very steep, small stairs that are so common in Dutch buildings. Whilst the room was very small, it was clean & tidy and had everything needed for a single traveller. It included a small wardrobe, table & chairs, clock radio, phone, small wall-mounted TV and heating. The recently renovated bathroom was adequate with good towels & toiletries. The unusual half-sized sit-down bath, made showering very difficult. The tall sides also made it difficult to set in and out, particularly if you had limited mobility. There were no tea or coffee making facilities. Breakfast [additional EU9] is available downstairs adjacent to a fully stocked bar which is open 24hrs a day. Drinks can be brought to your room if required. The only negative was the poor soundproofing of the rooms. One could clearly hear other guests in the hallway, as well as hearing the lift when it was being used. I consider this hotel good value-for-money and I would return there again.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Scotland", "Title": "“Take anything of value with you if u dont want it to go missing”", "Author": "jjohnmichael4u", "ReviewID": "UR28779789", "Content": "Pocket knive went missing soon after maid had cleaned room, Clean towels thats about it. Pubic hair in bed and an assortment of hair on floor. Stayed in 3star last time in the dam. This hotel was more like 1 star. Maybe some rooms were nicer? The shower if u want to call it that was more like a wash basin that you had to stand on tippy toes in. Very dangerous. Was value and great location but would pay the lil bit extra to stay somewhere else! Semi nice staff. Didnt like having to be buzzed in to enter hotel. My oppinion as pocket knive went missing..Stay away!!", "Date": "April 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ormskirk", "Title": "“Definately will return on our next visit to Amsterdam”", "Author": "iloveyouloads", "ReviewID": "UR26092905", "Content": "I really canâ€™t understand some of the negative comments within the reviews for this hotel. I agree the rooms are on the bijou side but who stays in the room on a visit to Amsterdam. We visit regularly and have usually stayed in the centre, but this time thought to spread our wings a little. Itâ€™s only a No 24 tram ride from Central railway station (10mins) and what a delight for us when we arrived, clean and well decorated with more than adequate facilities, friendly helpful staff, very clean rooms, towels and soft furnishings, a great bar and breakfast area (fresh and plenty of choice, great coffee). The Aalborg is perfect for a city break in Amsterdam and such good value for money.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Perfect location for an attractive price”", "Author": "dylz", "ReviewID": "UR24833831", "Content": "I stayed here for 3 nights during the ISE show 2008. I had a very small, but quite cosy room up in the top corner of the hotel overlooking the Sarphatipark which was nice. Very clean and comfortable. The breakfast suited me perfectly, however I only usually go for the cereal - I don't make a big deal out of breakfast at home, why should I at a hotel? The staff were very welcoming and pleasant to deal with. Unless I decide to loosen the purse strings on my next visit to Amsterdam (on the accommodation anyway), I'd definetly make the Aalborg my first choice.", "Date": "February 20, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel”", "Author": "stevojk", "ReviewID": "UR17016733", "Content": "The Aalborg is clean and the staff are very friendly and helpful. We stayed with 2 young infants and they did their best to accommodate us. Breakfast is decent (but not outstanding). The bar is open 24 hrs. The location is excellent. Close to museums, parks, and city centre. I would thoroughly recommend anyone who is on a limited budget to stay here when visiting Amsterdam. The only minus I can think of is the lack of tea/coffee facilities in the room. Otherwise, it was great!", "Date": "June 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Decent for the Last Minute”", "Author": "winwiz88", "ReviewID": "UR16808666", "Content": "I stayed here for two night back in March 2008. I booked at the last minute online while sitting in Berlin Hauptbahnhof waiting for the night train to Amsterdam, and got a decent price compared to many other hotels near the center of Amsterdam. I believe it was 65EUR/night or about $100USD at the time. For what I paid you could say I expected expected more from this hotel. My roomo was about the size of a closet, not very large at all. While I can manage small spaces, many people cannot, and this would be an issue. I had read many different perspectives on the staff before checking in, and I from my experience they were nothing but professional. I stayed on the second floor and you have the choice of taking the very small elevator or the very steep and narrow winding stair case to get to the other floors. The stairs were often dark, and i could easily see someone falling down them (I however had no issues--YMMV). Back to the room. Yes, it was very small, but it did have everything your needed. Bed with clean linens, a heater at the end of the bed, desk, phone, tv, full bathroom, etc. The desk is so close to the bed that i never bothered using the \"chair\" and just used the bed as one. On the note of the bathroom, I will say that mine had what I shall term the death shower. I noticed that it had an incredibly high wall and was intended to be one of those bathtubs where you can sit one end elevated. This unfortunatley can make taking a shower a bit of a balancing act, and yes I did slip a few times. Getting out, just as getting in, could be problematic for some, with the height of the tub (especially with wet feet!). There is a continental breakfast and it is rather standard and nothing to write home about. Also, one must relinquish their key each time they leave the property. You simply just have to ask for your room key when you return. However, I noted that they dont check who you are, so theoretically it could be easy for a thief to gain access to your room. I did not see any evidence of this during my stay, and I did not feel like this would happen to me, but as a precaution (and this goes for any hotel), leaving valulables out in the open in your room would not be the best idea. Location wise, this hotel is convinently located within the same tram zone as central Amsterdam, with a stop just 1 minute walking distance away. Also, across the street is Sarphatipark, and nearby are several markets. If one really wanted to, one could easily walk to central Amsterdam and just take the tram back. Overall, the hotel was decent. It was not bad, but it was nothing overly extraordinary. When I someday return to Amsterdam, I would like to try another hotel, but when you have limited options this may be your best bet.", "Date": "June 9, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "washington, dc", "Title": "“Jerks”", "Author": "kenyonstreet", "ReviewID": "UR14785996", "Content": "I had to canceled my reservation several days prior to my stay and the jerks still charged my credit card for a full-night's stay even though hotels at the time in Amsterdam were at full capacity, i.e. they undoubtedly filled my room that night. Perhaps this is standard procedure in Holland but I sure won't ever stay at this joint.", "Date": "April 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "lancashire", "Title": "“Very disappointing”", "Author": "tuilip", "ReviewID": "UR14348530", "Content": "We had stayed before at this hotel but were disappointed after this visit. The main source of our disappointmet was around the breakfast, or lack of it! On the first morning we were up late due to our failure to change the time, so had missed the breakfast by approx 10 minutes. We asked if we could have drinks, which came at a cost of 6 euros, which wasn't an issue at the time but the day after the tea and coffee was out until approx 10.30am. Both the tea and coffee was cold, this was at 9.30am, i asked if there were any more croisssants and eggs and was told quite curtly 'no'. The orange juice and milk were not refilled and to be honest the whole thing left a lot to be desired. The staff who were on were not very friendly or welcoming at all, very different from our previous experience. On the third morning, it was much of the same even though we arrived for breakfast earlier. I think the only way it would of been acceptable is if we arrived at 8.00am, which is not always convenient and if they make breakfast available until 10.00am surely it shoud be the same as 8.00am? We would not return to this hotel, which is a shame as it is in a nice part of Amsterdam, with accessible links.", "Date": "March 17, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "MalmÃ¶", "Title": "“Tiny room”", "Author": "Barfota", "ReviewID": "UR12458908", "Content": "We got the smallest room I have ever had at a hotel, but it didn't bother us as we didn't spent much time there. Being at the back of the hotel, it was quiet. The walls to the other rooms and the hallway were not very sound proof, but fortunately the other guests were a quiet bunch. The bathroom contained a tiny tub shaped for you to sit down. It made the shower a venture. Since I never make a hot meal for breakfast at home, I found the one at the hotel all right. Cereal, youghurt, various bread and rolls, cheese, ham and jam. The stairs were as steep as they all seem to be in Amsterdam, but the elevator saved me and my suitcase. The hotel offered free internet. The personnel ranked from unpleasant to very nice. The hotel is in a rather quiet area. As it was nasty weather during our stay we used the tram a lot, the ride was about ten to fifteen minutes from downtown. As a bonus you find nice restaurants in the neighbourhood that aren't crammed with tourists. I can recommend the area south of the Heineken brewery", "Date": "January 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Libertyville, Illinois", "Title": "“You can find better”", "Author": "gpz1000r", "ReviewID": "UR11500814", "Content": "The Bad: Was told one rate, was charged more. Wireless internet did not work. Window in room 15 almost fell in when I tried to open it. Breakfast on the lame side. Not that comfortable a mattress. Shower stall missing a door, shower head would not lock into place. Halls reeked of marijuana. The Good: Elevator - Those narrow stairs can be difficult to climb with bags or when you have had an altitude adjustment. Nice area and fairly quiet. Right on tram lines 3 and 25. Within walking distance of good bars. Some interesting places to eat nearby. Overall I think you can find better.", "Date": "December 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "new york", "Title": "“tiny rooms!!! inconvenient transportation to airport!”", "Author": "pickytraveller000", "ReviewID": "UR11227513", "Content": "added extra few per cent due to credit card payment upon arrival, teeny tiny rooms, old bathroom, only nice thing is the wooden floor and new bedding + curtain. don't think it's worthwhile for the price have found much better hotels for cheaper price in amsterdam.", "Date": "December 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Don't stay on the ground floor!”", "Author": "North_londoner52", "ReviewID": "UR10770509", "Content": "Two of my friends and I spent shared a triple room on the ground floor for a couple of nights. The area was great, right opposite the Sarphati Park and down the road from the Albert Cuypstraat market. Overall the room seemed pleasant enough - clean and there was adequate space for three people to get by without getting in each other's way. The only problem was the mosquitos - the little blood suckers bit any part of our bodies exposed in the night. Both mornings, we awoke to fresh bites, which really wasn't pleasant. If you do decide to stay in this hotel - and there are many reasons you should (the price, the fanstastic location and proximity to the centre of town being three) either make sure you stay on the highest floor possible or take some repellant!", "Date": "November 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "lodi, italy", "Title": "“hotel aalborg, a little lovely hotel”", "Author": "dobrodojaja", "ReviewID": "UR10660617", "Content": "Well, i went to Amesterdam with my lady (beginning october 2007). the aalborg hotel is one of the more affordable hotels in amsterdam (we paid 75,00 per room per day and, yes, the room was very little but that's amsterdam : no space at all and if you need space, it willl be expensive to you; but please notice thaa in some places you'll pay 75,00 for a room with shared bathroom; at allborg, at least you'll get your own bathroom). About the room, nothing to complain about (except one detail: when we got into the bathroom, we find some hairs on the floor of the shower; disappointed for such a stupid thing, i started to say \"bleah!\" but then my lady: \"come on, can't you remember Andalucia? with cucarachas running on the walls?\" \"yes,girl, after all .. we're backpackers :) People at reception are nice, there's wifi in the hotel, and a little room with a pc connected to the web, if you mind travelling with a bag just for your laptop; about connections to the very center of the city, you can rent a bike directly in the hotel or wait for a tram to pass (every 15/20 minutes, day and night as well; the tram stop is 30 meters away from the aalborg); for those who suppose amsterdam is little (or for great walkin-lovers) the trip on foot to the center is about 20 min. overall.. little space (half a meter from bed to walls) great price; great location (near albert cuypmarkt, sarphati park) connected to the center and to the web friendly staff. byes, mates", "Date": "November 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“Would definitely stay at this hotel again”", "Author": "kfamilee", "ReviewID": "UR10087535", "Content": "We (family with teenagers) just spent 6 nights at this hotel, and would definitely stay again. Compared to other 3-star hotels in Amsterdam, it is fair value for money. We were in room 35 (the quad) which has a small balcony, situated at the back of the hotel. The staff were overall very friendly, nothing was too much trouble, and the advice we were given was always good. It's true the location is not near the centre, but the plus point is a quieter neighbourhood which feels safe. The only minor negative remarks we would make are the beds (2 single, 1 pull-down small single, 1 sofabed) which were not that confortable, despite excellent new and clean pillows and duvets, and the shower which cannot be described as powerful. Overall a good experience which contributed to make our stay in Amsterdam enjoyable.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Berlin, Germany", "Title": "“Pleasantly surprised”", "Author": "pkbpkb", "ReviewID": "UR8875374", "Content": "I visited this hotel for the duration of a trade fair in Amsterdam, so the prices were extortionate. With such prices you just don't get value for money, but all hotels put up their rates when there are trade fairs on. Anyway, this seemed to be the best of the available hotels, even though it didn't have very good reviews. I stayed in one of the larger rooms, which was fine. It looked recently renovated, although the bathroom seemed to have missed out on this renovation. My colleague had one of the smaller rooms, and from his description this did seem like a squash. The room was clean. A negative would be that the windows did not seem to be able to shut out the noise from the street. A couple of times I got up to check that the window was shut - it was, but you could hear everything from outside. The staff at the hotel were all very friendly. The hotel has a nice bar area/breakfast room and outside patio. Breakfast wasn't fantastic, but there were plenty of cold cuts and cheeses (though no warm food). Having stayed in some real pits in Amsterdam during trade fair times, I was quite happy at the Aalborg.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“more money than value”", "Author": "Bartrip07", "ReviewID": "UR8451459", "Content": "The good: breakfast is a decent buffet with cheese, meat, eggs, cereal, juice, yogurt, etc. The general atmosphere of the place felt safe, with lots of family travelers and the dining area/bar was cute enough, with a decent breakfast patio if the weather permits. Generally safe, neighborhood is pretty and residential across from a park and easy access by public transportation. the bad: for the price our room was ghetto. We think they placed us in a single room for the price of a double. Think youth hostel size. It was near impossible to use the toilette without touching the outside of the stand-up shower. I would have liked to have stayed in the rooms in the pictures, but ours was about half the size. the ugly: waking up to a mouse chewing on chocolate in my backpack. But hey-who can blame the fella, it was dark chocolate.", "Date": "August 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London,", "Title": "“good hotel for young people”", "Author": "random-al", "ReviewID": "UR8375333", "Content": "This hotel is in the De Pup District and is there fore quite surban. The Hotel is about a 35 min walk from Dam Square, If you do not like walking you can take the number 25 tram which starts at railway station and go right past the hotel. The stop you want to get of at is Van Woustraa or Centruurbaan. I found I missed the stop and had to walk back a couple of stops. If you are traveling to the hotel in the day time look out for the park with green iron fenching and the hotel opposite it. The hotel is simple with a modern look to it, There are two type of rooms that you can get with this hotel the one is Small with just a bed and a wardrobe and on suite bathroom. The other is large and is like the one in the photo on this web site showing what a room looks like. There are only 6 of these rooms. The large room also has a sofa which can also be a bed and a tiny balcony. I was lucky in that i had a large room. The room was nice and clean the beds were comfortable and bathroom was good, ( i.e. there was a bath/shower, free soap shampoo/shower gel and more than one towel.) The breakfast is self service and is typical dutch. You have a choice of Bread, cheese, ham, turkey, cereal, orange juice, coffee and tea. The bar is open 24hours a day and is also the breakfast room. The nice thing about where the hotel is located is that it is only 5mins from the local high street and market. So if you want anything it is close by. In conclusion this hotel is a nice and simple hotel that is best for young people, It would also do for old generations, but they might find the hotels a bit limited in what it provides.", "Date": "August 8, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Fabulous!”", "Author": "MsMean", "ReviewID": "UR8370251", "Content": "This was a comfortable (almost lush for the price range!), clean, friendly, small hotel. The location was great - quite central and accessible by several tram lines. The bed and pillows were amazingly comfortable, which is saying something since we've stayed in half a dozen hotels in the past month. The breakfast was included and was substantial enough to keep us going. The folks working the desk were friendly and helpful. They even rent bikes right at the hotel for a very competitive cost. An amazing value in an awesome city.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "america", "Title": "“Stay Away. Rude staff. You will be in TROUBLE!”", "Author": "happyangel2007", "ReviewID": "UR8211522", "Content": "The room is tiny, price is high No A/C, so can be hot in the summer Far away from the central station Rude staff One of the staff is extremely rude and nasty. Upon check-in, he disclosed an additional cost for credit card payment. I had called him twice in advance to tell him my credit card number, but he had never told me about the extra charge. I was going to pay the charge, but I just wanted to tell him that customers usually want to know those hidden costs in advance, so that other customers would not feel bad in the future. Surprisingly, he became defensive and yelled at me, \"You never told me that you were going to pay with a card!! So I don't have to tell you about that! ALL the hotels in Amsterdam charge extra for credit card \". This is not true. I had stayed at another hotel in town the night before, and that hotel did not charge any. When I said that, he became very excited and blasted, â€œI am going to call another hotel (to prove that), hotels charge extra!!! But I am not going to call the hotel you stayed last night! â€¦â€¦ Do you work for hotel industry? I do!!! I never had a problem with my guests!!!! Look, I wasted 20 minutes of my time when you called me over the phone.\" Then he started to intimidate me, \"You must get out of this hotel if you do not want to pay. We will charge you anyway! \" I told him that I had never said I would not pay, and asked him why he was making up a story, like I did not wish to pay. Then he said, \"then why do you put your card back to your purse. (I never put my card back to my purse, by the way.) Do you want a room, or not!!?? If you don't pay, get out of here!\" Then even after I paid, he humiliated me, saying I was probably on a drug or should go to a mental hospital. So I told him that he was unbelievably rude and nasty. At this point, as other guests came over to listen to our argument, he suddenly smiled and said, â€œ Ok, I am rude, OK?â€œ Then he told me to leave the reception area immediately, or otherwise, he said, he would call the police. I told him that I did not have to leave because I had paid already. Then, amazingly enough, he really called the police and said something to the police in Dutch to scare me. Anybody can imagine how scary it can be when a person of that country calls police and communicates a false story! You could get arrested even if you are doing nothing wrong! So this guy resorted to this nasty technique to scare me. This really shows what kind of person this guy is. After all these horrifying, dreadful experience, I reluctantly stayed at this hotel because I did not want to waste any more time or money only because of this pitiful, pathetic man. The man insisted that all he was saying was right because he was \"studying marketing\", but I really feel sorry for him that he has no ability to understand customers' needs and minds. His character of easily losing temper and blasting to customers, and the fatal lack of compassion, is a proof that there is no way that he can make a good, or even modestly good, marketing person. Anyway, you should stay away of this hotel. Don't go. The rooms are tiny and overpriced, as other reviewers have described. But more importantly the staff described above is rude and nasty. (I don't know about other staff, but if this guy sits in the reception, you could get into a trouble.) When there is no problem, he might seem a nice guy, but you come to know true personality of his when something happens. If you complain, he will never apologize or help you, but, instead, will intimidate, threaten, harass, scare and insult you. So, again, donâ€™t repeat my mistake, and stay away of this hotel, forever!", "Date": "July 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "USA", "Title": "“nice and friendly at good location but small with suicide shower and hidden fee”", "Author": "CXX", "ReviewID": "UR8206745", "Content": "I liked the design, the garden, the 24h service, the breakfast. I arrived at 11am and could already have a room. I didn't like: The most annoying thing is that there is a 4% extra fee if you want to pay by credit card- did they expect me to cary $500 with me to pay cash? The single room was so tiny that there was no real room to store a suitcase. A double might be a better value even for singles. The shower had a very odd curved floor which made it nearly impossible to stand, it was a half-sized sit-in bathtub. They had a shower mat in there which upon first use slipped away and nearly killed me. Without the mat showering was still a struggle, and I couldn't dare to move. The room did not have a desk as promised and no alarm clock. If you can live without a relaxing shower in the morning and are not claustrophobic the hotel is nice. Maybe the double rooms are better. It is in a very good location in a nice neighborhood cose to two troley lines.", "Date": "July 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“Nice short stay”", "Author": "flame01", "ReviewID": "UR7479615", "Content": "On Monday evening 16th April 2007, myself and two friends arrived at Amsterdam Schipol airport on business and had a one night stay. We went to the hotel booking facility just outside the arrivals exit door from customs. In looking for a triple room, were given the Port Van Cleef hotel, which is just off Dam Square for â‚¬300 for a triple room, with the agent at the desk telling us it was a 4 star hotel....now we have stayed in this hotel before, and in my opinion its just about a 3 star. We declined the offer and settled for the Aalborg Hotel, in the \"Pijp area\", the rate given was â‚¬112 for the room for one night. We used a taxi to get to the hotel, as apparently the trains were not running to central station due to an electrical fault. Taxi cost â‚¬35, including tip. On arrival, we were given room 35, which was a the back of the hotel, in a most pleasing and quiet area. the room was very adequate, bathroom was large enough, room spotless and I am told, that the fold down bed was very comfortable. The girl at check in was most helpfull and the hotel appeared very nice. Breakfast, although not a huge spread by any means, was nice and we left at 10AM to travel back home All in all, a lovely hotel in a quiet part of town, away from the hussle and bussle of the centre and at a most reasonable price. Would I use it again...no problem and most likely will Regards to all", "Date": "April 28, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "uk", "Title": "“shocking”", "Author": "nov06", "ReviewID": "UR6918420", "Content": "the room was like a blackpool B&B - extremely small for my husband and i. This should have been a single room - whatever you do if you do stay here make sure you dont get room 23. If the room had been renovated it had dodgy laminate flooring and new curtains - the walls looked very dirty and in need of a lick of paint. The double bed was pushed up against the wall, no bedside table - well there was at the end of the bed. There was very little space to walk around the room and the bathroom was a hazard. You could barely stand in the \"toddler\" size bath to have a shower and when you did you just soaked the rest of the bathroom - it certainly wasnt a power shower. The bed was changed and comfy - but i really felt the rest of the room was dirty - i didnt like walking around in bare feet. The staff were friendly enough. We tried the breakfast on our first morning but not again - it was a real episode and you had to keep asking for the breakfast to be replenished. There wasnt anywhere to sit but luckily we managed to get a seat and the table from the previous guests was not cleared. Maybe if the room had been nicer the breakfast hassle may have been acceptable. We didnt complain about the room as i had guessed we were the last people checking in so thought if there was a better room surely they wouldnt have put us in that one. Even though everyone says it is in a good location i do think it is a little far out especially for first time visitors to the City. It was my birthday while i was over there and they put a card and half bottle of champagne as a surprise when we returned to the hotel - a very nice touch but i wouldnt stay there again. The only good thing i would say is that it did seem to offer the best rates - but thats based on the room advertised on their website not the room we stayed in..", "Date": "March 5, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sunderland", "Title": "“Hotel Aalborg”", "Author": "Sue1562", "ReviewID": "UR6820836", "Content": "Good location, easy to find and all main attractions reachable by foot or short tram ride; opposite a park and lots of really nice bars and places to eat nearby. Try Mamouche for a lovely Morrocan meal - great service! Bagels and Beans is worth a visit for breakfast - breakfast in the hotel is OK, nothing special, but service is very good and the staff friendly and helpful. The room was clean and surprisingly big (after previous reviews i'd read!). I'd stay again - for the location and price, it's fine!", "Date": "February 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“lovely hotel”", "Author": "kerkham17", "ReviewID": "UR6811169", "Content": "We had a 2 night break at the hotel and it was really comfortable and enjoyable. We must have been given one of the larger rooms (exactly like the picture on their website) because it didn't feel cramped at all. We asked for champagne which was there, nicely chilled, when we arrived. The room was clean, the bed comfy, the bathroom great and the staff polite and helpful. The only downside for us was no tea/coffee facility in the room. The bars nearby are fantastic, the overall atmosphere of this part of Amsterdam in chilled, friendly and stylish. We will certainly be returning!", "Date": "February 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Runcorn,England", "Title": "“Fantastic hotel.”", "Author": "coca-cola_boy", "ReviewID": "UR6144875", "Content": "We have just returned from Amsterdam staying in the Aalborg hotel. The rooms are small but well suited to a short city break. They have had a recent refurb and I have to say look very nice indeed. The hotel is within walking distence of a fantastic out-door market (5mins) and has a loverly park across the road. You can take the number 25 tram from almost right outside the door to the city centre as far as central station although you can get to Dam square in around 20 - 30 minutes on foot (this way you get see a few extra sights that you may miss). The staff at the hotel are (as with most people in Amsterdam) very frendly. The hotel also offers a bar and breakfast room. I reccomend this hotel if you are going to Amsterdam, it is just the right distence away from the centre not to be a hassle from either city centre noise or traveling. I will definatly be using it again on future trips to Amsterdam.", "Date": "November 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire, England", "Title": "“Much Better Than previous Reviews Suggest!”", "Author": "Tyke-Lass", "ReviewID": "UR6060893", "Content": "We were worried about staying here, having read some pretty mixed reviews. We needn't have been - it was really great: very clean and comfortable room, with a good bathroom and cable TV and friendly, helpful staff (especially Khalid, on reception). The hotel is close to good eating places, is 5 minutes tram ride and 20 minutes walk from the centre, has a pretty park right in front of it and, is a 5 minute walk from the fabulous Albert de Cuyp market (great bargains!). The best way to reach the hotel from Schiphol is to get the train from Schiphol to Centraal Station, then a no. 25 tram to '2e V d Helstraat' (shown on the tram's electronic boards as stops approach) walk 50m in the direction from which you have travelled and the hotel is right there. Down sides: front rooms are noisy (our room was no. 17, which is at front) but not excessively so and no drinks facilities in rooms.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Vilnius", "Title": "“Basic hotel on great price”", "Author": "AnderSat", "ReviewID": "UR5800097", "Content": "Hi, don't expect much, it's basic holland hotel. As in all holland hotels there is very small rooms, and elevator is like simple box without a door - it is normal in Amsterdam. Well, if you want standart german/usa hotel style, you will need to pay much more - min 100 Eur in Amsterdam. But if want to pay 65 Eur/night - this hotel provides great service at this price. Very clean, bathroom is very clean also. Hotel is close to tram lines (5-10 min to central station / DAM), also there is great traditional market not far from hotel as well as many restaurants.", "Date": "September 14, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Formby, Merseyside", "Title": "“Birthday Treat”", "Author": "Jannclo", "ReviewID": "UR5462635", "Content": "We found the room rather small - really only suitable for one person. No bed-side table, small wardrobe with few hangers. We stayed for three nights but the room and shower-room , particularly the wash basin which had a plug that did not fit, were not cleaned during that time. The bed was made. On the positive side: the location was very central, the staff very helpful and the breakfast had plenty of variety. We would stay at the hotel again when next we return to Amsterdam. We had a wonderful time in a wonderful city. Thank you!", "Date": "July 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“clean & value for money”", "Author": "Citytraveller2", "ReviewID": "UR5048141", "Content": "Booked single room but got a twin (room31). Good points. Good sized room. Very clean & newly decorated. Ceiling fan to keep cool. Multi-channel TV. Decent en-suite. Good location - 10/15 minutes from centre/railway station on direct tramline (number 25 stops just passed hotel) - about 1 euro each way (buy strip of 15 tickets @ shops). Also number 3 tram to Heineken/Van Gogh museums & canal bus stop (worth using for Â£12 a day). Rooms at front overlook park. Breakfast average for european hotel. Paid Â£50 per night through HotelsRUs. Most staff friendly & helpful & understand English like what I talk. Less good. Trams are noisy 06.00 - 24.00 - even on 3rd floor. ASK FOR A ROOM AT THE BACK! Single rooms & triples look a bit small on plan, but I've stayed in worse. No tea making facilities or restaurant/bar but vending machine hidden inside breakfast room. Thank goodness lift working - stairs are steep, narrow and winding. Real hazard carrying suitcases. Towels are small but I was given five, so no problem! Also supplied with soap, showergel, shampoo. Just off my map, so a bit difficult to navigate - get a tram map from tourist info @ station. Would stay there again - and there are many (more expensive) hotels I wouldn't say that about! PS found previous reviews really helpful - well done this website!", "Date": "May 10, 2006"}], "HotelInfo": {"Name": "Aalborg Hotel Amsterdam", "HotelURL": "/ShowUserReviews-g188590-d501340-Reviews-Aalborg_Hotel_Amsterdam-Amsterdam_Noord_Holland.html", "Price": "$79 - $226*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sarphatipark 106</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1073EC</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "501340", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/4b/08/98/small-double-room.jpg"}}