{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“great location”", "Author": "bobrashmi", "ReviewID": "UR127434337", "Content": "I think this the best kept secret in Sydney. We were in Sydney for a vacation from the USA. It is a small hotel but in a great location(so small the taxi drivers didn't know where it was). About $40 dollar ride from the airport. Just outside the front door you can catch the free bus (number 555) and it takes right up to the Circular Quay to the Ferry station. Or you can walk 5 minutes south from the hotel to the train station. 15 minute walk to Darling Harbour. The staff is very friendly and helpful. We were a family of 4, 2 adults and 2 kids. We had sufficient space for ourselves and sfuff. since we were on vacation we didn't spend lots of time in the room, just a place to sleep and shower.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Location, Location, Location”", "Author": "danmate", "ReviewID": "UR127097991", "Content": "I was looking for an affordable place to stay in Sydney for a weekend visit to friends, only a 1 night stay. I've stayed in hotels all over the city & eastern suburbs and this was my first time at Pensione. It has a great location but I have no idea where they get the notion that they're a 4 star property (self-rated). The rooms are comfortable, with nice linen, good beds (we had a double - I would think that 4 star hotels have queen or king beds). The bathroom is modern & very clean but lacks any kind of space to keep your toiletries. The TV is an old style CRT on the ceiling and really not easy to watch but who comes to Sydney to sit in their room and watch TV. WIth the price of flat screen TVs nowadays I'm surprised that they have these old sets in such an awkward position. As for late check out there's no leeway at all - you want it you pay. $20 till midday and $60 for a 7pm departure. There's lovely tea in the room - 4 different flavours which we really enjoyed, and ironing facilities. They have a self service laundry instead of crazy hotel prices at most other places. Most annoying factor which is the trouble with such a location, and maybe the room we had was the club and noise until 6 am sunday morning which would keep light sleepers up. The stay all up was fine, I like the quirky signs & old building but it's more like a budget hotel where everything is extra and not a 4 star.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good location, inexpensive and clean are the only pluses”", "Author": "kewlmeister", "ReviewID": "UR126571131", "Content": "Stayed for 1 night on Thursday 22/03/2012 out of neccessity and curiosity about this quaint hotel that I keep coming across during my online search for accommodation in Sydney CBD. I had initially planned on either the Park Regis or Ibis World Square. Online line booking was straight forward. Its website is basic and functional. Check-in was efficient and quick. Reception staff was pleasant. Corridors to the rooms are like a maze because of the (small) floor area of the building. Was assigned Room 210A which is a standard single room. It's only about 20-22 sqm size. Definitely not a room for a person with claustrophobia. Good thing I am not one. The Pensione Hotel being in an old (1950s?) building, the room has very high ceiling. This together with the dim lighting and wall colour (dull violet) makes the room interior excessively ancient and depressing. That said, the room and its adjoing bathroom are well kept and very clean. The CRT television set is mounted high above the entry door. Hence the only way to watch it without straining the neck in the very confined space of this tiny room is by lying down on the bed. The channels works intermittently drifting in and out of signals. The bed mattress is hard. Didn't have a good night sleep at all. Woke up really tired. The only other hotel I had stayed in before with comparable \"hardboard\" like mattress was in Shenzen, China. LOL Paid AUD$10 for in-room WiFi internet access. Signal and speed of its WiFi internet connection was excellent. Normal check-out time is 10am (rather than 12noon). For noon check-out an extra AUD$20 is charged, and which I paid for. Being conveniently located on the Chinatown end of Sydney CBD George Street makes it a good base to explore the city, be it to shop, dine or sightseeing. Checking out is also without hazzle and efficiently handled by the reception staff. Upon arriving home and checking my credit account online statement I realised they have double charged me for the 1 night stay. There were 2 charges of AUD$140 instead of just one as should be the case. I email them immediately requesting them to rectify their charging error, which at the time of writing this review (abt 8 hours after sending the email) I have yet to receive a reply from them. Not impressed at all. Eng Soh Penrith, Australia", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Barriefield", "Title": "“Clean & inexpensive, but a challenge”", "Author": "Gio P", "ReviewID": "UR126183337", "Content": "My wife and I booked this hotel during the Mardi Gras weekend in March on the recommendation of a student, who described it as a clean place to crash while walking Sydney. The hotel is a bit of a maze of rooms, which are distributed across a few interconnected buildings through dimly lit hallways and tired carpets. We had a superior Queen room that had been recently renovated and the rate included wifi. The room was TINY but clean and contained a ceiling mounted LCD-TV that was viewable from the bed. The bathroom was clean and functional. One can't open the curtain without sharing your room with those in the next bulding and the streetscape outside changes as one reaches the Pensione to one that is slightly more shady than other hotels we stayed in. The single pane window opened but given the curtains is not very effective. Although AC was present if you wish, it didn't seem to cool. The street noise and sirens were significant through the closed window. The reception staff was understanding when we stayed one night and decided to move to a different hotel, although we were required to pay for the 2nd night booking since it was within 24 h. Bottomline, this hotel imay be fine for student travellers, but others will need to adjust their expectations.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Better value than most”", "Author": "jugface25", "ReviewID": "UR125652373", "Content": "First impressions as you climb the stairs to reception is that you are entering an up market backpackers. That it is not! The young reception desk staff are very welcoming, efficient and helpful. Rooms are very clean but small, although the beds are large and very comfortable. There was a very modern shower and toilet/washbasin etc. Our room was at the front of the building overlooking George Street but the double glazed soundproofing was efficient enough to keep out the hustle and bustle of the street below. The real advantage of this location is that it is within walking distance of all of the city's attractions and transport hubs. In addition the hotel has a large communal kitchen/dining area where you can prepare and eat your breakfast dinner or tea having bought the ingredients from the nearby Woolworths. There are plenty of restaurants nearby including a decent RSL Club.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Excellent location, Close to everything”", "Author": "DethVeggie", "ReviewID": "UR125624691", "Content": "I stayed here on the 15th feb for one night, before going on a 2 week cruise with Royal Caribbean(bet your jealous). The hotel was easy to find, close to every style of eatery, clean, and due to the double paned windows very quiet inside, even though its on a main street. For $125 a night, to find a hotel in the middle of everything, and at such good value is amazing. I wouldn't hesitate to recommend it to anyone", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Clean, Comfortable and Affordable”", "Author": "Princess_Coco888", "ReviewID": "UR125487199", "Content": "For a mid-range hotel, Pensione is located within walking distances to all amenities and entertainment. Everything is quite literally at the doorstep.This is not the Ritz Carlton, but rooms are good sized, clean and comfortable. Stay here if you ware zipping by Sydney for a couple of days and looking to save a few dollars. Staff are helpful and courteous. Not bad at all.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "blyth, england", "Title": "“Good location”", "Author": "newbride4708", "ReviewID": "UR125418965", "Content": "Excellent location! Step out of the hotel, 20 mins walk on the main street and you are at Darling harbour or half an hour walk and you are at Sydney Opera house. All the time passing shops, bars and restaurants. Staff were fine, only really had contact when we checked in and checked out so had no problems. Our room was small as we expected but just what we needed really, It was clean with a massive wet room bathroom which i think may have been used for disabled customers. Spot on with location and we would stay there again. Not much of a view but was nice and quiet.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“No hot water”", "Author": "Owen W", "ReviewID": "UR124598939", "Content": "Do not stay here if you like hot water and service from the staff.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Loved it!!!”", "Author": "michelle767676", "ReviewID": "UR124372004", "Content": "My husband and I stayed here early feb on a monday night. we booked a deluxe double which we found to be simple and perfect for us. the room was cosy, clean and modern and the hotel had an arrival note on our bed congratulating us on our anniversary. i found this to be a thoughtful personal touch. The staff were always very polite, pleasant and professional both on the phone and at front office. Its location on George st with easy access to public transport and landmarks was great as we had planned to do many activities. We were very happy with our stay and will consider staying here again in a deluxe double. If your not looking for anything overly flash and 5* then I believe Pensione should be considered.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Townsville, Australia", "Title": "“Fantastic staff,but with a few small improvements rooms would be fine”", "Author": "zahnleitercollins", "ReviewID": "UR124142881", "Content": "The staff were brilliant and consistently helpful and happy to oblige !They are the hotel finest assets. However the owners need to spend a little money to make huge improvements. !.Bedside tables and lamps 2 small shelves in bathroom near vanity 3 larger tabletop shelf near fridge Also the washing machines need to be cleaned out the reek of stale mouldy water ! There was loud duff duff music from club next door till 5am fri/sat (but that really didnt bother too much just went back to sleep. Loved the Fitness First membership pass to Park st (Great Zumba class with Jorge ) Please management sort the fore mentioned problems out and you will have a brilliant establishment", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Margaret River, Western Australia, Australia", "Title": "“missleading information......”", "Author": "Deb I", "ReviewID": "UR124042239", "Content": "I booked a double room to stay for 2 nights. When we arrived and were directed to our room by h friendly staff member only to walk in to a VERY Petite double which was not what i booked with a old analouge TV. When i questiond this i was told that only the more expensive rooms had LCD TVs (this only was a issue as we were going to be spending a grat deal of time in the room as i was having surgery) even though it was advertised that they all cam with lcd tvs and satalitte tv (2 channelsmusic and repeated old sitcoms) there wasent even all the free to air channels. the room was so small you could barley fit down the side of the bed which was on a diagonal it was more of s converted storage closet than anything else the only redeeming factor was the shower was EPIC!!!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Byron Bay, New South Wales, Australia", "Title": "“Staff very Accommodating”", "Author": "Chrissy L", "ReviewID": "UR123817173", "Content": "Staff were very accommodating and friendly. The hotel is situated in a good location and kept very clean. The room was on the smaller side but had everything I needed and was very reasonable for the price I paid. It is now my hotel of choice for my regular trips to Sydney.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Awesome hotel but noisy nightclub below”", "Author": "AmyBugs", "ReviewID": "UR123087257", "Content": "This is a hard review to make because I can't find fault in the hotel but I can find fault in the nightclub downstairs. The hotel itself is brilliant, really clean, gorgeous decor, helpful friendly staff, amazing location and great value for money. The one catch is the 'doof doof' music from the nightclub downstairs that made sleeping difficult. We stayed at the hotel on a Friday & Saturday night... the first night was just bearable but on the Saturday night it was worse and I could still hear the dull thud of the music even with earplugs in. To the hotel's credit, when I complained about the noise at 1.30am they spoke to the manager of the club and the music was then turned down. If you don't like to be lulled to sleep with the dulcit tones of beats in the background then this is not the hotel for you on a Friday or Saturday night. Or try requesting a room on the side of the hotel that is away from the nightclub and not fronting the street.", "Date": "January 14, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Old Hotel with modern decor”", "Author": "sexysarah23", "ReviewID": "UR122641174", "Content": "Its an old building, done up all nice and new with a kinda of homey feel still. The room was nice and clean, a little tight for space but we didnt really spend much time in the room. Good location in the City and close to the airport.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Cheap & cheerful in useful location, but not a boutique hotel”", "Author": "BritInAus", "ReviewID": "UR122639728", "Content": "This hotel ticked all my boxes - cheap, clean, comfy beds and a convenient location near Darling Harbour and Chinatown, a 5 min walk from Central Station to take advantage of the airport train and 30 seconds walk from the free city circular shuttle bus. Rooms were clean and beds very comfy but a couple of tiny touches would have improved the room from average to good - somewhere to put your things in the bathroom, a lightswitch within reaching distance from the bed (no reading lamps) and extra towels supplied. Would return if the deal was good. Staff very helpful and friendly.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sittingbourne, United Kingdom", "Title": "“Wasn't very happy, appalling room.”", "Author": "JenK23", "ReviewID": "UR122112126", "Content": "We booked because we were already booked to stay at their hotel in Melbourne and their price was pretty average. We paid $115 for a petit double so expected a very small room. We were right, it was a very small room. That's not my complaint at all. My disappointment was the scuff marks of the walls and doors. The badly done plaster repairs on the walls. The bathroom door which didn't shut properly. No bedside tables to put anything on. The toilet didn't flush properly. Curtains which don't meet properly and when you're in a room directly opposite a billboard this does matter! The room light up like day at night with the lights on the billboard. Our room looked in on the walls of the other rooms so with no net curtains you could see into everyone elses rooms. The next floor up could see down into our room and see us in bed through the gap when the curtains were shut! We only stayed one night and spent a lot of time sightseeing, we really enjoyed Sydney. It is a really good location. It is clean. There is a wifi and the building is quaint! But I was so disappointed by the room that I wouldn't go back.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Clean and convenient”", "Author": "v3r4", "ReviewID": "UR121940057", "Content": "We got a really good price for a 3-night stay, and for what we paid, we were satisfied with what we got. The hotel is clean, new (refurbished) and modern. And the location is fantastic; right on George St in Haymarket. We were on a food trip, so we wanted to be in the city, but as close to Surry Hills as possible. The elevators were the cause of mild annoyance, as the swipe card reader doesn't work properly - there's a special way of putting the swipe card in to activate it. SERVICE: As another reviewer also mentioned; service at reception can be slow, as there was only one staff on duty at a time from what we observed. BEDROOM: We stayed in the Petite Double and it really is small and petite! The size of the bedroom didn't bother me at all, but the view from our window faced the other hotel rooms. My gripe with this is that they only have black-out curtains in the room; perhaps have two sets of curtains? One to keep light out, and the other to allow light in but with privacy. BATHROOM: Bathroom was small, but great water pressure in the shower. Gripe #1: As the shower area was higher than the bathroom floor, and there was only a half-shower screen, water kept flowing out and pooling in the bathroom floor, out of the shower area. Gripe #2: There weren't any exhaust fans in the bathroom (unless i didn't see the switch for it). There was a vent, but no fan. A small shower/toilet without a fan/window is no fun!", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Value for a Great Hotel”", "Author": "HereAreMyThoughts", "ReviewID": "UR121534846", "Content": "While visiting my brother and sister-in-law in Melbourne, we decided to visit Sydney for four days/three nights the first week in December. Trying to find a reasonably priced room with a double and single bed (as opposed to bunked beds or a pullout couch) proved to be harder than I expected (esp. since two queens tend to be almost standard in the States). I conducted an extensive search and eventually found the Pensione Hotel Sydney on George Street. We could not have been happier with our selection. The hotel is in a prime location within Sydneyâ€™s Chinatown district. If you are walkers (as we are), you are within a 15-30 minute walk to all key locations, including Sydney Harbor, Darling Harbor, museums, great shopping and places to eat. Should you prefer to take public transportation, the hotelâ€™s location could not be more convenient, with more than ten city buses (including the free 555 city shuttle bus) stopping outside the main entrance and taxi stands on the corners of the block. The front entrance is unassuming (you can practically walk right by it if you are not looking for it), but do not let that fool you. While I had prepared myself for a small room, it was very clean and very comfortable, even for three adults. Additionally, the bathrooms were very nice with amazing water pressure, a lovely shower and great smelling toiletries. Finally, I cannot say enough about the staff at the Pensione. From our first phone conversations when booking with Lauren, to each and every employee we encountered, they went out of their way to make us feel welcomed, while providing great local information and recommendations. After our stay at the Penisone Hotel Sydney on George Street, I would not only stay at another Penisone or one of their sister hotels part of the 8 Hotels chain, but highly recommend it to friends and family visiting. Some â€œinsiderâ€� Sydney travel tips (all walking distance from the hotel): â€¢ Stop by Chinatown and try the Emperorâ€™s cream puffs â€“ they are $.30/AUS each (but go for the full dozen). They are like bite-sized heaven in your mouth! â€¢ If you like food courts, you will be in heaven in Sydney! Make sure to check out the one under Meyers and the ones in Chinatown. â€¢ The Hay Street market is around the corner from the hotel (when you go out the back entrance), this is a great location to get gifts for people at great rates. It is a little more â€œtouristyâ€� than other markets, but you can get great deals if you know what you are looking for. â€¢ If you are heading to Darling Harbor one night to see the fireworks, get a table outside at the Watershed (a place recommended by the front desk at the Pensione) and enjoy good food and a front row seat!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Coast, Australia", "Title": "“EXCELLENT VALUE for MONEY”", "Author": "banteng", "ReviewID": "UR121380473", "Content": "We stayed at Pensione Hotel for one night only (2/12) to attend a wedding in China Town, which was only a 2 minute walk away. It was a last minute booking as Sydney CBD Hotels were almost totally booked out due to a number of functions. 'Anywhere we can just put our heads down' we thought; oh that one will be OK then. OK? what a lovely surprise! So handy to many of Sydney's attractions, genuine & friendly staff only too eager to help, spotlessly clean & functional rooms, morning paper, non smoking which is just fantastic, tea & coffee, bar fridge. Only one small criticsm is that they could fit a shower curtain maybe. The hotel has any number of small eateries & coffee shops within a 3 minute walk, handy to Central Railway Station, The Capitol Theatre is also only a 2 minute walk & 5 minutes to the Entertainment Centre. Look, this is not the Park Royal or The Hilton etc however it is not 500 plus dollars a night either! This hotel fills a niche market of good clean accommodation, that is central to so many attractions, clean & comfortable rooms with Staff that are friendly, genuine, treat you with empathy, maintain your self esteem & at all times have a refreshing & welcoming smile. Value for money & in the heart of Sydney, if you knock this sweet & appealing little Hotel, you must be too hard to please. To the Management & Staff of the Pensione Hotel from these Wollongong guests.......all of you take a well deserved bow! many thanks & kind regards Les & Bernadette Wilson", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Well-priced convenient hotel in Haymarket”", "Author": "trigirl2011", "ReviewID": "UR121099271", "Content": "We stayed at Pensione Hotel for 4 nights a few weeks apart during a recent overseas trip to Australia. For both stays, we were on the top floor (4th) in a deluxe queen room. The rooms were recently refurbished and extremely clean. My main concern in travelling for several weeks was to not bring bed-bugs back to my home and there was no evidence of this at all at Pensione. The size of the rooms are cozy but considering the reasonable price-point for both stays, this wasn't any sort of issue since we were on our honeymoon anyway! The noise level at the top floor was fairly low and the bed was quite comfortable. The hotel is on a busy street and well-located. You can walk quite easily to Darling Harbour or grab a bus/train to different parts of Sydney. A couple of small cons: There isn't a shower curtain in the shower and although we loved the lovely shower head and water pressure, water went everywhere during our showers. It made for a bit of a mess. Also, during the 2nd stay, we had major troubles with wifi; however, it was likely due to a low signal level and this issue may vary depending on the strength of your wireless card. Overall, however, we wouldn't hesitate to stay at Pensione again on our next trip to Sydney.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location and priced well for Sydney”", "Author": "barbante", "ReviewID": "UR120772203", "Content": "This position is so convenient. We stayed three nights when we went to see KD Lang concert. Close to Central railway station, George Street buses, Paddy's market, light rail and Chinatown. Our room was extremely clean, non smoking and no smell of cigarettes, we had two pillows each without having to ask. Bed comfortable and night time quiet. They supplied hair dryer, iron and board, coffe and tea making facilities, fridge and safe and all toiletries yet the room was so small any luggage larger than carry on would hardly fit on the floor. Bathroom in comparison was a good size also very clean. We had to push the bed to be able to walk around the end between the desk. Admittedly our room was booked as petite double. Definitely petite. We were told we were upgraded, I'd hate to see what we originally had. Reception staff friendly and hospitable. A few steps up off the street to elevator up to reception on 1st floor. An elevator a back of building to upper floors. A bit of a rabbit warren, building looks like it is a renovation, not new.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value and a great locaton”", "Author": "andytseng", "ReviewID": "UR120688429", "Content": "My fiancÃ©e and I stayed there for 2 nights during my birthday weekend in Sydney. We booked it about 2 weeks in advance and got a 2-night \"Deluxe Room\" for $300 which isn't too bad considering its location. The hotel reception is on 1st floor which is slightly different than the usual. We were made to wait for almost 20 mins before speaking to the front-desk staff as she was on the phone with another customer and there was no one else around. To be fair, it's really not her fault as she was trying to help the customer on the phone with his/her booking and I don't think that customer realised that there's only one staff then. Having said that, it would be nice if there were more staffs to assist the customers onsite. As some of the previous reviews have suggested, our 3-floor \"Deluxe Room\" isn't big (enough room for our two carry-on luggages and there's also a single sofa by the side) but it's tidy and recently refurbished and I like the colour and design of it. The bed is clean and comfortable (which is the most important thing I look for in a hotel anyway) and the bathroom is okay (basic but in good and clean condition). During our weekend stay there, we didn't hear any noise at all even though out room faces the main George Street. The staffs are helpful and the free wifi there was handy also. There's also a Guest Lounge Area with a kitchenette at the back of the first floor to hang out with other people. The free '555' CBD Shuttle is only 5-10mins walk away and will take you all the way to Circular Quay where Sydney Opera House, Darling Harbour, Harbour Bridge and most of attractions are located (Queen Victoria Building is also only a 10mins walk on the same street too if you fancy doing a spot of shopping there). Please note, the free shuttle does get full fairly quickly though. The Central Railway Station is 15mins walk away and has regular trains (every 10mins) departing for the Airport (10mins journey). All in all, it's in good location and good value for the money if you don't mind the size of the room.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Great place to stay”", "Author": "supatrippa", "ReviewID": "UR120629887", "Content": "My daughter and I stayed one weekend night to attend the KPop music festival at ANZ Stadium. The hotel was very easy to find and the small room size (we had a petite and shared a bed) wasn't a shock as I had read many reviews and knew what to expect. The room and bathroom were very clean and functional, lovely shower! Really handy to public transport, we used trains and is was less than a 5 minute walk to Central Station. We felt safe returning to the hotel late at night after the show. Finding the reception on arrival was the only difficulty that we had, even though we knew it was on the first floor, a staff member pointed us in the right direction.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Excellent location and very good value”", "Author": "gary_auck_nz", "ReviewID": "UR120211656", "Content": "We stayed for three nights here in Nov 2011. The front desk was warm and friendly. A very good start. Check in was a breeze. The room was of good size ( we stayed in the deluxe room ). There was a narrow wardrobe and inside the wardrobe was a small bar fridge and below the bar fridge was a safe box. The room was well lit with 3 lamps in total on top of the ceiling lighting. Room was modern and furnishings were contemporary and tasteful. The bathroom/toilet for our toilet was meant for a disabled person so it was very big. Lighting again was good. Mirror was big. Good water pressure and hot water was quick to come on when we needed it. However, the basin was a bit too small for our liking. The room was quiet as our room was to the back of the hotel on the 3rd floor. The location of the hotel is fantastic! Right smack on George St where almost everything is in the CBD! Bus stop almost literally just outside the door step. Close walk to Darling Harbour and Chinatown. Unfortunately, Wifi is not free and is charged at $10 for 3 hrs. Probably this is the reason why it is not 5 stars from me. In this day and age, Wifi should be free to guests and not be a premium on top of the room charge (that's my opinion anyway). Maybe Pensione can think of free Wifi that's capped at, say, 50mb a day for hotel guests? During checkout, the front desk even asked if I have transportation arranged and if I had my shuttle ticket printed out in advance. A very nice touch I have to say. Kudos to the whole team at Pensione. We will definitely stay here again if we return to Sydney.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Convenient hotel on a very busy road”", "Author": "GlobetrottingMan", "ReviewID": "UR120094768", "Content": "This is a very conveniently located hotel in downtown Sydney, a 5 minute walk from Darling Harbour and a short bus ride from Circular Quay (bus stop is only about 50 feet from the front of the hotel. Lots of restaurants, cafes, souvenir shops and a pharmacy within 2-3 minutes walk (including a FANTASTIC French cafe on the corner of the next intersection up from the hotel). We arrived by car at night, and the one-way street it's on is VERY busy--no place to park, even temporarily to check in. So we just threw on our hazard/parking lights and prayed for the best as other cars and buses swerved around us. There's no parking onsite, but they do have two options--one just a block away in a public garage and one that was further away (but cheaper). WARNING! If you choose the public garage that's close by, it is not a 24-hour garage--it closes at some reasonable hour (not sure when, probably 10 or 11pm) and doesn't open until some reasonable hour (I think it was 7am). That's very important if, like us, you have an early morning flight and need to be at the airport well before 7am. Fortunately the staff at the front desk were VERY good and pointed that out to us, so we got the car out before going to bed, parked it on a side street 2 blocks away overnight, and then got out of there so early we didn't have to plug any parking meters. Can't say enough about the whole reception staff, in fact....between asking enough questions to figure out the garage thing to getting online to check us in for our flight--and then the usual task of giving directions--they were great! Rooms are fairly standard, not too big, not too small. Our room (#406) faced a courtyard which was probably good from a noise standpoint (remember what I said about being on a very busy street), but it wasn't real great for scenery. Odd, as well, was the fact that our window was completely plexiglassed in. No way to open the window--because you could see the handle, but couldn't get to it because it was behind the plexiglass. Shower was nice, bed was OK....air conditioning worked fine (which you needed because the window wouldn't open). Front of the hotel doesn't inspire you to believe it's going to be nice (especially not with the horrid smelling wino sitting on the steps when we arrived), but they have done a nice job making it clean and tidy and updated on the inside.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Piacenza, Italy", "Title": "“Very good location, simple but very clean hotel”", "Author": "saraquails", "ReviewID": "UR119629883", "Content": "I recently stayed at the Pensione in Sydney and I was quite satisfied by my choice. The location is very good, within walking distance (15 minutes) from either Circular Quai or Darling Harbour, and with plenty of restaurants and shops nearby. The hotel is clean and reasonably well kept and the reception staff is very helpful and kind. The room I booked was a standard and was very basic and tiny, but very clean, and so was the bathroom. I know they do have deluxe room so maybe those are a bit easier on the eye! I would recommend this hotel to someone who doesn't want to pay too much and just want to have a clean place to stay in a central position!", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Clean, comfortable”", "Author": "bendalong", "ReviewID": "UR119581616", "Content": "Stayed here for one night before a very early flight. The room was tiny and spotlessly clean. This is not a hotel I would recommend staying in for more than a night or two as the cheaper rooms are very small. But this is what we paid for. A clean and comfortable and very convenient hotel. Will be staying again if I need to stay in the city for a night. Staff are great.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nowra", "Title": "“fantastic hotel”", "Author": "verity a", "ReviewID": "UR119058923", "Content": "i would say its the number one hotel in sydney city...... wonderful beautiful staff , so clean and comfortable staying. the staff are helpful to your needs when requested it was an amazing stay can t wait to go back.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas", "Title": "“Central City Hotel with respectable value”", "Author": "Aceeker", "ReviewID": "UR118928064", "Content": "The building was a bit aged, but the hotel was fairly well kept up. Good location near central Sydney - within walking distance of the university, and not too far from the bay area where the Sydney Opera House is located.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Great value”", "Author": "John H", "ReviewID": "UR118792844", "Content": "Spent three nights when across for a conference. Hotel room was small, which I knew and expected from previous reviews, but very clean, well appointed with a great (but small) bathroom. Exactly what I was looking for. I was only at the hotel to sleep, and this hotel was a very nice surprise. Certainly not 5 star but way more than adeqaute for my needs. Will definitely stay here again. For the money it was fantastic.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Excellent value with fantastic service”", "Author": "Stylish69", "ReviewID": "UR118680104", "Content": "What a fantastic hotel, never before have I experienced such great service. This little hidden jewel with amazing modern rooms and better than 5 star service. I have travelled all around Australia and this was my most enjoyable stay, thank you to all the team who spent numerous hours on the phone looking for my luggage. This place is one not to miss when staying in Sydney, unbeatable location, super clean rooms, service and well priced. I will be back without a doubt!!", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great hotel, great staff”", "Author": "jayjay41", "ReviewID": "UR117379079", "Content": "Stayed in the Hotel for two nights. Found the room a good size, clean and tidy. Big bathroom with an amazing shower, like standing in a rain downpour- nice. Great location. The staff were friendly and helpful.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "BRISBANE, QLD, AUSTRALIA", "Title": "“best in the area for the money”", "Author": "QUEEN_OF_CATS", "ReviewID": "UR117300517", "Content": "stayed here for 2 nights in july, paid $25 a night to upgrade to a delux room . from what i have been told well worth it. it gave us a bigger room, (as the basic rooms are very small) and nicer furnishings. we had zippered king singles for our bed and it was massive and super comfy as were the pillows. bathroom small and bathroom floor got soaked everytime the shower was on. our room was on the 4th floor over looking george st , we could hardly hear the traffic outside as the windows are double glazed. good nights sleep both nights. i used the guest lounge on the friday night , took a bottle of wine in there and sat and listen to the music in the bar downstairs since the rest of my party had gone to bed. it is cold in there tho as the room is not closable, open stairwell to bar downstairs. it was equiped with a microwave, crockery , cutlery , payable internet and a laundry. no restaurant on site didnt bother us at all being in the heart of china town. location excellent , for us you cant beat it.george st one side china town the other.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Garland, TX", "Title": "“Hotel Hell And I Will Not Be Back!”", "Author": "Arcturus6", "ReviewID": "UR116947000", "Content": "Let me begin by saying the Hotel Staff were very nice and friendly. I feel bad for them that the hotel is not. This hotel has a three star raiting and does not deserve three stars. One star would be a generoud rating. The rooms are small and offer little amenities. We did have a small mini fridge, a safe (where I had to actually lay flat on the floor to reach) a hair dryer, an iron and ironing board. Golly, gee whiz and wow! During my stay there we had two \"false fire alarms\" requiring those in the hotel to evacuate!. There is no ice machine at all in the hotel and there was only two elevators, one in front and one in the back. The bathrooms were equipped with showers only and they were not enclosed so water went everywhere when taking a shower! In addition there is very little space for keeping toiletries. Also, I supposedly had one of the better rooms and had to pay an additional $15AU nightly for that privilege! The closet in my room was very small and reminded me of something you would keep a couple of brooms in. All in all, I cannot recommend this hotel unless someone wants to be punished for taking a vacation.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Victoria", "Title": "“Great staff, wonderful location”", "Author": "MarcusBVictoria", "ReviewID": "UR116873070", "Content": "We stayed here in March for 3 nights to have a Sydney break and see a show. The trip and hotel was booked as a surprise gift so I can't comment on the value/cost but what I can say was that we were treated like VIPs and that everything was perfect. Yes the room is small but we were there to see the city , not to have a room party! You could not ask for a better location, 5 min walk to the Central train Station and 15 minutes to Circular Quay or a free bus outside. I had a business motto that was \"We aim to exceed your expectations\". Well they did that admirably.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Practically perfect for Mary Poppins”", "Author": "jaybee1965", "ReviewID": "UR116648899", "Content": "I booked a family room at this hotel for Saturday night 6th August to see Mary Poppins at the Capitol Theatre. My parents, brother and 15 year old son shared a room with a double, two single beds and a bunk bed. A small fridge and tea/coffee facilities were provided. The window was double glazed and we didn't hear any noise although we overlooked George Street on level 2. It was a very short walk to Campbell Street and the Capitol Theatre, as well as Chinatown, Paddy's Markets and Central Railway Station. The lady at Reception was very friendly and offered to store our bags when we checked out as we were catching a bus home at 1pm. Old building but nicely renovated inside, modern bathroom with luxurious cloudburst type shower. It suited us to all be in one room as we were only sleeping overnight and thought $300 was a good price for the excellent location. The reception is on the first floor so the most obvious street frontage is Charlie Chans Bar. There is also a security coded front door for night access.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Whakatane, New Zealand", "Title": "“Superb Location”", "Author": "lee0170", "ReviewID": "UR116362150", "Content": "We really like this small hotel in China town Sydney on George Street. The hotel was 20 mins walk to harbour bridge and very pleasant to stay in. We did have a uncomfortable and the lovely receptionist swapped the bed over with no hassle at all. I have to commend the girl on reception (August 2011) she was very professional and freindly and she had superb knowledge of the area, and give us grat advice. The rooms were tastefully decorated but a little bit small but you understand that being in the middle of a city. will definately go back there when in Sydney next.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "canberra", "Title": "“Good location, reasonable hotel”", "Author": "cee99", "ReviewID": "UR116193129", "Content": "I have stayed at the Pensione hotel before and loved it, however this time it was not quite so enjoyable. On both occasions I was travelling solo. The room was small, however this is an old building and it was perfectly acceptable to me on my own (and I am quite large). My room had an en suite bathroom with (most) toiletries, fridge, tv with remote and wardrobe + iron and hair dryer. It was beautifully clean and comfortable and it is in a fantastic location for the price. My main qualms were: 1. I wasn't provided with a hand soap (although this was just an oversight and was quickly rectified) 2. My toilet began leaking very loudly at about 4.30am. The reception is 24hours, but when I went there was no one there. I managed to fix the leaking myself 3. The bar next door played very loud, not very good music until about 5.30am on Saturday - I was on the first floor at the front of the hotel (on George St) (There was no noise on Sunday night) Overall this is a great hotel, good location, spotless and friendly staff. If you are staying just be aware of the room size and ask to stay in the back of the building or on a higher floor where it should be quieter", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Loved the location...”", "Author": "Travel_Lizzie", "ReviewID": "UR115469345", "Content": "Stayed for one night. Really liked the location and the fact that you can hop onto the free city shuttle bus. Food aplenty ranging from Chinese, Kebabs & Doners, Bakeries, Japanese, Korean; all right at the doorstep. The room was small, in fact I felt that the bathroom was bigger than the bedroom. I didn't mind the room being small but it gave a crick in my neck having to look up at the TV that was mounted at the top left corner (just above the door). Always ask first if Internet is free. I thought I saw a banner on the website saying internet is free but apparently it wasn't. Perhaps if you take a more expensive room (I took Deluxe Single) they might give it to you FOC and allow you late checkout (normal checkout time 10.00 am). I love that the staff were showing good ol' Aussie hospitality. The staff were friendly, helpful and has a handy map for you at the counter. If I ever come to Sydney, I would want to stay here again for sure!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Tasmania", "Title": "“Lovely and clean right in Sydney CBD”", "Author": "bubblycanary", "ReviewID": "UR115403795", "Content": "Lovely hotel right in the heart of Sydney CBD. There's a bus stop right in front of the hotel. Convenient location. Darling Harbour is just 10-15 minutes walk away. The hotel room is small but very comfortable, clean, & nicely decorated. Thanks to their double-paned windows, we don't have any troubles with the noise from the buzzing George street. There's a common kitchen area that guests can cook and dine if they feel like to but if not then restaurants are just everywhere around the corner!.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Western Australia", "Title": "“Great staff and facilities albeit with a freshly painted smell”", "Author": "trailswest2008", "ReviewID": "UR115234964", "Content": "Had four excellent days at this middle range Sydney Hotel very close to city centre. Small items fixed immediately in my room, very helpful staff and location on noisy/ busy George Street is counteracted by double windows. Added bonus is free Fitness First Voucher each day - two centres short walking distance and very welcoming. Good laundry facility but needs to be spotless at all times - uses Dollar coins. Room had pillar immediately in entrance area and no table but otherwise excellent. Recommended - rate good value.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toowoomba, Australia", "Title": "“Great location”", "Author": "Letsgobronco", "ReviewID": "UR115168287", "Content": "We stayed at the Pensione on the recommendation of the concierge desk at Sydney International Airport as a last minute booking when experiencing flight delays due to the Chile volcanic ash. We were pleasantly surprised with the price, and even more so to receive an unsolicited upgrade upon arrival. The staff were friendly and efficient, rooms pleasant with double glazed windows for noise reduction, and the hotel is centrally located to China Town, Paddys Market and Darling Harbour. There is also a communal kitchen for guest use. The only cons - perhaps a small table and chairs would be a useful addition to the room, and it was a little confusing to find reception after being dropped by the shuttle bus at the rear of the hotel ardade. We would stay here again!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Innisfail, Australia", "Title": "“I would recommend this hotel”", "Author": "Tracy499659", "ReviewID": "UR114419557", "Content": "My mother and sister and I stayed for 7 nights, sharing a room in June 2011. The service / knowledge / recommendations and friendliness of the staff (especially Jess) was great - we tried many of her restaurant suggestions and were not dissapointed. The room was clean and comfortable - not ultra flash, but with all the facilities you need at a reasonable price. The location is excellent, within easy walking distance to paddys markets, central station, Darling harbour, Powerhouse museum, Capitol theatre,etc etc. We liked best the friendliness and helpfullness of the staff and the great location. The only thing we didn't like was the sirens that woke us up occasionally at night - but if you sleep in one of the busiest streets in Sydney, you have to expect that ! I would recommend the hotel to anyone wanting a clean, reasonably priced hotel with a great location.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Easy Access to Public Transport.. and nothing else really”", "Author": "casey9759949", "ReviewID": "UR109248724", "Content": "If you are going to rely on public buses and trains to get to your places everyday, this will be a perfect place for you to stay. In fact, food around this area is considerably good as you will have a very good variety and you will never be bored with just burgers and chips. I spent about 5 days there and at night you will get the strange feeling of staying at a budget red light district in Geylang (a similar place back in where I came from... go google it)... and oh yes, minus the free wireless connection of course.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A great place to rest and shelter from the Sydney CBD”", "Author": "kennvee", "ReviewID": "UR106328599", "Content": "I stayed at the Pensione for two nights at the end of April 2011. I am motivated to write a review simply because my expectations of the hotel from online reading were exceeded. Most notably, thanks to double glazed windows, the noise from George Street did not interfere with my rest and enjoyment of the place. In addition the Pensione has location, location, location. It is close to the Sydney Entertainment Centre (my destination), the Sydney CBD and the Town Hall railway station. The staff were very helpful providing information with their knowledge of the locality. I would recommend the Pensione to a friend and I would definitely book there again on my next visit to the Sydney CBD Be prepared for a fairly small room without comfortable chairs. That doesn't matter if you are busy all day and only want to sleep there.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Fantastic Location & Super Friendly Staff”", "Author": "Brenswee", "ReviewID": "UR104761923", "Content": "I stayed at Pensione for a couple nights my first few days in Sydney and was overall really happy with it. The location is fantastic!! It's close to the Central and Town Hall train stations, and my first day I even walked all the way up to Circular Quay, which was about a 30 minute walk. They upgraded my room without me even asking-- it was nice and clean and looked fairly recently renovated. It was a little dark in the room, but nothing a lamp couldn't fix. The hotel felt secure (they lock the doors at night and you need a code to get in), which I really appreciated given that I was travelling alone, and they also had really fairly priced internet. The staff were extremely friendly and seemed to want to do anything they could to ensure I had a great stay. The only thing I wished had been different was that my room was situated right off the reception area, so I was woken up at 5am the 1st morning by other visitors checking in or out.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nishinomiya, Japan", "Title": "“Small bed and room, but manageable”", "Author": "NishiNippon", "ReviewID": "UR103555701", "Content": "Location is right next to Chinatown, close to Paddy's Markets. Possible to walk from Central Station to the hotel. The room was tiny and the bed was a bit small, but if you are looking for a place to sleep that is close to Chinatown then this hotel is not a bad choice. Television is placed at a weird angle and the view is not really anything to talk about. You wouldn't stay in the room for long. Check in and check out was painless and the staff were friendly.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Great Little Hotel”", "Author": "N1C0LA", "ReviewID": "UR102706244", "Content": "I travelled to Sydney from Perth for a few days with my sister and we stayed at the Pensione Hotel. It is really close to China Town, and it takes less than 5 minutes to walk to Town Hall station, and not much longer to get to Darling Harbour. The hotel itself had helpful staff, and the deluxe twin room was a nice clean, modern room which also had a fridge which was handy. There is a small but very useful communal kitchen and lounge on 1st floor, as well as a washer & dryer, there was never really anyone in there when we wanted to use it to make toast in the morning and pack up some sandwiches for the day ahead. There seemed to be a good mixture of people staying at the hotel such as families, older couples, and younger travellers too. We never had a problem with noise or anything, and found the rooms very comfortable - it was nice to get a newspaper in the morning as well :) I am booking the pensione hotel again for my parents who will be visitting Sydney, as my sister and I loved the location and had a very comfortable, enjoyable stay", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cheap and convenient, that's it.”", "Author": "katsui", "ReviewID": "UR102626165", "Content": "Service: Good. The lady even helped get a huntsman spider out of our room. The room: Basic. We were upgraded, I'm not sure if I like that, we ended up with a double bed and a bunkbed? Why did we need a bunkbed? The TV was awkwardly positioned above the double bed so the best place to watch TV was from the top bunk. Location: The best thing about this hotel is it's location. Close by to everything. Amenities: Don't expect much. What I liked the best: Location, cheap. What I liked the least: Everything else. I won't be coming back here.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockton-on-Tees, United Kingdom", "Title": "“Not too sure what the negativity is about”", "Author": "deathdude12", "ReviewID": "UR102500647", "Content": "Stayed in a deluxe double, im aware there are smaller rooms, however had no problems with anything really. Internet would be good if it was free, i had my own wireless so i used that. The hotel itself was rather unique in its layout, very good location. The main lift is a little slow but the building is 'old' ( for sydney). The facilities were your average ones really, laundry which worked fine, it has a nice little kitchen/communal area which was handy. Well recommend this hotel if your thinking of visiting, within 5 minutes walk of central station, tram stop, monorail stop and sydney tower.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Aylesbury, United Kingdom", "Title": "“good value but could be noisy”", "Author": "franki53", "ReviewID": "UR102146430", "Content": "The staff made this little hotel in the heart of george street (some 25 mins walk from opera house) all worth while Was upgrade from a back packer hostel but very central for all our needs 10 seconds from pubs, internet cafes, cafes, buses, food shops, markets and 10 mins or so from attractions Smallish room but adequate Smoking area good but needed bit more sun as very shady Had a launderette and cooking facilities I advice a room on level 4 as we where under a club/pub and on friday and saturdays it was very noisy", "Date": "March 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wetherby, United Kingdom", "Title": "“A good value hotel in a quiet position near Chinatown”", "Author": "kenfrew", "ReviewID": "UR100036231", "Content": "The hotel room was very comfortable and clean, although a bit small. There was a kitchen area on the next floor where you could make breakfast or a meal but we ate out as there were lots of restaurants to choose from in nearby Darling Harbour. There wasn't a bar in the hotel or lounge area but there was a nice bar just next door. Good value hotel in quite a central position.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Looks better in the ads, than in real life”", "Author": "travelexpert11", "ReviewID": "UR99090575", "Content": "Although it is in an ideal location with easy accessibility around the city - the hotel itself is not very clean looking from the outside and even once inside. Our hotel room window was so small you could hardly see out, so no natural light came in at all. The corridors were very dark and musty smelling and the smell of cigarettes from the outside smoking area was awful as you had to use this entrance to get to your room. The reception area could also do with a refurbish. Staff were very helpful though.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Wonderful”", "Author": "SaraD_11", "ReviewID": "UR98828066", "Content": "I found the service fantastic. The reception staff were exceptionally helpful. The location was perfect for my needs. Everything was in walking distance. I didn't need to catch a cab anywhere. Although the room was small, it was clean and contemporary. Would stay there again in a heartbeat.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "wirral", "Title": "“Great value for a city centre location”", "Author": "wirralpam", "ReviewID": "UR98187128", "Content": "We stayed 3 nights at the end of our holiday in Oz. Staff were very helpful and friendly and hotel was really clean which is so important. We knew the room was compact when we booked but it had everything we needed so no complaints there. Great location but a bit too busy for me but that is just a personal thing. Husband slept well but the air con units outside on the roof kept me awake but I am a very light sleeper so most things keep me awake anyway. The fire alarm works really well as we found out on our last night. Had to evacuate the building at 1.40 a.m. due to some idiot deciding to take a 40 minute shower and setting the alarm off. Had it been the real thing, I can assure you nobody would sleep through that alarm! All in all a very good hotel and I would recommend it to anyone wanting the city centre. You can also cook in their guest lounge. There are laundry facilities so you can self cater if you wish.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BJ", "Title": "“Clean, safe, central”", "Author": "ST_ray_BJ", "ReviewID": "UR97076163", "Content": "This is my second time at Pensione but I've been to Sydney several times for work. After comparing prices and location, I decided to try the Pensione again and wondered if it had gone drab and old in the years since my last stay. On the contrary, it was as clean and well-kept as the last time, and front desk staff were nice and helpful. I had a petite double deluxe (double bed in a small room, cheaper than the premium). While there was no wardrobe, there were hooks and hangers on the wall, which was fine for a weekend meeting or if you're travelling out of a suitcase. Fridge, kettle / tea / coffee making things, great bed, nice toiletries were all in the room. Bathroom was spotless and rainshower great -- there weren't even mould spots in the shower stall. It's a perfect base for exploring the city, and walking back alone from the lightrail station late at night was fine, it's a busy area and safe. I think if you need a bigger room or space, the larger premium rooms are also great value but presumably that's why they tend to be booked up quickly.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good budget hotel choice”", "Author": "GigiNine", "ReviewID": "UR97035626", "Content": "This is a good budget choice for Sydney CBD. It's near the corner of Goulburn and George Sts, very close to Chinatown. A bit of hike from the central CBD and the harbour. Well served for public transport with a bus stop right outside (don't forget to get a bus pass from a newsagent, you can't pay cash on Sydney buses). It's not that far to Town Hall station. Visitors to Sydney may find the area a little dodgy feeling - but it really is quite safe, though I would be careful walking around late at night, like in all cities. There is a Coles grocery store across the road. Make sure to ask for a quiet room - there are a lot of internal facing rooms for less noise (I was pleasantly surprised at how quiet my room was) There are more rooms than are evident from the street frontage, hidden in a maze of corridors, some with steps, so perhaps not ideal for the disabled. I stayed in a Petite Double, which is very petite ! But there are high ceilings so it feels OK - it's fitted out with a queen bed, a chest of draws and a bar fridge. There are no cupboards (so no ironing board or iron in the room, they do have a separate laundry though) - just hooks on the wall. There is no seating and the TV hangs from the ceiling. They have cable tv - BBC news, V, espn, Arena - but don't have any of the digital channels or SBS. My room was a little tired - some paint is peeling from the walls. The lighting is rather poor - very dim. It was difficult to read as there were also no reading lamps (I find this is a problem in many hotels, I guess it must save on electricity costs) The room is airconditioned - not adjustable, you're stuck on 20o which was not quite cool enough as it was very muggy weather when I stayed. There were 2 very big (if grubby) windows which you could open (mine looked over a lightwell onto a roof, had to keep the curtain shut for privacy). The bed is a little saggy, and the decor is a bit tired (or is it just the drap colour scheme?). The bathroom is really lovely - clean and new, with a good shower (good water pressure and hot water!) but like the room, poorly thought out. The toilet gets soaked when you are having a shower, as they placed the entry at the wrong end! The hotel has a nice shared lounge space with a tiny kitchen (eg microwave and sink) and a laundry. They have an arrangement for free entry to a Fitness First gym nearby (which is a much better option than an in-house gym which are often tiny and poorly equipped). I would stay here again - this could be a really nice hotel with a little work.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "newcastle, england", "Title": "“My precious necklace \"disappeared\"”", "Author": "sandra_wright", "ReviewID": "UR96416556", "Content": "We booked into this hotel for a single night in January because the hotel we were staying in didn't have a room for one of the nights we needed - and it was the biggest mistake I've EVER made. The room was very basic but OK, despite only having a view of the a/c units through very grimy windows The main issue was that we were a bit rushed when we checked out because we only just made the 10am check out deadline and I left my favourite necklace behind in the room. I realised in the taxi on the way back to our original hotel that I'd forgotten to put it on and immediately rang reception to ask if someone could retrieve it. The person on Reception was very sympathetic and said it hadn't been handed in but that she'd check with housekeeping. She rang back very quickly to say that she'd asked them to check but that it wasn't in the room. My husband explained that I had definitely left it there because I only ever take it off to go to bed - it has great sentimental value for me, although it wasn't a valuable piece of jewellery per se - but a further search apparently failed to find it. Despite several phone calls that day and the following couple of days it never did turn up, which upset me a great deal because I KNOW I left it behind in the room and we rang the hotel very soon after we left, and certainly before any other guest had checked into that room. The girl on Reception was very helpful and sympathetic but that didn't help me retrieve my precious necklace. The saddest thing about al of this is that it ruined my entire trip to Sydney and it's now the only vivid memory I have of my time in Australia. Please be careful if you stay here that you lock everything away when you're not in the room and that you make sure you take everything with you when you leave so that you don't have the same experience as I did.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gibraltar", "Title": "“Good central location - worth upgrading!”", "Author": "Jovizz", "ReviewID": "UR94400874", "Content": "We stayed in a Premium Double which was definately worth the extra cost! Situated on the third floor towards the back of the building so we experienced no road/pub noise, the room was very spacious (which is essential when on a lengthy holiday around Australia with lots of luggage) and the decor was very contemporary which suited our style. Very large bathroom and shower, very big and comfy bed. In room safety deposit box, and the onsite laundry was a bonus too! Our only minor complaint about our room was the lack of drawers/shelves for storage, there was only a small wardrobe space. We had relatives staying in a Premium Petite Double too which was decorated in the same contemporary style but much smaller (although still had a huge bathroom/shower) so wouldn't recommend for travellers with lots of luggage - luckily our relatives are from Oz so only had small cases for their 3 night stay. Standard rooms did not appear to be decorated in the same style, a bit more basic, but communal areas were all styled well. You have to access the hotel via a doorway entrance on George Street, reception is on the first floor, we never had a problem with the lifts during our 5 night stay. The location of the hotel is fairly central, China Town on your doorstep, with lots of buses running up and down George Street - including the rare 555 free shuttle bus to the harbour! Town Hall underground station is only a short walk away, and is takes approx 15/20 minutes to walk up to the harbour with lots of shops on the way. A taxi up to the Harbour/Rocks was only 9 dollars. Darling Harbour is also within 10 mins walking distance. My only negative about the location was some of the 'adult' book shops close by on George Street, but don't let that put you off as we still felt it was a safe area and always busy. There is a fabulous little deli/cafe just up from the hotel on the corner of George Street/Goulburn Street that is great for breakfast and sandwiches, and seems to be open practically all day and is always busy! There's also a great little bottle shop next door. So unless you have the budget to stay up at one of the lush hotels on the harbour, Pensione was in a very good central location at a reasonable rate for someone on a month long holiday, and the room was spacious, clean and stylishly decorated.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Better than expected!”", "Author": "Newtraveller009", "ReviewID": "UR93894620", "Content": "We had booked a trip to Sydney earlier in the year and left our accommodation to the last minute. After days of searching for the cheap accommodation in Sydney over the New Year period I stumbled across Pensione Hotel. Every one I spoke to at Pensione to assist with my booking were so helpful. Initially I had booked a petite double but decided to upgrade to a premium double. My expectations of it being small and not very nice were changed the minute we arrived. Our room was so tidy, modern and big. We were so pleased with the service, the value for money, the location of our room and everything about Pensione. I would recommend discussing your requirements with the staff when booking as if you need a bigger room get a bigger room but if you want something cheap and cheery go for a smaller room.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Nice, Would Recommend”", "Author": "andiluciad", "ReviewID": "UR93415098", "Content": "We loved this place. We stayed in premium room, I guess they have been refurbished recently. Staff very friendly, they made good recommendations and the price was reasonable.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Not worth the money!”", "Author": "cosmicgirl36", "ReviewID": "UR92953053", "Content": "We had a twin room. The room was nothing special,it was small, dark, the painting was coming off the wall in some parts, and this is the hotel which calls itself a stylish boutique hotel !!!! Also there was not much furniture to put away your belongings. We had to change room half way because of the noise level from the bar downstairs. The second room was even smaller, with not even a bedside table, lamp, or chest of drawers. We asked for those items and we were only given a lamp (taken another room). We only realized half way through that there were cooking facilities available, and a guest lounge room. When we checked in ,although the service was very good, this was never mentioned clearly. On the whole though the staff was very helpful and friendly. The $99 rate , a catchy price, is almost never applicable. And what we paid for New Year period is definitely not justified.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Excellent value for money in a brilliant location”", "Author": "karlandlisa1009", "ReviewID": "UR92882723", "Content": "Booked on line for one night.The hotel is in a great location,close to city, bars,restaurants.Clean rooms and friendly staff.The young lady on reception was very helpfull and made us feel very welcome.Rooms were spacious and clean.This is a well managed hotel and i would recommend it to anyone who is looking for a bargain,for which it is.The only downside..............we stayed for just one night.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“website looks can deceive”", "Author": "syko2", "ReviewID": "UR92266421", "Content": "$160 a night mightn't be top-dollar, but it ain't chicken-feed either. for similar money, I've stayed in much worse hotels, but much better ones too. a quaintly-named 'petite double' isn't so much petite, as oddly-shaped and badly-planned. the smart design and marketing of this hotel and its sisters & brothers couldn't be better reflected than on the slick-as website/s, precisely why in-the-flesh first impressions come as such a disappointment: the sydney pensione is like a pathetic shadow of its apparent former glory; such a shame for something that shows such promise (and in a heritage building to boot). the only real saving grace is a group of lightweight, junior but warm, friendly, unpretentious front desk staff. the location is advantageous (it's a case of chinatown, you're virtually standing in it, for example) and the guest lounge is a cool feature, 'though that too is as tatty as the peeling paint and carpets that look like they're about to walk out on their own which feature throughout. rooms have lousy, well out-of-date tvs that don't get digital channels and there were none of the touted in-house or cable movies. there are hangers, but nowhere to hang them. no bedside or any other kind of tables, not a chair. our shower-screen required the strength of the governator to slide and, despite repeated pledges, was never fixed. let's face it, the room shouldn't have been made available unless and until it was functional, in the first place. housekeeping didn't so much as bother to wipe the bathroom mirror, or other surfaces, wash a dirty glass or replace toiletries and it took till late in the day to service the room in any case (except on our day of departure, when we had the luxury of a late checkout, which was respected with an early knock on the door from said slackers). the bed was very roughly made. if the hotel met expectations raised by the website, it would be a very different story. not much point, it seems to me, having a quality website if you don't deliver the hotel to match. for not very much more money, one can get a better-located hotel with many more features and a much higher standard of presentation. deeply disappointing : (", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Clean, great value for money in Sydney's CBD”", "Author": "RossMon", "ReviewID": "UR92131042", "Content": "I've stayed in the Sydney Pensione quite a few times, and have always been glad I've stayed there. Clients regularly put me in nearby hotels costing three-fives times the price of the Pension, and I always sleep better here. Comfortable beds, and usually quite - but of course it's in the CBD, so some noise is expected. Because it's budget priced, other guests, particularly groups, can be noisey in the hall, but again, all things considered, great value for money. If you want a luxury room (and you'll pay $$$ in Sydney's CBD) go somewhere else, but if you want clean, modern, budget accommodation in a great location, check out this hotel.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“Clean. A good step above hostel, but don't get a room above the bar on George Street.”", "Author": "TravelBeaucoup", "ReviewID": "UR91959528", "Content": "This is a clean hotel, but not boutique as it is described. The rooms are small, but adequate. Ours did not have a closet. But it did have a TV (not flat screen), kettle & coffees and fridge with milk. The A/C was fine. But if it stops working in the afternoon, call reception - they have an override switch and can turn it back on. Our room was tiny, so was our friends' - there are bigger rooms, but I guess you get what you pay for. Not that it was cheap over the New Year period. Security may be an issue. The lifts require your room key to access the floors, but if someone comes in the front door, they can walk up the stairs and are in the hotel. There is a number entry system from the street after 10pm. Twice we came back to find people trying to get in. One couple were indignant that I was not prepared to let them enter, until they showed me their room key. Even then, they didn't understand why I was doing what I was. The second occasion, the ne'er-do-well accepted my rejection, no doubt someone else let him in later. He did NOT belong there. Another time, my friend found a homeless person climbing the stairs to the 1st floor (2nd floor American) where reception is. He was asked to leave, but this must happen too often. Our friends were in 105, which is just at the top of the stairs as you enter. It is also above Charlie Chans' pub, which plays music loud and late. They were unable to sleep properly until 5am one Sunday night There is no room safe, but you can leave valuables at the front desk. However, they will ask if you are leaving cash, and then refuse to take the package if you say yes. So you have a choice of fibbing or not leaving cash. Another however - no receipt is given for the valuables, and to get them back, all you have to do is ask for your room number and you get that envelope back. No proof of you being in that room or anything. That needs to be rectified. Now the good things: It is near China Town, Darling Harbour, the free 555 bus to Circular Quay, and the Cheers pub, which shows the English Premier League matches. There is also a gym close by which you can use, as a guest of the hotel. There is a good breakfast place on George and Goulbourn Streets (NW corner) - La Francais - or something like that. The 3 Monkeys pub on George and Liverpool streets is a bit smarter than others near by. WiFi is AU$ 15 for a day's use - cheaper than many places, but not free. Boo. Minus points for that. Australia is particularly bad for not having free wifi. It is already an expensive place to visit, with the strength of their dollar, so AU$ 27.50 per day, which many place charge, is a bit steep. So Pensione at AU$15 isn't too bad.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Friendly helpful staff, great location”", "Author": "Sandysu58", "ReviewID": "UR90268906", "Content": "I stayed at the Pensione Hotel for two nights with hubby and our adult son - we went to Sydney for Christmas shopping and also to attend a concert. The hotel itself is in an old building and the age shows a little in things like the small, fairly slow elevator, steep stairs etc. And, as I expected from earlier reviews, the room was quite small. However, the room and the hotel in general was clean and well maintained. The staff I dealt with were very friendly and helpful. On first entering the hotel I was concerned that the room might be noisy as it's close to some hotels etc, but there was no such problem. There is no onsite car parking, but you can get discounted parking rates at another hotel only a tiny distance away. There's also no fitness centre, but I understand that there's an arrangement with a nearby gym for use of their facilities - I didn't have time to try it out though. I wouldn't recommend the hotel - well, our room anyway - if you want to a room to work in, since there wasn't a table and the lighting was a little dim. However, for a place to base a shopping / entertainment trip to Sydney, it was perfect - close to public transport, shops, restaurants, etc etc.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Somerset, New Jersey", "Title": "“Luggage disappeared”", "Author": "worldlee01", "ReviewID": "UR88768636", "Content": "We checked in at the front desk and staff asked us to leave the bags in the same area shown in the photograph hear. We were shown a room that was available and when we returned our high priced camera equipment was stolen. 5 weeks of precious photography. We complained to the front desk and when we were leaving we were escorted out the door by the hotel mgr/owner, daring us not to say anything. Additionally the police were no help. They told us to go searching around Kings Cross.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Morristown, NJ", "Title": "“Clean, friendly and convenient”", "Author": "jwheller", "ReviewID": "UR88705313", "Content": "I needed an inexpensive hotel room for one night and picked the Pensione Hotel. The staff was very friend and helpful. Walking up to my room I was skeptical since it faced the road but there were double windows that kept out 99% of the street nice, including the construction across the street. The room and bathroom were very clean and the bed comfortable. Being close to china town was a bonus and it's a quick walk up the road to some great shopping.", "Date": "November 30, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Poor value for money and rubbish facilities”", "Author": "Wilsonroom320", "ReviewID": "UR87563914", "Content": "I booked this hotel through an online agent, and the first issue is that I paid way over the odds. The first room they gave me didn't have a proper window. The second room they offered had a window but was much smaller. My main issue was with the bathroom - the sink is so small you can't get the kettle under the tap and there is absolutely nowhere to put soap, toothpaste etc. In the bedroom there is a small wardrobe but no drawer space and nowhere except the floor to put your suitcase. One lamp isn't working so the room is even darker. It's very difficult to work at my laptop because the chair is a lounging chair rather than a working chair. Would definitely not stay here again. The only good thing is that the staff are friendly and helpful.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swansea, Australia", "Title": "“I wish we had found this place earlier”", "Author": "notagain1948", "ReviewID": "UR87220556", "Content": "After putting up with three nights at a terrible backpackers in Sydney, we decided to look for something better that wouldn't cost a fortune. That's when we found the Pensione Hotel. The Pensione describes itself as a boutique hotel, however, if you intend to stay, be aware that it doesn't have full hotel facilities. It is in fact an up-market backpackers so there are no coffee and tea facilities in the rooms but there was a fridge in our room and a decent sized flat screen tv. There is a clean, airy, decent sized guest lounge which has a kitchenette and fridge for guests to use. There is also internet access in the lounge for a cost of $5.00 an hour. The accommodation is very comfortable and clean, and the building is well maintained. We can't fault the service we received from the staff who were more than helpful. We booked our room via a \"desperate for a bed for the night\" online agency and paid $90 for our double room with ensuite. The regular tariff starts at $95.00 a night. The Pensione is well located in George Street, not far from Chinatown and Darling Harbour. There is a bus stop very close by from where you can catch the free green metro bus which does a circuit of George Street and Elizabeth Street from Central Railway station to Circular Quay and back. Very handy to know about if you are trying to economise. We also bought multi tickets that allowed us to travel unlimited distances on the buses, trains and ferries. We saved a lot of money that way too. If we go back to Sydney, we would certainly look at staying at the Pensione again.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ballina", "Title": "“What a great surprise”", "Author": "WhenWeTravel", "ReviewID": "UR85530705", "Content": "Found this place at the last minute, and thought for the price and for one night it was worth the punt. Newly renovated rooms - very European (small/ tidy). Daniel at the reception was a great young bloke, with a good attiude and service ethic. So close to the lively atmosphere of China Town (you can smell the aromas from the balconies) and lower George St - though an easy walk into city centre. We also stayed at a 4 star on the same trip, and had we known would have stayed here the whole time. A bonus was being able to use a nearby (fully equipped) gym.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“It's quirky, a hidden gem”", "Author": "DenzelBrisbane", "ReviewID": "UR84849439", "Content": "Close to Central Station and next to Chinatown - lots of restaurants of all kinds nearby. Short corridors leading off to clusters of rooms gives it a quaint, old-fashioned feel. Rooms are clean and quiet, beds are comfortable, the bathroom lacks an exhaust fan, but otherwise great. Good guest lounge where you can prepare your own meals, and very good breakfast pack for $10 at reception. Parking stations are nearby and the hotel gets a discount - $30 for overnight.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wodonga, Victoria", "Title": "“Great convenient location - good value for money”", "Author": "dotcomdotau", "ReviewID": "UR84694136", "Content": "Stayed for 4 nights here on my 3rd trip to Sydney so was aware that this was in a very convenient location - walking distance from Central Station, Chinatown, Darling Harbour, and just around the corner from the Capital Theatre. Bus stop is almost outside front door that will take you for $2 to Circular Quay (also a free shuttle bus available) Small rooms but recently refurbished. Has a community lounge and kitchen that I didn't use. Halls a bit drab and dark, lift a bit slow. Some construction across the road and as usual in Sydney sirens are likely to wake you a few times each night. As a solo female traveller in her 50's I find that there are so many people in the streets at all hours that I do not feel uncomfortable. Great place if you are on a tight budget - if not then go for something a bit fancier.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Bed was terrible so ended up sleeping on...”", "Author": "Mlnjaq", "ReviewID": "UR79191282", "Content": "Bed was terrible so ended up sleeping on one of the very hard bunk beds. There is no excuse for a saggy baggy springy bed... A hotels business is beds! Would not stay again because of the poor sleep.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Brilliant”", "Author": "universal17", "ReviewID": "UR75831922", "Content": "Excellent location, staff, rooms etc... I really felt comfortable, and it's right in the heart of Sydney city. Highly recommend!!!", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great value, good location & excellent service”", "Author": "SasDex83", "ReviewID": "UR73662672", "Content": "I stayed at the Pensione Sydney for a weekend back in April and found the hotel to be a really great place to stay. I originally booked as they had a great special going through Expedia and I thought I would give it a go. I couldn't fault it - you get what you pay for and I was impressed with all aspects of the hotel. The locations is excellent - really close to everything which is handy when you don't know Sydney that well. The staff were excellent and had great local knowledge. Rooms are on the small side, but hey, you can't have everything. They were clean, comfortable and even though I was on the street side I didn't hear any noise. I'll definitely be staying again!", "Date": "August 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hyde Cheshire", "Title": "“Whats behind the brown door?”", "Author": "arizonagcs", "ReviewID": "UR72976595", "Content": "When the taxi driver had difficulty finding the hotel and he drew up in front wooden double doors on the edge of China Town I wondered what I had let myself in for! I dragged my bags up the front steps and into the lift up to the reception and was actually met by a pleasant, helpful staff member who after upgrading the room gave me useful information of how to get around Sydney. It was a bit of a pain to get the luggage into the lift again, up some stairs but once in the room I was surprised how quite it was, clean, had a flat screen tv and a decent bathroom. Like any budget hotel right in the heart of the city don't expect a view, I wasn't intending to stay in my room so that didn't matter. The TV has BBC World News, which although a small consideration, meant I could keep up with an important breaking news story at home. Armed with the staff's information I was able to walk up the street to catch the train to Circular Quay just 2 stops away. The buses also stop on George street. The hotel is in a similar area to a few backpackers hostels but is far superior in its standards. The door is shut at 10pm but a code is given for easy access. Breakfast is not included but there plenty of places to eat including a lovely French style patisserie across the road. Being in China Town, I thought I was still in Hong Kong, there are a variety of ethnic places to eat. For the center of a city it is quiet and easily excessable and reasonably priced.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newark", "Title": "“I guess we had bad luck”", "Author": "mfebles", "ReviewID": "UR72335280", "Content": "We stayed here for 2 nights and IÂ´ll try to leave a fair review. We arrived really early (around 9am) and we could check in (check time was supposed to be at 2pm) so we could have a nap in our room after a long trip. Our problem is that the first night we had a room that was just above a pub... it was a friday night with the World Cup on (from 1am til 7 am in Australia) so were hearing the broadcasting and music the whole night. The next morning we told the guy on the front desk about this problem and he gave us a new room a free internet for 1 day (12$), the problem now was that the new room had old windows and let the cold from outside come into the room and also noise from some building construction that started at 7am. The hotel was clean and had a convenient location, just minutes from Chinatown. Also there is a free shuttle bus stop just meters from the main door, so you can go to the Opera Area for free. Overall the hotel was good but I guess we had bad luck, maybe if we had stay in weekday our experience would have been different.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“'Central To Everything'”", "Author": "Nattnz", "ReviewID": "UR70469374", "Content": "Except for a fire alarm at 5am (false alarm thank goodness), this hotel is central to absolutely everything, like all public transport, a super quick trip to the international airport (by train) awesome place at a budget price. Recommend to everyone and would stay again!", "Date": "July 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent”", "Author": "woowoo75", "ReviewID": "UR67707135", "Content": "I stayed here for 5 nights at the start of June, based on price and reviews on Trip Advisor. I arrived early at 12pm and got an upgrade room and was able to check in. Great start!. The room was a single, and perfect size, comfy bed and really couldn't find fault. I had also requested a quiet room and the one I had was great, 3rd floor and away from the buzz if George St. For the price, its a bargin, great location if you are spending time in the CBD, but easy to get to everything. Apart from 2 fire alarms, both thankfully false alarms, I think this is fantastic place to stay.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California, USA", "Title": "“going above and beyond!”", "Author": "Tolstoy13", "ReviewID": "UR67617626", "Content": "This review is waaaaay late in coming, since it was last November when I stayed there. However I just moved and came across my vacation photos and felt that guilty pang about not getting the good word out sooner. So here goes: I stayed there for a week in Nov 2009, thought the location was great and loved that the hotel was so modern and clean. Booked a double premium and realized that the windows didn't open, only air-conditioning for air circulation. I had checked in and left immediately to meet a friend for \"High Tea\" at the QVB, but mentioned in passing to Ross at reception that I would much prefer to have a room with opening windows, so my allergies won't act up. He was right on it and offered to move me into a different room right there. All said and done, I was in a different room and on the way to meet my friend within 20 minutes. Stayed there for the remainder of the week and had a great experience, checked out Saturday and got on a plane to Melbourne. Here's the kicker: On the plane I realized that I had left a credit card and my green card in the hotel safe in the first room. OMG! Called Ross as soon as I landed. He was incredibly sweet, told me that there wasn't much hope since the room had been occupied since, but that he would go up and look right now. Miracle - my stuff was still there!!! Ross then proceeded to make arrangements to have DHL ship it all to me to my hotel in Melbourne and called and kept me posted of his progress all the way. Then there was a mix-up with delivery (DHL's fault) and Ross was on the phone with them immediately to make sure I got everything back and was able to come home to the US without a problem. Thank you, Ross - you are gem!!! All in all, I will stay there again the next time I'm in Sydney and I hope Ross will one day get to run his own hotel, since he TRULY understands the meaning of the word \"customer service\".", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pulau Penang, Malaysia", "Title": "“3-Minutes from Everything!”", "Author": "leonbec", "ReviewID": "UR65230723", "Content": "Booked a Premium Triple during my recent trip - 3 Adults + a 2yr old toddler. The rooms were superb but it's sad that the amenities are not refreshed on a daily basis. We stayed 3 days 2 nights and on the 1st night, we bought dinner back and made coffee in the room. The next day we were out on our tour and they were not refreshed. Neither were the bath shower gels. We got the rooms on Sussex Street, the only inconvenience were the connection back into George Street was through a small alley and there were stairs in the way which we had to ludge them up / down. Check out times are 10:00am but the Guest Lounge on the 1st floor is extremely convenient - it has all anyoene would need at a reasonable price. Lockers are at AUD5 for a minimum of 3hours, internet kiosks & drink kiosks and free microwave & fridge rentals. There's also a washer & dryer for AUD3 per wash. Coles & Woolworths are down George Street so it's a short distance to walk to get your emergency groceries. Chinatown & Paddy's Market is a corner away and food is so convenient. Baby Thai a restaurant that serves superb Thai cuisine at food court pricing is located right downstairs when you take the lift down Sussex Street, else it's 2 doors away to a nice Vietnamese Restaurant on George Street or the array of chinese restaurants in Chinatown. Charlie Chan's - a local run bar is downstairs if you need a fix of beer. We stayed on the 3rd floor and have no issue putting my girl to sleep - no disturbance from the bar downstairs at all. The Free CBD Shuttle which runs till 3:30pm daily stops right outside the hotel - which takes you to Darling Harbour (Town Hall) and up to Circular Quay.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wellington", "Title": "“Great location and price”", "Author": "Whero", "ReviewID": "UR62280295", "Content": "My 5 year old son and I stayed at this hotel for 4 nights in April 2010. We had booked the smallest room-the petite double-but on arrival we were upgraded to a larger double room at the back of the hotel for no extra charge. The hotel is a rambly renovated older style building. There was plenty of natural light in our room, it was tastefully decorated without feeling 'hotel like' & impersonal, and clean & fresh. There was a lounge on the first level with a kitchen, internet kiosks and laundry. The room was double glazed but my only gripe was that there was a large light well outside our room that opened out onto the ground level to a bar & arcade. At night the noise from the bar echoed up to our room and as the week went on became louder and louder. ... The hotel was however well located-just by China Town & the Markets-and Central Station was about a 10 minute walk away with the World Square just across the road with a Coles Supermarket. We liked the French Bakery just up the road from the hotel, and there is a small Spanish Quarter one block away so there were plenty of food options. The staff were helpful and friendly to us both and I thought the hotel was good value for money. My 5 year old liked it too as there were plenty of staircases to explore. Yes we would stay there again if we are ever in Sydney and we would probably give the Pensione Hotel in Melbourne a try too.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Alfred, South Africa", "Title": "“Exceeded my expectations!”", "Author": "cometocapetown", "ReviewID": "UR60806756", "Content": "Did not expect much after reading reviews, but I have to say that my stay was fantastic! For the small price I payed I got a modern, clean room with a awesome en-suite bathroom. I stayed in a standard double room. Although the room were small, it had all the basic amenities, fridge, kettle, etc. Would recommend this hotel for someone looking for GREAT value for money. Right in the middle of China Town, 20 minutes walking from the Sydney Opera House.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“value and location”", "Author": "chooMelbourne", "ReviewID": "UR60514369", "Content": "excellent value for top city location...close to everything and nicely funished rooms. bathrooms are excellent..quaint building with a cool heritage elevator in the front...its not the taj mahal but good for the price", "Date": "April 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Would not recommend”", "Author": "sophiekf", "ReviewID": "UR60281445", "Content": "After knowing what good value it's sister hotel the Pensione Melbourne is, I was looking forward to staying here in Sydney. However, when we arrived we were immediately disappointed. The reception and entrance area was quite depressing and the lift was broken, when meant lugging our luggage up flights of stairs. The receptionist was unwelcoming and cold. After being accidentally given the wrong room, we then went to our correct room, which was dingy and a bit uncomfortable. The TV was on the wall in an odd position, which made it hard to watch. The bathrooms however were more modern and felt clean, which was good. The location is also fairly convenient as it's near Central Station and plenty of public transport. You can also walk to many places from here. However it is quite noisy at nighttime - there are definitely nicer areas to stay in. Overall, I would not recommend this hotel, especially for what we paid. This place definitely needs a big renovation and friendlier service.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hobart, Australia", "Title": "“Great budget hotel in good location for restaurants”", "Author": "HumbleGourmet", "ReviewID": "UR58859792", "Content": "If you choose this hotel knowing that budget prices mean smaller cosy rooms and basic fittings, then you are onto a winner. The basics were all there such as a comfortable bed with good sheets and an adequate bathroom. The excellent aspects are the price and where its located on the edge of Chinatown with restaurants everywhere. Darling Harbour is nearby too and you are have great access to public transport - eg: buses at the front door, World Square station for monorail. Restaurant Tip: Round the corner in Goulburn St is \"Mamak\" for authentic super fast Malaysian food and rated as one of the best \"cheap eats\" in Sydney - a real gourmet experience - 3 big courses and drinks for $25 each! Their ayam goreng is fried chicken a bit like KFC (!) but transformed into something truly wonderful! We had to queue for 10mins but thats because everyone knows this is THE place to be! Try the desserts even though they sound strange (red beans and flavoured ice topped by creamed corn?!?).", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alberta", "Title": "“A clean hotel in a fantastic location contained in an amazing building.”", "Author": "CurtisMan", "ReviewID": "UR58638636", "Content": "Everything was perfectly clean. The front desk staff were very friendly and willing to answer any questions. They ensured I was comfortable for my stay and offered any assistance required. The cleaning staff were always smiling and greeting me. The building is amazing. Not only in a great location but the building itself is historical which means the hallways were on different levels and there are twists and turns everywhere - this gives the hotel some really great character. Although it is historical, the hotel was re-modeled so everything is new and fresh and clean.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great Location, suitable for Budget traveller”", "Author": "AmatureTravelFreak", "ReviewID": "UR58515452", "Content": "We stayed at Pensione Sydney in December 2009. Since we stayed at Pensione Melbourne before goiong to Sydeny, we kinda know what to expect of the hotel. You can't expect much space in a city hotel especially if it is conveniently located like this one. The room was small but enough to get by. In fact, the bathroom was bigger compared to what we got used to in Melbourne. Overall, the experience was good especially with the location.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great location but tired hotel”", "Author": "WorldTravellers021", "ReviewID": "UR57607901", "Content": "We stayed 2 nights and on entering Reception we felt quite depressed. The hotel needed a good lick of paint and updating. It got worse when we reached our room which was supposed to be a deluxe petit double. Petit it certainly was with no room either side of bed for even a small chest of drawers, therefore having to get out of bed to switch off the alarm! There was no wardrobe and about 5 hooks on the wall for hanging your clothes. These were fixed with just one screw so bewareas they will collapse with even a light coat. As for being DELUXE it was really basic looking with just a chest of drawers, bed and TV on wall, with the addition of a useful fridge. Shower room was good size and excellent power shower. On the plus side room was very clean and comfortable bed. One redeeming thing is the location and also the Guest Lobby/Lounge which provides luggage lockers, kettle, fridge, microwave and internet. This was extremely useful after checking out at 10.00 and waiting to leave some time in the afternoon. We were only there for 2 nights otherwise we might have challenged the DELUXE room as we wondered if we had been put in the wrong room!! We previously stayed at The Mecure just a few blocks away. Next time we will go back there.", "Date": "March 3, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "australia", "Title": "“too small and too expensive for what it is”", "Author": "djallen0", "ReviewID": "UR50581580", "Content": "no where to put anything in bathroom, room extremely small, room near reception very noisy at night, staff not very friendly.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“amazing service, rooms and location!”", "Author": "jackkkkk", "ReviewID": "UR49101230", "Content": "I headed into the city for a friends birthday and wanted somewhere close and well priced. We were all very pleased with the Pensione. Right out the front of the hotel is a busstop allowing us to catch the FREE CBD shuttle bus up to the harbour. The hotel was right around the corner from some amazing chinese restaurants, and everything we needed was within walking distance. We had a few premium rooms, and they were amazing. Very clean and beds were very comfy. I cant understand how some people can think this is a backpackers hostel? Its definately a boutique hotel. As far as noise, its SYDNEY! what could you expect on a friday night? The staff at the front desk were always friendly, and were more than happy to arrange taxis and give suggestions for things to do. All in all, it was an amazing experience, and we will DEFINATELY be staying here on the next birthday.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Clean but small”", "Author": "petals526", "ReviewID": "UR49014165", "Content": "Loved the location, has the free Green city bus stopping outside the hotel. Room was small but who cares when you can walk barefoot on the carpet and lay on the fluffy white bed without being grossed out, we were on the 3rd Floor and I believe that they have been renovated. Great hotel price on the internet, so so worth it...", "Date": "November 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great service EXCELLENT location!!”", "Author": "Lizzery", "ReviewID": "UR48885586", "Content": "I've stayed at the Pensione many times and I am pretty shocked at all these reviews. The hotel is in a perfect location right in the center of Sydney. And you'd have to be kidding yourself if you didn't expect a little noise when staying in the countries busiest cities. Although I had no problems from the bar below I have had friends travel with me and there has been some noise. But after bringing it up the the desk staff they were moved to a much quieter room. It is not a backpacker hostel. I have stayed in many all around the world and in no way what so ever does it resemble a hostel. Its exactly what they call it the cheapest boutique hotel in Sydney. Some of the rooms can be on the smaller side but it has never bothered me as I am only ever in the room to get some sleep after big day sightseeing. The staff are wonderful, all know the area very well and always more than happy to answer the hundreds of questions I throw at them. I would definitely recommend this hotel to my friends.", "Date": "November 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "melbourne", "Title": "“Backpacker Hostel NOT Boutique Hotel”", "Author": "Supercalafragalistic", "ReviewID": "UR47939019", "Content": "It wasn't the pokiness of the room that astonished me - i was expecting it to be small given I booked a single room. My issues were with pretty much EVERYTHING else. I paid $166 for the one night expecting a small quaint Boutique hotel. What i got was a backpacker style accommodation. I have no problem with backpacker accommodation when that is what i pay for but at those rates a higher quality must be expected. The reception was nothing special/ on the verge of rude, there was no space to unpack so all my clothes ended up being spread on the dirty carpet and my toiletries on the floor of the bathroom. However, the worst part was that i didn't sleep a wink all night. The curtain in the room was too short and so the city lights shine in at night then at day break the sun streams in RIGHT into your eyes as the bed is situated underneath this curtain. The bed was also uncomfortably small (width and length - and i'm not a big/ tall person by any measure). There was no complaint for in the room or at reception so it's not like they are interested in receiving feedback on the crap-ness of the \"hotel\". I've stayed in some dodgy accommodation before but this one was truly bad. Do not stay here.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Great place!”", "Author": "Da-bosman", "ReviewID": "UR47738418", "Content": "Great location and very helpfull staff. Little noisy but that can be expected when you are right on the main road (george street). Easy access to anywhere in Sydney from here.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hunter", "Title": "“Clean, comfortable & perfect location!!”", "Author": "Emmyjanine", "ReviewID": "UR46703826", "Content": "My boyfriend & I recently stayed at this hotel, and i must say the location was great!! So close to everything and very central. Although the room was quite small, (we had a deluxe double, so i would hate to think how small the petite room was) however it was very clean & tidy and the decor was modern & funky! My only negative aspects would be that it is a little noisy of an evening and cigarette smoke seemed to drift into the bathroom, both coming (i assume) from the downstairs bar. We took advantage of an accommodation voucher so the rate was very well priced and great value for money! I would stay again", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brisbane", "Title": "“Excellent Location”", "Author": "Grahamanz", "ReviewID": "UR41193194", "Content": "We had booked this hotel based purely on location from a map and the description. And the price seemed reasonable. Then as I researched further I came across the reviews of the hotel and also photos. Some reviews were so bad we approached our stay with some trepidation. Sure the outside appearance and entry were a little offputting and our first experience of the lift was a little scary. However when we learnt how to operate it with our security card there was no problem. The room although small was spotless and the ensuite roomy and clean. There was a small frig and wardrobe and large security safe and also tea/coffee making facilities. The room was serviced daily. I had read about the noise but to be honest we never found that. We were one room back from the busy George St and the most noise we experienced was that of doors closing, partly because of the strong automatic closures. There was a roomy guest lounge with internet facilities(which I never used) and also a variety of lockers. Others had criticised the cost but it was not a problem to us and we found it very convenient to store our belongings between checkout and final departure. By far the greatest attraction to us was the location. We depended entirely on public transport and with a bus stop right outside the door and maximum waiting time for a bus about a minute was fantastic. There is a free CBD bus approx every ten minutes. We bought a seniors pass every day for 2.50 and that gave us unlimited transport all day on buses, trains and ferries. Would we go back, yes I think we would however the peak room rates would be too much and we would have to pick the season. Altogether we found the many negative reviews unreasonable and came awy feeling pretty happy", "Date": "September 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "melbourne", "Title": "“Beware - no sleep ahead!!!”", "Author": "xumbah", "ReviewID": "UR34083513", "Content": "IF you want a quiet, relaxing and intimate time with your partner DO NOT chose this hotel. Located above a dingy bar with irritating customers and plums of cigarette smoke (which seeps into your room), the pensione should be avoided.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Bangkok", "Title": "“Beware the rooms at the back...you will get no sleep at all”", "Author": "Thaiowl", "ReviewID": "UR33436294", "Content": "We booked for one night for a stopover in Sydney on the way back to Bangkok. The choice was to stay near the aiport or stay in town. We chose the latter and regretted it. We had two rooms costing AUD350. For less than that we had previously stayed in a 2-bedoomed appt at the Medina Executive in George Street, which was very good and I would recommend it. The rooms at the Pensione are indeed small, but everything worked so we couldn't complain. However, our room (218) was at the back of the building and overlooked the very noisy (and evidently smoky) bar which kept us up until 4:30am. The room is meant to be non-smoking but it stinks of smoke as the smoke from the bar finds its way into the room. There is double glazing in the bedroom but it is pretty useless at keeping out the noise. My kids stayed in another (internal) room and had a good night's sleep. I'm glad we didn't have to endure another night in room 218 or we would have been ill from sleep deprivation. Avoid this room at all costs. If you have a family, go to the Medina Executive.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Queensland", "Title": "“Location, location, location.”", "Author": "cupcaketraveller", "ReviewID": "UR29304010", "Content": "Just got back from a weekend in Sydney for leisure and had a wonderful stay at Pensione. Staff were helpful, location is fantastic and hotel is clean and comfortable at a budget traveller price. I would recommend going for their deluxe option and asking for an internal room if possible as it's a noisy part of town. As long as you're realistic in your expectations - you're staying in a busy and noisy part of Sydney at a hotel that clearly markets itself to budget travellers - you'll have a great time at Pensione.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Whakatane, New Zealand", "Title": "“Location to suit”", "Author": "fwharry", "ReviewID": "UR27678536", "Content": "Went to Sydney to see the sights, catch up with friends and family and of course shopping. Booked Pensione prior to arriving and emailed concierge re early arrivals and late departures. Was told all information I needed to know about our stay. Found the room clean and tidy, not noisy at all considering the construction going on across the road. Overall our stay was great. Location was fantastic as we explored all the eateries nearby - what hidden treasures there are near the hotel - as well as being really central to all our needs. Perfect for a couple or like myself (mum & daughter) who like to explore. Shared amentites were always clean and when asked the reception staff were helpful.", "Date": "April 8, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Rooms": "1", "Value": "2", "Location": "5"}, "AuthorLocation": "KL", "Title": "“over rated”", "Author": "KT785", "ReviewID": "UR26963852", "Content": "I stayed 25-26 March in a single room. The location was great, on George street, beside Chinatown. The single room was REALLY small and was just the same size as the attached bathroom. When I lay down in the bed, the curtain was literally over my head over my head,(see photo) so much so that I moved the bed nearer the door. The real peeve beyond that? You have to leave your luggage in lockers which cost A$3-7 (I always manage to check out, leave the bags with reception/concierge before continuing sightseeing and I leave the location - couldn't so this here), and you don't even get a kettle/coffee/tea making utenils in your room. Trying to ask anything at the reception is a bummer as there always seems to be a bunch of people waiting ahead of you - I tried 5 times and gave up 3 of these. I looked at the double rooms, but even these were just so-so, and quite small. Not quite what I expect of a boutique hotel. They say there is a fitness centre available \"near\" the hotel (Fitness First downtown), but is 1 km away on foot either way - great to jog to in good weather, but a bummer in rain!", "Date": "March 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“Good location but rather deceptive advertising”", "Author": "splatcat78", "ReviewID": "UR26899303", "Content": "Unfortunately our stay here didn't get off to a good start, to begin with we had to wait for a taxi at the airport of over an hour and a half and didn't arrive at the hotel until nearly midnight. We were greeted by the clerk who proceeded to gives us our keys and inform us that we'd been 'upgraded from our deluxe double room to a deluxe triple room' - not really the upgrade I'd been hoping for considering there were only two of us - not five. The room was extremely disapointing in that this 'funky boutique hotel', as quoted by Hotelclub was not a hotel at all but merely a glorified backpackers hostel. Our room was located right next to the outdoor area i.e. smokers area, and communal facilities. The actual bed and bathroom was clean enough but the carpet fo the room was filthy and adjacent to our double bed we had a triple bunk! When we queried this false advertising of it being a 'hotel' with the girl at reception the next morning and requested that we be at least moved to a room that wouldn't experience so many disruptions, we were told that they were fully booked and coudln't accomodate our request, not very helpful at all. I would recommend this place for the location and for a 'basic, budget style accommodation', but not for a boutique hotel experience!", "Date": "March 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "brisbane", "Title": "“Nice little hotel in excellent location- great value for money”", "Author": "emld1984", "ReviewID": "UR26639828", "Content": "Stumbled on this hotel after trying to find an affordable place to stay in Sydney for a few nights. We were able to get a room for $99/ night (free upgrade to superior room when we arrived). Found the booking system to be very hassle free, I've had some bad experiences with hotel reservations in the past so it was a nice change to not have to pay a deposit over the internet etc. The rooms are small, but clean- functional and practical but maybe not for you if you need lots of room or luxurious surrounds. I found the staff to be polite, but not too chatty. By far the best thing about this hotel is the location- very easy access to all the excellent attractions Sydney has to offer (easy walk to Chinatown/ Darling Harbour/ City- free bus right outside if you don't want to walk. Also- the hotel is only a 2 minute walk away from the best food court I've ever seen ($5.80 for dinner!). All in all my stay was hassle- free, perfect for me as I've been to Sydney many times before and was just looking for somewhere I could stay on a budget. Maybe the hotel wouldn't be suitable if you're looking for something more upmarket, but if you want somewhere clean, convenient and safe I would definitely recommend this hotel. I will stay here again.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Christchurch", "Title": "“Pleasant stay in a nice area of the city”", "Author": "panzr", "ReviewID": "UR26426246", "Content": "Stayed here for 3 nights with my 11 year old son in March '09 The room was small but everything was clean and tidy. It's very handy to China Town and the fantastic Market is around the corner, with Darling harbour not too far but Circular Quay is far to walk although buses are aplenty Being on the main street, traffic is a bit noisy although I expected this and had ear plugs prepared. During our stay there was a major highrise being built directly across the street which woke us early in the morning, no big deal though Despite being out seeing the sights most of the time and only using the hotel as a place to sleep, our stay was pleasant, especially as we were in such a fantastic city...Sydney really is a wonderful place to visit Staff were pleasant and the room attendants were very polite Although, I must say the TV in the room was uncomfortable to watch as it was perched directly above the beds, oh and the windows really need a clean on the outside", "Date": "March 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Sydney", "Title": "“Worst service in Sydney if not Australia”", "Author": "B184", "ReviewID": "UR25608931", "Content": "I had no expectations for my stay at the Pension. I only wanted a clean room and somewhere to sleep but from the minute I walked in the door I knew I had made a mistake booking my accommodation there. When you walk in the front door there is a dirty old lift or a dirty stircase. At reception we were greeted with \"What do you want?\" throughout the check in process the lady on duty did not smile, make eye contact or even attempt to make small talk. I asked if we could pay on check out which she said was fine but she needed to sight my credit card and then proceeded to swip my credit card and do a preauthorisation without any explaination (so basically she held funds on my credit card for 5 working day which is something that should be explained) We then to the room where we found a king spit bed and bunk beds. The bunk beds we had to make ourselves with the dirty blankets that were left on the bed and we were disappointed becuase I had requested 4 single beds and was told there would be no way to do that when infact they only had to pull apart the king bed to make 2 singles I mean thats what a king split is design for. After an evening out we came back to the room about 3am wanting to go to sleep, unfortuently none of us got any sleep that night. There is a bar downstairs that plays loud music and you can hear the people talking like they are sitting outside your door. After 3 calls to the night manager nothing was done about the noise. The music didnt stop until 5.30am and by that time we were all so annoyed that we couldnt sleep. The only nice thing about our stay was that the gentleman on reception the next was very polite and he did give us a reduction on our room rate but my friends and I would have much prefered a good night sleep", "Date": "March 4, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "singapore", "Title": "“Clean, Central and Simple”", "Author": "stray1001", "ReviewID": "UR24783321", "Content": "The Pensione is what it claims to be -- clean, simple rooms in a historic building in the centre of town. I found it less than noisy than I expected (even though my room overlooked George Street). It was fully booked when I was there so I did not have much choice of room, but I slept well nonetheless. If space or luxury is a priority, then this is probably not the right hotel. Otherwise it was definitely good value and well located.", "Date": "February 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dunedin, New Zealand", "Title": "“Nice hotel in good location”", "Author": "otagotraveller", "ReviewID": "UR24359290", "Content": "Have stayed here twice, and would have stayed a third time had it not been booked out on that occasion. It's a great location, a character building that's been nicely refurbished. Everything was clean and in order, and most of the staff friendly. I think the trick is to see if you can get a room facing into the light-well in the middle of the building, rather than onto the street. The interior rooms are quiet. I probably wouldn't want one on George St though. We really liked the shared lounge area, with a kitchen and internet - seemed a useful thing to have if you had a smallish room. We spent a bit of time hanging out in the communal space. The Pensione is on a main bus route, and really close to Central Station, which is very handy.", "Date": "February 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Galway, Ireland", "Title": "“Okay Hotel”", "Author": "agalwaygirl", "ReviewID": "UR23313378", "Content": "Our stay here was for 8 nights in the deluxe room. To be honest I felt the photos and description of this hotel led me to believe that this place was nicer than it actually was. It was cheap and cheerful. Room was okay, very clean and spacious, although it did have an interior window that seemed to look out onto an empty hall space which I found very disconcerting and did not like as there was no natural light at all. When we enquired at reception about possibly changing rooms, unfortunately there were none available. Location was good, quiet central. Staff were pleasant but not friendly. To be honest, we found ourselves finding excuses not to go back to the hotel early as the room was quite depressing. We also came back one night to find a drunk fast asleep in the front hall downstairs, that we had to step over him to access the hotel, not a nice experience. We will not be staying here again, I felt it was barely above a hostel. I felt it was advertised wrongly as a boutique hotel, leading me to believe it was better than reality.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "adelaide", "Title": "“quaint and pleasant”", "Author": "prajnaparamita", "ReviewID": "UR21955909", "Content": "This is a quaint and pleasant hotel. Ten minutes walk to the Central Railway station where you can catch the train to the airport. Just around the corner is China Town & it is easy walking distance from Darling Harbour and the Queen Victoria Building. I had a quiet room at the back. The room was clean with modern decor. The bathroom was great. The airconditioner worked well and was quiet. The only drawback was that my room looked into other rooms opposite, which meant there was no privacy unless you shut the curtains, but it didn't really bother me. A good hotel (though it would pay to ask for a quiet room as those at the front overlook busy and noisy George Street.)", "Date": "November 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cambridge, UK", "Title": "“Not what it says on the tin”", "Author": "Midget_Gems", "ReviewID": "UR21097802", "Content": "This was a clean and compact hotel centrally located on George Street. My single room can only be described as a broom cupboard..it was small, hard no wardrobe or anywhere to put my clothes so asked for a portable wardrobe that was provided but only just fit in the room. The redeeming feature of the room was the bathroom which was almost as big as the room but was obviously recently re-fitted. My main issue with this hotel was really who it is marketed to. From the website it gives the impression that this is a more slightly more sophisicated boutique hotel but really it is only one step up from a youth hostel and consequently as we found out has the same clientele. It was very loud not only from the other guests staying there but also due to the construction site right next door that started using an angle grinder as 6am. We complained straight away but were told it was not their problem and that if we were to move from the hotel we would have to pay a nights accomodation to cancel. They did however find rooms for all of my party on the opposite side of the hotel to the building site. For myself, it is not somewhere the I will rush to stay at again but if you are looking for somewhere cheap to stay thats clean and you don't mind the the noise then this is the place for you.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Japan", "Title": "“Good location, clean”", "Author": "kapibarasan", "ReviewID": "UR20908202", "Content": "I spent 3 nights at this hotel, I chose it mainly for its location, in Chinatown, very good to explore the city, either walking or by public transportation. I was not disappointed by the location, and I also found that it was very clean indeed, as I had previously read on other reviews here. Good location and clean room are the 2 most important things to me, and this hotel did not disappoint me. The room was very small as I had also read on another guidebook, but I planned on staying almost the whole day out of the room, exploring the city, so I didn't care about that. It can be very noisy at any time of the day or the night, both because of the cleaning people and (mainly) because of people who have no respect of the others. Wireless internet was expensive, however the area is full of internet cafe's. Overall a good experience to me, would choose it again.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Charlotte, NC USA", "Title": "“A great location and very clean, but LOUD!”", "Author": "jen99va80", "ReviewID": "UR19811359", "Content": "The Pensione is at great location on George Street. Buses right outside go to Circle Quay every few minutes and its a short walk to Darling Harbour. The rooms are clean and there is GREAT shower pressure. A good option for a group of 3-- we booked a triple and had a bunk bed and a double... it was really nice not to have to share. The elevator (\"lift\") was in working condition and the steps from the top (4th) floor were a great option in a hurry with no luggage. The only downside was loud George Street especially on Saturday night-- bring some earplugs and/ or ask for an inside room.", "Date": "September 5, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Kerry", "Title": "“nightmare!!!!!!!”", "Author": "KerryDurango", "ReviewID": "UR18613879", "Content": "Worst hotel i ever stayed in. \"Boutique hotel\" how are you? It was my worst nightmare of a hotel. From the entrance i knew i had been caught out by web site. Nothing on ground floor only grotty entrance grotty lift and grotty staircase! Reception on 2nd floor. Wow!! Before checking in i even asked could i see the room. Girl showed it to me. Was not impressed with it but after 9 hour flight needed a lie down. Certainly not up to standards! We even washed bathroom floor ourselves! It was filty! Booked trip room - got double bed and bunks - didnt know hotels had bunks. No tea or coffee making facilities. Common kitchen area on 1st floor. Tea towels filthy. No way could one use it. Internet use $2 for 20 min (next door $2 for 1 HOUR. Laurdrette - $3 wash $3 washing powder and $3 dry. Costly! Met up with friends outside hotel and was ashamed to say that i was even staying there. They are local in sydney and could not believe it. I would not even recommend it to bagpackers! Stay well clear if you have any sense!!!", "Date": "August 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Clean, great location, home like”", "Author": "Milonotovaltine", "ReviewID": "UR18274873", "Content": "After reading some reviews posted here, I guess I was allocated a quiet spot. The room was odor free and quiet. I rested peacefully. What I like best about this hotel is that their bed linens and towels smell fresh, the shampoo is very good, and clean room. What is slightly disappointing is that amenities were not replaced/replenished. Internet access is only available in the guest lounge, which closes at 10 pm, cold, smells of food. The internet speed is quite slow when there are several people using it. Overall, I am satisfied with my stay and will not hesitate to book again. Although I believe the rate is overpriced.", "Date": "July 26, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Not a hotel”", "Author": "SharonCapeTown", "ReviewID": "UR18225653", "Content": "This hotel is misrepresented as a boutique hotel. It is definitly a hostel. Within 2 hours of checking in I check out, after managing to find a room at the Ibis at Darling Harbour. As I have pre-paid through Hotelclub.net, I quite readily forfeited this as 3 nights would have been unbearable! Don't stay there.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "fishie82", "Title": "“Like trying to go to sleep in the bar of my local pub...”", "Author": "fishie82", "ReviewID": "UR17264377", "Content": "The \"Delux\" room was tiny, the bathroom was just clean enough. There was a distinct smell of cigarettes in the room (non-smoking hotel). When going to bed, the bed had only one thin blanket on it and the heater did not work. After several attempts to get through to reception to request more bankets, was told I could come down and get them or wait half an hour for her to bring them up. Then spent the next few hours lying in bed, listening to the coversations and crashes and noises from pokies coming from the bar downstairs. The cigarette smell got worse as people who smoked had to go to a little spot underneath our window to do so! The bar closed at 3:00 am. A very sleepless night and when we checked out, the new receptionist was not at all interested in our comments on the room. Not happy Jan! Will not go back for seconds.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cologne, Germany", "Title": "“comfortable and safe with good rate”", "Author": "socaltransplant", "ReviewID": "UR16768001", "Content": "The room i shared with a friend had a bunk bed and a full size bed. It was more like an upscale hostel than a real hotel, but it was perfect for what we needed - a somewhat central location to stop in and shower, change and sleep between visiting all that Sydney has to offer. The staff was friendly, rooms clean, and fellow travelers fairly respectful when it came to noise. its a younger clientele, but that's to be expected for the price. I would recommend and stay again.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "nyc", "Title": "“Under-whelming”", "Author": "dallhiss", "ReviewID": "UR16695758", "Content": "I found a disparity between the hotel's exaggerated marketing descriptions ('grandeur,' 'style,' and 'unique') and the actual experience. Yes, the hotel is conveniently located in the CBD/Chinatown area; however, it is also located on a busy, noisy eyesore of a block. My 'deluxe' double was plain, cramped and noisy (from both the street and the stairwell); and with an extended weekend rate of AUD143, not a particularly good value for money.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lutterworth, United Kingdom", "Title": "“Good Hotel”", "Author": "lome1984", "ReviewID": "UR15642839", "Content": "This is a fairly large hotel on George Street, on the edge of China town. It has 3 floors and is over Charlie Chan's bar & restaurant. It has a 24 hour reception and I found the staff helpful. It's a good location with easy bus access to the Harbour and Bondi and it's close to the monorail and Central Railway Station. Only thing I didn't like was when one of the kids got chocolate on the sheets and they weren't changed.", "Date": "May 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Brisbane Australia", "Title": "“\"Misleading Description \"- I agree”", "Author": "Megan08", "ReviewID": "UR14946885", "Content": "I agree wholeheartedly with the review \"Misleading Description\" Jan 16, 08. I am only sorry I didn't read it before I booked. I asked for a quiet room - what a joke - it was on George Street, the windows were not double glazed, and the street noise was so loud I had to have the volume on the TV almost at the maximum to be able to hear it. I could not sleep, even with earplugs. Below is an irish pub surrounded by 'adult shops'. The building's interior was extremely shabby, with chipped paint, no bedside table or lamp, old worn carpet. I had to pay to have my luggage kept while waiting for my room to be ready. I imagine that Backpacker hostels have better facilities - I would never recommend it to anyone.", "Date": "April 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“An expensive backpackers not a boutique hotel”", "Author": "Kate070", "ReviewID": "UR13799389", "Content": "This is not a boutique hotel, but a good backpackers. The 'deluxe' room for a $185 is laughable, the only reason we didn't walk out is that there was literally no other accommodation available. The problems were (i) rooms smelt, (ii) windows fithly, (iii) cigarette burns in bedspread, (iv) fan in bathroom didn't work, (v) apart from soap no tolietries provided (vi) the room's layout extremely awkward with cheap ottomans, furniture and TV set and worst of all the noise from George St. horrific, especially with the window open if you want fresh air. Although, the staff were friendly.", "Date": "February 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "melbourne", "Title": "“absolutely hated this place...”", "Author": "emah", "ReviewID": "UR13796082", "Content": "This is a really grotty place to stay; we decided on it because its website positions the hotel as a \"boutique\" hotel, which we understand to mean small, intimate, with a degree of luxury. Instead, its basically a former hostel that has been turned into a hotel. The first indication of this is that you have to PAY for lockers to store your bags if you arrive before check in; I have never heard of such a thing in all the many places I have travelled before. and those lockers are not cheap either! We paid $185 for a room which we thought was a good price point for a boutique; in return for that we got a tiny box of a room that was completely barren of comfort. dingy paint work, a rattly old window that allowed all of the noise of george street to penetrate. there is no bedside lamp so you have to turn the light off at the door and then stumble in the dark to your bed (bring a torch!). the bathroom was also tiny, with scratchy towels and no toiletries other than a piece of soap. there was one glass shelf next to the tiny sink, but it was on an angle so anything you put on it rolled off and fell on the tiled floor. seriously ick!! bad lighting, a TV that did not work, and no desk finished the furnishings. the lifts are extremely slow so that usually the stairs are the best option. we immediately tried to find another place to stay but Sydney seemed to be completely booked out for this saturday night so we were stuck. i used earplugs to keep the noise out, but woke up at 5.30am with a headache from the roar. we ended up checking out at 7am and heading home to Melbourne early because a nice-lie in was clearly not on the cards. I can not believe that it is possible to charge $185 a night for such appalling accommodation!!! I would not recommend this to anyone; if you are on a budget then go stay at the YHA where you can get your own room for a 1/3 of that price; if you are actually looking for a decent hotel, look elsewhere.", "Date": "February 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Tiny rooms, good location”", "Author": "kaldal", "ReviewID": "UR13722373", "Content": "Payed through the nose to stay here over New Year's. The hotel is very well located, the rooms are nice and comfy, but extremely small, even the deluxe we had (only difference is a few amenities). Staff was ordinary (helpful enough), and we were bothered with a loud alarm going off three times (\"the stupid elevator\", according to one receptionist).", "Date": "February 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Misleading description”", "Author": "EL_SG", "ReviewID": "UR12671123", "Content": "Boutique hotel is an overly generous term for this place. A more apt description would be glorified backpackers hostel. My family booked 2 doubles after being informed that the quad room was not available. On our arrival, we were told we were upgraded to a deluxe room FOC for one of our rooms which we found was large enough to sleep 4! The price difference was rather significant and we were understandably upset cos we were told it was not available on booking. The receptionist at night, who was of asian origin, was very very unhelpful and rude about it. She raised her voice and said there was nothing that can be done about it and rudely instructed us to speak to the manager who will only be in the next morning. All the while, she just sounded very frustrated and kept raising her voice. It was as if she was the customer who was let down in the first place!! She just kept repeating the same answer and refuse to help us clarify our doubts, instead, just pushed everything to the morning. Breakfast offered is a joke. It's charged at AUD$8 or so and consists of a box of dry rations with cornflakes, muesli, a packet of milk etc. A poor backpacker who booked the breakfast option was stunned when handed 3 packs for his 3 day stay and when asked if he was meant to eat in the room, the receptionist just replied (loudly), \"we do not have a cafeteria\" belligerently. That said, the receptionist in the morning, a young asian girl, was utterly sweet, helpful and nice. She was far more professional and although had many people to handle, was unfailingly polite and helpful. Rooms wise, there was no closet for the standard room. Neither is there a fridge, tea/coffee making facilities. There was no window as well. Carpets were threadbare and room was plain with no decorations. Room was also so small that there was literally no space to put my luggage. The 'upgraded' room had pipes (the relatively big ones) running through them in the room. The only thing that can be classified as a boutique hotel is the bathroom which was nicely decorated with good water pressure. I have honestly stayed in far better hostels in Sydney before and have a word for people who are attracted to the less than accurate photos on their website. Book at your own risk!", "Date": "January 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geelong", "Title": "“Great place in a great location”", "Author": "atta79", "ReviewID": "UR12422322", "Content": "Nice interior, clean rooms, friendly staff, perfect location (very close to Darling Harbour). Best city-hotel in this price category I've stayed at.", "Date": "January 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The good and bad of the Pensione”", "Author": "Forwardplanner", "ReviewID": "UR11565410", "Content": "My partner and my friends recently stayed in 2 Deluxe rooms at the Pensione. On reading the reviews I was a bit nervous and brought this to the attention of the reception staff on arrival. He attempted to move us both but unfortunately could only move one room so I am fairly qualified to compare the two. Firstly, the reviews are right. The rooms along George Street are noisy 24/7 so make sure you ask in advance for one that is not along that side of the building! In saying that, my friends were moved the next day as soon as another room became available. The staff member was excellent. I travel to Sydney very often for work and stay in 5 star hotels. The cost per night of these range between $300 and $400 per night (corporate rate) and with the Pensione costing $120 per night it's important to keep that in perspective. The Good Things 1. The cost - $120 per night for a deluxe room in Sydney is pretty good 2. The location is very good for getting around. Buses, trains and light rail all on your doorstep 3. It has a guest kitchen and laundry (good for longer stays) 4. The tea, coffee and guest soaps were good quality (not the dodgy cheap hotel stuff) 5. The room was modern, clean and air conditioned (Daiken - which is very quiet) The Bad Things 1. If you are in a room on George Street, it is very noisy 2. If you are hoping to see the Sydney icons from your bedroom window, you will be disappointed 3. The rooms are VERY small. They were fine for us as we travel light, but those who travel with massive suitcases will find it very tight 4. The TV is too high and you can't watch it without getting a sore neck Conclusion If you are a first time visitor to Sydney and have visions of seeing the opera house, harbour bridge and bondi beach from your hotel (or nearby) this is NOT the place for you. This end of Sydney is NOT what you see in the tourist brochures. Spend the extra money and stay closer to Circular Quay. However, If you are happy to use the transport system, want a good, private room for a good price then consider the Pensione. If I was travelling to Sydney for a holiday I would consider staying there again. I would definitely be asking for a room away from George Street though!", "Date": "December 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chester UK", "Title": "“Read Before You Book !”", "Author": "Oskar07", "ReviewID": "UR11254925", "Content": "The web-site for this 'boutique hotel' in Sydney looked inviting so my husband and I booked two nights. Take this advice....It has seriously deteriorated since last reviews posted as we found it (Room 210) to be no more than a back-packers doss house. Stained, threadbare carpet; grubby walls; dirty light-switch plates; no headboards or bed-side lights; thin pillows with no innner covers; filthy dirty TV screen; half-defrosted fridge; filthy windows overlooking extremely noisy George St.;( this Haymarket end of George St. is very grubby and seedy) rubbish, dust and torn lining under the beds; cracked glass in wall pictures; had to pay for lockers to leave our luggage. We took photographs, checked out first thing next morning ( they reluctantly refunded one night's payment) and moved to the Philip St. Travelodge which was ten times better and about the same price. I am going to report The Pensione to the Australian Tourist Board as it should carry a health warning! In fact we mentioned it to the Visitor Information in The Rocks ..... they had had similar complaints so had removed it from their lists.You have been warned!!", "Date": "December 5, 2007"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "oliveanne", "Title": "“Skip it (unless you're a backpacker)”", "Author": "oliveanne", "ReviewID": "UR11128332", "Content": "I wish we would have listened to the other reviews but we thought we could tough it out. Only stayed for 1 night (which was always the plan) and we were glad we didn't book for any longer. Starting at the begining- the receptionist was anything but welcoming and friendly. It was a total bother that our presence meant she had to do her job (I think she had been reading or filing her nails or something unimportant). The room was ok, it was small but that's really not a problem. It's truly no frills (no extra blanket or pillow). The biggest annoyance was the bathroom sink, which (i kid you not) was about 4\"x6\". Brushing teeth became an aquatic activity. It really is a nicely (although sparsely) furnished backpacker hotel. So unless you're 18 and hiking your way through Oz, I'd skip this one. Although, I will say the location is good- right on the bus line and walking distance to many areas.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Amsterdam", "Title": "“Noise”", "Author": "Mysa1962", "ReviewID": "UR10579956", "Content": "Stayed for two nights at the Pensione Hotel, George Street Sydney. Had a room at the front (Georgestreet). Couldn't sleep because of the trafficnoise at night. Traffic goes 24/7. Slept second night slightly better because of the earplugs i had bought. Can not recommend a room at Georgestreet-side.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cairns, Australia", "Title": "“An unpleasant stay.”", "Author": "Travellingman73", "ReviewID": "UR10439465", "Content": "l stayed at the Pensione hotel recently with my mother visiting from South Africa and she correctly likened our room to Nelson Mandelas prison cell on Roben Island. It had one small glazed over window which looked onto a landing so we could not open it and the beds were made of grey steel. The woman in reception was extremely rude and accused me of short changing her when I paid for a shuttle bus to the airport. The flashy web site is not a true reflection of the Hotel. I would not stay here again.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Okay Budget Hotel”", "Author": "AussieinLA", "ReviewID": "UR10028727", "Content": "I stayed at the Pensione for one night with my partner. Given that it was a long weekend and we got a good rate, hotel was ok. It is a little bit like poking your way around a maze at times, to get to our room we had to go through a few corners, outside, more corners, lift, outside (thought we were lost as there is little signage to rooms) through a fire door to find a hallway, outside again, another hallway, then at last, our room. Rooms are small (as expected) but very clean which is all we wanted for the night. We were told we were 'upgraded'.. I think an upgraded room must simply have bunk beds as well as a double. Room was very noisy at night, we got in at about 1am and it was a saturday night, windows could use some glazing. However, after a while I did sleep quite soundly (or was that the 6 champagnes I had?) either way, it was a little less than expected I must say, but the staff were helpful and friendly. I had been told the room would be read at 12 when I booked, arrived early after a long drive at 11.30 hoping it would be ready but was happy to wait. We were told that the room could be done within 15 minutes... half an hour later we were told it would be done before two but could put our things in the room whilst the cleaner was there. She knew nothing of us leaving our things, told us they would be safe and would lock the door once she finished cleaning the room. We arrived after lunch, to our very clean room, with the door ajar. Wasn't happy about that. What can I say, there were two cleaners employed to work on a long weekend... However, our stay was budget, which was all we were after. Next time though, Id say we will back at the Sofitel. Ps... the elevator was still out of order...", "Date": "October 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hervey Bay, Queensland", "Title": "“stuck in lift”", "Author": "dreamtraveller39", "ReviewID": "UR8605775", "Content": "Stayed at the Pensione, room was okay but lift spoilt our stay. The lift was on the blink and we were not told not to use it. The morning of our check out we got stuck in the lift for over an hour and as a result missed our flight. Cost us an additional $580 to get home. The manager wipped his hands of us and blamed everyone else. Offered no compensation and kept passing the resonsibility on. They took our money, so they should of been responsible. Very disappointed with the lack of assisstance, stay at your own peril.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“Lovely Hotel”", "Author": "TravelCork", "ReviewID": "UR7937054", "Content": "This was a lovely hotel for the price. The room was large and very clean and the bathroom was recently redone. It is located within walking distance of china town and the Irish market. It was also very central located (about 20 minutes walk) from the opera house, bus station, quays. There were multiple bus routes available directly outside the hotel door as well.", "Date": "June 19, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Room was never cleaned but Great Location”", "Author": "WinKz", "ReviewID": "UR7682936", "Content": "We stayed at the Pensione for 5D4Ns in late April, 2007. We checked into a deluxe room with no problem; check-in & -out process was quick and easy. I was warned the rooms were small, but found that it was surprisingly spacious, with a closet & a bedside lamp (which I was told made the difference between standard & deluxe). Bathroom was indeed on the small side, with the tiniest wash basin i've ever seen... Oh, I don't understand why they can't put up more towel racks or shelves... The biggest problem was that they did NOT clean the room in the 5 days we stayed there. The bed was made, fresh towels provided, but we noticed the bedsheets were not changed and bathroom was not cleaned. This made us think the room was probably never cleaned too. And that made the stay felt very 'dirty'. And this was after we politely reminded the cleaning service lady to clean our room every morning before we left the hotel... Location: Purrfect! It's great, just off Chinatown, easy walk to QVB... We walked from the hotel to Circular Quay, took about 30 mins.", "Date": "May 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Ambiance and Service”", "Author": "RosalieSydney", "ReviewID": "UR7632920", "Content": "What it promised it delivered. Old world architecture, comfortable room, excellent service, close to all amenities and excellent price. We had a great stay", "Date": "May 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wellington", "Title": "“Overpriced backpackers rather than boutique”", "Author": "radames", "ReviewID": "UR7405727", "Content": "I checked in to Pensione and checked straight out again! The \"deluxe\" room was cramped and dirty. You can ask to have a stained blanket and worn linen changed but ii says something about standards overall. I'm not sure just how bad a standard room would be - maybe a hammock and a hole in the floor? The guest lounge was full of smokers and you have to pay to store your bag until your room is ready. Its not the standard I would expect for the price. However when I offered to pay more (than $A160) for a room more like the photo on the website the receptionist apologised, saying all the rooms were small and those photos were misleading. She indicated that there had been other complaints. And if you change your mind once you see just what poor value it is, you'll be stung a nights acommodation as a cancellation fee. Don't risk it - you can do much better in Sydney for a much lower price - try the Vulcan instead - just up the road, heritage facade, attractive large rooms for $110 and charming staff. They rescued my stay in Sydney for me!!", "Date": "April 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gosford, Australia", "Title": "“Great location”", "Author": "Laceytreigh", "ReviewID": "UR6718287", "Content": "We stayed at the Pensione late in 2006 for 2 nights on a quick getaway. The location is excellent, so close to Chinatown and all the great food! Also very handy to the Capitol Theatre, Sydney Entertainment Centre and Paddy's Markets. We felt safe walking around after dark. Our room was small, but adequate, although next time we will request a room which doesn't face George St (the main road). We didn't spend a lot of time in our room, so it wasn't important. We had a lovely breakfast at a 24 hour cafe on the next corner. The common room was large and had cooking facilities. Luggage storage lockers were handy, but the biggest sizes were in most demand and some people seemed to have problems getting one in the size they needed. The staff were very friendly and there were lots of brochures for things to see and do. .", "Date": "January 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "brighton, england", "Title": "“Uninspiring but good location”", "Author": "daveybuk", "ReviewID": "UR6621558", "Content": "If you can get a good price (we paid 115 dollars per night for our three night stay), this hotel is a decent option if your priority is a central location. However, at the rack rates avoid like the plague. Sydney's shops are right on the doorstep making this a very conveniently-located hotel. However, it does not feel like the safest area late at night (the neighbouring bottle shop employs a 'Safety Officer'). Our room was tiny, but clean, modern and air-conditioned. It's a mystery though how it could be described as 'deluxe' - perhaps because it had a bedside lamp? Standard rooms presumably just have a bed and bucket. With its grey corridors and rather functional feel the building does have the air of a good quality backpackers. If you're out and about all the time, then it's a fine choice for location and cleanliness alone. If you value the hotel 'experience' as important to your break, look elsewhere.", "Date": "January 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Upmarket backpackers”", "Author": "Julianna23", "ReviewID": "UR5775879", "Content": "My partner and I stayed at the Pensione hotel in Sydney for four nights in late august. We had a deluxe room which included tea/coffee facilities. Rooms are very small, but clean. The hotel is right next to Chinatown, which I was a bit wary about at first but liked the area and felt safe there coming back to the hotel after 10. The staff were nice and helpful and I found the atmosphere at the hotel friendly. It did feel more like an upmarket backpackers, especially with the bunk beds that were in our room. The common room is nice and modern, and we ended up going there a few times to use the internet over our stay and the lockers for our luggage on our check out day (fees apply for both services). The monorail and light rail are just around the corner and there's a bus stop out the front of the hotel, so that was good. I would recommend this hotel if your on a budget and want to be close to the city and transport.", "Date": "September 6, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Essex, England", "Title": "“Good choice”", "Author": "tomcricket", "ReviewID": "UR5526303", "Content": "On arrival i was greeted by friendly staff who took their time to explain the hotel facilities and help me plan my trip in Sydney. The room was very small (even for a single room). However, it was spotless and the bed was pretty comfortable. I booked the Pensione hotel because of its price and location - and i wasn't dissapointed! All of the city was in easy walking distance and for the price i paid i couldn't have asked for better. I would recommend this to young travellers who want a clean, cheap and centrally located hotel but don't worry to much about luxury.", "Date": "July 29, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New Zealand", "Title": "“Wouldn't be my first choice”", "Author": "vennaj", "ReviewID": "UR5416009", "Content": "Rooms are very small and are quite noisy (we were at the back of the hotel too) Didnt feel that safe coming and going from the hotel at night, would've have been better to haved stayed somewhere closer in for a few extra dollars.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Darwin", "Title": "“Loved the Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5378290", "Content": "My Husband and i decided that we were going to take a holiday to Sydeny before the birth of our first child. We went to our Travel Agent and they did the whole booking for us we only had to choose the hotel that we wanted to stay in. They showed us a broucher on the Pensione Hotel and we thought that it was the perfect. We arrived at the hotel around 12.30pm. We were able to go strait in to our room, this was great as we were told check in was 2.00pm. The rooms were simple and clean,the bathroom had large shower. When it came to finding great places to eat the staff were the people to talk to, they told us all about the great places in sydeny. They arrange Tours to the blue Mountains and even gave us free drink voucher for the bar down stairs. I Just wanted to say thanks to everyone for making our visit to Sydney a one to remeber", "Date": "June 24, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Singapore", "Title": "“Good deal”", "Author": "muzgetz", "ReviewID": "UR5369266", "Content": "Nice hotel on the whole. Rooms are a little small but clean. Simple and nice. No frills. Location good but need to walk a bit to the train stations. Good value.", "Date": "June 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Banbury, OXON", "Title": "“Perfectly Located, great value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5355553", "Content": "I stayed at the Pensione for a week recently, choosing it because because it could accomodate me and my family when a lot hotels in the city just don't have the rooms to sleep a couple and 3 children, and the kids loved climbing into bunks each night! Another major factor in choosing the hotel was the price, was really suprised to find out that I could get a room for all 5 of us for about 90 pounds a night, such good value for sydney, in fact I struggled to find anything as reasonable anywhere else on our trip. Unfortunately, we arrived in Sydney aparently during some of the worst weather they had had in years. Luckily the people on the reception were always very helpful in giving us lots of suggestions on places to visit on rainy days, and plenty for when the sun came back out too. I really liked the the layout of the rooms and hotel in general, the hotel looks old from the outside but inside the rooms are all newly refurbished and had all the facilities we needed. There was also some nice communal areas where we were able to make some lunch and surf the net. I really liked the old staircase that descended into a shopping arcade and down into chinatown, we thought the location was great, darling harbour with it's quality aquarium so close and only 25 mins walk to the Opera House was not even far for our 4year old!!", "Date": "June 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Best", "Title": "“Friendly Staff - NIce feel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5224891", "Content": "It is hard to remember the last time I felt compelled to actually write something good down about a business - usually I tend to do it when I have something bad to say. This hotel has the best service I have encountered in a long time. Whether it be giving you advice on what to see or how to get some where - ALL OF THE STAFF - are willing to offer you assistance. This was our first trip to Sydney and getting on in age I like to plan things down to the most minute detail. We constantly we at the reception desk asking questions, my wife said I was pestering the staff but not once did I get the impression that I was imposing. On arriving back into the hotel each day we were always greeted with questions about how our day was and this was a fantastic way to share our experiences. In fact the staff were so great we had to take photos to take home and show the family and put in the album as these lovely young people really did deserve to be remembered as part of our holiday. Don't worry about the hotel - its clean and central. The staff are what will make your stay.", "Date": "May 26, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Kent, UK", "Title": "“Great Price, Nice Rooms, No probs”", "Author": "A TripAdvisor Member", "ReviewID": "UR5192339", "Content": "I was slightly disappointed with this hotel after seeing their website. I think we thought that it would be luxury at a budget price. It wasn't. But it was still nice. Our room was small, and had a fridge. But I did find the fact that there wasn't bed side lamps annoying as you had to turn the big light off and get in bed in the dark! The decor is nice and the bed is quite soft with only one pillow each. I would expect the reception staff would have provided more if we had asked. We didn't have a chair, although the only thing i use a chair in hotel rooms for is to chuck my clothes on. There was a small comfy stool though. There was no wardrobe either, but we lived out of our bags. The $7 breakfast seemed a bargain from their website, but it is just a small box of cereal, a small carton of juice and some milk. I think I had in my head continental at croissants and jam and fresh bread!! We found the hotel to be a 30-35 minute walk from the rocks and 10-15 minutes from darling harbour (we walk quite quickly), but there is a bus stop right outside and nearly every bus goes to the rocks or circular quay. The area is busy at night, but we didn't find it excessively noisy. Out room was quiet and had a window although it was around a courtyard not getting much light. There was a telephone to dial directly into our room although my mum tried calling a couple of times and the line was dead. We did not investigate this any further. We arrived early around midday and our room was ready and we found the receptionist quite helpful. Our room was on the 2nd floor but there were tonnes of steps to carry our heavy bags up. There was a lift but we were impatient and it was quite slow. The bath room was really nice and tiled. Quite trendy. But it was lacking in a tooth brush holder and the shower door nearly came off of it's rails the first time i triend to use it. This was reported to reception. It didn't seem to be fixed during our stay so we just had to be careful opening and closing it. All in all a nice place, clean, comfortable and everything we could need - we only sleep in hotel rooms, there's far too much to do in sydney!", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Northern Territory", "Title": "“Perfect Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5186688", "Content": "We made the mistake of hiring a car when we arrived in Sydney airport. When we arrived at the hotel it became apparent that the car was going to be more of a hinderance then a help. The hotel location is perfect - it's walking distance to Darling Harbour and the CBD and for anything else there is a bus stop just outside the door. The rooms are very clean and tidy and the bathrooms are very trendy. One thing to note is that whilst the rooms are clean and comfortable they are light on the ameneties - there is a wardrobe, fridge, TV (mounted on a bracket from the roof) tea/coffee, lamp, hairdryer, air conditioning. You can tell this hotel is geared for the traveller that is not intending to spend a lot of time in the room. In saying this there is a great area towards the back of the hotel that is very open with lounges, internet, laundry and small kitchenette with all the crokery and cutlery you would need. We chose this hotel after a recommendation from a friend that stayed just after they opened some 18 months ago. For the money your asked to pay, considering this is a central Sydney hotel, I would stay again. If you are looking at this hotel then please take into account my comments on ammenties. Great if you are on a budget.", "Date": "May 21, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Auckland NZ", "Title": "“Fantastic Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR5184713", "Content": "Just had a week at the Pensione Hotel Sydney, and consider it one of the nicest and frendlest hotels we have stayed at in over 20 years of travelling, the reception was excellent, service and cleanliness the same, what more can we say??? we give it 5 stars R & J Metcalfe Auckland NZ", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "auckland new zealand", "Title": "“Loved this hotel”", "Author": "freedomfortwo", "ReviewID": "UR5056350", "Content": "I can certainly recomment this hotel. It is a beautiful old building, reminding me of old Europe, with a magnificant staircase. The hallways and rooms are very modern, comfortable and clean! We found the beds very good, friendly, helpful staff, clean towels every day if requested, coffee and tea supplies topped up. The only drawback was the street noise! You have to bring your earplugs, otherwise sleep is out of the question. But that can be expected if you book a hotel on the main drag! We had a wonderful three night stay and will stay there again.", "Date": "May 11, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Dublin", "Title": "“This Hostel gives backpackers a bad name”", "Author": "A TripAdvisor Member", "ReviewID": "UR4999063", "Content": "All was going fine with my holiday until I encountered this so called Hotel. First off this is not a hotel, this is a hostel. This fact is very obvious when you see the size of your room, the lack of facilities and the dodgy characters that hang around the common room for most of the day sleeping off hangovers. I was completely mislead by the website and I should have researched this hostel a little better. Anyway, any place that charges you to mind your bags for a few hours is always going to be dodgy. I wouldn't go back for a second helping....ever", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Ok for the Price ”", "Author": "Jamsey", "ReviewID": "UR4616690", "Content": "Stayed for 11 days and it was OK It could do with a desk or even a chair in the room. The TV hanging from the ceiling is not too good and as there is no chair you've got to sit or lay on your bed to watch it...........but it's not too often you'll be in the room! The hotel has a great location on George St and Chinatown. I think I'd pay the extra to get a better hotel if I was returning, but it's ideal if you're on a budget and you want to see OZ. ROOM WAS KEPT CLEAN AND STAFF SEEMED TO BE OK ALTHOUGH I DIDN'T REALLY HAVE ANY RAPPORT WITH THEM. I CERTAINLY WOULDNT RUN THE PLACE DOWN AS IT IS VALUE FOR THE MONEY YOU'RE PAYING. IF YOU DO GO ENJOY AS SYDNEY IS A BEAUTIFUL PLACE", "Date": "March 14, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Gold Coast, Australia", "Title": "“Very basic hotel in great location”", "Author": "Cartman88", "ReviewID": "UR4472257", "Content": "Stayed here for 2 nights in mid February. If your main concern is location then this hotel is in a great spot within a few mins walk of the following: Sydney CBD Central Station Monorail Chinatown Paddys Market Darling Harbour Star City Casino The room itself cost $100 per night and was very small and very basic - it was ok if you are just looking to crash for the night - but if you plan to spend some time in your hotel room relaxing then it is really lacking - some others have described it as not much better than a hostel which I think is an exaggeration but I can see why they say this.", "Date": "February 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Clean, Comfortable Accommodation”", "Author": "A TripAdvisor Member", "ReviewID": "UR4156011", "Content": "Really good hospitality. Friendly and charming staff. Really Clean.", "Date": "November 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR3847165", "Content": "We loved our stay. Hotel was very clean and eveyone was wondeful.", "Date": "September 6, 2005"}], "HotelInfo": {"Name": "Pensione Hotel Sydney - by 8Hotels", "HotelURL": "/ShowUserReviews-g255060-d501434-Reviews-Pensione_Hotel_Sydney_by_8Hotels-Sydney_New_South_Wales.html", "Price": "$109 - $221*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">631 - 635 George St</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2000</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "501434", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b5/ff/c3/hotel-lobby.jpg"}}