{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Pontypridd, United Kingdom", "Title": "“hotel from hell”", "Author": "rhydboy", "ReviewID": "UR124704635", "Content": "Booked into this hotel for 2 nights. 10/2-12/2 2012.On arrival we came across a front door where it had tape covering the cracks in the glass.We had booked a double room(with double bed) so were shocked to be given a room with bunk beds.Complained at reception and were given the keys to a triple room on the 3rd floor.This was made up of a single and a double bed with no room to walk in between.Although the sheets appeared clean,there were numerous stains on the bedspread.The cups in the corner were badly stained and the entire room had a really bad fousty smell to it.The bath/toilet cupboard was tiny and also had a nasty odour.We expained to the receptionist that we could not stay hear and asked for a refund.She phoned the manager who was at another hotel,where he offered us a room,which in fear of it being anything like this one was refused.He also refused us a refund and kept on telling me that his prices were cheap.We managed to stop the payment via our credit card company.I strongly advise anyone thinking of staying here to go elsewhere as this place was disgusting and should be closed down.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bath", "Title": "“Avoid Unless You Are Desperate”", "Author": "IgnatiusJBath", "ReviewID": "UR124405301", "Content": "We paid £59:00 per night for our room, and for London this seems OK, especially as this hotel is just a stone's throw from Earl's Court Tube Station. The bed linen was clean and changed daily, towels and soap were provided and the two staff receptionists we met seemed friendly enough. Payment was demanded for the two nights stay we had booked on checking in, and a £10:00 key deposit (returned on checking out) seemed fair enough to allow free access whatever the time of day or night. All OK so far. However; we found a soiled T-Shirt behind the toilet, the ariel lead was broken and they had tried holding it into the TV set with elastoplast, but needless to say this didn't work. The room was spartan,the kettle didn't work so tea/coffee making facility was an illusion, but worst of all - we saw a mouse during our second and last night there; and lo & behold there was a mouse trap under our bed! We were just glad they weren't providing breakfast.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Vienna, Austria", "Title": "“discusting place”", "Author": "PinkAngel25", "ReviewID": "UR123971984", "Content": "The room was dirty, you could not close the curtains as they were hard due to the amount of dirt that was on them. The bed was not near to clean. Heating could not be regulated and was on at full blast. Windows could not be opened. Toilet was in the hallway but not workind so you had to go up to the next floor. The walls were so thin that if you lent against them they gave way. We did not stay at the place and canceled the payment via the creditcard institute as the manager was not in at the weekend and not avaliable. Only back on monday and we went back on Sunday.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Aalborg, Nordjylland, Denmark", "Title": "“disgusting”", "Author": "Phyllis N", "ReviewID": "UR123582390", "Content": "We stayed at the hotel for 7 nights unfortunatley.......there were mice and cockroaches in our room......the staff were unfriendly and we were expected to pay for toilet paper. There was a lack of hot and cold water which often could not be regulated when taking a bad. Unfortunatly I could not go to another hotel as i was on bussiness in London and had to have an permanent adress there.......I would advise other travellers to find somewhere else. to rest their heads. Las Steen Christensen and Phyllis Duggan ( the 16th of january to the 23rd January 2012 )", "Date": "January 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Naples, Campania, Italy", "Title": "“HORRIBLE HOTEL!!!!”", "Author": "Sergio M", "ReviewID": "UR121448542", "Content": "This is not an hotel, it's a hovel!!! Totally untidy and dirty, dirty blankets, broken door lock, and finally we found a mouse in the room!!!! It has been the worst night of my life!!! The position of the hotel is good, in in front of the earl court undergrond station, and the city center is very near. But all the rest is negative. Most of all the quality/price ratio is very bad! We spent 26 â‚¬ and sleeped with an mouse in the room!! I advice you don't book in this hotel!!!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“FAIL”", "Author": "Madmatt82", "ReviewID": "UR121405381", "Content": "This place fails with everything.rooms have view of tubes and it's bad", "Date": "December 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Absoutley Disgusting”", "Author": "Mia L", "ReviewID": "UR118994932", "Content": "Well I went to Earls Court Gardens Hotel In April, we stayed in a four bedroomed room. we got there and we asked if we could out our bags in there as we arrived early. they said the room wasnt completed yet so we put our bags and left. We had been out all day so we got to the room and it was the same as when we left. Things which where disgusting * Rat Poison under sink * blood on walls * No Curtains * Underground next to hotel so you dont get any sleep *Toilet didnt flush I would never recomend to go here ever !!!!!!", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Maidenhead, United Kingdom", "Title": "“This is not a HOTEL it is a HOVEL”", "Author": "kellbetts", "ReviewID": "UR116252237", "Content": "Avoid like the plague. Website makes out its brilliant. IT IS NOT. It is the pits. It is a house that they have tried to rent derepid rooms out of. I booked a 3 bed room, and its was a very very small box room, with punch holes in the wall, broken furniture, and black mould. Bedding looked wrank too. The ensuite bathroom was non existent. It was a communal shared facility, Did not stay as my 7 year old son and 5 year old daughter said it was disgusting and thats coming from the mouths of innocent children. Thankfully there was a brilliant premier inn around the corner!!!!", "Date": "August 4, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ledbury, United Kingdom", "Title": "“Disgusting”", "Author": "corben38", "ReviewID": "UR111616485", "Content": "This place was disgusting, the worst place I have ever stayed and should be closed down. I spent the night there, but never stayed for breakfast, wasn't risking my life!!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Do NOT Stay Here!!! Words cannot describe the state of it.”", "Author": "becca3978", "ReviewID": "UR110413969", "Content": "Sometimes, when places are this cheap and are too good to be true, all the below is true. I booked a one night stay in a family room for 4, for one night at the Earls Court Garden Hotel for myself and 3 friends. Â£75 for the four of us. Very Cheap for London for four. The one positive thing is location to Earls Court Tube Station. About 2 minutes walking. Now the negatives. Where do i start!!! A family room which shows you in the pictures as four beds is not. Its 2 dirty bunk beds!! Any family planning on staying. Don't do it. Not for you or your kids. Its filthy. Dirty carpet that is older than myself i would imagine and last saw a clean maybe last year. The booking will lead you to believe that you have your own bathroom, not true, its a communal style cupboard/shower room with a 1970's shower head and a sink with no warm water and a tiny shower curtain that is good for nothing. So if you're on the 3rd floor like us, you must go downstairs for warm water. No curtains in the room on one window, instead a Sainsburys bag hanging in the window to block the light out. What the website doesn't tell you that you are right under a tube line. So every six minutes from 6 am you will be woken by the tube until 1 in the morning. Tea making facilities - nope. 4 plastic cups that you would get from a water dispensing machine. You'd probably scald your hands if you poured hot water in there, that's if they didn't melt from the hot water in the first place. Nowhere to lock valuables, and the door to the family room could have been knocked open without any force. None of this is exaggerated. If you really need a cheap room shop around or just spend that extra Â£10 as you truely will be furious if you stay in this dirty, beyond basic germ ridden hotel.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "chichester", "Title": "“Not as bad as i expected.”", "Author": "chezbabe24", "ReviewID": "UR96154740", "Content": "I read the reviews on this hotel before we went i was dreading it, i imangined all sorts of bugs and creatures sharing our room with us. It was not that bad, the rooms and bathroom where both clean, the hotel is in need of a major refurbishment, but that about it. Yes it is next to the underground track, which did not bother either of us, but may if your a very light sleeper, but it didnt wake us personally up. The hotel is very old and in the morning you could hear every one walking about, doors slamming and people talking, but when we was going to bed the previous night around 11, it was quiet (except for the trains) the hotel is in a perfect location , 1 minute walk from the tube station, which is admist an array of shops,bars and resturants. I would highly recommend this hotel if you are on a budget.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Dundalk, Ireland", "Title": "“The worst dump i have ever seen”", "Author": "PatMcCourt", "ReviewID": "UR89528233", "Content": "I could not stay here , It was filthy, we checked in and left within 5 mins, our clothes and shoes were distroyed just from check in, The room was covered with dust, and smelt fusty, and the trains run right past the window, its right against the track. Also was a shared bathroom wich was in a discusting state, When we said we were leaveing, the recptionist (who did not have good english) laughed as if we were crazy, i spoke to 3 staff and none of them had good english, But they had the neck to charge me a miserable Â£40, I can only advise anyone not to stay here, Its a discrace, and not even worth Â£10, its not fit for rats or pigs, its the worst i have ever seen,", "Date": "December 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Burgau, Germany", "Title": "“NEVER AGAIN”", "Author": "lamorevero", "ReviewID": "UR82206626", "Content": "I booked over Easytobook.com and paid 80 GBP for single basic room for 3 nights. Very good, for this excellent location! Very frienly indian gentleman welcomed me. But...there was a room on the first floor with window that can not close, very old building, carpet and furniture which didnÂ´t bother me so much, because I went to hotel only to leave my shopping bags and to sleep- which I couldnÂ´t - because tube was running direcly under my window, which I couldnÂ´t close, heating was on so it was like sauna. Dirty water heater with remains of tee and stinky water in the room - I was afraid of insects and rats - but they probably put the powder against them - thatÂ´s why the hotel has a suspitious smell. Sheets and towels were clean. Bathrom is tiny and old, shared of 4 rooms. After I complaind after my first night about lack of sleep I was given another room on the third floor, which was slightly better. Noise from the undergroung was there, at least they didnÂ´t heat and I could close the window. Under the window is a small place where other guests throw their garbage, so I could count emzy cans of beers, boxes and garbage. In the bathroom on the third floor, there is no water for the shower, probably low pressure for the third floor. The same for WC. You come to pee and you find stuff inside. On my departure I asked back key deposite (I gave only 5 GBP) and I was given only 2 GBP back, because the young guy didnÂ´t have 5 to give me back. I would not recommend this place. I would not go again.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“You couldn't find a worse hotel in London.”", "Author": "MarcusBrothersby", "ReviewID": "UR80914164", "Content": "Even if it means resorting to saying in a hostel, it would be a better experience than what you would find at this hotel. Yes, it is a convenient location, right near the Earl's Court tube. But the positives end there. The place is dirty, smells bad, and is most likely a health hazard. The hotel is right beside the tube and the sound of the trains continues, making it impossible to get a good nights sleep. The TV doesn't work, there is nothing special provided for you at this hotel, it is NOT worth the cheap price. Overall, a horrible experience. DON'T GO!!!", "Date": "September 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Is that poop or mould on the ceiling?”", "Author": "justalittleteapot", "ReviewID": "UR77066455", "Content": "Since we were only paying Â£17 each per night for this hotel I wasn't expecting much. I wasn't expecting the room to be big. I wasn't expecting the room to be comfy. I was expecting the room to be clean and for the staff to be at least a little interested in the quality of their guests' stay. Apparently even this was too much to ask. To start off our awful experience, we arrived at the hotel after midnight, so nobody was in the reception to give us our key. Instead we had to phone another hotel and let them know we we had arrived. When I phoned I was told I would have to come and pick up my keys from the other hotel. When I asked how to get there I was told there should be directions on the door of the Earl's Court Gardens hotel. There was an arrow pointing right. When I told the man on the phone that that was all there was he proceeded to reel off a list of directions and then got annoyed at me when I had to ask him to repeat the directions, since we had gone the wrong way and had gotten lost. After all that we finally got to the other hotel and, after settling our bill and paying the key deposit, we were given the key to our room. There was a slight confusion with our money (\"What's this?\" \"Pounds stirling. It's Scottish money\" \"Do you have any British money?\" \"Last time I checked Scotland was part of Britain\") but to be honest I should have expected that since I usually run into problems with Scottish money when visiting England. There was also a problem considering we owed Â£68 but did not have change. We gave the receptionist Â£70 and were given a note explaining that we would have to collect our Â£2 change from our hotel the next morning and that there would be somebody there from 7am to make sure we got our change. The real problems started when we got into the hotel. We found room 203 with no difficulties, even if it was a bit of a squeeze to get through the doors even with our tiny suitcase. When we got into the room I had to cry. At first glance it looked clean but as soon as we looked up it was a different story. As well as several damp patches on the ceiling there was also a stain which, in the poor lighting we had, we were unable to identify. We decided it was either mould or poo. Either way it was very unpleasant. After this discovery we started inspecting the rest of the room a bit more thoroughly. The wallpaper was coming off the walls in places and the carpet was stained pretty badly underneath the bed. One window did not have curtains and the curtains on the other window were falling off. I opened the cupboard to hang up a dress and changed my mind as soon as I saw how grotty the inside of the cupboard was. If it hadn't been so late we would have left right then and found somewhere else. On top of that there's also the fact that our room looked out onto railway tracks. This meant that we didn't get to sleep until roughly 2am when the trains stopped going past and were woken at 6am when they started again. All in all a very poor night's sleep. We decided it was not worth staying in this hotel any longer. We phoned travel lodge and booked a room at their Farringdon hotel (which ended up costing us over Â£100 we had not been planning on spending), since we at least knew that it would be clean, and got ready to check out. This is when we discovered that on top of everything else the hot water was not working in the shower, the taps did not switch off and there was no soap for washing your hands in the bathroom. We got to the reception at 8.30am (an hour and a half after we were told that there would be someone there with money) and found it unmanned. After a quick call to the main hotel the receptionist dragged himself out of bed to serve us. He told us we would be able to get a refund for the night we were not staying but that there would be no money on the premises until 10.30am when the manager (who we never saw once during the whole ordeal) arrived. This seemed pretty poor to me, especially since the latest you're supposed to be able to check out is 11am and you have to get your Â£10 key deposit back. I think they just intend to scam an extra Â£10 out of many of the tourists who stay there. So we handed back the key and filled out a form saying why we were unhappy with our stay (which I refused to sign until I got my money back) and went and had breakfast at the nearby Sainsbury's. At 10.30am we returned. The receptionist told us several times to be patient and wait longer before walking out the door and coming back with some money. However since another couple were wanting to check out by this time he served them first and had to leave again to get the rest of our money. When he returned he gave me the form I had filled out back. When I reminded him that I wasn't signing anything until I got my money he said \"No. You sign here and write 'No complaint' and I give you your money back. Trust me. Right 'No Complaint' otherwise it looks bad for me and I lose my job\". After arguing about this with him for several minutes (because I had a fair few complaints about the room and the customer services) I finally wrote 'No complaint' on the form and we were given our money back. Except for the Â£2 change which then caused a further argument (I know it's not much but by this point it was the principle of the thing that made me do it). When we left we realised they'd given us all our Scottish notes back, which was the only laugh we got out of the whole thing. Throughout the whole ordeal the receptionist did not apologise once except for a monotonous \"Sorry for your inconvenience\" as we walked out the door. So two and a half hours after we first lodged a complaint and checked out (and four hours after we were told we'd be able to be served), we were able to leave. If I had one piece of advice about staying at this hotel it would be \"Don't\". The rooms are disgusting and the staff couldn't care less about customer satisfaction. I wouldn't wish this hotel on my worst enemy.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Avoid like the plague, you might just catch it.”", "Author": "Cren24", "ReviewID": "UR72038788", "Content": "Horrendous. The location is just off Cromwell Road and since we were going to visit the Royal Albert Hall the location was pretty good for a cheap hotel. Â£50 a night and then a Â£10 key deposit which i thought was strange, but it was returned when we checked out. The reception is a tiny window off the entrance corridoor manned by a very old gentleman with a poor grasp of english. The carpet was threadbare and the place smelled musty, i was dreading the room. We were shown to our room which had shared bathroom (not specified on the phone) and was literally hell. The room was tiny and housed the boiler for the whole building, There was a cracked sink, a double bed which sagged in the middle and might as well not have had a mattress, clean pillowcases and light sleeping sheet but dirty duvet. Single wardrobe with no rail, TV mounted to the wall which didnt work and window which didnt shut. The railway line is about 4 feet away from the window and the earth shattering noise every 2 minutes or less keeps you up all night. The trains slow down after midnight and start up again about 5. The floor was horrid, i dont think the carpets had ever been hoovered. I would not recommend this hotel at all, very poor quality rooms for the money and the proximity to the railway line really ruined our sleep. Just awful, dont waste your money.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Horrible”", "Author": "Mags61085", "ReviewID": "UR67217922", "Content": "I stayed at The Earl Court Gardens Hotel with my Daughter it was her 21st Birthday presant. We arrived at 1 pm and was told to come back at 2 I already phoned to ask if I can get into the room early and they said it would be ok. When we arrived back they gave us a room on the second floor trying to get up the stairs was a mission then came the room. I opened the door and all that was in the room was a double bed a wardrobe, sink a kettle teabags sugar and milk and plastic disposible cups that you would of burnt yourself with. There was also a broken window with selotape on it the curtain didnt fit the window Then came the bath room tiles off the wall the shower had no curtain The toilet needed a good clean it was discusting I have never seen anything like it thank god we where only booked in for one night. This hotel has to be reported to the Hotel Inspectors .", "Date": "June 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Filthy - the pictures I'm adding say it all!!”", "Author": "Vixen13", "ReviewID": "UR66758016", "Content": "We booked here for a couple nights due to a festival. However, check-in does not open till 2pm, having arrived at 8am on the plane we grabbed food and headed to the hotel to check in for 12pm - The reception had a sign \"Be back 5 - 10 minutes', an hr later and we decide to head to the pub instead :-/ When we checked in after 2pm, we were told our room hadn't been cleaned, we were on the ground floor behind reception and every little noise could be heard. Needless to say, after seeing the mess of the room we left to go out immediately. To be fair the maid did turn up before we left and made the beds with clean sheets. After touring about London for a bit we headed back to the hotel about 9.30pm, yes there were clean towels and sheets but the duvet was the same (totally filthy) and hadn't been changed (god knows how many people had slept with it before us), I fell asleep for less than half an hour (without the duvet) before waking up to bugs crawling on me *shocking*. I ended up stripping the bed and found the matress to be ungodly. Also, the tv didn't work, room was filthy, bed was filthy, walls were manky, bugs in the room, dirt and dust everywhere. Yes it was cheaper than other places but I'd recommend spending a slight bit more for a travel inn or something - More like a filthy hostel, not a hotel at all !!!", "Date": "June 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "sweden", "Title": "“WARNING! - Cockroaches”", "Author": "sweden020", "ReviewID": "UR63206264", "Content": "Utterly disgusting and should be closed down for health and safety reasons. When complaining to managment it took them a long time to arrive at all and then being completely unreasonable with regards to the problems. Many issues (no working TV channels, filthy toilets etc) but mainly roach infested. The rain poured in through the ceiling and the bathroom plumbing was leaking. Windows were broken... do I need to write more? Embarassing to London", "Date": "May 4, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "2"}, "AuthorLocation": "manchester", "Title": "“Didn't even enter”", "Author": "www_10", "ReviewID": "UR61913813", "Content": "My friend and I went to London for a long weekend and booked just a few days before. We were NOT expecting much, and us being teenagers we didn't really mind where we stayed as long as it was a good location and was clean and had a bed. We got outside the hotel and our jaws hit the floor. Tiles were coming off the steps, net curtains in the windows were FILTHY, graffiti on the walls, windows themselves were disgusting, there was a sign on the door letting people know that no one was at reception? It just looked filthy from the outside, never mind inside. We made the wise choice of not entering the hotel at all. Believe me, we are not stuck up people, but this place was ridiculous. We walked back up the street and a woman approached us asking if we'd just come back from a hotel, we said yes and told her which one, she asked what it was like as she was meant to be staying there, she saw our faces and replied \"what!\" we told her and her friend was already in the internet cafe trying to find somewhere else to stay. Due to the hotels complete lack of hygiene we ended up spending 4 days lugging suitcases around London getting to hostels and other places to stay, which were nice places! First impression was awful.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Alberta", "Title": "“absolutely disgusting!”", "Author": "maggs_lu", "ReviewID": "UR54678977", "Content": "This place is so deceiving. The lobby looks nice until you get past the doors to the stairs. I couldn't believe the dilapidated state the building was in. There were holes in the walls, the stairs were unfinished, the lights were dim, I felt like I was in a horror film. Our room was dirty and smelly and the ceiling was stained with a red liquid (reminded me of dried blood). But the worst part was the washroom. I gagged the first time I saw it. I'm not sure how we managed to survive that place.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Lancashire", "Title": "“Disgrace to London”", "Author": "JamesLancashire", "ReviewID": "UR54562361", "Content": "The people who own this Hotel are a disgrace to the human race. You are a poor amdasordor to this country and should move elsewhere", "Date": "January 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "undisclosed", "Title": "“Very filthy, very noisy”", "Author": "DutchFlyer85", "ReviewID": "UR50672827", "Content": "This hotel was disgustingly filthy. The carpet hadn't been vacuum cleaned for weeks it seemed, there were long black hairs on the dusty blanket (us having blond hair), there were cracks in the windows (that looked out at overground tubes that wake you up every 2 minutes) and there was mold everywhere. Besides that, there were rat traps underneath the bed, though we haven't spotted any rodents or insects. The shower was filthy and way too small. The only positive point is its short distance from Earl's Court tube station. Voor 10 pounds extra a night you'll have plenty of good other budget options.", "Date": "December 5, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Service": "1"}, "AuthorLocation": "Stockholm", "Title": "“Sick”", "Author": "Munter66", "ReviewID": "UR45968156", "Content": "me and my wife stayed 1 night in room 202, when we arrived the window was open,we closed it and went to bed, (we arrived very late) in the morning the fire alarm started about 08:00, so i got out of the bed very quick and steppt thrue the floor, i think that the disgusting carpet on the floor saved me from ending up in room 102, at the same time my soon that sleept in room 302 stept in to a mouse/rat trap that hade been put under his bed. nobody toold us that they have a problem whit rats. i couldent find any one to strangel so we went for breakfast, then we came back to our room there was a very nasty smell of somthing dead. i changed hotel very quick then we went out to see London whit my limping son.. is there no control for hotels in England?? MR Conradsson", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "sheffield", "Title": "“A national disgrace!!”", "Author": "Rob72731", "ReviewID": "UR35972831", "Content": "Well if you haven't already gathered from the reviews this is a definate NO GO!! I wouldn't wish a night here on anyone.. It is hideously bad!! stains of what i could only imagine on the walls, smells which can only be described as rotting flesh like and mold growing everywhere. Yes this must be not only a front-runner for britain's worst hotel (or cesspit) but in the whole world! To think there might be anywhere worst well then it must be literally hell on earth. I am a young guy and i have stayed in some pretty bad places on my travels but i have never quite experienced somewhere like this and i had definately never walked out after staying just one night when i had booked for 5!!! Luckily they made up some excuse about the card machine not working and i managed to get away with only paying for two in advance with cash. However no matter what i was offered i could NEVER spend another night in that place let alone anywhere within a 5 mile radius!! I do not agree with the comment that \"its so bad its comical\" its SOOOOO much worse. I have also never feared for my life before going to sleep but i was at the mercy to any freak that one forgetful night!! I could not bear to think what a family turning up would think, It wouldn't only ruin your trip to england but also you would be scarred for life!! one small tip.... unless you want to experience a stay in a place which makes the black hole of calcutta look most attractive DO NOT GO THERE!!!!!!!", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "cambridge", "Title": "“DO NOT STAY HERE, PLEASE!!!!!!!!”", "Author": "alibongo511", "ReviewID": "UR30662197", "Content": "What a CESS PIT of a hotel, filthy beyond imagination. Mould growing up the walls, Bedding not changed, and to describe the bathroom, it's best just to think of an open sewer!! Health and Safety would earn their money here. This 'hotel' needs closing down!!!!! It is DISGUSTING!! Please do not stay here!!!! The 'staff' were rude and uncooperative, with a lack of interest in anyone staying here! I wouldn't recommend to even the worst of my enemies!! it is unsafe too, the one night I stayed I didn't sleep for a minute, there was no lock on the door!!", "Date": "May 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Namhae-gun, South Korea", "Title": "“Worst place I've ever stayed”", "Author": "teachertraveller", "ReviewID": "UR28718342", "Content": "I'd almost forgotten about this hotel when I stumbled across another review of it. Sadly I'll never be able to completely forget my one night there. I've stayed in some pretty bad, very cheap places, but this is the the worst. I was only in London to pick up a visa then fly out to Korea the next day. For one night a bed is a bed, I reasoned, and if it's close to the Tube.... When I arrived, the man in the cubby hole/reception spoke very little English, just enough to let me know this was cash only. I left my bags there and went out in search of cash. On return the man pointed the way up to my room. I dragged my two large bags up narrow winding staircases to a room that was only slightly bigger than the queen sized bed. I didn't need to use the wardrobe which was just as well as it couldn't be opened because the bed was in the way, and it looked like the door would fall off if I tried. The bathrooms were shared - there were two on my floor, but after glancing into the toilet of the first and wondering if the previous guest had survived that bout of dysentery, I chose to use the second, but for essentials only and as quickly as possible. The hotel is close to the tube- so close in fact that the overground trains run outside the window every two minutes right through the night. I thought of Ellwood and Jake Blues and wondered if you really do get used to it. I lasted 15 minutes before heading to my nephew's new shared student flat - with hindsight, camping on the hard sofa amongst the student debris would have been preferable. I did go back to Earl's Court to sleep and to be fair the sheets were clean and the mattress looked acceptable I left as soon as I woke. It's not a place anyone would want to linger. So bad, it was funny. Should be condemned.", "Date": "April 24, 2009"}], "HotelInfo": {"Name": "Earls Court Gardens Hotel", "HotelURL": "/ShowUserReviews-g186338-d501723-Reviews-Earls_Court_Gardens_Hotel-London_England.html", "Price": "$67 - $95*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">36 Earls Court Gardens</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW5 0TR</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "501723", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/eb/74/eb7454a5f6a0c320032fad04e7f6061f2large.jpg"}}