{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lent, the Netherlands", "Title": "“location-location-excellent value”", "Author": "Krystav", "ReviewID": "UR126673442", "Content": "Stayed at the Hollywood City Inn for four nights. Rooms are spacious and while decor is dated, beds are comfortable and room+bathroom was clean. Room came equipped with television, complimentary wifi and a mini fridge. Motel pool, while small, was clean and enjoyable. Complimentary breakfast was dougnuts/fruit/beverages. Location is very convenient. Close to subway/bus stops and freeway on/off ramp. Several cheap supermarkets/grocery stores nearby for supplies. Starbucks about a block away and several fast food and mexican restaurants within a block/two block radius too. Area at first looked a bit shady to us, but we found it to be no problem at all, even when walking late at nights.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Very handy location”", "Author": "JenGraham", "ReviewID": "UR126636578", "Content": "The motel is basic but exactly what we were looking for. The rooms were big and clean enough with a fridge and a TV, we didn't intend to spend much time in the room anyway. We drove from Las Vegas and it's extremely easy to find, just off the freeway, with ample parking spaces. The reception staff were friendly and assisted us with any requests. There isn't much round about the motel but it is a 2 minute walk up to Hollywood Blvd and then maybe another 10 minutes until you hit the stars and the beginning of the walk of fame so the location is good.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Darwin, Australia", "Title": "“Perfect for a short stay when you are out and about”", "Author": "Charlie_Darwin_NT", "ReviewID": "UR126021380", "Content": "We stayed here for 5 nights. We checked in around 7.30pm on a Saturday night. I was worried about walking around at night, the receptionist assured us it was ok and it was. I was so excited to find the cheap supermarkets one street away and we stocked up on groceries! The location of this hotel was pretty great. In hindsight I would have stayed a bit closer to Hollywood Strip as I prefer to walk, but the Metro was great. Once we discovered the busses too, they were so easy to get around on. The hotel itself was clean but basic. The room was quite large. Two double beds, a bathroom with bath, and a little lounge area. Though there was no iron. (Or fridge! but as I continued my travels across the US none of the hotels had a fridge - must be an Australian thing!) Do not book a tour wioth the reception staff as they take a HUUUUGE cut! Walk down to the strip and buy tours off the street for half the price. in all, if you do not plan to spend much time at the hotel, this will be fine. The area is safe and convenient, there is Starbucks, Ross, McDonalds, Dennys, and louds of otherrestuarants within walking distance.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridge, ON", "Title": "“Great location value for what you pay”", "Author": "fun-sun-done", "ReviewID": "UR125409373", "Content": "Don't be afraid to learn the metro early if you want to save money. LA cabs are PRICEY if you hit traffic (and you will!) Half a block from the Hollywood/Western metro stop on the red line. Heading to North Hollywood is Hollywood/Vine (start of the walk of fame) and Hollywood/Highland (which is right beside the Kodak theatre and a dozen other attractions on that block) Room was cozy with 2 double beds but we were never in the room for long so it didn't matter. Bathroom was clean. Complimentary breakfast selection was a doughnut, banana, OJ, Milk and coffee. Would likely stay again", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“good for price”", "Author": "malibu-jenni", "ReviewID": "UR124913850", "Content": "Overall was good to stay here when in Hollywood for this price. the best thing was the free morning doughnuts WOW so tasty! also free newspaper, and is 2 min walk from the underground. We walked into Hollywood from here, but quite a long walk. The neighbourhood is a little rough looking, and I did not like the fact that there was no safety deposit box available, so we kept our valuables locked in our cases. Also I do not usually react to products, but the shampoo supplied actually burnt into my scalp! So definitely avoid using it! If I ever come back to Los Angeles, I would try to stay in the Santa Monica area, and not the Hollywood area.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good for the value”", "Author": "Jen520", "ReviewID": "UR123438295", "Content": "We spent three nits at this motel The room is good for it price. Its clean and the bathroom is tidy too. However the airconditon have a little smell as it has been used for quite a while. But u could open the window for a refresh The service is good enough for a motel . 24 hr front desk so u could check out in early morning to catch flight. Staff are friendly and helpful. Motel is located in Tai Town. If u are girls try to get back early. To say that am not feeling safe in anywhere of L.A. There seems someone knicking the door at 4am. We think it might be a mistake of sb. finding their room. Breakfast are self-serving coffee and donuts/ crossiant. As well as cereals. Overall. If u re on a budget u can totally go there", "Date": "January 22, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“You get what you paid for”", "Author": "cmo_matsuk", "ReviewID": "UR122741896", "Content": "Old-fashioned rooms and not the nicest service. The laundry - OMG, avoid at all costs! But the location is convenient.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cheshire", "Title": "“If you can afford more, go elsewhere.”", "Author": "missmkd", "ReviewID": "UR122092573", "Content": "I travelled to California with my friend. As two 20 year old girls on a budget, we wanted as cheap as possible in a good location. We were staying in LA for 4 nights. The hotel itself is fine, the rooms were clean, fresh towels everyday and the location is good if you want to get to anywhere else in Los Angeles, however we did not feel very safe here at all. The surrounding area was very old and run down, and walking alone at just 6pm we felt very anxious, and were shouted at numerous times on the first night. There was also a shooting nearby on our first day. As a result, we stayed in our room each night after it was dark and ordered food to the room. We also checked out a day earlier and went to a nicer hotel in Beverly Hills. Positives: Free breakfast, although very limited. Parking Close to LA attractions Cheap If you are looking for cheap accomodation for a couple of nights, this is a good deal. But if you are taking public transport, like we were, go elsewhere. And if you are 2 young girls, go elsewhere. Otherwise, just keep your wits about you.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleethorpes, England, United Kingdom", "Title": "“well good”", "Author": "Joanne N", "ReviewID": "UR121199178", "Content": "Hollywood city inn is a good place to stay, it is handy for the hollywood walk of fame, griffith park and universal studio ect the staff there were very helpfull and friendly and and the maids were very good at keeping the rooms clean and tidy over all i am very pleased with my stay", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Price quality can't be better”", "Author": "bosbes", "ReviewID": "UR121020152", "Content": "We stayed here for 2 nights in room 210 on the top floor facing the pool. Great hotel, perfect location in Hollywood and good quality for the price of $75,- a night. Tahir the guy at the front desk was very nice. The room smelled fresh and was spacious. We had noisy Japanse neighbours the first night but slept very well anyway. There also is another building with an interior corridor, I am not sure if there are rooms too. The shower was a bit old but functioning very well and there is a small breakfast in the morning with coffee, juice, donuts and croissants. Wifi worked fine, we didn't use the pool but it looked nice and clean. I really liked staying here and will definitely stay again to save some money!", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“BEST HOTEL IN HOLLYWOOD”", "Author": "michael b", "ReviewID": "UR119531160", "Content": "This is a best hotel in hollywood area, i loved this place. nice roses and beautiful pool. plenty of parking. Most of rooms are non smoking cause i saw lots of guest smoking outside their rooms and i found ash trays out there. Staff is very friendly, specially Tahir is very helpful and guide us to move around. I will stay again. Nice and clean rooms. You may find some bad reviews but they are individuals. Thumbs up for this place. enough things for breakfast.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "bedfont", "Title": "“Nice motel”", "Author": "leolion1", "ReviewID": "UR119470219", "Content": "Room ok - clean with fridge and microwave. Good shower. Pool looked nice - but didn't use it. Laundry machines available but you cannot buy washing powder from the hotel - u must walk to local shop and buy a large packet. Breakfast wasn't great - served in reception and quite limited in choice. There is free parking available and carpark was almost empty when we first arrived but had alot of trouble finding a space when we returned at 10pm one evening. Lady on desk was nice enough to give us an extra half hr after check out time as we were waiting for Laundry to dry tho. Good location near Hollywood blvd.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Gig Harbor, Washington", "Title": "“Didn;t seem safe”", "Author": "GigTraveler", "ReviewID": "UR119111142", "Content": "We tried to save a buck but it wasn't worth it. The air conditioner was broken and we couldnt open the window due to the area. Seemed clean enough and was quiet...but will not return.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "England", "Title": "“Basic, dated, nice doughnuts!”", "Author": "Aseild", "ReviewID": "UR118151943", "Content": "Arrived in LA for a few nights, excellent location just two stops on underground to central Hollywood. Wifi free and didn't work at corner of room, but fine everywhere else. Room very dated, a little dark, clean, soft bed, fridge, microwave, no safe, toiletries. Breakfast lovely fresh doughnuts and croissants. Overall a good place to stay, nothing flash.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Dordrecht, The Netherlands", "Title": "“Next time we choose another hotel: Bad smell, cockroach and bad english”", "Author": "Ballyx", "ReviewID": "UR117528727", "Content": "In this hotel, we stayed three nights. I'm don't complain much, but this hotel is not recommandable! The receptionist doesn't understand a word english, the room smelled like urine and everyday there was a little cockroach in our bathroom (after i killed the previous one). The rooms where not dirty, had a TV and the location was good. Breakfast was not much, cereals and donuts, and you had to eat outside by the pool. If your lucky you can sit. And there is no elevator, so if you have a room on the 2nd floor (1st for the dutch, we dont count the groundfloor) you have to use the stairs.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Singapore", "Title": "“Cheap.. But not so good...”", "Author": "luckyrabbit25", "ReviewID": "UR117394812", "Content": "Husband n I spent 14 nights in the states..we stayed 4nights here bcoz of the reviews..well, the building is old n shaky, the room is clean but it is really old..the toilet seat has paint stains on it, it totally turned me off as I thought it was not properly cleaned. The shower is in the bathtub and the bathtub is leaking, the whole washroom is wet every time after shower.. Overall not a very good experience compared to our other stay in the US..", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bologna, Italy", "Title": "“Good budget stay”", "Author": "dilbert1970", "ReviewID": "UR117139151", "Content": "The Inn is a good choice fora budget stay in LA. The room was comfortable but showed more than a sign of age, which is the only reason I don't feel like giving it 4/5. Quite limited choice of food for breakfast, but it's there, included in the room rate. Good location for driving to the Studios, Hollywood, Beverly Hills, and downtown. Free parking is a treat in LA. Overall a good choice for money.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“A great stay”", "Author": "Christinet09", "ReviewID": "UR116937211", "Content": "This is a great value hotel. Nice, well maintained pool area with beautiful roses all around. The room was absolutely fine. No complaints at all. We really enjoyed our donut breakfast sat by the pool in the wonderful LA sunshine! How I wish all breakfast times could be like that - although not so good for the waistline. Never mind! Handy to have parking at the hotel as well, and it was easy to find also. The staff were quite helpful. There isn't a lot of bars, restaurants, etc, that we could find in the immediate vicinity but it is great as a base. Loved LA as well, have to say!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Melbourne", "Title": "“Great Location, Small Oasis in Hollywood”", "Author": "gkeim", "ReviewID": "UR116924166", "Content": "We spent 3 nights here with our 2 children in a downstairs 2x queen room. The room was pleasant and clean and a good size, beds comfortable. The pool area was very nice to relax in after a busy day. There was breakfast of pastries, mainly donuts, one cereal, milk, juice, tea and coffee available in the small lobby but you need to eat it by the pool or in your room. The donuts were (too) delicious but my stomach had had enough by the third morning! There was a station across the road but we didn't use it as we had a car. There were also a couple of nice Thai restaurants within walking distance, a McDonalds and a few supermarkets which were handy. The immediate area was a little seedy, especially at night although it didn't seem particularly unsafe - short drive to Walk of Fame and close to Universal Studios. Overall it was nice to return here after a long day of tourist activities and a great budget option.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“Another pleasant stay again !”", "Author": "JFUser", "ReviewID": "UR116388675", "Content": "Ideally located (subway, Hollywood Bld at 200 yards, Freeway entrance/exit just 3 blocks away), very kind and helpful staff, free parking and well equiped rooms (refrigerator, microwave oven), will make a very pleasant stay. We booked nights 3 times in 2009 and 2011 and we will come back there for sure.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Perfect location and price! I have been here for 3 times! Will be back!”", "Author": "soochie", "ReviewID": "UR114307921", "Content": "Firstly, talk about nearby amenities around the hotel walking distance to Metro (Hollywood/Western Station) walking distance to CVS pharma, Ralphs, and Starbucks! FREE carpark!! Secondly, talk about the hotel itself Ultra accommodating and friendly staff! ask them questions, they will glady help. Quiet area/street, Clean room, no bugs no smell! Breakfast is great, donuts and milk!! Orange Juice available depend on availability. Has got a pool. So do take a dip if necessary! Free internet! Remember to get the ID and password before proceed to your room", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Blenheim, New Zealand", "Title": "“Fantastic staff, average hotel, 2mins walk to metro, however pretty dodgy part of town”", "Author": "LeonieF88", "ReviewID": "UR113329631", "Content": "We booked this hotel as we wanted somewhere economical within walking distance to a metro station and this met our criteria at around US$80 per night inc tax and 2mins walk to Hollywood/Western metro station on the red line (which incidentally is just 3 stops from Universal Studios). The staff were probably the nicest, friendliest, most genuine and helpful of all the hotel staff we met during our US holiday. The room was big and had a fridge and microwave. The hotel is fairly old and run down but the room was clean enough. Free breakfast (of donuts and croissants) and free wi-fi. However it is not a particular good area and we did feel a quite unsafe walking around at night. 5-10mins walk from restaurants and shops. On the edge of Thai Town. I recommend heading down Western and turning right when you reach Walgreens. There you'll find Subway, Burger King and other fast food shops as well as a FANTASTIC shop that sells frozen yoghurt - which is more like icecream than yoghurt. It was the best food experience I had during my time in the US. Don't miss it! This hotel is good if you want to be near the red line but try to avoid walking around at night.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lahore, Pakistan", "Title": "“Good Hotel, i enjoyed my stay”", "Author": "rehanasif", "ReviewID": "UR112059085", "Content": "Great location, great hotel... Friendly and hospitable front desk staff... Nice clean and big rooms... Beds were comfortable... The location was perfect for hollywood street and universal studios... I had a gr8 time and i will b coming bk soon...", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“A Nice Place To Stay for the budget conscious”", "Author": "pa_kelly17", "ReviewID": "UR111897358", "Content": "After reading numerous reviews on trip advisor we decided on staying here based on reviews and price. The room was nice, had a fridge and bed very comfortable. The pool was clean but we did not use it as it was a bit cool but others did. Breakfast was provided, which consisted a huge sugar hit of doughnuts and other pastries. The hotel is close to bus services and the train line which services Universal studio and hollywood walk of fame. Two supermarkets nearby with Food for Less appearing the cheaper. The gentleman on the front desk was more then helpful in giving us advice on getting around on public transport. Would recommend this hotel for those on a budget and travelling with a vehicle as free parking. The area is not the best, but we had no issues.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Essex", "Title": "“Nice hotel, basic, good location for driving to Hollywood”", "Author": "daisykitten", "ReviewID": "UR108069621", "Content": "We only stayed in this hotel for 2 nights, the room was basic, with a t.v. fridge and large double bed. There were blinds on the windows which didn't block out all the light. There was a small pool which looked nice, but we didn't use. Parking was free and we always found a place to park. You can't walk to anywhere from this hotel, but the drive to hollywood and other areas isn't to bad. I would recommend this hotel if you plan on just using it as a place to crash and arn't staying to long.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "portsmouth", "Title": "“Stay away!”", "Author": "missclairee", "ReviewID": "UR107502335", "Content": "Please do not stay here. I am not one to write reviews, however I feel I should write on this hotel. My partner and I stayed here one out of 5 nights at the beginning of this month. We arrived late at night tired and jet lagged. On arrival, One block from the hotel was a group of drunk men standing on the corner being abusive. Further up were mass of police and a group of men pinned against a wall. On arrival to the hotel we were given our keys and went to our room. The hotel was awful. Damp sheets and bed, fixtures hanging off, non working shower, lights not working bad smells. We did not feel comfortable and slept terrible against the noise and what appeared to be gun shots. I know that it sounds far fetched, but it truly was awful! We love our basic low cost hotels and usually stay in them for the experience... Afterall it is just somewhere to sleep and we booked here based on the reviews!", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "birmingham", "Title": "“nice welcome to hollywood”", "Author": "gazfarr", "ReviewID": "UR103087444", "Content": "stayed here for first night of our road trip from LA to SF, and provided a nice welcome. Comfortable large clean room, ample off road parking, and the surrounding whilst not \"a-list\" felt safe enough to walk in. Just a short drive from the sights and the strip and good value for money", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Carlos de Bariloche, Argentina", "Title": "“Very good hotel”", "Author": "GarakC", "ReviewID": "UR100865802", "Content": "The hotel has large confortable rooms. The breakfast is basic but correct. You have to serve the brakfast yourself and you can take it to your room, or if the weather is nice, you can have breakfast next to the pool. There is a large supermarket at 3 min walk and several restaurants (mainly fast food) at walking distance. The hotel has its own parking but sometimes it was full when returning late at night. One plus: the gentleman that was at the front desk during the mornings was very helpful and gave us many useful tips for visiting the city. Besides he speaks spanish.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Buenos Aires", "Title": "“Not the best choice, need some maintenance.”", "Author": "Hipolito_Bouchard", "ReviewID": "UR98667011", "Content": "When I saw the ratings of this hotel I was surprised, an 88% acceptance level was very interesting. I suppose that the reviews were just after the hotel was renovated. Now it is not in good shape, really. The breakfast is not a continental breakfast, its just a take-out buffet, with two coffee makers, some donuts and a little fridge with one gallon bottle of juice and another of milk. There is no room to stand there, neither any chairs, just one that is fitted to be used with the computer. Wi fi works fine, slow but steady. The walls are thin, so you can hear other guests. The area is almost ok, but I advise you that by night it is not the best place to hang around. Too many homeless and addicts. There was a quite angry russian couple that realized there that the hotel had no cribs at all. So if you are going with your baby, take that in account. The bathroom had a dirty door that was never cleaned, there is a chest of drawers with all of them broken. The soap and paper is really cheap, and almost useless. When we arrived at the hotel it was 1.49, just 10 minutes away from our check in time. We waited for our room for a while, and at 2.20 I went to see what was delaying us. The housekeepers where having lunch at one of the tables near the pool. The rooms where open, with carts in the outside, but we had to wait until 2.45 to get the room. I think they could improve a little about the lunch time issue. Pros: Somewhat cheap. Close to Ralphs, Walgreens, gas. Free parking. Wi-fi. Cons: It is 5 minutes to Kodak Theatre, but the zone looks unsafe. Breakfast is poor. The furniture is in the throes of death. P.S. If you can skip this one and find a better hotel, go ahead, use this one just for an emergency.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Good location close to shops and eateries.”", "Author": "shirleyjoy", "ReviewID": "UR98165231", "Content": "Simple motel with reasonable fittings. A bit old fashioned but clean. The worst toilet paper of any motel I stayed at in the USA. Very thin and hard. Maybe the owners should use it for a week. Do nuts and croissants for breakfast. Internet service available at the front office. Staff very friendly. Room was always clean. It was value for money.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clarkston, Michigan", "Title": "“good hotel, good value!”", "Author": "2travellers63", "ReviewID": "UR96656473", "Content": "We spent 7 nights in this hotel. For us, this hotel was quite good. We both are female, but we didn't have any problem walking around there at night ( 7 pm to 10 pm). The hotel is very close to the hollywood Western Metro Station. We didn't have a car, so we took the metro to go everywhere in LA ...very convenient... Breakfast was ok...Doughnuts were not too bad. Beside coffee, there was some juice and milk in the fridge. The hotel is so close to THai Town, so we had delicious dinner in Thaitown every night. what more... there is CVS, Starbuck right around the corner...just about 1 min from the hotel...The guys who worked there were nice. The room was clean. The beds were not too bad... However, the last night before we left, there were two ladies living next door making a very loud noise all night...it was very annoying...well I didn't blame the hotel. it was something like manner that everybody should realize. ... if I go to LA again, I will not reluctant to stay here again.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Nice choice for all casual traveler”", "Author": "Irene_Lau", "ReviewID": "UR96129346", "Content": "Low-priced, clean, quiet, very convenience (turn left for Starbucks; and turn another left for 7-11 and Walk of Fame). Nice receptionist, well, do not expect too much services in this kind of motel, help yourself. Nice breakfast, coffee, milk, orange juice, donuts, croissants, etc. Wi-Fi password needed for EACH computer / i-Pod / i-Pad, one password can only be used on one computer. Low-speed, only for e-mail checking, uploading pictures can drive you crazy waiting or even too slow for the computer to response.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Convenient location and good value”", "Author": "SATOKUB", "ReviewID": "UR94405325", "Content": "Though we had a car, but we took Metro to visit Hollywood downtown (Chinese theater/Kodak Center). One way is only $1.50 and it took less than 10 minutes. I believe same price to go to Los Angeles downtown as well. Metro station/CVS/Starbucks/supermarket are all in 2, 3 minutes walk. Room/bath/shower are clean and there are mini-fridge and microwave. Free Wi-Fi was working great. One drawback was that we could hear people walking upstairs, so next time we'll ask for a room on 2nd floor. Lost of place to eat in neibourhood, Thai town is nearby, within 3 blocks you can find several Thai restaurants where you can have good food with good price. We felt pretty safe walking around the area even after dark (winter short day) like 8 o'clock. Breakfast were OJ, Coffee, Cornflakes, pastries, which was pretty good. Overall this place has good value. We'll be back next time we visit LA.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent transport links. Don't need a car!”", "Author": "RalphLee", "ReviewID": "UR88866343", "Content": "I stayed here for 3 nights, booked through a third party site and got a very good rate. I was pleased overall with the hotel. I had a ground floor, king size room, which was large, clean and comfortable. The fridge and microwave are a bonus if you are on a budget as there are restaurants and supermarkets, drugstores, all in close proximity to the hotel. I felt that the area was reasonably safe, as most of the people you encounter are workers in the area or other tourists/travelllers. Yes there are homeless people, just like any other major city in the world. The public transport is very accessible and cheap! I didn't have a car, but was able to easily reach all of the tourist areas, downtown and airport. To get from the airport to the hotel will cost $8.50 and could take up to an hour and a half in peak time, but its much cheaper than a taxi or shuttle! From the airport take the Flyaway bus (under the green sign) to Union station. Make sure the bus is going to Union because there are a few different buses that leave from here. From Union station take the redline metro to Hollywood/Western station - North Hollywood - and from there it is a very short walk to the hotel. To go to Hollywood major tourist areas, take the red metro train 2 stops to Hollywood/Highland station, less than 10 minutes, which will take you directly to the Highland Shopping complex, Chinese theatre, etc.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Fab little hotel!”", "Author": "emcgui15", "ReviewID": "UR87030038", "Content": "I came here with my friend on holiday and we believe we really pulled it off with this hotel. It was great value for money as the rooms were very clean and roomy. The Breakfast was cereal or donuts. I really wished i went for the more slimming cereal option however the donuts were for too tasty 'n' scrumptious to ignore. The location was actally better than i first thought, the metro was a 2minute walk down the road, across the road from a CVS (who doesn't love a CVS) and a starbucks. In the other direction there were multiple take away food places and a 'Food 4 less' supermarket. My friend and I raided this shop for juice, crisps and dip as we had a fridge in the room. But Paco who runs the hotel was one of the nicest people I met in LA. He was such a nice guy, very helpful. The hotel was good by its self, but Paco makes this hotel exceptional.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cornwall", "Title": "“Location, Value, Cleanliness-All Excellent!!”", "Author": "di947red", "ReviewID": "UR86648270", "Content": "We stayed here for 4 nights in October, we parked our hire car for free in the car park with CCTV which was an immediate plus, we used the Metro to go both Downtown and to go into Hollywood. Although the area is shabby we did not feel intimidated going out on foot either day or night. Hollywood City Inn has everything you need for a safe and comfortable stay in a very well located area, it is great value for the price!! We ate a couple of times at Jitlada Thai Restaurant 5233 1/2 W Sunset Boulevard Los Angeles, CA 90027-5709, it has a fantastic menu and the food is delicious, if you are concerned about the food being too hot just tell the waiter how hot you want your food and they will tell the Kitchen, it worked for us and we ate dishes we had never heard of before that were recommended by other diners. The continental breakfast is fine, we took our food to the poolside chairs and ate there. If you don't want to eat out, there is a Fridge so you can bring food into the room, there is a Ralph's Supermarket within walking distance on Hollywood Blvd. If you are interested in Museums, there are number that are free or have free days each month, check this link :- http://golosangeles.about.com/od/losangelesmuseums/a/MuseumFreeDays.htm If you have a hire car and want to try something different, we would recommend a drive along Mullholland Drive, it starts near the Hollywood Bowl and eventually finishes down on the coast, you will see incredible vistas of downtown LA, Universal and Studio cities as well as some fantastic looking houses. Check the Wikipedia link for more information. We have no hesitation in recommending tis place and will stay here again on our next trip to LA.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Renfrew, Canada", "Title": "“Hidden Gem”", "Author": "cleoder", "ReviewID": "UR84645683", "Content": "This motel is located just off Hollywood Blvd. & about 4 blocks from Griffith Park. The rooms are newly decorated as is the exterior. Our room was much larger than most motel rooms with a fridge & microwave. The court yard pool is clean with seating to enjoy the continental breakfast provided daily. Parking is free but a little tight. Restaurants are close by and tours of the area leaving from the Chinese Theatre are about 2 miles away. WiFi connection was free with good reception. The only draw back is the staff. They tried to charge us for room again and sent us to a room that was already occupied. Not real polite either", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“a great place for every one and every thing”", "Author": "MiaoE", "ReviewID": "UR82781757", "Content": "i had a wonderful time in the hotel. the workers were nice and helpful, the room was cozy, the outsides with the pool was lovely. you can get free access to internet, it is close to public transportation. what else can you ask for? one point to every person not from LA, there is an information center, right on Hollywood Blvd. next to the metro \"Hollywood / Highland Station\" and the \"Grauman's Chinese Theatre\", what ever you didn't find in the hotel or on the net, specifically about public transportation, they are happy to help! (another easy way to get there is with line number 2 next to the hotel on sunset Blvd.) enjoy!", "Date": "October 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Good base for exploring LA”", "Author": "amz1", "ReviewID": "UR82091157", "Content": "My fiance and I spent a week here in September. The hotel is located in West Hollywood / Thai town and yes there are a few dodgy characters around but its like that all over LA! It is located right near the Hollywood Western Metro and is only a couple of stops from Hollywood Boulevard. The rooms are clean, the showers are good and the bed are big and comfortable but there was no wardrobe in our room. The hotel staff are okay but I get the feeling they wouldn't go out of their way for you. The continental breakfast consists of Doughnuts, Croissants and Frosties. This got a bit tedious after a week but the doughnuts were good! For LA the hotel is reasonably priced and is in a good location for sightseeing although LA can be tiring using public transport. But then again I wouldn't have wanted to pay the parking prices in LA!!", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Great Hotel, ideal location”", "Author": "Juliet2006", "ReviewID": "UR81656595", "Content": "We stayed here one night on our way driving down the pacific coast. The hotel room was a good size, comfortable, had a coffee maker and a fridge in the room. It also had a swimming Pool which we didn't get a chance to use but if you were here for a couple of days then you would, nice size and definetely needed as Hollywood was one of the hottest places we visited on our Honeymoon trip down the Californian coast! Also Free Wi Fi at this hotel.The hotel was in a ideal location, near the metro and a 15 / 20 min walk to the Walk of Fame, the Chinese theatre, Hard Rock Cafe and the tours around L.A etc. Breakfast consisted of croissants/ cereal / pastries, coffee and juice, it was quite basic but nice to have fresh croissants and coffee before we set off. Reception staff were very pleasant and helpful.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good option for a decent price”", "Author": "Nabrab", "ReviewID": "UR79209307", "Content": "We had a nice room with 2 double beds. The room and the bathroom were very clean and quiet The croissants served at the breakfast had the taste of French croissants ! Location is good, near metro station. We paid $ 91,- a night all taxes included. It is a decent price for a decent hotel in LA. Do not expect to be in The Regent Beverly Wilshire but it is fine.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Please don't stay here.”", "Author": "somecoolchick", "ReviewID": "UR78702784", "Content": "It's not much dearer to stay somewhere else these days, especially if you book your hotel and flight seperate. Try to stay somewhere safer, somewhere in Beverly Hills or near Universal Studios or Hollywood Boulevard (by the popular walk of fame part). I stayed here a while ago now but I assume the area hasn't changed much. The hotel itself was okay, a little stinky and the shower was broken and it was full so we couldn't change rooms so we had to wash our hair all week using a bucket hahaha. It is cleaned everyday though by a nice cleaning lady. There was flies everywhere but to be honest it was roasting so I bet you get bugs everywhere in the summer. The pool looked OK but I didn't go in. The breakfast was just donuts and they were stale. We didn't have cars and the people just looked at us like we were speaking another language when we said this, they wouldn't even try to help us get around LA or give us maps or anything! haha they were nice but not very helpful for tourists. They did have a PC with internet and a printer for a charge though for maps and things. Wasn't the hotel that bothered me so much though, it was the area at night. I was aware there were prostitutes staying in my hotel because of the late night noises. There were homeless people near by with shopping carts (they were harmless but it wasnt the nicest thing to have to look at, makes you feel bad if you cant afford to give them food) and on our first night we were off to the local supermarket and we got stopped around 3 times by people asking us for food. We were 18 at the time and kinda terrified. On our first day we also seen two arrests and the local cab driver even asked us why we would choose this area to stay in. One night we were followed to the local Denny's by a car (beware females who dress nicely, in LA people tend to shout out their cars at you alot in the not so nice areas) so we didn't feel safe. Saying that, nowhere seems safe in Hollywood. On about our 3rd day we were talking to this lovely guy on Hollywood Boulevard and all of a sudden this guy comes out of nowhere threatening to shoot him and take his money haha. I do love LA and I wanna go back but next time I am going to stay in the W on hollywood boulevard. There's nice sides of LA and not so nice sides of LA aswell. I knew this before I went but I didn't know exactly where they were, so this is just a heads up. If you can rough it and you are tough enough then by all means stay here. If you like you're like me and you enjoy luxuries and are terrified at night then stay somewhere a little more pricey, it will make your trip alot better. Some of the trips we went on there were amazing, it's a great place but just don't think cause it's Hollywood it's gonna be glam because Hollywood is a pretty big place and it's just not like that. Hollywood Boulevard goes on for miles and some of it is pretty dirty! but the main section of it (hollywood and highland area) is just fabulous.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Abu Dhabi", "Title": "“Comfortable, well located Inn”", "Author": "R06R", "ReviewID": "UR75762502", "Content": "A comfortable 2 star (limited service). I moved here to save 1/3 of the daily rate at the end of a longer trip after staying in a good 4+/5 star hotel in downtown. You pay for the convenience of a subway across the street, and car-parking if you have a car (which I didn't). I wanted to be closer to Hollywood Blvd to do day-trips from there and this Inn allowed me to do that. The front desk was helpful, the large rooms are basic, the 'feel' is safe and friendly, and there is a nice pool area in the centre of a small set of rooms. A good way to save a few bucks.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "perth western australia", "Title": "“Best Priced Hotel in LA”", "Author": "cycobomber", "ReviewID": "UR70968347", "Content": "Cheap as chips in LA Free Parking and Wifi Conveiniant location close to freeway. Didnt think the area was too dodgy went out walking a few times by myself didnt feel unsafe Big clean rooms nice beds Very Clean Nice looking pool although didnt use", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Essex", "Title": "“Clean and comfortable”", "Author": "MarieMc85", "ReviewID": "UR70189633", "Content": "We stayed in the Hollywood City Inn for three nights on the last leg of our two week tour of the West Coast. The hotel is in an okay area. To be honest, I found LA to be dingy and a bit rough in general so don't think that the hotel is in a brilliant or a bad location. The metro station is a 30 second walk from the hotel. Parking was free. The entire check in procedure was conducted whilst the receptionist was on the phone to his friend, which was rude. Although he did carry our suitcases up the stairs (no lift) so I forgave him that! The room was clean and spacious. There was enough storage and a fridge and microwave which was handy. The air con was good. Everytime someone walked around in the room next door, or past our room, the whole room shook. We woke up during this on the first night and thought we were in the middle of an earthquake!! There wasn't enough pillows in the room so we went downstairs and asked the (different this time) receptionist for some more. He started quizzing us about how many pillows we had! He then said he couldn't help us as the housekeeping had gone home. We told him that it wasn't our problem and that we needed another pillow. He said that guests take the pillows home with them which is why there was a shortage!!! He eventually got us another pillow after we went downstairs and asked him again. I also wanted to use the phone and was told that I had to pay a $10 deposit even though they had my card details. He then said that if I called outside the immediate area, they would count that as an international call, ith a $5 minimum charge so I said not to bother!!! The pool area was nice and clean although there were only four sunloungers. Everyday, the owners/cleaners, who have an apartment next to the pool, would use two of the sun loungers to dry their washing on which was annoying. The washing would be on them all day. The breakfast wasn't very good. Cereal and donuts. You are only allowed to use the \"free\" internet for 15 minutes for the whole duration of your stay! And that is 15 minutes for the whole room, not per person. They also charge 50 cents to print out a page. Overall, the pluses outweighed the minuses and I would stay again and recommend to others. There is a really nice Thai restaurant named \"Thai Patio\" that is just down the road from the hotel. Turn left and cross the road and it is on your left.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Basic but a good affordable place”", "Author": "snowmonster", "ReviewID": "UR69192566", "Content": "We were away for three weeks in America so we couldn't afford to splash out on expensive hotels all the time. This place was less than 70 dollars, was roughly in the right part of town for the attractions, although when walking back from the strip after dark we didn't feel entirely comfortable. However, the hotel itself is clean and has a lovely pool area with roses and a good place to sit and eat the basic but free breakfast of donuts, frosted flakes, juice and coffee, great if you just wanted to get out and sightsee without having to worry about finding breakfast first. We stayed two nights and slept well. The room was basic and a bit dingy but had everything you needed, the bathroom could do with modernising. Overall I would stay here again although I would prefer to stretch my budget a bit next time for a fancier place in WeHo.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Great hotel for price and location”", "Author": "Aaron737", "ReviewID": "UR67247812", "Content": "This hotel was in an excellent location. Walking distance to hollywood/western station we used this line nearly everyday to get around. We stayed 9 nights at the hotel - no problems at all. Thai restaurants near by were great and affordable. The hotels rooms were very simple and bland, but clean and comfortable. The owner/manager was always friendly and helpful. We felt safe, but we were not out late at night. certainly would go back.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "", "Title": "“It's Hollywood...and...It's Hollywood”", "Author": "Map_vs_GPS", "ReviewID": "UR66259914", "Content": "We stayed at the Hollywood City Inn for just one night on our way to San Francisco from San Diego. Now, I am not a huge fan of LA, so I just wanted to do the Hollywood tourist thing and call it an evening. The hotel is not in a great part of town, which I read from other reviews and want to reiterate this point. Not the best place to be walking around after dark. We walked about half a mile to the strip during the day and encountered quite a few individuals who were just a bit too brash in public areas. After we realized there was nothing to the strip...we grabbed a taxi, the preferred transportation in this area, back to the hotel for dinner in WeHo. About the hotel: it has been renovated but still is drab and dark. The room was a bit musty and we had some very loud noises at 2:00 AM which startled us and kept us awake for about 30 minutes. Sounded like water pipes in the walls, or maybe a train going through our room...the verdict is still out. All in all the hotel was fairly priced for the area. Parking was $10 and it was a place to rest our heads. If you plan to do some sightseeing, stay closer to the strip.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Good value, clean rooms”", "Author": "eblau", "ReviewID": "UR63460865", "Content": "We got a room on the second floor down at the end of the breezeway, so we didn't have any people walking by or making noise. The room was rather small and showed some wear and tear, but was very clean and smelled fresh when we first arrived and during our stay (5 nights). With the AC running, we did not hear much noise from the streets outside and slept comfortably. The service was good and the gentleman was friendly at check-in and checkout. However, they could not accommodate our request for an extra pillow for my pregnant wife who really needed an extra one to get comfortable. (There were only 2 pillows per double bed, so we didn't have any extra.) The complimentary breakfast of milk, orange juice, coffee, donuts and frosted flakes was a simple and informal, but nice way to start the day. The pool area is very nice and clean and surrounded by beautiful rose bushes. The free WiFi was nice too, although the connection was rather flaky. If we moved locations in the room, the connection would be lost. The hotel is in a seedier area of Hollywood, as others have mentioned, but we felt safe the entire time we were there. The location is very good and centrally located to many of the sites we wanted to see. With LA traffic, don't underestimate the importance of location!!! All in all, this was a great value and we had a nice stay.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Great little budget hotel...”", "Author": "TorontoTraipser", "ReviewID": "UR63380683", "Content": "I was travelling to LA by myself, so finding a cheap hotel was very important. At $68 a night, I wasn't sure what to expect from this motel, but I was very satisfied. I stayed here for 6 nights, and have mostly positive things to say. The room was clean (although the bathroom was in need of some renovation), the bed was very comfortable, and there were no problems with the tv, heat/AC, fridge or microwave. The motel is only about a two minute walk to the subway. The pool area was lovely and would have been a nice place to have my morning coffee, had the weather cooperated! Everyone at the front desk was very helpful. The free wireless internet was great, as was the computer in the lobby. I wouldn't think twice about staying there again!", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sippy Downs", "Title": "“Good Value, Questionable Location...”", "Author": "SunnyCoastAussies", "ReviewID": "UR63377347", "Content": "The motel is in a 'seedier' part of Hollywood, so not the safest place to be out at night (as told to us many times by cab drivers!) but as with most things in LA, its close to everything. The service was fine, the room was comfortable, however as ours was on the corner down a corridoor, it was set out strangeley and the door opened onto the bedside table and you had to climb over the bed to get to the bathroom as the chair was in the way. Our friend had the room next to ours and his was set out fine, so there was no complaints. The room smelt fresh (like laundry powder) which was nice. The wireless internet worked sporadically depending on where you stood in the room. For the cost, its a nice place to stay and I would stay here again (I would just request any room other than 115) Beds comfortable, , staff nice... great for the cost", "Date": "May 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Blue Haven, NSW, Australia", "Title": "“Hidden gem, really nice feel with lovely pool area at a great price!”", "Author": "kellyfamily", "ReviewID": "UR61777025", "Content": "What a pleasant surprise to drive in here with lovely flowers and plants and nice pool area. Room was great too though my only tiny complaint is that it was supposed to be a non-smoking room and it did smell very fresh and clean when we walked in, the cigarette smoky smell did start to bother me after a few hours, yes I am very sensitive to smells, so I just kept spraying and spraying the Glade, was bearable for a one night stay but I would have had to have changed rooms if staying longer. Other than this it was fantastic place to stay, we walked to Von's and got dinner and heated it up in the microwave, felt totally safe walking around in the night time.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“A bit overrated. Good for bargain hunters.”", "Author": "MattyOSanDiego", "ReviewID": "UR61764605", "Content": "We stayed here two nights to see Paul McCartney at the Hollywood Bowl. Not a bad base of operations, but I wouldn't call it a \"nice\" place to stay. Acceptable enough, for $68 a night, king bed. The price is hard to beat. We had two rooms. There were no problems with our friend's room, but our \"non-smoking\" room smelled of smoke and strong cleaner/chemical smell. The rooms seemed pretty clean but after settling in we noticed a big patch of mold behind the bathroom door, between the door frame & tub. Gross! Also several guests had small children who were running around yelling at the crack of dawn, which didn't jibe with our previous late-nite tour of classic Hollywood dive bars... The location is ok, about a mile from Hollywood & Vine, another half mile or so to Grumman's Chinese Theatre. A pretty long walk, but if you like to walk, its kinda cool to tramp up and down the \"Walk of Fame\". A cab ride each way will cost about $6-9 w/tip. The immediate neighborhood is a bit rough, you are in the east part of Hollywood, in Thai Town/Little Armenia. There was an Armenian (mob-related?) murder in the area the night we stayed there. Not recommended to single women, unless you are street smart. However, the place itself seems safe. You could bring a family here. I wasn't too concerned to leave my laptop in the room. Free WiFi was a plus, too. And, some good low-budget restaurants in the area- Thai, Mexican. This place was described as \"charmingly seedy\" on Yelp, and that's not far off the mark. They make an effort to keep the place nice. it's not bad, but if you're used to the Hilton or Marriott, you won't be happy here. Not sure how they got such a high rating on Tripadvisor. I wouldn't object to staying here again, but I'd check into other options first - someplace a bit closer to the main part of hollywood, or maybe just a little nicer. TIPS- go up to Grifith Obsevatory. An icon! It's close by, awesome veiw of the city, Hollywood sign, etc. And all free, except for the main planetarium theater, which we skipped, but is supposed to be well worth it. Check out the Frolic Room, one of Hollywood's most classic dives. And great happy hour food and drinks at The Well.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Great value - Good location”", "Author": "worldclassinspector", "ReviewID": "UR59003822", "Content": "Stayed here 4 nights during the Oscars and it was really affordable, yet clean and nice. But it's necessary to have aq car in LA. The breakfast was doughnuts and coffee, but for the price per night, you cannot expect much more. Would stay there again.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Awesome for the price”", "Author": "grischnackh", "ReviewID": "UR58787959", "Content": "As many have previously said, this hotel is probably highly rated as a result of the price. I think we had 5 nights stay for 3 people coming in at about $383, which was way cheaper than a lot of other places I looked into. The rooms aren't great - don't expect luxury soaps for a start. Bathroom and main room are a little dingy and dusty, so if you're expecting super clean don't come here. Windows don't open so if you're caustrophobic and like to sleep with a window open at night, forget it. The blinds are also a litte gappy so light does come in at night. Room is a bit dark and gloomy due to poor lighting lamps. Fridge is noisy and had to be turned off at night. Other than these disadvantages, unless I found a better deal for the price I would stay here again. The staff aren't overly friendly although the older dude did make a bit of an effort. The free donuts, coffee, cereal and juice for breakfast is awesome. It's very informal but it's nice to come down in the morning for a quick start up before leaving for the day. Free computer/internet use is also cool. The location is great - if you're the person who enjoys walking everywhere, think otherwise because it's about 30mins away to the Kodak Theatre, but the good thing is that the subway is about 2 mins walk away from the hotel. Transport is super cheap in LA so it was so easy just to hop on a train and go into town. There is also a nice shopping complex across the road with a Ross bargain store and a supermarket, which is always a plus for us as I like a break from takeaway once in a while while travelling!", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great Hotel for the value”", "Author": "South81", "ReviewID": "UR58012296", "Content": "There is a good reason why this hotel has high ratings - its a gem for the what you pay for. PROS: Great location right next tosubway station & Hollywood Boulevard (walk 10 min to Kodak Theatre), friendly staff, big rooms, comfy bed, good cleaning everyday & towels, suprisingly quite, close to 24hrs shopping store, launderrette, cheap eateries...etc. CONS: the bathroom need updating as they are bit old (but still okay).", "Date": "March 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great place!”", "Author": "Brentivo", "ReviewID": "UR57592587", "Content": "LA is a really massive place with poor public transport, so location is hard to comment on, but we really loved this place. It is around the corner from hollywood bvd. It was cheap and clean, it included breakfast (donuts) and it had recently been renovated (always good). The staff were friendly and helpful. I would recommend this place. Try the Mexican restaurant across the street!", "Date": "March 3, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Novosibirsk, Russia", "Title": "“It's okay”", "Author": "Aaxell", "ReviewID": "UR57227241", "Content": "The hotel is okay if you stay for a couple of days. The parking is free, which is good. Wifi is free, which is good (you have to get a password at the lobby). But it was very noisy. You can hear everyone in the building.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Great Location and spotless”", "Author": "travellingscouse", "ReviewID": "UR57220502", "Content": "We stayed 5 nights, room spotless and cleaned every day. Fresh towels, nice big TV. Wi-Fi worked fine and there is a pc in the reception to pick up email. Bed was nice and firm, great nights sleep. Plenty of off road parking. Only 5 mins from Hollywood Walk Of Fame. We did not venture out on foot in the area but had no problems driving to local shops at all hours. Has pool and laundry.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great value and great customer servce”", "Author": "peachystar73", "ReviewID": "UR56708062", "Content": "I stayed 6 nights here in Feb 10 and got a pleasant surprise. The staff are very friendly and helpful. Rooms are a great size and have a fridge and microwave (very rare) Proximity to most places is good and if your not up for the 10 minute walk to Hollywood walk of fame then the train station is only 2 minutes walk away.Unfortunatley the weather didn't allow me a dip in the pool but it was always clean and looked very inviting. There is free internet in room (if you have your own computer) and there is a computer in the office which can be used by guests. Plenty of free parking (also rare) I couldn't fault this Motel and would reccomend it for all types of travellers. I will definately stay here on my return to L.A.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manaus", "Title": "“Best cost benefit”", "Author": "TravelAdddictedd", "ReviewID": "UR56546996", "Content": "This hotel has a great location with a 24hs walgreens in front, the rooms that i stayed for 7 days was very clean and cozy, it has lcd tv, a nice heater, free wi-fi, free parking, free breakfast and for a great price. The recepcionists are very atencious, helpfull and polite. I me and my family recomend this hotel.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Great bargain”", "Author": "Raffasworld", "ReviewID": "UR54493459", "Content": "Pros: in L.A. it's impossible to find this price for a hotel. it's really bargain and you are in Hollywood. location is awesome, even if you need a car to go around looking for bars and restaurants. great pool and garden and... free parking (impossible to find in L.A.). if your budget it's not the best, this hotel is the best! cons: breakfast is just very poor...better to go somewhere in the area", "Date": "January 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ashburn, VA", "Title": "“Great Bargain in LA”", "Author": "sgtmorrison", "ReviewID": "UR53930280", "Content": "Just checked out of this place yesterday and wanted to confirm a lot of the positive reviews on this place. First, the location is good. Half block from the Hollywood/Western Metro. Two stops will get you to Hollywood/Highland where the Chinese Theatre and Walk of Fame is. Free parking. Although limited at times, this serves perfect for when you want to drive around or go up to the Hollywood Sign or down to Pink's Hot Dogs, come back and have a space there for your rental car without any worry. We were in and out at all hours and always had a few spaces to choose from. The room is pretty big. Much bigger than the other place we stayed at during this trip. With fridge. microwave, desk, chair and of course TV. They have a nice sized pool, although we didn't use it. Tthe breakfast of Donuts, Cereal and coffee is free. The front desk guys were all polite and helpful answering our questions. I could believe how quiet is was during the morning hours. I will stay here when I return to LA. For the price and location, this can't be beat in the LA/Hollywood area.", "Date": "January 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel ! Great Staff !”", "Author": "AStroVicky", "ReviewID": "UR53787222", "Content": "My husband and I stayed 7 nights at this hotel . We found it at TripAdvisor and was a wonderful experience: The service : very good .. all team : always helpful , the hotel location is fantastic ! Was a pleasure for us to stay in a so confortable place with so nice people.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Gatineau, Canada", "Title": "“Great Price, Clean Hotel!”", "Author": "alliyance", "ReviewID": "UR50895027", "Content": "Spend 4 nights at the Hollywood city inn. For the price, I think it's the best motel you can have. It's clean and the rooms are big. I did 5 different hotels and this is the best one by far for the price. The free parking is a big plus and you get also a continental breakfast. Donuts, Croissant and cereal. Cafe and tea are included. If you chose to stay there, ask to be located on the second floor, much more peaceful. Rent a car will be best cause it's not near to Beverly hills or downtown Hollywood (30 min of walking distance to Chinese theatres.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Great Budget Hollywood Hotel”", "Author": "TheBoatingMan", "ReviewID": "UR50022209", "Content": "This is a great hotel. We stayed for 5 nights in October 2009. For the price we were not expecting much but we were pleasantly suprised. Rooms are nice and clean, and they are serviced daily. We arrived early (8AM) and they serviced our room straight away to get us in. The breakfast is basic but still ok. You get coffee, orange juice, a few cereals and croissants. The owners were friendly and provided us with all the directions and information we needed. The subway is really close as well as shopping centres and fast food restaurants. The room had a fridge for us to use which was great, but no microwave. For the price this place was great. Most the other hotels in Hollywood cost around $200, so this place is a bargain.", "Date": "November 25, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Tarragindi, Australia", "Title": "“Below average but afforable”", "Author": "TarragindiTripper", "ReviewID": "UR49539603", "Content": "First of all, our room smelled bad - the stench of an acrid cleaning agent working hard to mask something more sinister. The smell was almost overpowering when you'd enter the room, but you got used it it. Sort of. You couldn't open the windows more than a crack to get fresh air circulating, so that didn't help. The room was dark and dingy but clean where it mattered most - the bed - which is why we went ahead and stayed there for the two nights we'd booked. The bathroom was not up to my standards of cleanliness. Bath, basin and toilet were clean enough, it's just that there were weird stains on the mirror, the walls, the back of the door...you get the picture. Dire need of a makeover, this place. Location was quite good, within walking distance of many Thai restaurants and other cheap eateries. Felt safe enough to walk around at night. Our room was at the back, off street, so we didn't get street noise, but one night reception (or so they claimed to be) rang at 11pm, waking us to persistently ask for someone called Henry Somethingorother in room 403, who most definitely wasn't staying in our room (which was indeed 403). Our room was also close to the back entry door, so that was kind of noisy with people coming and going, but not so noisy that it woke you at night. I was a bit concerned about security though, since you don't need a swipe card or anything to get in the building (except reception - separate building), so in theory anyone off the street can gain access and loiter in the halls or stairwells. But we didn't see anything like that during our stay. The free parking was good - one of the reasons we chose the place, as well as the surprisingly sunny reviews it gets on Trip Advisor - and it's close to a busy bus stop for those travelling without a car. Finally, the staff. The guy who checked us in was friendly and professional, but the woman we had to deal with to get the login details for the free WIFI was downright rude. Oh, and the continental breakfast is pretty much nonexistent. This place was okay for us for two nights at the end of our holiday, but if I find myself in Hollywood again I'll stay elsewhere.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Convenient location to explore Hollywood”", "Author": "lonewayfarer", "ReviewID": "UR49249023", "Content": "We chose the Hollywood City Inn due to it's status of \"Top Value\" on this web site (Tripadvisor) and due the percentage of recommendations. The hotel is located in the eastern part of Hollywood close to the Hollywood Boulevard and Western Avenue intersection. There is a metro station, Hollwood/Western literally just across the street from the hotel and a bus stop just outside. It costed about 13 dollars each from LAX airport by shuttle bus. This particular area of Hollywood is a little run down but on the whole I felt safe here. The hotel check-in was quick and straightforward and the layout of the hotel is just like a motel style layout where the apartments/rooms are located around the central pool. There are about 3 floors of rooms. Our room was spacious with two comfortable queen-sized beds. There was a clean bathroom which had a bath, a great shower and a toilet. Clean towels were provided although the towels weren't very large. The wash-basin and counter was in the main room with sockets for shaving, etc. This room was similar to many motel style rooms I have stayed in the past. One thing I did notice in this hotel was that you could hear the plumbing system very loudly when people in other rooms had a shower or flushed the toilet. Someone was taking a shower in another room at 9pm on our first night and the sound of water in pipes was very obtrusive although it wasn't a regular thing we did notice this sound on a couple of occasions. This hotel is walking distance from the main sights in Hollywood. It takes about 20 minutes to walk to Hollywood/Vine where it starts to get interesting and about 35 minutes to Hollywood/Highland where most of the Hollywood action occurs. Of course you can always take the metro to these places quite easily. A day pass on the metro costs only 5 dollars. Most people in LA seem to drive everywhere and there are plenty of parking spaces at the hotel itself. The hotel does offer complimentary breakfast. It consisted of croissants, bread, coffee and juice which is available from a counter in the main office. There are tables and chairs by the poolside to eat breakfast. We didn't eat breakfast at the hotel as there were many other options around the area to choose from but it was good that it was offered. In conclusion, I think this hotel was comfortable, good value for money and in a convenient location.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "essex,england", "Title": "“Great place to stay”", "Author": "luckyamerica36", "ReviewID": "UR46841520", "Content": "We stayed at the Inn for 3 nights at the start of a two week holiday and were very pleased with what we found.The rooms are spacious and clean as was the bathroom.The beds are comfortable and everything worked fine.The only thing missing was a kettle to make your own coffee etc but that's not the end of the world.The guy that checked us in didn't say much but the the guy on the desk the following day was friendly and helpful with directions.For a decent meal check out the 101 Cafe on Franklin Ave,about a 5/10 min drive from the Inn,Ashley Jensen fron Ugly Betty was in there with her partner!All in all i would recommend the Inn for anyone looking for a clean and great value for money place to stay,i would use it again on my next trip to Hollywood.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Netherlands", "Title": "“Very nice hotel, friendly and good location”", "Author": "lusanne79", "ReviewID": "UR45359635", "Content": "We spend our first two days in this hotel. No palace but clean, friendly and good location. Free wireless internet was good and free parking!! Some notes: the airco did make noises and breakfast exciists only donuts, other sweet bread and little croissants. Overall it was really a good choice.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Honestly? Not That Bad.”", "Author": "PuffC", "ReviewID": "UR43710318", "Content": "Not a bad motel-style place. The rooms are pretty well used, and have definitely not been updated for a while. Our room was clean, and as well presented as possible. Has a nice little pool surrounded by rose bushes. Biggest downsides: the thin walls and the noise from other guests... While we were there, the hotel seemed to attract a party crowd, who were very loud at night. Next time I would rather save for a little longer, and stay somewhere nicer, but for West Hollywood on a budget, it was pretty decent. The free high speed internet was pretty decent, too.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Lytham St Anne's, United Kingdom", "Title": "“great value”", "Author": "EnglandAlan", "ReviewID": "UR43136875", "Content": "we had a very good time good points- location, close to metro, food shops(Ralph's has everything you could need), takeaways etc. Nice pool, good for cooling off in after sightseeing. Large comfortable rooms with fridge and microwave.Very efficient air-con.We were given early access to our room, on arrival which was appreciated. bad points- the bathroom plumbing, four of us in 2 rooms each had trouble with the plumbing (we'll leave it at that!!!!)", "Date": "September 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "East Sussex, UK", "Title": "“Good value - a great compromise in LA.”", "Author": "Ourarka", "ReviewID": "UR41534415", "Content": "LA can be very expensive, and very hard to find a good place. The Hollywood City Inn is a good choice if you want to combine value with location. It is a little rough round the edges, but perfectly clean and comfortable with a great pool area and a very helpful and friendly proprietor. Breakfast is simple ... but free! It is in the eastern section of West Hollywood, so unless you have good knowledge of the LA transport system you will need a car to get around. The nearest attraction is Hollywood Boulevard, which is probably just a little to far to be a walk away. That said, with a car nothing is more than 20-30 minutes drive away.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rotterdam", "Title": "“Best value in LA? Probably!”", "Author": "komytee", "ReviewID": "UR40876684", "Content": "I have stayed in this hotel/motel for 8 nights and I was really pleased with my stay. The hotel is conveniently located near Hollywood Blvd. There is a metro station (red line from North Hollywood to Union Station) just 3 minutes away. There are all kinds of bus stops on Hollywood Blvd, Western Ave and Sunset Blvd within walking distance (2 / 5 mins). The room was clean, but looked a bit dated. They were actually in the process of changing the window curtains to shutters, so they are definitely working on that. The room had everything I needed: a big comfortable bed, shower / bath, a small fridge, microwave and a TV with a lot of channels. Room was cleaned every day. I have seen 2 different guys at the front desk. The older one usually was there during breakfast and was a very nice guy. Speaking about the breakfast: croissants, donuts, cerea, milk, coffeel and orange juice were available at no extra charge. The other one didn't say a lot, but he checked me in the best room out there (2nd floor in the middle with view on pool), so no complains. There is a computer available in the \"lobby\". Free to use for 15 minutes at a time. There is a note saying that they charge you for 50 cent per page printed, but the older guy never charged me for anything. As said, there is a pool available which seems to be clean. I have never used it though. The neighborhood is not the prettiest, but I have never felt unsafe. There's always activity on Hollywood Blvd so I would imaging there is always someone to help you out if needed. There are a couple of small markets across the street for your fresh fruits or other daily needs. On Sunset Blvd (5 minutes walk) there are 2 large pharmacies, a big supermarket (Food for Less) and a McDonalds. On Hollywood Blvd there's a Starbucks, Quiznos Sub and a bank with ATM machine. This was one of the cheapest hotels I could find in LA, so no surprise I was very pleased overall. I would definitely recommend this place to anyone travelling to LA and looking for save some bucks for shopping.", "Date": "September 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Very good hotel!”", "Author": "Bazzeman", "ReviewID": "UR39257012", "Content": "Very good hotel with good service and clean rooms! Great location near Hollywood.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oxford, UK", "Title": "“Fab location and value for money!”", "Author": "MrStraightTalker", "ReviewID": "UR38320316", "Content": "I am recently back from a month of solo-travelling in California. As I was using public transport, location was an essential factor when choosing accommodation. Hollywood City Inn is a three minute walk from Hollywood/Western Metro station on the red line. It's $1.25 for a one way journey or $5.00 for a day pass. The Hollywood Greyhound bus station is just a 5-minute walk from Hollywood/Vine Metro station, which is just one stop up from Hollywood/Western. I enjoyed my first stay at this hotel, so booked another two nights, which were also my final nights of the trip. One of the rooms really needed light maintenance, especially in the bathroom, but it wasn't a big issue for me. The reception staff were friendly and provided a basic continental morning breakfast, as well as general advice about what to see in Hollywood. There's a computer with internet access that you can use for 15-minutes at a time. The swimming pool is fantastic and a great feature of the hotel. Overall, I would recommend staying at the Hollywood City Inn when visiting this part of town.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“A good location”", "Author": "holiday021", "ReviewID": "UR37507326", "Content": "The accommodation is in a good location to see all of the tourist attractions of Hollywood. Only a 20 minute walk to the Hollywood Walk of Fame, the Kodak Theatre and the Grauman's Chinese Theatre. Universal Studios is only a 15 minute drive away. The staff very pleasant and helpful. Altough the rates are very reasonable the rooms are very tired looking and in need of redecoration our room smelt of cigarette smoke , the bedding had cigarette burns in it. and the fridge was balanced with an ash tray underneath it.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Great hotel and great location”", "Author": "Gav1986", "ReviewID": "UR36661137", "Content": "Stayed at this hotel for a few nights, and it was great accomadation at a cheap price. Location was good - approx 30min walk to the Walk Of Fame, Hoolywood sign easily seen also. Room was big and spacious.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Good value”", "Author": "Little_Lebowski", "ReviewID": "UR36610937", "Content": "We were only spending a couple of nights in LA and wanted somewhere in a good location to make the most of the time we had. We were also working to a budget, and this was the only hotel we could find in the area within our price range that didn't sound too horrific. I wasn't entirely sure what to expect, and the front desk didn't inspire much confidence. It was rather bleak, and it seemed that we were an inconvenience to the lady at reception. Once we checked in, we made our way to the room, prepared for the worse. We needn't have worried. The room was large and clean, with plenty of storage area and a decent bathroom (although the toilet seemed to have a mind of its own when it comes to flushing!). We made use of the pool area once or twice, which was quite pleasant. The area felt safe enough, and was right next to the subway which made getting around a piece of cake. We got a code to use the internet, which wasn't all that speedy, but sufficient for e-mailing. Breakfast was included, if rather limited, but I didn't expect much more for the money. All-in-all, the grumpy staff aside, I'd definitely recommend this hotel for anyone wanting to stay in Hollywood working to a budget.", "Date": "August 3, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Rooms": "1", "Value": "3", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“One niter at Hollywood City Inn”", "Author": "Jimdo", "ReviewID": "UR35608415", "Content": "After reading several reviews commending the Hollywood City Inn, we decided to stay there during a one niter visit to LA to see a Dodger game. Checking in was smooth, the desk mgr was courteous and the room was clean, although slightly worn. There is a pool, which we didn't use and it appeared clean. There is a U-shaped building around the pool and a seperate 2-story rectangular building with parking around it - this is were our room was. When we returned from the game, we took a shower, watched tv a bit and turned in around 12:30. There was only 1 lamp in our room, in a corner, that you had to get out of bed to turn on or off. At this time I heard someone in the room above us walking around. I could hear every footsep as the floor/ceiling creaked. Also, when they flushed the toilet above, you could hear the water rushing thru the drain in our bathroom wall. About 2:30 am I was awoken by footsteps above me...about 10-12 trips back and forth and about 6 flushes of the toilet!! Also, a couple men having a brief conversation in the hallway outside my room...sounded like they were in our room!! About 5:30 am, more footsteps from above and more toilet flushing.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“For price, it is a 5 star hotel”", "Author": "Beau_and_Monique", "ReviewID": "UR31156202", "Content": "My wife and I have stayed in many hotels but the price you pay for the Hollywood City Inn, it is perfect given location. I am not sure why you would want to pay mega $$$ for a hotel unless you plan to stay in it most of the time. We found our room to be a nice size, clean and the maids cleaned every day. The guy at the help desk was very helpful and friendly, he helped us with buses etc. Free internet at the help desk. Continental breakfast - danish's, very sugary cereals, tea / coffee etc. We did not use the pool but it looked clean. You can either bus or walk to the main attractions (i.e chinese theatre) however we chose to walk - would probably be 6ish blocks or a 15 minute walk. All the restaurants are in this area and we caught a cab 1 night and it cost about $15. If you like modern Japanese food, I would highly recommend the Geisha House. We also caught a cab to the Viper Room and Rainbow Bar and it cost about $20 one way. I caught a bus to the Getty one day which is relatively easy to do (2 connections - 40 minutes) and my wife caught a bus to the Market. My wife did the dearly departed tour and highly recommends it. The area is fine although it is a big city and like ALL big cities, I would not recommend walking too far at night time if you dont know the area, we found it fine although can't say we walked too much at night time because we were tired from day time activities. As other writers have said, it is right on the cusp of Thai Town and the curries there are top quality (also, places like Burger King are in the area too). There is an authentic mexican restaurant across the road which was nice.", "Date": "May 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "camberley", "Title": "“Good Location, Good sized rooms, Good price, helpful front desk.”", "Author": "Lofty42", "ReviewID": "UR30812843", "Content": "Stayed here end of April and again in May 2009 no problems at all. metro close on corner of hollywood blvd 3$ and 3 stops to chinese theater, supermarket on the corner. Rooms ok microwave ,fridge, flat screen tv,The man on the day shift front desk was very helpful. If you want to eat close by there are a number of places close by on Sunset Blvd turn right out of hotel and second right onto the Blvd Dennys about 400 mtres along on the right. All in all an OK place.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Best Value you will find in Hollywood!!!!”", "Author": "NinaBelena", "ReviewID": "UR30767903", "Content": "Not sure why some folks have issues with this place? It's in a normal neighborhood (it's LA folks.), close to freeways, Hollywood Blvd, ralph's/walgreens/Food 4 Less (buy your alcohol here), and a ton of crazy nightclubs and Thai restaurants. There's free parking, free wifi in your room, and a swimming pool. We were greeted with a clean, simple room. The bathroom looked newly renovated, tiles and everything. Be prepared to walk 300 ft to Walgreen's if you forgot your soap, they are lacking that here; the store is open 24 hours in case you arrive in the middle of the night and want to smell good. The room also comes with a mediocre tv, microwave, and fridge (store alcohol here). A the best value if you don't mind listening to Frenchies sunbathe and smoke cigs all day :)", "Date": "May 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Great Value, great location, but be careful ...”", "Author": "lpred", "ReviewID": "UR30669907", "Content": "I traveled from France and stayed at the Hollywood City Inn for 4 nights. The location is great, I had a car and I also could enjoy the free parking The room was great, large, with micro Wave, free wifi and a fridge, but very dark. The Staff was Ok, don't expect a smile at the front desk, but they are helpful when you need them. I never knew there was a free breakfast ( I noticed it when I checked out), neither the website I used to book the room nor the front desk advised me when I checked in (I should have read the reviews more carefully I guess ...). Regarding the area ... I'm not easy to scare, and I am used to travel by myself through the US but I wouldn't have walked around the hotel by night ... also be careful of never leaving any belongings in your car, even for 5 minutes ... I know it's common sense, but 5 min was enough for somebody to break the window of my car and stealing my backpack in the parking lot of a nearby restaurant. Fortunatly I always keep my passeport and credit card with me, but still, spending 5 hours at the police station and at the rental company wasn't part of my vacation plan.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Europe", "Title": "“Average”", "Author": "TravellerBe", "ReviewID": "UR29446114", "Content": "We stayed in this motel for 5 nights. The location was good. However rooms were not so well cleaned and there was some problem with air conditioner. The air was not good/fresh in the room, once the conditioner would be turned on. The stuff was not very helpful. And we never received answers to our emails, that we sent later with some questions.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Italy", "Title": "“Good value, excellent location, room cleaning service not so great”", "Author": "krysss", "ReviewID": "UR29329075", "Content": "We stayed at the Hollywood City Inn for one week during April 2009, and found it very good location wise, the Metro Train line station and bus stops are within a couple of minutes walk. Room was quite spacious, the staff at reception is extremely available and helpful. What could be better is the cleaning service in the rooms, the cleaning ladies clearly only wiped the wc, the tub and the sink, made the bed, sprayed some deodorant, but that's all, maybe they swiped the bathroom floor (I say maybe since there was a small piece of toilet paper behind the wc on the first day, and it was still there when we left, we just left it there as a test). The carpet was absolutely NEVER cleaned once during our stay and must say it was quite dirty, my husband dared walking in the room for one night with thick white socks he used instead of slippers, and after one night only, they were completely black on the soles........ Beware, wear slippers in this hotel, but otherwise it is a good bargain.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "miami", "Title": "“Very Good Place to Stay at!!!”", "Author": "Barbara1973Miami", "ReviewID": "UR29228823", "Content": "I was a little bit scare about the bad reviews a couple a travelers left before but to be honest it all depends on your own expectations. For the price I got ($ 85 plus tax) I could not ask for more!! The place is very well located, the room was a good size and the bathroom was excellent as well, not to metion the shower, that was the best part. So,if you are a budget traveler and needs a clean, nice,not fancy place to stay at in LA, this is the place. Dont be afraid. Also the person in the front desk is very nice, his name is Paco!!! He is good with directions and information about the city.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Victoria", "Title": "“Loved it, will be back”", "Author": "jgls", "ReviewID": "UR28654879", "Content": "For what you are after, which is a central location to the Hollywood area and close to the transit (train and bus) this is perfect. It has a G8 pool, and is only half a block from the train (which is then 5 mins into the heart of Hollywood or 15 to Union Station). Just dump your stuff and go exploring. Two blocks the other way is a huge area of supermarkets and food (Panda express recommended). The brekky in the a.m. is just donuts and coffee - walk it off in Hollywood! I'm a single mum on a pension with a six year old. We felt totally safe, loved the idea of shower/bath arrangement, and the rooms were so cozy! We also went to Universal from here, got there in 15 mins by train. Always felt safe and comfortable, and protected! Friendly gang. Bed great! Thanks guys, will miss you.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Midlands", "Title": "“Excellent Value”", "Author": "Pacific.1", "ReviewID": "UR28411656", "Content": "Rooms were cleaned daily (sheets and towels) and the room was more than adequate for sleeping in with its comfortable beds. The decor is a little dated but the cleanliness compensates for this. The staff are courteous and helpful. The free breakfast is a bonus with tea/coffee donuts and cereal. The area felt perfectly safe to walk around in even at night. There is a large supermarket within a 5 min walk and the metro station about the same distance. Without transport there would not be many restaurants, sights within walking distance of the hotel as L.A is huge! I really liked the fact that the hotel is good value for money. The location could be an issue for those who want a hotel close to restaurants/nightlife to allow easy reach on foot although this didn't apply in my case. I would definitely stay again if I was to return to this part of L.A :)", "Date": "April 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "United Arab Emirates", "Title": "“Not going to try it once more!!!!”", "Author": "Rezeme", "ReviewID": "UR28372200", "Content": "I Stayed at this hotel for 5 nights in room 303. The room was small and WC was not clean enough. The building wa a bit old and you could easily get disturbed by other people walking on the second floor. At nights they do not answer your phones after 10 pm and there is no answering machine either. The location of the hotel is good; near metro and bus stops and it is usually a solo traveler or bed and space type of accomodation.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Dissapointed the second time round”", "Author": "Jada_7", "ReviewID": "UR27251390", "Content": "Weve stayed here twice and this time i found it quite dissapointing. Last time we stayed in a room in front of the pool but this time they moved us to the rooms by the car park. The rooms are quite big but there is hardly any lighting in there, for some reason US hotels have like 1 dim light!. The beds were really hard and i had a very sore back when i woke up. The bathroom is decent but the hot water is only average, 1 night i ended up with a very lukewarm bath. The wall are paperthin and you can hear everything that the next door neighbours are doing and saying, this kept us up quite a bit of the night we could hear everything they were saying and doing (if you get what i mean!) pretty disgusting really. The only reason we stay here is that its about 200 m from the bus stops and the train which is very handy to the city. Another good point is that they let you use the internet for about 15mins which is fantastic most places dont do this. Im not sure if i would stay again i defintely would prefer to be in the rooms by the pool not in the other area they put us in as we didnt have a problem with paperthin walls last time. Also they do have a fridge in the room which is great too. TV channels are pretty slim, it cant be full cable because in Vegas and SF we had a lot more channels than this place offered. The guys at the front desk were helpful and breakfast consisted of donuts, cereal, coffee, tea juice etc which is quite good considering its free. Overall a bit of a mixed review, its an ok place but not as good as our first visit there. The area is run down too (hollywood is not glam at all) but we never felt scared to walk around.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "BC", "Title": "“Excellent value! Would definitely stay here again!”", "Author": "carmen_bc", "ReviewID": "UR27006594", "Content": "I found this place on Trip Advisor and based on the price and good reviews, my partner and I decided to give it a chance. We were VERY happy with our decision. The location is great (if you have a car), the rooms were in very good condition, the free parking is great and the grounds/landscaping are lovely! The free breakfast is nothing to write home about but if you like donuts I guess it's great. The price (under 100 bucks) was incredible for what we got.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Ohio", "Title": "“The nicest hotel in Hollywood for the price! Would stay again.”", "Author": "Babychika211", "ReviewID": "UR25484140", "Content": "My boyfriend and I stayed here during my move to Los Angeles. It was much cheaper than the Orbit hotel and hostel, which I had stayed a few nights before. This place was great, the man and the desk was very friendly, the room was nice and had a mini fridge and was CLEAN!!! Nice small continental breakfast included. On the downside, the area is a bit shady (Hollywood isn't glamorous just so you know), we saw a man walking down the street in a hospital gown and I think someone was messing with our door in the night (room doors are outside). Parking wasn't the best, but I saw people parked their Lexus there so it couldn't have been that bad! Overall the best place for the price, was not disappointed!", "Date": "March 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cardigan, United Kingdom", "Title": "“Very good accommodation in Hollywood”", "Author": "snippetsnoppet", "ReviewID": "UR25278578", "Content": "My husband and I stayed in Hollywood City Inn for 4 nights in January 2009. LA is a bit of a minefield when it comes to selecting accommodation as all the sights are pretty well spread out, so no location is perfect. Whilst the accommodation was good, clean, tidy and serviced daily, we were disappointed with Hollywood itself which is a dump. All the trip advisor reports on LA say you need a car to get about, but we opted to make use of public transport (the underground system and buses) which we found excellent value and operated a frequent service. A day ticket is the best value. It takes about 30 mins to walk to the Hollywood sights (Hollywood&Highland Centre, Chinese Theatre) from Hollywood City Inn but quicker to get the underground which goes from just up the street from the Inn, 200 metres away. Eating out in the evenings within walking distance from the Inn was a mini-problem. There are stacks of Thai restaurants just along from the underground station - fine if you like Thai - but there wasn't much else available. We had a great steaks in the Saddle Ranch Chop House in West Hollywood. We got the bus to Santa Monica Beach (excellent breakfast at Jinky's cafe), hired bikes and rode from Santa Monica to Venice Beach, which was great fun. Also took the underground to Long Beach and to Downtown (El Pueblo worth a look, also Grand Central Market and the Walt Disney Concert Hall) The Farmers Market and The Grove great for shopping. Hollywood City Inn was a good base in a city where everything is so vast and spread out that it would be hard to pick one best location. Breakfast was included but all it comprised was an OK doughnut from a case and some filter coffee, tea or juice. Perhaps this is normal in the US though. The pool seemed just for decoration, it didn't look especially clean and I didn't see anyone using it the entire time we were there.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Balzan, Malta", "Title": "“Good Value and Location”", "Author": "remen", "ReviewID": "UR24526745", "Content": "If you're looking for somewhere decent to stay, within walking distance of Sunset Boulevard and the Walk of Fame at affordable prices then look no more. We stayed here for two nights, basically just using the hotel to wash and sleep. No real complaints, which is great for a place that's so cheap. We spotted some other hotels we had looked at online before booking and we're sure we made the right choice in staying here. Pros: Good location (decent neighbourhood too), Clean, Good doughnuts for breakfast, fast and free wifi. Cons: Rooms look a bit tired, staff could be a bit friendlier.", "Date": "February 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pittsburgh", "Title": "“Basic hotel with a good location”", "Author": "turkey2009", "ReviewID": "UR24009428", "Content": "We stayed here for 5 nights earlier this month. If you are looking for a place to stay to sleep, shower, eat, etc. this serves that. It isn't nothing fancy but it is clean. It is close to alot of stores such as walgreens, cvs, food for less and several others. It is about a 3-5 minute drive to the attractions in Hollywood such as the walk of fame and the Kodak theater and many more. It offers free internet service in the lobby and free donuts, cereal, and coffee every morning. The guys that worked in the office were nice. There is a small area for parking. It served its purpose for me. I would stay here again.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Good for one night stay”", "Author": "Staidthere", "ReviewID": "UR23147923", "Content": "We chose Hollywood City Hotel as a place to crash after a long flight. It was in a location near restaurants and all-night stores. There is a Thai grocery store directly across the street. We had room 205 on the second floor in a corner. There was no street noise because the window faced the courtyard. We arrived on a cold December night, and the hot air heater warmed up the room quickly. The room was inexpensive, and we did not expect very much. The towels were small and thin, and there was no tissue in the holder, the rack holding the towels was sloping 30 degrees because a support was broken, and the towel hook on the back of the bathroom door spun around 360 degrees. The bathtub was very slippery--thank goodness for the hold bar. The bed that we used was soft, and if you sat on the edge of the bed, you would slide off onto the floor. The night clerk, Paco, was very friendly and helpful. The free wi-fi and microwave worked, and there was a freezer in the refrigerator. The complimentary breakfast was donuts, coffee, and juice. We would probably stay there again in similar circumstances.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“The Best Value in LA”", "Author": "tobeginwith", "ReviewID": "UR22598807", "Content": "You will not get a better room in LA for under $90 than the Hollywood City Inn. Located in a so-so section of Hollywood (Western Ave near Sunset Blvd) this \"vintage\" motor inn is well kept and relatively quiet. Free wifi internet, free secure parking, complimentary continental breakfast, a classic kidney shaped pool, and a simple but clean room all add up to a great value.", "Date": "December 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Torquay, United Kingdom", "Title": "“Good value and great location!”", "Author": "Marianne78", "ReviewID": "UR22595754", "Content": "I stayed here afew weeks ago with some friends for 3 nights and i had no problems.very quiet area no noise at night,location is great as others have said,5 miins from a Starbucks and the nearest metro and shops.Free internet which is always good if you want to keep in touch with friends or family back home as i did,i couldn't do this at any other location i went to for the rest of my trip,so that's a bonus.Breakfast in the reception is good but i didn't get to try it.Overall a good place to stay if you want to explore LA and you just need your room to sleep/shower in.", "Date": "December 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great location - good value”", "Author": "KEMerk", "ReviewID": "UR22328661", "Content": "This hotel is easy to find for people not familiar with LA. The staff were friendly and helpful. A reasonable continental breakfast is provided and fast WiFi is also available for free. Rooms are a little old but comfortable and represent very good value for money.", "Date": "November 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Excellent location but a worn out look”", "Author": "DrRobert78", "ReviewID": "UR21900715", "Content": "We stayed at the Hollywood inn for 3 days and had only good experiences. The hotel has an old and worn down look to it. But when you see through that it is very clean and has a perfect location. Just 1 block from the metro and next to holywood boulevard. The neighbourhood has had it's best time but we had no problems with that. For breakfast...go to the Starbucks at Hollywood blvd. Parking is free. Good price/quality relation.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Absolutely loved out stay!”", "Author": "lilL81", "ReviewID": "UR21556357", "Content": "We really loved our stay, will book the hotel again if I go there the second time. Hollywood City Inn has a very nice swimming pool and is fantastic for having breakfast next to it. Location wise, very convenient, only 1 block away from Hollywood Western station. There is a Ralphs (supermarket) and Ross (clothing store, lots of cheap bargins, I bought 3 dresses & 2 jumpers) just opposite the station. Hotel room is very clean, there's airconditioning, TV, fridge & hair dryer in the room. Free wireless internet in the room as well as lobby, speed was good. The best part is the free breakfast, we loved our donuts, juice & cereal. There's coffee as well. We visited Universal Studio, only 3 stations away, very close. Remember to use the left exit of the station for shuttle bus (you need to cross the road as well), we went out the wrong exit, took us a while to find the shuttle to universal studio. We had 2 day pass for the price of 1 deal, only got 2 rides, but all the shows are fantastic, you'll need 2 days to finish all the shows if you don't wanna rush it. No need to buy the all you can eat pass, as the meal size is pretty big. We had burger for the first day & chinese for the second day's lunch. Hollywood itself was not very impressive, not much to do, recommend to book a movie star tour with starline, the old tour guide was very funny. Hotel staff was very helpful when we check-in, we got a map & direction. The guy on the night shift was very helpful too and booked shuttle bus for us when we left. We got ripped off by the taxi driver from airport to the hotel, cost us $79, if you book shuttle bus, will only cost $16 per person. Security wise, we didn't go out after 7pm since we don't have a car. Hotel security is pretty good, 2 locks on the door, bars on windows, very bright outdoor light, we feel quite safe staying there. In the station, there are some suspicious people hanging around, but we only catch train during the day, and to popular areas (hollywood highland & universal city), so didn't have any problems. During peak hours, there are plenty of people on the train, no safety issue really. Overall we had a very good stay, this hotel is very good value for money.", "Date": "November 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Essex - UK", "Title": "“Great”", "Author": "Sheppy10", "ReviewID": "UR20997523", "Content": "If you want a pleasant and friendly conversations with staff - this is not the place... If you want a clean , central location , with immediate access to subway - several shops etc ...this is the place. We stayed here with our 2 daughters (5 and 7) and had no concerns or encountered issues with other reports about the area (homeless folk etc) We walked around at night with no issues. If you leave them alone they will leave you alone....... Sub-Way just a few hundred metres away taking you to Universal Studios (3 stops) Walk of fame (2 stops) , and at $5 for a day pass is considerably cheaper than paying a company to take you. Room had fridge / Air Condition , but no Kettle etc. As this room was only a place to sleep we were more than happy with our accomodation. We didnt find the owners friendly and it appeared our questions were a chore to them (Even at check-in) As we were there 4 days we only encountered them a few times so this didnt cause much aggro. For the price Yes stay there , and use money you save on yourself in LA. Our savings went towards \"front of the Queue pass\" at universal (something I recommend...but thats another story) Pool was clean and spent some hours in it. Recommend the diner (turn left at subway , 100 yards) for your breakfasts. Caters for the locals and not ramped up prices. For Dinner at Sizzlers just another 300 yards further down the road in Thai town. 25 walk (uphill) to griffiths observatory. Downsides : On check out I asked to leave my bags in storage and women wanted to charge me $20 for 3 bags. After questioning this it immediately dropped to $15. Not sure why the charges as the bags dont eat anything. Thats anyother minor issue if you like inhouse breakfasts - This is only only donuts , and Coffee if you could ever find the pot with coffee in it. Although only 2 floors, there is no lift should you have heavy bags and be on the second floor. Softdrink machine available - dont ask for change unless you wish for a grunt in reply.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“loved the location of hollywood city inn”", "Author": "clonmelMelbourne", "ReviewID": "UR20964591", "Content": "great location,very helpful staff,rooms clean,tv microwave ect.we stayed at this hotel twice on our trip to usa,subway nearby,and good selection of reastarunts,would reccomend highly.oliver and sue,melbourne australia.", "Date": "October 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Super welcome”", "Author": "MB9191", "ReviewID": "UR19277304", "Content": "Very convenient hotel, 1.6 miles from Walk of Fame at reasonnable rate. Superstores at 300 m. The receptionist is very kind and ready to help you (he knows everything). There is a nice swimming pool where you can have your breakfast. Free parking A place I will go again if I come back to LA", "Date": "August 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Perfect stay”", "Author": "mylbou", "ReviewID": "UR17455953", "Content": "I wasn't sure about Hollywood City Inn before arriving to my room. We had a large and clean room, bathroom apears to be brand new, comfy bed, lunch area, microwave, frig, tv, wi-fi, and pool. All that you need to have a great stay in hollywood! Subway station on the corner of the street. Surrondings may not seems hi-class but are safe. Overall - perfect stay!", "Date": "July 2, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Central Coast California", "Title": "“The Price is Right, the neighorhood sketchy”", "Author": "labonvoyer", "ReviewID": "UR17381095", "Content": "My daughter and I went to LA last week. She went on line and found us this \"deal\". I read the reviews and most of them were positive. We were leaving from central Calif and so I made sure we arrived before dark. The overall experience was pleasant. The staff were very nice. We had asked to stay close to the office since we were 2 women traveling alone. When we got there we were given a room in their 2nd newer building which is a little further from the office. They immediately change our room upon our request. The breakfast was cereal, coffee and pastries. The Metro is only 1 block north. That would probably be a great way to travel as long as you arrived back before dark-I wouldn't want to walk even that 1 block after dark. We went to see \"Wicked\" and arrived back at 11:30. We managed to squeeze into the last parking spot. A car arrived just after we did. I would not want to park on the street after dark for my car and my own safety. Perhaps they have some way of parking your car off site for you if this happens-it doesn't seem there are enough parking spaces if they are booked to capacity. The best things about this motel are the price, cleanliness, staff, beautiful roses around the pool and accessabilty of areas of interest and easy highway access. Early morning walks: both days I grabbed a Starbucks cappucino and went for a walk. I went south toward Sunset Blvd. I went about 0.5 miles. The further I went, the seedier it got with homeless and tagging etc. However, I went North on Western Ave and found the beautiful neighborhood of Los Feliz and enjoyed looking at the homes and gardens. As I further ventured north I found Griffith Park and walked in there. It was beautiful. It was hard to believe that in less than a mile you go from a seedy run down area to a beautiful neighborhood and park setting. So all in all, for the price, I probably would stay there again. It felt safe enough during the day to walk north and into the area called Thai Town. Again walking south down Western Ave and onto Sunset Blvd is a little sketchy and there really isn't anything to see that way.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Ok place to stay”", "Author": "biting", "ReviewID": "UR16107345", "Content": "Ok place to stay. Paid about US$70+ per night. Bedsheets were clean. Towels were clean. Looks like a family business to me. The guy who manages the place was quite friendly. The lady, probably his wife, wasn't very friendly. She even tried to make me pay for WIFI which was listed as free in their website. Eventually I talked to the guy and he gave me the user id and password free. Comes with air con and heater. Ample parking. Comes with breakfast, but the breakfast was nothing much. Just some juices, coffee and donuts. But it was sufficient for me for the morning.", "Date": "May 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Great for Price”", "Author": "timgrooters", "ReviewID": "UR14689802", "Content": "If you want to visit the Hollywood area, this is the one. I is the most inexpensive of all of the \"chain\" motels. The room was large and very modern and clean. it is 1/2 block from Hollywood Blvd and then just a few block to the main part of Hollywood. If you go west on Hollywood to Gower and then to the North, you can get some nice photos of the sign. There are lots of places to stop just a couple of blocks from the Inn (Walgreens, etc) if you need any incidentals. It is located in the old part of Hollywood but the area is clean. Remember, the touristy part of Hollywood is also very old. Have already booked a couple of rooms here for August when we are taking our daughters for some site seeing.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North of Jamaica", "Title": "“No Complaints!!”", "Author": "shawnie", "ReviewID": "UR11109729", "Content": "You know what?? This place may not be a 5 star, 4 star or even a 3 star motel but it serves its purpose!! Its a good place to drop your bags and lay your head. Ya, the furniture may not be the best and is a little outdated but for the price you pay to stay here (I got a good deal anyway) it works!! Its central location right off Hollywood Blvd is close to alot if not most attractions. 5 mins to Burbank, 5-10 mins to Universal Studios (depending on traffic) and the Chinese Theatre on Hollywood Blvd is only 5 mins as well. As for cleaniness, I found it to be good!! Room was very clean. Hallways were well kept. The pool area was nice and the staff at the front desk were very helpful. If your someone who feels the need for the little extras or expects to be pampered this is not the place for you. It works basically as a good base while exploring the LA. As for the location. Many have said the area is shady and unsafe but I found it to be perfectly fine!! No worries or problems when out during the day or at night...I'll definitely consider this place when in LA again", "Date": "November 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Mateo", "Title": "“Don't stay here...”", "Author": "monkeySanMateo", "ReviewID": "UR10621398", "Content": "Date: September 25-27 2007 Cockroach Motel I will make this short and to the pointâ€¦we only stayed here for one night out of our 2-night reservation. The first night seemed to be OK, even though the condition of the room was less than to be desired. The furniture was in very bad condition, run down and falling apartâ€¦cheapest bathroom towels Iâ€™ve ever had to useâ€¦too small and too thin. Rug was dirty and stained. This hotel is on the east side of Hollywoodâ€¦what does that tell ya?! The second night we came homeâ€¦only to find a GIANT cockroach on the bathroom floor, and another in the room next door that we also paid for! This place needs to be fumigatedâ€¦these are unsatisfactory conditions, and this place should not be recommended by any of the on-line travel services!", "Date": "November 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Grimsby, England", "Title": "“Not as Bad as Reviewed”", "Author": "DaveG130", "ReviewID": "UR10467202", "Content": "We booked 5 nights as part of our American/Honeymoon tour after getting married in Vegas. We read the reviews and decided to give it a go anyway. Yes the hotel is like a travelodge , but its a good price. Yes it is quite a way from most of the main area And Yes we were warned by our shuttle driver not to walk around here at night , which really made us feel like we'd made a mistake. But , it was ideal place to stay for us . The underground subway is 1 block away ,the bus route is on the same corner and with a full day pass for both at $5 a great base . We saw no hassle , gangs , druggies ,prostitutes or any reason to be afraid . Used the buses to get everywhere or the Underground to get directly to Universal City. The room was cleaned every day , clean towels and sheets, the room (205) was quiet ,secure, 65 tv channels , microwave and fridge , what else could you need. On the whole a budget room with excellent access to attractions with a quiet clean room . Would stay here if ever to visit L.A. again.", "Date": "October 31, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Bedford, England", "Title": "“good base camp”", "Author": "A TripAdvisor Member", "ReviewID": "UR5147162", "Content": "After reading some of the reviews about this hotel my party and i were unsure if we had made the right decision, but as we only needed it for five days as a base camp we went ahead with it. The room was of a good size and was welcoming and clean which is the most important thing i look for in a hotel room. I disagre with some of the other comments made by previous guests. The room was cleaned throughly every day and we had new toiletries and towels everyday, when we asked for extra pillows they were more than happy to give us some. The staff were very friendly and one man in particular on reception was very helpful, when it came to needing local information. When we were there they even had new beds put in! so they are not hard anymore although i preferred the old ones! As a building it is a little dated and could do with a few repairs and its not in the nicest part of town but after a couple of days you get to know the area and start to feel more comfortable, still wouldn't walk around late at night but then i wouldn't do that in England either! Being a motel style if there is noise at night you will hear it as the walls are quite thin if you are a light sleeper but i found the noise of the other guests didn't go on that long when it was made i guess it depends on whose staying. Overall if you just need a basic place to stay then this would suit, if your used to luxury then i would look somewhere else! The hotel itself has obviously read previous reviews and has acted upon them to make this place better so hats off to them!", "Date": "May 17, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "california", "Title": "“The Hotel of Horrors”", "Author": "Disneylandfan90", "ReviewID": "UR5043283", "Content": "Well to start i really liked the service that I got from the Hotels staff, my review though is on the hotel my family and I stayed at which was Hollywood city inn in Hollywood, California the staff at the hotel were rude and a few of the other guest were aloud to drink outside of their rooms with their room doors wide open which had music blasting out of them past 10 o' clock, clothes and comforters were hung from bannisters, and it was located in a area that didnt look so trusting or pleasant, i would not reccommend this hotel to anybody.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Birmingham, AL", "Title": "“Not staying here again!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4326261", "Content": "Our group arrived at two different times, so our roommates were there a few hours earlier than my sister and I. So by the time we got there it was one in the morning. We called our roommates, but they had had a long day and did not wake up when we called, so my sister went to the front desk and asked the attendant for a key (we had proper documents and they were notified that we were coming) and he wouldn't give her a key because he said that he only has one key for every room. So, we just had to fend for ourselves. So by that time I had taken all of our luggage out and was waiting by the door to get in, but when my sister came out, she said he wouldn't give us a key so we just waited by the car and the door trying to wait for someone to come out of the doors to let us in. So we were just standing out there (two girls) in this part of town which looked dangerous with suspicious people walking around looking at us ( I wouldn't recommend walking in this area at night). We tried pulling on one of the doors of the entrance to the rooms, but it was locked. Then my sister went to the other entrance door and luckily it was opened and she went in and opened the other door where I was standing and we were able to get into the hallway were the rooms were located. So, we knocked on the door and our roommates were able to hear us and let us in, but they were half sleep. We were doing things the whole day and we were all extremely tired, so my sister and I went to sleep around 2am and were extremely tired. But by 3:30am, we heard a knock at our door. At first I thought it was next door or I had imagined it because we were all \"knocked out\" sleep. But the knocking kept occurring and I rose up and one of the other girls with us got out of bed and opened the door and immediately closed and locked it because she thought it was either me or my sister, but quickly realized that we were already there. Then this man started whispering \"let me in\", \"open the door\", and started making rhythmical knocks at the door. So my roommate yelled at him from behind the door to leave and he has the wrong room. Then it stopped and we all went back to sleep nervously. Then about 10 mins later, the knocking came back and he tried to open the door because I saw the door knob being turned and we all were very scared by now, so we called the front desk and the told the attendant what was happening and he said that he will take care of it. So we laid down again but the strange man kept talking and knocking at the door trying to open it for about 5+ minutes. We were so scared we didn't know what to do, but keep telling him to go away. But we were so tired we could think clearly like call the police. We weren't going to open the door and confront him so he could come inside our room, we didn't know if he was alone or not and it was just us girls; so we called the front desk again and my sister said \"please help us, the man is still at the door and is trying to come in!\" The attendant sounded annoyed and told her \"weren't you expecting him\" and of course she yelled \"of course not!! Why would we call you to help us, if we knew him!\", so the attendant said \"okay, I will take care of him, but don't call back. \" We were very annoyed by this and then my other roommate went to the door and said, \"if you don't leave, we will call the police!\" Then he stopped whispering and said \"Oh, sorry I thought this was Mike\" or something of that nature, but I am sure he had heard us clearly the first couple of times and then he left. But we were so scared, we didn't open the door to look if he was gone. That morning, we were still frighten to open the door to leave. Luckily, we were only staying there one night and we will never stay there again!! They have no concern for the safety of their customers and the room and location isn't that great either. GO SOMEWHERE ELSE!!!", "Date": "January 5, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Purmerend, The Netherlands", "Title": "“Not worth your money”", "Author": "kevertje", "ReviewID": "UR3457674", "Content": "We stayed one night in this hotel but when we can choose again we will spend some extra dollars somewhere else. The people look tired of helping their customers. When we received the keys of our room we needed to return them directly because there was water coming in the room from the roof. The second room looked better but the door was difficult to lock. With some force we made it. We payed $52,04 dollar for one night but you'd better check other hotels in the area.", "Date": "May 10, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Sweden", "Title": "“continental breakfast??????”", "Author": "A TripAdvisor Member", "ReviewID": "UR3329077", "Content": "This hotel are not made for children,,itÂ´s only coffee to drink for breakfast!!!!", "Date": "April 4, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Totally Misrepresented”", "Author": "A TripAdvisor Member", "ReviewID": "UR2961863", "Content": "Ok so the pictures on the website show this cute quaint little hotel with nice soft beds and flowing curtains. That is the BIGGEST MISRESPRESENTATION IMAGINABLE. The hotel is generally clean (which is why I was able to deal with it for three nights). However, it doesn't have enough parking, the beds are slightly better than sleeping on the floor, and I think that the last time the place was updated was in the 80's. They didn't even have extra pillows. If you are looking for a super cheap place near Hollywood to crash for a night this is the place. If you are looking for something like what is shown in the photos don't go here.", "Date": "December 29, 2004"}], "HotelInfo": {"Name": "Hollywood City Inn", "HotelURL": "/ShowUserReviews-g32655-d502971-Reviews-Hollywood_City_Inn-Los_Angeles_California.html", "Price": "$85 - $403*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1615 N. Western Ave.</span>, <span class=\"extended-address\">Hollywood</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90027-4807</span></span> </span></span></address>", "HotelID": "502971", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/27/43/27438658f3d840516a48ed4cd0518e023large.jpg"}}