{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Dodgy area, but ok for a budget traveler not expecting too much”", "Author": "YiliKR", "ReviewID": "UR125479570", "Content": "Very basic budget hotel with a small (normal singapore size) room and older basic furniture. We paid S$65 for the night on a layover which is pretty cheap for Singapore standards but it's further from the main sights and 10-15min walk from the closest MRT. The street the hotel is on is pretty dodgy with what looks like a street full of brothels and on the main room there are lots of girls standing around. Pros: Service at reception was pretty good, price is decent for Singapore standards as long as you know you get what you pay for (good for budget travelers). Cons: Hotel is in the red light district which made us question the cleanliness of the previous room patrons on the rubber mattress and thin (though looked and felt clean) sheets on the bed. Towels in the bathroom were pretty used and new ones should be purchased, and the bathroom is old and could be a little cleaner. Room smelt a little smokey too. Overall ok for a budget traveler not expecting too much.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not bad.”", "Author": "Xmelvzx", "ReviewID": "UR123630023", "Content": "I would say, this hotel is quite alright for the budget traveller. The location is not bad either, just a stone's throw away from a bus stop. About 15 mins walk from the mrt. Nice staff, our room is ok, very clean and comfy. Fast wifi connection. Shower room is not bad, hot water works. some molds in the tiles but overall is ok for an average hotel.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Smelly room!”", "Author": "Aida2003", "ReviewID": "UR123339680", "Content": "Me and my BF stayed in the hotel during New Year period. Room was quite small, but for the price we had paid size is okay. Bedsheets were clean, but not the towels. Tea, coffee and small teapot are available. The most disappointing was the smelly bathroom. Very smelly! I don't know may be it was just our room. All our stuff became smelly, even when we returned home our stuff was still stinky.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“budget place, not very clean, noisy surroundings”", "Author": "trubo4ka", "ReviewID": "UR123139316", "Content": "+ Good price and not that far from the city center (not more than 10 SG dollars by taxi and ~22 SGD to the airport), MRT station and the bus stop are also in 5-7 min walk. - Quite dirty, poorly furnished, old, used-to-be-white towels and one-off pillowcase. and which i disliked most of all - insects! cockroaches in the room((", "Date": "January 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Branded budget in red light zone”", "Author": "timlcv428", "ReviewID": "UR119511795", "Content": "Overall is OK. Just I don't like their bed and pillows. The pillows are extremely soft.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Disgusting”", "Author": "aguyfromaustralia", "ReviewID": "UR119106826", "Content": "Stayed 3 nights, room smelt terrible and previous occupants hair still in shower recess. It is near an MRT station but that is the only thing it has going for it. It is oppisite a substantial number of brothels and the hotel is often used for their services.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "kuching,sarawak, malaysia", "Title": "“Budget Hotel, Good for Budget Traveller”", "Author": "john ha t", "ReviewID": "UR118341542", "Content": "Small and tidy room. 10 to 15 minutes walk to aljunied station. Great location as you can find lot of food stall around. Not suitable for family as it located in red light district. Is good for those who have limited budget.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Jakarta", "Title": "“We ll be back”", "Author": "The J", "ReviewID": "UR116878577", "Content": "Its small, but in a very good location. Room was ok, tv kind a small, but still no time to enjoy , too much time on the outdoor already. Since i got on the 8th floor, so the noise from the generator on the roof was kinda noisy.", "Date": "August 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth, United Kingdom", "Title": "“Good for an airport stopover”", "Author": "acjkt", "ReviewID": "UR110309551", "Content": "I had a late arrival and an early departure from Singapore so not wanting to spend big bucks, I elected to stay here. It's a 10 minute walk from Aljunied MRT station, less than SGD$2 in fares each way and is simple and practical if you aren't looking for all the bells and whistles of a top end hotel. There are a lot of cheap eating places within walking distance. If you are in transit, it's probably a worthwhile option. If you have luggage, and don't want to lug it to the hotel, use the storage facility at Changi Airport, SGD$7 for 24 hours and less than the taxi cost.", "Date": "May 29, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "pasay", "Title": "“Good but not impressive”", "Author": "ilovebalicasag", "ReviewID": "UR94564684", "Content": "We stayed in this hotel for three nights. Staffs are nice and cheerful. Room is intended for sleeping only. Bedsheet is clean with 3 layered beddings. there is complimentary coffee but it taste like coffee tea, they provided electric kettle but its dirty and requires cleaning. They provided one bottled water (so we need to share). No slippers provided for guest. Television is old without remote controls channels not exceeded to 10 channels. Not well lit. There are three hangers in open cabinets which you cannot remove. They provide one trashbin and that is located in dresser, what about toilets? toiletries are toothbrush, soap&shampoo in one liquid, & comb. There are molds around the sink and bathroom is small. Hot and cold water function well and pressure is okay. Our door is exactly in front of the door's opposite room. As I open my door I saw other guest room with an open door wearing only short and a very messy room. (quite embarrassing) Good to traveler who spends all day outside hotel and only there to sleep.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Never, ever again!”", "Author": "sylvadianu", "ReviewID": "UR91580688", "Content": "We were in Singapore for two nights - on our way to Vietnam - shortly after the Qantas A380 saga. Arriving at the airport we enquired for a mid-range budget hotel only to find out most hotels were busy with guests stranded as a result of Qantas problems. So the only affordable hotel was Hotel 81 - Star. At SGD70 per night for a double room, it sounded reasonable and we booked for 2 nights. We were advised the money was non-refundable should we change our minds. This should have sounded alarm bells but we were tired after a long-haul flight and pleased to have found a hotel after all. When we gave the hotel name and address to the taxi driver he started laughing and asked why were we going there. Not a good omen. It turned out the hotel is based in Geylang, the red-light district. We were received by a grumpy receptionist who gave us our key and advised that the money we paid for 2 nights were non-refundable. On the way to the room, we noticed signs in the lifts advising patrons to inform reception of any cars left parked outside in order to avoid clamping. Why would anyone take their car and stay at a hotel we wondered? Why, this was a hotel where locals came with working girls for a couple of hours, had their bit of fun and then went back to their wives and kids. Lovely. The room was about the size of a shoe-box, with beds with plastic mattresses (so they don't get stained, of course - yuck!!!). All night long we heard customers coming and going, the lovely click-clack of high-heeled shoes, the laugher of the girls... The second night we had the pleasure of hearing our next-door neighbour doing the deed - over and over again. Needless to say, we looked into moving to another hotel, at the peril of losing our money for the 2nd night in Hotel 81-Star. But we couldn't find anything under SGD240 and it felt like too much money, especially that we were at the beginning of our holidays. On the morning we left, the staff even refused to call a cab for us. They said it'd cost us SGD5 for the service. Lovely!!! So we walked, found a cab - in all fairness we found it pretty quickly - and never looked back. Singapore is interesting, but it doesn't have a patch on Saigon or Bangkok. But that's another story, of course. The only positive thing was the location of this hotel - about 10-15 min away from the MRT train station, and about 4 stops away from the centre. Unless you're a single guy, looking for a bit of fun (paid for, of course), don't go to any of the Hotel 81 branches. Pay more and stay in a decent hotel or don't bother going to Singapore at all.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "malaysia", "Title": "“Expect the unexpected!”", "Author": "kopibreak", "ReviewID": "UR91099163", "Content": "Location - good Room - small and bugs problem out of control Try to avoid it as this hotel is in the middle if red light district! Almost forgot to remind you,the room comes with complementary baby cockroaches !", "Date": "December 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Just basic”", "Author": "Geop26", "ReviewID": "UR89005493", "Content": "We spent 2 nights at Hotel 81 Star. The room was fine, clean and price was reasonable. Staff was friendly and helpful. However, we saw a lady (Jessica) not friendly and she seemed not happy with her work. Manager should teach her how to deal with guests politely.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Berlin, Germany", "Title": "“Good for sleep and that's all”", "Author": "podongiiger", "ReviewID": "UR88201778", "Content": "We stayed at this hotel for 3 nights and felt Ok of the price. Room was small and not really comfortable. No Internet and no breakfast and even not mini bar in the room. Howvever the price was reasonable and the location was not very bad.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dirty, noisy, smelly, STAY CLEAR..”", "Author": "Horatio061", "ReviewID": "UR81730528", "Content": "This hotel is the worst hotel I have ever stayed in. The room was small and dirty after showering my feet picked up dirt from the floor, the room had a strange smell as did the whole hotel after discussing it with colleagues we all agreed it was pee. A colleague arrived very late 4 am from KL after a quick shower he got into his bed, he felt a strange cold sticky mess in the bed, yes you guessed it. He took another shower and waited outside untill he could get a taxi to another hotel. This hotel is slam in the middle of the busiest of red light areas.. and rooms are let out by the hour !!! Our team (GP weekend ) said this was the only hotel availible.. Fortunately no food was served at the hotel and breakfast was taken downtown. Please do not think of staying at this hotel with your wife unless you are looking for a divorce", "Date": "October 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Beijing, China", "Title": "“A Good Budget Place”", "Author": "knickherboots", "ReviewID": "UR75585881", "Content": "This place gets almost everything right, and does so at a great price. My son (11) and I stayed in a twin room for five nights. Check-in was quick and hassle-free. The room was small, but quite clean. People at the front desk were friendly and professional, and let us store our bags for the day when we checked out, which was convenient. They have plenty of security cameras, so we never felt unsafe. One nice thing was that everything worked: AC, everything in the bathroom, water pot, TV (not many channels, though). On the downside, the naugahyde mattresses are only covered by a single bedsheet, which makes them a bit uncomfortable. And a few roaches showed up, but it wasn't an invasion or anything. It's a great location: only about ten minutes by foot to the Aljunied MRT station. Also, there are plenty of decent restaurants nearby where you can get a meal that is quick, tasty, and cheap--certainly better than most hotel breakfasts. Yes, there are all sorts of brothels on this street, which is probably one reason why the hotel is so inexpensive. But everybody we saw acted reasonably. There wasn't any drunkeness, and the soliciting on the street (which I think is illegal) is quite low key. (With my kid in tow, I was never approached.) And our room was quiet at night. I would not hesitate to stay here again.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sri Lanka", "Title": "“Good for sleeping in the night..get out for the rest!”", "Author": "Roshan_Withanage", "ReviewID": "UR70715263", "Content": "Very basic hotel. u cannot expect a lot for 50 USD when u book online via booking.com. Bit of a walk to the nearest MRT so its not practical to walk during the day time when it hot. no internet, no room service, very small bath room with shower next to commode. cheap food out side on the top of the road. heart of the red light district. they don't bother u if u don't pay attention to them. NOT suitable for families with kids. but okay if u want to manage with ur partner just for 1 to 3 nights on a shoe string budget.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Budget Hotel, sufficient for stay; great location”", "Author": "scnuf", "ReviewID": "UR65973850", "Content": "Truly budget hotel: no meals, small room and S$70 indeed is one of the cheapest hotel you can find in singapore. The room is small though comfortable with TV set. It has great location, as it situated right in the middle of S'pore red light district! and there are most famous local food stores in the regions.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bacolod City, Philippines", "Title": "“bare bones budget”", "Author": "BiznessViajero", "ReviewID": "UR65351592", "Content": "for the budget traveller. Located near the fringes of the city and very far from MRT aljuneid station. Bus stop is closer although wait times may be long. Located in central part of Red Light District. The area is seedy, but actually feels safe. Very well lit surroundings. Can be difficult to locate first time around as there are many Hotel 81s in the area. NO INTERNET in hotel. There is no hotel cafeteria, but there are many, many good Hawker stands to eat nearby. Room is cramped, there is no shower stall. The whole bathroom gets wet when you take a shower. Pillow cases are made of disposable material. Frequented by \"short-time couples\" and budget travellers alike. Front desk has good command of English and was helpful in giving directions. Limited English stations on TV. HBO but no CNN. Make sure to take Hotel card for use in communicating with taxi or bus drivers.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Recommended.”", "Author": "heejennwei", "ReviewID": "UR64699820", "Content": "the room was better than i expected. pretty big for a fair price. despite the unfriendly receptionist, all are good. Room is not extremely clean as we see in some 4 stars hotel, but it was acceptable. it's just 8 min walk to Aljunied Station, darn convenient! despite the hookers around the area, it's okay.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "sofia", "Title": "“A low budget decent hotel”", "Author": "goodpoint10", "ReviewID": "UR57172048", "Content": "I say there is no need to pay so much when it is possible to find wonderful accommodation for a much lower price. Hotel 81 Star is the best example for a low budget decent hotel. I booked there a double room for about 30$ a night (in easy click travel web site), can you believe it? I couldn't. I thought I was stupid to book it but it was absolutely fine- clean, tidy, and well kept. The service too was o.k.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“A good choice”", "Author": "Matteus T", "ReviewID": "UR53680403", "Content": "We stayed 6 nights, Dec. 2009 on our way to Malaysia and Thailand. We are very satisfied with our choice: cheap, clean, very good service, many eateries nearby and the bus stop is just a few steps away. No hookers or similar inside the hotel, although the building is surrounded by them. The building and the interiors are a bit older but clean. The sheets are very clean. The staff is very service oriented and helpful, better than many 5 star hotels I have seen in Asia. Complains: The aircon is too noisy and cold. But you can adjust it by the control panel. We didn’t know that first night.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“clean, great value accomodation, helpful staff”", "Author": "TjanWiejaya", "ReviewID": "UR52728807", "Content": "me and my mom's first visit to singapore, check in was less than 5 minutes. hassle free even though i booked via Agoda. everything was worthy with the rates. if you need accommodation only to good sleep at nite and take a bath during your visit in Singapore before you start the sightseeing after a warm climate of singapore, nothing fancy. this hotel accommodates all that. clean room, aircon works and water heater works perfectly. i know some write bad reviews regarding its location in red light district of singapore. but that didnt happen to me during my stay. the one small thing missing is the hanger in the cupboard, it was broken. even though the last nite the fire alarm rang 3.30 in the morning (quite annoying). but the helpful staff kind of smooth the incident away. 5 mins walk from no sign board seafood (very famous, but for my indonesian taste, it was not excellent, just okay), 1 min walk from 24hr food stalls, 10 mins walk from aljunied train station, 2 mins walk from bus stop.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "West Australia", "Title": "“Brothel”", "Author": "WoodyWestAustralia", "ReviewID": "UR20863254", "Content": "I stayed at this establishment for several nights, first night on floor 7 and the subsequent night on floor 6. Despite asking for a quiet room the corridor was noisy from 10pm through to the early hours of the following morning. After very little sleep that night I complained about the noise level and that's when it became obvious that the hotel is being used as a brothel. The noise level on the 6th floor was more tolerable (apparently the lady working on that floor doesn't go out so much according to the front desk). The area surrounding the hotel is interesting at best, and really not suitable for anyone other then a man. While prostitution may be legal in Singapore I think it's unreasonable for a hotel to subject its guests to the activities of a brothel.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "london", "Title": "“small but clean”", "Author": "milkbottletravels", "ReviewID": "UR17201260", "Content": "The hotel 81 star is located in the red light district of singapore although it is not on the worst street and you dont have hookers outside the hotel door as is the case with some of the hotel 81 chain. You will see hookers coming and going from the hotel so its probably not best if traveling with the family or anyone who is a bit prudish. The rooms are small but clean and have hot showers and cable TV and sheets and towels are changed every day. There is a number 7 bus that runs from the end of the street which takes you direct into Singapore centre and only costs $1.30. There aren't that many good places to eat in this area but at $70 per night ($80 at weekends) it is pretty good value at Singapore prices. We would stay here again but only for a couple of nights, definatley not for a long term stay.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Jakarta", "Title": "“Fine for the Price”", "Author": "nxf83", "ReviewID": "UR16423546", "Content": "For $45 a night on Agoda.com (including taxes and fees), this hotel was one of the cheapest in Singapore. As other reviews have mentioned, it's located in the red light district where prostitution is legal. The hotel rooms are very small, but for the price, I wouldn't have expected anything bigger. The room is not significantly larger than the bed. The bathroom is small, but clean. The shower is one of those that doesn't have a curtain or anything separating it from the rest of the bathroom, so the water does get all over the bathroom floor. It's because of this that I think the room would be uncomfortable for two people to share, because you have to dry off the floor and everything before anyone else can go in there and it's not big enough to change clothes in the bathroom after you shower. For a single person, it was fine. For two people sharing a room, I would recommend checking out the other hotels in this area (they are all similarly priced) to see if some of them have separate showers with curtains. The hotel staff were friendly enough, and I only saw one prostitute in the hotel the three days I was there. There were plenty of people staying in the hotel, but I found that the vast majority of them were just normal budget travelers and families trying to save some money. I never heard any of *that* kind of noise, but I had preemptively turned the TV way up the whole time I was in the room because of the other reviews on here. The Geylang area is great in the daytime. I felt safe walking around as a single woman. It's less than ten minutes to walk to the Aljunied MRT train station, and there are tons of popular hawker centers in the area where you can get good quality Chinese and Indian food for less than $4 a meal. Nighttime in this area is a different story, and sadly, it's a relatively small number of people who ruin it for everyone else. Even at night, most of the people here are just normal people who are eating or going about their normal business. There are quite a few prostitutes, but I found that their tactic for attracting business is to just dress in a way that makes it clear they're prostitutes and wait for men to approach them. They don't go around harassing people unwantedly, and they seem to just stay in small groups talking to each other until they are approached. What really bothered me was the sleazy, sleazy men in this area, who are a hundred times more obnoxious than the hookers and WILL approach strangers. Apparently it's not clear to some men that a red light district means you can legally get hookers. It doesn't mean you can pay ANYONE for sex, and these men will not hesitate to proposition a random tourist. I was dressed very conservatively, in jeans, flip flops, and an Adidas t-shirt, carrying shopping bags and looking VERY much like a tourist. As I was crossing a busy street in Geylang, an older man ogled me in a way that made me very uncomfortable. He kept walking next to me and staring. I sternly told him to leave me alone, and he took that as his cue to offer me $100. I made a scene in hopes that he'd go away. I yelled, \"GET AWAY FROM ME! I AM NOT A PROSTITUTE! YOU'RE DISGUSTING!\" He kept walking near me, so I ran into a 7-11, hoping he'd just keep walking and forget about me. I came out of the store ten minutes later, and he was still there and tried to talk to me again. I yelled again and told him to leave me alone, and at that point he realized that I was serious. It was this experience that will make me not stay in this area again. Next time, I'll just pay extra and stay in a better area. It's a shame, because the hotel itself was fine, and the vast majority of people in this area were nice and normal. I guess I would only recommend this hotel to men traveling alone, friends, couples on a tight budget, or families whose children are too young to understand what prostitution is.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Nerw Zealand", "Title": "“Good value in Singapore”", "Author": "MrFo5", "ReviewID": "UR15452164", "Content": "Good location for us. Easy access from the airport and good local markets bazaars etc and an easy taxi ride to Orchard Rd and the railway station. Check in staff not very friendly when we arrived but the room was clean and all we wanted was a good bed - and it was a very good bed. Lots of hot water and good local shops - not shopping malls but local food shops for groceries, fruit and cooked foods. This hotel is in the red light area though and we had quite a busy flow of traffic and various grunts, squeals and nightly sounds. We would probably not go back because of this but overall it was a safe, clean,well organised hotel.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth Australia", "Title": "“For the price,Great!”", "Author": "TJEmerson", "ReviewID": "UR7405357", "Content": "Stayed one night in transit. It is close to Airport. It is very clean. For Singapore it is very cheap. I would recommend for a single traveller as it is in the red light district. I arrived late and left early so did not see much outside. I have stayed in much worse places in Singapore for double the price.", "Date": "April 20, 2007"}], "HotelInfo": {"Name": "Hotel 81 - Star", "HotelURL": "/ShowUserReviews-g294265-d505804-Reviews-Hotel_81_Star-Singapore.html", "Price": "$50 - $71*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">31 Lorong 18 Geylang</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">398828</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "505804", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c6/17/c6177f1c41cbf017682a9f4c60ec92151large.jpg"}}