{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Cheap”", "Author": "barbaraanne6", "ReviewID": "UR127503933", "Content": "This Hotel in the Red Light District but I have seen families with many children staying here there didn't seem to be a problem with them. Rooms quite small but I was only there to sleep and the price was right. Many eateries close by again cheap. It is not 5 star but neither is the price. When in Singapore I always stay in the red light district. Buses and trains very close and even taxis are cheap.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Cavite City, Philippines", "Title": "“Just a night of stay!”", "Author": "GaAbieras", "ReviewID": "UR126882093", "Content": "The hotel looks good. Rooms are small like all rooms of hotel 81. The noise outside like people walking around in the middle of the night could ruin your sleep. Internet is free but only one username and password is provided per room. The area is not that good if you are traveling with children. It is located in a Red District and not much option for decent restaurants. Only good for an over night stay.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "perth", "Title": "“couple of the staff were helpful, others couldn't be bothered”", "Author": "curious24seven", "ReviewID": "UR125209176", "Content": "couple of the staff were helpful, others couldn't be bothered, the room came with two free bottles of water, complementary toiletries, cock roaches, dirt and grime, and plenty of pubic hair in the shower and bathroom. there were eateries close by with cheap tasty 3 dollar meals, taxi to airport me cost me 20 sgd unfortunately I find myself tempted to stay in shoe boxes like this due to Singapore's way overpriced accommodation and being trapped by poor connecting flights. I would like to see Malaysia step up its airport so I can give Singapore a miss completely.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Be forewarned!!!!”", "Author": "Pandapalmer", "ReviewID": "UR124835644", "Content": "In the past 3 months I have stayed in 16 different hotels across south east Asia, and this hotel has been by far the worst yet!!! Rooms are manageable size, but cleanliness is questionable!!! Mini bar stank of dead animal!!! Spent 2 nights here and managed to get a whole 4 hours sleep over these days! WARNING: RED LIGHT DISTRICT many ladies bring clients into hotel for 3/4 hours!!!!!!! Corridors very noisy and walls paper thin!!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Manila, Philippines", "Title": "“Hotel 81”", "Author": "Alex P", "ReviewID": "UR124522353", "Content": "Stayed here for 2 Nights/3 days with a friend, Room was soooo small for its price. Not too much room to move in or put you luggage in. Definitely would be my last resort when I come visit singapore again.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Pune, Maharashtra, India", "Title": "“Hotel 81 heylang review”", "Author": "Rajan M", "ReviewID": "UR121380251", "Content": "Hotel rooms so small that you don't even get space to place your luggage. you had to put your luggage at doors. No locker in room. Totally unsafe for money holders. no bottle provided for drinking. no smoking. WiFi continuously getting disconnected. Only one user can get net on your WiFi device at a time. no restaurant in hotel. no help in getting information from the hotel guy.. and finally worst of all no help boy. that means they don't have anybody that will help you to carry your luggage to your room. even if u need WiFi code(which changes every day) you need to go personally down to desk and collect it personally. Moral of story if you need small bed for 8o sd then you can go..", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“never again..”", "Author": "steveerose9", "ReviewID": "UR121374818", "Content": "we stayed here for 2 nights 8th/9th november. was horrible.. the bed sheet does not even cover the whole bed?? which was really weird. we found a toenail in our bed which put us off! the bed was as hard as rock, can't open the window, shower pratically on top of the toilet. i guess you get what you pay for, but worth staying somewhere nicer!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Small room.”", "Author": "korndamned", "ReviewID": "UR121200768", "Content": "There are better hotels for the rates charged. Quite a distance from MRT station too. Located in a very tame red-light area.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“decent value, decent room”", "Author": "wardealeo", "ReviewID": "UR120803671", "Content": "My room was decently clean and comfortable. A/C worked. Shower had no curtain and hot water lasted under 5 minutes. Water pressure was good. In-room WiFi at S$10 was OK value and worked fine. This is a decent budget place. It has little natural light and the windows do not open (which I think is common around those parts). I'd be fine recommending it for the price, but there may be better deals. Note that I stayed at 20 Lorong 16 Geylang. There are many Hotel 81s, including one directly across the street from this one!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Not any.more”", "Author": "mehtoh", "ReviewID": "UR117376521", "Content": "We stay there for 1 day only just to take a rest bec we had along journey thats why i didnt notice at night in the blanket and the besheet have a stain of blood. They really dont check.if the room is clean if there beddings r ok. Dont try here...", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“won't be back thank you”", "Author": "Matt2012", "ReviewID": "UR115637916", "Content": "Unfortunately this kncok-down budget hotel is located in the middle of the red-light district. Not okay if you have a family or don't want to see this kind of thing happening on your hotel doorstep. You get what you pay for - you can't go wrong really - a mould infested room, windows that can't open, a free daily bottle of water and tea and coffee satchet. The bathroom is basic Asian style - shower on the wall, no cubicle, and water drains down on the slanted floor. There is no food provision at the hotel, go to the nearby main road to the food courts to get breakfast or other meals", "Date": "July 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kapaa, Hawaii", "Title": "“Cheap room for a layover”", "Author": "rainbowmandy", "ReviewID": "UR112687624", "Content": "We just needed a room not too far from the airport, cheap and easy. We had two separate cab drivers tell us that we should not stay in Geylang - that it was the red light district and that Hotel 81 is a \"love hotel\". Yes, the area left a bit to be desired but we didn't spend a lot of time outside the hotel at night wandering the streets and for the price we paid and were willing to spend it was fine for one night. Small room, ok bathroom, no wireless internet, 24 hour check in. Make sure you know EXACTLY what the address is of the hotel if you chose to stay at Hotel 81 as simply saying Hotel 81 - Geylang will not get you there. There is a Hotel 81 on every street, some right across from each other.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Value for money”", "Author": "A TripAdvisor Member", "ReviewID": "UR107733144", "Content": "Stayed in Family Room on 2nd May 2011. Rooms & Toilets were very clean. Counter staff were helpful. Check in was a breeze.", "Date": "May 10, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Good value for money, especially in Singapore”", "Author": "Yogi_Bear_NZ", "ReviewID": "UR94200035", "Content": "Book via wotif or booking.com and you will get a good room rate. Singapore hotels are usually quite expensive so this place is good value for money. It is clean enough but very basic, so keep your expectations realistic. Right next to great Indian and Chinese eateries...one of the few areas in Singapore that dont feel overly modern. Its right in the red light area too, whether this is good or not is up to you!", "Date": "January 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Ok for price paid”", "Author": "Mehilainen", "ReviewID": "UR93315217", "Content": "We stayed in Singapore this time only for one night and wanted a hotel in rather easy access to Changi ( late flight in and really early flight out) with reasonable price. Hotel 81 Geylang was ok for price paid but would like to stay there any longer. Staff was friendly and bed was clean. Bathroom / toilet was so n so, but we lived with it.", "Date": "January 17, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Guangzhou, China", "Title": "“Only if you are on a very tight budget.”", "Author": "traveller197712", "ReviewID": "UR93157663", "Content": "We stayed at the Hotel 81 Joy located in Geylang district of Singapore in January of this year. I knew that it was a budget hotel and we are definitely not fussy travelers but I would have to say that I probably wouldn't stay here again. The staff were friendly and the bathrooms were clean. The bedding was questionable. I worried that we may get bed bugs. We didn't though! I would really only recommend this hotel to those who are on a very tight budget but still want to see Singapore. The food in the area is wonderful and it is relatively easy to get to the MTR station on foot. If you can afford a bit more though I would definitely splurge!", "Date": "January 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Poole, United Kingdom", "Title": "“Stay in a better area”", "Author": "SamWasTravelling", "ReviewID": "UR90569557", "Content": "Not the best area in the City. Pay a bit more and stay somewhere else. Small room and smaller bathroom. The mattress has a plastic cover which makes you sweat even more with the lack of ventilation.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“A good value in Singapore”", "Author": "Arnold_CAL", "ReviewID": "UR88086132", "Content": "This hotel, located in the middle of the Singaporean Red Light district, is far from charming. It's just a budget chain hotel such as what you can find in the US with Motel 6 for example. However, considering the quality offered here and the low prices compared to what can be found elsewhere in Singapore, Hotel 81 Geylang is great place to stay, especially if you are only there for a couple of nights. The rooms are pretty small but convenient with TV and shower. The hotel seems a little bit old but everything works properly. The staff isn't that friendly but they will be helpful if you need anything. The location of the hotel is pretty convenient within the friendliest neighborhood of Singapore and great food and entertainement all around. The MRT train system is just a couple of minutes away by foot.", "Date": "November 24, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Philippines", "Title": "“The hotel is nice and affordable.”", "Author": "DutchPhilippines", "ReviewID": "UR79292230", "Content": "The hotel is a 5 minutes walk to the main road and 8 minutes walk to the bus stop. The staff are very accommodating. The room is clean and the beddings are changed daily. Which includes bottled water, coffee or tea and bath soap. If given an opportunity to travel again, I will choose this hotel again. Never mind if it's located in the red light district.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brescia, Italy", "Title": "“Not for couple....”", "Author": "Wulan_Marco", "ReviewID": "UR75232032", "Content": "Located in Geylang which famous with the nightlife. The staff are nice, even though we're a little bit difficult to understand their english. The rooms are standard. But the air conditioning a little bit noisy. The bathroom ...not really clean. And big surprises in the night when we came back from sightseeing. Right in front of this hotel, there were around 20 beautiful girls standing there. First we were surprised, but after one man explained...we understand. The funny thing, when there is a policeman come, the hide in the hotel. This hotel, for sure not for couple. Better for single man..specially", "Date": "August 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London UK", "Title": "“cheap and clean (and not dangerous at all)”", "Author": "explorerx1x", "ReviewID": "UR56761443", "Content": "I was in the UK and needed some accommodation for a one month break in Singapore. As you will find, Singapore is pretty expensive for accommodation. I came to this website and was put off by some of the comments. Whilst I was only there for one month, my impressions were: the hotel is quite close to the MTR. It takes 10 mins walk. The MTR itself is 15 mins from the \"city centre\". The hotel room is small. In fact, apart from the double bed, there is not much space. I had some suits and there was nowhere to hang them up. There were two draws in the room but they were not big enought to hold my A4 pad. It had an ensuit shower/bathroom Whilst the hotel do not advertise it, the rooms can be hired by the hour...enough said However, the rooms were clean, there was hot water and I wasn't woken up during the night or harranged in any way, the beds were comfortable and the staff courteous and helpful. For me it did what I wanted...cheap, safe and clean accommodation for less than £15 per night (i think) . The area is fantastic for local food. The fact that the area is a red light district is good. Each street has a different ethnicity so there are good chinese, malay and indonesian food stalls. The locals eat there throughout the day but it does get pretty busy with the locals in the evening. Food can still be found at 5am! Whilst there are obviously girls hanging around, I was never accosted...this is Singapore. Would i stay there again...yes if i was wanting to watch my costs. If my company was paying then obviously go to the Shangri-La!", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brunei Darussalam", "Title": "“Very Comfort and Friendly staffs”", "Author": "CaTs2shY", "ReviewID": "UR33937296", "Content": "I recently returned from a Shopping Holiday in Singapore for 10 days. I travelled with my husband and we had a fantastic time. We stayed at the Hotel 81 Geylang and were treated like Royalty. The staff were exceptional, nothing was any trouble and service was always with a warm friendly smile. We would stay again at this hotel without any question and definately Hotel 81 Geyalng best value for Money I have come across in a long time.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Gnarly”", "Author": "chastityi", "ReviewID": "UR32822533", "Content": "This Motel is definitely not an appropriate place to book Conservative mother and daughter travelers. We went thru a travel agency, and they booked us here - I got ripped off....I thought it would be a decent, at least 3 star hotel, in a decent neighborhood (since that's what the Agent told me). This is more like a EconoLodge-type of motel... with pay-by-the-hour customers. If I was back-packing with my girlfriends, I wouldn't give a [ --X-- ]! But, I was with my Mother! The bathroom is weird...It's a combo shower-toilet-sink; my bathroom had mold that was so strong smelling. Room was clean and the bed was decent. (I'll post pictures) The Front desk clerks are very nice and knowledgeable. If you're a woman walking from the Metro station to the Motel, the hookers won't bother you (they probably know that you don't want to be in the neighborhood)...But the men just hanging at the cafes along this boulevard will, try to give you the \"How Much?\" eye. Don't look at them! It's not a dangerous place...just a different neighborhood, than what I'm used to. Stay here if you don't mind this type of environment and need to save a buck. Don't book thru a travel agent, if you want to book a room here...go directly thru the Hotel81 website to reserve.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pg", "Title": "“Clean and affordable”", "Author": "PgHopper", "ReviewID": "UR18502679", "Content": "There are a few Hotel 81's in Geylang area.Rate is about Sing$90. I stayed at 2 different places and both were OK. The rooms are clean and everything is basic. Train station is nearby.The area near the hotels can be quite intimidating. It's full of foreign labourers from several countries and hookers can be seen day and night. Not recommended for families with kids.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "AUS", "Title": "“ok”", "Author": "daisy1_daisy", "ReviewID": "UR15436746", "Content": "I have just returned after an 8 day stay at this hotel. It was clean and tidy and the room serviced daily. Staff friendly and helpful. OK for short stays only. Too far from the city to be practical. As it is situated in the heart of the red light district, the presence of the many 24/7 prostitutes on the streets was a bit daunting and the pimps also made it a bit uncomfortable. My male travelling companion was propositioned by the prostitutes and pimps every time he went out alone and when alone I was also propositioned by the 'clients' Although we were there for 8 days I was extremely disapointed to be charged for 2 hours accomodation ($20) to stay an extra 2 hours post check out time. At $80 per night it was OK, but would never take family or children there.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“no dramas at geylang”", "Author": "scratchyfoot", "ReviewID": "UR15371748", "Content": "Quality Budget hotels are thin on the ground in singapore, or so i thought. Yes it is a little way out of the city, yes there are prostitutes at the top of the road, yes the hotel charges by the hour, but all that aside the hotel was efficient, room cleaned everyday, i slept very well, air con works, bathroom is clean, as this is a review about the hotel and not whats going on outside i would recommend it, maybe its not for everyone but if you are on a budget and want your own room this is a good choice.", "Date": "April 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Bali", "Title": "“Once but not twice!”", "Author": "BaliFullmoon", "ReviewID": "UR13061984", "Content": "No hot water, no movie channel...although published ! No sorry from staff. Cockroaches in the room. Expect day and allnight some horny noises ! Location: REDLIGHT district! Your bathroom is one squaremeter: washbassin,shower and toilet. Its a three-in-one wash! My advice:Pay a little more and stay in a better neighbourhood.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Cheap and a little noisy”", "Author": "8002reverse", "ReviewID": "UR12322116", "Content": "Stayed 8 times. Good all-round value. A lot of \"transit\" customers staying for 2 hours if you get my drift, hence the noise. If you add the cost of taxis to get out of Geylang, it's probably the same price to stay somewhere more central that's better and more expensive. No food but 24 hour supermarket 3 mins. walk away. Google Earth: 1°18'42.65\"N 103°52'47.43\"E", "Date": "January 4, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Worcester, England", "Title": "“Nice enough”", "Author": "KUFC", "ReviewID": "UR10849223", "Content": "Nice place. It is near the 'red light district' but this was not a problem as we were alittle wary. The facilites and service were good and the rooms although basic and fairly small were clean and comfortable. Would not hesitiate to stay again but more central would be more ideal. Tube station is approx. 10 minute walk away. Rate was good value.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Really Budgeted Stay”", "Author": "Venazkat", "ReviewID": "UR8065336", "Content": "My boyfriend and I wanted a budgeted cheap hotel for a weekend stay and we ended up choosing Hotel 81 Joochiat. Unfortunately, we got mixed up with Hotel 81 Joochiat & Hotel Classic & so we were surprise with what our actual choice was. At first, we were surprise to find the lobby clean and presentable considering the district it was in. We paid $70 for 1 night, and felt it was very reasonable. We were happy to receive a nice first impression. Checking in was also very efficient and fast in the day time. However there was no one to help us with our luggages so we had to carry everything on our own. We were given the 4th storey room directly infront of the elevator which we found accessible. We were told that at night the hotels are normally fully book on an hourly basis. Our double bed bedroom was extremely small, with only the necessities you need. The bed was considered big and comfortable, however the sheets were badly stain with things i shall not discuss. There was even red oily stains on the wall. My boyfriend and I ended up sleeping in our sleeping bags on the bed. The cupboard had no doors and hangers that were non removable. The dressing table was small. But it was nice to receive noodles and a pack of milo and coffee complimentary. The bathroom is even smaller. But we found it rather clean. I love the shower. It had those pressure shower hose kind of thing and it was nice. It had only the basic toiletries you ever need. There were some stains on the towels, so thankfully we brought our own. And at night, the hotel lobby was filled with people, but yet a very silent and still environment. I was told of the entertainment situation in that district, but it was my first experience seeing it upfront. Location was good, it was about a 15min walk to the MRT and you can get to town within 20mins. You get to see and explore the Malay village of Singapore along the way to the MRT too. It was an eye opener for us. There are 2 7-elevens nearby, so you never go hungry at night. And it was about 15mins to the East Coast Beach. And due being in the East area, we easily reach Changi Airport less than 15mins too. It is all highly accessible in Singapore. I would not recommend this Hotel 81 Joochiat to tourist, but it does not stop me from trying the Hotel 81 Classic or Hotel 81 Chinatown, which i've heard is alot more better for my next travel.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cainta, Philippines", "Title": "“It is worth staying at Hotel 81 Geylang”", "Author": "Manlalakbay", "ReviewID": "UR6745535", "Content": "I and my family of 6 with 3 special friends stayed in Hotel 81 Geylang at Lorong 16 from 28 Jan. to 02 Feb. 2007 when I celebrated my 60th birthday. I was concerned at first about the possible problems that we may encounter with the place as as so-called \"entertainment area\". True enough we saw them waiting for potential customers but they never harass or intimidate anyone in our group. There were no pimps around. They mind their own business as we mind our own. As a Industrial Relations practioners, I respect them for the job they are in. The hotel is clean and well organized but lack staff being a budget one. Isaac, one of staff was a very pleasant one. It lives to it being a ISO 9000 ceritfied by SGS. While there is no breakfast, they provide you with Milo and 3 in 1 coffee and a cup of noodles per room every day. The room size is good enough for us. Other facilities are operational. It is close to MRT station of Aljunied. There are plenty of food outlets like the Victoria Food Court. There are 7-11 and Cheers outlets where you get your needs. Taxi is easy to get but economical if there are 4 riders otherwise you can walk to the MRT, it is healthier. For budget conscious persons like us, we will take Hotel 81 Geylang and fly Tiger Airways again if given the opportunity to visit Singapore. Thanks. Federico G. Luchico, Jr. Cainta, Rizal, Philippines", "Date": "February 5, 2007"}], "HotelInfo": {"Name": "Hotel 81 - Geylang", "HotelURL": "/ShowUserReviews-g294265-d506327-Reviews-Hotel_81_Geylang-Singapore.html", "Price": "$50 - $73*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">20 Lorong 16 Geylang</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">398863</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "506327", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4b/ea/4beae3550a378482e54f95c527beaa3a4large.jpg"}}