{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Extreme Mediocracy”", "Author": "William G", "ReviewID": "UR127640166", "Content": "I have been staying in the Shangri-La serviced apartments for 6 weeks with my wife. To begin with, the hot water tank in the apartment did not provide enough hot water to suffiently take a shower. The apartments are in desperate need of renovation; the apartments just look tired and worn. The pool area looks recently remodeled and is nice. The main hotel which is next to the apartments has a beautiful pool area that has been under construction for the entire length of our stay. The gym is the best hotel gym I have every used. The Line Restaurant at the Shangri-La Hotel denied us a table outdoors one afternoon. We were told they couldn't sit us outside despite the fact that there were plenty of tables available. My wife complained to management and got us upgraded to a 2 bedroom apartment that had sufficient hot water, and we got invited back to the Line restaurant for a free meal. For the price, there is much better value at other hotels and serviced apartments. I would not stay here again.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“One Star”", "Author": "Shannon G", "ReviewID": "UR126820131", "Content": "Under the assumption the Shangri-La is suppose to be a luxury resort, my husband and I chose to stay at the serviced apartments for an extended stay... wow, were we disappointed! Needs a renovation ASAP! Halls smell of moth balls and stale food; all appliances in kitchen outdated, mismatched; bathroom looks like a cheap motel's bathroom- no replenishment of soap during your stay; we had to switch rooms because our hot water would run out in 10 minutes- forget a hot shower; overall the apartment lacked amenities- not a single pen or notepad to be found, old/dated decor, most definitely NOT a four star hotel. Now to describe the awful facilities at the actual hotel: locker room old and deplete of toiletries at most times (had to shower here often because shower in room would not stay warm), staff in locker room lounged around consuming hotel guest's complimentary fruit and water while watching T.V. at very high volume (aren't spa hotel locker rooms suppose to be tranquil?), current renovation around hotel pool causing much noise and dust in air, staff at the Line restaurant very rude and unaccommodating, NO pool service (had to sign-out own towel- at luxury resorts they bring you towels and set up your lounge chair for you as well as offer you beverage service, well not here! I think the whole Shangri-La in Singapore needs an over hall of its services... perhaps they can learn from the Four Seasons chain, now they exemplify true luxury resort service!", "Date": "March 28, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "La Quinta, California", "Title": "“Pro's and Con's”", "Author": "Kevnzworld", "ReviewID": "UR119919951", "Content": "Pros : Great location. It's a quick walk to shopping, markets and transportation. The Shangri la hotel is a quick walk up past the tennis courts. The buffet is awesome. The staff is very helpful. Cons: The decor is old and tired. There aren't any non smoking rooms, so no matter what they say..it smells of smoke. They gave me a purifier, and I went thru 3 bottles of air freshened all to no avail. The English tv channels are very limited. Almost none in the bedroom. No in room laundry.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent Apartments - Excellent Service - Excellent Location”", "Author": "Nigelshan", "ReviewID": "UR106173953", "Content": "My husband and I, together with our 14 month old baby girl stayed in these apartments for 10 days. We cannot fault them at all..... the service was outstanding, everything was arranged for us - for our daughter (highchair, cot, linen). They even upgraded us to a two bedroom apartment for free. The location of these apartment are perfect, they are off the busy Orchard Road so it is quiet, we walked to Orchard Road a couple of times a day and it only takes 8 minutes (with a stroller), otherwise you can catch a taxi for approximately S $3-$5 dollars. The pool is lovely and shaded and the gardens are stunning. We used the Shangri-La Hotel pool a few times, which was a lovely change, it only takes 2 minutes to walk there via a private walk way. We also used the Shangri-La pool at Sentosa Island - which was a life saver as it was very hot. We travel alot and always stay at 5 star accommodation, so I cannot understand why some of the other reviews are negative, as we cant fault these apartments, even if we tried. Also, these apartments are owned by the Shangri-La group so please ignore what the other person said about them not being owned by the group.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Perth", "Title": "“Comfortable, clean, beautiful pool”", "Author": "WhiteChinaCat", "ReviewID": "UR99990923", "Content": "We really enjoyed the apartment. We had a two bedroom apartment overlooking the pool, nestled amongst the trees, where we could sit on a sofa and watch a very enteraining squirrel. The apartment was incredibly quiet and great for R&R for us. We were exhausted when we arrived, and this was a perfect place to recover. The cleaning staff are delightful, and so keen to assist. Reception staff not as good as other reception staff in Singaore generally, but probably average for the rest of the world. The location of the apartments isn't great. We spent 2 weeks here, and were happy. The food choices at the hotel are very ordinary, and on't believe them when they promise you a 20% discount on food in the hotel - you won't get it unless you fight to the death. Also, when it comes to seating options in the busy restaurants, you'll be treated like a second class citizen if they know you're from the apartments, and you'll get a terrible table almost every time. Definitely go and eat somewhere else. The A/C in the gym was inadequate - very hot and unpleasant, although the equiment was good.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Why did I decide to stay here? My bad!”", "Author": "foodnfinance", "ReviewID": "UR95752963", "Content": "Ok, I opted to stay here because it's the \" Shangri La \"... Nope it isn't. It's a differen't company. ( thats why you pay in advance, and can't cancel). If you like Grannies decor, your in luck. If you smoke, it's even better! ( I don't ). The TV? You have to pay for all of the best channels in the living room. The bedroom TV? Only chinese, no cable. The cable costs 12 a month. This low end dump can't even cover that. I am paying 300+ per day. No cable in the bedroom unless I pay for it.?......check out where I should have stayed,.... pan pacific or tree tops!", "Date": "February 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Perth, Australia", "Title": "“Disappointing”", "Author": "MTT-70", "ReviewID": "UR88333120", "Content": "Extremely disappointed with this accommodation. Firstly had to pay upfront for stay before even viewing the room - obviously this is why there are no photos of these apartments on the internet. No bed for our child as requested. Rooms definitely needed some renovations as they were run down. It was that bad that we had to look elsewhere for accommodation, we only stayed one night with our 7 year old having to share our bed. No refund and no negotiation was considered.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“You won't go wrong with the Shangri-La”", "Author": "Taras_Bulba_v_SG", "ReviewID": "UR27501060", "Content": "Get access to all the main hotel's facilities plus the other property on Sentosa island. One of the only hotels in Singapore to still have greenery. Good central location with free shuttle bus service to Orchard Rd, financial district, plus Jurong and Harbourfront commercial parks, all in all it is a far better choice than the other serviced apartments available. Here you will not get any hassle over menial things. Good staff and good management get the job done. The little extra you pay over competing properties is definitely worth it.", "Date": "April 6, 2009"}], "HotelInfo": {"Name": "Shangri-La Apartments", "HotelURL": "/ShowUserReviews-g294265-d506455-Reviews-Shangri_La_Apartments-Singapore.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1 Anderson Road</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">259983</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "506455", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4c/c0/4cc0fe279d30a72c5e19581f7366c4891large.jpg"}}