{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“You get what you pay for”", "Author": "Buttpuncher", "ReviewID": "UR129007661", "Content": "I booked a room here because of the reviews listed on this site. The price and outstanding reviews seemed too good to be true, but I ignored my gut feeling and booked anyway. BIG MISTAKE! The lock on the door knob was very loose. Not an issue when the dead bolt is locked, but I wouldn't leave anything at all in the room, as any key could open the door with enough effort. The room was fairly clean, but corners are definitely cut here. Theres a handsoap dispenser in the shower... I have no nice things to say.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“So much to offer with an amazing value”", "Author": "longjohns21", "ReviewID": "UR118993063", "Content": "We had a king the room was huge and clean. The pool area awesome! Kid friendly. Indoor and outdoor fun w/ the outside water features lots of fun. We didn't even get to the putt putt golf or game house but what an amazing value for all they have to offer.", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Great place for a great price!”", "Author": "Mellow26", "ReviewID": "UR111560342", "Content": "Though it doesn't look like much from the outside, my family's stay at the Windsor Inn was great! The staff is very friendly, the rooms are clean, there's plenty of parking, and we had two pools to choose from. One pool has a slide and a shallow pool for my kids to play in, while the other pool was very large and a bit more relaxed for adults (though I didn't get to use this one very much). I will definitely recommend this place to all of my friends and family.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Decatur, Alabama", "Title": "“Outstanding accomadations and staff”", "Author": "maverick716", "ReviewID": "UR71686428", "Content": "My wife and I stayed here for our 50th wedding anniversary and found it to be an Ideal choice.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oklahoma", "Title": "“GREAT DEAL FOR THE MONEY”", "Author": "sandi83", "ReviewID": "UR47421170", "Content": "I was a little skeptical, not seeing many reviews on the Windsor/Greenbrier Inn. We were pleasantly surprised. Great location to yellow route and attraction. We stay in rm 433, Nice size 4 queen beds 2 bathrooms. However, bring your body soap and shampoo they don't offer. The continental breakfast was a little lacking. They should add bagels and cream cheese and fruit. Other than that nice place. Would differently stay again when we go to Branson.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lincoln,Ar", "Title": "“A great nights sleep and Resonable Rates,Friendly staff!!!”", "Author": "Bells026", "ReviewID": "UR38555313", "Content": "We have stayed here many times.We come back because of the people,and because you can't beat the price. We had four adults for one low price of $52.00.We each split it so that made our motel cost only $26.00 each!! Love the location.", "Date": "August 23, 2009"}, {"Ratings": {"Overall": "2.0", "Service": "1"}, "AuthorLocation": "fayetteville ar", "Title": "“room booked twice”", "Author": "bharpfayettevillear", "ReviewID": "UR36564084", "Content": "We made reservations- arrived and was given a room-room was fine--had gone to sleep when we were awakened by a key being inserted in the lock on the door, when door did not open because we had the dead bolt on, there was loud talking and a fist pounding on our door and someone loudly proclaiming that someone was in their room. Not knowing what was going on we did not turn on a light but my daughter did pull back the curtain to look out, there stood several people, she backed up and still there was a disruption outside our door. Needless to say we did not sleep the rest of the night. The next moring I went to the office and asked for a refund or another room-one of the workers was standing there and he told the lady on duty that he was aware that our room had indeed been double booked, they finally gave us another room. We would never stay there again, this should never have happened.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rogers, Ar", "Title": "“I'll stay here again!”", "Author": "vantigg1", "ReviewID": "UR34355547", "Content": "this motel was very clean and i was surprised when we walked in to see how clean it was. the staff was very friendly and very helpful! my husband was very pleased and said that we would be staying here next time we traveled to Branson!!!!", "Date": "July 9, 2009"}], "HotelInfo": {"Name": "Windsor Inn", "HotelURL": "/ShowUserReviews-g44160-d508043-Reviews-Windsor_Inn-Branson_Missouri.html", "Price": "$57 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3520 West 76th Country Boulevard</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "508043", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bf/f1/bff18ba424679e9ee712106f366049d58large.jpg"}}