{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Chelmsford, United Kingdom", "Title": "“Sunshine after snow”", "Author": "pollyjb", "ReviewID": "UR128446479", "Content": "We had a weeks skiing in New Hapshire, followed by a couple of days in Boston then onto Florida for a weeks sunshine and shopping. This is an older timeshare resort, close to Disney but away from the shopping areas and main downtown. The pool is small and becomes shaded at times, but as the resort was not busy when we were there the pool size wasn't a problem. Numbers in the pool and beds would be an issue if all the units were full. Its a small resort, not on a par with the huge multi building/multi pool resorts we have been to before in Florida, but the 2 bed units were lovely. The one beds are small, and with 2 teenage sons we would have felt crammed in, so we updgraded at a cost to the 2 bed. It was a few years since we travelled to Orlando and its grown massively. We were astonished at how long it took us to get to International Drive, the traffic was awful. Bear this in mind whn looking at this resort as its great for Disney, not for much else. However with agood map you can bypass the main highways and get around town not too badly.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tipton, Indiana", "Title": "“Little disappointed.”", "Author": "Stacey G", "ReviewID": "UR126087782", "Content": "The property in general is nice and seems well kept. It's a VERY average place. Kinda like staying with a friend that just isn't quite as clean as you are. The units are fine, was kind of expecting a little nicer though. The pool closes early and seems to be always filled with people, it's not very big. The hot tub the same way. It offers no real ammenities that a plain old hotel wouldn't offer. The bedspreads were not clean and you don't get a real feeling of cleanliness in the place. The furniture in the unit, especially the bedrooms, were really outdated. The road you drive in on is kinda shady/creepy. It's not set in a nicest of area's. The properties out front and around them are really run down and ominous looking. Our biggest complaint that is almost unforgivable is this smell. It started out subtle when we first walked in but by then end of our stay I was begging for the people to do something about it and they gave me some lame excuse about it being a lizzard maybe crawled into the fridge......ok, well do something about it! I got handed a can of Lysol.......seriously? Which I sprayed half a freaking can in the fridge, freezer, pulled it out and sprayed behind...etc. No difference except flowery scented stink. If you are planning to be gone all day every day at Disney or other activities then maybe this place would be ok. If you want to come back to a luxury resort then you might want to pick someplace else. I was nervous about going outside the resort in the parking lot at night and DEFINITELY wouldn't let my 6 year old son.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Canada", "Title": "“Okay resort”", "Author": "Easy_GoingCanada", "ReviewID": "UR124277684", "Content": "There were good and bad aspects of this resort. Good Nice pool, hot tub, bbq area, playground, tennis court, basketball hoop and out door gym. The front desk will provide you with sports equipment. 3 bathrooms in the townhouse. Nice covered porch. Bad Dirty quilt on the bed. They obviously had not washed it so we had to sleep with just a sheet and fleece. The bed , sheets and towels were generally of poor quality. The shower head was weird, did not spray properly We ordered the cleaning service. It never came. All in all this place was cheap and had some okay amenities but it wasn't very comfortable and needs some serious upgrades. The cleaning staff seem kind of lazy and management should deal with this problem.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cape May, NJ", "Title": "“Friendly customer care and service at a value price”", "Author": "4283099", "ReviewID": "UR123918567", "Content": "We spend time in the Orlando area during the winter for our annual golf or Disney getaway. I have stayed at High Point World Resort the past three years. We when vacation with the family or friends we usually stay at relatively high end all-inclusive resorts loaded with amenities. My first time at this resort, there seemed to be nothing that appealed to me. I found the units a little dated, and the resort itself is small, with only a small pool behind the check-in stattion, with a hot tub -that's it. However, when I compare the price and set-up of High Point compared to a stay at a hotel room, I see it in a different perspective. To begin with, the staff is great. I noticed that several of the desk people have been there a while, which speaks well for the place. They are always courteous and friendly. You can arrive early and get changed before check-in time, which we do when we have a mid-day tee time. Next the rooms are spacious, and have basically everything you need. We have been in both the townhomes and the one-bedroom condos. They are clean, well appointed, and comfortable. There is a flatscreen in the main room, and TVs in the bedrooms.They feature a fold out couch if needed. They are not state of the art and appointed like a $300 a night room, but compared to a hotel room cost, they exceed that value. The place is certainly convenient to everything Disney, as well as a short ride to many of the courses. We usually are out early, and go out for dinner but if we cared to we could easily have cooked in. Obviously there is no shortage of places to eat in this area. Overall, this is a great place for the price. And the people could not be nicer.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Davenport, Iowa", "Title": "“Great vacation stay”", "Author": "alvin97", "ReviewID": "UR121588670", "Content": "We stayed here on first trip to Florida 12/2011. We have not stayed anywhere else so have no comparisons but found High Point to be clean, friendly and a great place. The condo was well provisioned bed comfortable and quiet atmosphere. I would definitely stay here again when coming to this area.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rockland, Massachusetts, United States", "Title": "“A nice resort”", "Author": "Kathy O", "ReviewID": "UR119396532", "Content": "Just got back from Orlando. Enjoyed staying at High Point. Close to all attractions and nice restaurants and shops. Very quiet as it is located back from the main road. Rooms and grounds were very clean. Had all the essentials in the kitchen. Nice laundry room if needed. Pool could be bigger but that and the hot tub were still enjoyable. At no time did it seem overcrowded though. One suggestion, the safe that is in the master bedroom should be on something so don't have to get on the ground to open and close it. Other than that, the resort is very good, would defintely return.", "Date": "October 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Gaithersburg, MD", "Title": "“Had a pleasant time”", "Author": "GAL_Sews", "ReviewID": "UR117105466", "Content": "This resort has two styles of rooms - two story townhouses with two bedrooms or single story units. We had a two story unit. Upstairs there are two bedrooms; each of which has its own bath. The master bedroom has a king size bed. The other bedroom has two singles. Between the two bedrooms is a third good sized closet. Each bedroom also has its own good sized closet and a fair amaount of drawer space. The beds were comfortable, but more \"deluxe places have better mattresses. Each bedroom also had a fan. In our room, we had to keep the fan on because if we shut if off, it took ten minutes to get rid of a knocking sound. (Someone came to \"fix\" the problem, only when the person came the fan had been running and it wasn't displaying the symptom. Downstairs there is another full bath. The kitchen is reasonably sized, but I wish it had mre space for food. (For some reason, they don't provide liquid dish washing detergent and sponges, just dish washer detergent and a scrubber.) There is a combined living room, dining room. The sofa can be made into a bed. The bedding for this extra \"bedroom\" is in a good sized untility closet which also has room to hang clothes. There is a slding glass door which leads to a nicely sized screened in porch. There are a total of three televisions in the unit, the first floor has a flat screen tv. All in all, the three of us were quite comfortable in the unit. There is a swimming pool; it was pleasant - no fancy shape or anything. There were a number of bar-b-que units in close proximity to the rooms. We grilled a few nights. My biggest complaint was that there was no WiFi in the room - you had to go to their computer room. The WiFi is free, though. The staff were friendly. The place is very close to Disney and is about 20 minutes to Universal Studios and even less to Sea World. We shopped at the Publix and Target down the road.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“We stayed at High Point for two weeks this month and would definitely go back.”", "Author": "W M", "ReviewID": "UR116907845", "Content": "Small friendly resort, immaculate grounds, lovely spacious two bedroom house although interior was a little dated. Staff very helpful, pool area clean and well maintained, free internet access huge bonus! Was a little concerned before going as we have always stayed at larger gold crown resorts - no worries however - we had a lovely stay. very close to I4 and 192.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“A big mistake”", "Author": "rebeccaAwashington", "ReviewID": "UR115163713", "Content": "We checked in on July 3rd around 11:30pm after driving 17 hours in the car to the worst experience we have ever had! Started with the front desk, then going into the room we walked into the room being FILTHY, stained sheets, hairballs on the floor, COCKROACH on the wall, no shower head, the so called crib doesnt have a matress, pull out couch had someone's hair clip still in the bed not to mention the sheets were black. We had to leave the place. The room in general was not clean at all. The general manager is almost impossible to talk to. When I finally talked to her she treated my complaints and concerns as if I was lying. She will not respond to my phone messages to make my issues her own, and fix the problem for us.", "Date": "July 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Good Choice”", "Author": "lawjockey", "ReviewID": "UR98732766", "Content": "We were pleasantly surprised by this resort. I knew from prior reviews that it was not going to be a big glitzy resort, which was ok for us. It is an older resort with two story units and townhouses. It sits well off the main road 192, so we didn't have road noise. It was very quiet. The grounds were neatly maintained and the staff were extremely friendly and helpful. There is no direct transportation from the resort to the Disney parks, but is extremely close by car. There is a pool and spa. There were two coffee and donut meet and greets at the lobby the week we were there plus a lunch BBQ one day. There are three computer terminals and a laundry onsite. The one thing that was weird in he unit was the lack of liquid dish soap. No biggy because the unit did have a dishwasher. The unit had a bedroom with king size bed and a pull out couch to sleep 4 in the living room. There was no lamp near the couch in the living room if you wanted to read; it was dark. There were ample towels in the bathroom. The one thing we didn't see and would have liked to was the armadillo which apparently runs around the property. For groceries we went to the Winn Dixie which we thought was extremely expensive. Try the Publix market instead. If you decide to eat all your meals at the Disney parks you will go broke, especially if you have kids. There are numerous coupon books in the lobby and nearby for local restaurants. We ate one night at Giordanos in the parking lot to the Winn Dixie about two blocks from the resort. Very good. We ate at a Chinese Buffet a few miles from the resort that was well past the few restaurants near the resort. It was also very good. We had a take out dinner from the Bob Evans restaurant nearby which was good. The one thing to really watch out for are the places offering to buy unused Disney day passes. Don't be tempted to buy discounted tickets from them because the tickets to the park are linked to your index finger print. Good Idea to write on your tickets whose finger they go to so you are not standing there with each person trying their finger in the scanner. Poor moms carrying the tickets for their entire families were getting a little miffed before they ever got into the park. Another thing they are trying to do is to get you to buy 5 days for the price of three days. This is a good deal if you are going to go for more than 3 days. You may find yourself exhausted after the first day with olympic sized blisters on your feet after one day and need a rest day. Be aware of getting the park hopper especially if the park closes early. Epcot closes at 9 p.m. some days and the Magic Kingdom closes at 10 p.m. If you think you want to park-hop you can upgrade at the ticket kiosks. You can upgrade any tickets for subsequent days for the lower prices, so get a couple days first and expand from there other wise you are wasting your money. For a change take the drive to Kennedy Space Center. Unless you get their very early you only have time for the basic day pass, which will get you the tour and Imax.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lucknow, Canada", "Title": "“Best time ever”", "Author": "gazooLucknow_Canada", "ReviewID": "UR85905645", "Content": "The whole set up of this resort was outstanding. The townhouse felt like we were at home, with the bedrooms upstairs and each with there own bathroom was great. The grounds were very well maintained, the pool was cyrstal clear as was the hot tub, the BBQ's were cleaned every morning. There was also a computor room with 3 computors for the guests to use whenever they wanted up to 11pm. The staff was very friendly and helpful. The location is on a dead end private street so even though you are close to everything and I mean everything it was very quite. Loved this place can't say enough good about it. If I get the oppurtunity to return I will with bells on. Did I say I loved it !!!", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great resort - Great Location”", "Author": "CardiffCitygirl", "ReviewID": "UR73908949", "Content": "We stayed in a 2 bed townhouse which although we thought was dated when we first arrived it had everything we needed and was exceptionally clean and spacious. It had a large flat screen telly, vhs and dvd player, ( you could rent videos & dvds from an extensive list from reception). The swimming pool is a nice size, it was like getting in to a warm bath, a jacuzzi and a room with 3 computers with free internet access and printing facilities. What is also not mentioned in their description is that the townhouses have air conditioning and ceiling fans, essential in the summer season and laundry facilities on site. The grounds a round the resort are also kept immaculate. The great advantage to this resort is that is tucked way off the 192 highway , which has a large variey of restaurants and shops on it and it's distance from Disneyworld, 10 minutes in the car, and Universal Stidios, 20 minutes in the car. After a lond day at the parks it's nice to know that you don't have far to drive home. I would definitely come back to these resort and would highly recommend it for a stay in Florida.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Poulsbo, WA", "Title": "“Nice place to stay”", "Author": "DisneyWorldrocks", "ReviewID": "UR55201222", "Content": "We stayed here for one week in a heatwave during our trip to Disneyworld. We also stayed somewhere else the week prior to this. On it's own it was nice, clean and a perfect location. The pool was okay (my kids didn't like the taste of the water), but the room certainly was fine. We preferred our week prior to this at another condo place so compared to that we were a little disappointed. (No washer/dryer in room, pool not as good as we hoped, kitchen pretty small). But if we hadn't stayed somewhere else first then we would nave enjoyed this place more. Everyone who worked there was polite, and like I said before, the rooms were clean, nice set-up and overall we enjoyed our stay. I would stay here again, if the other condo place wasn't available (Orbit One).", "Date": "February 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "meredithj", "Title": "“A great home-base for an Orlando Vacation”", "Author": "meredithj", "ReviewID": "UR54094956", "Content": "Our unit was in the 400 building- it had 2 bedrooms (each with a bathroom), full kitchen, living room, additional bathroom, screened-in porch, and parking outside the door. There were a few BBQ areas and playgrounds. Make use of the basketball/tennis court (you need to bring your own ball). We went to Universal most days, so we didn't spend much time in our unit. Staff could have been nicer (I let them know on a survey they ask you to fill out). They were very brief on the phone and in person. You can't check in until 5:00pm. Unfortunately for us- we arrived around 1pm after our exhausting 24-hr road trip. We requested early check-in, and they told us to keep checking back every hour... and still our unit wasn't ready until 5pm. There is no wireless internet, but they do have a computer room with 3 computers. This hotel is about 15 minutes from Disney/Universal. I would stay here again, but I won't because the staff really could have made it a better experience. I know I can have a better experience at a different hotel (like the Liki Tiki where we stayed previously!)", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Staten Island, New York", "Title": "“Would stay here again.”", "Author": "TravelLovers5", "ReviewID": "UR53422811", "Content": "I was really nervous about staying here. Our timeshare was completely booked and we wanted a place to stay. We stayed in a 1 bedroom condo which comfortably slept a family of 4. The condo was very clean and spacious. All of the appliances were in working order. The kitchen was well stocked. The bedroom had a comfortable king size bed and television. Although the furniture was inexpensive it served its purpose. There was a flat screen tv in the livingroom with game hookups. The bathroom was outdated, but again served its purpose with hot water and good pressure. The only item missing from the unit would be a washer/dryer. The pool area is small but clean. Since I am accustomed to a gated community I was a little worried but I compared it to staying in a hotel. We did notice a security car roaming the property at night. Things to consider: Our unit was on the second floor and the resort does not have elevators. The check-in area closes at 2:00am. There did not appear to be many if any resort activities. The resort is very close to Disney and a short drive to Sea World and Universal. If you are looking for a small resort (hotel like setting) with clean rooms that is close to everything, this would be a good option.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "leicester", "Title": "“Reception closes at 2 am”", "Author": "lionman69", "ReviewID": "UR53036940", "Content": "We stayed at High point from Dec 26th 2009 to Jan 2nd 2010 having travelled from the UK. We had booked through club la costa (we were members). Due to increased security at UK airports and missing luggage we arrived at the resort just before 3 am only to find that the reception had closed. There was no emergency contact information and we had no prior notice of the closing time. My family with 2 kids aged 4 and 6 had no choice but to stay in our rental car which fortunately we had. Resort staff in the morning were anything but sympathetic wanting us to wait another 20 mins till they were 'properly open'. We complained to the resort manager but our concerns were all but dismissed.The resort itself was ok, a bit dated but very convenient for disney. Our family would certainly not be staying there again and PLEASE DO NOT ARRIVE LATE.", "Date": "January 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "mason ohio", "Title": "“Great place and value”", "Author": "hruskal", "ReviewID": "UR49765260", "Content": "This place was a pleasant surprise. I was a bit leary as we were paying very little for our week here. The townhouse was very roomy and very clean. It was comfortable, quiet and only a 5 minute drive to the Disney parks. Yes it could use a few updates but nothing major. We will be back.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "rhode island", "Title": "“okay, but needs some touches”", "Author": "stjohnar", "ReviewID": "UR47545553", "Content": "Great location for Disney, 2 bedroom condo with bedrooms upstairs. showing age, pool okay, grills have no starters so bring matches, clean, grounds.lighting low in reading areas, air conditioners and fans worked fine during record breaking heat wave, check in and out fine. Overall good but nothing special.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Enjoyable stay at High Point”", "Author": "BrummieSmithy", "ReviewID": "UR46996476", "Content": "4 of us stopped at this resort for 7 nights in oct. We got the week for a really cheap price through rci so we wernt expecting too much. We arrived on a sat night and drove up to the reception area. Checked in with no problems and drove round to condo 306 for our weeks stay. Parking space provided right outside which was good. Downstairs had a toilet, shower and basin at the front and the kitchen, although on the dated side was clean and had everything you needed. The living area was comfy, as well as the dining table and chairs and the plasma tv was nice and good to watch the baseball and american football on of an eveing !! It also had a covered outside terrace which was a nice place to eat dinner and relax. Both bedrooms were a decent size. The master bedroom had a big double bed, tv, wardrobe and clean bathroom. The second bedroom at the front of the condo had 2 single beds, no tv, clean shower area and wardrobe. Not having a tv in the second bedroom was a disappointment but not the end of the world. The extractor fan in the second bedroom wasn't working, the safe wouldn't close and there were 2 small stains on the landing carpet. We reported all 3 to reception on our first morning, (not to complain about them not working but more so that they were aware it wasn't us that had broke or made the stains !!) and within 5 minutes, a friendly chap had arrived and within 20 minutes had fixed both the fan and the safe. Great service. Just behind reception they had 3 FREE internet terminals which are open from 8am-11pm and were very handy to check emails, news etc etc. The pool, we didn't use but looked small but clean with plenty of sun loungers etc and the jacuzzi looked good. We used the laundry facility half way through the week which was fine, just a shame you didn't have a washer in the condo itself. Overall, we had a great stay at high point, service was excellent and the standard of the condo was very good. We would definately stay here again.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago Suburbs", "Title": "“Clean, Comfortable and Spacious”", "Author": "JDub73", "ReviewID": "UR38585633", "Content": "We are a family of 3--our son is seven. I was a bit worried about staying here, as we usually stay in a condo in Windsor HIlls. Make no mistake, this is no Windsor Hills, but it is very clean and roomy. It is very good value for the price. The Pros: Very friendly staff. Clean pool area and units Lots of room--1200 sq. ft. (we stayed in the 2 br townhome) Living area totally updated with flat screen TV Bathroom vanities updated, too screened in porch Lots of tropical style, well-maintained landscaping 3 computers to use. We used them to check in for our flights and print bording passes--for free. The Cons: Boxed in by budget hotels Old and stained carpet Small pool (25 person max.) No security gate Old kitchen and appliances No fan or TV in 2nd bdroom (The TV I didn't mind so much, but it would have been nice to have a fan in the 2nd br in the August heat.) No washer and dryer. Surrounded by budget motels My MIL gave us an RCI week to exchange and this was one of a few available the 3rd week of August. (We booked in May.) It was *nice*, but nothing spectacular. It was very quiet--a nice respite from the parks. The staff and the guests were both very friendly.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wigan, England", "Title": "“Fabulous resort”", "Author": "JuseyJules", "ReviewID": "UR26112549", "Content": "I recently stayed here for a week with my fiance and mum. It was the first time since aquiring the timeshare that we had visited the resort and we were very impressed! The apartment was gorgeous. Loads of living space and a big tv. Everything you could need an oven, dishwasher, hairdryer and lots more. The bedroom was enormous and really comfy. My mum used the pull down bed in the living room and was very happy. The real bonus to this resort is the location. One mile from disney. You really can't get any better! We even stood on the balcony watching the fireworks at Epcot. Theres lots of places to eat near by, plenty shops and supermarkets to buy your food. Would I go to this resort again?? Absolutely! I'm already counting the days!!!!!", "Date": "March 13, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Seattle, WA", "Title": "“Awesome Location Totally Updated Fresh New”", "Author": "compuserbs", "ReviewID": "UR23110355", "Content": "This is a phenomenal place, the second time we stayed. First time was for a week, second time two weeks. We loved it. Staff were incredible, pool and jacuzzi awesome. Condo was great 3 bathrooms, patio screened in, fun place to relax and so incredibly close to Disney, you can get there in 1 mile. An Oasis in the midst of DisneyWorld. Family friendly and New tile floors, ceiling fans.", "Date": "December 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Cod, Massachusetts", "Title": "“Great place to stay!”", "Author": "jbgrego", "ReviewID": "UR17260463", "Content": "We stayed at the Highpoint three years in a row! If we weren't so bored of the Kissimmee area, we'd stay there every year. It's a great place to vacation near Disney. Everyone is very friendly and helpful. Everything is clean and well cared for. The landscaping is beautiful. It didn't feel crowded at all no matter where we were on the property. Outside grills and tables make it very enjoyable to picnic outside. Disney is just around the corner. One of the units we stayed at was at the rear of the building and we could actually see Animal Kingdom's \"Tree of Life\" from our upstairs window! Excellent rates, great service, and close proximity to Disney makes this place a real catch!", "Date": "June 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kutztown, Pennsylvania", "Title": "“Clean, Quiet, Great Location”", "Author": "Pnemiller", "ReviewID": "UR11011463", "Content": "This is a very nice, clean, quiet place set back off the hustle and bustle of Route 192. We booked a one bedroom through RCI as a last minute deal and were generally pleased with High Point. We had unit 810, upstairs in the rear of the facility and it was very quiet. The unit was very clean, but the furniture was dated and there was limited lighting in the living room. The staff was very pleasant and helpful. There are few amenities--there is a swiming pool and spa and free use of one computer in the office to get on the internet. The real plus is the close proximity to Disney and the fact that you can enter Disney by using Sherberth Road, just west of High Point off Route 192. There are many dining options on 192, as well as a Publix Supermarket, 2 miles to the west.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wayne, New Jersey", "Title": "“It as fine.....”", "Author": "MyMuse", "ReviewID": "UR10065634", "Content": "I exchanged my week to use this resort. It was ok, there's nothing really to complain about and there was nothing glowing about it. The grounds were nice, it was easy to get to and get around. The condo was nicely decorated, though it would have been really nice to have a laundry in the unit. Does on really need 3 bathrooms?? The staff were friendly and I never got a sale spitch, which i appreciated. they even rused my check-out due to me having to leave early to get back home, cutting my vacation by 3 days. I did see bunch of staff cleaning the grounds and washing the outside of the condos. I don't know if I'll stay here again, but t was nice.", "Date": "October 10, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wilmington, DE", "Title": "“a place of good value”", "Author": "FromFirstState", "ReviewID": "UR6564331", "Content": "We were there for a week. We like its location. It was close to Disney parks that we visited. It is also close to restaurants. Our 2BR unit was clean. Rooms were spacious. Staff was helpful with information. We felt that we got good value for what we paid. The unit could use more lighting in the dinning room and living room area. It is a minor complain.", "Date": "January 8, 2007"}], "HotelInfo": {"Name": "High Point World Resort", "HotelURL": "/ShowUserReviews-g34352-d508173-Reviews-High_Point_World_Resort-Kissimmee_Florida.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2951 High Point Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34747</span></span> </span></span></address>", "HotelID": "508173", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c1/7f/c17f0883f2d4110ff644877cdc9074cc1large.jpg"}}