{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Tucson, az", "Title": "“Nothin' sweet about this home...”", "Author": "tammyjp123", "ReviewID": "UR41001780", "Content": "We are American tourists... not used to five star hotels or hostels, but there was nothing good about this place for the following reasons: - we booked our reservation on \"venere.com\". the website states, that you will not be charged for the stay until you arrive. we were charged for 1 night of the stay, a good 7 weeks before our arrival, not by venere.com, but by the hotel. - when we arrived, the man at the desk told us that we needed to pay for the rest of the stay in cash. if we didn't, he would charge us an extra 4%. he was very pushy and directed us toward an ATM. - we reserved a double bed for 2 people, and arrived to find a 2 twin beds. when we asked about it, the man at the front desk was very irritable, and made no changes. - THE WORST PART: no air conditioning!! it was terrible. we woke up every hour throughout the night in a sweat. when we mentioned this to the front desk, they said (word for word) \"where do you think you are staying, the grand hotel? what do you expect?\". - they advertise this is a \"B & B\". there was no breakfast. - the room: there were cobwebs above the shower. there were 2 towels, no hand towels. the shower nozzle broke and sprayed water EVERYWHERE. it was impossible to take a clean shower. We decided to stay only one night. The hotel tried to charge us for the remainder of the stay, but we refused. Hopefully, this says enough.", "Date": "September 12, 2009"}], "HotelInfo": {"Name": "Hotel Onella", "HotelURL": "/ShowUserReviews-g187791-d515021-Reviews-Hotel_Onella-Rome_Lazio.html", "Price": "$58 - $187*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Principe Amedeo 47</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "515021", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7c/c7/7cc796d42dc21e515924768ac6856e991large.jpg"}}