{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Good hotel in a great location”", "Author": "Natalie L", "ReviewID": "UR127714199", "Content": "We stayed here based on Rick Steve's recommendation. Great location by the Colosseum, not a bad price for central Rome. Hostess was pleasant and helpful. Breakfast could be better (simply croissant/pastry and coffee and juice) - adding some fruit and/or meats would be nice. The bed was a little hard for our liking. Overall, a hotel I can confidently recommend.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“A well located hotel with a charming host...”", "Author": "garza007", "ReviewID": "UR127249324", "Content": "We recently stayed at the Hotel Paba during a week long trip to Rome in March. The location was terrific -- short walk to the Colosseum, metro, and several markets/restaurants. After visiting the nearby Church of St. Peter in Chains, we found a park where we were able to purchase espressos and watch the locals. It was only a short 10 min walk from the hotel and we enjoyed returning several times during our trip to get away from the hustle & bustle of the traffic. The hotel was extremely clean and tasteful. The bed was a bit hard and the bathroom needed some updating but these were only minor issues. Alberta was a wonderful host. She provided many useful recommendations regarding local markets for supplies as well as restaurants. As we had an early morning flight back, she was kind enough to provide some instruction on how to prepare cappuccinos since we were leaving before she arrived in the morning. We did tire of the same simple breakfast each morning by the end of the week although it was always fresh. My only true concern was the noise from Via Cavour at night. There is a restaurant/bar close to the hotel entrance. Workers cleaning up around 1-2am would make quite a racket before they left. After two days, I purchased a set of ear plugs at the pharmacy next door which took care of the problem. Overall, I would strongly recommend this facility on the basis of the location, convenience, and attentive host.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Excellent central spotlessly clean small hotel”", "Author": "Mumof4Kent", "ReviewID": "UR123497451", "Content": "I have just returned from a weekend in Rome staying at the Hotel Paba. What a find! Smallish room but with all amenities and spotlessly clean. Alberta is very pleasant and helpful, providing fresh milk on demand and plenty of information about the city. Basic breakfast of croissant, roll, yoghurt, jam, tea or coffee to eat in the room, but perfectly adequate. Mini-bar and air conditioning. On the second floor but there is a lift. Only downside is that the bed and pillows were rather hard, but excellent value and would highly recommend!", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“wonderful!”", "Author": "kawonl", "ReviewID": "UR123431156", "Content": "Reading all the recomandations, me and my boyfriend decided to stay at Hotel Paba and i'm glad we did. As mentioned in all the other reviews, the location is superb, Roberta was charming and helpful and evrything else was more than expected. The room was big and with air-con, the shower was specious and clean and at the end of a long day it felt like coming home (Roberta even turned on our air-con one evening before our arrival so that the room won't be cold when we return. She's really wonderful). What more can we say? Tell your friends, but only the ones you trust won't ruin the nice atmosphere at this lovely hotel :)", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA3", "Title": "“HIGHLY recommended”", "Author": "travelloveto", "ReviewID": "UR122845885", "Content": "We read the reviews and our expectations were surpassed. My husband and I and our 21 month old daughter stayed with Alberta for 7 nights in November 2011. Alberta is so kind, professional and attentive that it makes you feel like you have someone looking out for you. She helped us find answers when we needed them and was always available to talk about our adventures of the day. Breakfast with fresh croissants were yummy. The location was fabulous - close to everything. The real reason to come back is stay with Alberta who makes sure your needs are met and you enjoy our stay. Thank you Alberta!!!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Oregon, United States", "Title": "“Fantastic!!”", "Author": "Debbie H", "ReviewID": "UR121961347", "Content": "We found Hotel Paba from reviews right here on trip advisor. Alberta was wonderful we stayed 3 nights, Sept.27-29, before our cruise. You can't say enough for the location it was great we had 2 tours ond the rest we did with the map Alberta gave us and riding the Metro. Cash exchage right across the street that did not charge a commision. the room was large and very clean, the bed was great. We cannot wait to go back and stay again. The breakfast she brought in every morning was amazing. We knew we lucked out when our driver told us we could not be in a better location. Don't hesitate to book Hotel Paba you won't be sorry. She sent our travel agent an email with all details and also set up transportation to the port for us.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Highly recommended”", "Author": "Joe B", "ReviewID": "UR120693073", "Content": "Superb location. Very clean. Simple but tasty breakfast. Alberta, who runs it, is relaxed, unfussy and helpful. If you want a boutique hotel and to lounge around a glitzy foyer, then this is not the place for you. If, however, you want a practical and comfortable base from which to explore the city, it would be hard to imagine anywhere better.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Hotel Paba”", "Author": "Marcia H", "ReviewID": "UR120548041", "Content": "My son and I stayed at Hotel Paba in Oct. 2011. What a wonderful boutique hotel. Very clean, good location and the staff was so friendly! Our stay included a continental breakfast that was fresh and delicious! We would definitely stay there again and I would recommend to my family and friends! Thanks Hotel Paba!!!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Excellent Location, Clean Rooms, Hard Bed and Pillow”", "Author": "tony r", "ReviewID": "UR120047652", "Content": "Just back from two weeks in Italy. We stayed the first three nights at Hotel Paba. If your only concern is location, location, location, this place has it and at a budget rate by Rome standards anyway. Very convenient to the main sights. The rooms are spotless and bathrooms certainly adequate. Now for the CONS: we stayed in a room on the courtyard side and I have to warn all that the restaurant downstairs is noisy throughout the night until about 3am, moving tables, stacking chairs, staff conversing. Then it quiets until about 5am and starts up all over again. Coupled with the hardest mattress we slept on (and I sleep on a semi-firm at home - this one was very, very firm), and pillows with no give to them, equaled the worst sleep we had while in Italy. As another reviewer mentioned, breakfast was a spartan affair - a croissant, yogurt, juice, and coffee. Again, based on the remainder of our stay throughout southern Italy, this breakfast was lacking in portion and variety, plus there was no dining room. It is definitely a budget hotel. Next time we would look elsewhere.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Excellent Location and Staff!!”", "Author": "Scarlett5", "ReviewID": "UR119879571", "Content": "This is a lovely and small hotel (with only 7 rooms I think). The staff, especially Alberta, were fantastic. This is a small hotel on the second floor, lift, free wifi and just around the corner from the Colosseum. The location is amazing since Rome is a very walkable city. The metro is a couple minute walk from the hotel and just one stop away from the main Termini station. I highly recommend this hotel. It is very clean, nice large beds, refrigerator/mini-bar (pay) with a small bathroom. The a/c works great and you are served breakfast in you room when you are ready. This is a gem of a hotel in Rome and I had a fantastic time!!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Hotel Paba - highly recommended”", "Author": "caseybrem", "ReviewID": "UR119833680", "Content": "We chose the Hotel Paba based on online reviews. We stayed 2 nights in October 2011 prior to a Mediterranean cruise. The hotel is in an ideal location - walking distance to Colosseum, Forum, Victor Emmanuel Monument, Basilica of San Clemente and St. Peter in Chains Church. We also walked to Piazza Navona, Trevi Fountain and the Spanish Steps but that might be more walking than you would care for. I think the hotel is a great value for the accommodations and location. We had a room in the back which was very quiet. It was a double but there was an additional alcove with a bed so it could be used as a triple. The breakfast is served in your room shortly after a telephone call telling the staff that you're ready. It consisted of orange juice, coffee, rolls, yogurt and the best croissants I've ever tasted. Alberta was a great help in rescheduling our transfer to Civitavecchia for our cruise when a mass demonstration was scheduled for that day and we wanted to leave Rome earlier than first planned. She contacted Romecabs.com and was able to get an earlier pick up for us so we avoided any delays caused by the demonstrations.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Location, Helpful Staff, Great Value”", "Author": "erinash10", "ReviewID": "UR119411094", "Content": "We stayed at Hotel Paba for our honeymoon this October. We arrived early, and they were just finishing cleaning the room. Once the room was ready, there was a bottle of champagne welcoming us to the hotel. Very nice gesture. Also, because they knew it was our honeymoon, they gave us a room with a nice big bed. The room was clean, bathroom was small (very typical for Europe, so no big deal) A/C, free wifi, lift. From the outside the hotel is located on the second floor. It was quiet and comfortable and the hotel staff was very helpful. Breakfast was included, and the only thing I can be picky about this hotel, was the breakfast. It was brought to our room daily, which was great, but was very simple. A bun, a croissant, and a yogurt. I little more variety would be nice. The hotel is right around the corner from the Colosseum, and in walking distance to all major sights if you are used to walking places. The only place we didn't walk to the entire time was the Vatican and Appian Way. Very good hotel for a budget and a nice place to relax from the chaos that is Rome", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oregon", "Title": "“The best value hotel in Rome”", "Author": "Adventure_Debi", "ReviewID": "UR119150393", "Content": "We stayed at recommendations from friend. Not a fancy place but extremely clean and well located down the block from the Colliseum. Breakfast is served in your room daily. Alberta is absolutely the best manager/owner. She WILL treat you well and will help you with any reservations or needed information. Warning - if you go in high season it is essential to book 6 or more months ahead of times. The word is out.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great Location!”", "Author": "CaroMR", "ReviewID": "UR119006984", "Content": "Nice Hotel, great location! it is so cool to walk 2 min and see the coliseum right at your face!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashland, Virginia", "Title": "“Outstanding hotel!”", "Author": "Pamela W", "ReviewID": "UR118747232", "Content": "We were absolutely delighted with this hotel and, especially, with Alberta who is an extraordinary manager. With her delightful smile and energy, she foresaw our needs and helped us throughout our visit to Rome. The breakfast was great - fresh Danish every morning along with yogurt, orange juice, Capuccino!, and roll. The location is ideal for exploring the entire city, walking distance from Ancient Rome, very close to the Colosseum and the Roman Forum. The rooms are large, comfortable, air conditioned , clean and quiet, which surprised us because Via Cavour is one of the main avenues in the city. Ask her about restaurants - she has great suggestions. Also the rooms have safes and hair dryers, which we appreciated.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Wonderful place”", "Author": "schwartz225", "ReviewID": "UR118544856", "Content": "My wife and I recently stayed at Hotel Paba which is conveniently located near the Coloseum and the Roman Forum. The hotel is located one the 2nd floor of a building on the busy Via Cavour with lots of restaurants and shops, and we found it with no problem. After arriving, Alberta showed us to our room and I was very pleasantly surprised. The room was big for European standards and the bathroom was huge compared to other places we have stayed. The bed was very firm, but again, I've found this to be the norm at most places. We even had a nice balcony looking down Via Cavour towards the Forum. For breakfast, we just called Alberta every morning and she would tell you what she had. She always had fresh pastries delivered every morning and this was offered with yogurt and juice and coffee. It was a good start to every morning. We walked by other four star hotels all over Rome but I just cant imagine paying more for a place, when you have a gem like Hotel Paba around, and a wonderful city to explore.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Lovely place and outstanding service”", "Author": "MichaelK_80", "ReviewID": "UR118452294", "Content": "Hotel Paba is a few rooms inside a big and old house in the very centre of Rome - it's only a few minutes walk from the Forums and Colloseum. The rooms are big, also the bathrooms, everything is in a good condition and very clear. The staff - Alberta is amazing woman that did everything for us to feel like a dear guest in this great city. Waiting to stay there again.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Valhalla, New York", "Title": "“CHARMING HOTEL - CONVENIENT LOCATION GREAT SERVICES”", "Author": "KV33", "ReviewID": "UR118017039", "Content": "We spent 3 weeks in Italy and wanted to spend the last couple of days in Rome but didn't book a room before we left. We were scrambling to find a hotel and LUCKILY a room was open at Hotel Paba. Alberta was EXCEPTIONAL helpful when we called. She gave us directions and suggestions on how to get to the hotel from the train station. We we getting into Rome very late and she was able to accommodate that. She was up and waiting for us when we arrived with are MANY, MANY luggage’s. The room that my family and I stayed in was nice and clean. The bed was comfortable and the AC worked well. No trouble sleeping, great blinds on the windows. One morning we woke up and wasn't sure if it was day time yet since the room was so dark (I can't sleep with lights coming into the windows). Oh and the towls were so soft. She provides a free breakfast in your room, which I thought was awesome. The location was perfect!! It took us one day to get use to the buses and we were taking them all over town. There was a great restaurant right next door (Biccesteria that we ate at twice after long days of sightseeing. This hotel is center of most attractions. This may not be a 5 star hotel but if your looking for an a location in the center, close to transportation, and helpful management this is your place. I would definitely stay here again!!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Minnesota", "Title": "“Our home away from home in Rome”", "Author": "MNnortherner", "ReviewID": "UR116321620", "Content": "We loved this hotel for our first trip to Rome. We booked the family room and comfortably fit 2 adults and 2 teens plus luggage. The room is so thoughtfully appointed with luggage racks and plenty of storage closets to organize belongings during your stay. The air conditioning worked well, and our kids enjoyed a little down time one evening before dinner watching the cable/satellite television in the room. The bathroom is very small, but has the essentials. Because the air conditioning was on we kept the bathroom door shut so did not hear the noise from the street and nearby restaurant while we slept. We slept very well, and the hotel was very quiet, in part because of the small size of the accommodations (less than 10 rooms). Each morning when you are ready for breakfast, you ring Alberta (or one of her staff if she is out of town for a day or two) and they bring a tray with continental breakfast -- croissants, bread, juice, cocoa, coffee. Basics to get your day started. We found it tied us over until we had a light snack mid-day and then a full dinner in the evenings. As other reviewers have noted, the real gem of this hotel is Alberta -- she was so responsive by email before our stay, arranging for airport transport (so nice to step out of the terminal at Ciampino and see the driver holding the sign with our name on it!), making restaurant recommendations and reservations for dinner. She and her staff are wonderful. Via Cavour is a busy street, without much charm, but step off a block and you have the character-filled streets of the Monti neighborhood full of cafes, churches and shops. Down the street you see the Forum, and around the corner you glimpse the Colosseum at the end of the narrow streets. We walked virtually everywhere to reach the classic sights of central and Ancient Rome. We even walked back to the hotel after visiting the Vatican. The day we went out to Ostia Antica, the metro station was conveniently located up the street a block at the Cavour station. I would certainly stay at the Hotel Paba if we return to Rome in the future, particularly if Alberta still graces the front desk!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“nice little hotel, great location”", "Author": "maple2004maple", "ReviewID": "UR115823213", "Content": "We were in Rome early July for 3 days. I booked this hotel based on Rick Steves travel book. It's very close to Colosseum and walking to Tiber River took about 20 minutes after dinner. Alberto is very helpful. She helped us call taxi to Vatican and Borghese Gallery in the morning. The hotel has a bookshelf where you can find a lot of travel books about Rome and maps. They have about 8 or 9 rooms, so if you want to be there in summer and need more than one room, book early.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“I love Alberta and her hotel- they are both Italian gems”", "Author": "JilgesAway", "ReviewID": "UR112482464", "Content": "Our room was gigantic, beds were comfy, lot of space to put our things and it had a refrigerator. It is located a stones throw from Palantine Hill and the Colosseum and has lots of restaurants and shopping nearby. The owner, Alberta, was very helpful. She recommended great places to eat and gave us directions numerous times. Breakfast consisted of cappucino, juice, brioche, yogurt, jam and cheese was included in the price and was served in-room. The hotel can be tricky to find the first time. It is located on a busy street and the sign is pretty small. There is an elevator but if you have to hoof it, the stairs aren't excessively steep. The hotel will also give a discount for paying in cash and there is a very handy ATM close by. The hotel does not have its own parking but there is a ton of parking available on the street and a few parking garages nearby too.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hickory, North Carolina", "Title": "“Center of Ancient Rome”", "Author": "Sensitivity", "ReviewID": "UR112323961", "Content": "If you want to be close to the Forum and Coliseum, this hotel is perfect. Very neat, tidy, clean and convenient, Hotel Paba features oversized beds and excellent climate control. A small notel with only 7 rooms, travelers are welcomed by Alberta and made to feel at home. Breakfast is served in the room, to get each day started on your schedule. You can walk anywhere in ancient Rome from this charming hotel. Enjoy!", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Williamston, Michigan", "Title": "“Best little hotel in Rome!”", "Author": "DAG61", "ReviewID": "UR111577198", "Content": "Great location and outstanding, caring staff. Made you feel like you were staying with family. Rooms were up to date and clean. A gem within walking distance to all the great sites of Rome.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bethel Park, PA", "Title": "“Perfect for our needs”", "Author": "carolph", "ReviewID": "UR110995496", "Content": "Just came back from 3 weeks in Italy which included 4 nights at Hotel Paba in Rome. I had requested a \"quiet room\" away from the main street and my husband and I were given a spacious suite-like arrangement with large rooms and bathroom. It was spotless. We didn't have a view, but neither were we weren't facing the noisy Via Cavour. Only two blocks from the colosseum, and equi-distant from the metro and busline, it couldn't have been more convenient. As others have mentioned, the real treasure here is Alberta, who manages the place. She was invaluable in getting us reservations to local attractions, made excellent dinner suggestions, and knew how to get to everything. As value for money, this place is unsurpassed.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Everywhere", "Title": "“Great location...Great stay!”", "Author": "TravelGirl319", "ReviewID": "UR110627951", "Content": "We stayed 4 nights and this hotel was great for the price! The location is excellent and we walked everywhere from here. The best croissant was served to us in our room each morning along with delicious coffee or cappucino and orange juice. The small staff were very friendly and helpful. Very close to the ruins and many other sights!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Clean and good location”", "Author": "kelebogile_matt", "ReviewID": "UR108896695", "Content": "The thing I like most at this hotel is its location, which is extremely convenient to go to both business centers and relaxing spots nearby. The hotel is very clean also. I know for sure that the hotel's managers pay great attention to this. And I'm very pleased when staying here. However, the rooms are a quite small, but I think it's still acceptable. I mean they're not too small. Recommend this hotel to you !", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Excellent, Clean, Great Location and Lovely Owner”", "Author": "jpfnewyork", "ReviewID": "UR106824952", "Content": "We stayed at the Hotel Paba for one night at the end of April after needing to vacate an apartment we had rented for the few days prior. It was a great choice! Near attractions, very clean and carefully run, we were extremely pleased with having found it for the one night we needed on an extremely busy weekend in Rome. All our interactions with the owner Alberta were professional - from initial emails to arrival - and the breakfast was well appreciated, fresh and delicious. We were a family of 4 and had a large suite with one very large bedroom and an ante-room with a twin sized bed. I would highly recommend this hotel to anyone visiting Rome!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bundaberg, Australia", "Title": "“Location location location”", "Author": "donnasperls", "ReviewID": "UR106381792", "Content": "Room was very small. However location was excellent.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuching, Malaysia", "Title": "“Centrally located, quaint little hotel”", "Author": "davidkwchong", "ReviewID": "UR102263271", "Content": "Our last morning in Rome comprised a morning tour ending near the Colosseum around 1pm. We had to gather our luggage and then catch a train at Termini Station departing shortly thereafter. We chose Hotel Paba given it's proximity to the Colosseum and recommendation in Rick Steve's guide. Worked out well. Alberta stored our luggage in the main foyer and helped us get a cab to the station. She also served us the best croissants we had tasted in our entire 3 weeks in Europe. Paid 100 Euros per night which was great.", "Date": "March 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Moscow, Pennsylvania", "Title": "“Hotel Paba an excellent choice for family”", "Author": "AndyB2112", "ReviewID": "UR98425748", "Content": "We were a party of 8 friends and family in Rome for a week, and we stayed at Hotel Paba after reading a review from Rick Steve's, and seeing nothing but glowing reviews on Trip Advisor. the hotel is small, and we took advantage of it being off season to reserve 4 rooms. The hotel is on Via Cavour, a few blocks from the colloseum and the forum, with plenty of dining options close by. Breakfast was delivered to the room daily, and our wonderful hostess was always happy to assist us with questions or problems. The rooms were immaculate and spacious, and decorated with themed movie posters - My wife and I were lucky to be in the Honeymoon room, with the La Dulce Vita poster!! The hotel is a budget hotel, and is very inexpensive by Rome standards, but you couldn't find a more gracious hostess than Alberta, and a wonderfully maintained small business right in the heart of the Eternal City. We would highly reccomend the hotel for couples, families with children, and small groups.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Outstanding”", "Author": "true_jock", "ReviewID": "UR97209162", "Content": "I am torn about leaving this review because I hope to return with my husband at some point and don't want the hotel to be full! We have just returned from Rome (February) and felt compelled to comment on our stay. An outstanding visit in every way, myself, my mother and my aunt stayed for 5 nights at Hotel Paba. The hotel owner was most welcoming and always helpful, totally in control of all taxi arrangements - organising transfers to and from the airport - and general advice on eating establishments, buses, directions etc. The rooms are well appointed and immaculate, in fact the hotel itself although surprisingly compact, is stylish and comfortable. The hotel has the perfect location - a 5 minute walk to the Colosseum and to the Vittorio Emanuelle Monment. In fact, this hotel is in the true centre of Rome - everything walkable, lovely area, lots of places to eat - what more can you want? Seriously, we - and that's all 3 of us - cannot recommend this place enough. Go there.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Brilliant”", "Author": "Brissie-based", "ReviewID": "UR96095948", "Content": "This is the second time we stayed at PABA. It's centrally located near the Colosseum and the Forum. It's spectacular value and the staff are great.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha", "Title": "“Great place to stay in Rome”", "Author": "Kairetu", "ReviewID": "UR87957256", "Content": "The service is impeccable. I arrived in Rome at 6am, and my check-in time was 11am. I went to drop my bags in the hotel and Alberta(the hotel owner) pleasantly informed me that my room was ready. In the evening it was pretty cold, she personally went and got me a heater for my room. Breakfast is served in the room and there are some very good guidebooks at the reception which proved very usefull for my sightseeing.The hotel is a walking distance to Colosseum/roman forum and the bus stop just outside the hotel if you want to go to Termini. Overall, I enjoyed my stay and would stay here again.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain View, HAwaii", "Title": "“Intimate stay in well kept rooms”", "Author": "Normaloraine", "ReviewID": "UR85070373", "Content": "A bit of a gem on a busy street very close to the Roman ruins and the Coloseum. Alberta gives the second floor (with elevator) a homey feel and personal touch. Our triple was roomy with a bigger shower than usual and a light breakfast served right in the room.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“A true jem, great value, Alberta is so helpful”", "Author": "Butcher.T", "ReviewID": "UR84938853", "Content": "Hotel Paba is a great hotel and Alberta, the owner, is so helpful. The rooms are European is size. They are very clean and very comfortable. We had room 5 which overlooked Via Cavour but the room was still quiet. It is walking distance to the Forum, the Coliseum and many of the sights you want to see. If you want dinner reservations just ask Alberta and she will not only recommend places for you but will also call in the reservation. It is a small hotel on the second floor of a commercial building. There is a breakfast included and Alberta brings it to your room which has a small table and two chairs. We are not big breakfast eaters, so the croissant, yogurt, coffee/tea, juice and rolls were more than enough for us. We had an early pick up to the airport and Alberta was very accommodating in bringing our breakfast early. We used RomeCabs.com and they were very punctual. There are also many travel books in the lobby for your use while staying at Hotel Paba. I would definitely stay there again. You also have free WiFi.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dijon, France", "Title": "“Clean, central and great service”", "Author": "eriksvartbo", "ReviewID": "UR84124022", "Content": "Family own small hotel with great location. Alberta is really, really nice and everything from restaurant reservations to airport pick-up works impeccable. Quiet hotel, slept like babies and everything very clean, the size of the rooms varies from quite big to quite small. The breakfast is not 5 star, but has all you need. I would definitly go back to Paba if I went to Rome.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Fantastic location, great price, and charming host.”", "Author": "RedheadedWanderer", "ReviewID": "UR76054386", "Content": "If you're planning to visit Rome, then you simply MUST stay at Hotel Paba. We selected Hotel Paba after reading lots of reviews, comparing prices, and weighing our options for quite a while... and we chose wisely, indeed! Hotel Paba is run by the delightful Signora Castelli and we received a warm welcome every time we returned to our room after long days of site-seeing. (For those of us who aren't lucky enough to have an Italian grandmother, Signora Castelli provides a glimpse as to how delightful that experience would be.) It's located on the second floor (which means the third floor to those of us who count the ground floor as the first) of a building with a charming, tiny elevator and wide marble stairs. This is not some cookie-cutter hotel... there's only a handful of rooms and you really feel as though you're slipping into Italian life by living in an apartment during your stay. Rome is a pretty grueling town for tourists... so you need a hotel that's both centrally located and comfortable. Hotel Paba is right by the Colosseum and the Roman Forum, making it ideal for tourist activities (and making for a great walk home in the evenings after dinner, with all the ruins lit up!). It's also close to the train station, the Colosseum metro stop, and several bus lines -- you'll be well-situated for all your exploration and transport needs. We visited Italy in August, which means we were prepared for high temperatures, and with Hotel Paba's air conditioning, we were always grateful to collapse into its cool embrace. We were in the \"Honeymoon\" room, which featured Italian posters of Roman Holiday, To Catch a Thief, and Gone with the Wind. It had windows that opened on to the street, giving you a bird's eye view onto the bustling street below -- but once the windows were closed, the room was wonderfully quiet and serene. The bed was enormous and is perhaps the firmest bed I've ever slept on, but after running around the city all day, we never had any trouble sleeping. Signora Castelli brings breakfast to your room and she's a warm, wonderful woman with all kinds of information about her city. Do yourself a favor and stay at Hotel Paba when you visit Rome. You'll be getting a wonderful deal for your money (without breaking the bank by any means) and you'll come away from your own Roman holiday with charming memories of a unique and sweet establishment. You'll wish that every other hotel you stay at had a Signora Castelli waiting behind the desk to greet you upon your arrival. Hotel Paba really made our trip to Rome a delight.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Best location & service”", "Author": "sflubin", "ReviewID": "UR74605178", "Content": "I traveled with my husband and 3 kids (6, 9, & 10). We stayed in the Happy Family room - one very large king size bed and two twin beds and a bath - still with plenty of room. Alberta, who owns and runs this fine hotel, was so kind and helpful. The best croissants in ALL of Italy were served with breakfast. The location was fantastic - we walked everywhere! Alberta easily provided my family with internet service (included in your stay), reservations, directions, and recommendations. You cannot get better than this! I highly recommend this hotel if you want amazing service from a personal hotel. This hotel has all the hospitality one should want and need!", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gulf Breeze, FL", "Title": "“Nice large room and bath for European Hotels.”", "Author": "Wise333", "ReviewID": "UR74471296", "Content": "Very small Hotel located in a building shared with other owners. Hotel room was very large, clean, with a big bed. Bathroom had blow dryer on wall. Room had mini fridge, and A.C. above the door. Room was very quiet for a big city. Owner made Taxi calls for us, and provided wake up phone service, and breakfast delivered to room. At night you have to unlock three doors to enter your room, my husband loved the elevator. If you like quiet rooms with personal service, you will love this place. If you like big showy Hotels-keep looking.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Herndon, VA", "Title": "“A very clean, comfortable small hotel in a perfect location to tour the Colliseum and Forum.”", "Author": "baldy35", "ReviewID": "UR73025714", "Content": "Touring the key sites of Rome and the Vatican means one is out and about most waking hours, so being conveniently located within walking distance of the Colliseum and the Forum plus the metro and buses; while having clean,comfortable, simple, secure overnight accomodations was key to our selection of the Hotel Paba. We were entirely satisfied with our selection of accommodations without paying an outlandish amount of money.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jackson, MIchigan", "Title": "“Perfect!!!”", "Author": "JaxMI", "ReviewID": "UR62475136", "Content": "We loved Hotel Paba and Alberta! The place was very clean, quite, & in an excellent location! An Alberta - the perfect hostess - she gave us great ideas for dinner and making our connections to other sights and the airport - she was very helpfull! You can't go wrong with this one!!! Jackson, Michigan USA", "Date": "April 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Perfect hotel in perfect location with perfect host for perfect price.”", "Author": "Karen255060", "ReviewID": "UR62201578", "Content": "We can not say enough about Hotel Paba and Alberta. Wonderful location, beautiful room with balcony, warm, clean and comfy, and very quiet even though it is just around the corner from the Colosseo. Alberta was so lovely and always helpful with good advice on eating, travel and bookings. She even bought us breakfast every day. We can highly recommend staying there when in Roma.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Central Florida", "Title": "“Perfect location and precious owner!”", "Author": "StacyCentralFlorida", "ReviewID": "UR61182362", "Content": "Mrs. Castelli, who is the owner of Hotel Paba, was precious and so helpful. She knew buses, subway lines, places to eat, and was just a delight to talk to. Our room was spotless and she served us breakfast in our room every morning. The hotel is around the corner from the Coloseo and down the street from Victor Emmanuel Monument. It is down the block from both the Cavour or Coloseo Metro stations. There is so much to see and do steps from the hotel. You will not be disappointed!", "Date": "April 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hermitage", "Title": "“Very nice”", "Author": "HermitageTraveler", "ReviewID": "UR57652088", "Content": "I've never been to Italy and my friends booked the rooms. It's within walking distance to the collisium, and great sight seeing. The owners were very nice and accomodating. We all had a great time and felt very safe. If I can ever make it back I will absolutely stay there.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Clean Hotel with Air Conditioning, Helpful Staff and Great LOCATION!”", "Author": "NicholeandScott", "ReviewID": "UR55843023", "Content": "Alberta was wonderful to us and our guests. She gave wonderful suggestions for meals. This was my 5th time to Rome and my favorite location of all that we've stayed. The bed was comfortable. The room had air conditioning. The noise outside was minimal and you can use the shutters to keep out the light of day if you need to. This couldn't have been a better location for all that we wanted to see and do. Not far from bus or train stations.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berlin, DE", "Title": "“Excellent two star hotel. Would recommend and stay here again.”", "Author": "laltin04", "ReviewID": "UR55622714", "Content": "Great value for comfort, quality near the center of Rome. The staff was so helpful. One of the better two star hotels I have stayed in Europe.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portland, ME", "Title": "“Delightful, terrific location, great value”", "Author": "PeripateticTwo", "ReviewID": "UR53637940", "Content": "We found this place on TripAdvisor and were skeptical, but the location and price led us to take a chance. As other reviews identify: amazingly convenient to Roman Forum and Colisseum, as well as transportation. We walked everywhere except to the Vatican. Wifi and large, comfy room. Very helpful staff. Surrounded by little shops and restaurants, including incredible gelateria. Small number of rooms on second (third) floor of unassuming building with offices and apartments. We had balcony onto via Cavour,", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Falls Church, VA", "Title": "“Best Little Hotel in Rome... Location and Wonderful Hosts!”", "Author": "TravelingCarter", "ReviewID": "UR52581442", "Content": "I cannot say enough great things about Hotel Paba. First of all it is a total steal for Rome. The location is AMAZING... just a block from the Roman Forum and only a few blocks from the train station. We actually walked from Termini one day. It took about 20 minutes but was all downhill. Also, the two women who work there are so sweet. They spoke very little English but with our broken Italian we got by just fine. They even called our long lost Italian relatives to help set up meeting them. Our room was massive and very clean with a sitting area, walk-in closet and bathroom. Nothing fancy but lots of space. Each morning they would bring breakfast (yogurt, rolls, jams, juice and cappacuino) into our room. I would stay there again in a heartbeat!", "Date": "January 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "mission viejo", "Title": "“Good value”", "Author": "livinthegdlif", "ReviewID": "UR51680359", "Content": "Location was great. Alberta was very accommodating. Very firm mattress. Breakfast same daily. GREAT VALUE!! Just book it.", "Date": "December 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Another Great Stay-”", "Author": "DCATraveller", "ReviewID": "UR51019949", "Content": "Stays at Hotel Paba get better with each one- Stayed back in March 2009 for 4 or 5 nites with a friend-Mrs. Castelli the owner, is a wonderful host of her hotel. Kind and helpful with any request. In the morning I would go to the desk and practice my Italian with her when asking for breakfast-her tips on place to eat are spot on and never had a bad meal, the location can't be beat, you can walk to most everything and with the metro and the bus right there the rest of Rome is at your finger tips- Extremly clean and the beds are wonderful-Had room 6 I believe with the balcony, loved to stand out there in the morning and watch Rome wake up-I would reccommend this wonderful hotel to all-Make sure you to the store right across the street for panni or pizza", "Date": "December 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oregon coast", "Title": "“Bargain hotel in a great location”", "Author": "ljr88888", "ReviewID": "UR50378290", "Content": "I thought getting a hotel room in one of the major cities in the world for 90 euro a night (about $135) was quite a deal. It pays to travel in the off-season! We arrived early in the day after an overnight flight but Signora Castelli had a room ready for us. Very nice-sized room with adequate space in the bathroom also. Via Cavour is a busy, noisy street but the room had double windows plus heavy curtains, so we slept well. Easy walking distance to so many of the major sights. We only rode the Metro to the Vatican and the Galleria Borghese. Metro stop is only 2 blocks away. Many reasonably priced restaurants in the area. Breakfast was a little too sweet for me ... sweet juice, an extremely sweet croissant, cappucino. The bread and yogurt were good, though. On the 2nd morning I asked for \"caffe americano\" and Sra. Castelli showed me how to use her coffee machine to help myself to a second cup.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "MA", "Title": "“Great Location, Clean & Cozy”", "Author": "jasmineinma", "ReviewID": "UR49192720", "Content": "Spent 3 nights here on our honeymoon and it was a great spot. Room was small and cozy, but clean and quaint. The location is perfect for packing in great sightseeing. The proprietor is good-natured. The price is right. She brings a breakfast plate to the room with a pastry, roll, yogurt, and coffee, which was a relaxing way to start the day. We would stay here again if we were in Rome. It was a short walk to the subway, and within an easy walk of the Colosseum.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Clean, Comfortable, Central, and Cost Affordable”", "Author": "rogerandlaura2009", "ReviewID": "UR48648435", "Content": "We loved Hotel Paba! The Staff was professional, courteous, and helpful. The Rooms were so clean! -\"As tidy as a box of chocolates.\" IAlthough central to everything, the rooms were quiet. We have no reservation in recommending this hotel!", "Date": "November 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "So Cal", "Title": "“Great location for historic Rome”", "Author": "Luvcdays", "ReviewID": "UR48593758", "Content": "We loved the location, even though it was on a busy street. It reminded us of New York City. Everything was in walking distance, restaurants, shops, historic sites. The staff was great. The bathroom was large. The only complaint would be about the bed. It was hard as a rock and I didn't sleep well all 3 nights. I even took 4 blankets and folded them into quarters and placed them under the bottom sheet, but it was still too hard. Breakfast was definately adequate.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ohio", "Title": "“Hotel Paba, a great place to stay in Rome!”", "Author": "Krupp60", "ReviewID": "UR48513141", "Content": "We stayed at Hotel Paba about a month ago! We were very comfortable with the room. ..much larger than most European rooms and the bathroom a good size as well. It was also very clean, and I am very particular. We were in the Imperial Suite, which had a small cabinet in the bathroom to put your toiletries (nice and convenient). Also, the hotel had a complimentary pair of women's slippers with Hotel Paba written on them. The mattresses were hard and I thought they would be uncomfortable, but they were not. We called every morning when we were ready for breakfast and was brought two croissants, two rolls with butter, jam and cheese and a beverage....we chose cappucino and orange juice. Very filling to start the day. The location was awesome!. We walked to all the main sights, except the Vatican, which we took the subway (very, very crowded and watch your purse, bag and pockets). As mentioned earlier reviews the Coliseum is just around the corner. Do see this, but can't imagine going to Rome and not. We went on three Through Eternity Tours (Roman Forum, Coliseum and Rome Evening Tour), which were very good and informative and we recommend highly. Also, we ordered the free tickets online to see the Pope at the Papal Audience on Wednesday mornings at 10:30 at, of course, St. Peter's Basilica. Our stay in Rome was very memorable and the hotel was great! If and when we return to Rome, we will stay at Hotel Paba!", "Date": "November 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Really good location”", "Author": "Asd123Gr", "ReviewID": "UR48487294", "Content": "Hotel Paba is as described in its reviews. We stayed there for 3 nights at the end of October 2009. The room (Room 6) was much better than we expected. Really big (about 25 m2 together with the toilet), especially for Italy standards. The bed was the biggest I had ever seen. Probably it is constituted by two separate beds. The lady at the reception desk was more than helpful while our staying there. Breakfast was nothing special. Little cafes offer whatever you like. We selected a room with balcony, but then we realised that it was noisy at night and at early morning. However, we did not bother as sleeping deeply was not our purpose for our 3-day trip in Rome. Also, since the building is old, there was noise when other room occupants were flashing their toilets or were having a bath. The only significant drawback was that we discovered hair from previous occupants in the bathroom floor and on the bed sheet. However, we did not complain to the Hotel lady, so we cannot accuse her of taking no action. On the contrary, I am sure that if we had compained, she would do her best to satisfy us. The Hotel location is perfect. Most of archaeological sites are within a walking distance. We even walked all the way to Piazza Navona, Pantheon, Spanish Steps and Piazza del Popolo in one morning. Via del Boschetto has very good restaurants (especially the one in the corner with Via Nationalle). Metro station (Cavour) is about 5 minutes away. I hope I offered you some help.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City, Mo", "Title": "“Great location, huge rooms - good value!”", "Author": "JessicaKansasCity", "ReviewID": "UR47635259", "Content": "We stayed 3 nights in October. The location is ideal - about 15 minute walk from the Termini, about 5-10 minute walk from the Colosseum and the Metro stop. Lots of good restaurants nearby. The only downside of the location is that it is on a very busy street, so there is a lot of traffic noise and the last night we were there, we could hear drunken people outside our window, even though it is on the third floor. The room was huge with high ceilings. The bed is a king size and is VERY firm. The room was clean, but the bathroom and shower were very small. Alberta was very nice and brought us breakfast in our room every morning whenever we wanted. We would call the front desk and she would have it to the room within 5 minutes. Overall, great value. We would stay here again.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "illinois", "Title": "“Value, location, clean, helpful...has it all”", "Author": "pjbIllinois", "ReviewID": "UR47046139", "Content": "Just returned from Italy and spent our last 5 nights at Paba Hotel. A real gem. I agree with all the good reviews. Two things not mentioned that we really enjoyed. The \"lift\" is one of those old fashioned black iron french kind of lifts that was a joy to ride. It was quieter than a hybrid car! Also the staff at Paba arranged for a cab to take us to the airport at 4:00 a.m.. One of the staff called us at 3:45 (possibly from their home) to tell us they had done so! And the cab ride was only 40 Euro's. We paid 20 Euro's for a cab ride at 6:00 a.m. in Sorrento that was less than a mile! Our only regret is not meeting Alberta as she was in Milan at the time. Perhaps next time as I am sure we would stay here again if we find ourself in Rome.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Rick Steves was right”", "Author": "tolistravelers", "ReviewID": "UR46879443", "Content": "I'll get the not-so-great out of the way first--hotel rooms are adequate, utilitarian. One of the two rooms had a much nicer bathroom than the other, and like Rick Steves said, the beds are a bit firm. Now onto what is great about the Paba. Location can't be beat. Easy access to get to everything, walking or the Metro, or the buses. Staff--Alberta was away during our stay, but Pina (who speaks little English) and her daughter Flaviola (spelling could be wrong, sorry) (Flaviola speaks English quite well) treated us like family. No request was too difficult to fulfill, and they were wonderful people. We were looking through a brochure of tours for a trip to Tivoli, and came across a cooking class. My Mom and I took it, and what a find. E-mail [--] (he is the chef). After shopping for fresh ingredients at several markets, Fabio takes you to a town called Mezzano Romano (Google it) that in itself is worth the trip alone and you cook fabulous food in his fabulous vacation property. This is worth doing with Fabio if you like to cook. Try to work in a visit to Ostia Antica and Tivoli if you can to see Hadrian's Villa and Villa d'Este. Going on your own to Tivoli is not easy, much easier to take a tour. Loved the staff and how well they took care of us at the Paba.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Great location, value and service”", "Author": "JBRV", "ReviewID": "UR46322022", "Content": "As soon as the reservation was completed I received a confirmation email from the hotel. Over the next few weeks we exchanged multiple emails regarding tour recommendations and restaurants, there were very helpful. I also received an email with several transportation options on how to get from the airport to the hotel. When we arrived we were allowed to check in early. The room was very roomy and clean. The hotel offered complementary internet and they took care of making all our dinner reservations. The hotel was in a great location just a few blocks from the Coliseum and The Forum, and the train station. At the time of check out we were charged less than we were quoted at the original reservation. When we go back to Rome we would definitely stay at Hotel Paba again.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "flower mound, texas", "Title": "“Wonderful location, large bedroom, great complementary breakfast and friendly staff.”", "Author": "char74", "ReviewID": "UR46259356", "Content": "This hotel only has a few bedrooms and no restaurant but the room we stayed in was very nice. It was clean, very large (especially for European rooms), had a mini refrigerator in the room and included a wonderful breakfast - brought to our room each morning so we didn't even have to get dressed to go eat. The staff was very friendly, helpful and spoke English. But the best part was the location -- The Roman Coliseum was literally right behind the hotel!!! This hotel is within walking distance of several other main attractions and close to the train station, bus stops, etc. There are many restaurants in the area. I would definitely stay here again. It is not your \"American 200 room hotel\" but that wasn't what we were looking for. We wanted a clean room, close to sites and friendly staff and that is exactly what we got. Very friendly/quaint hotel.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Hotel”", "Author": "dopee36", "ReviewID": "UR44419103", "Content": "What a nice little hotel. The room we had was huge! There was even a separate room (in front of the bathroom though) with another single bed in it. The bathroom was large too (for Italy). We had a really nice time there. The hotel is centrally located, so we walked almost everywhere. We did take the train sometimes, but it was probably because we were feeling a little lazy (it was the last city of our whirlwind Italy tour). There's an elevator too, which added to our laziness. The hotelier is really nice. She's extremely helpful and every night, she suggested a different restaurant for us to try. And every one of them was delicious. If you stay here, definitely ask her to recommend places for you to try. You won't be disappointed. Breakfast is served in your room (not very good, I'm afraid). The room is very clean and comfortable. I know there was at least 2 other hotels in the same building, but I would definitely stay with Hotel Paba again instead of the others.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Richmond, VA", "Title": "“Can't beat the location”", "Author": "cc03", "ReviewID": "UR35587506", "Content": "My husband and I stayed at Hotel Paba for 2 nights in May 2009. Alberta was very welcoming after we arrived from a delayed flight. Our room was small but efficient. It was located right of the reception area which concerned me at first but we had no trouble with noise. Breakfast was served in our room and consisted of hard rolls, yogurt and delicious croissants. Also Alberta gave us a wonderful dinner suggestion. We loved it so much that when we returned to Rome at the end of our trip we made reservations to return to the same restaurant. The best part about this hotel is its location. You are only a few blocks from the Forum and the Coliseum. We walked to all of the major sites from the hotel. Hotel Paba was also only a 20 min walk to the train station. I would stay at Hotel Paba again.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great hotel and fantastic location”", "Author": "cjb11711", "ReviewID": "UR34299492", "Content": "My husband and I stayed at this hotel for 3 days in June 2009. The hotel is located just a minute or 2 from the Colosseum. Alberta is the owner of the hotel and she cares for it very lovingly. She is a great resource in her knowledge of the city. Immediately after we arrived, she made a reservation for us at a great restaurant. The hotel overlooks a busy street (Via Cavour), but our room was in the back of the hotel and was very, very quiet. The beds are huge by European standards though the room itself is an average size. It is very clean and the bathrooms are very modern. It is also very close to the Rome metro, which is great because there are many hotels located in Rome that are far from the subway. Your room rate also includes a simple continental breakfast served in your room. Overall, a great value.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“Very nice and good value”", "Author": "Kathy50", "ReviewID": "UR30483737", "Content": "We enjoyed our stay at the Hotel Paba. Alberta was kind, gracious and professional. Our room was charming and very, very clean. The breakfast, which was delivered to our room, was nice with a croissant, cappuccino, and some cheese and crackers. Our first morning we overslept (jet lag!) and Alberta brought us our breakfast at 1:00 in the afternoon! Thank you, Alberta, for your TLC of this charming value in the heart of Rome.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Lovely host, very accommodating”", "Author": "MarieBLondon", "ReviewID": "UR30458162", "Content": "Wonderful location, clean, quirky, charming, and provided us with an extra bed for our son. Offered great advice on local restaurants.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "CT", "Title": "“Perfect Location and Great Service”", "Author": "CTSapphire", "ReviewID": "UR28081288", "Content": "Hotel Review: My husband and I stayed here for 2 nights during Easter week. We were greeted by Signora Alberta who runs the hotel. She is a warm person without being over bearing. She provided us with a map and also with some tips on how best to cover the city and best times to get to each location. Breakfast was simple and adequate. Wonderful fresh crossaint, bread with assorted cheeses, yogurt, juice and choice of several hot beverages. This is considered a very substanial breakfast in Italy and was very nice way to start off the day. Great water pressure and nice towels. The location was incredible. We were around the corner from the Colosseum and a short walk from the Termini Station. We walked everywhere. The furtherest point was Vatican City and St. Peter's Basilica which was only about 20 - 25 minutes at a slow pace. But it is part of the experience to stroll the streets and enjoy the views and stop along the way to grab a gelato or snap some photos. Some Rome Tips: If you have the chance, eat in the area of Travestere. This is a wonderful and authentic Roman neighborhood. Fantastic restaurants and the prices are much lower than the other areas. Grab a bottle of wine and relax on the Spanish Steps - and try to ignore the people pushing flowers. Just say no and they will leave you alone. Not a big deal so don't let it ruin your vacation. The audio tours are worth a little extra to get a history and background of the sites (Colosseum, Vatican Museum). Also, keep an eye on the street vendors' prices. They are higher than the actual souveneir shops so look out for price tags on the street vendor items (they will mark them up and then offer you them at half price which is still higher than shops). They are not honest people which is something we figured out by doing some quick comparison shopping. We did not have any issues with pick pockets. There were more tourists than locals so we always felt very safe day and night.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Antonio", "Title": "“The Perfect Family Hotel in Rome”", "Author": "bibiloo", "ReviewID": "UR26625009", "Content": "My husband and I and our three children (ages 14,12, and 10) stayed at the Paba Hotel for seven days during Spring Break. It's not easy to find a hotel that can accommodate 5 people in one room, especially in Rome, and what a find this was! We had the \"Happy Family\" room (love the name!) which was spacious enough for all five of us PLUS our five suitcases! The room, described by Rick Steves as \"chocolate-box tidy\" was spotless, comfortable, and nicely decorated. It has a king-sized bed (big enough for my husband, me, and the 10 year old, and although we could have had an extra bed set up for her, we opted not to and were fine), a twin bed, and then another twin in an adjoining little bedroom (claimed by my 14 year old son). There's free wi-fi in the room, a satellite tv, safe, hotpot for tea and mini-fridge which was perfect for our drinks and snacks. The bathroom was spotless and included a bidet. Although it is located on busy Via Cavour, we had no problem with street noise. The location is perfect...just a short walk from the forum and colosseum and close to sightseeing, bus stops, two metro stations, shops, ristorantes, bars and gelaterias (very important for kids)! The gem in the crown, though, is Signora Alberta Castelli, who runs her hotel efficiently and lovingly. She was very helpful in suggesting transportation, restaurant, itineraries, you name it. We looked forward to seeing her every morning as she brought us our yummy Italian continental breakfast (fresh delicious sweet croissants, rolls/jelly/butter/cheese, hot chocolate, espresso, orange juice and yogurt). She translated a phone call from an Italian family friend for me, gave us tips for our daily outings, helped me with my (bad) Italian and was always gracious and ready to help. All this for a very reasonable price. Oh--and don't be put off by the exterior of the building in which the hotel is housed. Unfortunately the door has been graffiti'd (as we found was the trend in much of Rome) and the trash cans for the block are lined up outside, but it has nothing to do with the quality of or the interior of the building. It is a great area of Rome in which to stay, with lots of sights to see within a short walking distance and everything else easily accessible by bus or metro. As some other reviewers mentioned, the king-sized mattress in our room was very firm, but the only one who cared was my super-picky husband, who traded with the 12 year old and slept in the twin bed for the last few days and was fine. Pina, the very pleasant chamber lady did an excellent job of housekeeping, providing fresh linens and towels daily. I look forward to my next trip to this incredible city and for sure I will stay at the Paba Hotel.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chapel Hill, NC", "Title": "“Definitely the place to stay in Rome. Convenient and Alberta is wonderful.”", "Author": "TravelingDentist09", "ReviewID": "UR24700282", "Content": "From the outside the hotel does not look like much. We were actually disappointed when we saw it from the outside. We found the hotel through Rick Steve's book. But once we got in, it was wonderful. Location It is very close to all of the major attractions. We were within walking distance of the roman forum and the colliseum. And to be honest, we walked just about everywhere in Rome. The Trevi Fountain wasn't too far, the Pantheon wasn't bad either. One thing that my wife mentioned is that she wished the better restaurants were closer to Hotel Paba. Most of the restaurants we liked were located more towards the Pantheon side of town. But all in all an excellent location. Service Alberta is top notch. Our daily routine included waking up and letting Alberta know that we were ready for breakfast. She would ask what we would like to drink, I liked the espresso, my wife liked the cappuccino. The breakfast consisted of pastries and yogurt. Simple yet filling. Then we would go over our itenerary with Alberta, she would show us the best streets to walk on and where to visit. Incredibly friendly woman. Rooms The room was cozy. The decor was clean. The TV was small and the showerbox was useful. Other than that we didn't really used the room much. The AC was comfortable and the window view, well it was just a view of the building next door. She had books available to read about Rome, and that's what I would do at night. The room was cute. I do wish we had internet connection at night, so I could catch up on things, so hopefully Alberta will implement that in the future. Value I believe this has got to be one of the better values in Rome. There is a cash discount, so don't forget to ask for it. Overall This is where I will stay if I ever get a chance to go back to Rome.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Wonderful Inexpensive Hotel”", "Author": "AlaskaJoey", "ReviewID": "UR24058328", "Content": "I stayed here for 9 nights in mid January, and couldn't have been happier. I paid only 70 euros a night for a double room, single use. Signora Castelli was a charming hostess, and extremely helpful with arranging daytrips, museum bookings, etc. The room was clean and comfy - and I prefer a harder mattress, honestly. It's better for my back. Graffiti is a part of Rome, and I work daily in NYC, so the neighborhood didn't bother me at all, and I felt safe there. There are tons of restaurants on the street, grocery stores, and 2 internet cafes as well. I was on the street side of the hotel, and for the first night I wished I had earplugs, but afterwards the noise didn't bother me - I was so tired I slept through each night.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Paba was great!”", "Author": "IAS_NY", "ReviewID": "UR23230227", "Content": "The Hotel Paba is more of a bed and breakfast than a hotel. Very small, clean and homey. The room was a bit too small especially for tourists like us who had way too many suitcases, but the room was comfortable. The beds were a bit hard, but frankly we had such busy days that we slept pretty well every night. We had breakfast in our room at whatever time we asked. Sra Alberta Castelli was a terrific hostess and happy to help in any way. We were in during Christmas week. During the days around Christmas Alberta was away but her assistant could not have been more helpful. She made so many telephone calls for us trying to find a decent place for us to go for New Years that was not too expensive. Only slight negative was that our room was on the main street and at night it was sometimes noisy. That bothered my daughter but not me. GREAT location - close to a metro stop and just 2 blocks from the Roman Forum, on a touristy street where we felt safe at all times. Across the street from a grocery store, post office. Great value. If you want a nice comfortable place with easy a cess to everywhere important in Rome and helpful staff, at a reasonable price, this is the place for you. If you want luxury, go somewhere else.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Great Location, Great Value”", "Author": "rckt", "ReviewID": "UR22681979", "Content": "My family and I stayed here for 6 nights. We chose the hotel based on the Tripadvisor reviews and its location. We were extremely pleased with our choice. It is in a great location; within easy walking distance of most of the main tourist sites and it has a bus stop right outside the front door. You can also walk or take a short bus ride to the Termini Station. An added bonus is Senora Alberta. She was extremely helpful in explaining how to get to places, suggesting out of the ordinary places to visit, and in general with everything. We ventured out in the early A.M. several times before breakfast was served, and she made sure we had access to the food before we headed out. Speaking of breakfast, while simple (croissant, pastry, yogurt, etc.) it was delicious! The best breakfasts we had in our 3 week tour of Europe! The rooms are simple yet comfortable. The bathrooms are more than adequate from a size perspective, the shower was very good, and the rooms were quiet despite being on a main street. While I agree that the street entrance leaves something to be desired, we got over that very quickly. Once inside the building, you forget about the entrance and have fun with the elevator. The hotel lobby itself is very nice albeit small. Having been to Rome before, I cannot imagine a better hotel value especially when combined with the terrific location.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wilmington, DE", "Title": "“Great find at the Hotel Paba!”", "Author": "mslgirl", "ReviewID": "UR21952373", "Content": "We first read about the Hotel Paba in Rick Steve's Guide to Italy and contacted them for our last minute trip. The rates were really reasonable and the reviews on TripAdvisor seemed pretty good. We only spent one night at the hotel because of our flight time, but we were very pleased. Some people complained about finding the hotel - while it does not look like a hotel from the outside and the door has graffiti, it's easy enough to locate the hotel by the address. Once inside and on the second floor, where the hotel is located, it is very clean and looks very nice. The room was quite clean. The TV included many American stations - we even watched college football. I think some reviews said the breakfast wasn't good - while it was simple - just yogurt and some breads - they were fresh and good and it was nice being served in our room. The hotel staff was friendly and knowledgeable. While this is not a '5 star' hotel - for a clean and conveniently located hotel - the Hotel Paba is a gret choice.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Waltham, MA", "Title": "“Great Location and Staff”", "Author": "cornetml", "ReviewID": "UR20870436", "Content": "This hotel is in a perfect location! We were able to walk to the hotel from Rome Termini and on a day with good weather, a manageable walk from the Pantheon, Trevi Fountain, Colusseum, etc. The hotel is small so breakfast is served in the rooms, but the breakfast was great! We had to check out early before the front desk clerk had arrived so the staff showed us where we could help ourselves to breakfast. They wanted to make sure we didn't start our journey on an empty stomach! The room was very clean with a modern bathroom and was spacious enough for two people. Would definately recommend!", "Date": "October 14, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Iowa", "Title": "“Excellent choice”", "Author": "GritsIowa", "ReviewID": "UR20605274", "Content": "We were very pleased with our stay at the Hotel Paba. I choose the Paba based on reviews and comments I had read on Trip Advisor. The staff, Pina and Fabiola were outstanding. They were very solicitous of our needs and comfort. Our room was very spacious and comfortable and the bed was excellent. The breakfast, served at our convenience in our room, was tasty and served promptly after we would call. We really liked having our hotel within a few blocks of the Colosseum, the Forum, and the Piazza Venezia. And we found several excellent sidewalk restaurants with a few blocks of the hotel that were reasonably priced with fine food and service.", "Date": "October 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver Colorado", "Title": "“I am a travel agent. Senora Alberta is the best!”", "Author": "Jabalu", "ReviewID": "UR20540798", "Content": "I am a travel agent so I should know. I booked this hotel many, many years ago by looking on the internet before there was anything like TripAdvisor. It was my first trip to Italy and the first place we were at out of a 3 week stay. Senora Alberta suggested one of the best restaurants we ate at in Rome. Even though the room was small, it was very clean, the breakfast was one of the best offered, and in a prime location. I have since been back a few times and have booked many a client with her. She knows Rome and it has been a while since we have been back. I miss Italy and her. On one of our other trips she helped us with Sicily as well. This hotel is a gem!", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore!", "Title": "“Good hotel!”", "Author": "Nitr0gen", "ReviewID": "UR20190621", "Content": "It was pretty difficult for us to find the hotel at first. And it seemed that a lot of people we asked had not heard of this place. However, if you just get onto the right street and follow the numbers (266) then it shouldn't be too difficult. There is a small signboard that tells you it's on the 2nd floor. The lift they use is a really small, old fashioned one. Perhaps its common in this part of the world, but it was quite interesting to use. The staff were all very friendly and the rooms were of different sizes. The room we stayed in was pretty small, but I guess for the rating and price, it's pretty ok. Breakfast was croissant, soft roll served with butter and cheese and coffee/tea. Served in your room at no extra charge all the way to 12 noon! The juice in the mini bar comes with the breakfast. There is a mini safe and the TV has cable, though not all english language programs can be switched to english, but you don't go all the way to Italy to watch TV right? The bathroom was small but it was very clean and looked like it was recently renovated. Quite nice decor actually. Anyway, as the other reviews have mentioned, it's close to the Colosseum and Roman Forum. There are some nice restaurants along the street serving very affordable Italian food and the train station is pretty close by too. I'd say that this hotel is perfect for first timers to Rome as its pretty much in the middle of a lot of things, but I'm not too sure if I want to return. The rooms are a bit too small for my liking, though the service is GREAT!", "Date": "September 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Should have been a three star!”", "Author": "rligsay", "ReviewID": "UR20040051", "Content": "I wanted to take a minute to offer praise about this hotel. My boyfriend and I stayed here during one of THE hottest times of the year in Italy. We flew in from San Francisco and we were hot, tired, and so excited! We were looking forward to our first trip to Italy and just wanted to get where we were going without any surprises and without any disappointment. Fortunately, Hotel Paba offered just that! When booking with Hotel Paba 2 months before, I was given a helpful email that had prepared us with information right down to the view from the hotel to across the street. This was helpful as we were walking from the train station (which was about 10 mins) to the hotel. We didn't notice the huge sign next to the door (as we were looking for address numbers) but did see the chinese restaurant and post office they mentioned in the email from accross the street. Once in, the hostess Alberta was friendly and very informative. We felt comfortable asking ridiculous questions. She gave us the honeymoon suite which had its own private bathroom, air conditioning with a remote control, mini-fridge, and private safe. It had a queen size bed that was not, under circumstances, the softest. It honestly looked like a flat board rather than an actual mattress BUT it was suprisingly comfortable. The \"queen\" size looked like two half-full size beds pushed together but it worked. The next morning she offered us a breakfast that was simple yet filling and very delicious. In fact, my boyfriend searched all over Italy for the juice that came with it (and we actually found it and brought it home). All in all, I had a nice experience at the Hotel Paba. It was very small, about 8 rooms total I think, but homey and very pleasant. It was easy to get to the sights from our hotel. About a 10 min walk from the train station, a 3 minute walk to the colleseum and the roman forum, etc .I highly recommend staying here for the decent price, the location, and the hospitality!", "Date": "September 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great place!”", "Author": "nahlalee", "ReviewID": "UR19601764", "Content": "Loved this place. Great location very close to ancient rome (Colosseum, Roman/Imperial forum, etc.) Close to the metro. We were in room 7, the Director's Cove. It was small but the usual European standard. Don't know what the other rooms are like. Albergo was great. She gave great recommendations for restaurants and for seeing the sights. Remember, she's ALWAYS right. If she says go at 2pm, or go 30 minutes later, do what she says!! We were saved lots of time in lines by listening to her. The room was immaculately clean, loved it. Although you have to register for wifi every 2-6 hours, it is free, albeit a bit slow. (The registering process and slow speed seems routine in Italy.) The free breakfast Albergo provides every morning is more than what you'll get in restaurants/cafes. Italians don't seem to take breakfast very seriously.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Hotel, Great Location, Fantastic Hostess”", "Author": "teresavimini", "ReviewID": "UR18506638", "Content": "I booked a 3 day stay directly with the wonderful owner Alberta, and was given a great rate for a double room single use. The room was huge by most Italian hotel standards,and absolutely clean as could be, probably one of the cleanest rooms in Italy that I have ever stayed in ( and I am a frequent visitor to Italy). Daily service of the room was impeccable. There's a huge King bed, which was really comfy, big LCD TV, writing desk, little corner table and chairs, spacious spotlessly clean bathroom, she even provides slippers, nice touch. Breakfast is great, all you need to get you going for a day of walking and sightseeeing in Roma, coffee any way you like it, orange juice, croissants, yummy bread rolls with an assortment of cheeses, jams etc, theres yummy Italian yogurt, and whats great about breakfast, the lovely Alberta serves it in your room whenever you like, you just ring and tell her you are ready for breakfast. The location is superb, Via Cavour, near my fave part of Roma- Monti. I walked and walked everywhere. The view from the window is of all the buzz and activity of Rome, and actually very quiet at night also considering that it is facing the street. I asked for a front room and was wrapt at the view and the bonus of it being so quiet, I slept like a baby. I cannot recommend this hotel and Alberta highly enough. She is a lovely Iady who is of the utmost professionalism. This Hotel is rated 2 stars but really it should be much higher. Do yourself a favour and stay at the hotel Paba.Thankyou Alberta for such a wonderful stay in your hotel.I will be back!", "Date": "August 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sandy, Utah", "Title": "“Great Experience”", "Author": "Jazzfan", "ReviewID": "UR17111189", "Content": "We stayed for 4 nights in April, 2008 and couldn't have been happier. Great location. The bed was gigantic and comfortable and we had a small balcony that overlooked the street so we could watch the insane Roman traffic. Alberta couldn't have been more helpful. We would definitely go back.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Great little place convenient to all the major sights in Rome!”", "Author": "breakoutofthebox911", "ReviewID": "UR16614796", "Content": "my wife and i stayed at hotel paba for three nights in may of 08... it is on the second floor (small elevator works well) of a large building off of via cavour, a busy street stretching between the forum ruins and termini train station, the main train depot in rome. this hotel is just great... lovingly cared for and owned by alberta castelli, a wonderfully accommodating, friendly and helpful woman. she speaks very good english, knows a number of money saving tips for tours and transportation throughout the city, and is always available for help. she is more than willing to make reservations at the vatican museum and other sites. i would highly reccomend such reservations, as the lines for regular admission into the vatican are hours long, whereas we walked right in with the reservations we had. just a quick tip about transportation... metro is busy but clean, buses are busy but effective. cabs and or taxis are a last resort, and DO NOT use ANY taxis without a meter! we got totally ripped off and learned this lesson the hard way. also, if you are near piazza navona, eat at tre archi, a little hole in the wall just off of via zanardelli 4 doors down on via dei coronari. the best pasta and house vino we had in rome! try the torinelli alla ciociara... absolutely delicious pasta in a tomato cream sauce with mushrooms and bacon : ) yum! anyway, our room at hotel paba, 'the lover's nest', was spacious, clean and quiet. i would request this specific room if possible... it seems to be the farthest from the desk and the quietest. HUGE king bed (a little stiff, but not bad)... plenty of room for luggage and clothes in the armoir. the bathroom was great with a good sized shower stall and a heighth- adjustable shower head... convenient for those of us who are tall (i'm 6'6\"). alberta serves a simple but great breakfast of pastries, yogurt, tea, coffee and european crackers anytime you like, all of which is included in your stay. the hotel is a 10 minute walk to the colloseum and a major metro stop. it is not close to the vatican/ st. peter's/piazza navona, but just hop on the metro or the 116 bus and you're there. plenty of restaurants nearby, but DO NOT eat at MASSENZIO down on the corner... way over priced, crummy food served by rude staff. always seek out the places where locals eat... all in all, hotel paba is a great little place to base yourself while exploring rome... friendly, clean and a great value! you will get a lot for a small price in comparison to most of the other hotels in rome... travel safely :)", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Delightful clean little hotel perfect for a stay in Rome”", "Author": "Ruebrezin", "ReviewID": "UR16533761", "Content": "Two words that cause me to give this hotel a very high rating are: Alberta Castelli. Alberta runs a wonderful, warm 7 room hotel located on the 2nd (Euro) floor of a building on Via Cavour, near the Colisseum. If you are looking for special grand scale amenities, this is not for you. But, if you are looking for a wonderfully clean hotel, with a person who can direct you to the finest (not necessarily expensive) restaurants, help you with reservations at museums, greet you with a friendly smile, serve you breakfast in your room (tables in all rooms); this is definitely the hotel for you. Don’t let the 2-star scare you AT ALL! This is a great little hotel, on a busy-ish street. Because the hotel is only 7 rooms on the 2nd floor and not the entire building, the sign is small next to the door, but if you have the address with you, you or your driver will find it with no problem. Breakfast is croissants, little rolls and yogurt, juice or coffee or tea. Frankly, it was nice to eat and not have to get dressed beforehand! When you left your room, you were ready to head out for the day! I liked that right across from the hotel is a Tabachi, where you can buy train tickets, stamps, post cards, 2 shops where you can buy food, wine, olive oils, etc., and the post office. Just off the street on either side are little winding streets, like alleys, with little shops, restaurants, and gelato. If you head “up” Via Cavour towards the Metro stop and stay to the right, you will find a full service grocery store as well! We walked nearly everywhere and only succumbed to taxis at the end of some days because it was so unseasonably hot and we didn’t have summer clothes with us! The taxis are easy, the drivers are friendly. Alberta suggested reservations if dining after 8 pm which we did on each night. We liked one restaurant so much, we went back twice, something I never do while on holiday. Some people have written here that the beds are hard, but honestly after a long day in Rome, I was perfectly comfortable – and I am not a good sleeper, but I was in Rome! When we arrived Alberta noted that the room she had booked for us, Room 7, would be too small as we had more bags than she realized. She wasted no time in making sure that the next day she would move us into a larger room, Room 4, on Via Cavour side as that room was available the next day. I would definitely stay here again on a next visit to Rome. It is like staying with your mom or grandmom and you treat the room as your own home, it is so clean and welcoming. OH – and there is even a tiny lift so you don’t have to haul your bags up the stairs. The Via Cavour side is a bit noisier than the back side of the hotel, but that didn’t bother us because we like to hear and see activity in a city where we are staying! There is A/C too and I admit that we did use it on a couple of nights when the temperature soared. Alberta is very responsive to your questions if you are planning to book, just email her and you will hear back from her the same day or next. Don’t hesitate to book here! Ciao!", "Date": "May 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“Good experience”", "Author": "eurotraveldemon", "ReviewID": "UR14855449", "Content": "The hotel is in a great location, fairly close to the bus/train station. You are a block away from the Colosseum. Alberta is very nice and helpful. She booked our dinners on a moments notice all but one night. Every restaurant she suggested was fantastic and close to the hotel. The room is large by European standards, with a large bed. It was very clean. The en-suite bath was very clean and quite a good size. There is ample storage and closet space. Our room had air conditioning and a small balcony. The bed had decent linens and nice fluffy pillows. However, it is true that the bed was very firm, I didn't sleep well the first night. However, this has been true of every hotel I stayed at in Italy and my friends who have been to Italy just a few months before, warned me of the same thing and they stayed at other 3 and 4 star hotels. After the first night, I had no trouble sleeping (either because I was so tired or because I became used to it). Just to show that this is somewhat subjective or a matter of taste, my husband had absolutely no problem sleeping and didn't think the bed was too firm. The breakfast is a simple continental style, with a croissant, cappuccino, rolls and spreads, yogurt and orange juice. We had plates and silver. I won't say it was exceptional or great, but the bread was fresh and tasty and it got us through the morning each day, plus it was included in the price and served in our room when we wanted. The decor in the room is pleasant, but not fancy. Overall, the room is a great value for the price in this expensive European city. It is centrally located, has good service and offers all the basic amenities you need (safe, TV, hair dryer, storage, clean bathroom, comfortable). I'd highly recommend it for those traveling on a budget who still want a clean, comfortable, nice room and want good customer service. It isn't for those looking for luxury accommodations. I enjoyed my experience there and would stay again.", "Date": "April 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Wonderful Home While in Rome”", "Author": "cactusjam", "ReviewID": "UR14046482", "Content": "Alberta was wonderful!! The room was wonderful, quiet, comfortable and spotless. The location cannot be beat. We had a wonderful time. Alberta was more than helpful - she just took care of us. Will stay at Hotel Paba everytime we're in Rome.", "Date": "March 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Very pleased with the Hotel Paba”", "Author": "cnsl", "ReviewID": "UR13966256", "Content": "We heard about the Hotel Paba through Rick Steve's guide book to Rome. It is located near the Termini train station, the Colusseum, the Forum. After reading the positive reviews on this site and others, we contacted the hotel directly about a triple room. My husband, daughter, and I were thrilled to arrive to find a good size room - the Honeymoon Suite - with a huge bed, and also a single bed. The bathroom may be small by American standards, but it was very functional, and extremely clean. I was excited to have plush towels, and washcloths, having heard how different European towels can be. We stayed 3 nights and were treated wonderfully from the first email contact until we checked out. I would definitely recommend the Hotel Paba to anyone visiting Rome.", "Date": "March 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“Hotel Paba a great place to stay”", "Author": "sharib73", "ReviewID": "UR13917641", "Content": "Hotel Paba, is an older, smaller hotel, but you can't beat it for the price or the location. It is located in old Rome, literally around the corner from the Coliseum. The rooms are average size for Italy. They were clean and the room was cleaned daily, including bed liens, etc. The bathroom was a nice size as well. Each morning the owner, Alberta, brings breakfast to your room. The breakfast consisted of croissants, rolls, coffee, yogurt, juice, cheeses, etc. You can't beat that especially with the cost of breakfast being included in your room rate. Alberta is a gem! I stayed with my mom and we had a great time. Alberta speaks fluent English and could not have been nicer. She was very patient with our questions. She made reservations for us to eat as well as a day spa where my mother and I got massages. The only negative was the beds were a little on the hard side. But honestly I was so tired after walking all over Rome that I slept like the dead anyway. You also get a discounted rate if you pay for the hotel in euros. I would stay there again.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“perfect - will stay again - this is how it should be”", "Author": "USAIndytravels", "ReviewID": "UR13819217", "Content": "Myself and two friends stayed here for 5 nights and found the stay perfectly enjoyable. The room (#6) was large by European standards. It was equipped with three wonderfully firm twn beds. One of us is a \"big boy\" and the bed was just fine for him. The room had a small refridgerator and wonder little balcony over busy Via Cavour with double pane french doors and closeable shutters. Noise was not a problem. The bathroom was very large and the whole place was spotless. The lovely lady who cares for and runs the hotel was a perfect hostess, always available for advice and help. She brings a lovely little breakfast tray to your room each morning when you arrange time. The neighborhood was just fine. Never felt unsafe at all, even at night. Bus stops directly in front of hotel. Hotel is equidistant to two Metro stops. (By the way, the Rome metro and bus public transport system is wonderful and easy to negotiate to sightsee on your own). In the immediate area is a post office, bank (ATM) newstand (tobacco) store, two small gorceries, a couple of lovely restaurants, travel agent (for train tickets), souvenier shops and of coarse the Colossem and the Forum. Don't miss; St Peter's-in-Chains Church just a block up Via Cavour on the same side. It is a 5 min walk to the Forum/Colossem, 15 mins to San Giovanni in Laterano, 30 mins to the Vatican / Trasterve, 20 mins to Pza. Navonna, Pantheon, 10 mins to Via Nazionale shopping and 5 mins to Cavour or Colosseo Metro stops from the hotel. We personally walked it all! My overall impression of hotel is: cozy, comfortable, clean, safe and excellent price. The service was like family. I will definatly stay here again. I'm hesitant to let you all know, for fear it will become a \"secret let out\".", "Date": "February 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stafford, UK", "Title": "“No view but a fantastic location”", "Author": "Kelleth", "ReviewID": "UR13229469", "Content": "We have just returned from a fantastic stay in Rome, and the location of the hotel meant we could walk to every sight we wanted to see. The nearest was the Colosseum and Forum - barely a few minutes walk from your room (as you walk down the Via Cavour to the hotel for the first time you can see the awe inspiring Colosseum to your left as you near the Paba). All the other important piazza's, fountains and churches are around 10-15 mins walk away- although we were sure we could have found shorter routes but the Centro Storico is like a beautiful maze. The furthest we had to walk was to St Peters at 30 mins - we were amazed to find that it was free to walk around the basilica. The hotel was of very good quality for a 2 star - large rooms, high ceilings and well equipped bathrooms. We were disappointed to be given room 3 which was situated behind the reception desk (we heard guests arriving, phones ringing frequently) and which had no view at all but we rarely spent any time in the room. The breakfast was brought to our room but to be honest we only really ate the yoghurts. The croissants were coated in icing sugar (far too sweet for first thing in the morning), there were a few slices of a bizarre toast/biscuit thingy and a few jams and cheese spreads. I am sure it is authentic italian but it was all very indigestible at early morning. I recommend you buy some fruit and keep it in the fridge. It would also be wise to pack a cup/mug in your luggage as none were provided - we drank our tea/coffee in the plastic cups provided which were slightly hot in the hands! Also - we spent the first night using rock hard pillows before finding much softer replacements in the wardrobe. Alberta the owner was extremely helpful though, providing maps and advice - she also let us use the kitchen on our last day as we were leaving before her and the staff arrived for the morning. All in all, the hotel was very good for the money we spent. If you are looking for a base near to all the sights and with excellent facilities considering its rating - Paba is just the hotel for you. Just don't expect a view, its not guaranteed.", "Date": "February 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“not a bad experience”", "Author": "ann_tess", "ReviewID": "UR12790488", "Content": "we stayed in hotel paba for 4 nights in december. the directions provided were good.the best way to reach is to take the bus (75,84) from outside roma termini and it stops right infront of the hotel.the room was a bit small. but was very clean and had all facilities. the staff was also helpful.there are lot of amenities nearby and all attractions are reachalbe via bus/walk/train. metro stop is also in a walkable distance. the breakfast was poor. in short you get what you pay for and this is defenitely a 2 star accommodation.", "Date": "January 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“small nice comfortable hotel”", "Author": "nastik5", "ReviewID": "UR12522693", "Content": "We stayed at this hotel at the beging of november. it is very small hotel located on the second floor of the building. it has a small amount of rooms. the room where we stayed was called lover`s nest or something like this. it was a clean, big, nice funitured room. the hotel is situated in a walking ditance to the center. just opposite there is a bakery shop where you can buy all kinds of italian pizza. I liked most of all potato pizza with rosmarine. The lady in the hotel Mrs Castelli is so nice. She has told us the main places to see and how to get there. and also she has advised us a nice small restaurant which was on the next street. The restarant and the food was so good! it was very nice hotel in very reasonable price (for Rome). We stayed also 1 night in anothere hotel, which was more expensive and very poor and not nice.", "Date": "January 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great Price, Friendly Staff, Amazing Location”", "Author": "italo1881", "ReviewID": "UR11995750", "Content": "After discovering this hotel through tripadvisor and noticing all the oustanding reviews, my fiance and I decided to stay at hotel Paba in February 2007. The hotel is located a short walk away (10 mins) from the metro station which is greatly appreciated when you arrive from Milan on a night train, with a couple of luggages. Unfortunately for us, during our trip we didn't have the opportunity to take the historical elevator that everyone is talking about since it was out of order. However, the hotel being on the second floor, it was definetely not too much of an inconvenience. We were greated with a big smile by Alberta at 7 am. She is the personification of a true italian nonna (grandmother). Kind, soft spoken, making sure that you have everything you need (even though you really don't need it ...) The room we had was large and very clean. We paid 88 euros per night and for that price you will not find anything better in Rome. And did I mention the fact that taxes are included as well as breakfast. For those of you complaining about the bread, you need to learn something. Bread in italy is not soft. Its generally hard and I am sure you can break a window if you throw it. Being italian and accustomed to have it, I found the breakfast satisfying. Worst of cases, there is a small breakfast place less then 30 seconds of the hotel, serving fresh pastries... Now, the location. Its just perfect... A lot can be seen in walking distance. Coliseum and the Foro Romano are less then 5 mins walk and the monument to Victor Emmanuel II is less then 10 mins away (you have to see it by night as it is just breathtaking even on a cold February night). The metro takes you everywhere else you want in Rome. Would I recommend this place ??? Evidently !!! But more importantly, would I stay here again next time I am in Rome ??? Without a doubt !!!", "Date": "December 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Evansville, Indiana", "Title": "“Very Pleased”", "Author": "emaurer", "ReviewID": "UR11305480", "Content": "We were very pleaed with the Hotel Paba. When we booked out stay they were full the first night and reserved a room across the hall at a different hotel in the same building. About 2 weeks before out trip we got a email saying there had been a cancellation and we would be able to stay at the Paba our entire stay. The room was fairly small, but the bathroom was a nice size, and they were both very clean. It also included a mini fridge and a small table in the room which is where breakfast was served. The breakfast was simple but good and filling. The elevator was very old and a little scary, but always worked well. The location of the hotel was perfect. It is very close to the colesseum, and the forum, and we walked almost everywhere except the Vatican. The staff was very helpfull with directions and helping us find stamps and internet access.", "Date": "December 7, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Clean and cheap, but not rated 5”", "Author": "YoPhilly", "ReviewID": "UR11197538", "Content": "I recently stayed for two nights at the Paba, based on TripAdvisor reviews, and I must say I'm surprised at the number of people who rate it a 5. Without a doubt, it is spotlessly clean and a great bargain in expensive Rome when the USD is tanking against the euro. Fabiola was very pleasant and helpful. Our room was #7 called Director's Cove and it was about 8' x 10', very small with no place to stack our luggage. In fact, we had to pile them on top of the mini-refrigerator, making it very difficult to get organized. The shower stall was so small I couldn't bend over to wash my feet; I had to open the glass door to bend down. Breakfast was adequate: juice, cappuccino, yogurt, a tiny packaged wedge of cheese and a cornetto. The location is outstanding. We walked out the door and were at the Forum within three minutes. If you stay here and are interested in buying foodie things as souvenirs, walk UP Via Cavour about 2 blocks to the Elite Supermarket. They have a wonderful selection of torrone, candies, etc. I bought three bottles of wine here to bring onboard my cruise. Good value. Directly across the street is a convenient post office as well as a small deli-style store that serves a dozen varieties of pizza. Do try the potato pizza - super-thin slices of potato with a touch of rosemary on a thin crust pizza - molto buono! I have no complaints with the Paba, other than the room size. However, it does not rate a 5.", "Date": "December 2, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Canton OH", "Title": "“The perfect location”", "Author": "Jeaniusann", "ReviewID": "UR10939691", "Content": "My husband, our friend and I stayed 3 nights at the Hotel Paba, found in Rick Steve's guidebook, Italy 2007. Upon arrival, we discovered only one room reserved for us, when the confirming e- mail clearly stated we would have one double and a single. Since the hotel was fully booked, the young English-speaking receptionist, Fabiola, was distraught but her associate (and mom), Pina, relayed that she would see what she could do. Pina found us accommodations at another hotel, but near the train station and at a higher rate. Because of the ideal location of Hotel Paba, we declined the alternative and made do with the single room with a king bed and single roll-away. It was clearly a communication error. Our room was next to the reception desk. Though we were not able to hook up my husband's laptop computer, Fabiola gave him the hotel's laptop to use to download our boarding passes for our flight home. She also told us what bars/restaurants to avoid and recommended 2 wonderful places to dine just blocks away that did not disappoint. Fabiola and Pina could not have been any more accommodating. Being only blocks from the Colliseum and the main bus stop, this is an ideal place to rest your bones. Pina showed us where to get our coffee, juice and yogurt in the little closet off the lobby early the next morning and arranged for a driver to pick us up at 4am for our 6am flight home. We will definitely return to Hotel Paba.", "Date": "November 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Great location, great place”", "Author": "K-tel12", "ReviewID": "UR10700508", "Content": "After researching Rome hotels for 6 hours online (no lie), I decided on Hotel Paba. I wanted a great location, without spending more than necessary for a place with decent amenities. Hotel Paba was recommended in Rick Steves' Italy guidebook, and well received here on Trip Advisor also. I made the right choice. The location is fantastic, even closer to the Colosseum than it appears on maps. The room has a desk, a large wardrobe, a table with two chairs. The huge bed might be a tad too stiff for some, but I didn't mind. My boyfriend and I were assigned room 2, affectionately dubbed \"Lover's Nest\" on the door, ha ha. Movies of bad American movies (printed in Italian) decorate the walls, which lends a homey feel. There's a stocked mini fridge, but room to put in your own drinks. There's a radio and a small TV (essential for watching \"Quincy\" and \"Fresh Prince of Bel-Air\" in Italian). The bathroom is completely modern, stocked with tissues and a hair dryer (not very powerful, but it works). One of the things I enjoyed most was having breakfast in the room. Alberta will bring you breakfast each morning on a little tray. Just ring her up and two minutes later, she's at your door with fresh croissants from the nearby bakery, yogurt, bread, cheese, cookies and jam, and whatever kind of coffee or tea you like. I liked not having to search for breakfast and saving time by eating right in the room before leaving for the day. Alberta is a great hostess. She was extremeley helpful in calling cabs for us (they arrive in 3 minutes - amazing) and warning us about crooked cabbies trying to overcharge unsuspecting tourists. We were there when daylight savings time ended, and she left notes on our door reminding us to reset our clocks to the new time. Very nice! Also, the carry-out pizza joint across the street was great - some of the best pizza I had. And pretty cheap. One piece of advice: If you plan to pay with cash (for a discount), make sure you find a working ATM in advance. The night we wanted to pay for the room, both ATMs near the hotel were out of order, and we didn't have time to find another one. So the lesson is, when you see a working ATM in Rome, use it. Don't wait. A great hotel and would stay there again.", "Date": "November 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great stay at Hotel Paba”", "Author": "Mtn-Biker-in-STL", "ReviewID": "UR8850514", "Content": "My wife and I kicked off our first visit to Italy by staying at Hotel Paba in Rome (Sept. 9th - 13th). I ended up choosing this hotel based on the reviews here (and on Venere) and because of its central location. Alberta was a great hostess and helped us out several times during our stay. From restaurant recommendations to booking the Borghese tour for us, she was a valuable part of our stay! Our room itself was nice as well. We were on the Via Cavour side (a very busy street during the day and evening), but the updated windows helped keep out the noise. (After walking around Rome each day, we were so tired each night I don't even think bombs exploding outside on the street would have kept us awake!) Our little balcony was nice, too! The beds seemed typical for Europe (Alberta helped out by supplying us with a foam pad for my wife's sore joints). The room was spacious and kept very clean. The bathroom was largae and was cleaned every day as well. Overall, we were very pleased with the room. Hotel Paba is a great hotel if you are trying to travel on a budget in Rome (which is hard to do!). The location lends itself well to walking and taking the public transportation. Alberta is a great hostess and runs a fine little establishment! We will definitely return when we visit Rome again!", "Date": "September 22, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "ENGLAND", "Title": "“Great location poor breakfast”", "Author": "BENJI7", "ReviewID": "UR8752504", "Content": "Whilst I agree that the location of the Hotel was perfect and the rooms clean & tidy I cannot agree with the comments about breakfast. I have never had to eat my meal from a serviette as there were no plates provided and the tea was served in cardboard beakers with Nescafe written on. We had the same every morning 3 very small rolls a yoghurt each, croissant jam & cheese triangle. We feel plates & cups would have made a big difference we paid 140 euros per night! We had room 2 and every night we had to put up with the noise from the cafe next door, bottles being loaded and dishes being washed. The first night this was still going on at 4.30 in the morning, luckily I had taken ear plugs! It is shame, as the owner was helpful & pleasant she recommended us to a superb Taverna called the Imperial offering home cooked food with a specials choice each night ALdo and his sister Caludia were great and always smiling. We were only going to go the first night as it was so near to the Hotel but ended up going for all 3 nights ,", "Date": "September 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Very nice little hotel, once I got to stay there!”", "Author": "debstah", "ReviewID": "UR8712547", "Content": "I stayed at the Paba for 4 nights from September 8-12. In March, I had originally made reservations to stay from the 7th to the 12th, but about a month before my arrival in Rome, Alberta, the lovely lady who owns and runs the Paba, informed me that she made a mistake and double-booked my room. I had to stay across the hall in the Hotel Ferraro, which would cost 15 euros more (115 to 100 for the Paba) for a double/single use room. I appreciated the notice and that she made alternate accommodations for me that were so convenient to the Paba, but the Ferraro doesn't compare and even though she gave me the 15 euros in cash upon my checking out, it wasn't even worth anything close to 100 euros. So that was disappointing. When you book, just double-check the dates I suppose, to avoid something like that happening. But I think it was an anomaly and I doubt that she makes the mistake often. And the only reason it was actually a problem was because of the low quality of the other hotel. Now to the hotel itself. The location is great. It is right down the street from both the Colosseum and Forum, and any bus you could possibly need, plus the metro, are all within a 5 minute walk. Multiple supermarkets and restaurants and a travel agency and internet cafes with cheap internet are all within a minute or two walk from the hotel. I had room 7, right on the reception area and right by the door to the hotel's entrance. But the room faced away from the street, so it was quiet. I heard noise from reception once in a while, but because Alberta left around 9pm and didn't return until about 7:30am, my sleep was never disturbed. She brings you breakfast in your room anytime from 7:30am to noon; you just tell her when you want it. See the picture I posted of it. It wasn't fantastic, but it was an adequate amount of food to start the day and when I was there, everything was perfectly fresh. When I checked in, I was given a very very helpful bus map, on which she outlined several of the major sites and how to get there. This was most helpful as there are so many buses in Rome that can be confusing. Any time I had questions, she or the other woman who was sometimes there were more than happy to help, look things up for me, arrange a cab to the train station for my departure, etc. Really friendly and helpful service. The room itself was good-sized. A huge bed that was actually 2 beds pushed together, but that wasn't noticeable. There was a satin covering on the sheets, which was nice. A little marble table, with chairs, for breakfast, a closet, a minibar/fridge, plenty of light, plenty of electrical outlets, and I found the bed to be comfortable, but yes as other reviews have said, it is firm. But I didn't find it so hard that it was a problem. There was a small TV up on the wall, which got a lot of stations but only BBC World in English. The bathroom was adequate with a separate shower and big sink. Everything was perfectly clean and in good condition. The air conditioning was powerful and remote-controlled. There is no internet service at the hotel. Alberta offered to let me borrow her laptop if I needed it, which was a nice gesture, but she would not give out the password for her wireless so I could use my own laptop. But the proximity of several internet cafes made it bearable if you are like me and need to check the email every day. All in all, this is a very good hotel and was worth the 100 euros. The mixup with my reservation was unfortunate because that hotel was nowhere near the class that the Hotel Paba is. But Alberta is a wonderful lady and she runs a nice little establishment. It is not without its quirks, but Rome is an expensive, hectic city, so it was nice to have a comfortable, friendly, relaxing, decently-priced place to return to at night and if I needed to rest my feet in the afternoon. If I return to Rome, I wouldn't hesitate to stay at Hotel Paba again - I'd just book really really early and I would triple-check the reservation!", "Date": "September 14, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Port Fairy, Australia", "Title": "“Stale breakfast every day”", "Author": "Aroney", "ReviewID": "UR8482944", "Content": "The position was really good as it was close to the forum and other tourist sites, the lift was an amazing piece of work, something out of a Hollywood movie ,My main complaint was the awful stale breakfast that we had to endure every morning with the same lame excuse being that the bakers were not operating today!! In the end I could not eat breakfast at all as it was so bad.I am sure there are better places to stay.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington Hts. Illinois", "Title": "“Hotel Paba is great”", "Author": "Jackson507", "ReviewID": "UR8360609", "Content": "My wife and I stayed at the Hotel Paba the last week of July. We booked thru the hotels website after reading favorable reviews. We were not disappointed. Rome is an expensive city and we were trying to be as conservative as possible. Hotel Paba was a great value. It was about a 15-20 minute walk from the train terminal. We stayed in room number 2 for 3 days, which was roomy and very clean and quiet. On our return visit we stayed in another room whose number I forget, it was smaller, but still spotless. Both bathrooms were smaller than we are used to, but functional, and again very clean. Both of the rooms were very quiet. The rooms are air-conditioned which was fantastic since the temperture was in the mid 90's the entire time we were there. Breakfast was adequate and served in the room. Alberta the owner was extremely helpful and courteous. She arranged early cab rides to the airport and helped with a Vatican tour. The hotel is right around the corner from the Colosseum and Forum. It is a 20 minute walk to the Pantheon and Piazza Navona. 35 minute walk to to Vatican, Spanish Steps and Trevi Fountain. We would stay at Hotel Paba again.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Excellent Hotel in the heat of Rome”", "Author": "Davers01", "ReviewID": "UR8241163", "Content": "If you're looking for a top class value for money Hotel in Rome then look no further. Hotel Paba has big sized rooms, is very well located, and most of all is the most helpful place I've ever stayed. As you'll see from many of the other reviews, the Hotel is run by Sra. Alberta who is a charming and extremely helpful lady who made our stay so very easy and pleasant. So here's some hopefully helpful info to help you if you decide to stay here: GETTING THERE: From Termini Railway Station Hotel Paba is just a 10 minute walk away. Or you can go on the metro if you want. WALKING: Exit Termini at the main doors into Cinquecento Square. Now head to your left and you're looking for a road that goes off to the left from the square called Via Cavour. We looked for the most obvious one and it was that one. Get onto that road and stay on the left hand side. Now start walking and keep going until you reach Cavour Metro Station. Here the road now does a weird thing as it kind of turns into another road (or so it seems). Nevertheless, keep on going staying to the left hand side of the road which means you'll have to cross over and once you see the Post Office across the road then look out for the hotel. METRO: Get down onto LineB (I think) and you're heading south. Cavour is the first stop. The Metro is mega easy. You just need a 1 euro coin per person and you buy a single ticket per journey. Whether you're going 1 stop or 50 with 4 changes, it's still 1 euro. You just have to use them within 75 minutes or so of them getting stamped at the gate thingy. GETTING IN: OK, so you're here now. First off - ignore the grafitti. This is Rome. Everywhere is covered in the stuff. That's Romans for you. It doesn't mean that you've walked into the heart of the Italian equivalent of Harlem. In fact you are currently only about 100 yards away from the Colisseum (turn around and go back up the street 30 yards - look down that street to your right. See that bloody great big thing down there? Yes , there - the one with the arches, yes that's it). So ring the buzzer and the door will open for you. You're heading for the first floor (one floor up - it's different for Americans isn't it). But hey - what's that groovy thing looking like something out of 'From Russia with Love?' - it's a lift that's what. Check that baby out - it's straight out of the 30's - get to know it - you're going to become friends. So you've arrived. Shut the door to the lift (both of them or others can't call the lift and the whole lift service grinds to a halt) and the main entrance to Hotel Paba is right there on your right. Step in and you will probably meet Sra. Alberta. SIG.RA ALBERTA: Now I don't know what impression you may have got from other reviews, but I must admit I was expecting someone a bit like Kim and Aggie from TV (Sorry Americans you won't get that reference). Someone who's very much in charge etc. Well she isn't at all like that. She is a wonderfully elegant lady who is genuinely pleased to meet you (and that doesn't happen often in my life I can tell you). She speaks excellent English so don't worry about any language issues, and she is a fountain of knowledge on all things Rome. Take your guidebook by all means, but if you really want to know how to get into the Vatican Museums without having to queue for hours then she's the woman in the know. THE HOTEL ITSELF: First of all - it's tidy. Very clean and very tidy. The ceilings are very high and there is a touch of Rome everywhere. The Hotel is set all on the one floor with the Reception being the central hub by the main door into the Stairwell and that groovy lift I mentioned earlier. Sra Alberta tends to hide herself away behind the reception desk watching telly so is always at hand should you need her but not in your face. There are some books available if you've forgotton to pack one and also in reception there are the standard leaflets. Sra Alberta will also hand you a free map of Rome when you check in (and it'll end up being the one you use rather than the one in the back of that very heavy DK guidebook you've bought - you did buy it didn't you - does it feel heavy yet? Have no fear.. It will) ROOMS: We only stayed in one but did manage a peak at a couple of others whilst the cleaning was being done and the first thing of note is that for a capital city the rooms are very big. The beds are also 'oversized' which in reality means 'bloody big'. Each room has Air conditioning which can be a bit loud - but it was 35 degrees outside so who's conmplaining? Our room was en-suite with a decent shower which had adequate power and there was no problem with hot water. There is a safe in the room, as well as the standard drawers and wardrobe. We also had a table and two chairs where we ate breakfast each morning. Overall the rooms are, like the rest of the hotel, tidy and spacious. BARS: So you've arrived, you've found the hotel, you've checked in, and now you want to check out the area around the hotel. This, of course, means going for a glass of wine or a beer or two. Good thinking! Head out of the Hotel and take a left down the hill towards the Forum. Go past the restaurant which has overspilt onto the road and keep going until you come across an ice cream shop / sandwich shop / bar. It's on a corner. Look - don't the people look friendly in there. All smiles. All Happy. Do you know why? It's because they charge 7 Euro's for 400ml of beer that's why. DO NOT GO IN HERE!! Carry on past until the pavement opens out a bit and there are some seating areas under umbrellas. You should be near 'The Richmond'. Go and sit in one of these. They look more expensive - but they're not. The Chianti is pretty good. We also ate here and the food was pretty decent albeit touristy. RESTAURANTS: There are loads of restaurants near to the Hotel but one which we really enjoyed and was cheap can be found if you leave the hotel and go down the hill and then look for the first (or second) left which goes back up hill (towards Colisseum). There is a restaurant on that road on the right - go past that one and there is a lovely little trattoria further up the hill on the left. It's really authentic. SUPERMARKETS: If you're anything like us then you'll want to make some sandwiches to have with you during your trecks around Rome and Hotel Paba is really well situated for that. Directly across the road is a shop which sells Bread, Meat and Cheese and also some pre made sandwiches. They're cheap and delicious. Further down the hill but on the same side as this shop is the nearest grocery / deli - you can get all sorts in here including cans of beer. OTHER SERVICES: There is also a Post Office across the road from the Hotel and bank machines and a Bureau de Change. The Bureau de Change had the best rates we found in Rome so it's worth checking out. FURTHER AFIELD: I won't bore you with any recommendations about what to do in Rome as if you don't find out for yourself then don't bother going. Well I say that, but I will recommend one thing which you really ought to do. There is an area of Rome called Travestere which you really ought to go to for an evening. You can catch the bus from outside the Hotel (ask Sra Alberta - she knows all the timetables of course). Once you get there you'll discover street upon street of bars and restaurants. Each one tucked away and then opening out into hidden little piazas. The atmosphere is lively and the prices are cheap. As you approach the river you'll come across street vendors and riverside bars. It really is a great night out and is much better than hanging around near the Forum. So that's the end of my 'TripAdvice'. I hope you found it useful. I wouldn't ever normally write something like this unless I had been very impressed with my stay - and the Hotel Paba really deserves a great write up. We found the Hotel on TripAdvisor so it seems fitting that we should add our own review and hopefully help you out as well. Enjoy your stay in Rome. It really is a wonderful city.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Petersburg, FL", "Title": "“Best find in Rome!”", "Author": "tmstz", "ReviewID": "UR8232990", "Content": "Booked this hotel after reading a few good reviews in Rick Steves and an Eyewitness Guide. Our stay was great as the owner of the hotel is there most of the time and is very polite and helpful and she speaks English! The hotel is close by to the Colosseum (and the Shamrock Pub!). The hotel has 8 rooms and while our room faced the street, the thick windows kept most of noisy Rome out of the room. If I go back to Rome, I will definately stay here again!", "Date": "July 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roseville, California", "Title": "“Perfect Hotel, Perfect Hostess”", "Author": "maddyd51", "ReviewID": "UR8192406", "Content": "We booked the Hotel Paba based on a review in Rick Steves' Guidebook. We wanted a retreat from the craziness of Rome and definitely got it. Alberta was just a gem and a great source of knowledge. With only nine rooms, you get personal attention from her. The hotel is located on a busy street, but our room was still quiet despite having a window on that street. It was easy to shut out all the noise since there were two curtains, a window, and shutters. It is steps from the Forum and Colosseum and located in a neighborhood that felt safe even at night. We walked everywhere in Rome from there, even to the Vatican (about 25 minutes) and to Piazza del Popolo (about 25 minutes). It was a great way to see the city. Our room (number 4, with a sign that said \"Honey Moon\" on it), felt spacious, with a huge bed, large closet, dresser, and table with two chairs. There was a safe that was easy to use and the bathroom was spotless. In fact, the whole place was spotless. Alberta delivers breakfast to your room every morning. There was so much food that we'd take a few items with us to snack on throughout the day, which helped save time. There were rolls, a croissant, yogurt, and biscotti. Alberta also makes you an espresso from her espresso machine. We were checking out very early on our last day and she made up our tray for us and showed us how to use the coffee machine so we could help ourselves in the morning. I felt like this hotel was a great value, since it felt like a three star, but you got a two star price. The hug and \"Ciao\" I got from Alberta on our last night is one of the little moments I remember fondly from our trip.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“PABA gets thumbs-up for Rome accomodations”", "Author": "44Boppa", "ReviewID": "UR8070557", "Content": "It was our first time in Rome, at the peak of the tourist season, and we had little tolerance for any major mistakes. We hit the nail on the head booking three nights at Hotel Paba. It's near the Colliseum and the Pantheon. Though it's on a major street (easy for cabbies to find) we had a very quiet back room. The room was bigger than we expected, quite ample for our needs. A simple breakfast of juice, rolls, yogurt, coffee and tea was available every morning at the time of our choosing. It was served by Alberta, the manager, who was unfailingly cheerful, friendly and helpful during our visit. I easily arranged the stay with her via email, and she was very responsive. Before we left home, I discovered a friend would be in Rome on the first day of our visit. I asked Alberta to recommend a restaurant nearby and make a reservation. She did so, and it worked out fine. She directed us to useful shops and services nearby and arranged for economical transportation to the airport for our departure. I don't know if we will return to Rome. But if we do I know where we will stay. Hotel PABA.", "Date": "July 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Gem of a hotel...”", "Author": "cymry", "ReviewID": "UR8070483", "Content": "this little hotel doesn't look like much, but if you're willing to forgo looks, it's a wonderful place. the building is on a major street, but our room faced a small (shabby) courtyard, so it was very quiet. the building is old, the lobby tiny, and the rooms are very cramped, but each has its own small table and chairs where the owner brings you breakfast every morning. everything is scrupulously clean, and the help is very friendly and eager to please. best of all, if you're exploring Rome, you're at the very heart of the city! the Colosseum is a 2 minute walk away, with the Forums, Museo Capitolini, and any major attractions within easy walking distance. we didn't take the metro once - it's a 10 minute walk from Termini and, provided you're willing to explore, an easy trek from any point in the city, including the Vatican, Piazza di Spagna, etc. i'd definately stay there again.", "Date": "July 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Excellent Small Hotel”", "Author": "AnnKJ", "ReviewID": "UR8001626", "Content": "We stayed at Hotel Paba for 5 nights in June 2007. We highly recommend the hotel if one would like an immaculately clean, well maintained room in an ideal tourist location at a fair price. Our room (Skipper’s Room) was a good size, had a self-controlled air conditioner, and a comfortable queen sized bed. The bathroom and shower are a little small but immaculately clean. There is an elevator to the hotel on the third floor…..but if you prefer a workout carrying suitcases up – the stairs welcome you :). The continental breakfast (croissants, rolls, soft cheese triangles, yogurt, jellies, cappuccino, milk, hot chocolate, etc.) is served on the table in ones room. The owner, Alberta is extremely knowledgeable and helpful with Rome, busses, schedules, and she is very nice, etc. In addition, some tourist notes: -Location: A few blocks from the Colosseum and Forum. Walking distances to many major attractions. -Transportation: A bus stop in front of the hotel and other busses and the metro are a 5-minute walk. -There is a small grocery store on the corner; an outstanding gelato shop on the street; and a great souvenir/T-shirt shop is down the block. The souvenir shop is ITA INDIA, at Via Cavour – 308, and had the lowest prices my wife found in ITALY. -We would recommend avoiding the grocery store (Pizza & Mortadello) directly across the street from the hotel. They doubled the prices when they realized we were tourists…so we did not go back. The grocery store on the corner (La Voglia Di), which Alberta recommended, always treated us fairly and had lower prices. We would definitely stay at Hotel Paba in the future.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Hotel Paba is okay”", "Author": "tagretchen", "ReviewID": "UR7818421", "Content": "We stayed at Hotel Paba for three nights in May. The room was small, but average for Italy standards. Our room was relatively quiet. but did not face Via Cavour. Breakfast was served in the room. The location was very convenient. The hotel was only a short walk to the Colesseum and Forum, and public transportation.", "Date": "June 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“great hotel”", "Author": "jagged", "ReviewID": "UR7709501", "Content": "the hotel is in a great location, right around the corner from the Colosseum...it's on the second floor of the building it's in, but they do have a lift so you won't need to deal with luggage and stairs the hotel is on a pretty busy street and we had a room facing that street, but the windows were thick enough to keep the noise out...plus the room has A/C so there's no need to have the window open unless you want to look out it there is a store across the street that had excellent pizza, as well as beer, wine, snacks, etc...there is also a pastry shop down the street that we had breakfast at every morning that we were in Rome the room is typical of Europe in that it's small by American standards, but it was plenty of room for us...the bed was very firm, so if that is a problem for you, beware...the shower has good water pressure we were very happy with the Hotel Paba and would definitely stay there again", "Date": "May 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Hotel Paba May 8-10”", "Author": "Ladyleah", "ReviewID": "UR7645167", "Content": "We stayed at the Hotel Paba for 3 nights at the begining of our May, '07 trip to Italy which included 4 hotels. Here are the pros and cons- Pros- *Signora Alberta was simply lovely. She was very helpful and accomodating, and appears to go out of her way to do things for her guests. It's nice to deal with the owner directly. *Location. Its a great location where you can walk anywhere (although we took a cab to the Vatican) and we always felt quite safe. An reasonable walk to all of ancient Rome, the Pantheon, Piazza Navona, and the Spanish Steps. The neighborhood around the hotel was actually really great and fun of little gems like the Charity Cafe Jazz Club and a great Enoteca (wine bar) *The price was right- 145 euros per night with a 5% discount for cash payment. During high season in Rome, this is a great price. Cons- *Our room was on the Via Cavour side and it was SO noisy at night due to a bar outside the hotel that didn't get hopping until midnight. Even with earplugs the noise was a bit much. I am certain that Alberta would have moved us if the hotel was not entirely full though.... but it was. *The bed, although large, was hard as heck as people had mentioned before. I can deal with firm- but this was close to feeling like a rock! :) *The bathroom (at least in our room the \"Honey Moon\" room) smelled quite moldy and needed a deep clean. If we didn't leave the bathroom door closed when we left the room smelled like a bit of a gym locker room which was gross. All in all, a reasonable stay!", "Date": "May 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "So. California", "Title": "“A warm welcome in Rome”", "Author": "traveldancer", "ReviewID": "UR7639955", "Content": "We stayed at Hotel Paba four nights at the end of our vacation. Our owner-proprietor Alberta is everything all the reviews said---wonderful!!! She booked a ride for us to the airport at 5:30 am the day we left, and left us breakfast so we would have something that early. Some of the early reviews talked of a small breakfast---not anymore. We had croissant, cappuccino, small rolls, three small cheeses, juice, yogurt, proscuitto, packaged bread. I had asked about eggs since I can't eat sweets or bread, and she was able to help with this with hard-boiled eggs. Her information about where to go in Rome was very helpful and being able to walk to the Forum in five minutes was amazing. This was the end of our trip so having an English-speaking hostess helped our brains tired from 18 days of travel. I felt like I was at my German mother-in-law's house---you could eat off the floor of our whole bedroom and bathroom. The deli across the street was helpful and lots of restaurants were close. We would stay here again for such a lovely hostess.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gateshead, United Kingdom", "Title": "“Wonderful hospitality”", "Author": "triciat13", "ReviewID": "UR7478988", "Content": "My friends and I stayed here for 5 nights from 18-23 April, 2007. I had read the excellent reviews so contacted the hotel owner directly to book accommodation. We could not have found a better place to stay. The welcome was lovely, as was the hotel and, of course, the owner, Signora Alberta Castelli. It was ideal for being within walking distance of many of the famous landmarks. The only time we needed transport was to go to the Vatican. I heartily reccommend this hotel to anyone. I would also reccommend the restaurant next door the this hotel. After a couple of disappointing meals elsewhere we decided to eat at Bar Argentina. The meals were excellent, especially the Fillet Steak Argentina. Absolutely wonderful! All-in-all, we had a wonderful stay in Rome.", "Date": "April 28, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scotland", "Title": "“Forza Paba”", "Author": "JammieDodger", "ReviewID": "UR6843828", "Content": "This is a lovely little hotel, and it's hard to believe that it's possible to get better value in Rome. Alberta is an excellent host. Very helpful and considerate. My wife and I were travelling with our son, and we booked a triple room. Except it was better than that, the third bed was in a small room adjacent to the main room. We all therefore enjoyed unexpected privacy when needed. We were delighted when we realised what our accommodation consisted of. The location of the hotel is almost perfect. It was great to step put and see the Colosseum within minutes. The Forum is seconds away also, which is great, because you can get there early to avoid the crowds, and believe me, you will want to avoid the crowds! Don't miss the Capitoline Museums, they are superb, and are also only minutes away. Museo Borghese is a 'must see' as well. Not see easy to get to from via Cavour - catch the metro from the Colosseum to Flaminio and walk from there. If you are on a bit of a budget, there is a great Pizzaria in the lane parallel to via Cavour, via Madonna di Monti. It's called Alle Callette. It seems popular with locals, the staff are friendly, and has a great buzz. If you are like me, I really enjoy eating somewhere that I can't hear the english language. That way you feel like you are away. Anyway, Pizzas from 6 euros and a bottle of Chiati for 8 euros can't be bad.", "Date": "February 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "S.E.Asia", "Title": "“Excellent Location, Great Service”", "Author": "A-square", "ReviewID": "UR6812108", "Content": "Ms. Alberta, the owner, is a very warm person. We were given the Lover's Nest room for our honeymoon. She also gave us a map and bus services handout which turned out to be very useful. Room is big, water pressure is good, location is very close to Colloseum/Roman Forum and within walking distance to shopping area on the Via Nazionale road. Plenty of restaurants nearby. Ask for recommendation from Alberta. Last time we gave her a restaurant name card and she intends to go there to try herself. So, her recommendation is guaranteed to be of a good standard. Breakfast is good, served in the room because there's no dining area. If going there by public transportation from the train station, better take bus rather than the Metro because you'd need to go up/dpwn the stairs/escalator with your luggage in the Metro and then you also need to walk to the hotel. There is a bus with only 3/4 stops and the stop is only 2 min to the hotel (metro stop is farther). We took Ryan Air-budget airline from Rome to Venice. From the train station, there's a bus 6 Euro/person going to the budget terminal. Ticket sold in Tabachi (newstand). Location of bus departure was difficult to find, though. Be sure to ask for clear direction when using the service. But the trip was quite entertaining because we went through Rome suburban roads for about 40 min with a driver driving the big bus like driving a small car and there's some local music, too.", "Date": "February 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Bijou hotel lets you concentrate on your Roman holiday”", "Author": "JohnnyBoyLondon", "ReviewID": "UR6811599", "Content": "Small, comfortable and friendly hotel on 2nd floor of a block on a fairly busy (traffic) street. However, shutters and double-glazed windows do ensure a good night's sleep. Excellent location: Colosseum 5mins walking and: Imperial Forums 5mins; Trajan's column 10mins; Trevi Fountain and main shopping area 20mins. [There's (a post office and) a shop selling good examples of Italian charcuterie, wine, pasta and cheese across the road, so you don't need to load yourself down with foodie souvenirs when in the city centre.] There's no breakfast room, but breakfast (including fresh bread roll and croissant) is brought speedily to your room on a tray when requested, so rapid morning departure to see the city's sights is possible. Alberta excels at attention to detail and she is very helpful. Her English is excellent, but do take the opportunity to practise some Italian! Highly recommended", "Date": "February 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Victoria, British Columbia", "Title": "“Charming and comfortable”", "Author": "CanadianTraveler", "ReviewID": "UR6804983", "Content": "We just returned from a great seven night stay at the Hotel Paba. As many people have noted, the owner Alberta Castelli is friendly and helpful. We were given a choice of two rooms so we chose a room at the front--the Imperial Suite--there was noise from the street but we wanted the balcony with a view of the ruins. The breakfast was delicious--a fresh cornetto, sweet bun, cheese, yogurt, biscuits and cappucino. By European standards the room was large and the bathroom was nice and clean--no problems with water pressure. I was concerned about the location but we walked everywhere--only took the subway twice, once to the Vatican and once to the Gallery Borgese. For 88 euros/night I thought this hotel was completely charming and a tremendous value. I would definitely stay there again.", "Date": "February 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rotorua New Zealand", "Title": "“The bed was so large!”", "Author": "ValGee", "ReviewID": "UR6705233", "Content": "The beds at Hotel Paba are enormous but rather firm. The room was kept clean and neat. The rooms at the front of the hotel that look out onto Via Cavour are rather noisy until early morning but not as bad as some. Opening the shuttered windows in the morning is an experience too as it is a great feeling to see others making their daily deliveries and setting up shop for the day while you, being on holiday, have the time to sit and watch.The breakfasts were the same everyday and pre packaged but adequate. What made our stay at Hotel Paba so memorable was Alberta's welcoming smile when we arrived and everytime we returned. She was patient with our tirade of questions and if she did not know the answer immediately, would always do some research and give us an answer later. Alberta made us feel special! The hotel is well situated close to many of the great Roman historic sites and there are many good restaurants close by. We felt safe walking around the area during the day and at night. A waiter in a restaurant across the street from Hotel Paba initially tried to overcharge us for our meal but when we asked for the bill to be itemised, we were charged correctly. The gellatos were delicious, especially recommend the pistachio, lemon sorbet and chocolate.", "Date": "January 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“When in Rome, Stay Here”", "Author": "NJTraveler79", "ReviewID": "UR6688604", "Content": "We stayed here for several nights in December and were very pleased. I believe we were upgraded to a larger room than we had originally booked, and we were not charged any extra. The cost is very reasonable, especially given the good location (the Coloseum is literally within site). The main asset is the owner, Alberta, who was very friendly and helpful. She gave us several good dining selections, provided us with helpful site-seeing tips, and reserved tickets for our visit to the Borghese. As other reviewers have stated, breakfast is basic, but enough to get you started for a day of site-seeing. The only complaint I would have was that we stayed in a room which bordered the main street which could be very noisy even late at night, so if you are a light sleeper, try and get a room further from the street. I would definitely recommend staying here.", "Date": "January 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wales", "Title": "“lovely hotel”", "Author": "jenswa", "ReviewID": "UR6017239", "Content": "We stayed here for three nights in September in the room called \"lovers nest\", it was lovely and clean with a huge bed and wooden floor. Alberta the owner is a lovely lady and very helpful. The hotel is in an excellent location and we would love to stay there again if we return to rome.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NC", "Title": "“Great Hotel!”", "Author": "cbeggs", "ReviewID": "UR5969422", "Content": "This hotel is quite a find. It is located right on Via Cavour in Rome, very close to the Coliseum and Forum. We loved the location for starters as it is easy to get to and from the train station either via taxi or via subway (1 stop). There are plenty of good places to eat in the neighborhood as well. The owner is very pleasant and helpful. She recommended some good local restaurants, how to book our train passes to the airport, how to get to the Appian Way and was helpful in many other aspects as well. The room was large for European hotel rooms and the bathroom was a decent size with a regular shower. We lucked out and got the family room so we had an extra room with a twin bed which made the room even larger. The breakfast was served in room each morning. Our last morning there we had to catch a plane very early so the owner was kind enough to ensure we had breakfast and helped show me how to make a cappuccino and where to get the food from the hotel pantry in the morning since she would not be there in the morning to help. This was above and beyond my expectation. She normally got there around 8am. My husband and I enjoyed our stay very much and would recommend this hotel as we had a lovely experience and the accommodations were very good.", "Date": "October 18, 2006"}], "HotelInfo": {"Name": "Hotel Paba", "HotelURL": "/ShowUserReviews-g187791-d524376-Reviews-Hotel_Paba-Rome_Lazio.html", "Price": "$112 - $185*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Cavour 266</span> | <span class=\"extended-address\">(2&Acirc;&deg; piano)</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "524376", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b0/2e/b02e6c849a2357d1b3645f9ca1f71ce41large.jpg"}}