{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brentwood", "Title": "“Cityguide”", "Author": "Gyula G Posted by an Easytobook.com traveler", "ReviewID": "UR128114704", "Content": "You should change the pictures for real ones, beacuse before someone booking a room would be great to see what for paying!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "midlands", "Title": "“Nearly changed hotel but glad we didnt!”", "Author": "rubylito", "ReviewID": "UR125849304", "Content": "There had been some pretty bad reviews so we were pleasantly surprised when we got there. Ther reception was charming. Our room was small but very clean. The beds were very comfortable. The bathroom looked new and was spotless. However did not touch the hair-dryer as cable was exposed and did not look safe! The view was a block of flats but that did not bother us as only using the room as a base. The breakfast was perfectly adequate apart from the coffee ! However you can ask for an espresso for no extra charge and that is fine. There is a very good restaurant next door called La Pentolaccia which is very good. Not too expensive, and the waiters are very friendly. It took us about 30-40 minutes to walk to the Trevi from the hotel. we also walked to the Vatican from the Flavia and that took about 50 minutes. Finally we thoroughly recommend Romecabs.We used them to and from Fiumicino and they were 1st class. It cost 65 euros for 6 of us.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "yorkshire", "Title": "“Decent hotel at a good price”", "Author": "bigkiffer", "ReviewID": "UR125382729", "Content": "I don't think this hotel would suit the american market but for us Brits looking for somewhere cheap and cheerful it was perfect. The location is good, the hotel is clean and the breakfast was all one should expect. If I have one complaint it is that the shower was in need of a good refurbishment but it was adequate. The staff are very helpful and I was able to communicate with the hotel prior to arrival. A taxi from the airport cost 50euros which was cheaper than 4 of us getting the train! All the key sights are within walking distance. Enjoy your trip.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Basic hotel.... but a great base!”", "Author": "MichieR", "ReviewID": "UR125119542", "Content": "Having looked at city breaks to Rome before, I found that whilst the flights were reasonable, accomodation was quite expensive. However after seeing a good deal, I booked a city break (11-14 Feb) at the Hotel Flavia. We arrived quite late on the Saturday and were greated a smile, a hello and assistance from the guy on reception. He gave us our key and we headed off. Whilst I agree with some on here, the reception looks quite modern, the hall ways are a little dated and need a little bit of TLC. That in itself didnt bother us much, as were were not planning on spending our time in Rome walking up and down the hotel hallways. Once we entered our room, we were relatively happy with what we saw. We had a double bed (2 singles pushed together), but there was ample storage space for our clothes and the bathroom was large. Again, all a little dated and some things in need of TLC but it suited us as we only used it as a base and a place to get washed and sleep. There was a safe in the wardrobe and this was offered free of charge. Unfortunately we couldnt get ours open and had to speak to reception for help. The guy came up to our room and fixed it for us immediately. The shower was large enough and even though you had to wait a few minutes for the hot water to kick in, it was plenty powerful and did the job. There water is quite soft over there, so just be warned. Our view out of the window wasnt great, but again that didnt bother us as we was not planning on spending time sitting in the hotel. There was a tv which has Italian Sky (HD) available free of charge and also a mini bar. We had 1 can of coke and that cost us €2. Rome is quite an expensive place anyway, so didnt think that too bad. Breakfast in the morning was plentiful and enough to keep you satisfied until lunch. Everyday on offer you had - bread (for toast and also fresh ciabatta) or on some occasion rolls. There was cheese, ham and boiled eggs. Croissants (plain, chocolate and jam). Cereals, yogurt, fruit and other sweet biscuits. Each of these were replenished when running low, and everything I had tasted fresh. The only thing that was a bit odd, was the coffee pot. It was classed as Americanco coffee. It was a little more like mud in a cup. Some people like that kind of thing, but I dont unfortunately. This didnt stop me however enjoying my breakfast but I believe you can order cappucinos or tea from the lady in the kitchen. The hotel in itself was in an absolutely fantastic spot. Grab a free local map (available in most hotels and restaurants) and use it to get yourself around. The hotel was about 10 mins from the main Termini and only 10-15 mins away from a lot of the attractions such as The Spanish Steps, The Trevi Fountain and the Pantheon. The Colosseum is a bit further but depending on how quick you walk is only about half an hour away. The question is, would I stay at Hotel Flavia again..... Yes, I would.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel, great experience in Rome!!”", "Author": "bixysophie", "ReviewID": "UR124088278", "Content": "We arrived in Rome very early in the morning and went to our hotel to check in, the receptionist told us that check in time was 2pm ( we knew this ) but we asked if it was possible to get in before, but it wasn't possible. We went out for a coffee near Via XX September my iphone beeped a sound, cause my map guide was still on, it indicated me a hotel near by – curious of this we went to see. From the outside it looked cute, we entered and ask at the reception the rates & availability for a few days, a nice and helpful person at the reception gave us the rates ( good rate ) and offered us a coffee to think about it. We took it - because of the kindness and friendly gesture. After our check in at ( 10.00am ) we went and cancelled our previous hotel ( loosing the 1st night ) Hotel Flavia was a good choice, very clean hotel, large rooms with all comforts. Good breakfast in a cute restaurant, plenty to eat with good coffee and cappuccino.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "coventry", "Title": "“Just go somewhere else!”", "Author": "katacharin", "ReviewID": "UR123398179", "Content": "I am normally quite a forgiving reviewer, but I really would advise you - if you can, just try and go to a different hotel! I know you get what you pay for, and we had 3 nights accommodation at this hotel as part of a really well priced package deal. However I wish now that I'd shelled out just a little bit more and stayed somewhere nicer. This hotel is advertised as 3 stars - i have stayed in 2 star hotels which have been much more pleasant. We stayed in a comparably priced 3 star hotel in Paris last year, which was wonderful. The Foyer looks fairly impressive to walk into, however that's where it ends. Firstly; Our Room. I'm not particularly fussed by the size of a room, and the size of this room was ok. As other reviews have mentioned the only light came from 2 bedside lamps (one with a broken shade that had ripped and torn off) and the light in the bathroom. The bed was uncomfortable, had no duvet, just a sheet & quilt, (i know this is often the case in some continental hotels - but just incase you were expecting a duvet), we had one pillow each which I would generously describe as WAFER THIN. The room was clean-ish, but there was lots of scuffing on the walls etc. The bathroom was adequate - apart from the shower, which you couldn't really describe as a shower....more like a hose protruding from the wall, with ill fitting shower doors and bad drainage. In the room there was a safe (good) and a minibar, but NO information whatsoever about the hotel, the prices for the minibar, fire exits, local attractions...infact no information AT ALL. Plus side, a good TV with plenty of channels. Some reviews have commented that if you just want somewhere to sleep at night, this place is fine. I'm unsure if I agree - cos really that's all I was after, and I'm not particularly fussy. But I was unable to sleep at night due to the discomfort of the bed and the NOISINESS of other guests, running down corridors, shouting....I know that's not the hotel's fault, but really the walls were so thin I thought there were people IN the room. Breakfast was also poor. To get to the breakfast room you had to walk outside through a really grotty courtyard full of odd shaped concrete. I love food, I love eating and I love continental style breakfasts, But everything about this spread was just not very nice. The coffee was awful, you had to wait for an attenant to serve you any other drink - and there wasn't always anyone there. The 'juice' tasted of weak squash. The pastries looked good, but proved inedible. The boiled eggs were ok. On day 2 we decided to just skip it and eat out somewhere. On the plus side, they had european MTV playing (bizarrely) and we saw some rather entertaining Italian rap videos! BUT...the thing that gets my goat the most, and the reason i've written this review and not just kept it to myself, is the absolutely awful level of customer service we received. Despite all of the above, I would be entirely forgiving if the PEOPLE had made us feel at all welcome, or had hinted at even having a speck of friendliness about them. Instead we were greeted at reception by one word grunts, no eye contact, no helpful information. I'm astonished that other reviews described the staff as friendly. I've never met more unfriendly people, and it rather gives the impression that they know they don't have to try because it's Rome, and they'll always have customers. I feel that on a city break like Rome, its so important to have somewhere comfortable and relaxing to return to at the end of the day. THIS is not that place.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Worst hotel ever seen!”", "Author": "es_1903", "ReviewID": "UR120585342", "Content": "3 nights at this hotel in July 2010. The bed was the most uncomfortable one we have ever tried to sleep on. The pillows were worse so i tried to use the 'clean' towels to put my head on. No way, the clean towels in the bathroom had a very disgusting smell. The toilet and the shower were dirty in deed. One other thing, there was no remote control for air conditioning so i needed to get out of the bed to control it. There was a tv in the room which sometimes did not work without any reason. The road to the hotel from centre is quite uphill. There is a bus station nearby. The breakfast was ok, may be the only positive thing about hotel flavia.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“Average, will not go back”", "Author": "Odedamir", "ReviewID": "UR120283587", "Content": "We stayed in Rome for 3 nights after a couple of weeks in the south and needed an hotel as a base for sightseeing in Rome. We selected this hotel after reviewing it in Tripadvisor but did not select it because of its rating - we simply didn't have any other options in such short notice. This is not a hotel for couples looking for a romantic break, it is an average base and nothing more. Pros: Location - 10 minutes walk from Termini or a short bus ride and also a bus ride from everything else in central Rome. surroundings feel much safer than near Termini with some nice restaurants around. Service - receptionists were very kind and helped us with recommendations of what to see and where to eat. Cons: Price - for such a level of hotel the price was over the top (perhaps because we ordered on the day of arrival). Room - very small, don't go there if you plan to stay in the room for a considerable amount of time. WiFi - in the room with charge, but was quite cheap. Cleanliness - room was clean and tidy, but the halls were quite dirty in our floor (2nd). Decor - feels a bit rustic and old, requires a refresh. Toilets and shower - this was strange, the toilet was in a cubicle where the shower is supposed to go and the shower itself is exposed, a second person cannot enter the toilet during a shower. In addition, it was an electronic flush toilet and it made a lot of noise. Bottom line: Go there only if you need to spend a night before your flight and other higher rated hotels are occupied. Would not go back there. got the 2 star rating based on the only two cons.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Quaint hotel....”", "Author": "Philipe B", "ReviewID": "UR119315480", "Content": "I have been here for a business trip with some collegues for 4 nights and we needed to be close to Via Veneto. Our firm found this hotel and we really appreciated it. It´s little, very comfortable, very clean. The staff was helpful and kind, we loved the way we were welcomed. The area is nice and safe with lots of restaurants and a plus....just in the corner there is the Harley Davidson dealer.....I love them!!!!:)", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Average Hotel, but would go back”", "Author": "Cucatrap", "ReviewID": "UR118962010", "Content": "The hotel is Ok, no big deal.. , But I definitively would go back. Good things: 1 - Great Location 2 - There are four restaurants on the same block. (1 of the restaurants is a typical Italian bar, I loved it) 3 - The staff was very helpful and kind Bad Things 1 - The room was clean but a little old. 2 - There is no free internet. Definitively I WOULD GO BACK.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“A Good Base for a Short Break in Rome”", "Author": "holtkln", "ReviewID": "UR118939653", "Content": "We found this to be a good base for our short (3-night) break in Rome being reasonably central and sensibly priced. The reception area is small but welcoming but some of the staff could be a little more friendly. The rooms are fairly small but clean and well presented. The windows overlook a small, and rather dingy, central court yard which limits the amount of natural light that permeates into the rooms. Our requirements were purely to have somewhere decent to lay our heads after heavy days of visiting the sites and this accomodation met those needs admirally. The breakfast dining area was decorated and presented in very pleasant manner with the selection of choice available being more than acceptable and the staff helpful. With regard the hotel location, and whilst trains and buses are available fairly locally, we were happy to walk back each evening, enjoying the obligatory ice cream along the way. Albeit that our feet were sore from the days endevours.", "Date": "October 4, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Average”", "Author": "Sonya B", "ReviewID": "UR118155006", "Content": "Hotel from outside looks quite posh, inside a bit dated. Our room was very dark as there was no main light, just two side lights above each side of the bed. The only view when looking out of the window was the other side of the hotel wall and a dingy court yard area below. Rooms were clean and bed sheets and towels were changed daily which was great. Bathroom was bright and modern and had a big powerful shower. This was great to use after a hot sweaty day of venturing around Rome. Breakfast was basic. Some of the staff working on the front desk were quite rude at times and didn’t really seem to have any customer service skills. Asking for directions or asking them to book a taxi seemed to be a big inconvenience for them. Location was good and in a nice, quiet area of Rome. Close to the Spanish steps and not far from the Termini train station. A few restaurants close to the hotel and a very small shop to buy basic groceries from.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Decent, But Would Not Go Back”", "Author": "sarahk1130", "ReviewID": "UR117498021", "Content": "Our room was clean, though very dark (the only window looked out onto a courtyard). The bed was comfortable and the bathroom modern. Breakfast was unremarkable but definitely edible. The best thing, though, was the reasonable price for a very good location -- easy walking distance both to the Termini train station and the major sites of Rome. I preferred the other place we stayed, Hotel Borromeo, which is actually owned by the same hotel group -- the renovation there was more recent and the breakfast is served on a rooftop terrace, though the price of the two hotels is comparable. The only drawback to Borromeo is being on a noisier street.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "malta", "Title": "“nice & convenient”", "Author": "linn s", "ReviewID": "UR117229800", "Content": "Nice hotel in a very nice and safe area walking distance from the most important sites, e.g. the Spanish Steps in about 10 mns. walking. Clean and comfortable room, great breakfast and lovely staff. A good choice for a visit to Rome", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“excellent hotel”", "Author": "pino s", "ReviewID": "UR117124348", "Content": "I am an italian living in Uk for work reasons since 1990 and 2 or 3 times a year I visit my family in Rome.This year I stayed in this hotel with some friends to be more free and do not bother my family.It is an excellent hotel perfectly located in the city centre. We loved the staff very helpful and kind, and the room was spacious and very clean. Breakfast for an \"englishman\" is very important, we found a good variety and quality of food, and the breakfast room is bright and very impressive. Last....the A/C was working perfectly, very important in a extremely hot Rome! Suggested!!!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London", "Title": "“Very dissapointed!”", "Author": "Kay P", "ReviewID": "UR117099193", "Content": "Location of this hotel is very good-very close to Terminus station and walking distance to sights. However this is where it ends. The room is very small, dark and dingy and the view we had was of a patio filled with rubbish. The shower was cracked and the hairdryer was held together with a large amount of sellotape-not very safe!! The bed was extremely uncomfortable resulting in 3nights of terrible nights sleep-not exactly what you need after a long day of sight seeing! The breakfast was a joke-nothing appeared to be replenished and very little choice. The food that was available was very cheap and not at all nice. When we asked for a pot of tea the water temperature ranged from luke warm to cold. A complete waste of money. The plug on the sink was also broken and left in the sink which blocked it. When we went down to reception and asked for someone to come and fix it we were told we would have to wait to the following evening as there was no one available. How exactly were we meant to wash and clean our teeth?? I ended up pulling out the plug by forcing my nails underneath it-YUCK!! When we asked to leave our luggage at the hotel after checking out on the final day we were given the option to leave it in the reception area. However highly recommend restaurrant next door. Excellent food and service!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Macau, China", "Title": "“good experience and price....”", "Author": "lindsayhello", "ReviewID": "UR111365344", "Content": "I just came back from a 14 days business trip to Europe and I have visited different cities in Europe and surely different Hotels... I normally do not write my travel experience but I ve found this hotel in Rome very interesting and so I decided to do it. The hotel is located in an excellent location, in a very queit area of Rome but within walking distance from the city centre.The area is clean, lots of shops and little restaurants for all your needings, from pizza to meat and so on. The Hotel is queit, clean and I appreciated the courtesy of the staff. The room was big enough for one person , the bathroom was great with delicate colours, and a fantastic shower with a strong water pressure(this is a very important thing for me!, I love to take long hot showers....) Breakfast ok in a lovely area. Unfortunately I did not have so many free time because I was on a business trip, but I had the chanche to spend an entire morning around the city and Rome gave me a fantastic impression, a deep truly emotion to see so many important monuments and sights famous all over the world. And don't forget to shop a little.....you will find all the best italian fashion and not only......!!!", "Date": "June 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good Hotel in fantastic location”", "Author": "piercassel", "ReviewID": "UR111179696", "Content": "Hotel located in a fantastic location, calm area, lots of restaurants and local shops. Close to barberini Square the gate to reach in a few minutes the Spanish Steps and Via del Corso(the best shopping area). The hotel is simple but with all comforts, eg. great aircon,clean spacious room, lovely big bathroom, wi-fi connection, minibar, etc etc.... The price was very convenient and included a good morning breakfast. It was close to my business , I will surely come here again.", "Date": "June 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Viby J", "Title": "“Great staffservice”", "Author": "Chrisrin", "ReviewID": "UR103860530", "Content": "Compared to the price we payed for the room we were fully satisfied. The rooms and the breakfast was fine and the service we eksperienced was very good.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“A special place..”", "Author": "Paulmiki", "ReviewID": "UR100280346", "Content": "Me and my wife found this hotel special for all our needings...perfect location,large quiet room in the back of the building,special staff,always ready and friendly...we had a nice stay,we loved the barea of the hotel with lots of restaurants and close to all major attractions.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maynooth, Ireland", "Title": "“Do stay there - budget hotel in good location”", "Author": "carlton13", "ReviewID": "UR96638352", "Content": "Located in safe spot in embassy and banking district 10 mins from republic metro and 20 mins from termini station. Good restaurants in the area too. The hotel is easy to find its Number 40. The lobby is small but smart, free tourist maps available. Check in less than 3 minutes. The breakfast room is also on the ground floor and is very attractive - basic breakfast but enough for a quick bite to get you going. The rooms are compact and ours was dated - although well equipped with comfortable bed, clean linen, bedside lamps, hairdryer and SKY TV (although you do need to change each channel from Italian). Overall great for a few nights in room for those who don’t mind a 30 min walk to the tourist area (or using the Metro) . Staff easy going and helpful if needed. . This hotel fully met our expectations of a Rome hotel. Great value would stop here again", "Date": "February 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Don't stay here”", "Author": "paspain", "ReviewID": "UR92701554", "Content": "Difficult to find because the small hotel sign is hidden behind a wall plant. Arrived at 15:10 to find room(s) not ready, had to wait for almost 30 minutes to enter room (226), Visited the bathroom to freshen up to find the toilet seat cracked and dirty. Tried to read the map of Rome to find that it was quite impossible to read in the room, both lights are inserted in a wardrobe as are the switches (see video)http://www.youtube.com/watch?v=ERQEG67n0ck Another lap stand atop a dressing table but does not throw sufficient light and has to be switched off from the point of entry. The only mirror in the room is placed in a corner with a fridge and TV in front therefore making it impossible to see oneself. The room does have a window however, its better not to open it, it looks onto a smelly rubbish filled patio. Staff: INDIFFERENT,While discussing the problem, the receptionist left us on three occasions to deal with other people until we made it clear that he attend one client at a time. Best not to stay there. http://www.youtube.com/watch?v=ERQEG67n0ck", "Date": "January 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Florence, Italy", "Title": "“Unfriendly place.”", "Author": "radionorwi", "ReviewID": "UR89779492", "Content": "The staff are unfriendly and will perform your requests begrudgingly. I came back to the hotel with a female companion in the evening and was given a full-scale inquiry into why she was with me, given that I had only booked a single room. This was entirely uncalled for, and just served to embarrass us. The internet is expensive and slow. The rooms are small and dark, the beds are not particularly soft, and unbelievably I could not find a plug socket apart from one in the bathroom! When I asked about getting the code for the internet one evening, it took a ridiculous amount of time to sort out.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Quiet hotel in Rome”", "Author": "Paolettu", "ReviewID": "UR89068705", "Content": "Quiet location in the city centre.Clean hotel and nice staff.We walked to' all Rome easily.Suggested for a good stay and great price.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gibraltar", "Title": "“little cozy hotel”", "Author": "lamivida1", "ReviewID": "UR85453166", "Content": "We have stayed in this hotel for 1 night only before going to the Hotel Borromeo which was busy for that night(see review)..... It is located near Via Veneto, where lotsof the 5 stars hotel and restaurants are located....remember La Dolce Vita with Mastroianni and Ekberg?..... The hotel is nice, very clean, and we loved the size of our bathroom which was really big!! The breakfast room is really well decorated, look at the ceiling if you'll be there..... Rich breakfast and nice staff. Price/quality a plus.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Lovely stay!!!!”", "Author": "wilfo85", "ReviewID": "UR82903426", "Content": "People in this place is very helpful. Special thanks to Claugio and Luka....the nicest in the hotel. Rooms cleaning every morning very efficient. I loved their breakfast for fresh croissant and poached eggs, no one do that. The location was very convenient, you don't have to take taxi there. I recommend this hotel to all want to visit a nice city.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Basic Hotel - good location. Perfect for a couple of nights”", "Author": "byrnee2", "ReviewID": "UR80822195", "Content": "Stayed here with a friend for 3 nights. Rooms are basic, but adequate. Breafkast is fine, no hot food but nice selection of croissants etc. Lovely coffee. Hotel is a 5 minute walk from Termini and maybe a 10-15 minute walk to Trevi fountain/Spanish steps areas, so its a good location. There is a gorgeous restaurant right outside the hotel - we enjoyed a really lovely meal there on our last night. Would highly recommend! There seem to be tonnes of 3 star hotels in Rome so its very hard to choose (I always check trip advisor before I book) where to stay. I finally decided on Flavia as I was on a budget and needed somewhere central I was not disappointed at all with my choice.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "isle of man", "Title": "“good base”", "Author": "alessandr10", "ReviewID": "UR80422786", "Content": "read some negative reviews however in my opinion these where unfounded the hotel was clean tidy and a good base to see the sights the staff where also very polite and helpfull yes its not top notch but it doesn't pretend to be. if i had to find any negatives its not the easist to find we walked past the front door several times no problem though as some excellent bars etc nearby", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sofia", "Title": "“Renovated rooms and good location”", "Author": "Destichado", "ReviewID": "UR57425377", "Content": "We came late night and had no problems whatsoever with the access, the receptionist was welcoming and friendly. Seems the hotel is recently renovated or at least we stayed in a recently refurbished part of it. Bathroom was very large and clean. I found the breakfast to be of an average quality level (i.e. no fruits at all). There is a small WiFi internet access in the room (for a small charge) but due to a technical problem was not available for use the first night. Locationwise the hotel is just 10 min. walk from the major sites and train station. I will consider booking it again.", "Date": "March 1, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "CT", "Title": "“Do not trust your reservation”", "Author": "williamtraveler", "ReviewID": "UR50071002", "Content": "We showed up at Hotel Flavia at 9PM after returning from an all day tour and they didn't have a room for us. The reservation through Venere.com did not require any type of call ahead for late check-in. They send us to another hotel and said it would cost the same. The second hotel was not up to our standards and they did not have the $$ figured out with the replacement hotel.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Nice location and very clean”", "Author": "travelguineapig", "ReviewID": "UR47002272", "Content": "I stayed at the Hotel Flavia for 2 nights in late September. Although hotels in Rome are a bit pricey, my opinion was that this was money well spent considering the free breakfast - which was good but not great, the super clean rooms and the convenient location. The hotel is located just off a block away from the main street Settembre which minimized the noise from street traffic. The location was nice as it was far enough from the train station to get away from the local hustle and bustle, but still allow for one to walk easily to and from the main station. I also didn't experience any rude staff. Although they're not outgoing in their friendliness, they were generally nice and helpful if I had questions. If you are on a budget while in Rome, I would highly consider this hotel as an option.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Singapore", "Title": "“Can't beat the location”", "Author": "ktdooley", "ReviewID": "UR46016817", "Content": "This location of this hotel is ideal- only 10-15 minute walk from Termini. It is worth taking the train in from the airport, and then you can return to Termini in the evenings to catch buses to Travestevere. The staff are friendly & helpful.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Aldershot, United Kingdom", "Title": "“Uncaring reception staff - no hot water”", "Author": "AshValeSophie123", "ReviewID": "UR29138347", "Content": "We returned from Rome on 29th April having stayed at Hotel Flavia (3 star) near Piazza della Republica for 5 nights. Reception staff were not very helpful in terms of tourist information and just pointed to leaflets. There was no hot water for showers on two mornings of our stay, the room was extremely small at the back of the hotel in the well of the building (no view). Beds were extremely firm (shall I say hard - difficult to sleep). Apart from that the room was cleaned each day and there was a good buffet breakfast. Good restaurants closeby. Handy for open-top hop-on hop-off tour buses and excursions (Vastours)", "Date": "May 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Very Noisy/1 star”", "Author": "delraycat", "ReviewID": "UR27240224", "Content": "I travel for work every month, and I've traveled extensively internationally. This is among the worst hotels I've ever stayed in 25 years. I was treating myself to a 3 star in Rome but a 1 or 2 star albergo would have been better. I was placed in a miniature room with cheap plywood furniture right next to the elevator. First night: amorous couple next door; next night: soccer fans. Paper thin walls. Loud noises in the corridor, including the maid service, which began at 0630 each morning with vacuum & loud TV. My room overlooked a courtyard. Looking through the tiny window, past the bird droppings, I could see the dirty courtyard and could hear the 3 hour silverware sorting and plate clinking in the cafe each morning. The night clerk refused to give me the wireless ID since it was too late at night, and the signal was poor when I finally got it the next day. NOTE: there is a charge for wireless usage (not advertised). The 1st morning, freezing under my cheap blanket, I went to hear the machine noises (maid) and found the broken elevator was replaced by stairs with an open door to the street. Bad building security. I've never stayed anywhere so loud in 25 years. The only vaguely positive thing I can say is that breakfast (not the one I heard for 2 hours while trying to sleep, but rather the one I ate) was relatively decent - good cappuchino. I barely slept due to the cold and noise. Very sad waste of money. Train station would have been quieter.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "new york", "Title": "“Could Not Wiat To Check Out!!!!!!”", "Author": "onedollNewYork", "ReviewID": "UR20976677", "Content": "Well to start when we arrived our room was not ready...The lobby looked nice, but you cant judge a book by its cover...They tell us to put our luggare in this little room behind the front desk that was not secure so we come back in 2 hours and its ready, first of all there is no one to take bags upstairs and the elevator is so small that that two people could not fit in with luggage..after going upstairs and seeing the dump of a room we felt like checking out and would have if the room was not already paid for...it looked like a room for one, the walls had scuff marks on them and there was a hole on the top of the wall that looked like a possible bullet hole that came from the alley across the street..the remote control was broken, the bathroom was gross, the toliet seat was cracked and the bowl was not affixed to the floor and moved when you sat on it...the shower head was loose and there was no where to put the soap or shampoo..the garbage can was so small nothing could fit..there was constant noise from the alleyway and a man was fighting with a woman for appx 2 hours and the police were never called after numerous complaints from a few people in the hotel...the place that you have to put the key in so the light so the light can go on was hanging off the wall..there is no real bar..the breakfast is not that good..the staff is not helpful and is rather rude, they dont seem to like non italians..they acted like we were doing them a favor staying there..they did not explain anything to us like how to acess front dest etc...very little internet access...would never recommend this to anyone..this hotel should be one and a half star....", "Date": "October 18, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago , IL", "Title": "“Nice 3 star hotel in the middle of Rome”", "Author": "MikeChicago7", "ReviewID": "UR20593304", "Content": "Hotel Flavia is true 3 star hotel in the good district of Rome. You can get anywhere by foot. Hotel is clean, modern, stuff is helpfull and nice, good breakfast. Rome is amazing city and Hotel Flavia is a good bargain almost in the middle of it.", "Date": "October 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Nederland", "Title": "“Definitely not worth 3 stars”", "Author": "Janjaap", "ReviewID": "UR8875327", "Content": "According to website and travel agency this hotel was recently renovated. Maybe...but not the room in which I stayed - Furnishing was clumsy and out of date - Wallpaper on wall near bathroom was blistering because of a leakage - Small room , almost no daylight + Airco worked well + Quiet situated, no traffic noise + bed was ok for one person + shower was small but nice. balanced: Not worth 3 stars / 190 euros per night", "Date": "September 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Great little gem in Rome”", "Author": "jenzo", "ReviewID": "UR7973016", "Content": "First I would like to note that this hotel is rated as a 2-star. We stayed at the hotel for 5 days, at the end of May 2007. The hotel is approximately a 10min. walk from the Termini Station. If you like to walk, like we do, you can spend the day walking to the Colliseum, and other sites from the hotel location. The Vatican I would recommend taking the bus, which you can catch at the Termini station and takes you directly to the vatican. Front Desk: Helpfull. There seemed to be two regulars at the Front Desk. Once spoke some English, the other not much. My wife is Chinese and she had no problems communicating with them and found them to be very friendly. They were helpfull in providing us with local information. Room: Small, but of course every hotel room in Europe seems to be. The room was very clean, and the tiled floor spotless. Bathroom had newer toilet, sink, shower. You had the option of satellite TV. Breakfast Buffet: Friendly staff, great coffee, fruit, pasteries, buns. For a two star hotel we really enjoyed our stay at the Flavia. Great restaurant and convenience store a few doors away. We would recommend this hotel to any of our friends.", "Date": "June 24, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Japan", "Title": "“discrimination! Awful! Terrible!”", "Author": "misyuran", "ReviewID": "UR7872189", "Content": "My husband and I were in this hotel for three days. After that we were in another city for one night and we came back to this hotel again. We had made a reservation of duble room before long. At that time a man said to us that he didn't know why his co-worker had given us one single room and his co-worker had writeen \"single room!!!!\" beside our first name. He showed us the document of room assignment. We checked the room, which his co-worker had gave us. It was too small for two people. We got angry and complained it, so the man gave us one twin room and he gave two american two single room. It was Easter time, so the hotel was almost full. They chose us to give one single room for two people. It was proved by putting\"!!!!\" Because maybe we areJapanese.They knew us, because we had already stayed for three days before that. I wouldn't have complained it if they had given us two single room. This problem happened on April 5th.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "wigan", "Title": "“Flavia of the Month!”", "Author": "emilyt", "ReviewID": "UR7752031", "Content": "My husband and I stayed here for three nights during our European tour. I'm reviewing all of the hotels on tripadvisor because it was through this website that I found all of our hotels and I will be eternally grateful. Here goes... I like my hotels within walking distance to major sites and clean. We are not a high maintenance couple and very rarely awake in time for the free breakfast. The Hotel Flavia is about a 12 minute walk from the train station (if you know where you are going). It takes about 20 minutes to walk to the Trevi Fountain, Pantheon, etc. and about 25 minutes to the Colosseum. We even walked to the Vatican (I read alot of bad things about Rome's public transportation) and that took us about 45 minutes at a comfortable stroll (stopping in souvenior shops along the way). If you don't mind walking and enjoy following a map, the location is great (except for a bit of an uphill slope on the way back - take your time!) The room was very clean. Nice spacious bathroom and a good shower. The 'double' bed was two singles pushed together but it's like that everywhere in Europe and it doesn't really bother us. There was a small tv with a few channels and even a fridge that we used to store some drinks and cheese. I couldn't tell you about the breakfast - we never wake up in time for that - we are on vacation after all! The Ministry of Defense is right down the road, so pay no attention to the guards with big guns. We also recommend you ask reception to hold onto your room key - we dubbed it 'the anchor' and my husband got a bruise on his thigh from it! Overall if you want something cheap and close enough (if you're a walker) to the city, then go for it. Goodluck and happy hotel hunting!", "Date": "June 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Raanana", "Title": "“Well over the expectations”", "Author": "AM58", "ReviewID": "UR5818355", "Content": "Stayed in Hotel Flavia for 3 nights Sept 15-18 – a most enjoyable experience, even after moving there from the Westin Excelsior (two nights prior - a business meeting – got paid for the expenses…). The Flavia: location good although not ideal for exploring Rome. It is close to the Termini train station - ~15 minutes by foot – with wheeled luggage and fair weather you do not need a taxi to get there in order to proceed to Fumicino airport (Leonardo Express train). Nearest Metro station – Republica - ~10 minutes walk. Exploring Rome by foot – the Flavia is on the North-East perimeter of the tourist attraction area. You can definitely walk to all the tourist attractions – but it is too far away to return after several hours on foot for a short (or longer) rest fthe legs to start exploring again, especially not from the Tiber river area or beyond (Vatican). Rooms and accommodations: The hotel seems to be brand new/renovated recently, although the clerk told us that the renovation took place several years ago, so probably the maintenance is excellent. Our room was smallish but convenient, the bed comfortable, reasonable storage space, cleaned daily. The TV – very small ~20 channels but none in English… The bathroom – big (almost the size of the room), shower only, plenty of hot water, towels clean changed daily. The most convenient device in the bathroom – the towel dryer – after strolling all day long in rain you can dry out the clothing and sneakers ready for the next day rain. Aircondition - central, a bit noisy but very efficient (as we understand not all the hotels in Rome have A/C). Breakfast – excellent: a variety of fresh bread, yogurts, coffee/capucinno/expresso, croissants, fruits and more. No hot food, no vegetables – but you can not expect for more from a 3 star hotel. We enjoyed the breakfast in Flavia even more than in Westin…. Nearby restaurants – on the Flavia street within 100 meters from the hotel several. We have tried one (do not recall the name – the one with the huge screen TV) – the pizza and the salads were excellent, unfortunately we could not repeat the experience – most (if not all) the restaurants are closed ~15-19 for siesta – as we were surprised to find out on our last day in Rome… Pricing - 130 Euro for a double per night -reasonablein Rome. Staff - very friendly, speaking various degrees of English - no problems. Internet access - a bit limited - a relatively slow connection from a single old lap top computer in the room behind teh reception, not always imediately accesible...", "Date": "September 20, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Nice, not great”", "Author": "Amireh", "ReviewID": "UR5786049", "Content": "The hotel is in a great location. The night I checked in, the clerk spoke English and I was very grateful. However, none of the other clerks spoke English. There is a lift, free internet and breakfast in the morning, which was nice. My room was clean but small as was the bathroom. Nice place to stay on a budget.", "Date": "September 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Warwickshire, England", "Title": "“Good all round”", "Author": "Richard86", "ReviewID": "UR5355445", "Content": "My friend and I stayed at Hotel Flavia for 3 nights from the 12 June. We requested a twin room, but in fact got a triple (room 222), which overlooks the road outside. The hotel is in a great loccation, being near enough to Termini Station, to walk with suitcases; whilst being in walking distance to all the main sites. Its in a side street just off the main road, so is quiet at night; but also easy to find. The surrounding area is also pleasant, and there is a very useful grocery shop nearby. We were both surprised with how clean and well decorated the hotel was. The room was nicely sized, with basic facilities, and the bathroom was lovely. The staff were very helpful, and the rooms were cleaned very well. Breakfast was excellent, the range was good and what was on offer was really well done. I really recommend the coffee and freshly made pastries. The only things we could complain about were that we could hear other peoples TV's in our room and that the main light was missing. But these are nothing compared to the good points of staying at this hotel; and we would both intend on doing so if we returned to Rome. As for Rome itself, we walked everywhere; it seems that in the time it takes to walk to and get on a bus or the metro you can probably walk to where you want. We only used the bus to get to St. Peters and to get back from Via Appia. We would also recommend a visit to the Baths of Caracalla, which we felt were very under-rated.", "Date": "June 17, 2006"}, {"Ratings": {"Overall": "4.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "Stoke-On-Trent, England", "Title": "“Hotel Flavia - a little gem”", "Author": "Tyrfau", "ReviewID": "UR5336341", "Content": "I have recently been to Rome for the first time. Picking hotels from a website is a complete nightmare - but i fell on my feet with the Hotel Flavia at venere.com. It was a little pricier than i wanted, 100 Euros a night for a single, but it had everything i could have wanted. I do a lot of business trips in England so i am probably a little spoilt, but i had no complaints at all about the hotel. The room was basic, but clean and modern. The bed was comfortable and there was hot water whenever i needed it. The towels were clean and the room was cleaned daily and towels changed regularly. I was there for 4 days. The location is fantastic. It's 10 minutes walk from the main station, which was where the Terrorvision coach dropped me. If your travelling from Ciampino airport, i thoroughly recommend them - check out their website - 13.50 Euros got me a return trip from Ciampino to the main station terminal, their ticket office is just ahead and to the right at Ciampino. The coaches are air conditioned, which is a godsend in hot weather. Anyway, the location of Hotel Flavia is excellent. It's about 15 minutes walk to the Spanish steps and within walking distance, for those inclined, of all the major attractions. In two days, my friend and I visited the Spanish steps, Trevi Fountain, Coloseum, Palatine Hill, St Peters, Castell D'Angelo, Pantheon, Circo Maximus, a walk down the banks of the Tiber and a number of other places all by foot. If your English speaking and you do visit the Coloseum, seek out Discovery Tours by the entrance. For 20 Euros, they'll bypass the sometimes lengthy queues and give you a guided hour long tour of the Coloseum and then another 45 mins at the Palatine Hill where the Emperors lived. I guarantee it's well worth it - you learn so much more about these places than you would if you just walked around. It's not too rushed so you get time for plenty of photos and there is a short break in between. Anyway, back to the hotel. They didn't try and change anything or charge me more. They certainly knew their English well. The breakfasts were not limited and there was plenty to eat if you wanted, they didn't run out of anything. I had seen many horror stories of other hotels on the internet. There is a lift that reaches the upper floors and a telephone in each room, with the exception of 222 for some reason. Also, for those that need to remain in touch, there are lots of little phone and internet cafe's around Rome. Lastly, we also found a great restaurant on my first night, the Ristorante La Locanda di Bacco. It's not the restaurant next door to the Flavia but a few doors down at number 32, just on the other side of a little shop (from which i recommend the strawberries - bliss!). . They served beautiful meals at a sensible price. Beware, Italians seem to spend all night eating so their portions can only be described as 'healthy\". The owner is called Roberto and is a really friendly person. I returned a few times, both to eat and just for coffee and a pastry. I was always treated with courtesy and respect and never overcharged. Please mention you saw his restaurant recommended on the internet. If your going to Rome, i hope you enjoy your trip, though i can't see how anyone could enjoy it more than I did!", "Date": "June 12, 2006"}], "HotelInfo": {"Name": "Hotel Flavia", "HotelURL": "/ShowUserReviews-g187791-d528439-Reviews-Hotel_Flavia-Rome_Lazio.html", "Price": "$95 - $222*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Flavia 40</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "528439", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/98/69/9869746368eb139c44e5cc5a44f73fb37large.jpg"}}