{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Cheap hotel...location not bad”", "Author": "Teils", "ReviewID": "UR127193657", "Content": "There were 4 of us adults staying in one room at this hotel.... Not easy to find because there are 3 hotels in one building and this one is in the third floor.... There is a lift inside the building.... However it's tiny and mainly for baggage. The room had no space for our luggage really... The bathroom was tiny (we had a private one) - the shower was minuscule.....not sure how 'larger people' would actually fit!!!! Our rooms were tidied and made up beautifully every day! Staff were so very nice! There is a laundromat literally around the corner, and lovely little restaurants everywhere you turn. Location is not bad... Walk to corsa street (shopping), 5 minute walk to square de popolo.... And short walks to other places..... We caught a taxi tothe Vatican city!!! For the amount we paid and the 4 nights we stayed - I would probably stay again - perhaps only 3 per room though with private bathroom!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Basic hotel with bath for very little money in Roma.”", "Author": "Garee00", "ReviewID": "UR125824693", "Content": "Probably one of the cheapest sleeps with private bath in a very central area (no, termini does not count as central). Rooms are decent for the price, and breakfast included at the bar across the street (means you have to wear shoes, but u get a real caffe). Having been to roma multiple times and having stayed from 0* to 5*, i would recommend this for those on a budget.", "Date": "March 8, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“A great location..... The staff could not have been more helpful...”", "Author": "Martmonty", "ReviewID": "UR125345188", "Content": "Last weekend we stated at the Azzurra hotel....17 of us in all. A great location....plenty of bars , restaurants , culture nearby. Very clean, good price.... And the staff were fantastic . I will be going back.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good budget accomodation in great location with friendly and helpfull staff.”", "Author": "727273", "ReviewID": "UR125037736", "Content": "Went with a group of 18 people and this hotel was ideal for our needs. The location was good for sight seeing, bars and restaurants. The staff were all friendly and helpfull at all hours of the day. The rooms were basic but were very clean. We felt safe both in the hotel and the surrounding area. Would deffinatly go back. We got 4 people in the lift. Beat that!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“excellent location”", "Author": "cathy183", "ReviewID": "UR123347459", "Content": "I stayed here last weekend (january 2012) with my two daughters aged 12 and 9 and had a really great experience. The hotel is excellently located, about 3 mins from the Trevi Fountain. The room was very spacious, had one double bed, two single beds and a couch, a fridge, a safe and a TV. On arrival I was ill and the very friendly owner gave me two bottles of water and asked the chambermaid to make up our room first so that we could check in, even though it was 11;30 am!! The free Wifi was an excellent added bonus, and the breakfast was in a cafe about 50 paces from the front door of the hotel. The staff were available for questions at all times and were extremely friendly. This hotel changed hands four months ago so my advise is to ignore any reviews dated before that. I can highly recommend it and will definately return. It was clean, spacious and had a very friendly helpful atmosphere at all times. Cathy, Rachel and Ellie, CORK IRELAND", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Reasonable price, perfect location”", "Author": "alexalaf", "ReviewID": "UR122770538", "Content": "Perfect location, in the center of Rome, walking distance from the Fontana di Trevi, Colosseo, Pantheon, via del Corso. Only 3 stations away from the Vatican City. Reasonable price, very helpful receptionists (speaking perfect english). The room had the necessary equipment and was very clean. Also good heating, cable TV and free wi-fi. Disadvantages are the noise (could hear every noise from the reception or the other rooms), the room provided just the basics and the breakfast was very poor (just a coffee and a snack). Also not really spacious but it's worth its money if you don't mind the above disadvantages.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Location”", "Author": "Laura C", "ReviewID": "UR122766995", "Content": "Great location. The staff really helpful and super nice!!! The room was typical 2 stars, but really really clean and quite comfortable. The breakfast is included but the brioche is super sweet and they dont have plain/buttery croissants, I mean it's not a big deal, but being the first thing in the morning, it was on the sugary side. Overall I would recommend it.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kristiansand, Norway", "Title": "“Great location at a very good price”", "Author": "Baksetesjaforen", "ReviewID": "UR120438096", "Content": "The hotel is average, really, but it's clean and the staff is friendly and very helpfull. But the LOCATION IS SUPERB!! You dont get many cheap hotels, if any, in this area with your own bathroom and with this standard. Metro stop Barberini is 5-10 mins walk away, which you can take all the way to the Vatican. The Trevi fountain and Spanish steps are both a walk away, Trevi is probably just 10 mins walk. The colosseum is probably a good half hour walk, but catching the metro is no prob, thats what we did. (Barberini - change at Termini - to the stop colosseum and voilà..) The hotel is in a side street, so there is no traffic noice what so ever. It was a bit hard to see the sign, so when u get there look for a small, square, gold sign with hotel Azzurra written on. Something that confused us a bit was that theres 3 hotels using the same entrance, so to find the reception you have to take the elevator to the right (the smallest and coolest elevator ever! :)) up to 3rd floor. There are restaurants and bars right around the corner, both towards Trevi (bit touristy but not too expensive) and on Via del Tritone. We went to a place called White; Friday was good atmosphere and really good music, Saturday the prices had gone up but it was still a good disco. Right next to it, on the corner, is a really cosy bar/restaurant with amazing staff and fantastic drinks, worth a visit:) Theres also a bar basically next to the hotel entrance (its down a set of stairs so no noice from there either), think its called the Old Bell, we ended up there at 5 in the morning and there was still people there, tho the atmosphere so so, but if u dont want the night to end-its not the worst place you could be:) Enjoy Rome!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Shady management - BEWARE”", "Author": "nrowens", "ReviewID": "UR118741662", "Content": "This hotel charged my credit card without authorization for an additional tax not included in my agreement through Hotels.com. For new travelers, the hotel now makes people aware of this charge - however, when I booked it was not included and my total stated that it included all taxes and fees. I had a printout of this that I showed to hotel management. After discussing with hotel management for an hour, we agreed that I would not be charged and I paid the amount per the agreement. Then three days later, without contacting me or asking for my authorization, the hotel management secretly charged my debit card for the additional tax. This wasn't even the card I used when checking out but a different card I used months before when making the reservation. The tax itself was a minimal amount, however, I am shocked that the management would go behind my back and charge me without my consent or authorization, especially after agreeing that I would not be charged when I checked out. This is very unethical and I have opened a dispute with my bank. I would not recommend staying here due to the shady business practices of hotel management.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location and great staff”", "Author": "Madow13", "ReviewID": "UR117416448", "Content": "Everything about this place was great. The location is amazing; a 10 min walk from Termini train station, or 2 mins from baberini metro stop. 3 min walk from the Trevi fountain, a couple mins more and you are at the Spanish steps. We walked to every site in Rome except the Vatican which was 4 metro stops away. Breakfast was at a nearby cafe which was very good. A coffee item and either a plain croissant or a chocolate filled one. Our room got cleaned every morning and the lady even arranged our clothes and documents. The staff were great, they even give you free postcards upon departure. The only negative was that our room was the farthest from the lobby which meant we didn't get wifi in our room. We just had to sit on the leather coach outside our room to use the Internet. Not a big deal. All in all a great stay for such a low price.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Norway", "Title": "“For a one star hotel it was great. Brilliant location!”", "Author": "kjerstilsk", "ReviewID": "UR115955485", "Content": "We choose a central, cheap hotel to rather spend our money out on town. I think the hotel was satisfactory for a five night stay if you like me are not too picky. My bathroom was small, but okay. In the room there was a wardrobe, desk+chair, double bed and two nightstands. The tv only had a few channels, all in italian. My parents room had a different layout and bigger bathroom. In my room the airconditon, which looked like is was installed fifty years ago, worked fine. However, I was not able to adjust it. This was not a problem as I was happy with the temperature and power. My parents aircondition hardly worked, so they had to open their windows. The humid Rome air, traffic and people outside disturbed them. When they spoke to the receptionist, his reply was: \"Well, what do you expect of a one star hotel?\" He surely has a point, but If it isn't working, they should not advertise that the rooms are airconditioned. Other than that, the receptionist was helpful. His english is not great, but we managed. Italian breakfast is crap. We got a croissant and a cup of coffe/tea in a cafe 40 meters down the street. All in all I think this hotel gives you good value for your money, Its situated in a fairly safe neighbourhood and there are many surrounding attractions, cafes, bars, restaurants and groceryshops. The tube is also close. No internet access. The receptionist told me they are going to renovate the rooms and build a breakfast room. This could make this hotel even more attractive in the future. P.S. The lift/elevator only worked every now and then. On departure day we had to carry our suitcases 4 floors down.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good quality budget accommodation in a fantastic location”", "Author": "Thenoo", "ReviewID": "UR115142043", "Content": "Located on the fourth floor of a traditional old city centre building, there was a small lift but probably not advisable if your not keen to walk stairs. The hotel staff were very friendly and could not do enough to help and were on site 24 hours. The bedroom was spacious and always clean (housekeeping every day), the bathroom was tiny but fully functional. There was also free wifi. The location was excellent, walkable distance to all the major sights, approx 5 mins to the Trevi Fountain and Spanish Steps, 10 mins to the Pantheon and Piazza Navona, 20 mins to the Collesium. For budget accommodation in the city centre, this hotel is excellent value for money.", "Date": "July 8, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manila", "Title": "“good location and nothing else”", "Author": "elaineeyyy", "ReviewID": "UR108748545", "Content": "Ideally located near tourist spots and wonderful, wonderful restaurants/cafes. Our room was spacious and well lit. Bathroom was okay (although cleanliness is another issue). That's basically it. Couldn't quite figure out the owner and his staff (who are relatives of the owner). Breakfast from a nearby cafe (we were given vouchers every morning. make sure to get from the owner the night or afternoon before; the staff have a tendency to be MIA) was adequate (awesome coffee and good pastries). Be careful not to fuss about when inside the very small elevator. It can get misaligned (thus, you're stuck) but don't panic... you'll have to either press up or down again to fix it.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“nice one star hotel in central rome”", "Author": "robertsen21", "ReviewID": "UR103290653", "Content": "good hotel specious rooms and helpfull staff free water and soft drinks, convenience by price, 1 min. from metro and 3 min from trevi fountain, via veneto and spenish steps good location for shopping reception 24 hours clean bathroom white bedsheets and towels this hotel offer more than two star hotel win by location.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“PRIME location but a rundown place”", "Author": "Cousinavi", "ReviewID": "UR65815607", "Content": "I stayed at the Hotel Azzurra in May 2010. We had 2 nights in Rome on our way back to the states. Really our trip was an extended layover and a chance to look around the magnificent city. Knowing that this hotel served its purpose. The area Simply could not be better. We were 2 blocks from the Barbarini Metro Station and 2 blocks from the Trevi Fountain. Once on the train, we were 4 stops from the Colleseum, and 3 from the Vatican. It was as I said PRIME location especially at that price. Similar hotels in the area would have been 200-300 USD. This one was 87. I could not find anything cheaper. That said, the hotel is Ghetto. Its a place to hang your hat and get a nights sleep, then check out the city. Knowing that it serves its purpose. For us it was perfect. But I wouldn't stay there more than a couple nights. If your looking to enjoy the city at a very cheap price, this is the place. But don't expect anything your used to when it comes to hotels.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Rome, Italy", "Title": "“Next Time I Will Listen to Feedback that Reads \"Owner Runs Around in His Underwear\"”", "Author": "CinziaVancouver", "ReviewID": "UR53718013", "Content": "Hotel Azzura - Rome First I want to say that prior to my trip to Rome, I did read all of the feedback on www.venere.com & TripAdvisor about this hotel. Some of the comments read: cranky old man who would take 30 minutes or more to answer the door after midnight; owner would walk around in his underwear; shower too small etc. etc. But the prospect of paying $40 Euro a night taxes & breakfast included and 5 minutes from the Trevi Fountain was more appealing to me than all of this feedback. I decided to go for it and book 1 week and then later decided to book an additional week. This was my first time in Rome and I did not have a hard time finding the hotel because I Googled the location prior to arriving. A man buzzed me into the building. There is another hotel in this building (Hotel De Petris). So when I entered the building I saw a lift but it was specifically for the Petris Hotel. I proceeded to lug my massive suite case up the marble stairs and then the man from the Azzurra hotel shouted down to take the lift. I was confused, I thought it was for the Petris…so he came down to meet me and I then saw the “other” lift which I could take up. It was very small but this is typical in Europe. I entered the lobby of Hotel Azzurra and checked in. I went to show the man the printout of my reservations from Venere but he did not seem interested in seeing the reservation printout and said that I can pay at the end of my stay. He also told me that there was no breakfast but that he would take $2 Euro a day off of my bill. $2 Euro will buy you a cappuccino. I was shown my room and was pleasantly surprised because it looked larger than the single room shown in the hotel photos. I had a double bed and a large bathroom. There was a mini fridge as promised, a phone and 2 large windows, one in the room and one in the bathroom. There was a large wardrobe with dresser drawers and that was where the safe was located. There was a small TV that sat on a desk. I still felt uneasy about the front desk person not looking at my reservation printout. In all of the TripAdvisor feedback (and to me common sense) it is recommended to show your hotel confirmation upon arrival so that there are no surprises. I went back to the desk and showed him the first page (1st 7 days) and confirmed that the price was $40E per day and then showed him the second week’s reservation. He was not aware that I had booked for 2 weeks. He only recognized the first week. I was given a key to my room which had to be left on the shelf behind the front desk when I left the hotel. I was also given a key to the outside door of the main building. I was not given a key to get into the Hotel Azzurra and was required to ring a bell and someone would let me in. The only time this became a problem was in the evening especially if I was out past midnight. The older man did not like it if you arrived back after midnight and would take at least 30 minutes to answer the door because he would be sleeping. One night he yelled at me and said “Don’t you sleep!” I was prepared for this because I had read about his behaviour in the feedback of others. Then on another night he told me that he had to pay the girl (that sometimes appears to stay there) $10 Euro to let people in. I was a little annoyed because this was my vacation and really I was never out super late (not that I even have to justify that), in fact most of the time I was back before midnight. I did hear other people ringing the bell for a very long time and once he let them in they made it clear that they were not impressed as it happened a few nights in a row to them. Before the end of my first week the younger man asked me if I would pay my first week in full and then pay the remaining week upon checkout. I paid him in Euros and as promised he deducted $2 Euro per day. My room was the favourite part of my stay at this hotel. There was a nice window where I sat with a glass of wine after many hours of walking. The phone did not work and I think it was there for decoration. They did have a pay phone in the hotel lobby. The mini fridge sort of worked. The air conditioning worked. The TV had 1 or 2 channels but I was not there to watch TV so that didn’t really matter to me. The room was cleaned almost every day the first week. For the second week I did not get clean towels and I had to clean the shower myself. I also bought my own plastic cups as there were no drinking glasses for water in the room. I usually had to ask for toilet paper and one morning at about 9 when I went out to the lobby no one was there. There was usually no one there at that time of the morning. I had to call out and finally this young woman came out of a room and brought me some. It looked like I woke her up. The girl did not speak English but I also did not expect her to. She was always very friendly. The man that greeted me initially, he speaks English and the older man referred to in much of the feedback speaks broken English. The feed back was correct about this older man walking around in his underwear. It was indeed teeny underwear and although he did wear a robe it is wide open. A note for the single female traveller: One night when I returned to the hotel this same older man said “We should sleep together.” I just went straight to my room and locked my door. I was upset and the next morning the younger man (I am assuming the younger man is his son) asked me if I was ok. He had a smirk on his face. I did not say anything. I just went out and carried on with my site seeing. I actually thought the older man was harmless and a bit eccentric maybe slightly crazy a bit of a character and probably the sort of person one would see in a Vacation Comedy. During my entire stay the older man did constantly bother me or knock on my door. The day before checking out the younger man again asked me to pay for my final week. When I got back to my room I realized after looking at the receipt he gave me that he had not taken off $2.00 Euro for all of the 7 days. I thought I would leave it for the morning and deal with it upon checkout. When I went to drop my keys off the next morning upon checkout there was no one there at the front desk and the lobby was dark. To sum it all up I have to agree with what one person said, this hotel is not for the demanding customer. If you are coming thru Rome for one night, are on a budget and just need a place to crash that is central then maybe this hotel would work for you. As for single women if you can put up with this older man (or put him in his place) and not let his pestering bother you than I also say go for it. This being my first time in Rome was just a taster for me. I would not stay in this hotel again…maybe if the owners were different and it had a 24 hour reception. One person described this hotel as having its own climate, I totally agree. This place has so much potential but it’s as if they don’t really care.", "Date": "January 17, 2010"}], "HotelInfo": {"Name": "Hotel Azzurra", "HotelURL": "/ShowUserReviews-g187791-d529199-Reviews-Hotel_Azzurra-Rome_Lazio.html", "Price": "$78 - $183*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via del Boccaccio 25</span> | <span class=\"extended-address\">Metro Barberini Fontana di Trevi</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529199", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f9/d0/d2/double-room.jpg"}}