{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Loved It”", "Author": "Mia1978", "ReviewID": "UR128232709", "Content": "Stayed in this hotel back in 2005 - absolutely loved its charm. The location is brilliant and staff were great. It is not a luxurious hotel but it is everything you need in this amazing city. The location is second to none for exploring the city. There are some great restaurants and bars in the area also.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good location, comfortable”", "Author": "Mease8", "ReviewID": "UR123219293", "Content": "Although this hotel is nothing spectacular, the location and especially the service make the difference. My friend originally made the reservation, but ended up missing her flight, which left me arriving first. A quick call from my friend, the reservation was switched to my name with no issues and the front desk was prepared. The room was adequate, everything was clean, and there was a/c which was much appreciated as I was there in the summer. The breakfast in the morning was nothing special, but fit the bill if you want to save money. It was easy to walk around Venice, although it was a bit tricky to find at first. Venice is expensive, and I would come back here if I find myself in the area again.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“Magical place in Venice”", "Author": "MoooTi", "ReviewID": "UR122102616", "Content": "Only 1 star hotel but give you perfect values for money in middle of Venice. It is just 5 minutes walk from the main canal vaperto satiation; it is not fancy or luxury but for couples it is just enough o get the spirit. clean and cozy. Brackfast is Ok. Staff is friendly and speak English. We have spend 2 nights and enjoy every minute. again it is only 1 star hotel but the reward is above and beyond", "Date": "December 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Not the best, and over-priced for what you get”", "Author": "Kitchenhelp", "ReviewID": "UR118372924", "Content": "Good location in Venice, but lacking in basic amenities like a shower that doesn't suddenly go completely cold just about every time you're in it. The breakfast was basic at best, and left us looking for more once we started our tours in the morning. They did not provide the separate twin beds that were requested and recorded on our reservation form, and offered no alternative other than for us to look for a different hotel to stay in. All hotels in Venice are over-priced, but from talking to other tourists there are better ones than this to be had at the same price.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“A decent stay for a decent price”", "Author": "TouringOT", "ReviewID": "UR117581466", "Content": "This hotel consists of one building with many rooms within, some with a shared bathroom. Other rooms are located on the same street, not within the doors of the hotel. It functions more as a youth hostel than an actual hotel. There were no illusions when we booked our room here. My friends and I got stuck at the last minute, literally, and someone in Venice recommended this hotel because of the location and the price. We were allowed to view the room before booking and then took it! The staff (one person behind the desk from 7am - 12am) was extremely kind and helpful whenever we had requests. We received a large room for 3 people, the air conditioning worked well, there was a safe in the room, and the location is no more than a 5 minute walk to the local bus (boat) stop in the heart of the Ghetto area. We had a shared bathroom with one other room in a private alcove. The bathroom was extremely narrow and the shower flooded the bathroom floor each time we turned it on. I would recommend this hotel if you know what you're in for. If there's one thing I've learned over this trip, it's that you get only what you pay for. So if cheap is your goal, this is a decent place to stay in a very expensive city.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Columbia, Missouri", "Title": "“decent room, poor bathroom”", "Author": "oobleckclyde", "ReviewID": "UR114618571", "Content": "This hotel is your average budget european hotel with two twin beds pushed together for a double room and a shared bathroom. The shower in the bathroom had malfunctioning hot water and it was easy to get water all over the floor while showering. There was a mop and bucket provided for cleanup. I'd say your experience at this place will be influenced greatly by whoever ends up sharing the bathroom...our fellow bathroom users were naked in the hallway and made a big wet mess each time they showered!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Clarion, Pennsylvania", "Title": "“Great location, unhelpful reception”", "Author": "Designs1", "ReviewID": "UR114509511", "Content": "Fab location, good place, except they put me in an apartment, different location, which I knew BUT without saying there would be no internet. They could post that info w/the booking service. Also would have been nice to have gas for cooking turned on. The real inexcusable thing, though, is the following. Single traveler arrives exhausted to main hotel to check in. Receptionist shows how to arrive at apartments but doesn't offer simple advice to use vaporeto (get a 24 hour pass & use it, great way to get around Venice), which would have been much easier than dragging the luggage up & down all the steps. In addition, upon asking for alternate suggestions on returning to the airport, only received the vaguest \"maybe it's this\" kind of reply. All delivered with an attitude that conveys how traveller has ruined his day by showing up. Shared response with another traveler who said exactly the same thing, not helpful at all. So if you don't want to be in the hotel business and hate having to answer tourists' questions to get them oriented, why don't you get out? You have a nice place, why spoil the experience with such a bad introduction? Housekeepers very nice & friendly, not much English but helpful.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ypsilanti, Michigan", "Title": "“The off site room with shared bathroom was in a great location!”", "Author": "jmlangdon", "ReviewID": "UR110176490", "Content": "Loved Venice, had a great experience with this hotel. We ended up with the off site location, but it was great. It was near the Ca d'Oro vaparetto stop and just off the main thoroughfare, where there were some great restaurants and an excellent gelataria. It's a basic hotel, no frills and you should bring your own towel. They provided towel sheets, but I was glad to have a more terrycloth type material to dry off with. They also provided soap, some places on our travels did not. It was VERY clean and pretty quiet. You do have to share a bathroom, but it wasn't a problem. There is no wifi provided by the hotel at this location, but we were able to leech off an unsuspecting soul to check our email and get restaurant reviews and such...", "Date": "May 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "quebec", "Title": "“disappointed”", "Author": "qcquebec", "ReviewID": "UR75516566", "Content": "Close to the train station, the room had a damp moldy smell. The shower splashed water all over the floor and the shower curtain was old and moldy. Sound travelled easily between the rooms, even speaking in normal tones. I would not stay here again.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Great value”", "Author": "Disjecta", "ReviewID": "UR68026120", "Content": "I think this is a family run business, so service is rather hit and miss. Depends on who you interact with (and if you communicate via English or Italian). We found tripping our way in Italian to be the better option :) The room was small, but was airconditioned, high ceiling and a nice big window. It was clean. View is nothing to shout about but gave you the feeling of staying in an old school Italian home. I liked looking out of the window whilst people below me walked on by. Bathroom was tiny but clean - don't expect luxurious soaps, all we got were two packets of shampoo and two small bars of soap! But this seems to be the standard in Italy? Location is quite near Venice Santa Maria Novella station but is very quiet. About 5-8 min walk. It's located in an alley/small lane from the main street. That aside it's a long walk to St. Mark's Square. Great value for Venice island. But book early if you want the hotel rooms (and not the apartments - which are somewhere else).", "Date": "June 19, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Value": "4", "Location": "4"}, "AuthorLocation": "Kansas City", "Title": "“Clean, Safe, Good location close to train/bus station”", "Author": "srich1980", "ReviewID": "UR64315381", "Content": "We stayed at hotel Ariel Sivla for 2 nights in May and were pleased. Don't be put off by the location in a small alleyway with a tiny sign (you turn left where there is a sign for Hotel Leonardo on the corner - we passed it the first time) Our room was clean and no frills and just what we were looking for. It is a 10 minute walk from Santa Lucia railstation in a safe area. The first deskperson when we arrived was borderline rude but the others we met were much nicer. Breakfast was included. No elevator. Good hot water and water pressure. We would recommend it to a friend.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Basel", "Title": "“Apartment swith no privacy”", "Author": "mainipriyanka", "ReviewID": "UR62250596", "Content": "Hotel has several apartments spread in Venice. Our apartment was good but we were allotted room somewhat far away from the Train station. Owner was good. But the reception of the hotel is at different place than where we were staying in. There was no privacy in the apartment as each apartment is shared by many people and bathroom and kitchen is shared. If one choose to stay back in apartment then its difficult.", "Date": "April 23, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "1", "Service": "1"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Stroke”", "Author": "colatina", "ReviewID": "UR56422962", "Content": "Stroke! We made the booking over the internet and on arrival were housed in rooms away from the hotel, in isolation, and no one was with us. We had to find the site alone. There was not breakfast and the price charged was higher than advertised on the Internet. But it was carnival and we had no other option", "Date": "February 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "toronto", "Title": "“OK value, but staff not very helpful!”", "Author": "Jo_AnnToronto", "ReviewID": "UR48241048", "Content": "Location of this hotel was very good, although hard to find. Look for the Hotel Leonardo sign and turn at the very small alley next to it - (although we would not recommend that you stay here). Otherwise you will be looking forever! Room was very small and hotel was super noisey. Noise started at 6am, with the housekeeping and front desk staff talking so loudly: and lots of banging. Luckily our Air France flight provided us with earplugs! Staff were not helpful at all and there wasn't even any shampoo in the room. Towels were like dishcloths. It was more like a hostel than a hotel. The windows did not close completely and the screen on the bathroom was torn, so I was bitten several times each night by mosquitoes. Our request for a 6:30am wake up call (for our return flight), came at 4:30am, then after contacting the deskperson to confirm time, another wakeup call came at 5:30am, then again at 6:30am! Our shower on the last day included the shower head falling off of the hose. Front desk person was very insulting in implying we had \"broken\" it! Breakfast was the same thing every day and consisted of a dry bun and jam and a small croissant with the same peach jam inside. Honestly, I think you can find something better than this hotel. By the way, this is my first review I have written (and I travel very frequently)... but it was that bad : (", "Date": "November 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Coimbra", "Title": "“very nice”", "Author": "pir0uette", "ReviewID": "UR46941725", "Content": "I have to say i enjoyed my stay here very very much! It's a small place, very clean, quiet, close to the station and it's really not expensive compared to other prices we encountered in venice. It seems to be runs by a family that is very helpfull and polite, and we were allowed to leave our bags in the day of the check out. Our bathroom was shared with another room only, and it was clean and spacious. I also have to mention the breakfast, because that is a very important factor to me, it was breakfast only, no false buffet claims, but the best breakfast we had in our entire hostel, B&B, hotel experiences in italy [we were obviously travelling on a low budget, you probably get very nice and fancy breakfasts in places that are a little more expensive]. Great capuccino, bread and brioche. The room was big and the bed confortable. We enjoyed our stay very much!", "Date": "October 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Small but clean & good location”", "Author": "DaisyFred", "ReviewID": "UR46505012", "Content": "I'm putting this review on before I forget any detail as only just there a couple of days ago so will try & keep it brief! This is only a 10-15 minute stroll from Piazzale Roma where the Ryanair/ATVO bus drops you off. Arrived at the hotel @ 11.15pm on a weekday night. For a twin & triple room the cost was 190 euro - as there were 5 of us this worked out to be 38euro each. The guy who was on reception wasn't over friendly but wasn't rude either. Once passport details were taken he then showed us to our rooms. Slightly worried that we'd have another 15 minute walk, which some have had to make, we were taken across the narrow \"avenue\" to our rooms. Up one flight of stairs and 3 keys later there we were. A twin room, which smelt of damp and another room which was quite large(and bright in the daytime) awaited. 5 of us had one bathroom to share. This was fairly small and as well as the sink and toilet had a bidet, for some strange reason, as well as a washing machine & mop and bucket! The shower wasn't particularly high so if you're tall you need to crouch a bit. Water was hot though and the pressure ok. \"Towels\" were provided but these were more like bedsheets/tablecloths in texture & absorbancy-they did the job though and were clean...as was the bed linen and surfaces. There was a bedside table lamp in our room and a wardrobe but no mirror. In the 3-person room there was a mirrir on the inside of the wardrobe and a view of some rooves and washing. All in all the rooms & bathroom were pretty basic but enough to rest you head & wash (albeit a bit snug!) Next morning it was down to a rather limited breakfast but much friendlier staff. You have a choice of tea, coffee or cappuchino. Very nice cappuchino but you get one and that's it. Food consisted of a croissant, breadroll & 2 small slices of pre-packed \"toast\" along with butter and jam. Don't expect the breakfast to keep you going until late afternoon even if it is carbcity! If you turn right out of reception, walk to the end and turn left, keep going straight you come to a little piazza with a cafe/bar. This was still open @ 11.30/12 with a few locals and some tourists and they're pretty friendly. A prosecco is 3.50 euro and a small beer (20 cl) I think was @ 3.50/4 euro. Will post more details on forum to do with the rest of the sights etc but feel free to ask any more questions if I haven't given the info you need on the hotel here. Caio!", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Good place to stay”", "Author": "gabigirl27", "ReviewID": "UR37926325", "Content": "Hotel Ariel Silva is a pretty small hotel, but with good facilities. Unfortunately no internet connection. The single room I got was spacious, had air conditioning and nice furniture. I don`t know how breakfast is like because I had to check out very early in the morning to catch a train. If you re looking for a cheap and good accomodation, then this might be the place for you.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very strange, but alright.”", "Author": "Excentrique", "ReviewID": "UR33879312", "Content": "My friend and I booked this hotel because of its location and the price. We wanted cheap since we were on a major budget but still wanted to go to Venice for nearly a week. We arrived very late at night, and surprisingly was told by the concierge that we would not be staying at that place, but at an apartment \"close by.\" We are young & don't mind the adventure, but the concierge just sent us out to find this place alone with minimal directions. Found it - and it was actually quite nice, kitchenette and a shared bathroom. The only problem was the last night we were there, the electricity went out and all of our food kept in the refrigerator was spoiled. Also, someone actually had unlocked our door in the middle of the night, opened it, and then closed it again. I have no idea what that was about, but it didn't make me feel very safe. Still, these apartments were good because they were in a great location, good price, and very minimal - everything you need when you go on vacation to EXPLORE the city and not stay in the hotel room watching television.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“Cute genuine Roman hotel”", "Author": "Vitz6", "ReviewID": "UR23293520", "Content": "Cute little hotel 5 mins from Grand Canal stop. Excellent rate (175 euro for 2 nights). Easy to get to catching bus from airport to main stop at Grand Canal. Hotel was no frills but still had the character of a genuine Roman home. Surrounded by plenty of local arty-type shops, eateries and touristy/souvenir shops. Good hotel, staff and rooms (although the towels were size of a face cloth!! Good thing we had 2!) and well maintained.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Disappointed”", "Author": "texastaino", "ReviewID": "UR22966277", "Content": "I was by mysellf and I went to Venice on one of the many days when the Venice airport was in strike. I arrived to Venice by bus at midnight since my flight was cancelled. After attempting several ways to get to the hotel, I was left in the canal by a water taxi who charged $100.00 to get me close to the hotel. After walking around, I finally found it, thanks to a picure that I saw in the Trip Advisor of the Leonardo hotel which is located next to the Ariel Silva. I really appreciate the person who provided the picture. The staff was not friendly and the owner was even rude. I was disappointed since I had been in Venice before and my previous experience was terrific.", "Date": "December 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Overall Positive”", "Author": "Global-Reporter", "ReviewID": "UR20395192", "Content": "We didn't come with high expectations, but overall the stay was positive. We stayed in the apartment 4 bridges away, near the McDonalds. The hotel is a bit difficult to find, and the website does not give very good directions. (I will post detailed directions on a tripadvisor forum to help others in the future.) In the meantime, on a map, find and get to Rio Tera S. Leonardo (street) and find the Hotel Leonardo sign (see photos), and go down that street, Calle De La Masena. The staff speak limited english, but can get their point across and are reasonably friendly. We paid 85 Euros a night, which was the lowest rate we could find for our time frame. We were advised by e-mail prior to coming that we would be staying in their apartment, which according to them was 5 minutes walk away. This might be true not accounting for carrying luggage over 4 bridges and fighting hordes of tourists. It's closer to 10-12 minutes walk. But much easier is getting on the #1 vaporetto at the San Marcuola stop, and getting off 2 stops later at Ca' D'Oro. I wish they would have told us this, as we had 48hour (highly reccommended) vaporetto passes, and its a 2 minute trip on the vaporetto, and the apartment is 2 minutes from the vaporetto stop, and no bridges to cross with luggage. Sooo much easier. # 1 comes every 10 minutes. The apartment is easy to find from Ca' D'Oro stop. Basically walk straight forward, cross the street (Strada Nova), quick zigzag, and you're there. Good location, there's a trendy little seafood/pasta restaurant below which was always packed, but that can mean noise late at night and early in the morning. But good food. For those wanting a taste from home, McDonalds around the corner. The room was up one flight of stairs, no elevator. Through a heavy door, (good for security). Bathroom was shared with one other room but very clean and functional. Hot water takes a few minutes though. Room for two is two beds pushed together. No safe in the room though. But the bed was made each morning for us, which we didn't expect given the class of hotel and location of apartment, a pleasant surprise. Small room, no TV (but you're in Venice, who needs TV). Be warned, the mosquitoes at night are like vampires. I woke up with at least 6 bites on my face/neck each morning, so either close the windows or apply bug spray. Breakfast is very simple and cheap, they don't spend much money on it. They serve a white roll each, a 2 pack of bread crackers (available at the supermarket up the street, 40 for ~1.5 euros) a packet of jam and butter, and a jam-filled croissant (again available at the supermarket, box of 6 for ~1.5 euros). However on the bright side, they will happily make you a cappucino or hot chocolate. The setting is pleasant, kind of quaint, and they don't mind if you stroll up at 9:55 (breakfast finishes at 10) they were quite accomodating for us. If you want better breakfast, buy it yourself at the nearby supermarket (across 1 bridge). Overall, if you can get a reasonable rate, and don't mind simple accomodation, its worth a stay. Location great, once you figure it out, vaporettos make getting around Venice very easy.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Athens, Georgia", "Title": "“Better than I thought!”", "Author": "emmaline", "ReviewID": "UR17557502", "Content": "I stayed in the Hotel Ariel Silva for one night in late June. I was pleasantly suprised after reading some not so good reviews. The hotel is down a narrow alley and we did pass it the first time. The hotel staff were friendly and welcoming. The hotel was the cheapest that I could find in Venice at that time of year, but the hotel rooms were clean. We had A/C (which we very much appreciated in the heat!) and an en-suit bathroom. There was no tv in the room and there were no extras, but this didn't bother me at all. The rooms were on the small side, but the beds were fairly large and comfortable. The breakfast was not huge, pre-packaged toast, a white roll and a croissant, but it was just fine. They make a good cappuccino there as well. I would stay again when I'm in Venice. For the price and location it's well worth it.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Adequate, but not great!”", "Author": "ABCanuck", "ReviewID": "UR16947069", "Content": "We stayed for one night and had a nice clean bedroom on the main floor (off the breakfast room), with a shared bathroom. The breakfast was rather minimal, ..... more of those (dreadful!) white rolls with jam and butter. Also tea, coffee or hot chocolate. To find the hotel was a bit of a challenge, as it's down an incredibly narrow street.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Juan", "Title": "“Maybe not!”", "Author": "rcasi", "ReviewID": "UR15457986", "Content": "The hotel is situated in a small street near the San Marcoula stop of the vaporetto. It is no easy to find especially at night. If you have problems finding the place just call the hotel and they can easily direct you. When we first arrive they did not have a room on the first floor like I was promised, but the second day they change me to the first floor.The hotel is pretty basic with breakfast included. The price was average like the hotel itself. There is no TV in the rooms, but that did not bother us too much.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi", "Title": "“Clean and comfy”", "Author": "Raks77", "ReviewID": "UR10618152", "Content": "We stayed at their annex apartment which was about 5 minutes away from the hotel. The apartment was small and cozy with 2 rooms with double beds and another tiny room that had a futon to be used as the 3rd bed but we just kept all our luggage there. The kitchen had all the utencils one might need and cleaning stuff too. There was one bathroom with a shower cubical and a lady came every morning to clean up the place. The air conditioning was a boon and a pleasure to come back to after a day under the unrelenting summer sun. The appartment was close to a vaporetto station so it was quite easy to get to any part of Venice. The guy at the receiption spoke english but the cleaning lady couldn't so we had communicated via hand gestures. My only negative would be that though the breakfast was included in the room charge you had to go back to the hotel for it and since I am not an early riser I always missed out on that.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Great Place to Stay in Venice”", "Author": "Sachin_Mehta", "ReviewID": "UR8115246", "Content": "We would like to thank Hotel Ariel Silva for a wonderful stay, we had in Venice. We were 5 people traveling from India who visited Venice as our 2nd destination; we stayed in Hotel Ariel Silva on 21st June 07 till 23rd June 07. Since we were 5 people staying so they had put us in an apartment as the rooms in the hotel were not very big to fit all 5 of us together, the apartment is about 7 min walk from the hotel. Must say the apartment we stayed in was very very comfortable, great location, very well equipped with all basic requirements. It has a small kitchen where one can cook anything they feel like, they have provided with all basic stuff one would require for cooking. It has 2 big rooms and 1 small store room where one can put your entire luggage & 1 bathroom. Venice is a very small city one can walk the entire city, hence there is no point paying extra to stay close to the main areas as all is about 10-15 min walk away from each of them. The hotel we stayed is very central located; it has a water bus stop just outside, so one can reach any part of Venice from there. It has lots of shops, restaurants & even a big grocery store just close by to the apartment. The only problem we had was to go for breakfast to the Hotel since the breakfast was included in the price but since the hotel was a little far off & in morning one does not really wants to walk all the way just for breakfast, hence that was the only problem we had, we would really recommend the hotel is they could some how arrange the breakfast within the apartment. But at the same time we really enjoyed our stay itâ€™s a great location to stay in; basically we felt at home, so close to everywhere & yet away from the maddening crowd. We would really recommend all our friends visiting Venice to stay in Hotel Ariel Silva.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "manchester", "Title": "“Don't waste your money”", "Author": "travellerYE", "ReviewID": "UR7614417", "Content": "I stayed here for 3 nights with my girlfriend. There was no hot water supply (shower) in our room. When i complained, the manager simply said: \"maybe there are too many people using the shower at the same time\", What? No apology? No compensation? He knew we had a problem but just didn't care to fix it. Besides, other problems such as bad sound-proofing, no air-conditioning (don't be fooled, you don't decide when to switch on the air-con) and dirty wardrobes made this hotel the worst hotel i've ever stayed in for my entire life.", "Date": "May 14, 2007"}], "HotelInfo": {"Name": "Hotel Ariel Silva", "HotelURL": "/ShowUserReviews-g187870-d529162-Reviews-Hotel_Ariel_Silva-Venice_Veneto.html", "Price": "$108 - $201*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle della Masena, Cannaregio 1391/A</span>, <span class=\"locality\"><span property=\"v:postal-code\">30121</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529162", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a1/fe/a1febc95544beb900e0c447cb351a07e1large.jpg"}}