{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mae Sot, Thailand", "Title": "“Quite far out”", "Author": "Hannah J", "ReviewID": "UR126461399", "Content": "This hotel was nice, but it took a good hour to get into the centre of Rome (15 minute walk to the train station, 30 minutes on the train, then onto the metro). The staff were friendly and the breakfast was nice, nothing special though. You have to get there early for breakfast, else they run out - at 8:15am once, they had already run out of croissants and also had no hot water on this occasion so tea/coffee was off the menu too. The only fruit was tinned peaches/pineapple in syrup. The rooms were good, quite large, with a nice bathroom as well. The TV is all in Italian. However, for the price we paid, it was a decent enough hotel, and I was happy with the service they provided.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value for Rome exploration!”", "Author": "Lil_Miss_Mooey", "ReviewID": "UR123006361", "Content": "When in Rome... definitely use the metro! Get in amongst it with the locals as that helps to take away a lot of that \"tourist\" feeling you get when visiting the key destinations in this wonderfully alive city. I fell in love with Rome and would go there again without hesitation! This hotel was a little bit out of the way (public bus to the train station then approx 30 mins on the train into the city itself) but that suited us fine. There is free wifi at this hotel which seems to be very rare across Europe. Small bathrooms (typical for Italy), comfy beds, clean rooms. The breakfast was pretty impressive - probably one of the best I had during my 3 weeks travelling around Europe. Lovely outside dining area which was great for a relax and a few drinks in the evening after it had cooled down. The bar staff weren't that friendly, but the beer was cold! Reception staff were great! Would stay there again for sure.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Good for a car trip”", "Author": "SmilyAngel", "ReviewID": "UR121271124", "Content": "We booked last minute from the hotel website so we got 1 night free (3 nights/paid 2 nights). The hotel was clean, good car parking lots. The staffs were active and nice. Free wifi but you need to ask for the new username and password at the lobby everytime you login (each username uses only once login) The reception will give you 2 hrs+ login period depending on your request.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Naples, Italy", "Title": "“Good Value”", "Author": "KTChris H", "ReviewID": "UR118791372", "Content": "I liked this hotel because my family of 5 could stay there without breaking the bank. The breakfast was good and the location very convienant to the International schools (St. George's, AOSR, and MMI). The service was good and very friendly. The family rooms are big. The double my husband and I had was small, but had everything we needed including well priced snacks.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lyndhurst, United Kingdom", "Title": "“A nice budget hotel on the outskirts of Rome”", "Author": "formaccino", "ReviewID": "UR118569040", "Content": "My wife and I spent three nights at this hotel to explore Rome, after motorbiking through Tuscany. The hotel is in a quieter suburb and tucked away from the main Via Cassia road. The room was comfortable and a good size, and breakfast was included. The secure garage was ideal for leaving the motorbike, as we found the station for the direct train into Rome only 15mins walk away and cost only 1Euro each way! The train journey was about 30mins into the city. It wasn't worth the hassle of riding into the city so we thought this hotel ideally situated.The hotel does not have a restaurant, however they did recommend a good one about 10 mins walk away. The receptionist was very helpful and marked all the main points of interest to visit in the city, which meant we got the most from our visit.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Best Value on our whole car trip around Italy! Stayed Twice!”", "Author": "JeffreyNich", "ReviewID": "UR117200798", "Content": "We a family of four (children 18 and 20) stayed here for three days in Rome, then spent 11 days on the road touring Italy, Switzerland and France. We came back for our last two days. The hotel is extremely well run with excellent reception service, free internet, help with booking and printing museum tickets and plane boarding passes. Free breakfast was one of the best of our whole trip. We paid for two doubles even though one of our rooms each time was a triple. This is a very well constructed hotel, very clean, in a northern suburb of Rome. It takes about 15-20 minutes to drive to downtown Rome - or you an catch the train or bus into town, just be cautious as only bus #302 serves the hotel stop, and the Metro train stops service at 9 pm. We loved this place if you are driving, and would definitely stay here again. On site parking is safe and free.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Eldoret", "Title": "“I loved it and would recommend others”", "Author": "ChiriKirui1", "ReviewID": "UR115740646", "Content": "The hotel is well situated near public transport to town. Very welcoming staff. I enjoyed my stay", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Value for a large family!”", "Author": "Bronxny2", "ReviewID": "UR115016173", "Content": "We are a family of 5 and the family room is a great value. This hotel eliminates the need for two hotel rooms. I strongly recommend it for a large family. Hotel Cassia is relatively close to the airport. This was our third stay and we will be back again!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“had a great stay at this hotel”", "Author": "punsgaur", "ReviewID": "UR110857099", "Content": "We stayed for 5 days at this hotel. it was a pleasure staying here. basic amenities are very good, staff was very pleasant. Breakfast given was fresh, good variety and very tasty. free wifi was there which was great. Our room was clean and the hotel though is away from rome center, its location is beautiful in the countryside and the metro journey to and from the hotel was enjoyable.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "QUEBEC", "Title": "“Very convenient, clean and people very gentle and helpful.”", "Author": "tipet", "ReviewID": "UR110541650", "Content": "This is a nice little hotel very clean and very good breakfast.There is also a free parking. The personnel at the reception are very nice and very helpful. You can buy your train ticket from them, a lot more convenient. The train to go downtown Rome is not far away. It takes about 30-45 minutes.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lidzbark Warminski, Poland", "Title": "“Everything was (almost) perfect”", "Author": "katkul3", "ReviewID": "UR104050282", "Content": "The cleanliness was ok, the staff was very nice, location- a bit far from the city center, but- quite close to the beautiful Bracciano lake:) Only the noise from the street disturbed at night... (but we wanted a room with balcony:))", "Date": "April 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Patras, Greece", "Title": "“liers,for the distance to city center,and for the bed type”", "Author": "HARRIS12", "ReviewID": "UR103525169", "Content": "17 km to Rome city center, not 8 like they describe in the site of the hotel.simple.clean.that's all.all the others are very poor.if you can avoid this hotel,just do it.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Outstanding service”", "Author": "Theo111222", "ReviewID": "UR92842971", "Content": "Thank you Hotel Cassia staff, especially Salvatore. A great hotel, with the support of night staff making sure an early morning departure to transit and the airport went as smooth as possible. No complaints; lots of praise; I'll be sure to stay with you again when next in the area. Theo I apologize for misspelling his name. Please correct \"Salvatore\" as necessary. He's a fantastic member of your staff.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Lovely surprise”", "Author": "Eileen049", "ReviewID": "UR78710487", "Content": "This hotel was close to the train station, main roads but not so close for restaurants. The staff especially reception were very accommodating and did everything to make our stay comfortable. We had to walk a fair distance to the restaurant that the hotel recommends but once you are there the food is really good, don't have the discounted menu, have the a la carte it is still very cheap. However, they don't open until after 7pm. It is very clean and even though it is on the main road, you cannot hear the traffic, the train only takes 20 mins to the heart of Roma.", "Date": "September 7, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Munich", "Title": "“The worst Hotel ever what a nightmare”", "Author": "digisol", "ReviewID": "UR67216120", "Content": "I can´t give a review about the Hotel as I have only managed to see the Lobby.. we booked 8 rooms for 12 and got a confirmation from the hotel. When we arrived there were no rooms available.... The service just sucked badly... and yes I really can´t recommend this Hotel to anyone... certainly I won´t book it anymore. The fun part is though that they automatically asked me for this review.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zuid-Holland", "Title": "“Nice hotel, friendly staff and near the trainstation”", "Author": "MDCrew27", "ReviewID": "UR65349517", "Content": "Hotel Cassia is a very nice hotel. The rooms were clean, the staff is very friendly, and we had nice sleep quality of the beds. The trainstation is near by. It's about 5-10 minutes walk. The best you can do in the city of Rome is to take the first day a card for the trains/metro and bus for 20 euro. You can do everything by bus and metro. We have seen almost every place in Rome by foot, but the last day we did all by metro and bus and that's better!! When you want to eat, you can eat at piazza's (near by pantheon or other nice places) that's big money, because your paying €6,- euro for a Coca Cola and then the food maybe 15 euro's, but if you go by metro or bus to TRASVERTERE (They are the old streets of Rome) there you can eat very nice and it's is a lot cheeper than when you eat at any other place. You pay for 4 courses about 15-18 euro.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "antwerp", "Title": "“Worth the money”", "Author": "MRS74", "ReviewID": "UR62158492", "Content": "We particularly liked the friendliness of the staff. they were very cooperative & informative. The location of the hotel was also very good as the public transport was nearby & easily available.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "USA", "Title": "“Awful!”", "Author": "llisa-carmel3", "ReviewID": "UR39827922", "Content": "We had an awful trip at Hotel Cassia. The hotel is in the WORST location, miles outside of town in a really dodgy area. At night it was downright scary. It took us one bus ride and two metro journeys to get anywhere near the city and tourist sites. Breakfast was appalling - some old bread and gross coffee. The beds were as flat as a pancake and gave me back ache, and the room was unclean, tired and worn. We won't be back!", "Date": "September 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Nice hotel with friendly staff”", "Author": "gem_107", "ReviewID": "UR37468315", "Content": "We stayed in Hotel Cassia for two nights. The hotel was lovely - very comfortable and cosy. The view from the hotel was quite nice. It's situated on the outskirts of Rome, so is very quiet. It is easy enough to get from central Rome to the hotel and vice versa. So if you want to do sightseeing but stay somewhere away from the hustle and bustle of central Rome, I would recommend this hotel. The hotel staff were very welcoming, friendly and helpful. When we first got to our room, the TV was not working. We contacted reception to try and fix the problem. They were unable to figure out the problem at the time, but the TV was fixed the next day while we were out. The hotel breakfasts were good. Directions - From Rome Termini train station, take underground line A and get off at Valle Aurelia. Then take the FR3 train to La Storta. Take a bus from outside La Storta train station to Via Cassia. Get off at the first bus stop after the bus has got on to Via Cassia. Then cross the road and take bus 201 towards the hotel. Get off the bus after 2 stops. When you get off the bus, you have to back-track a little to get to the hotel. The hotel is elevated above some shops, so if you are looking for it at normal ground level you'll go straight past it.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Devon", "Title": "“Great for a short stay”", "Author": "ZippieDevon", "ReviewID": "UR30736166", "Content": "This is a good value for money hotel, but it is not that easy to find. Don't follow your SatNav make sure you follow the directions on the hotel website and you will get there. The breakfast is OK - the usual Italian style. There are a few restaurants nearby and the one recommended by the hotel is good and not too expensive. The best thing about our stay was the friendly and helpfulness of the staff - nothing was too much trouble, they explained exactly how to get into Rome on the train and let us leave our car there even after we had checked out. Getting the train into Rome is easy by train and then Metro and is very inexpensive. If you want a hotel that enables you to park for free and get into Rome easily then this is the one for you.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Studley, Virginia", "Title": "“Good hotel and location”", "Author": "ejs072047", "ReviewID": "UR16447997", "Content": "This is a nice, clean (very important to us), moderately priced hotel. Our rooms were good and the location can't be beat if you don't mind a walk to the train station. We had a rental car, and parked it in the garage under the hotel. Finding the train station was a bit of a challenge. But as you leave the hotel and walk to the left down Cassia, you will see a small school on the left. The road to the right will take you up a small hill to the train parking lot, and what we needed the most, a coin operated laundry. If you want more details, I have written a blog on this trip at: http://edjoseph.blogspot.com/2007/09/day-7-roma-then-on-to-tirennia-pisa.html. There are no ads, just a recollection of our trip. The staff was very friendly, and we would stay there again.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Petaling Jaya, Malaysia", "Title": "“Clean room, good service and reasonable rates in Rome”", "Author": "lemonite", "ReviewID": "UR11590621", "Content": "The hotel was a very good place to end our stay. A little far from the city centre approximately 1hr 15min to Coliseum, but for the hotel price and convenient public transportation can't be fussy. From the La Storta FM3 station you can actually take any bus parked outside. Ask to stop at the first stop at Via Cassia. Then take bus no. 201 heading to the left direction. Look out for the hotel on your right. If you do not have your luggage, take the bus no.35 that stops at the train station and stops at the T-junction in front of the hotel. Whatever bus you decide to take, please ask the bus driver for help. They have been very helpful throughout our journey to and fro to city and hotel. Last bus is at 11.15pm. We LOVE our room! The housekeeper cleans it every day. We stayed in other hotels in Italy that only cleans every 3 days (don’t understand why?!). Every day the shower caps, ample towel rolls are replenished in our room. Every room has a mini fridge. At first impression the hotel came across as noisy because it is on the main road. Surprisingly, it was quiet. The hotel shared the same land with an apartment, so we heard budgies singing every morning. This was a joy and we felt at home as we had our own budgies back home. There's a grocery shop and a fruit stall very nearby to pick up some food. Staff were friendly and competent. Especially Claudio who took the extra mile to help us with directions. He took out maps and knew when and which trains, subway and busses to take. Mafalda was friendly and we were blessed as during the conversation she informed us that the airport and train workers will be on strike the day we suppose to go to the airport. We woke up very early and made it to the airport before 9am. Thank you to Claudio and Mafalda for your help. The only complaint we had is the breakfast. Cold, not much variety and very sweet pastries. Need to look into improving this. We will definitely be heading back to Cassia Hotel as a transit stop to Europe.", "Date": "December 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Friendly & Clean”", "Author": "cgaeg", "ReviewID": "UR8112638", "Content": "We just got back from Italy and spent 3 nights in Hotel Cassia.. it was myself, husband and two children ages 12 & 16... our hotel room was clean and nice...the shower stall was a little small but clean thats most important....The lobby has internet access for a fee or they give you a modem to use in your room for fee also..they had a good breakfast.. the staff was very friendly... we had a rent a car so there was free parking also we took the train into the center to see all the sights.. the train ride took about 1/2 hour... it was easy getting around...if i had to stay in rome again i would definately stay there again", "Date": "July 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice hotel”", "Author": "zorcan", "ReviewID": "UR7724087", "Content": "Nice hotel in the country. It is about a half hour from the Rome Termini Train Station. It is a nice clean hotel with a friendly staff and a good breakfast. There are restaurants and bars in the neighborhood. With luggage take the 201 bus or a taxi to the hotel. If you are travelling you can just walk up the hill. It was a very nice and reasonably priced hotel. You can check with the hotel staff there is a nice beach a 5 minute walk from one of the close by train stations.", "Date": "May 31, 2007"}], "HotelInfo": {"Name": "Hotel Cassia", "HotelURL": "/ShowUserReviews-g187791-d529193-Reviews-Hotel_Cassia-Rome_Lazio.html", "Price": "$51 - $109*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Cassia 1736 (La Storta)</span>, <span class=\"locality\"><span property=\"v:postal-code\">123</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529193", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d0/36/d036a6a502eaabbd49f26d23d951af5d1large.jpg"}}