{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Nice, Clean & Friendly”", "Author": "wilhelmfink", "ReviewID": "UR126617209", "Content": "We where greeted at reception by Roberto and his attitude3 was warm and inviting. This was a perfect spot close to Roma Termini Main Station. It is also an easy walk to the Spanish steps and all the other sites in Rome The internet & WiFi was easily available at all times. The breakfast was also well stocked with lots to choose from. I recommend this hotel!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Great stay for a tight budget!”", "Author": "Izzybird", "ReviewID": "UR126250089", "Content": "We stayed here for 6 nights. We found the staff to be very helpful and friendly. The hotel is close to the Termini and Republica station. All of our needs were met here including a professional quality hair dryer in the room, reception making calls and printing tickets for us, breakfast provided daily, access to a computer with internet at no charge, refrigerator in the room and recommending a fantastic little restaurant just around the corner. Of course it is not The Four Seasons of the Hyatt..but you aren't paying for that either. It was everything we needed and more!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brno, Czech Republic", "Title": "“XX settembre rome”", "Author": "manos785n", "ReviewID": "UR125825668", "Content": "very good value for money.small but nice rooms!staff was friendly and the location good,only 10min walking from the town center", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Quito, Ecuador", "Title": "“Very good location!”", "Author": "Juanepro", "ReviewID": "UR125206352", "Content": "The hotel is cozy and comfortable. Breakfast is fine. The location is VERY convenient since is very close to city's train terminal. Staff is very willing to provide directions and is extremely helpful.", "Date": "February 25, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“NOT AS IT SEEMS”", "Author": "Laoise290288", "ReviewID": "UR124850092", "Content": "Hotel Settembre xx states that the rooms are in soothing shades of beige etc. It does not mention the dirty black carpets in the corridors or the damp patches in room 104. Also there was no mention of the bars accross the (frosted glass) window. I thought I was in jail... If that wasn't bad enough, my husband & daughter saw three rats right outside the hotel on the evening of 16th Feb. Not sure if they were guests !!! Breakfast was another story. Only lemon tea available, & it was a case of first up best dressed as regards what was available to eat. I would describe as adequate at best.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great Hotel - with a few minor issues”", "Author": "LeChatGris11", "ReviewID": "UR121168994", "Content": "STAFF - very friendly and professional, very helpful and always ready to assist with any queries or touristy things. Plus you get a referral to a wonderful restaurant around the corner. ROOMS - some are recently refurbished. The carpet could use a good vacuum or a replacement. We had a room which wasn't up to scratch at all (smelled quite bad) and the Manager very kindly upgraded us. Also, watch that you don't get the smoking room. This was near us and it actually made the whole corridor smell when the cleaning staff were in it. Can't for the life of me understand why people continue to smoke ... MANAGER - He is what makes this hotel tick over so well - a true people person and great hotel management skills. Only having taken over on 1st September, you can see that this hotel means a lot to him and his staff and they try very hard to make your stay as comfortable as possible. PLUMBING - Oh dear ... well, the bidet and the sink hot water works very well and quickly, while the shower can take up to 15 minutes to warm up. This probably wasn't a problem in the summer, but in November it can be a bit depressing standing there waiting for a hot shower. I am sure it's not the fault of the Management or staff, but one thing that should be looked at very quickly. Also, the shower curtains aren't adequate in the room to keep water off the floors when showering. Adding a second shower curtain will fix this very dangerous problem and also it will be a quick, cheap fix. BREAKFAST - This was improving every day. It is as though they were experimenting each day with a little more food and seeing what worked. It is a standard European breakfast and quite filling. A few issues ... The coffee is horrendous. The coffee machine sometimes wasn't hot enough for our early morning departures so the cook made us some from the kitchen - much much better tasting. Get rid of that awful coffee machine or turn to simple dripolated coffee. Also the hotel served stale bread on Sunday morning breakfast. Perhaps there was a baker's strike that day? Not appetising at all really. OVERALL IMPRESSION: This hotel is excellent for a central place to do all the touristy things in Rome. I think Roberto Necci (new Manager) is dedicated and aims to please. He is fixing the hotel and bringing it up to speed as much as he can within I imagine budget allowances and time permitting. I'd go back because we were well treated, well fed and well housed. That's all you want when you go on holidays, isn't it?", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“many good points but some organisation problem”", "Author": "Helpyouchoose", "ReviewID": "UR120699221", "Content": "Because i looked at the reviews before booking, i wanted to have a room with windows and in the main building. So i called to check, and booked, and emailed my request and then recalled to make sure that my request can be fullfiled. So the 2 times they answered that everything is ok with them and they have what i needed. When we arrived there, no rooms available in the main building, and i got the room 306 in the one in front. So the room was ok, its just that i thought the reception just blamed me to expect something impossible, when i had been very clear with them in my mails and phonecalls 2 weeks before. I would be happy with just some form of apologizing from them, as they made a mistake. Other that that, the room is small but clean, the cleaning lady was very kind, the location is perfect, the breakfast is good, and the wifi works really well. It was actually nice to go in the room with our own keys and not having to pass by reception everytime, but the elevator is just so small, dont count on it.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Szeged, Hungary", "Title": "“Being in Hotel XX Settembre is always fabolous”", "Author": "peter s", "ReviewID": "UR120205081", "Content": "This 3 November ,me and my parents stayed in room 204.This was not the first time staying there,but the first since the director,Mr Roberto Necci become the principal.We were overjoyed to meet him as well.He was pretty helpful and real excellent host offering us some coffee and so on after check-in.The rooms are well equipped,The location is perfect near a small market. Me and my clients,staff wish him so much success.Mr Peter Sz.", "Date": "November 5, 2011"}, {"Ratings": {"Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Quaint, cool little place, centrally located”", "Author": "MCMLCCCII", "ReviewID": "UR119842866", "Content": "Simple but very nice room. Great location. Friendly helpful staff with great personality. Plenty of good food and espresso very near by.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“You'll end up in the street if you book the Settembre hotel”", "Author": "Norman R", "ReviewID": "UR119744115", "Content": "We booked into this hotel in June for a stay at the start of October. Upon arrival the front door was locked and there was no answer when we phoned the hotel. We spent $100 on overseas calls to Expedia and eventually they confirmed the hotel had double booked our room. We spent more than two hours sitting on our suitcases in the street. Expedia then booked us into the dirtiest hotel in Rome. We had to find an alternative and ended up spending $750 extra for our six night stay in Rome. No explanation or apology or anything from the Settembre management. do not book this hotel unless you appreciate being left in the street and the distress of having no accommodation in a country where you do not speak the language.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great Staff and Great Location!!!”", "Author": "uri777", "ReviewID": "UR119604256", "Content": "We have just returned from 5 nights at this hotel and all we have to say is that we can highly recommend it! To anyone who is looking for a relatively cheap hotel and good location then this hotel is for him. There are three metro stations close to the hotel within a maximum 10-minute walk from the hotel. You may also want to walk downtown from the hotel (half-hour walk..) and come back with the metro - you will feel the city better. The Staff really kindly and great, and the breakfast provides - coffee, bread, eggs, Salami, Cereals and more.. Also the owner of this hotel is doing a great job! Enjoy Rome!!", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A good hotel, however, it needs to clearly distinguish between it's standard and economy products”", "Author": "SageySi", "ReviewID": "UR119497102", "Content": "The Hotel is overall a good hotel, providing a comfortable stay in an excellent location at a reasonable price. The staff are pleasant and friendly, with one in particular on reception (late afternoon to mid evening) providing excellent customer service. Breakfast is adequate, what you would expect from a 3 star Italian hotel. However, the hotel does suffer from some significant organisational issues and does in fact provide two different products - economy and standard. This has been blurred by the hotel slightly and on arrival late in the evening, we were placed in an economy room (no windows and small) despite booking standard. We were told it was the only room that they had available for that night. Whilst we would have been happy with the economy room, had we booked it, it was a disappointing start to our stay at the hotel and I felt that the owner didn't fully appreciate why it was an unacceptable thing to do, putting customers who had paid for standard rooms into an economy one. The standard room was very pleasant, clean, light and spacious. We would stay again.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic location”", "Author": "monsters80", "ReviewID": "UR118822063", "Content": "Good service and fantastic location in the city centre.the room was good and also breakfast. Nice staff. The only problem was the public transport from Fiumicino apt to the city centre to expensive for the poor service. Rome is a fantastic city bit with some problema: traffic,public transport. XX settembre is an ideal location to visir the city", "Date": "October 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "havinganicetime", "Title": "“Clean, quiet, cool...”", "Author": "havinganicetime", "ReviewID": "UR116344787", "Content": "I am traveling round Europe with two kids and we are all very happy with this hotel. I was almost put off by some of the reviews, so can assure you that the staff are nice, breakfast is a major attraction for the kids - music videos( very quiet!) , our room is cool and really quiet considering the location with a fridge, cupboard, desk and safe. Cleaners do a great job and the bathroom is fine. Beds firm, but they tend to be in Italy and France. In main hotel on second floor and here for ten days.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Horrible experience”", "Author": "irtazakhan", "ReviewID": "UR116005701", "Content": "Worst hotel experience ever. Spoiled my vacations in Rome. Upon arrival, I was shown to a room that was smaller than the bathroom at home. The AC was not working and upon bringing it up to the front desk's attention, I was told that they were aware of the AC in that room not working for a couple of days and that I will have to \"put up with it for the night and they will see what could be done in the morning\". Mind you this was Rome in July. When I refused to do so, they got upset and told me \"this is creating a big problem for us\" and also that they did not have any other rooms available. Upon insisting that I should get what I paid for, they got me another room, claiming that it was an upgrade to a double room. Well, the room was in the basement with no windows, after a double bed there was no place for anthing else, and smelled of sewage. The shower stall had mould growing. The sewage smell was so bad that it made me nautious every time I entered the room. The TV was not working. Upon pointing these things out repeatedly, I was told that they will \"look into it\" and also that I had to \"connect the TV in the back\" and that I \"did not know how to turn the TV on\". Incidently since the room is in the basement with no windows / fire escape, I don't know how the building inspectors okayed it to be used as a rental property. I was so miserable that despite having paid for the hotel in advance, I looked up other hotels in Rome but could not find one as it was peak tourist season. I heard multiple people complain about their rooms at the front desk though don't know if their problems were addressed but do know that one gentleman asked to speak with the manager and was connected via telephone, with the manager insisting that he was not in the hotel at that time and could not help him till the next morning. It was a lie as I could hear the manager speak from the room right next to mine. I have travelled quite extensively around the world and have never had such a horrible experience in my life. I would not recommend this hotel to anyone. If your money is so worthless, throw it in the river instead of spending it on this hotel.", "Date": "July 30, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sofia", "Title": "“TERRIBLE!”", "Author": "vesijazz", "ReviewID": "UR106070859", "Content": "The room 109 was awful. Actually it's like a basement - without windows. The smell, coming from the carpet, covering the stairs (in the room) was disguisting! The place is narrow, dark and oppressive. We'll never visit it again. The only good thing was the location of the hotel. It' s perfect. We were shocked to try the coffee from the machine at the breakfast. I was many times in Italy and I've never, never drunk bad coffee wherever. I'm keen italian coffee lover. We desided that they economized the coffee, because it's leaking mainly water instead of coffee. On the next day we asked the waiter to give us another coffee, because we saw that some italians did it. We were given. But on the next day we're refused - the waiter pointed to the machine. What was our surprise when an italian guy, who came ater us, was given a coffee by the waiter. This was absolutely unacceptable, but I was disgusted so much, that decided to do...nothing. I just despised the waiter. I'll never recommend this hotel to a friend or to whoever.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Bed bugs”", "Author": "lleta", "ReviewID": "UR87706166", "Content": "This was my first time traveling to Europe. The hotel in Paris was nice and the hostel in florence was reasonable. But this hotel was disgusting. It smelled, the carpet was fithly, the bath tube over flood and there was no hot water. To add insult to injury I woke up with a rash on my neck it didn't ocurr to me at the time it was bed bugs because i was expecting little bits instead of a massive area. Than i discaover little bits on my hands and legs. My trip was awesome but this was so gross I was too tired form tours to complain about the room and didn't realize that i was aattacked by bed baugs until i got off the plane home. Word to the wise check your bedding before before you sleep on it.", "Date": "November 20, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“all good”", "Author": "allthewaylive", "ReviewID": "UR77450125", "Content": "its a charming little hotel in the centre of rome, run professionally by friendly staff. its good value, with a nice breakfast. its got everything i wanted for a two day stay. i recommend. ps. its punching above its weight for a three star hotel, ive stayed in worse 4 star hotels", "Date": "August 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Dreadful!”", "Author": "Mairig", "ReviewID": "UR70117594", "Content": "The room was dark and the curtains had to stay shut as it was overlooked by apartments and a roof top. The carpet was so badly stained that I wore shoes at all times. The shower/bathroom had never been designed for two people and their toiletries, they had to be kept in the room as there was no shelf space. They had a problem with their TV system when we were there and it didn't work. The airconditioning worked well. The amenities, so called, were a couple of vending machines in the lobby/foyer. One selling soft drinks the other crisps etc. There was a fridge in the room. That was it. Very basic. I have stayed in budget city centre hotels in London, Paris and Toronto and this was by far the worst experience.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Royal Tunbridge Wells, United Kingdom", "Title": "“great for a short break”", "Author": "dcw2467", "ReviewID": "UR63102217", "Content": "My Wife and i had managed to get away for 3 days without the children, so were looking forward to a nice break!! Location is great as the hotel is only 15 minites walk from the train terminal and the metro, but although we thought we had the write address, we did struggle to find it due to it being tucked away in a back street and the only way you knew it was a hotel was the tiny sign above the front door.Once inside we were given a room on the 2nd floor which although was small was clean with a good sized bed. we had heard previous reports of no hot water, but if you leave the shower on for about 5 minutes it does get hot. The room had two windows and a balcony door, but unfortunately there are no far reaching views but just blocks of flats surrounding the hotel, but ha ho we were not there for the views.The best thing was at night time the room was very quiet with no noise from outside or adjioning rooms althought the hotel was full.Continental breakfast was great with loads to eat and great fun with the friendly chef having the odd arguement with his staff over the shortage of meat.Finally the reception was excellant providing accurate information on train times, bus routes and any other information.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Leeds", "Title": "“Absolutely disgusting!”", "Author": "j_sedwards", "ReviewID": "UR63071143", "Content": "Upon arrival we actually thought we'd found the wrong hotel as the website does not display any photos of the tacky hotel exterior. Once we had checked in we were taken across the road to what looked like a block of flats where our room was located. Upon arrival at the room (which was in the middle of a block of flats) we were horrified to find a tiny room with a bathroom that looked like it hadn't been cleaned since it was put in. There was a light hanging from the ceiling, dirty spa bath with hair bursting out of the jets and thick mold to the corners of the bath. As the room was located in a residential block of flats the noise was unbearable, renovation was going on above our room and we had hammering and drilling until late evening. We thought we would give breakfast a go as the hotel did look slightly nicer at the other side of the road, this too was a mistake; selection of old salami and stale bread. All in all the hotel ruined our trip to Rome and we would not advise that you go anywhere near this hotel!!", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "lazio", "Title": "“UNIQUE EXPERIENCE”", "Author": "simoncinoLazio", "ReviewID": "UR54562086", "Content": "i really enjoyed my stay in this hotel,it was suggested by a friend of mine who always stays over it for a bussiness trip so i decided to spend a romantic w-end in rome and the service was amazing,room extremely clean,and finally the location of the hotel is in a strategic point of the city,let's say in the heart of rome actually.i'll defenetely will come back if one day i decide to visit rome again,at this price you cant find anything better!", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Frankfurt", "Title": "“Charming location and professional staff”", "Author": "moonlighter77", "ReviewID": "UR54269691", "Content": "The staff could not have been more helpful and accommodating to us during our staying. The hotel is located in the down town and very close to public transportation hubs. We had a great time and are very pleased with the service we received. Thank you so much.", "Date": "January 24, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "4", "Location": "5"}, "AuthorLocation": "Sheffield", "Title": "“Good experience”", "Author": "Daytona955i_Shef", "ReviewID": "UR54107123", "Content": "My girlfriend and I wanted to treat ourselves with a romantic holiday in Rome, just after Christmas, so we chose the Hotel XX Settembre as suggested by our travel agency. Well, what can I say? The room was very nice and cosy, and the hotel conveniently placed in the heart of Rome. We found the staff being very kind and helpful during our stay, they gave us a lot of clues about places to visit and restaurants to have dinner at . Overall a very good eexperience, which I would definitely recommed to anyone. This hotel is really good value for money!", "Date": "January 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "exxes", "Title": "“What happened to the bar!!”", "Author": "keithgreenhalf", "ReviewID": "UR50755774", "Content": "The hotel clearly states that it has an intimate bar. After a long journey we asked the receptionist where it was only to be told there wasn't one. The hotel was generally Ok though, but it's not top of my list.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "egypt", "Title": "“Really nice Hotel.....”", "Author": "mohammedjr", "ReviewID": "UR39562051", "Content": "A great hotel. The location of the hotel is great too; 10 minutes from Termini station, 5 minutes from Repubblica Station and 15 minutes to Spanish Steps and Trevi Fountain. Stayed 4 nights in Hotel XX Settembre. Small comfortable rooms. The important for me it's clean and it was clean. Every day clean towels and soaps. We were located in oune of the New rooms (apartments) in front of the hotel. The airconditioning worked very well and it was very modern and relaxing Very nice breakfast and staff was friendly and nice too. I would stay here again and recommend it to all friends and family traveling to Rome.", "Date": "September 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Berkshire", "Title": "“Avoid like the plague”", "Author": "modelstore", "ReviewID": "UR37156636", "Content": "Portrayed like a wonderful boutique hotel........firstly we were not in the main hotel as booked, a few rooms over the road. Top floor and the lift was the size of a suitcase! Air Con failed so the room was sweltering. OK city centre, small room .......next morning no hot water, request a change which we got to the main hotel. Room in the attic OK but poor air con........great in the lobby!!! Breakfast room too small, Sunday breakfast queing for a seat and ran out of bread.......says it all ........and at 160 Euro's a night its a rip off.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "sfo", "Title": "“horrible! never again”", "Author": "bobsharma1", "ReviewID": "UR29527804", "Content": "We stayed there for 2 nights and both the days no hot water. They gave us keys to go to another nearby hotel to take shower and use that hotel's bathroom. We had booked this hotel through expedia paying $156+/night and when complaint to expedia about the service we received, the hotel supervisor denied that this even happened and said they always have hot water. No records to say that we had to go to another hotel etc etc. Staff was very rude, unfriendly. certainly not worth $156/night and qualifies for something less than a $50/night hotel. Would not recommend it to anyone that we know. Did not realise that we wud be doing hotel hopping during our vacation and hotel staff would not even have coutersy to apologise.", "Date": "May 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Brussels", "Title": "“Not worth the money”", "Author": "DragonClaw", "ReviewID": "UR28674363", "Content": "Okay... where to start? The hotel is down a alley type street off a very busy street. Don't let the other comments about graffitti and other descriptions of the hotel being in a bad part of Rome throw you because the whole city is pretty much covered in graffitti. I don't think I saw one building there in the five days I was there that wasn't marred with ink or paint. Getting back to the hotel itself, Its clean but so was the Formula One and ETAP I stayed in Calais and Heidelberg. To say that the rooms at the XX Septembre are small is putting it very mildly. In fact the rooms in the other two motels above were larger albeit you had communal toilets/showers in the Formula One. We had rooms 306 and 307 across from the main lobby itself. Windows open to the alley and it has A/C but couldn't figure it out until the last night. Staff is very friendly and helpful, speaks decent English. Lots of places to eat but the location is away from most of the attractions in Rome. Breakfast wasn't too good... in fact ETAP had a better one. Small area for breakfast and you need to get there early for a table. Other websites claimed that XX Semptembre has room service but the rooms have no literature or menus. There are many other hotels closer to the tourist areas. Its only about .65 miles from the Hard Rock Cafe. One cool suprise was the open market that is on the back street everyday. As for taxi fare to and from the Fiumicino - Leonardo Di Vinci Airport... I paid 40 euros to the hotel and tip the cabby another 5 euros. When you come out from the baggage claim area, there is a sign that plainly says to take the white authorized cabs only. We were approached buy some gangster looking dude that offered to take us directly to the hotel in a large van. The catch is he makes you wait until he found two others to go into Rome. But that was for 15 Euros/person. Would have cost us 60 Euros vice 45 Euros I paid the taxi. That was on a Sunday afternoon... no traffic. Going back to the airport we had the front desk call a white cab and even through the Thursday afternoon traffic (pretty heavy), It cost 56.60 Euros and I gave the driver 60. I think you can find a better 3 Star hotel then this. Well XX Septembre should be a 2 star.", "Date": "April 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Not good”", "Author": "Ayor", "ReviewID": "UR23546236", "Content": "Hotel is nice located, but.. The price 160euro is not for this hotel because it's tiny, small, in the rooms there are no bathrooms, only very small shower, no internet, no nice view. The breakfast room is very small too for all people who want just have their breakfast and they need to wait in the hall. Not recomended", "Date": "January 14, 2009"}, {"Ratings": {"Service": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Beware!”", "Author": "Delfinia", "ReviewID": "UR23154830", "Content": "Room 108 has no window as it is in the basement. It has two air vents which cannot be closed, creating a major draft. Room 109 is up a narrow staircase with a dirty, musty smelling carpet . It was sold as a twin but had only a single wardrobe, no drawers and just one shelf. We had to live out of our suitcases. The bathroom was tiny with no ventilation and nowhere to put toiletries. We were moved on our last night to better rooms of the type expected for a three star rating.", "Date": "January 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“nice hotel”", "Author": "Europe08Australia", "ReviewID": "UR22123066", "Content": "hotel was very nice, when the taxi drove down the alley way we thought what have we got ourselves into? but once inside completly different very well furnished. the reception staff were very helpful and spoke good english. room was nice & big not much of a view as the windows had bars on them. breakfast wasnt that nice, but they have internet which was good. would recommend to family and friends. walking distance to city centre.", "Date": "November 23, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Must do better!”", "Author": "hannah's grandma", "ReviewID": "UR15494939", "Content": "Booked because AirMiles recommended it. Checked TripAdvisor and noted the problem with rooms in annexe and would you believe it ...I got room 402 - up 4 flights in a tiny lift 2ft x 3'6 (I kid you not!). Main apartment door opens into 4 flats. Room itself clean but curtain hanging off and window that wouldn't open - but the noise! Whenever we or those in 401 turned on the tap, flushed the toilet or heaven forbid had a shower the \"jack-hammer\" noise reverberated for ages after. Combine flushing the loo then washing your hands - unbelieveable! Tried to get a room change but was told there was nothing wrong with the plumbing and there was NO noise. Note the wardrobe doors rattle and the floor shakes when a bus goes by - hint.....leave the wardrobe doors open and you might get some sleep. The shower was also hanging off the wall and the shower curtain and grouting mouldy! There was no breakfast left at 9am the first day and the 2nd day it was busy so no spaces for 20 mins. They offered a taxi to the airport for e50 which i accepted but despite having been told where to go and telling him twice that he was going the wrong way we ended up at the wrong airport!!!! Fortunately we had time to double back and made our flight with 30mins to spare but it could have been a disaster. I gave him e50 and walked off - i wasn't paying any more for his mistake!!! Overall the location is good but its not worth the money (or the airmiles) to be kept awake all night.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Carlingford, Ireland", "Title": "“Good for the price”", "Author": "twinkletwinklelittle", "ReviewID": "UR11068270", "Content": "Hotel was fine, apart from the loud water pump as warned by GloucestershirePip below as we too had room 401, the room itself was fine as was the bathroom. Just the water pump comes on everytime someone on that floor runs the tap and it is very annoying, otherwise fine.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast, Australia", "Title": "“Would Definitely Go Back”", "Author": "weza", "ReviewID": "UR10603151", "Content": "We spent 6 nights at the XX Settembre and it was wonderful! Our room was across the street from the main reception area in an old apartment building that they're apparently trying to buy up and convert into hotel rooms. The room and bathroom were both of good size, though the shower was a bit tight, large people would probably be uncomfortable. There was an elevator in the building. The bed was comfortable. Close walk to EVERYTHING, including train station. We walked to everything we wanted to see, except the Vatican. Breakfast in the morning is pretty decent. Internet is expensive, but there are TONS of internet points right around the corner. Would definitely stay here again.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northallerton", "Title": "“weekend break”", "Author": "Kenjamin", "ReviewID": "UR8827664", "Content": "We recently stayed at this hotel, based on the reviews we saw here. We got exactly what we expected; the staff were friendly, the hotel was very clean and the air conditioning in the room was great, seen as it was August! Had no problems at all, 24 hour check in was good as we arrived at about half nine at night. It's near the main train station and a few metro stops too, very handy for everywhere. The restaurants nearby are nice, and the safe deposit box in the room was very useful. All in all, we had a great time!", "Date": "September 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Room 110”", "Author": "lazybeachdays", "ReviewID": "UR8677230", "Content": "We were recently booked in to Settembre for 2 nights but checked out after the first one. We were put in room 110 in the new section and it was terrible! It was a loft style apartment, which, while new, & for what we paid, was small/pokey/horrible! The person that checked us in was extremely helpful but the next person we saw at the front desk wasn't. I'm sure there are nice rooms there and it is a great location - just ask to not be put in 110!", "Date": "September 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good hotel - a little pricy...?”", "Author": "luv2travelUk", "ReviewID": "UR8024903", "Content": "My wife and I have just returned from Rome - we stayed at the XX Septembre. The hotel was clean, the staff friendly and helpful. The room was a little small, but clean and comfortable. Given how hot it was, we were relieved that the room had a remote control air-con unit which could be left on 24hrs if needed. The bathroom and shower were also clean. The shower base did have a leak, but that was probably a one-off. We would recommend this hotel for the above and its central location. There are also 4 or 5 really nice, reasonably priced restaurants within five mins walk from it.", "Date": "June 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lancashire, england", "Title": "“Clean, Convenient”", "Author": "jwelsh", "ReviewID": "UR5502472", "Content": "The hotel was in an uninspiring little street in a non-picturesque patch of Rome, but it was only five minutes walk from Termini, and even less from Republica metro station. It was very clean, the desk staff were courteous (they happily allowed me to check in early), and the breakfasts were OK. Definitely worth considering if you get a good room rate.", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Greewich, CT", "Title": "“Caution: Hotel limo service”", "Author": "leobingo", "ReviewID": "UR5446742", "Content": "I just returned from stayiing at this hotel. The basic services were satisfactory, though nothing special. The hotel offers a \"limo service\" to the airport, as advertised at the front desk: 47 euro, no extra charge for luggage. Firstly, the hotel simply calls an ordinary Rome cab. Well, that is OK. But, secondly, the charge will be 65 euro or greater - not 47. In spite of any agreements made at the hotel, and confirmed by the hotel clerk, the taxi driver will hold you hostage at the airport. The taxi drivers will claim complete ignorance of any other language than Italian when they get to the airport, but I find that they understand one word very well: Carabinieri. Use it if this happens to you. I am filing an official protest with Rome officials. If this hotel cannot ensure this service to their guests, then they should not offer it.", "Date": "July 10, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Ashburn, VA", "Title": "“Whole heartily recommended”", "Author": "A TripAdvisor Member", "ReviewID": "UR5236553", "Content": "We booked our room reluctantly at XX Settembre in Rome, Italy, not knowing what to expect. To our surpise the, the hotel was very clean, it has either been renovated recently, or is brand new, the interior is pristine. The rooms are sparklingly clean and well stocked with all the amenities (nice linens, mini bar, wi-fi internet access). The hotel does not face a main road, but is facing an inner road, hardly ten meters from the main road. The location is quite central, its about a 5-10 minute walk from the main Termini station which connects you to all the sights in rome. There are plenty of good sit down restaurants, take away pizza shops and cafes within a few minutes from it. Continental breakfast was included in our room charges. Something to be aware of, when we checked in, we were intialilly given a small room with very low ceilings (no more than 6 feet tall!!), but after I talked to the manager at the reception they were extremely accomodating and promptly gave us a much better room with 10 feet ceilings. Something to keep in mind when you are checking in. Overall, I would recommend this hotel without any reservations.", "Date": "May 30, 2006"}], "HotelInfo": {"Name": "XX Settembre", "HotelURL": "/ShowUserReviews-g187791-d529333-Reviews-XX_Settembre-Rome_Lazio.html", "Price": "$61 - $241*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via del Macao 6</span>, <span class=\"locality\"><span property=\"v:postal-code\">185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529333", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/20/fb/bb/xx-settembre.jpg"}}