{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Excellent Hotel well located, perfect Value for Money”", "Author": "gens1980", "ReviewID": "UR119596370", "Content": "The hotel's staff was friendly and available very late in the evening when I checked in. The room was clean, warm and silent. Overall the hotel looked very good, with a decent breakfast. Last, it is next to Charlottenburg's S-Bahn station, which is very handy when you want to travel within Berlin. I have tried several hotels in this area and this was by far the best one if you want to travel cheap.", "Date": "October 22, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "St.Petersburg", "Title": "“You can sleep in Berlin...”", "Author": "Travel_Viewer_SPb", "ReviewID": "UR117447420", "Content": "The hotel is not luxury of course but the price is reasonable. It is near S-bahn and U-bahn so it is ease to go to the city center from here. There are many cafes not far from the hotel and you will not have a problem to find the place to eat in the evenong. The furniture in the rooms are not new and the rooms a not absolutely ideal. But it is enough for sleeping. Some rooms don't have own bathroom which is shared for several rooms. The hotel gives a free ticket for carparkfor deposite (aprox.50 euros). The breakfast is good and tasty. The hotel is good for budget sleep but not for those who are looking for the excellent level hotel.", "Date": "August 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“The most horrible place I ever stayed at-never ever will stay here again”", "Author": "Izenga", "ReviewID": "UR66910524", "Content": "To make it simple: 1)The room I got was dirty on arrival. They changed the beddings, but I found hair in the towels and in the bathroom and lots of dust under the bed. 2)They don't change the linen, if you stat shorter than one week and will change it once if you stay there 7 days. It's not mentioned anywhere on the web-page, but I think their guests should be informed. If I knew that I would never stay there. 3) The personal is very inpolite and not professional. It seems like they just take some random people from the street to clean the rooms. The woman that was cleaning my room was even shouting at me, when I asked her to change the linen. 4) They just never did things properly, had a very low standards and low quality survives for the price they ask. Wifi Internet was not working for 1,5 days. The only thing that was relatevely ok was breakfast. The location is in the area of red lights, meaning you will be surrounded by the pubs and bars and prostitutes. There is no elevator in the hotel. I will not stay here again and I hope that you can avoid it, too.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Munich", "Title": "“way too bad...”", "Author": "dpelland", "ReviewID": "UR47713754", "Content": "I was here for two nights with my girlfriend who is pregnant... 1) We arrived and the lady at the reception was very unfriendly, not even a smile, bad english spoken 2) We got the room and it stinked of smoke, too much for a pregnant woman and even for me 3) They forgot to get is the towels, soap... nothing was in the restroom 4) Feeling of a non hygenic place 5) Lots and lots of noice from the street The next day we went to the reception asking to be moved to another room (due to the smoke) andthey told us that the problem was that we didnot tell that my girlfeidn was pregnant... they could offer us another room, we checked that and same issue... smoke! In the end I dont even think they have non smoking room... even if they claimed they had... they wanted us to wait to check another room am 12.00 but we had no time to lose and we asked to get the money back for the 2nd night as wanted to move and they retained 80% of taxes... We payed 65€ per night and close to it we found a 3 star hotel for 69€ which was a super hotel! Never again to this hotel! Stay away from it... you'll find many which are much better!", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Essex", "Title": "“A lovely hotel - basic but fine!”", "Author": "Caroline2009Essex", "ReviewID": "UR44397968", "Content": "We have just returned from Berlin and the hotel after a fab marathon weekend. The hotel is very basic i.e. no tea/coffee in rooms and no lounge which would be nice, however, it suited our needs and was very clean. The staff are lovely and were very helpful - don't speak any English though. Overall the location was great and lovely restaurant/bars nearby. Our two year old daughter had a lovely time and we recommend a family size room. Enjoy your stay!", "Date": "September 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Athens, Greece", "Title": "“Avoid if you can...”", "Author": "sdam", "ReviewID": "UR38764514", "Content": "The location is close to a train station but in Berlin almost every hotel is... There are a LOT of prostitutes and bordels around but i didnt care.... I chose that hotel because of the wireless internet access inside the rooms as it was clearly stated in every official description... Well, finally the WIFI worked only at the hall and the breakfast room! ...Also my TV wasnt working at all but i really didnt care about it also ... Internet was the reason i came here because i need it for my work ...The made me pay my 4-days stay at the first moment ...I clearly asked if wireless internet works in the rooms before i paid... The girl on the reception said: YES..YES....Well, when later i complaint nobody seemed to speak english ...Only Russian... And they didnt want to help at all... Very bad impression and i really regret that i trusted some unprofessional owners...", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sweden", "Title": "“Good value for the money”", "Author": "enzian58", "ReviewID": "UR29393961", "Content": "No luxury but good situated. Close to S-Bahn and good shopping streets. A few min away there are several good restaurants. At the same house there ar two stripclubs, but they don´t disturb that much.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Good location, poor rooms”", "Author": "Iris46", "ReviewID": "UR15459805", "Content": "This was one of the few available hotels that had rooms at the time of my travel as it was a last minute trip so I booked it with no great expectations. I was just glad I found a room. The rate I paid was 55€ per night for a single room and unfortunately that didn't include a WC in the room. My plane arrived in Berlin in the early hours of Sunday morning and I managed to arrive at Stuttgarter Eck at about 3am. I felt a bit awkward when I arrived as the pension was directly above a cabaret style bar with neon lights and such and the building was really old. I was greeted by a grumpy lady who didn't speak English at all (luckily I managed to communicate with the little German I knew. My room was on the first floor directly opposite the breakfast area. When I entered, the room smelled of cigarette smoke and the floor squeaked. At least it had a small balcony with table and chair plus a shower and wash basin in the room. The bed was comfortable and the linen very clean. I felt somehow cheated when I looked behind the door and saw that the real price for the room on that period was 45€. (I later understood this price must have been without the breakfast) The morning found me gradually changing feelings as the breakfast was a lot more than I expected. There was a choice of cold meat and wonderful cheeses, smoked salmon(!!!), cake and yoghurt among other things. The breakfast room had a nice view of the station opposite the street. The majority of the other guests were German. At this time there was a lady who spoke English and the other staff were very pleasant. Coming back I would have to say it was an interesting stay. The things that bothered me at first weren't really of significance as the location was very good, the breakfast hearty and the room clean so a decent stay.", "Date": "April 29, 2008"}], "HotelInfo": {"Name": "Pension Stuttgarter Eck", "HotelURL": "/ShowUserReviews-g187323-d529529-Reviews-Pension_Stuttgarter_Eck-Berlin.html", "Price": "$47 - $131*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kaiser-Friedrich Strasse 54 / A</span>, <span class=\"locality\"><span property=\"v:postal-code\">10627</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "529529", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/cf/03/cf03e778e3341449245fe4f45c9831464large.jpg"}}