{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Excellent value for money, great location”", "Author": "HScuba", "ReviewID": "UR126746416", "Content": "Stayed at this hotel on a weekend trip in March. It's rather small but in my view simply rocks. Seriously. Excellent value for money. Room spotless clean, quiet, functional and with modern appliances, free and well-working Wi-Fi. Terrific breakfast buffet included. Cosy bar area offers great place to relax and have a drink or coffee. Hotel's location is great - it's not in one of the well known touristy areas of Berlin but in a quiet residential street of Kreuzberg, just a short walk (approx. 5-10 min) from the subway station \"Hallesches Tor\" (from there it's a quick ride to the museums and the shopping areas in the city center or to \"hip\" places like Prenzlauer Berg or Friedrichshain in the East). It's a cheap (EUR 11) cab ride from Berlin central station and within walking distance (approx. 5-10 minutes) from the local \"Kiez\" Kreuzberg/Bergmannstrasse with lots of bars and restaurants. Staff very friendly and helpful. You will enjoy your stay if you don't need 24/7 room service, pool, gym or spa.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great weekend in Berlin”", "Author": "IanWManchester", "ReviewID": "UR120919324", "Content": "Visiting our daughter who lived nearby so chose for convenience to her flat but enjoyed so much would choose there again even if daughter moved a little further away. Very clean, always helpful, modern almost Scandinavian type of decoration. Breakfast was a good choice and fresh. Always felt safe around the area even returning past midnight. Highly recommended.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Comfortable and cosy place”", "Author": "Sangria07", "ReviewID": "UR119825383", "Content": "This hotel is located in a quiet residential area but it has very access to public transportation. A short 3 minutes walk took me to a bus stop where I could catch the M41 bus which goes to, amongst others, Potsdamer Platz and the Hauptbahnhof. A slightly longer walk (about 10-15 minutes) in the other direction and I was at the Hallesches Tor station. Despite being in a rather deserted area, I never felt any worry for my safety coming home after dark. The great thing about the location is that it is almost completely silent at night enabling me to sleep very well. My single room was spacious and clean and the bed was large and comfortable. The shower has good water pressure and the stand out point is the heated floor tiles in the bathroom! The bathroom is equipped with basic amenities and a hairdryer was offered to me during check in. As I travelled alone, the frosted glass door that separated the room and the bathroom posed no problem to me although I can see how it might be an issue if I were travelling with someone else. There are no coffee making facilities in the room but there is a complimentary bottle of water in the room when I first arrived. I only have two suggestions for improvement with regard to the room - Firstly, the lighting in the room was inadequate for night time reading. I usually read up on my plans for the next day before bed and would have liked a bed side light that enabled me to read. There is a reading lamp on the desk but the desk is a tiny one and there was insufficient space to spread my maps on. Secondly, the TV is installed at a weird angle so that I had to twist my body to view it from the bed. Placing it on the wall in front of the bed would make viewing much more comfortable. The buffet style breakfast was good. There is no hot food but instead the is a good spread of breads, cheeses, cold cuts, cereals, smoked salmon and herring salad to enjoy while gazing out at the pretty backyard (I chose a window seat every time). There is an elevator and also a computer with free internet at the bar. The reception staff are very friendly and helpful. I'd have no qualms about recommending this hotel and would myself stay there again in a heartbeat. It was a comfortable stay and good value for money.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Live Like a Berliner: Sweet Hotel, Heavenly Bed and Well-Priced”", "Author": "barbaracu", "ReviewID": "UR119598469", "Content": "Hotel Johann is located in the vibrant multicultural Kreuzberg section of Berlin, on a quiet residential street. We enjoyed living like Berliners for 5 nights, coming home to our neighborhood in the evening. The hotel is contemporary, very clean and pleasingly decorated. Our bright, roomy, high-ceilinged room faced the pretty courtyard and was extraordinarily quiet for a city accommodation. Our fabulously comfortable bed, in the German style, had separate mattresses on a single platform, 2 cozy comforters and large square pillow. It was so comfortable that we tried to find out more about it in hopes of replicating it back home! The breakfast was the best free breakfast in my memory! All the foods appeared to be artisanal, beautifully presented and super fresh, including tasty soft-boiled eggs, fresh yogurt, granola, gourmet cheeses, beautiful whole-grain breads and rolls, freshly cut fruit salad and much more; altogether delicious. Served in a sunny room overlooking the courtyard, breakfast took us through until dinner many days! Free wireless internet too. The only cautions about Hotel Johann are the following: 1. The hotel is a 10-minute walk from the metro, longer than would probably be true in the busier parts of Berlin, and the way is not well-lit at night. 2. In our lovely room, there were a couple of strange quirks: a) There was not a lot of light in the room, making it almost impossible to see items in the wardrobe; b) If you are traveling with a partner with whom you do not ordinarily share bodily functions, talk to the management before you reserve. Our room had a sliding piece of glass as a bathroom door, with several inches of open space, so that someone sitting in the room could have a face-to-face discussion with the person using the toilet.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Excellent hotel at a reasonable price”", "Author": "Tess14344", "ReviewID": "UR119196395", "Content": "Johann Hotel is definitely value for money. I stayed there for 3 nights in October and my entire stay was a very pleasant experience. The room was modern, the heated tiles were a really good touch, there was free internet wifi, the breakfast had a lot of excellent choices, the staff were very friendly and helpful. The location is about a 10-min walk to the nearest metro station. It was a dark walk from Hallesches Tor metro station but the area seems relatively safe. The hotel is situated in a very quiet, peaceful residential area, which is exactly what you need to be able to rest well after a whole day of walking around. For non-German visitors, the hotel could do with one or two English channels.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beer Sheva", "Title": "“GOOD HOTEL WITH SOME DISADVANTAGES”", "Author": "tamarazeev", "ReviewID": "UR118802860", "Content": "Generally the hotel is good. Receptiionists are good staff. THE rooms are good end clean Disadvantages. A the door between toilet facilities and the room is transparent - is is difficult to explain what is reason of this. B breakfeast is built on \"cold\" principle - no hot sauseges os scrumled eggs ' there are only cheeses, bread, ham, salads. C the bar downstears supply you only with drinks, nothing toasts or somethin like that", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A delight, but....”", "Author": "bkj_10", "ReviewID": "UR118403575", "Content": "We recently (September 2011) stayed 2 nights at Johann. On arrival and throughout our stay the receptionist was friendly and answered our queries offering local advice on shops and restaurants. We chose the hotel for it's quiet location between the two hot spots of Kreuzberg; Bergmannstrass & Kotbussier Tor which are easy to reach by public transport or walk. We stayed in the large double room that appeared the same as the photos on the Website. The furnishings are more than comfortable and the interior finishes a visual delight. The room has high vaulted ceilings with full height wall to wall orange curtains. These curtains are not lined so daylight passes through filling the room with a beautiful amber glow. Though this provided a wonderful light effect it did interrupt our morning sleep. The bathroom also looked great, but its sliding glass door adjoining the sleeping area is just wrong. This glass door provides no acoustic nor odour privacy. Turning the bathroom light on at night filled the bedroom area with light interrupting my partner's sleep. These are minor grievances since we loved the place and had a wonderful relaxing stay. As vegetarians we were happy to find soy milk and salad vegetables as choices in the breakfast buffet. Note: the vegan restaurant and bar Viasko is walking distance from this hotel and serves good food for Berlin.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“fantastic”", "Author": "voguish", "ReviewID": "UR118352475", "Content": "We had a big, airy room facing the quiet residential street the hotel is on. It was spotlessly clean and very comfortable though simple. The location was great, the metro is about a 10-minute walk away, but it can be quite dark walking back at night. Breakfast was my favourite part of the experience. Cold cuts, cheese, bread, yogurts, fresh juice- delicious! Staff were very warm and helpful. Absolute gem for the price.", "Date": "September 20, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York Metro Area", "Title": "“Very Good Small Hotel in Quiet Residential Hotel”", "Author": "DIBNY", "ReviewID": "UR117956378", "Content": "If you are looking at a five star, mega-sized hotel in the midst of the action, this is the wrong place for you. If you are looking for a comfortable boutique hotel in quiet residential neighborhood, willing to walk 7 minutes to the train, impeccably kept, with an outstanding breakfast, that is reasonably priced, this hotel is definitely worth considering. Staff is always very gracious and helpful.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tulsa", "Title": "“Awesome hotel - good value for your money”", "Author": "Elizabeth C", "ReviewID": "UR117271044", "Content": "Hotel Johann was awesome. Very clean, helpful staff, close to the metro station and definitely the best bargain for our money on our trip in Europe. I would highly recommend Hotel Johann.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Surrey UK", "Title": "“2nd time at this hotel”", "Author": "SS-DS", "ReviewID": "UR114834085", "Content": "We would recommend this Hotel, only a 5min walk to the Ubahn to take you into the city centre or approximately a 20min walk to check point charlie, very helpful & friendly at the reception desk, clean, plenty to eat with a good selection at breakfast no hot food (for those of you who like egg & bacon etc),quite location although our room was next to an elevator only heard it a couple of times in the night with people arriving, free wifi although a little slow at times, reasonably priced honesty bar in reception area with a selection of snacks.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Southborough, Massachusetts", "Title": "“http://www.tripadvisor.com/”", "Author": "mike5395", "ReviewID": "UR113827815", "Content": "The hotel is in a quiet, mostly residential neighborhood near a canal. There are only a few places to eat nearby within easy walking distance and a greater variety a longer distance away where the nearest U-Bahn stop is located, about a 15-25 minute walk. The hotel itself is nicely appointed with clean, large and comfortable rooms. The buffet breakfast served is great with a good selection of cereal, eggs, some type of smoked fish, and various breakfast meats (ham, sausages, etc.) and good bread and rolls. Juice, coffee and tea are also available. During nice weather, you can eat on on a quiet patio area outside the breakfast room. The wireless internet access worked fine. The hotel also rents bicycles, if you are so inclined. The staff is very friendly and helpful, a big plus. My wife and I stayed there on three occasions over a two week period in three different rooms so we got a taste of the room set up. The only drawbacks that I can mention about the rooms are few. There is a translucent sliding door that \"closes\" off the bathroom from the bedroom. It is somewhat noisy to slide and leaves gaps at each end. This is not a problem unless you need to use the bathroom at night where the noise of sliding the door and the light through the glass might awaken anyone who is asleep. The shower is good but it has a partial glass partition to serve as a \"shower curtain\" which is a bit too short to keep water inside the shower. You have to be somewhat careful to avoid having a wet floor. Finally, we were there in May and the weather was pleasant but since there is no air conditioning, the room might become uncomfortable during the summer if it is hot and humid outside. To sum up -- We enjoyed our stay there and highly recommend the hotel. We would stay there again on our next trip to Berlin.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“love this hotel”", "Author": "kimt2011", "ReviewID": "UR113490340", "Content": "can't wait to return to this excellent hotel, very quiet, great breakfast, very helpful staff and very clean rooms", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great value & service”", "Author": "Jenny3009", "ReviewID": "UR93209359", "Content": "Our family had a very enjoyable stay at Johann Hotel over the new year period. The staff could not have been more helpful. They dug the snow out from under the car, organised dinner reservations for New Year's Eve & prolonged breakfast on New Year's Day until 1pm! The rooms were very clean & stylishly furnished. I would recommend paying 10 Euros more for the larger size though. The Breakfast Room was relaxing & had a good assortment of food to choose from. Highly recommended.", "Date": "January 16, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "England", "Title": "“Small, friendly, comfortable and helpful”", "Author": "cantwatitogethome", "ReviewID": "UR89138285", "Content": "I stayed here for the Berlin marathon. It was in a good location for the public transport (short walk from two stations). The hotel was immaculately presented, and the room well designed, given the space available. The staff were friendly and helpful, and even opened breakfast early on the day of the marathon (there were plenty of other runners staying). I checked out on the day of the marathon, but I was allowed to use a shower after completing the run. Hope to stay again for the next Berlin marathon.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Victoria", "Title": "“Very nice but a bit out of the action”", "Author": "ShirTuck", "ReviewID": "UR86603935", "Content": "Lovely hotel set on a quiet street in a Multicultural section of Berlin. A bit of a walk to transportation and/or quality restaurants.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Fantastic city, great hotel”", "Author": "welshbeastie", "ReviewID": "UR86139147", "Content": "We had two rooms for 4 nights in October. As per other reviews hotel is welcoming and it does what it says. It's clean, rooms are well presented, bathrooms modern etc. There is no hairdryer in the room but they provide them from reception when requested. Enjoyed a good quality breakfast before getting out and about to see this fantastic city each day. The hotel is in Kreuzberg which is regarded as the turkish area of the city. Within 10 minutes walk there are a wide range of turkish cafe's that are a great alternative to formal restaurants. One that we ate at twice is Knofi on Bergmannstr. and we we would reommend it to anyone who likes eclectic places with food you would typically get in a high end deli. Transport is within easy walking distance. Would recommend the small group card. It cost 15.90 euros an enables up to 5 people to travel as much as they like that day - expires 3am. Computer in the bar with free internet is a good touch, as it the free wifi - this worked well in bedrooms.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NJ", "Title": "“Wonderful hotel”", "Author": "bythewater00", "ReviewID": "UR83571449", "Content": "We stayed at hotel Johann because of the great reviews on Trip advisor. 3 nights total. 2 on the first leg of our trip and then another night at the end. The hotel is located in a residential neighborhood. Super quiet at night - and about a 10 minute walk to the subway. We felt safe to walk from the subway to the hotel at night. The hotel itself is cute, small - the staff is very friendly - they serve a good continental breakfast each morning. If you bring your lap top, they have free internet that you can use unlimited. We even messed up the dates for the last night - booking the room the night before we needed it. We arrived at the hotel early that morning from Munich, only to realize that we pre-paid for the previous night. They had an open room and let us check in right away - never charged us for an additional night. It was a life saver! Highly recommend this hotel to anyone for a great stay Berlin!", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "perth", "Title": "“Very Clean well run hotel”", "Author": "Mary1962perth", "ReviewID": "UR83296015", "Content": "My husband and I stayed here twice while in Germany. It was an wonderful small hotel, really efficiently run. The rooms were spotless and the staff incredibly helpful. The breakfast was fantastic. We really enjoyed the location which was out of central Berlin but close to public transport (train and bus) for easy access. The location was quiet but close to a canal and parks. We caught a canal cruise that was a five minute walk that took us past the major sites of Berlin. This was fantastic. Although no restaurant, two minutes away was a beer garden that did wonderful food. Also there was a major restaurant area only a 10 to 15min walk", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Stylish & friendly”", "Author": "GeriSydney", "ReviewID": "UR81286706", "Content": "Hotel Johann is off the beaten track. Close to transport and only a good walk into main shopping area. I stayed here alone and was made to feel very welcome. Great little bar area and stylish breakfast dining room. Little thoughts like make up mirror in bathroom appreciated. All in all a very stylish small boutique hotel.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A little gem”", "Author": "geordieladinlondon", "ReviewID": "UR78501938", "Content": "Just come back from a long weekend in Berlin, having been to Berlin on a number of occassions previously I wish I had known about this hotel on those visits. The hotel is centrally based but in a queit tree lined street in Kreuzberg, but an easy walk to 4 different u-Bhan stations that can get you pretty much everywhere easily (from hotel to Mitte in 12 minutes) or we took the bus on some occassions (Potsdamer Platz in 9 minutes). Rooms are modern with large windows and plenty of space / light which makes them feel even bigger, excellent beds - a very comfortable nights sleep. Hotel and room were both very clean! Breakfast is a typical german affair with lots of meats, cheese, breads and fruit - all yummy and staff were very flexible if you were late, Staff were very friendly and spoke far better english than I do german! I would thoroughly reconmmend this hotel for either business travellers or those enjoying a break in Berlin. I will be going back at somepoint!!!", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chippenham", "Title": "“Minimal Style, Maximum Quality!”", "Author": "SnowWhite78", "ReviewID": "UR76653665", "Content": "The Johann Hotel is a lovely independent hotel located in a quiet residential area. The hotel has a trendy, minimalist style but there is plenty of old fashioned customer service here too. We stayed in a lovely, large room with a vaulted ceiling. Since our room faced the road there was a little traffic noise and the occassional fire engine/ambulance but still quiet for a city centre. The room had a nice bathroom, hot shower and plenty of space to dump our stuff. The beds were comfortable but I did not like the pilows. Unfortunately you will always get these floppy, square pillows, so it is to be expected really, I just don't like them much. We found the staff to be exceptionally friendly and helpful. We were given advice as to what to see, how to get around the city and where to eat. Breakfast was delicious. The selection was vast and constantly being refreshed, much better than the average continental breakfast. An excellent start to the day. As many reviewers have commented, the hotel is not central but this really does not affect your enjoyment of the city. You have the option to walk (15 minutes or so) or take the underground or bus, all within easy reach. If you are planning to see the sights I'd really recommend getting there early. We found long queues everywhere. 1 hour queue to get into the Reichstag late afternoon and 90 minutes to get into the Pergamon Museum at 10:00. I really enjoyed my stay at the Johann. Berlin is a really interesting place to visit and the Johann is an excellent base. Whilst I would not rush back to Berlin for a while, I'd highly recommend anyone to stay at the Johann.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wiltshire, UK", "Title": "“Comfortable, welcoming and friendly”", "Author": "seanppk", "ReviewID": "UR76042216", "Content": "My wife and I stayed here for a couple of nights to explore Berlin while and could not fault it at all. The reception staff were friendly and helpful from the start, giving us maps of the city, and recommending the best ways to enjoy our days there in mixed weather. They spoke excellent English and were able to answer all of our questions. They also recommended a great restaurant nearby for us to visit on our first night - \"Defne\" a Turkish restaurant on Planufer (road name). The hotel itself isn't right in the heart of the city, but we were able to walk back from Checkpoint Charlie in about 15-20 minutes. The alternative is getting the metro from Hallesches Tor (about a 5 minute walk away), or a bus from Urbanstraβe/Blücherstraβe (the main road which runs parallel to Johanniterstraβe) which will take you to Potsdamer Platz or through a tunnel under the Tiergarten to Hauptbahnhof (central station). Back to the hotel, the rooms were clean, comfortable and finished in a minimalist style, but our room had a nice vaulted bare brick ceiling which certainly added a certain je ne sais quoi. Breakfast was included in our price, and was well worth it. There was a variety of cereals, fresh fruit, yoghurt, bread rolls, jams, cold meats and cheeses, smoked salmon, boiled eggs, fresh coffee, tea, fruit juice etc. Anything you could hope for (this side of the Atlantic anyway).", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Perfect”", "Author": "gillykLiverpool", "ReviewID": "UR74878167", "Content": "Hotel Johann is a must if you stay in Berlin. All staff were very helpful at all times and spoke English perfectly. When I emailed for directions etc they always replied very quickly and in fact I left my shoes in the hotel. I emailed them from Russia and as I was returning via Berlin I arranged to pick them up. Arrived into Shoenefeld Airport and it is a bit of a way to walk from ubahn with luggage and in fact when we got to the hotel we thought we were stuck out in the outskirts as such a quiet area. How wrong we were. Once we got our directions we realised we were only a 10 minute walk from checkpoint charlie and lots of other culktural sites. Fantastic location. Ubahn station only 5 mins away through park. Rooms were clean and contemporary. A bit modern for me but that is only a matter of taste. Beds comfortable, pillows lovely and everything else in the room superb. Boys were able to use the internet in the bar for free and this was quite important to them as they could chat to friends back home in the evening. They are both 15 and it is quite a difficult age for evening entertainment. They do not want to sit in restaurants for hours chatting with us adults but they are too young to do much else. we did give them their freedom early in the evenings as we felt it was safe and easy for them to find their own way back. Breakfasts were lovely and as it was lovely and warm while we were there we could sit and eat outside. I really cannot say enough about this hotel other than stay there. You will not be disappointed.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“The Johann Hotel...a hidden gem!”", "Author": "30_by_thirty", "ReviewID": "UR70694799", "Content": "We just returned from a 25 day trip to Europe, 3 nights of which were spent at the Johann Hotel. Without a doubt, the Johann was our favorite accommodation. The staff is incredibly friendly and helpful. It is evident that they take pride in their hotel which can be noted in many small details. Rooms provided ample space and were impeccably clean. The beds were comfortable, and although the room was not air conditioned, a small fan is provided. Opening the large window and running the fan kept us comfortable. The hotel is in a quiet residential neighborhood. It is an easy 10 minute walk to the Halleschus Tor station that provides access to S-Bahn and U-Bahn lines that will quickly take you anywhere in the city. You can buy a transportation card at the hotel that covers unlimited access on the rail and bus lines for the duration of your stay. They will also give you a map and give a good explanation of the transportation options. This hotel is an incredible value for the money. Additionally, a nice breakfast spread was available to us for a very low cost (4 Euros/Person) with the room. We would absolutely stay here again!", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“Great place”", "Author": "unsung", "ReviewID": "UR70345416", "Content": "The place is very nice, clean rooms, great staff, decent enough location, free wireless internet, breakfast was ok. The only negative for me was the lack of air conditioning in the rooms. I would go back for another stay.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Hotel Johann - Great Berlin hotel”", "Author": "AusScotTravels", "ReviewID": "UR66679422", "Content": "We stayed for two nights at Hotel Johann in May 2010. This is a fantastic, clean, modern hotel, which is close to everything (2 mins to a bus stop, 10 mins to a train stop) and is a great base from which to explore Berlin. The staff were extremely helpful, recommending transportation and meal options for us (we ate both nights at the Altes Zollhaus restaurant, about 2 mins away from the hotel - a great option). The rooms have wonderful high ceilings and are minimalistic in furnishing, but are very clean and very comfortable. The bathroom has a screen rather than a door, but given we are a family, this was no problem. The double room we had was big enough for the four of us (including a cot and a single bed). The breakfast was a buffet and was delicious with lots of variety. I highly recommend this hotel, and will stay here again when back in Berlin.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Cozy and welcoming”", "Author": "Sharingadvice", "ReviewID": "UR65301320", "Content": "Johann Hotel was the prefect place for our two night visit to Berlin. The staff are very welcoming and the atmosphere is cozy and inviting. The rooms are modern and spotless and the breakfast ample and tasty. The neighbourhood is green, quiet and a pleasure to walk in. We had a great dinner at the Altes Zollhaus restaurant in the neighbourhood and walked to Check Point Charlie from the hotel (30 min walk but we love walking).", "Date": "May 25, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bogota, Colombia", "Title": "“Very nice place to stay!”", "Author": "GatoCosmico", "ReviewID": "UR55508657", "Content": "Lovely and very large room, delicious breakfast and very helpful and friendly staff! Transportation to most interesting sites is close to the hotel and easy to use.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Exeter", "Title": "“Really nice place, top notch service, lovely breakfast”", "Author": "pjkExeter", "ReviewID": "UR51359090", "Content": "Friendly people, very clean, seriously comfy beds, and a really nice touch of heated tiled bathroom floor. Really handy for most parts of Berlin, although solo visitors might find the walk back from the Prinz. local u-bahn station very late at night a tad unnerving as route is quite dark - no real need though as it is a good area. Very nice little bar serving some nice whisky and grappas. Breakfast really nice and ate into most of our mornings! Would def return to Berlin and this hotel for sure.", "Date": "December 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great find in Berlin”", "Author": "milepig", "ReviewID": "UR50349640", "Content": "The other reviews pretty much say it all. My only question before the trip was the location, as some guidebooks call the area \"marginal\" or \"transitional\", but it is perfect. Close to the excellent Berlin transit system, it was find, and no hotel can claim to be central since Berlin is fairly spread out. In addition to the Bergmann Str. we discovered the Altes Zollhaus, literally a stones through from the hotel on the canal (reservations recommended) where we had a wonderful meal. Hotel is convenient, clean, has free WIFI, and a great breakfast. What more could you ask?", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful Small Hotel”", "Author": "Sheherezade", "ReviewID": "UR49817106", "Content": "The Hotel Johann gets almost everything right. The rooms are spacious, as they are the typical rooms in an old Berlin apartment building, with the wonderful high ceilings and enormous windows to let in the light, as well as many elegant little touches that remind one of the past. But the whole has been thoroughly modernised in a most tasteful manner. The bathrooms are particularly well designed, with lots of room to put your stuff. the bed was comfortable, the breakfast room welcoming and the service very friendly and helpful. The location, on a quiet street in Kreuzberg, but close to the 'action' is excellent. Everything the visitor could want is close at hand. I especially appreciated the cleanliness, good taste, and personal but very relaxed service from the staff. I felt at home, and appreciated that! It would be nicer to have more towels (one hand and one bath meant I had to ask for an extra) and the tv is the old-fashioned tiny kind high up on the wall. But you don't come to Berlin to watch television, do you? Much better idea is to go to one of the three brilliant opera houses.", "Date": "November 22, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "dublin", "Title": "“Arrived to a warm welcom on a cold November afternoon......”", "Author": "dublinboris", "ReviewID": "UR49348546", "Content": "Arrived to a warm welcome on a cold November afternoon. Our room was no 303 a very large double with an extra bed for our daughter (11). Beautiful vaulted, exposed brick ceiling - design echoed throughout the hotel was obviously well thought out and executed with care. The breakfast room was light, bright , functional yet cosy and communal tables allowed for easy chat over a wonderful start to the day, the addition of some very soothing background music was a bonus. We met three different people on the front desk and each of them were more than helpful with any requests that we had..... directions primarily. We found the M41 bus, left out of the hotel and left again (5 minutes max) to be the most convenient way of getting to Potsdamer Platz (less than 10 mins) and from there anywhere is Berlin is possible. All in all we had a lovely stay at Hotel Johann and would recommend it for a warm and comfortable stay at very good value in Berlin.", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Midlands UK", "Title": "“German efficiency, a perfect machine”", "Author": "Cynical_traveller", "ReviewID": "UR46517841", "Content": "You can't knock the Germans - highly efficient, very organised, extremely helpful and does what it says on the tin, and bit more. I followed the instructions from their website to get a train from Schoen Airport to Prizenstrasse then walked in the depth of the night to the hotel (I got a bit lost ... print a decent street map). The hotel is a really attractive classical building, really impressive and imposing from the outside. I checked in at midnight, the guy on reception I suppose the owner, greeted me friendly and told me I could pay in the morning since it was late. I had emailed them to ask if they have WIFI earlier, and he'd already printed for me the network key and code - free of charge (unlike a lot of hotels in Germany). Also, he offered me a free upgrade to a bigger room on the 4th floor, since they were not full. Big, spotless, spacious room, bathroom you could eat your breakfast off the floor should you be so inclined. The location is in a quiet leafy street, no noise - other than a tiny bit of roadworks at 8am (not enough to bother you). Great breakfast, all quality and good choice. This hotel is a private establishment, not a chain of hotels, so the personal touch and extra effort is apparent. You can walk to the train stop or bus stop in 10 mins, and from there be where ever you want in central Berlin in 20 mins. Why go anywhere else??", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Value for Money”", "Author": "westraveler", "ReviewID": "UR46165739", "Content": "We stayed in Hotel Johann for 4 nights. It has to be the cleanest hotel I've stayed in ever! Room 301 was huge and bathroom was big too. The staff were very helpful with directions and transport. The breakfast was delicious and selection was fantastic! Definitely stay here again and will recommend it to everyone!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Excellent stuff and service. Lovely stay”", "Author": "Reese619", "ReviewID": "UR45780139", "Content": "I was there to attended a conference. Had a very enjoyable stay, and loved the breakfast. The staffs were so nice and helpful. The only thing not perfect for my stay is that it takes half hour to commute to ICC (the conference site; south west corner of Berlin). It may be easier to take S bane when it´s functional again. Will definitely stay in Johann hotel next time visit Berlin again.", "Date": "October 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“amazing breakfast”", "Author": "lauraele", "ReviewID": "UR43843448", "Content": "This is a stylish and friendly hotel. It's in a residential area but only a short walk away from the cafes, restaurants and shops in Kreuzberg and it's a 5 minute walk to the U Bahn. The staff are really helpful and knowledgable and the rooms are comfortable with excellent bed, wooden floors and modern bathrooms. The breakfast is amazing - it's worth staying at the hotel just to eat the breakfast!", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City", "Title": "“Great hotel with outstanding staff.”", "Author": "oknyc", "ReviewID": "UR37465207", "Content": "Hotel Johann is a renovated, new hotel with stylish and comfortable rooms. They serve an excellent and expansive breakfast, which is included in the cost of the room. The hotel desk staff is outstanding. They speak wonderful English and are friendly, knowledgeable, helpful, and considerate. The hotel is located on a nondescript street at the edge of Kruezberg and the immediate neighborhood is unimpressive. However, it is quiet, a block away from places to eat by the water, and less than fifteen minutes walk to Bergmannstrasse. Mitte is a twenty minute walk and bus and U-Bahn are conveniently close. The hotel will rent you bikes for 7 Euro per day; ask early as they haven't many.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Gem in residential area”", "Author": "Antigoon", "ReviewID": "UR33444880", "Content": "The Johann has everything, from arrival to departure - large rooms, clever interior decoration, luxurious breakfast, internet, garden, cheap parking, bikes for rent, quiet street and well-stocked bar. Top value and lovely people. Nearby are a star restaurant and a popular family-style eatery. All in the upbeat Kreuzberg neighborhood. What else could you want ?", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham", "Title": "“Hotel perfection in Berlin”", "Author": "La_Francaise13", "ReviewID": "UR32784685", "Content": "If only all hotels were like this! Welcoming in a genuine but also (thankfully) laid-back way, stylish, clean, comfortable, great location. Excellent value at 105 Euros for a very spacious double room inc breakfast (and were pleasantly surprised to get a 3% discount when we said we would be paying cash!). I have a big thing about hotel beds (not generally big enough or very comfortable) but the Johann gets it absolutely right! Buffet breakfast excellent, particularly liked the freshly prepared fruit with yoghurt and the unlimited coffee. Dining room overlooks a tranquil courtyard garden where you can sit out. Honesty bar reasonably priced. Free internet. About 5-10 minutes' walk from several U-bahn stations and buses. I recommend the local bars and restaurants a few streets south, around Bergmanstrasse.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "ottawa", "Title": "“A liitle gem”", "Author": "davin", "ReviewID": "UR31763659", "Content": "Stayed for 4 nights May 15-19 and like many reviews have said this is an excellent no frills hotel.About a 10 minute walk to the nearest U bahn station at Hallesches Tor but this line takes you everywhere.There is also a bus 1 minute from the hotel that was great for getting to the train station.Terrific breakfast which as was stated before could cost at least 12-15 euros at another hotel.Very friendly staff and free internet.Super clean and would not hesitate to stay again.Close to the Turkish district 5 -10 minute walk to Bergmanstrase where we had some great meals.Also 5-10 minute walk to the not to be missed Judisches Museum.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Paris", "Title": "“Friendliness makes up for austerity”", "Author": "pantagruelParis", "ReviewID": "UR31271540", "Content": "If the single rooms in this much-liked hotel were any more frugal they could be lent to visiting delegations of monks. Clean, modern showers. But hangars and shelves not cupboards: industrial soap and shampoo dispensers,no tissues, hairdryers,notepads, stationery,pens. Small wall-mounted TV with one foreign language channel. A bit remote from the nearest U-bahn stations though the M41 bus (out of hotel, left, left again, first right) will whisk you to Potsdamer Platz and the Haupbannhof whence many useful connections. So why the plaudits? Exceptionally frendly and helpful staff: spotless; honour system for late drinks: very fine (continental) breakfast with vast array of cold meats, cheeses, breads, jams. Same thing billed at 12EUR in Munich hotel. Free Internet. Very quiet.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Berlin, MA USA", "Title": "“Very clean hotel with great staff”", "Author": "Carl16", "ReviewID": "UR30815533", "Content": "Stayed for a week. It's perfect if you don't mind a little walking. You can easily walk to Brandenberg Gate in about 40 minutes. It's a safe walk with plenty of sites along the way (checkpoint charlie) (topographies of terror) (shopping district). Or you can walk to a bus stop in 5 minutes that will take you to Potsdammer Platz which is very central. Or take the subway (5 minute walk) to Unter Den Linden which again is very central. Subway is also direct to Alexanderplatz. These short trips allow you to see much more of Berlin than if you were staying in Mitte. Breakfast buffet was included and is excellent.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Menlo Park, California", "Title": "“A pleasant stay in Berlin”", "Author": "yoribe", "ReviewID": "UR29211577", "Content": "I was impressed by the cleanliness and modernity of this hotel, which is situated on a quiet residential street in the Kreuzberg neighborhood. The location is also close to the Mitte, which is a good starting point to explore Berlin. It is also adjacent to Kreuzberg and Neukolln, areas which I had wanted to explore. This hotel suited me very well, since I was looking for a reasonably priced accomodation but with a bit of \"niceness\" to it. The room was furnished with contemporary furniture (the kind you'd find at Design Within Reach), and the bathroom fixtures appeared to be practically brand new. The frosted sliding bathroom door was a nice touch, although it left a 1/2 inch gap. The staff were friendly and helpful with directions around the city, and the breakfast spread of bread, hams, jams and cereal in the dining room in the back of the hotel was quite generous. The front desk is not staffed from midnight to 7:00AM, so be advised if you need to check out early for an early morning flight or train ride. The closest U-Bahn station (Hallesches Tor) is about a 15 minute walk from the hotel, so hiring a taxi may be a good idea if you're alone and coming back late at night or if you did a lot of shopping.", "Date": "May 3, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Service": "5", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Bike around Berlin & Home to Hotel Johann - Perfect Combination”", "Author": "Ben0B", "ReviewID": "UR27770358", "Content": "Hotel Johann is a carefully crafted hotel, cool and classic at the same time. High vaulted ceilings give an air of spaciousness to the public areas and bedrooms. Breakfast is a handsomely presented buffet, strong on cheeses and breads. The owners and staff are proud of their place, always a good sign. Kreutzberg is not exactly Berlin Central but hire a bike from the hotel and you'll be wheeling along Unter der Linden is under 10 minutes. The close-by canal banks come alive in early evenings as locals sit out in the setting sun. Grab yourself a wheat beer with banana juice at the nearby beer garden and do likewise.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Chesterfield", "Title": "“Quiet hotel and location”", "Author": "Strider687", "ReviewID": "UR25267627", "Content": "The hotel is situated on a quiet residential street, that is a short walk from the U Bahn, the walk to Checkpoint Charlie is also not much further. The rooms were minimalist, very clean and very contemporary looking. Breakfast was continental with plenty of choice with a good selection. The staff were helpful and friendly, they assisted whenever we needed them, especially when we arrived late at night to check in. Our room was next to the lift which we never heard at all. It was a refreshing change not have to listen to other guests moving around. We would definitely recommend this hotel to anyone.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Great Hotel”", "Author": "sharpstar", "ReviewID": "UR24660805", "Content": "Stayed for 3 nights. This is a great hotel, modern stylish décor, spacious & very comfortable rooms. Staff were extremely helpful. Breakfast was plentiful, lots of different kinds of bread, rolls, cheeses, salmon, meats and boiled eggs. Fruit loaf and chocolate, Muesli & Yogurt. It was very filling and served in a stylish big breakfast room. Found the area the Hotel is situated in nice and quiet, we commented on how safe it felt to walk about even late at night. Everyone we met was friendly and helpful. 10 mins walk south of the hotel is a street full of restaurants and bars. And only a 10 mins bus ride from hotel north to the main tourist area. Would definitely recommend staying here.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Brighton/West Hollywood", "Title": "“You should definitely stay here...”", "Author": "Breadbelly", "ReviewID": "UR22146028", "Content": "This is a great value stylish hotel with a relaxed friendly atmosphere. Although it is situated in a somewhat residential area it is only a short walk to the nearby U-Bahn station or bus stop. Kreuzberg and Mitte are within easy reach. The staff here are very helpful with travel advice. We arrived at the hotel very early in the morning and as our room was not ready the lovely receptionist made both my wife and I cappuccinos and looked after our luggage.. We were offered access to the lounge with free internet and also invited to join breakfast. After a couple of hours exploring the surrounding area, we returned to check in to a fantastic room. Very clean with an extremely comfortable bed (strange, I never thought I liked those foam mattresses..) and nice minimalistic modern furnishings. Beautiful brick arched ceilings and a heated floor in the bathroom. Very good & typically German breakfast spread, meat, cheese, cereals, breads, pickles, eggs etc.. The staff were always welcoming and friendly. After our departure, I realised I'd left something behind. The hotel promptly emailed me back and had it in the post to the next hotel on our European holiday free of charge. We stayed 2 nights as part of our honeymoon and will definitely be returning on our next visit to Berlin. Also, if you like sushi I definitely recommend that you go to Kuchi in nearby Mitte. You will not be disappointed.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Styish”", "Author": "henke07", "ReviewID": "UR21929006", "Content": "The hotel is very clean, modern and stylish and staff were very friendly i.e. we were given a map of the city straight away (which was far better than those in the guide books) and pointed in the direction of some nice restaurants. The hotel's appearance was very clean and the decor minimal but classy. Although our room was very nice it is not for the toilet shy i.e. the toilet was just short of open plan. The location was not the most central but it's only a few U bahn stops from the city centre. My girlfriend did comment however she would not have liked to travel to and from the hotel in the evening had she been alone or in a group of women only. Overall, we had a really enjoyable stay in a very nice hotel with more warmth than you would get in a chain and I wouldn't hesitate to stay there again.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Iraklio", "Title": "“Just OK”", "Author": "WorldTracer", "ReviewID": "UR21765770", "Content": "We stayed in the Johann for some days. To be honest, after reading the existing reviews, I was prepared for something more special than what we experienced. Pros: Modern and clean room, nice building, quiet area. Floor-heated bathroom. Friendly owners. Cons: Toilet glass door doesn't close firmly (it's a slide door that leaves 2-3cm gaps on each side, so the smell and ...noise may come out in the main room. Shower cable was broken, throwing water around. There's not a personal safe in the room, only downstairs at the reception. Breakfast was good but I think it's rather continental than real buffet breakfast (no toast bread, scrambled eggs, bacon, croissants). The beds were definitely not so good as reviewed form others and the pillars were huge and square, but difficult to shape at a healthy sleeping position. Finally, I think I expected a bit more for almost 100 euros/day. I would prefer to pay a bit more and stay at a more central hotel next time.", "Date": "November 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“My best experience in Berlin!”", "Author": "ofiucus", "ReviewID": "UR21421295", "Content": "I stayed at the Johann for 5 days and I have to agree with all the positive reviews. The hotel is great value, clean, beautiful, quiet and the staff and service are warm and caring. I already miss looking forward to a great breakfast every morning. On a final note my partner said the bed was the most comfortable he has ever slept in. I cannot fault this place, in fact it is unthinkable to stay somewhere else next time I am in Berlin.", "Date": "October 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Ja Ja Ja to the Johann!”", "Author": "BlueCoffee", "ReviewID": "UR20964668", "Content": "In short - if you're off to Berlin, this is the hotel you should call first. We booked the Johann having read other reviews on tripadvisor and we were absolutely delighted. The staff are welcoming, friendly and extremely helpful. The nearest U-Bahn station was closed for maintenance during our stay and the staff directed us to alternative transport routes which in turn opened up different parts of the city for us. The rooms are beautiful: fresh, clean and spacious. We were in single rooms that in other (chain) hotels would have been doubles. The space is maximised with plenty storage; the beds are comfy; the bathrooms are fantastic with powerful showers and underfloor heating which is very welcome on a chilly Berlin morning! There are plenty of bars and restaurants in the surrounding area and for those who, like us, are there for the late-night scene, taxis can find the Johann easily...", "Date": "October 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Excellent experience”", "Author": "tourdeloire", "ReviewID": "UR20651400", "Content": "This was a lovely, welcoming home for 5 nights. We found it to be spotless, roomy, comfortable, and well-appointed. Our room was large enough to enjoy a sofa, and the wood flooring, vaulted brick ceilings, and heated bathroom tile floor were beautiful. The owners and staff could not have been more helpful and friendly. The lobby \"living room\" offered drinks, coffee, and conversation.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berkshire", "Title": "“Fantastic base for a long weekend in Berlin”", "Author": "GeoCroc", "ReviewID": "UR20503896", "Content": "This is an excellent hotel in the Kreuzberg district of Berlin. Like the previous review I was here when part of the U1 U-bahn line was closed for engineering work, but it reopens at the end of October. However, the hotel is a five to ten minute walk from at least three different U-bahn stations, so this wasn't a problem. It in a very nice setting, close to, but not overlooking a nearby canal. The area is mainly a quiet residential district. I had a single room, which was on the small side, but was very very comfortable and the very high ceilings and large bed made the room feel larger. The bathroom, very clean and modern, was a good size, given the overall proportions of the room. Staff were very friendly and helpful. They clearly enjoy running the hotel, which makes this well run, affordable, independent hotel. Breakfast selection excellent as well. Well worth staying here, as it helps explore some of the districts away from Mitte, where you can find some great bars and restaurants, favoured by locals.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bristol england", "Title": "“All the good reviews are right!”", "Author": "fredic", "ReviewID": "UR20070404", "Content": "Can't really add much to the reviews that are already about this place. Our stay was excellent. There was engineering works on the U1 line whilst we were there but I'd recommend that you use Hallesches Tor on the U6 line anyway. It is just as close and a pleasant short walk. We had room 304 which was large and airy. It is at the front of the building and when we opened our windows, it was initially quite noisy when cars went past on the 'cobbled' street. It is a quiet road though and it never stopped us getting to sleep. Breakfast was superb in a lovely room. The staff are always busying around to make sure there is always lots of everything. Didn't have to use the reception much but the people were always polite and friendly. We also went down to Bergmanstrasse to eat - another pleasant stroll south. A tip - if you go to Pagode, a Thai restaurant which is definitely recommended, collect your own food - it is effectively a takeaway with lots of tables. Order and wait or come back very quickly.", "Date": "September 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Faultless”", "Author": "Kingston34", "ReviewID": "UR19653277", "Content": "This hotel is the the first within its' very reasonable price range to appear on the list of Berlin hotels and it's very easy to see why. It has an excellent location just outside of the centre of Berlin within 5-10 mins walk of four U-bahn stations. The staff are incredibly helpful, friendly and welcoming and the rooms are clean, modern and spacious. The breakfast is really fresh with a good choice and a courtyard outside if the weather's up to it. The amazing Jewish museum is within walking distance as is Bergmanstrasse which has numerous restaurants and bars to choose from. I would not hesitate to recommend this hotel and could not come up with a single negative.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gloucester", "Title": "“An excellent choice”", "Author": "GerryP39", "ReviewID": "UR17024057", "Content": "This is a really friendly, quiet hotel. I concur with everything other positive reviewers have described. The breakfasts are exceptional and the staff incredibly helpful. There is an excellent Italian reastuarant if you turn right and right again which is cheap but delicious. I can thoroughly recommend a stay here. There is a swimming pool adjacent to the station, no idea of the quality but it may be worth packing your trunks and finding out. I can also recommend the circular boat trip which departs just a short walk from the hotel.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Great value for money”", "Author": "raf89", "ReviewID": "UR16916162", "Content": "I was in Berlin for 10 days and thoroughly enjoyed my stay at the Johann Hotel. Great breakfasts, lovely room (although I booked one of the small ones), and the service was impeccable. I recommend it without hesitation. You can also rent a bike at a very cheap rate, but make sure you reserve it in advice because they only have 3 available.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wellington", "Title": "“Loved it!”", "Author": "WandererWellington", "ReviewID": "UR16631147", "Content": "I stayed at Hotel Johann for almost a week during the chilly Berlin Winter. Overall I had a great experience staying here and would definitely do so again. Staff were very pleasant and helpful, my room was impeccably clean with great minimalist decor and the underfloor bathroom heating was a plus. The hotel is off the main tourist track, but close to a selection of good Kreuzberg cafes/shops, also near many public transport options. I rented a bicycle from the Hotel during my stay, which was a great option (only charged me 3 out of my 4 days rental, a nice touch!). Berlin is a wonderful city for cycling and although Hotel Johann is out of the city centre, this made everything very accessible. Good breakfast choices in a pleasant environment, wireless internet access, cosy yet spacious room, beds could be slightly more substantial, though definitely a great choice overall, good value too!", "Date": "June 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Perfect little hideaway!”", "Author": "farnook", "ReviewID": "UR16426716", "Content": "A super little place in a quiet neighbourhood and within easy access of two useful U-Bahn lines. It's a little off the beaten track but it's easy to get pretty much anywhere. A cab from Tegal costs just under €30 and it's under €10 to the funky areas of Mitte if you're coming back late. The room was beautifully furnished, peaceful and airy with a tasteful and spotless en-suite shower room. The highlight though was breakfast. We ate in the lovely bright, airy dining room three days on the trot - they serve breakfast 'til 11 at weekends. Stunning selection of bread rolls, cooked meats, smoked salmon and a lovely array of cheese. Fresh coffee and quality juice choices abound. I would definitely stay here again.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Quality at budget prices with friendly atmosphere in Kreuzberg”", "Author": "Nana81", "ReviewID": "UR16058370", "Content": "Great breakfast. New building, all rooms refurbished. Bright and clean, close to the metro station \"Hallesche Tor\" and \"Gneisenauer Straße\". You can walk downtown (just follow the Friedrichstraße from the subway stn \"Hallesche Tor\") in about 30minutes. Supermarkets near by. I liked it!", "Date": "May 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Salonica, Greece", "Title": "“Adorable little hotel”", "Author": "Florian08", "ReviewID": "UR15790213", "Content": "Date: 8 May 2008 Reviewer: Tania - Greece We stayed there for 4 days. It is a superbly clean, quiet and stylish hotel, not exactly in the heart of Berlin, but very comfortably located (the nearest metro and bus station are a 5 minute walk away, through a lovely park, along a river canal). Safe and absolutely non touristic area. Just across the hotel there is one of the finest german restaurants (\"Altes Zollhaus\"). The room was pretty spacious, very clean and pretty. The glass bathroom door is not highly recommended for new couples, as it may cause some embarassment..... It also had a small balcony, which for us smokers was pretty useful. The hotel has a very cosy breakfast room (where you should not expect scrambled eggs and bacon, although everything that is offered is fresh and delicious) and also a very nice backyard, where you can take your breakfast, if the weather is good. The owners are simply adorable, extremely polite, but in a relaxed and casual manner and always ready to make you feel you are more than welcome, almost part of a big bunch of friends. I loved it!! You will too, if you fancy small hotels with a relaxed atmosphere and a casual but absolutely professional attitude.", "Date": "May 8, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Nottingham", "Title": "“Great hotel in a great city”", "Author": "Corinne76", "ReviewID": "UR15573429", "Content": "We stayed at the Hotel Johann for 3 nights, on a bed and breakfast basis. We chose it mainly because of the good reviews on Trip Advisor but also because the price was reasonable and it looked nice on the website. To get there from Berlin-Schonefeld, take the ‘Airport Express’ to Friedrichstrasse, then the U6 to Hallesches Tor (direction Alt-Mariendorf). The hotel is 5-10 mins walk from Hallesches Tor, on a quiet residential street. The whole journey took an hour – but I would allow 90 mins in case of missing connections etc – check-in is available until midnight. On arrival, we were greeted by a very helpful staff member who spoke very good English (a godsend considering our poor skills in German). We were in our room within minutes – after stopping to get some reasonably priced drinks from the honesty bar in the hallway. Our room was just as we had hoped it would be – spacious and comfortable with lovely furnishings. The bathroom had a sliding glass door which gives no soundproofing whatsoever, so it’s definitely best to stay here with someone you know well! We didn’t realise that the bathroom floor was supposed to be heated – this must have been what the thermostat in the bathroom was for (we thought it was for the room itself). The bed was an ‘Austrian twin’ – two single mattresses on a double frame and was very comfy. We weren’t so keen on the feather pillows – but that’s just personal preference I guess. The central heating worked fine when needed and the windows were easy to operate and provided good soundproofing. There is no air conditioning though – hopefully the high ceilings would compensate for this in the summer months. Although others have praised the selection of food for breakfast, we found it a little bit disappointing. The breakfast room itself is really nice and you can eat in the courtyard when the weather is good. The food available included cereals, bread, cheese, ham, cold veg, fruit salad and yoghurt. There may have been 10 different types of bread but we were hoping for some hot food or at least some ‘sweet’ items such as croissants, pain au chocolat etc. The other guests seemed to be happy though so I guess this just comes down to cultural differences (although I don’t remember having any problems with breakfasts when we went to Austria). Overall, we were really pleased with this hotel and it is highly likely that we will stay here again if we go back to Berlin. The location may seem quite far from the centre of Berlin, but the proximity of the U-Bahn makes travelling around very easy. One useful point to note is that they are currently offering a 3% discount for cash payments – there are ATMs in the shops near Hallesches Tor.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "York, UK", "Title": "“Good value”", "Author": "runningjohn", "ReviewID": "UR15506629", "Content": "My wife and I and a couple of friends stayed 3 nights. We were given the only two rooms that front the street that have a balcony which was an added bonus. The location in the former East Berlin is suburban and relatively quiet with fast access to the city centre, a couple of stations are less than a 10 minute walk away. We felt this was a safe environment, using the train/tube late at night and walking back to the hotel was absolutely fine.The hotel was spotlessly clean and the typical continental breakfast was excellent in pleasant surroundings (see pic). We can get by in German but the staff all spoke good English and nothing was too much trouble. Would stay here again without hesitation. Can highly recommend the Insider walking tours, take about 4 hours but really interesting guide to the city's history.", "Date": "April 30, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Udine, Italy", "Title": "“Wonderful stay”", "Author": "D.Bissi", "ReviewID": "UR14479924", "Content": "My family and I stayed at Johann during recent Easter holidays. We can in principle confirm the comments of previous travellers. The hotel is located in Kreuzberg, not very close to the City center, but with very good connections, both by U-Bahn and bus (line M41 to Potsdamer Platz is just 200 m from he hotel). The area is very quiet, giving you the chance to take very good rest in the night. Hotel is modern and very clean; the staff is absolutely kind, available and helpful, paying full attention to any of your request. Our room was very warm, wide and confortable; the floor of the bathroom was heated, which gave us a very nice feeling, when we were back from our museums tour, since the wheater was quite cold in those days. The breakfast room was wide, with a view to the garden behind the hotel; the choice of the food was wide, with many types of cheese, salame, ham, salmon, fruit, and more. The ratio quality/price is definitely high. We'll surely stay at Johann again once in Berlin and we'd recommend the hotel to anyone.", "Date": "March 24, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Classy, Convenient and Affordable”", "Author": "lazlototh", "ReviewID": "UR12566955", "Content": "Just south of the main tourist loop, 10 minutes from Checkpoint Charlie, five minutes from the U-bahn, Johann Hotel is a good deal for the price. The staff is friendly and accommodating. The hotel is comfortable, quiet and very low-stress. The included-breakfasts are a great start before a long day hiking around. The only downside are the very European beds -- two hardwood singles pushed together with a thin mattress. The rooms are clean, the bathtubs are huge and the bathroom floors are heated. Definitely recommend this place.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam, Netherlands", "Title": "“Great place to stay”", "Author": "Ronald_Amsterdam", "ReviewID": "UR12448305", "Content": "Small hotel in the Kreuzberg area and apparently a free parking in the streets around the hotel. Very amazing for a big city like Berlin. Very helpfull and friendly staff, spacious and very clean room, we really like our stay (2 adults 2 kids.) The breakfast was also very tastefull. The hotel is situated about 1000 yards from the subway station, the neighbourhood is safe and very quiet. For our next trip to Berlin we will definitely come back to this hotel.", "Date": "January 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Superb Value!”", "Author": "SRVP", "ReviewID": "UR10819944", "Content": "Our family was attending a wedding in Berlin. We decided to book at the Johann because several other family members were planning to stay there. Normally we stay in more upscale hotels, but we felt that it was more important to stick with the family. Our concerns about the quality were totally needless. The place is a first class operation. The beds are fabulous--this comes from someone with a really bad back who always complains about hotel beds, no matter the class of hotel--and we have stayed at the best. The rooms are spare and modern, and most importantly spotless with crisp linens. The heated bathroom floor is a rare treat. The breakfast room is lovely and so is the food. The staff is friendly and helpful--what else can you ask of a hotel? Well, location, perhaps. It is a bit out of the way, but if you use public transportation or taxis you are within striking distance to all important sites. Best of all--you are walking distance to the magnificent Jewish Museum which is worth a trip to Berlin all by itself.", "Date": "November 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vancouver", "Title": "“A stylish spot away from the crowds”", "Author": "pompom79", "ReviewID": "UR8243709", "Content": "We chose Hotel Johann based on the strength of the other reviews listed here and were not disappointed. Situated on a quiet residential street in Kreuzberg, the hotel is about a 10-15min walk from the Checkpoint Charlie area, with the high-end stores and wonderful restaurants of Friedrichstrasse, and about a 30min walk from Museuminsel and the Alexanderplatz area. There are a number of transit spots within a 5-7 min walk of the hotel, making this an ideal spot for the traveler who appreciates being able to reach other parts of the city easily, but doesn't want to deal with the crowds in the more touristy areas. The staff (and Berliners in general, it seems) are wonderfully friendly, the rooms are contemporary and comfortable (the guests were suitably stylish too), and the hotel's small size and townhouse/courtyard setting give the place a nice, intimate feeling. There is free wireless access too, though it doesn't reach the higher floors very well - however, in the summer months it's much more pleasant to work outside in the courtyard. The breakfast at Johann was the nicest I've yet experienced in a European hotel. The variety of top-quality meats and cheeses was exceptional, there is every kind of bread/roll you could want, the fruit salad and yogurt are delicious, and they make a mean pot of coffee. Everything is served in a lovely breakfast room overlooking the courtyard with hours that suit both the earlybirds and the late risers.", "Date": "July 27, 2007"}], "HotelInfo": {"Name": "Johann Hotel", "HotelURL": "/ShowUserReviews-g187323-d529517-Reviews-Johann_Hotel-Berlin.html", "Price": "$95 - $138*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Johanniterstrasse 8</span>, <span class=\"locality\"><span property=\"v:postal-code\">10961</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "529517", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3b/5f/d7/vordach.jpg"}}