{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Poznan, Poland", "Title": "“Excellent location, so so value”", "Author": "gadulec", "ReviewID": "UR124019100", "Content": "First of all, excellent location in the center of the city. It takes about 7 minutes to Zool Garden by bus or 15-20 min by walk, nearest subway - 7-10 min Calm and quiet, friendly service, speaking in German, Russian, supposedly worse in English. What's more, they had good breakfast, a buffet (although the same thing every day;), ie, bread, cheese, salami or mortadella, hard boiled eggs, butter, jam, yogurt, cereals, muesli, juices, coffee / tea) For a double room with private bathroom for 5 nights + breakfast we paid 250euro. I think it was little too much. If you have more time you can find something cheaper.", "Date": "February 2, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Good location and a nice hotel”", "Author": "Zdenca", "ReviewID": "UR117214541", "Content": "We stayed at this hotel 2nights. Room was large and clean. Breakfast was good. But staff wasn´t good at English (Receptionist was from Russia). Location is great, near the city center. You can park on the street for a small fee.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bamberg, Germany", "Title": "“Awesome place”", "Author": "cbw230", "ReviewID": "UR114334786", "Content": "We stayed at here for 3 nights with family. We were a total of 5 people and booked the 3-bedroom apartment. It was perfect for us and there is nothing negative I could say. The owner was very nice and helpful, despite our late check-in. The beds were super comfortable and breakfast plenty. It is in a great location to start your sightseeing tour. It's within easy walking distance to the subway or the main shopping street. If you are looking for a great place to stay for a good value for your money, look no further!", "Date": "June 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shropshire", "Title": "“Good value for the location”", "Author": "Lincolnshirechap", "ReviewID": "UR7723638", "Content": "This is a budget 1 or 2 star hotel, so I wasn't expecting gold plated taps (which I didn't get). Located in a pleasant area with some quiet bars, eating places and little shops all within 100 yards. It is also close to the old West Berlin city centre. Situated in a huge tenament block, which it shares with professional people like doctors, solicitors etc. A central, small, antiquated lift takes you up to the hotel level. A well worn, large enterance hall leads to the reception area, the place is dark and interesting which a fine wall painting within. The bedrooms are large, old and clean, the bed soft, but otherwise fine. No rooms have a view worth taking a photo through. Breakfast was the basic cold platter you often see in continental europe and it was more than adequate for our parties needs. All four of us could speak fairly good German, so we had no problems, the couple fronting the place were not friendly or kind, but they were not rude either, they gave us directions and booklets to help us find some places we were wanting to see. If you want to spend half your time in Berlin stuck in your hotel room, this is not for you. If however you want explore and get out and about, somewhere safe, clean, cheap and central to the former West Berlin City Centre, this is a good option. <*))))))><", "Date": "May 31, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Aust", "Title": "“Out and about”", "Author": "MickaKate", "ReviewID": "UR7328450", "Content": "We went to Berlin with a group of friends and my partner and i stayed at Pension Bella. We arrived at the Hotel in a fairly dark street at about 11:00pm and despite emailing the Hotel from Australia to confirm the late arrival time, the building was locked up and looked as though no one was there. After beating on the door for about 10 minutes, a man who spoke no English at all came to the door. He understood my surname to know who we were and took us up to the level which the Hotel was on, the rest of the building was apartments and other business. The room was large with an old charm and warm and comfortable for the two nights we were there. I would not stay here again because of the terrible language barrier. Brekkie was ok just like any other European brekkie.", "Date": "April 11, 2007"}], "HotelInfo": {"Name": "Pension Bella", "HotelURL": "/ShowUserReviews-g187323-d529520-Reviews-Pension_Bella-Berlin.html", "Price": "$53 - $95*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ludwigkirchstrasse 10-A</span>, <span class=\"locality\"><span property=\"v:postal-code\">10719</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "529520", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/25/80/2580e19ec7958439a9382d68a9556f718large.jpg"}}