{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cheap & great location”", "Author": "mf750", "ReviewID": "UR118407052", "Content": "So close to the train station but tucked away a bit so we didn't hear any noise. Cute little hotel, staff very friendly. We had breakfast included, aircon, private bathroom & tv & it was super cheap! Me &y husband were very happy & would Ho again.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“This is awful and is not at all worth”", "Author": "TarikUK", "ReviewID": "UR117190857", "Content": "Awful..u dont get for what you have paid for..if u want to stay at rome, u wil get far better hotels than these..however if u dont have any option u can go there..we stayed a night..and they charged us 70 euro whereas..we later shifted to another bed and breakfast hotel 60 manin which is way above as a hotel than this and has charged us only 50 euro per night..i wont never come back here again", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Cheap, clean and friendly!”", "Author": "Herbert069", "ReviewID": "UR111952111", "Content": "When we booked back in May we read some contrasting reviews. The truth is simple, you get excellent value for money. It's 50 meters from the termini station, which makes it very easy to reach from any airport. It's in the centre of Rome, even if you don't rent a scooter, like we did, you can easily reach a lot of places by foot, and the others by metro or bus, both of which are at termini station. Our room was small but clean. The bathroom is not luxurious but it had a decent shower. The breakfast is Italian style, simple but more than enough with perfect coffee. In short, you get excellent value for money!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“You get what you paid for”", "Author": "Carolina-SP-Brazil", "ReviewID": "UR108998930", "Content": "The hotel shares a building with other hostels and is located only one block away from the Termini station, where you can take the subway or buses to the city attractions or a train to other locations in Italy. Staying close to the train station has its downsides, so we didn't feel very safe on the streets at night. The room was very simple and the mattresses were old, quite uncomfortable. Our room was in the first floor, so we could hear everything from the reception all night long. The shower is European style and, although they had the metal bar on the wall, it wouldn't stay fixed. Cleanness of the room could be improved, there was a leaf on the floor when we arrived, and it was there when we left 3 days later. They wouldn't change the towels, even when we complained that they hadn't dried from the previous day. Breakfast is included in the rate, but if you go late there will be almost nothing left. The rates that we got were very cheap compared to other budget hotels in Rome, so I can say that it delivered what we paid for.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Zealand", "Title": "“great location for accessing Rome”", "Author": "Kay004", "ReviewID": "UR51499221", "Content": "We stayed for 2 weeks. Had a room facing into the courtyard (reqest a quiet room not facing the road if you can). The worst noise we had was from a group of drunken students arriving back after midnight which the hotel manager apologised to us for! A reasonable buffet breakfast. There is a working elevator. All the staff were very friendly, even with the language problems a t times. Termini area is perfect as a transport hub to go off and explore Rome with public transport.", "Date": "December 19, 2009"}], "HotelInfo": {"Name": "Hotel Washington", "HotelURL": "/ShowUserReviews-g187791-d529610-Reviews-Hotel_Washington-Rome_Lazio.html", "Price": "$86 - $198*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Giovanni Amendola 77</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529610", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/a0/83/e4/benvenuti-welcome.jpg"}}