{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice Room, Great Breakfast”", "Author": "Rentalsatwintergreen Posted by an Easytobook.com traveler", "ReviewID": "UR128058498", "Content": "We could only stay for our last night in Rome. Room was lovely and as pictured on their web site. Staff was efficient and helpful. Beds were very comfortable. The breakfast was great. Lots of variety both sweet and savory. Everything was fresh and very nicely presented. V. good hotel for the price. Short walk to Piazza Garibaldi, next door to Antico Arco. Pleasant walk to the heart of Trastevere and a short bus ride back to the hotel.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wyckoff, New Jersey, United States", "Title": "“Old Style Charm”", "Author": "Dave B", "ReviewID": "UR127127777", "Content": "Well-kept hotel with a staff that aims to please. Conveniently located, a 15 minute walk through a lovely park, overlooking Rome, to the Vatican or a short bus ride on the 44 or 75 to the downtown area. Stayed at the hotel for a week in February 2012 due to its close proximity to the American University (daughter is studying there) and was pleasantly surprised to find a diamond of a hotel away from the city. Breakfast spread is included in the price and the roof-top dining room includes spectacular views of the city. Pool area wasnt open during our visit but was well laid out and looked like a nice spot to relax after a day of sight seeing. A must stay!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Fantastic views from the Gianicolo Hill”", "Author": "AxeGirl", "ReviewID": "UR126987449", "Content": "Perched right on top the Gianicolo Hill, this hotel is a short walk from the bus into the centre of town, or up to the Vatican. We stayed there for three days in April 2011, and our overall impression was good. The lady on reception was friendly and helpful, and gave us useful maps of the surrounding area and the public transport. However, as others have noted, there was a rather grumpy man who didn't believe in smiling! Our room was small (not unusual for a capital city), but very nicely refurbished, and we didn't have a problem with noise. We loved the breakfast buffet, which was in a pleasant room on the top floor. You need to be reasonably fit if you are going to walk down the steep steps into the main part of Trastevere for dinner (and back up again afterwards!), but once there we found some lovely neighbourhood restaurants, which were very good value. We got the local train in from the airport, and bought a bus pass for 11 Euros. If you want to do one of those open-topped bus tours, then the Roma Christiana buses are definitely the most frequent.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Renton, Washington", "Title": "“Affordable Hotel option in Trastevere - a short bus ride from the city!”", "Author": "RichJ19", "ReviewID": "UR126786455", "Content": "Very nice, affordable hotel option in Trastevere. Easy access to Piazza Venezia using bus #44 (be sure to get on the right direction...yeah, we saw a few more sights by boarding the bus in the wrong direction!) Note: Get your bus pass first as you can't pay on most buses (look for bus passes in newsstands or tabaccherias. This hotel is very nice, good continental breakfast on top floor, and was much more affordable than many other hotels we stayed at during our seven days in Rome. Internet access is just ok, I usually went to lobby for wi-fi access. A very good option in Rome.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Ottawa", "Title": "“Too bad because this could be a gem”", "Author": "Chris71Ottawa", "ReviewID": "UR124895931", "Content": "Ok, first off, the walls are paper thin so this impacts a lot of things. Service - this is not a place that offers service with a smile. Nothing was proactively given to us - no free wifi ticket, no map of Rome, no information on anything near the hotel. If you dont care about service then this could be he place for you. By the way this is (in my opinion) pretty common for Rome so i'm not sure how other hotels would be anyhow. Room. Small by north American standards and large by European standards. The walls are paper thin and we were kept up all night long by our wonderful neighbour who seemed to get in at 1230 and crank the tv to 11 and fall asleep to it. Third night was the same a guest seemed to check a 1230 am and we heard everything - she turned the lights on, emptied her suitcases... Not a place for peace and quiet. Breakfast, was included in our rate and it was worth it. Good service in this area of the hotel. Location. Amazing. Trastevere is a great place to have a home base in Rome. We landed at FCO and took the regional train to Roma Trastevere train station (8 euro each) and a 8 euro can to the hotel. We could see the Vatican from the breakfast area on the 4th floor. We actually walked to the Vatican from the hotel (about 20 minutes). We took the 75 bus into Rome everyday. it took about 15 minutes and dropped us off at the colloseum. From there you can take a subway to all the great spots in Rome. A 3 day metro / bus pass cost us 11 euro each. Overall, the area was wonderful, the location great. It is too bad the room walls were paper thin and the service did not meet even basic courtesy standards. That said, there was a nice young woman that did her best and actually did smile when she answered questions.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kent, United Kingdom", "Title": "“Lovely stay in a lovely hotel”", "Author": "ShaznayM", "ReviewID": "UR120339743", "Content": "I have just returned from a conference in Rome where I spent four nights in Hotel del Gianicolo...I loved it - a bit of luxury at an reasonable price, friendly staff, jacuzzi bath, comfortable beds and exceedingly clean. It was also very conveniently located for my conference at the American University of Rome. It is set outside of the city, but the bus downtown only takes 10 minutes. Wonderful views of Rome from the nearby terrace and close to the lovely Piazza S. Maria in Trastevere. I would definitely go back and would highly recommend this hotel.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "West Yorkshire", "Title": "“Small dark room”", "Author": "maxaimee", "ReviewID": "UR120172068", "Content": "Our room was near reception on the ground floor and therefore we were disturbed by a lot of noise first thing in the morning. Although the room was very clean the wall paper was peeling off the walls and was very shabby. We only stayed for one night and therefore did not make a complaint but if we had been staying longer we certainly would have asked to be moved. Also we had a very unpleasant experience at Trastevere railway station on arrival when a nasty liquid was thrown over us and whilst a well dressed man offered tissues to clean up another man tried to grab my husband's rucksack but fortunately we managed to hang on to it. When we arrived at the hotel, we mentioned it to the receptionist who wasn't very sympathetic or helpful and when asked if we could check in to clean up, was told we would have to wait until 1 o'clock (2 hours away)but could use the hotel toilet if we wished!! Breakfast was adequate but overall a disappointing stay particularly as we had stayed in a beautiful hotel the week before in Rome for the same price.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“5 star hotel”", "Author": "judy v", "ReviewID": "UR119323439", "Content": "We spent 4 days in Rome and although we bused to and from the centre, it was nice to return daily to a quiet and upscale neighborhood. The hotel is gorgeous as well as the grounds and pool. The staff were helpful and friendly. The breakfast was amazing; the best we ate in Italy. All the bus stops were very close by and with a 10 -15 minute bus ride into Rome. I felt safe walking a block to the pharmacy and bank in this gated community. Janiculum Hill is within walking distance or a 2 minute bus ride and gives you a breathtaking view of Rome. The room was immaculate, historical and modern decor combined, typical size for Italian hotels and had every ammenity in it even slippers for your tired feet. I especially liked I could open the windows to look out and hear the sounds of the neighborhood. I would highly recommend this gem.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barrow-in-Furness, United Kingdom", "Title": "“Lovely hotel, quiet location but minutes from the sights”", "Author": "carlandmoira", "ReviewID": "UR118840812", "Content": "We found the Hotel quite randomly for a short holiday but were very impressed. The location of the hotel is excellent. It is in a qiet area of Rome high on the hill witha marvellous vieew of the city but it is only minutes on foot down into the hustle of the Trastevere where there are so many places to eat and then across the Tiber to the main sights. Waliking north over the hill past Garibaldi's statue drops you down to St Peter's. The walk down to the Trastevere is very short but it is steep. The hotel is delightful, very clean with helpful people at reception and the bedrooms have all the facilities you could desire. We went in October which was not swimming pool weather. The breakfast was one of the best we have had in Italy. The airport shuttles take you to Termini station but that is not ideal - iI would advise you to get a Taxi to the hotel. When we reurn to Rome we will return to the Hotel Gianicolo.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Eastbourne, United Kingdom", "Title": "“Great pool”", "Author": "daaytrippper", "ReviewID": "UR118354604", "Content": "I have stayed at this hotel twice and can recommend it highly it. If you don't mind hills it is within walking distance of Trastevere, which is a great area to eat with restaurants and cafes - lots of Italians seem to eat out there. The statue of Garibaldi with great views of Rome is also nearby and at a stretch you can walk to the Vatican City too. There is a pool, which is kept immaculate by the pool guy (I think its only open late spring till early autumn) which the kids loved after a hot day of sightseeing. The decor of the hotel is a bit 80's dark green and mahogany hues, but its a good price and the staff are quite helpful, although they don't fall over themselves to ensure you have a good time. The breakfast, although just about edible, could definately be improved upon. There's a great little cafe/bar under the walls of the hotel which does toasties and coffees, and a very reasonably priced restaurant called Carpe Diem, just around the corner from that where we had a few great meals. Can't wait to go back to Rome again.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Good Quality and excellent access to downtown Rome”", "Author": "DonMacP", "ReviewID": "UR118167775", "Content": "Stayed 3 days in July at this hotel which we chose because it offered a lovely inground pool set in landscaped grounds and quality rooms at a reasonable price. Because the Grand Hotel del Gianicolo is situated on one of the severn hills of Rome in Trastevere and so about a 10 minute taxi ride to the Forum, rates for this 4 star are lower than comparable hotels in central Rome. However, there is excellent city bus transportation from just outside the hotel (a block away) that takes one directly to the Forum in about 15 minutes. It also connects with the subway and that provides a quick and air-conditioned ride to the main shopping area. We took taxis going home as it is quite the up-hill walk (cost less than 10 Euro) although the walk down is pleasant and the views fantastic. The hotel arranged for a Mercedes to collect us at the airport as we had considerable luggage..cost was 57 Euros and likewise to the Port of Rome for a van at 120 Euros for 2 persons. The room was well appointed and comfortable although some might find it a little dated and lacking colour. The finishings however were quality as was the linen and it was very clean. Breakfast was extra but was on the roof-top which had a nice view over Rome. Top feature was the swimming pool...a large irregular shape pool with plenty of chairs and loungers so we were able to enjoy the afternoon and then go to town for the late afternoon-evening. Service was attentive and the cleaning and laundry staff excellent. Would certainly return to this hotel in future", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Nice stay in walking distance to Trastevere”", "Author": "LeedsDods", "ReviewID": "UR117804801", "Content": "We stayed here for 4 nights in late August, we picked this hotel as it had a pool and was near Trastevere which looked a good spot to eat out in. We pre booked a taxi to and from the airport which was a great idea, no hassle. We arrived and were shown to our room which was compact, dark, quiet and with no view. This did not bother us as it meant we spent little time in the room and slept well. We spent a full day around the pool and every afternoon after sight seeing which I would say travelling to Rome in August is essential and fantastic when its 30'c The breakfast had a good choice for our 4 days, I can understand people may expect more choice if staying for a week. Drinks were expensive at the hotel, much better value elsewhere even in central Rome. Trastevere was lovely, more understated and less touristy than central rome, everyone seemed local or a young foreign student staying here. We walked most places you need good shoes as its all cobbles and quite steep, occasionally took a taxi to and from Rome centre, taxis were between 8-14 euros but worth getting back for the pool. Once in the centre the metro was brilliant for visiting the sites. On the whole we would recommend this hotel but only if you want to spend a large amount of your time exploring Travestere and for the pool.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Very nice, class and excellent quiet location”", "Author": "missunshinealex", "ReviewID": "UR117311616", "Content": "I liked the welcoming and the perfect location with the tower and its panoramic view and a lovely garden. The staff was very helpful and we had a great dinner for the wedding we attended.", "Date": "August 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Ireland", "Title": "“Nice quite location, dated But clean hotel.”", "Author": "pat_dub_1", "ReviewID": "UR116752261", "Content": "The rooms in this hotel are quite dated but clean. We had a problem with noisy air conditioning and a faulty shower door. Breakfast had a good selection to choose from but nothing spectacular. Pool area was nice but watch out for the mosquitoes. The best feature of this hotel is it's location, in a nice residential area but just a short scenic walk down to Trastevere, with fantastic views over the city. A great selection of restaurants and bars nearby. All in all this is an average hotel in a nice location.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "England", "Title": "“Okay but expensive for what it is”", "Author": "prhuk", "ReviewID": "UR116692721", "Content": "Sited in a lovely leafy part of the city, this hotel is on the west bank of the Tiber and is not well placed for those who want to use the public transport which concentrates on the east bank. So while there are buses near the hotel which run into the city every 20 minutes or so during the day, you are a long way from the metro and quite a walk to the nearest monument (St Peter's). Also being up a steep hill the area has some lovely views of the city if you decide to walk down to the river (around 20 minutes walk with lots of steps). The area also has some nice restaurants. The hotel has a faded grandeur, and is quite cool as the windows are all shuttered and the floors in the halls and bedrooms are ceramic tiled. The first room they gave us was really horrid - it was pokey and gloomy with a tatty bathroom and a window that you couldn't fully open due to a roof behind it. We complained and got a room on the next floor that was better but still not worth the money we had paid for this quite expensive hotel. But its bathroom was better and the air conditioning had just been fixed so although still a small room it was just acceptable. The wifi was free but you have to pay to use its swimming pool. But the breakfast was very good, with a great range of foods and juices, and was placed on a nice large roof terrace with plenty of tables. So in summary not a bad hotel in a lovely part of Rome but quite expensive for what they provide.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amstelveen, The Netherlands", "Title": "“Very nice Hotel with swimmingpool in Rome!”", "Author": "SuzzieQ16", "ReviewID": "UR116525635", "Content": "This Hotel was very good, the swimmingpool and the location in the district Trastevere made it an awesome vacation. The only negative point is that the rooms are not sound closed so when there is noise in the hallway you will hear it.We had room 314, another room is mabye better, but it's really a very good hotel. And if you love eating then you are in a good district, wauw Trastevere is very nice to eat and walk around, very nice district of Rome! And the hotel is on a hill (Gianicolo) but there are good buslines to the hotel, so that's not a problem.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Herts", "Title": "“Expected more...oh and take your own swimming cap!!!”", "Author": "Tragil74", "ReviewID": "UR116424735", "Content": "I choose this hotel for the simple reason it had a pool, visiting in August can be very hot and the pool made the choice for us. I have stayed in Rome a lot for business and personal reasons and can honestly say that I have always had a wonderful time at lovely hotels, unfortunately this hotel did not live up to its reviews in my eyes. The room was basic, small, but that's fine as we only used it to sleep in, I would certainly not give it a 4 star rating! the pictures are obviously the best rooms. The pool photo on their website is taken at such an angel that you think you are at the wrong hotel when you arrive. It is a nice pool, but one that is used by outsiders paying a fee, so this makes it quite difficult to get a lounger, they leave their towels on them and go off for hours, oh and you have to pay 5 Euro's for a pool cap that must be worn at all times in the pool! OK I can understand this, they want to keep the pool filter clean, but you would think the guests would be given these for free as you certainly can spend money there! Normal general pricing at hotels, twice the price for anything you can pick up at a supermarket or shop, but as there is not anything directly around the hotel they have a captives market. Breakfast was typically european, bacon, eggs, little frankfurters, cold meats, cereals, cakes, lots of cakes. the breakfast staff seemed more intent on looking busy than actually paying attention to the guests, our first morning we had got tea/coffee, juice and sat down to put our sugar in etc, then we got up to get some food, when we returned to our table they had cleared it! l did laugh at this, but then on the other mornings when we had no spoons, no napkins, there was no fruit, there was no coffee, it was no longer funny. Overall it was not too bad, but you have to know what you are going to get for your money, as a seasoned traveller I have experienced a lot better service in smaller 2 star hotels, where the staff are actually really happy to see you and want you to enjoy your stay, here it felt like we were a slight inconvenience! Everyone is different and others have enjoyed great times here, just do not expect a truly wonderful stay, then if you do have one it will be a bonus!", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Brilliant hotel and location”", "Author": "KAM24", "ReviewID": "UR115073963", "Content": "Good location at the top of Trestevre. Excellent service and good pool area to relax after a hard day sightseeing.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rockford, Illinois", "Title": "“An Oasis of Calm in a Busy City”", "Author": "Dragases", "ReviewID": "UR113119780", "Content": "I go to Rome nearly every year both by myself and as the leader of small groups of people interested in the history and culture of Italy. I've stayed in convents and fleabag hotels near the station, in luxury hotels, in apartments, and at virtually every level in between. The Grand Hotel del Gianicolo is one of the pleasantest experiences I have had in the eternal city. The location is a quiet and pretty neighborhood up on the Gianicolo, not far from the American Academy. If you are looking for the noise and grime and scuzzy people sleeping under bridges you expect from a trip to Rome, this hotel is not for you. We had about 25 people with us, and they were all quite happy with their 8-10 days at the hotel. I especially enjoyed the chance to have a simple lunch outside in the garden--yes, there are days when it comes close to 70 in January, and it feels like 80 when you have left the frozen Middle West. We had two meals in the dining room, and I wish I had arranged more. The food was really very good and not just for a hotel, and the service, though they were a bit short-staffed, was crisp and efficient. As someone who arranges group events several times a year, I notice details, and this hotel is very well organized, The staff could not have been more helpful, and when I fell in the shower and brought the shower door crashing down in a rain of safety glass, they cleaned the mess up immediately--offering me a new room that I did not take--and beseeching me to let them call a doctor. They acted as if the whole thing was their fault, when it was completely my own. I am going to stop in Rome in September on my way to Sicily, and I am planning on returning to the Grand Hotel del Gianicolo. By the way, there are at least two good buses that will take you to the ancient center, but if you have good legs you can cut through the park by walking down paths and steps. Ask for suggestions.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great hotel in Rome”", "Author": "JulD", "ReviewID": "UR109883333", "Content": "I stayed there for 5 nights in a triple room with my parents. The room was big, clean, and the beds were comfortable. The breakfast was great and had a great diversity. The staff was nice and helpful. The hotel is in general very quiet. The bar is very nice but we sometimes had a hard time finding somebody to serve us drinks. The restaurant looked very nice, although we did not try it. We were planning on eating there on our last day but it was closed. However, the staff was helpful in suggesting other options next to the hotel and the restaurant we chose was just amazing. The hotel is located on top of a hill which means that it is far from most of the things to visit but on your arrival they give you a map of the bus stops next to the hotel. I would definitely go back again!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Great hotel in the heart of Rome”", "Author": "lisaking2000", "ReviewID": "UR105745225", "Content": "We've just returned from 2 nights in Rome staying at the Grand Hotel del Gianicolo. We have stayed here numerous times before but usually in August when it is very quiet. This time we took my mum for a birthday present and she loved it. the hotel itself is high on the top of Rome and as you walk down the road you have the most fabulous views of Rome. the hotel itself is clean, nicely decorated and the staff are really accommodating. Breakfast was absolutely delicious - and there was lots of it, the rooms were cleaned daily and the hotel staff accommodated us with a late checkout. We would definately recommend this hotel - it is quite a walk down into the town so make sure you're feeling fit - or alternately jump a cab for 10 euros or a bus for 2 euro", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“very good hotel in an excellent situation”", "Author": "pierrealix", "ReviewID": "UR82987891", "Content": "1. The Situation : Excellent The Hotel is Situated on the Gianicolo Hill which links the Vatican and the Trstevere …it’s one of the quietest area in Rome and also one of the freshest…if you stay in Rome on Summer You easily can feel the difference with the temperature downtown..perhaps 2 or 3 degrees…there’s always a fresh and nice wind at sunset which makes your promenade very pleasant..the hotel is situated very close to two gardens…the Gianicolo Park and the Villa Pamphili Park…the 1st one is a jewel which allows you to have the most beautiful view over the city …it’s even better that the one from the Pincio (Villa Medicis) as you have the sight of San Pietro dome very close to you…actually you can easily reach by foot San Pietro in less than 20 minutes….the 2nd park is the hugest in Rome with a lot of roman joggers 2. There are several bus lines very convenient…the 115 takes you to the Vatican Parking where Tourist coaches dock… and the 871 takes you to the “Campo Marzio” (station paola) which is situated on the other side of the Saint Angelo Bridge just a 100 yards from the Piazza Navona…both lines stop just in front of the hotel ….on the other way 115 and 871 reach in 5 minutes the big transtevere avenue from where a tram line and several bus lines whisk you to the very heart of the city (largo argentina near the pantheon for the tram line and piazza venezia near the capitole for the bus services)…don’t forget than with a bus ticket you can take all the busses you want during 90 minutes…but I assure you than from the hotel there s not one spot that you cant reach in more than 20 minutes 3. The Hotel itself was an old capuchin convent as I’ve been told…it ‘s a true 4 stars hotel with a huge swimming pool may be the largest in Rome..it’s not a big hotel so the breakfast tables aren’t as big as say the ones in the Shearton but the breakfast is very good and has everything you can dream of …I rate it 10/10 ..we had 2 rooms a big one for the parents with a Jacuzzi il the bath and a smaller one for the daughter….we had dinner once in the restaurant ..it was very good but a bit dear…but then don’t except to find cheap restaurants in rome or even in italy if you don’t want to go to tourists traps ! and don’t forget it s a **** hotel ….this hotel seems to have a good reputation in the city as we saw nearly every evening a party thrown for very elegant (and nice-looking !) wealthy romans 4. Hotel attendants are very efficient and polite especially the woman at the reception and the people taking care of the breakfast…I dont understand the critics I ve read but I must add something : a lot of tourists just out of gary indiana or carlyle England just arrive at the hotel and ask “hey anyway what’s there to see in rome ?” or other silly questions which can cause a severe nervous breakdown to the most polite hotel professional 5. when I left on sunday I realised at the airport that I had forgotten an expensive valentine-signed jacket…it was a bit difficult to reach the adequate person but the hotel sent it to me in paris via colissimo with no charge..i thank them there 6. Taxis charge you 30 euros to ciampino and 40 to fiumicino …if you want to reach termini railways station take 871 to the end (paola) and from there the 40 express or the 64 to termini", "Date": "October 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel – excellent 4-night stay”", "Author": "GaryFLondon", "ReviewID": "UR82716812", "Content": "Our first time to Rome and a beautiful 4-night stay. The hotel is very picturesque and from the roof terrace/buffet breakfast area on the 4th floor you can see across Rome. We stayed in room 118 (first floor) that over looks the pool with a side street running alongside. The room is a good side and the bathroom (with Jacuzzi bath) is a really good size. The rooms are very nice and, I believe, of a four star standard. The Hotel is on hill and to get to the Vatican City you will need to catch the 115 or 870 bus from outside of the Hotel. It takes no more than 15 mins. To the Centre of Rome you catch the 75 Bus via a short 3 min walk to Carini . It’s a good way of getting about and seeing the sites. A bus ticket cost 1 euro (purchased from any newsagent stands) and lasts for 75 mins. The staff were fine, the breakfast was good in peaceful surroundings. We didn’t eat at the restaurant, as the prices did appear high. On arrival we had a small beer and a campari and lemonade, which cost 15 Euros. There is a local bar situated 1 mins walk left from the Hotel that is much more reasonable. For the evening we went to the Trastevere area where there are hundreds of restaurants in winding streets. Very typical Italian and very good. Here we ate out at very reasonable prices. Bottle of House red costs between 8 to 10 Euros. This area is a 15 min walk downhill and 20 mins back up. The 115 bus is the simple 2 min way of getting there for those less mobile. We saw all the major sites via public transport and loved every single minute of the trip.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Port Coquitlam, Canada", "Title": "“GREAT POOL”", "Author": "RPALLEN", "ReviewID": "UR80353499", "Content": "Rooms were smaller then expected, hotel food was very expensive, breakfast was not a good as all of the reviews hereindicated, although the cold portions and continental choices were expansive the hot food provided was less then edible.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Horsham, United Kingdom", "Title": "“don't bother, very disappointing”", "Author": "mamacdonal1d", "ReviewID": "UR80322192", "Content": "tatty and tiny rooms, bathroom amenities provided but in empty boxes! Mouldy curtains and hairs in the bathroom. Our bath leaked, and by this i mean the water level in the bath dropped as the water flooded the floor, we reported this but no one could be bothered to fix it. That seems to be the staff's attitude to most things, can't be bothered or not their problem. This was our honeymoon and a very disappointing place to stay, expensive, very noisy and difficult to walk anywhere as no pavements and we had our childs buggy and we valued our lives too much to take on the Italian drivers on the roads! save your money and go elsewhere. definately not 4*", "Date": "September 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Morristown, NJ", "Title": "“Nice looking hotel - great pool - not great location”", "Author": "dshawger1", "ReviewID": "UR75925577", "Content": "Our family stayed at the hotel in mid-July. The hotel is pretty to look at. The rooms are nice and comfortable (a little on the small side). The pool is wonderful - even though it was very crowded. The location is not very good for tourists. And, if you don't speak Italian - good luck... It is difficult to get around in this neighborhood of Rome. Not many local tourist sites. English is barely spoken here. The person (man) that greeted us at reception was bordering on rude - certainly not friendly. The next day the reception was friendlier - but still not warm. The breakfast is wonderful. WIFT access (Internet) is not free during your stay - it is only free for 2 hours - and then they charge you...ALOT! The serivce is not good - and only works by the pool or in the lobby. Overall this hotel is average - but not worth the cost.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Good Hotel but I would sack all but 1 of the receptionists”", "Author": "Alex0002", "ReviewID": "UR70366685", "Content": "We were a little apprehensive aftering rviewing the last few reviews of this hotel. Similar to the review below we had trouble with our room booking and did not get the room we had originally booked. The receptionist initially tried to put us into the spare room next to the office on the ground floor. No way - not a chance (based on the review below) and we immediately refused and got allocated a family room. We suspect we got allocated the ground floor room because it was the easiest option and that our original room was allocated elsewhere. After this intiial hiccup we found our new room to be more than adequate, Clean, tidy and fairly comfortable. We would rate the facilities of the hotel at a 3+ star and though we did not use the pool the area did look very good. Traffic has been mentioned below and this is a fair point but did not find it to be excessive, and certainly not a bother in the Room. Onto the reception staff. The intiial member of staff who we dealt with on our arrival did finally sort out a suitable room and was helpful in dealing with other requests. We did request assistance from 2 other member of the reception staff and we definetly felt that we were almost too much trouble/hassle. Other english speaking guests experienced the same especially when requesting asistance with bus routes etc. their general demeanor and tone left a lot to be desired. I must say at this point that the remaining staff both in the bar and at breakfast were very helpful and could not do enough too help, even recommending a local restaurant Carpe Diem which proved to be excellent. Good points Nice grounds Not too expensive Good bus routes A few good restaurants close by majority of staff Bad points Reception staff Hotel map for bus routes - Bad layout and design and difficult to interperet We would stay at this hotel again especially with a young family but would consider going nearer the centre of town as a couple.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Moonachie, New Jersey", "Title": "“Decent hotel, not a good location”", "Author": "Kellyu29", "ReviewID": "UR67597407", "Content": "This hotel is NOT in walking distance of anything. We had to take to bus into the main area which was not fun! The hotel front desk was not very friendly and we did not have internet access the entire 3 days spent there. We were told the internet was down and I guess it never got fixed. They also did not give us good info about traveling around and finding thimgs. The pool at the hotel was great, very big and clean. The restaurant that overlooks the pool area was good even though there was not too many things that we could eat there, the food we did have was good and desert was really good. The room and bathroom was small but clean.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Poor on efficency”", "Author": "kieri_10", "ReviewID": "UR66977029", "Content": "We arrived on Saturday 29th May to be told the specific type of room we booked was not available that night and we were put into a room set aside for incapacitated people. The room was next to the reception and it was very noisey, especially early the following morning. We were given our correct room for the second day onwards. All was fine until the airconditioning broke down soon after settling into our new room. We reported it immediately and were told that nothing could be done until the following day. Now this is an alleged four star hotel and you would expect that maintenance people were at the end of a telephone line. Their answer was it was Sunday afternoon and it was not possible to have repairs until the following day. They offered us a different room and the airconditioning did not work in this room and we were getting a poorer quality room to what we were paying for. We asked to see the manager and again we were told he /she does not work Sundays. Again, I say this is an alleged four star hotel. We were told that nothing futher can be done at that stage. The next morning after a poor sleep due to the temperature in the room, we went to the reception and asked to speak to the manager. We were told he will not be there until 12 noon. This is at 10am and we had plans for the day. The person on reception had no knowledge of our problems and I got very annoyed with him, about the lack of communication and the fact that their still was no manager on site. He told me to calm down, so I felt it was best to leave it to my new bride to reason with them. It was finally agreed that they would endeavour to fix the airconditioning whle we were away for the day. We arrived back at 4.30 to find a repair man in our room and we decided to not to disturb him and went back to reception to speak to the manager. We were told he was gone and again I say this is an alleged four star hotel. Needless to say we were not impressed. We were told after a while that the airconditioning was now fixed and we returned to our room, for the same problem to happen again. We contacted the reception and he offered a less superior room and we refused to leave the room and demanded the repairs to be carried out again. This was not getting us anywhere until we threatened to not to pay for our stay. Within 20 minutes the repair man was back. We stayed out of our room until 7.50pm, when finally the repairs were completed. We were afforded a €30 discount for not having the right room the first night and nothing else. In our opinion this hotel is worse than Fawlty Towers and that would be giving them too much credit. We strongly recommend that this hotel should be given a miss and it is definitely over priced. Avoid, avoid, avoid at all costs.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London", "Title": "“Not a plesant stay”", "Author": "markridler", "ReviewID": "UR63860021", "Content": "The Hotel is located about 20 minutes walk from the Vatican and 40 minutes to the centre of Rome. On arrival the communication is “here is the bus timetable” The hotel is a beautiful 18 century villa unfortunately that is the only positive I have to say about this place. It is now surrounded by very busy road in fact it is now the middle of a roundabout. If you sit near to the pool you have constant traffic passing within feet of you. The decor is drab and dated, the halls are wallpapered in a dark green or pink almost fabric which makes it very dark. Unfriendly and non-welcoming staff. Overall very disappointing and expensive.lmost fabric which makes it very dark. Very disapointing and expensive.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Fantastic escape in beautiful garden and big outdoor pool”", "Author": "CopenhagenPerN", "ReviewID": "UR56114596", "Content": "I have stayed in Grand Hotel del Gianicolo twice. Once in summer 2008 with my family and again with my wife in May 2009. The hotel offers quality with big spacious rooms, service is excellent and a big plus in summer is the garden with the outstanding pool. It is a nice and quiet hotel worth the 4 stars. Located in Trastevere is it a 20 min walk from the Piazza Navona and to the Vatican. One can easily pick a bus (every 5 min) direct to the city centre. From the hotel there is a magnificant view across Rome. I recommend this hotel to any type of traveller.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chichester", "Title": "“Too far away from central Rome”", "Author": "TraceyChichester", "ReviewID": "UR55479448", "Content": "Nice, clean pleasant looking hotel. Standard double room ok but bed was a bit hard & the shower leaked all over the floor, lovely deep bath though. Mini bar in room.....beware no price list. There was absolutely no information in the bedroom about the hotel ie where breakfast would be eaten, if you could book an evening meal or menu, opening hours for the bar, tea/coffee facilities.....maybe this was because we went out of season?? Too far away from central Rome for our liking, enjoyed the walk down the hill everyday but found it very tiring by the end of the day! Great views along the way. Not as close to Trastevere as we had hoped & being February the walk in the dark wasn't pleasant. Overall, nice hotel, but the staff/management didn't go out of their way to help or provide enough information about the facilities in & around the hotel. Would not return to this particular hotel", "Date": "February 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "northamptonshire, england", "Title": "“good hotel, great location”", "Author": "lulujack", "ReviewID": "UR55067045", "Content": "This is the hotel that does exactly what it says on the tin. It’s a grand, nice looking hotel which was, I’m informed, a former convent. The room was fine, a bit small, but it had a comfortable king size bed. It is on a main road, but the noise didn’t really worry us as the windows were well glazed. There’s a good bus connection nearby so everywhere was accessible. The best thing, in my opinion, is the location. It took ten minutes to walk down to Trastevere and I loved this old quarter of the town. Numerous restaurants at great value and great standard of cooking. So much nicer than the ones we tried in town. The only problem is getting back to the hotel – it’s an uphill climb! We used to go off and get a bus back, which, for us, was ideal. (After a day of sightseeing where we’d walk about five miles, our feet and over-worked muscles needed a rest). I booked the hotel via ulookubook web site, a great site for cheap hotel deals and I managed to get this hotel for about £100 less than any other site. For the money and the location I really rate this hotel. And come the summer when Rome will boil, the fab outdoor pool in the well kept gardens would be an absolute welcome relief.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Wonderful Stay in Rome”", "Author": "GeneveveMalaysia", "ReviewID": "UR49153675", "Content": "The staff and the rooms were great. We were within walking distance of the Vatican and all the main sights fo Rome. Each evening we walked to the great street restaurants of Trastevere. We had a few problems with the room and there were fixed immediately. The hotel had a pool which was a great way to cool off after seeing the Coloseum and the Forum and the setting was perfect. Surrounded by great villas and lots of trees.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pinner, London", "Title": "“Classy hotel, beautiful area just outside city but walking distance”", "Author": "slc888", "ReviewID": "UR32962161", "Content": "Really lovely hotel in Gianicolo up on the hill in Rome. Area is lovely and the local restaurants/night life is just 5-10 minutes down the hill with fantastic and affordable Trattoria-style restaurants. Much better than having to go into central Rome (15-20 minute walk) every night where the traffic and noise is terrible and prices are very high. Just 3-5 minutes walk is the Garibaldi fountain which overlooks the best views of the whole of Rome, amazing at both day and night. Vatican is walking distance (15-20 mins) down the hill and the hotel is surrounded by the lovely Gianicolo park. The hotel was vey classy and breakfast catered for pretty much everyone hot and cold food. Great pool. Only two complaints: our aircon didn't work but it was fixed the second night. The other thing was that wearing swimming caps was mandatory in the pool (why?), ok, fine, BUT with providing you with caps, they then make you pay 5 euros for them EACH! In my opinion, if they insist you wear their caps, they shouldn't be charging guests for it. All in all though, a fabulous hotel, very professional and friendly staff and location. Highly recommended.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Belgium", "Title": "“Overbooking is the best way to lose customers”", "Author": "sasha62", "ReviewID": "UR28210809", "Content": "The hotel is rather nice though quite away from the city centre. However, we will never go back to it as, upon our arrival, we were told that, as a result of overbooking, our \"FULLY PRE-PAID\" \" room at the hotel, booked and paid over two weeks in advance, was no longer available for the first night! We were therefore transferred to another hotel - not quite in the same area. As a result of this inconvenience, we lost the entire evening on our arrival and almost the entire morning the day after when we went back to the hotel for the remaining two nights: this on a three day stay. While these things may indeed happen, we believe that, in case of overbooking, professional four star hotels should try to make up for the uncomfort caused to their customers in the same way as airlines do, for example by offering an upgrading for the room, free drinks at the bar, etc. Apart from the \"obvious\" transfer to another hotel, this was not the case here and for us this is a very good reason not go back again and not to recommend the hotel.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Gloucestershire", "Title": "“Not bad, but not great either”", "Author": "Zarek", "ReviewID": "UR20424726", "Content": "I recently stayed at this hotel for a business meeting. No problems but nothing special either. The best bits are probably the pool with shaded outdoor area, the breakfast and the relatively short and interesting walk in to the city. The room hasn't bad either. The negatives are the strange position, at the junction of some pavementless roads, the lack of a restaurant, the lack of charachter and the unenthusiastic service. I was a bit offended to be told that it would cost 8 Euro to have a quick browse on the internet to check my flight, this at the end of a meeting that had brought in a lot of business. With some of the places I stay on business I would like to come back with the family to enjoy the experience too. This hotel certainly wasn't in this category.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Comfortable and enjoyable stay”", "Author": "Jen_MCR", "ReviewID": "UR12683972", "Content": "I enjoyed my stay at Gianicolo and found the overall trip very enjoyable. The staff were friendly and very helpful, supplying us with a map of the city on arrival and telling us of bus routes and distances to nearby attractions. This was very helpful, especially details of where to catch buses and where they went to, as we purchased a 3 day travel pass for all transport (buses, metro and trains) for 11 euros, which was a good idea due to the rain we experienced :-( however we still managed to see the things we wanted to. It is a short walk to Trastevere and within walking distance of the Vatican. There are bus services to the city and to Colleseum and Termini Train Station which run regularly. The jacuzzi was great after a long day of walking and sightseeing to relax and unwind. The room had it's own mini bar (which if you do not want to pay the hotel prices you can store your own food/drinks in.) The hotel is set on a hill which has a great view over the whole of Rome and the hotel grounds and pool were beautiful and I would love to return to this hotel in the summer as the pool would be a nice end to a long day sightseeing in hot weather! The breakfast is quite varied if you like continental breakfasts (although we didn't eat it as we would have prefered beans on toast!) The only thing I would say is if you are flying to Ciampino airport, for convience I would recommend a taxi, or hotel's limo service (55 euros), as the public transport to the hotel is not all included in the 3 day pass and is quite time consuming if you have only a short day. It took us 1hour 1/2 to get from the hotel to Ciampino airport and 2hours to get from the hotel to the airport...almost missing our flight! I would definately return to this hotel and recommend it to my friends and family.", "Date": "January 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Jersey, Channel Islands", "Title": "“A great Hotel for families”", "Author": "DF40", "ReviewID": "UR8267108", "Content": "I have just come back from Rome and was delighted with the Hotel. We had a tripple room which was a good size considering the city location. The pool was great - so few hotels have pools in Rome - and in the heat we needed it. Although it is not central the buses were quick and cheap and stop outside the hotel. The hotel does not have a resturant but they gave us great advice of where we coudl eat nearby when we didn't want to go into the city centre.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Southampton", "Title": "“Great small hotel”", "Author": "carrolld", "ReviewID": "UR7986118", "Content": "Have just returned from Rome after a short 4 day break. This was my first visit and I went with two other friends and we stayed in a triple room. It was a reasonable size for three of us and the bathroom was of a good size and we always had enough clean towels every day. The Reception staff were pleasant and helpful and the breakfast here is plentiful - mainly continental style but lots of it. Although this hotel isn't entirely central to all the main attractions, you can walk into central locations but it will take about 30 minutes. However, the taxis in and out are reasonably cheap enough so we tended to do this. Also, we were very glad that we were out of the hustle and bustle of the city as it was nice and quiet at night. Also, this hotel has the added attraction of the pool and because we were so hot at the end of a long day sight-seeing, it was fantastic to get back and spend a couple of hours swimming and relaxing around the pool before going out for the evening. Towels are supplied which is good but everybody needs to wear a swimming hat and these can be bought for 5 euros at reception. All in all, I can thoroughly recommend this hotel to anyone.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Cape Cod", "Title": "“Mixed feelings”", "Author": "tantogentile", "ReviewID": "UR6348790", "Content": "The hotel is situated near the American Academy, where our son-in-law is a fellow in landscape architecture this year, so it was convenient for us, though removed from most of the historical sites. It is very dangerous going out the front door onto a street with no sidewalks and traffic travelling at high speeds. There is a rear entrance, but it is closed for some reason. The breakfasts were exceptionally good for an Italian hotel, including scrambled eggs and American bacon as well as Italian cold cuts, pastries, cereals, juices, cappucino, caffe latte and much more. The breakfast staff was attentive, courteous and efficient, as were the maids. The room was very nice. We had a major problem at the desk, where we reserved a tour of Tivoli and were told we would be picked up at about 8 a.m. on a Tuesday. The tour transportation did not arrive and the woman at the desk called them, but chose to take their word over her own associate that they had no record of our reservations. We had precedent for this at another Rome hotel, where the woman had gone out of her way to put us in a cab to the beginning tour site at the tour's expense. The woman at the Gianicolo was of no help whatsoever, telling us we would have to take a cab at our own (considerable) expense. We tried to make it on the bus, but arrived too late. Clearly the fault lay either with the tour agency or the hotel and we should have been put in a taxi and they could have haggled over who paid later. There was no apology until I really laid into them...at which point we did find a bottle of Prosecco with an apology in our room, but that didn't make up for missing Tivoli. This event left a very bad taste in our mouths and was the lowlight of our trip, given that we booked the hotel for ten nights. The bus rides into Rome offer spectacular views of the city. I would recommend this hotel unconditionally except for the rude treatment we received at the desk, particularlly from the woman. On the other hand, the rest of the staff, including the porter, were outstanding. The location is problematic, so I'd say you would want to have a reason for staying on the Gianicolo rather than in a more central location. Michael D'Elia", "Date": "December 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, England", "Title": "“The great Grand Hotel del Gianicolo”", "Author": "Loopylootwo", "ReviewID": "UR5765220", "Content": "I stayed at the Grand Hotel Gianicolo in late August for 4 nights with a friend. My overall impression of the hotel was excellent, despite a few teething problems at the beginning of our stay. We arrived late at night and pretty frazzled due to a long journey to find we had been allocated a double room, despite asking for a twin - not a good start. I must admit, if I had had to stay in the double room for the entire stay I would not have been happy - the room was tiny and had a view of the breakfast room roof ! However we reported this to the concierge at reception and he allocated us a twin straight away. This room was far better, with a jacuzzi bath no less, and a view of the gardens. It was also much more spacious. Apart from that our stay was fantastic. We found the hotel staff to be extremely friendly and helpful (especially Marco the concierge and Enzo the breakfast waiter). They directed us to bus stops for all the major sites and provided us with a very helpful map to guide us. The hotel is located in a residential area quite a way from the centre, but to be honest we found this to be a bonus. It was quite nice to return to a quiet area after a full days hectic sightseeing ! Plus you have the best view in Rome literally on your doorstep (so good that even tours stop off to see it). The only thing lacking in the area was restaurants, but we found we were staying out in the centre until at least 7pm so we had our evening meals there where there is an abundance of eateries. There was a bus stop a few metres from the hotel which took you directly into the centre of Rome. We bought a 3 day bus/train/tram pass for 11 euros but found nobody checked the ticket even once ! (not that I'm advocating not buying one !). The busses were frequent and the journey only took about 10-15 minutes. Even the bus drivers were extremely helpful. If you ask, they will let you know when you reach your destination, although it's better if you can learn the phrase in Italian as most don't speak English. We didn't find it a problem to get around at all. The 44 and 75 bus routes are the best for getting to and from the centre. Learning a smattering of Italian is a definite bonus as many people only speak a smattering of English and they definitely seem to appreciate your efforts (no matter how rubbish they are !). The breakfasts at the hotel were absolutely superb with a fine range of breads, cakes, pastries, fresh fruit and vegetables, yogurt, spreads, cheese, ham and of course fresh cappuccino (which you have to ask for incidentally). We ate so much at breakfast we didn't really need lunch ! The pool is the perfect antidote to the Roman heat and was mostly empty. We booked a taxi to the airport on the last day which, although expensive at 55 euros, was very comfortable and made for a stress free end to the holiday. I would definitely recommend this hotel and will be staying there again next time I visit Rome. I think it's extremely good value for a city hotel with a pool. The only thing I would say is take some ear plugs - the walls are paper thin and you can hear everything that's going on !", "Date": "September 3, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Chicago, IL", "Title": "“Not What It Appears To Be”", "Author": "Scott&Stacey", "ReviewID": "UR5325568", "Content": "We would not recommend this hotel, especially for first time visitors to Rome. Here are our reasons: 1)The hotel is located at a very busy intersection; walking around it is very difficult and potentially dangerous due to the bliind corners. 2) It is too far away from the major sights. We were told that we were a 10 minute walk to Trastevere and a 15 minute walk to the Vatican Museum. It took about 20 minutes to get to the part of Trastevere where there were a significant number of restaurants and shops. The Vatican Museum would have taken about an hour along some very busy roads (with little or no sidewalk) that cross back on each other as they wind down the hill. For the Vatican, it's not so much the distance but the busy street and the lack of sidewalk that would make the walk unpleasant. Also, the walk down -- and back up -- the hill is very steep. Some guests were having trouble with it, so unless you're in good shape or plan to take taxis, this is really not a good choice. 3)The hotel contracts with at least one taxi service that starts billing you from the time the hotel calls them, which adds about 5 euros to your total bill. 4)The front desk staff reception was poor, with no introduction to the hotel, information about breakfast time and location, etc. 5) As of June 2006, there was no food service at the hotel (other than breakfast) and the rooftop garden/bar was deserted -- no furniture, etc.... 6) There were very few people at the hotel. It had an odd, deserted sort of feel. We would not stay here again, and after this stay decided that it's better to pay a bit more to be closer to the city so that you can enjoy evening strolls through lively piazzas and walk by the beautiful floodlit monuments of Rome.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Very Nice Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4247704", "Content": "We very much enjoyed our stay here. Bedroom and bathroom were a bit on the smaller side but very clean and nicely decorated. Note to all travelers: TAKE EARPLUGS! The walls were extremely thin, to the point where you could hear every move your neighbors made in their rooms (yes, I mean EVERY move...). Also, the hotel is located on a rather busy street and automobile noises could be easily heard until late into the night. There were not too many nice restaurants within walking distance, so you may want to plan accordingly with meals. However, a short (10 minute) walk on a busy street with no sidewalks will get you to a fabulous restaurant called Scarpone. We highly recommend this restaurant. There is a bus stop a short walk from the hotel which will get you anywhere you need to go in Rome. All in all, this hotel was wonderful - great breakfast, very helpful front desk staff, clean, and upscale. It is also set a bit away from the hustle and bustle of the city and so it was refreshing to escape back to the hotel after a long day of busy tourist spots. Enjoy!", "Date": "December 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“Enjoyable stay”", "Author": "Suntanqueen", "ReviewID": "UR3809694", "Content": "Stayed here for six nights with hubby-no kids very recently. The hotel, pool, corridors, public areas, breakfast room were absolutely, immaculately clean and well maintained. Some of the staff on reception I felt though were quite aloof and not very helpful at times when we were enquiring where a newsagent and small supermarket was. Perhaps they just wanted us to spend our money in the hotel! The room was tiny and only had a shower despite previous email requesting a bath. They may have changed it had I requested on arrival but we arrived past midnight and were too tired to do this. The breakfast was of a variety friuts, meats, cheese cereals juices etc, nicely presented and plenty of it. Fresh cappucinos etc were made at request and hot chocolate too. The gardens were well kept. The hotel is situated near the old wall near the Gianicolo Park. A long but scenic walk to the Vatican or Trastevere where the bars and restaurants are. On an afternoon rest we found out the walls are paper thin. You can hear EVERYTHING and they can hear YOU so bear this in mind. Would I stay again? Most definitely. a beautiful, traditional, old hotel that has been looked after with love.", "Date": "August 26, 2005"}], "HotelInfo": {"Name": "Grand Hotel del Gianicolo", "HotelURL": "/ShowUserReviews-g187791-d529816-Reviews-Grand_Hotel_del_Gianicolo-Rome_Lazio.html", "Price": "$154 - $435*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via delle Mura Gianicolensi 107</span>, <span class=\"locality\"><span property=\"v:postal-code\">00152</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529816", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/ca/88/08/grand-hotel-del-gianicolo.jpg"}}