{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Slidell, Louisiana, United States", "Title": "“Pleasant Stay”", "Author": "Michael M", "ReviewID": "UR127319300", "Content": "The real gem of this hotel is the elderly couple who own it. Very charismatic, very helpful (even though they do not speak English, they at least try!). Breakfast every morning consisted of salami, ham, cheese, breads, orange juice and coffee. The rooms and bathrooms were clean. Very close walk to the subway station (5 minutes) and the Colosseum (15 minutes). Neighborhood a little sketchy looking, but no problems. Great gelato place right around the corner, too!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Average”", "Author": "Debby C", "ReviewID": "UR127143810", "Content": "I feel so itchy of my body for the first night of stay in this hotel. But the later two nights were fine. Properly there is bed bugs in mattress. The hotel looks like its over 10 years old. Staffs are nice. But I think its overpriced.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Friendly hotel in the heart of Rome”", "Author": "MariaBudapest", "ReviewID": "UR124219972", "Content": "Now that Rome was paralysed for 3 days due to extreme weather conditions, (snow,) we really apriciated that there are beautiful attractions and working metro stations in walking distance. I can only repeat that the rooms are small but clean, and the owners are very-very helpful. This is a perfect hotel for visiting this city! Also very good for practicing my italian, because the owner, like the majority of the italians, speaks only very basic english. (Try with french, if you can.)", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haliburton", "Title": "“Friendly and Comfortable”", "Author": "LokiFreya", "ReviewID": "UR121142467", "Content": "My partner and I stayed here for 2 weeks and had a great time. As other reviews have said, this is a basic hotel (small rooms, basic furnishing, no elevator) but the bed was comfortable, the room clean and the owners very friendly. Unlike some other small hotels like this, the owners don't try to skimp on the small things (good quality toilet paper, 2 bath sheets each, as much food at breakfast as you want and so on). Breakfast was very generous by Italian standards as it included cheese, salami and ham. There was Hero jam, Nutella and generous amounts of butter and most days we could help ourselves from a bowl of fresh fruit. I didn't find the neighbourhood at all unsavoury. Via Bixio is a quiet street with little traffic though pedestrian traffic (with talking) starts early. It's about a 15 walk to the Coliseum and only 2 blocks from the Metro, so the location is good. If you stay here, 2 things to know. One is that if you arrive at Termini Station (the airport train arrives here), take the Giovanni Giolitti exit which is right where the airport train arrives and you'll save yourself a lot of walking. And the 810 bus from right outside the Manzoni Metro station (2 blocks) takes you right to the centre of things past the Coloseum and Forum to Piazza Venezia.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Good location, basic hotel”", "Author": "Bone007", "ReviewID": "UR118957750", "Content": "The location is good since it is close to some of the major attractions and public transport is easily accessible. The room was small but clean. The bathrooms are tiny and a bit run down. For Italian standards the breakfast was OK. The owners are friendly and helpful. But beware that they do not speak English, so conversations can be a bit difficult.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“True Italian Family Hotel”", "Author": "OnTourMrsJ", "ReviewID": "UR118563939", "Content": "A warm welcome awaits you at this hotel which is run by a lovely family. We stayed one night having been through a bad experience in another hotel up the road (ConteVerde) Rooms clean, en-suite, towels provided, free wi-fi and a superb breakfast. Using google translate helps to communicate if Italian isn't your first language!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great family feeling, very friendly owners”", "Author": "raquel123london", "ReviewID": "UR108831967", "Content": "I stayed at this hotel during the easter break in 2011 and I thoroughly recommend it. The rooms were clean (if basic) and the couple who own it and run it were very friendly and helpful. The continental breakfast was also very good.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“It is like our Italian home”", "Author": "musenews", "ReviewID": "UR87806948", "Content": "I would strongly recomend this Hotel and I have to my friends and they have loved it like I do. The family that runs the hotel are wonderful, warm people. They make you feel at home and are always there to help out. The location is nice, close to many sights and in the authentic part of Roma. There is a wonderful coffee shop right next door to the hotel with a beautiful patio. It is very close to the most famous Gilato, Ice Cream, shops in Roma, Fassi!! There are many wonderful and authentic places to eat near by. One of them is Cavallino Bianco, delicious!!", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greeley, Colorado", "Title": "“Hotel Lussemburgo: A Hidden Gem”", "Author": "moomuse", "ReviewID": "UR87099825", "Content": "If you are looking for a special little hotel to stay when in Rome I choose the Hotel Lussemburgo every time. The big part of its unique charm lies in the fact that it is a family run Hotel. Run by owners; Carlo, Lucia, their son Massimiliano, and daughter Margareta. They are very professional and work hard to make sure your stay is pleasant and enjoyable. The rooms are very clean and well maintained. Other hotels may offer better locations and more amenities, but the service and warmth of the staff creates an atmosphere that will leave you feeling at the end of your stay as if you are a member of the family. For example: When my friend became ill, Lucia brought her some juice and bread to her room which helped her a great deal. Its very difficult to get personal attention like that in bigger hotels. Along with a great staff the hotels location is within walking distance to the train station, shopping areas, tourist sites, and many wonderful restaurants that feature typical Roman cuisine. I have been to Rome many times and I will not even consider another hotel. Hotel Lussemburgo really is a hidden gem.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Value for money, excellent location, tidy, most amicable staff”", "Author": "helen_tubelis", "ReviewID": "UR86735209", "Content": "We liked the hotel very much because the location is a walking distance to Santa Maggiore and centre (10-15 min), econimical price, good for value, rooms small but neat and tidy with private shower facilities, TV inside the room, most amicable staff and very helpful. Excellent breakfasts. My friend and I would definately recommend it for tourists. We felt like home here and are going to choose this hotel during our next visit. Elena and Natalie from Riga", "Date": "November 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“The worst value hotel I've ever stayed in.”", "Author": "siamog", "ReviewID": "UR67505510", "Content": "Don't stay here. Please. Just don't. Even if you think you've searched for another cheap, central option in Rome and come up with nothing, I urge you to look again because I can guarantee you that this is the most miserable, disappointing hotel you'll ever have had the misfortune to shell out for. Just a few of the pleasures you can look forward to are a breakfast of stale 'croissants' and radioactive looking 'fruit juice', and the luxury of being woken up nice and early by the elderly owner literally shouting greetings to her guests in lively Italian. Welcome to your relaxing stay in Rome. The only good thing I have to say about it was that the rooms were clean and the owner's son? grandson? was helpful. The main issue I have is that, for 90 euro a night, I expected at least hot water and the double bed that we had booked. We got neither. At the very least I wouldn't have anticipated the raging rant that we were subject to from the owner when we complained at the lack of hot water and suggested a reduction in our rate. Apparently we were the first people to complain since 1976. The more fools the rest of you, is all I can say.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Arusha, Tanzania", "Title": "“Great place for the low budget traveller!”", "Author": "Chezwawa", "ReviewID": "UR58259528", "Content": "The location was very ideal for me since it was close to some of the major attractions and easily accessible. The service at the hotel was good, room was clean and the owners were friendly and helpful. The fact that they did not speak much English prevented much discussion but they went out of their way to make my stay comfortable. Breakfast was sparse and I couldn't access the wifi connection but there are a number of internet cafes and places to eat close to the hotel that one can use. The hotel is good value for the amount they charge so don't expect any luxury or trimmings. This is just basic accommodation and it suited me fine as I spent my time sight seeing and not sleeping in the hotel.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "xxx", "Title": "“do not go there”", "Author": "anonxxx", "ReviewID": "UR55793915", "Content": "the lady refuses to talk english; very basic rooms and breakfast; not friendly", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Brasil", "Title": "“Signora Lucia - an incredible woman”", "Author": "ioga", "ReviewID": "UR51550794", "Content": "We traveled to Italy last November 2009. After a research here, I chose Lussemburgo for our stay in Rome. The best thing of this hotel is the owner called Lucia. She is very much lovable, gentle and worried about our needs. Everytime she tried to help in spite of not speaking English. Signora Lucia, we miss you very much, we had a real nice stay at your hotel. Unfortunately, we were stolen inside the Alta Velocità. I remember that day when you warned about the suitcases, when we were leaving to the station. A pickpocket took my wallet...Anyway, grazie mille! Roberto and Débora (Brasile)", "Date": "December 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Montreal", "Title": "“Best value for your money”", "Author": "boomboompowww", "ReviewID": "UR38907694", "Content": "As other reviews have noted, the lady who runs the hotel (Lucia) speaks almost no english but she is super sweet and is always around to help with whatever you need. The rooms are not big, but they are very clean and you cannot beat the value for money (We paid 50 euros/night for a double with private bath and much needed A/C - it was over 40 celsius in august!). Breakfast was included and was pretty basic (rolls, jam, nutella, coffee, juice)... it is perfectly fine though and saves you the trouble of finding a cafe every morning. The location is perfect if you are coming in by train since it is walking distance from Termini. Easy access to the rest of rome by metro and bus. I would stay here again in a heartbeat.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Wales", "Title": "“Helpful information”", "Author": "Llandudoch", "ReviewID": "UR30957993", "Content": "Read all the reviews before booking about this hotel. Bus goes from the airport(Campiano) to the termini every 20 minutes, terravision bus outside the airport 8 euros return. Hotel is 5 minute walk from the termini. Rome pass available trom platform 24 (tourist information point). Then just outside the door a couple of blocks. Area is a little unkept compared to central rome. Room was clean and bathroom was small with shower, toilet and sink. No tea/coffee facilities in the room . Breakfast was nice and plenty of choice bread/cake/ OJ/coffee/ fruit & selection of jams. Very friendly owners. Good nights sleep every night as A/C and double glazing. Metro was a short walk 5 min and a choice of 2. Nice pizza & friendly staff in boncaff Bar near metro/park.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hernando, Florida", "Title": "“A Secret Little Bargain Gem”", "Author": "bmdlover", "ReviewID": "UR15150111", "Content": "I stumbled upon this little hotel that is what it is - a safe, clean, basic hotel of 9 rooms located in a convenient non-touristy part of town. It is run by a family who takes special care of you, from the moment you arrive. Neither speaks English, but they communicate very well. Their son speaks many languages, and conducts much of the business part, offering assistance even before you get there. Each morning you are greeted by breakfast in the lower level common room. You have a rolls, a slice of cheese, slice of salumi, butter, jams, a small sweet roll if you wish, and freshly made coffee and steamed milk. Mama holds court, and seats you with people who speak your language if possible. Nice start to the day. If you ask about a certain site, you'll get a map with drawn directions, including bus or tram numbers. You are equidistant between Vittorio Emanuele and Manzoni stops on the metro, just a 4 minute ride from Termini. It is described to be in the Termini area, and I guess it is, but not close to the main entrance. It's within walking distance to the Colloseum, San Giovanni Laterno, and really near all kinds of transportation. My room was small and spartan, but I had all I needed, including a TV with local channels. I had a private bath, dresser, closet, phone, and a place for luggage. I also had the only room with a small balcony which was nice to keep wine and soda on in Feb. The rooms are cleaned every day, and the sheets were clean and crisp. If you are of the school that believes you spend most of your time in your room with your eyes closed, this is place could be for you. I booked first on Venere.com, then found a better price on Priceline. Finally, the best price was on their website, and they promptly verified that rate by email. The only caution is that you should check the floor you are on. The building has three rooms on each of three floors, and you should be in good shape if you have a top floor room (and don't forget anything you have to go back for). Over breakfast conversation, other guests and I noted the neighborhood looks dicier than it actually is. I walked around the area on my own every evening, and had absolutely no problems. It is an area in change, and now many asian stores and signs. It is very close to the Vittorio Emanuele market, which has moved from the park to 2 covered buildings a block away. Talk about a trip around the world! As you leave the hotel, you turn in your heavy key and fob, and you get it back when you return and ring the bell. And what a treat I had every night, taking the metro to Vittorio Emanuele stop and on the way back finding the famous gelateria \"Fassi\" literally right around the corner from home! The gelato is great, and try the truffle! \"Papa\" usually has night duty, and when opening the door for me was concerned when he did not see the usual cone (and it wasn't Monday, when Fassi is closed). I pulled the cup of truffle from my bag, and all was right with the world.", "Date": "April 19, 2008"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Germany", "Title": "“Feels like home”", "Author": "ccro", "ReviewID": "UR4359650", "Content": "My husband and I thoroughly enjoyed our stay at the Lussemburgo. The family that owns the hotel is wonderful. So very kind, friendly and inviting. The son was very helpful and speaks very good English. The mom and dad speak very little, but are still able to communicate and get the point across. The son gave us a map to the city and circled all of the wonderful places to see, which also included an explanation on the best and easiest way to get there. We brought the incorrect adapter for the plugs, and the family provided us with the right one. They went out of their way to make sure our stay was a good one. Check out was at 11 am, and our flight didn't leave until 10 pm that night. It was not a problem for us to keep our luggage in the lobby. They even made sure it was taken care of while we were out. The rooms are small and basic, but that is to be expected when traveling in Europe. We didn't travel to Rome to stay inside all day anyway, so the rooms were just fine for us. The hotel does not have a lift, but 3 flights of stairs get you to the top. The location is great. A 15 minute walk gets you to the Colosseum and surrounding monuments. You are about two blocks away from the Line A Metro stop and about a 10-15 minute walk from the main train station, Termini. If you take line A from Termini to Manzoni, it's easier on the feet to get to the hotel. Overall, Rome was fantastic and our stay couldn't have been any better. We truly believe that our trip was so great partly due to the fact that we felt as if we had been invited to stay in someone's home. We weren't worried one bit about anything being stolen and felt very safe. We're already planning to go back Summer 2006 and will definitely being staying at the Lussemburgo!", "Date": "January 18, 2006"}], "HotelInfo": {"Name": "Hotel Lussemburgo", "HotelURL": "/ShowUserReviews-g187791-d529837-Reviews-Hotel_Lussemburgo-Rome_Lazio.html", "Price": "$53 - $145*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Bixio 70</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529837", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/00/68/0068d6495d7c40425bcfda3e76988a0b1large.jpg"}}