{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“You get what you pay for”", "Author": "Therese P", "ReviewID": "UR128315520", "Content": "If all you are after is breakfast and somewhere to sleep, then this is fine. If you are given the keys to room 9 or 10, give them straight back. Not only are both rooms literally at the bottom of a busy stairwell, they are very close to the reception and dining areas and so cop a lot of noise at all times of the night and early morning. Room 9 didn't have a shower door/curtain and neither did it have a bathroom door, which made for a very cold shower. Great proximity to Termini where you can access the Rome underground. However, some unlikeable characters lurk in this area. Some cheap and decent eateries in the immediate area also. The staff are friendly and helpful. All the rooms are clean. Breakfast is substantial. Wi-Fi can only be used by four people at once and can only be used in the reception area.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Victoria, Australia", "Title": "“How Good Is Hotel Luciani”", "Author": "Adi K", "ReviewID": "UR127863534", "Content": "I think that if you go to Romeand you will be using a hotel just for the sleep and breakfast or something like that you should pay extra just because you want to stay in a 5 starhotel you can just go to Hotel Luciani because it is really cheap and it is what you need because you are not going to be staying in your hotel the whole day and i think it is one of the best hotels to stay in if your will be here for a few days and it is also cheap.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Absolutely Repulsive.”", "Author": "Miranda B", "ReviewID": "UR127133638", "Content": "I wouldn't recommend going to this hotel even to someone i hated, it's just awful. The rooms are small, the shower doors are literally hanging off and the views are just vile. I mean, who wants to look at some disgusting buildings right outside their window with people hanging out and shouting rude things at you? The location isn't great, the only good thing is that it's near the station so you can easily escape that horrible hotel. The service is very poor, the manager is aggressive and to put it in one word, stupid. I didn't enjoy staying here one bit and the men that you see hanging around outside the hotel are perverted, they'll literally follow you back to your hotel room. They did have televisions, but the employees of the hotel refused to give anyone the controls to work them. To anyone who is considering staying at this hotel, don't. Save your money and find somewhere better, this hotel is really something else.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Plumpton, null, United Kingdom", "Title": "“Wouldn't reccomend it.”", "Author": "Lorlei M", "ReviewID": "UR126726513", "Content": "This hotel is something else, it's such a shocking place i couldn't find it in me to reccomend it to anyone wether thats couples, families of students. I stayed here for two nights with 35+ college friends for the second half of our rome and sorrento trip. The hotel really didn;'t provide as bits of the hotel were broken, door frames and shower doors were hanging off. We had to go down to recdeption to get the locks for our bathroom. There was a tv but reception didnt even provide remote controls, the whole hotel was dirty and small considering ther was alot of us. Students were shocked and upset at the rooms they'd been alocated with and some room mates had to move rooms about 4 times. The location of the hotel is very bad as its in an area swormed by men that won't hesistate to not follow you back to the hotel however it was very near the train station. The most shocking thing is that staff of the hotel stole off people when we were on a dsay out. Money, purses, Ipods had gone missing and cctv showed maids were the only ones who had entered the room, When complaints were made about this the hotel manager reccomended we keep stuff in the safes in our rooms, only to find iouyt safes were broken or not even there! Worst hotel experience EVER.", "Date": "March 27, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "uk", "Title": "“shocking”", "Author": "ella c", "ReviewID": "UR126726373", "Content": "i stayed in this hotel with a big group of students as a college trip and its by far the worst hotel i've ever stayed in. The showers were cold, the shower doors were falling off, we had to ask for towels when we got towels they were like table cloths and purses and money and ipods were stolen from the rooms when we were out, the only people that had access to the rooms was the cleaners, when we told the manager he said theres nothing he can do about it.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“On behalf of 6 young ladies..”", "Author": "asli o", "ReviewID": "UR124778972", "Content": "I would seriously recommend you to take this review seriously. I went with my sisters and cousins and we had the best hotel experience we could dream of in this hotel. the location is absolutely amazing, as everyone has kindly noted. we stayed in the dependance rooms which is literally 1 minute away from the main building and the rooms were spotless tidy, comfortable and extremely cosy. we felt safe, welcomed and like in our own rooms. termini station is when the 2 train lines in Rome intercept so that really helped and you should definitely use the train to travel as it’s only €4 for a day travel card. anyway, the hotel was very good and the workers were helpful. The breakfast was reasonable but I don’t usually like city hotel's breakfast. the rooms are very hygienic, no carpet. although our room was looking out to a mildly busy road, we heard nothing because the windows are double glazing. the rooms are warm and hot water is available without a problem. you want some bad points? well here it is: few large areas didn’t receive wi-fi connection in the room, that’s it! it’s cheap, convenient, clean, welcoming. Go for it!", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, NC", "Title": "“Great Location”", "Author": "eurotraveler_7", "ReviewID": "UR124471649", "Content": "If you are looking for a convenient location, this is it. Conveniently located just steps from the Central Termini in Rome, this small hotel provided a comfortable room compimented with breakfast. Room adequately sized, spacious bath, too. This is not a luxury property, but rather a convenient place to spend time when not touring Rome. The address may not look impressive, but staff makes up for any doubts you may have as they could not be more courteous and helpful. Well priced, clean facility located the the perfect hub for seeing the sights of Rome. Highly recommended. The only negative is the hot water for shower could be a few degrees warmer. Otherwise, this property is a real bargain for travelers.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“staff recomendation”", "Author": "dennis o", "ReviewID": "UR122914219", "Content": "i and my family check in into the hotel the 4/1/2012 and we are well attended by miss veronica she was so excellent in her duty the hotel genarally is great we like our stay and we will be back again...... BY THE DENNIS OGENYI", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Clean, good staff and great location”", "Author": "The-G-of-K", "ReviewID": "UR121122410", "Content": "The hotel is in a great location right opposite the Terrmine train station, with lots of lovely restaurants around and within walking distance of all the main attractions. I booked a single room which turned out to be tiny but i didnt mind as i was on my own. The room was spotless and was cleaned every day. They provide towels, hairdryer and a tv. The staff were lovely. I found them to be very helpful and friendly. I would definitely go back there again if i was on my own but for couples looking for a romatic, fancy hotel you might wana pay a bit extra and go else where but for anyone else I'd defo give it a go.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Location”", "Author": "papajoeNV", "ReviewID": "UR118753357", "Content": "Hotel Luciani is conveniently across the street from the Termini train station and a block from the bus station. Staff was very friendly and helpful and the room was kept spotless. The bathroom was so small you had to have one foot in the shower while sitting on the throne. The bed was very comfortable and the air conditioning worked well. Breakfast consisted of buns, sliced ham and cheese; danishes, cereal; coffee and juices. Quite adequate to get the day started. A two star rating is about right but it is a good budget hotel.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Very clean hotel”", "Author": "l_i_v_i_a_0_4", "ReviewID": "UR118653476", "Content": "I stayed at this hotel on a single room for 2 nights. The room was very small (ok for a single person) but everything was very clean. The stuff was nice and friendly, the breakfast room- pleasant. Also, an importing thing is that the hotel is near the Termini Station.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Listowel, Ontario, Canada", "Title": "“Fortunate to Get it.”", "Author": "army1942", "ReviewID": "UR118260436", "Content": "We were switched from Hotel Vienesse (sp?) and were glad of it. Our room (#10) was near the stairs, so a bit on the noisy side. However, room and sheets were clean. We also had a smaller bathroom because of the stairs, but again, clean! Good breakfast and friendly staff. A minute to Termini which was a great bonus. Would stay again. Oh, and internet available for 5 euros for as long as you are there.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "malta", "Title": "“Pleasant stay”", "Author": "chuckMalta", "ReviewID": "UR115979043", "Content": "Hotel staff persons are marvelous, friendly and always willing to help guest. Room attendants do a great job. Breakfast area clean and hotel clean troughout. Good value for money. Position very near to the station, buses, metro and trains- just opposite. Thanks guys for making our holiday a pleasant one. If you stay at this hotel ask the staff for a good restaurant nearby. The one they recomended was the best- others we found ourselves weren't so honest and even charge for the table.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Excellent stay!”", "Author": "mouni99", "ReviewID": "UR115854892", "Content": "The location was very close to Termini station, which is very convenient. The hotel staff were very friendly and very helpful. They got security camera, which made us feel safe. We got a five-people room and the room was very roomy and very clean. The bathroom was clean as well. If I had to complain about one thing, it would be the insulation of the rooms (it wasn't very soundproofed). However, our stay didn't really get affected by that.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tralee Co Kerry Ireland", "Title": "“We will return for more of their efficiency”", "Author": "weebob1000", "ReviewID": "UR115321071", "Content": "We have stayed at The Luciani twice but this time deserves special mention. On both our stays we had comfort and excellent courtesy but, this July, quite by accident, my wife and I failed to collect our passports as we checked-out. Realising this as we were on the bus to the airport, we telephoned the receptionist and, without delay, she called a taxi and had the passports delivered to the airport. We made our flight, thanks to the efficiency of the reception staff. Well done Luciani....we will certainly be back. Robert and Margaret Whelan, Tralee, Co Kerry, Ireland", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Queensland Australia", "Title": "“The best staff ever”", "Author": "j0yt", "ReviewID": "UR111351937", "Content": "Off all the hotels we stayed in during our stay in Italy, the Hotel Luciani was the most memorable. Although the room was small, we found that after putting in a full day oif exploring Rome, the bed was a very welcome site, and we didnt care about the fact that we did not have a lol of extra space surrounding us. The staff were ever so helpful and pleasant, and they went out of their way to explain and help us with any need we may have had.. The location was excellent. We found that we had no trouble accessing all the prominent historical sites by foot and should we have needed to take a bus or train we were only around the corner to do so..", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Safe/Clean/Excellent location/polite and so kind staff”", "Author": "Ramy1979", "ReviewID": "UR108738301", "Content": "I spent a good days in Luciani hotel after so bad days in another neighbour hotel to it . staff welcoming people well; Very helpful; always smiling including a so kind owner. They have a good spaces in their rooms; Nice/hot and most important clean breakfast. It's so quiet They have free internet you can use any time with no restrictions I like it and so my wife", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Ideal for a stay in Rome, also with a group”", "Author": "Anne3161", "ReviewID": "UR108651091", "Content": "This hotel is situated at an ideal location in the vicinity of Termini with bus, metro, train and shops at a 2 minutes walk. The rooms, you get for a very reasonable price, are clean, the beds are good. The service and friendliness of the staff can't be better. It is a safe place to be, also suitable for traveling with more than one or two people. There is a excellent breakfast buffet. You can make use of WI-FI in the lobby of the hotel for a small price.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“This place is GREAT! Affordable rates, friendly staff, perfect location and all the comforts of home.”", "Author": "JustinTPerry", "ReviewID": "UR107883078", "Content": "Before booking my trip to Rome, I researched tons of different hotels, looking for one that was centrally located to all of the sites, reasonably priced, and had all of the accommodations a traveler today would come to expect. I decided to book my stay at the Hotel Luciani, and can say that this decision turned out better than I could have ever expected. Upon arriving at the hotel, I was greeted by the staff, and they helped me cart my overwhelming amount of luggage to my room. Then they proceeded to ask what my interest were while staying in Rome, and helped me perfect my itinerary to get the most out of my stay. As for the accommodations, I had everything I needed and more. The rooms was spotless, and apparently they recently renovated the location, so everything had a fresh clean appearance. A hearty breakfast was provided each morning, with complimentary Italian pastries, deli choices, fruits, and juices. And internet access and laundry services were all easily accessible. The location was perfect, literally right across the street from Termini station, with all the major sites within walking distance. So when your legs get tired, you have convenient access to the bus station and Metro subway. If you are a traveler looking to get the most out of your stay in Rome, while not having to spend a fortune to do it, I highly recommend this place. You will not regret your stay at the Hotel Luciani.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bandar Seri Begawan, Brunei Darussalam", "Title": "“Dingy room, hotel just beside the termini”", "Author": "TheShoppelifter", "ReviewID": "UR104018536", "Content": "Took the aeroport bus to the Termini and found the hotel easy. First, there were a lot of youths sitting and lying on the floor of the 2 or 3 steps entrance of the old building that looks like a tenement to me. Went up the 2 flight of stairs. The asian staff were friendly, though there's a lady who I've heard wants to cancel her reservation talking to the receptionist. I immediately got my key to the room before I hear discouraging stuff, it's on the second floor by stairs. The corridor was clean and then the room - very small as in really small maybe 2 meters X 2.5 meters or less, juz enough to fit in a single bed and a cabinet. The tv up on the wall, below it is a small table and a chair juz at the back of the door. The small toilet/shower inside the room is connected without door nor curtain so everytime I sleep I could see it from my bed. And if I take a shower I have to be extra careful that the water may not spill all over the room. Fixtures are somewhat old-style or juz old. The room has a window overlooking the inside of the building laundry hanging from some windows, unpleasant view so it's better to close the curtains. IIn fairness, the nice asian staff at the hotel are super friendly and tried hard to make the place clean and pleasant. Though coming from other european cities and stayed at budget hotels - this is by far the worst and the most expensive, ok the hotel that I've stayed in Amsterdam is EUR5 more expensive than this one, BUT that one was a 000 miles better, in fact I love that place. Plus I've got feasted by mosquitoes prompting me to choose between moving to another hotel and forget about the non-refundable prepayment and spend some more on another? OR my wiser decision since I only have 1 night left in the city - bought a body spray mosquito repellant that I never stopped spraying every 2 hours waking up. The room rate was EUR50/night including a small breakfast, booked through Booking.com I think this is how it goes in this area - an amazing place that makes up for the expensive accommodation. Will I recommend Luciani Hotel? For the location yes, for the room NO. For a night Yes if no choice, more NO. For the facilities NO - for the extra-caring staff YES. Overall - up to you after reading the above.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Maine", "Title": "“location close to Termini is its main draw”", "Author": "lets_go_ME", "ReviewID": "UR101924830", "Content": "We booked this hotel for one night back in Rome before flying out early the next morning. The location next to Termini is very convenient, but the neighborhood felt sketchy to me. Front desk staff were helpful. The triple room hardly had room for our bags - very tight quarters. Window opened onto a gray interior courtyard that was noisy from time to time. Halls smelled of cigarette smoke. There was an awful painting featuring a kitchen knife over the bed which contributed to my discomfort. (I know, that sounds really picky, but you didn't have to sleep under it.) I didn't sleep well, but my husband and daughter slept OK. The room was clean, but the reading lights next to the bed didn't work, which was inconvenient. Towels were thin. Wi-fi was available only in the common area near the front desk, and only if you pay 5 euro for 6 hrs of access. All in all-- if you want a place to sleep close to Termini, this is a basic, clean and safe hotel. For me, though, next time I'd pay a little extra for a place I felt more comfortable, and just get a cab to Termini in the morning. So my \"no\" recommendation could be a \"yes\" for certain travelers.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“What a dive”", "Author": "marklewis2011", "ReviewID": "UR98571581", "Content": "Breakfast inferior to prison standards; book guide warnings not to venture out after dark due to the dangerous location; staff helpfulness and friendliness making Basil Fawlty seem wonderful, kind and caring; no toilet seat no working shower; all in all a hole", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marstal, Denmark", "Title": "“Nice and central hotel”", "Author": "Pete0444", "ReviewID": "UR97897233", "Content": "Lovely hotel, located very centrally compared to Termini. Buses from the airport Ciampino (Terrabus) holds virtually at your doorstep. Central heating and towel warmer. New bathroom with shower, clean towels daily. More electrical outlets, (nice when you have more than just a mobile phone to be recharged) Have stayed at this hotel twice in two years. Sweet and friendly staff is always helpful to guide to the good places. Always made nice clean every day. Not very big room, but cheap compared to many others. Grocery store, pharmacy and an abundance of good Italian restaurants and cafes. I can definitely recommend the hotel to others who travel a lot with low budget. If I am going to Rome again I will not spend energy on finding hotel again - it is found ...", "Date": "February 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Slough, United Kingdom", "Title": "“hotel luciani rome excellent Vaule”", "Author": "Realandy008", "ReviewID": "UR88257933", "Content": "Hotel Luciani is in the heart of rome. very close to terni. the main train station in Rome.. Easy acess to the Metro. it a great loaction to be. you cant get lost!!.\"continental breakfast is included the price!! but the only thing this hotel does not have is if you want a hot drink!!. you do have good tv stations. like sports to guides in rome and music!! channels", "Date": "November 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cranberry Township, Pennsylvania", "Title": "“Great budget hotel with a fantastic location for sightseeing Rome!”", "Author": "Sroozib", "ReviewID": "UR71210827", "Content": "My wife and I visited here for a whirlwind two days in Rome during our month long tour of Italy. Let’s begin by saying this is a two-star hotel, and this review is written with that in mind. For a two-starrer it’s a great little hotel, our room had an in-suite bathroom, air conditioning ($5/night extra), and a TV. The location of the hotel is really good for visiting Rome, you’re right near the train and metro terminal, so it’s super easy to get to by train from all over Europe, and you are just 5 minutes’ walk from the local metro (underground) and bus hubs. Make sure you get a BIG ticket (Rome’s full access public transit pass), it makes it super easy to get around all of Rome’s public transport at a very reasonable price. The hotel offers breakfast, but we did not partake as we were out very early both mornings we were here in order to take full advantage of our time. There are a lot of good restaurants very close to the hotel, as well as hole-in-the-wall coffee shops and bars that are a gathering place for locals and tourists alike. The area around the terminal is home to a fair few of Rome’s homeless, but I felt very secure at the hotel as it is on the first (not ground level) and second floors of the building, and the reception desk is the ‘buffer’ between the entry and the rooms. All-in-all, a great little budget hotel for sightseeing in Rome!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nikity", "Title": "“Luciani made my trip even better!”", "Author": "Gramacho", "ReviewID": "UR60752414", "Content": "I had the best time at Hotel Luciani! It realy made my trip to Rome better than it already would be!!! It's a nice place, well located, very confortable, next to very good restaurants, cafés and delicatessens. The staff is awsome! If have some trouble, just talk to Danillo (the owner), that's right, the owner is right there to help you, or Raimond witch is the greatest italian-japanese man i've ever met! If you want to listen to some good music in Rome, talk to Raimond, he plays the keyboard and knows the best places in town! I hope to get back to Rome and also to Hotel Luciani!!! Thank you guys!!!!", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Excellent value for money”", "Author": "EssexDgt", "ReviewID": "UR56241445", "Content": "Four friends and I visited Rome for a weekend. We wanted single rooms. When I found the price for five single rooms for this hotel I thought there must have been a mistake, especially since they were all en suite and breakfast was included. You could not ask for better value for money than this hotel. The staff were friendly, rooms were clean and it couldn't have been more central, being virtually adjcaent to the main railway station.", "Date": "February 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "london", "Title": "“very friendly”", "Author": "voyagelove", "ReviewID": "UR54012997", "Content": "It's situatet very well, the reception was very friendly, open and helpfull!! Rooms were clean and spacious. It’s definitely a find!", "Date": "January 21, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Melbourne", "Title": "“Shickingly BAD!!”", "Author": "MMova", "ReviewID": "UR48083046", "Content": "I booked a room in hotel Luciani months ago via this site, when arrived the receptionist (who is also the owner and manager of the hotel) sent us to another accommodation, because the hotel Luciani, which photos are displayed here was overbooked. It seems these people book any one just to have money flowing. I wasn’t happy but the staff there-including the sister of the owner instead of assisting us started screaming at us refusing help or assistance at least to give us guidance to find another hotel. I and my mother after a day travelling with heavy suitcases had to walk the streets in search of a new hotel to stay-I never sow such unfriendly and bad customer service, this hotel must be shut down!!!", "Date": "October 29, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Wonderful experience!”", "Author": "ShenaG", "ReviewID": "UR46365030", "Content": "Staff very helpful in all cases! Location very convenient next to termini! Store on corner had cheap beer and other drinks! Get to breakfast early or there won't be room to sit! Very clean and you feel safe leaving your stuff in the room while out on the town!", "Date": "October 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Bremen", "Title": "“Worst hotel ever!!!”", "Author": "rsampe", "ReviewID": "UR36426289", "Content": "We found ourselves hosted in a quit expensive hotel for such low offered low value. The personnel was very rude and not reliable since the beginning when I called asking if they will charge me for air-conditioning telling me \"NO\" on the phone and wanting to charge me once we came there. They have quit low standard in they room, poor cleaning, very noisy, old and destroyed decoration, not useful staff and extremely poor breakfast. In our trip we stayed in cheaper but better hotels all along Europe (Paris, London, Prague, Vienna, Madrid, Amsterdam, and some more).", "Date": "August 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "HK", "Title": "“Good budget hotel”", "Author": "summerwoodhk", "ReviewID": "UR34674019", "Content": "I just finish my last stop at Rome. This is a budget hotel which stays within the expectation from what I paid. It is clean and safe. Staff is polite and helpful. Location is great. However, my double room is too small. hardly move around. Noisy at night becoz of road. And hot shower is not available early morning like 6am, but not informed. When I called during that time, staff hardly communicate with English. So, I deduct marks from service.", "Date": "July 13, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Shrewsbury", "Title": "“Excellent service in exceptional circumstances”", "Author": "petermShrewsbury", "ReviewID": "UR26020606", "Content": "We recently had a lovely weekend in Rome to celebrate my wife's 50th birthday. Just before leaving for the airport to return home we had a quick lunch at a restaurant near the Termini. When we arrived at the airport we discovered we had left our camera with the precious pictures of our stay at the restaurant. With no time to return to get it and without any idea of the name of the restaurant we flew home resigned to having lost the camera and, more importantly, the photos of a memorable stay. In desperation I sent emails to the hotels I could identify in the area, with a brief description of the restaurant. I even sent one to the main tourist information centre in Rome. Incredibly Raymond at Hotel Luciani recognised the description, contacted the restaurant owner for us to confirm they still had the camera and emailed back. He got the camera and stored it safely at the hotel for us. None of the other hotels even bothered to email us back to say that they couldn't help. It nice to think that these days someone would take the time and effort to help a complete stranger and we will always be grateful.", "Date": "March 11, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "HK", "Title": "“Collect extra $ for air-con services ----- dishonest!!!”", "Author": "yanyan8877", "ReviewID": "UR23306287", "Content": "When we book the room with email, they mentioned there will be air-con service(but didn't mention that it needs extra $). After we arrived, they said that air con is an extra service which need extra payment for Euro 5 for each person per day! It' s not really a lot of money but it's DISHONEST! It's too hot in August and finally we paid for it even we don't want to. All other services are OK!", "Date": "January 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“dont do it”", "Author": "eddieScotland", "ReviewID": "UR22717005", "Content": "My Husband and i had a really bad time during our stay at this hotel, Firstly on arrival to check in, the reception staff was looking at guns on the computer, not a nice welcoming, Our room was clean and very basic, the bed was extemelly hard, and the tv control didnt work, The washroom was a nightmare, the shower if you could call it a shower didnt have warm running water, and when flushing the toilet the pipes would make a horrific noise that lasted so long, everyone would have heard it in the building, We stayed for 2 nights and didnt get much sleep due to very noisy neighbours, and street life banging throughout the night and noise noise noise.... even throughout the daytime going back to the hotel room for a rest was impossible due to construction work next door it sounded like our wall was going to cave in, Overall a bad experience and i wouldnt recommend this hotel whatsoever,", "Date": "December 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“AWFUL”", "Author": "tlarg", "ReviewID": "UR21453242", "Content": "This was an awful experience. When my wife and I arrived,we had to climb up some steep stairs to the reception, upon when we were escorted out and down the road to an annex , to another buliding. This turned out to be where we were staying, couldnt see any fire exits or instructions in this dodgy building. Air conditioning was only available with a remote control which had an extra cost. Room had just enough space to swing a cat. Had to make a worthless journey for breakfast in the morning for some bread and coffee.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Upstate NY/Ontario", "Title": "“Avoid at all costs”", "Author": "nycnorth", "ReviewID": "UR19539888", "Content": "What you see in the pictures is NOT what you get. This was the worst hotel during our trip to Italy (we stayed at 4 different properties within the same price range). The place is dirty, run-down and incredibly noisy. The furniture is falling apart. The bathroom was 100% disgusting - you think twice before getting inside the shower because it is THAT bad. The hotel did seem to have a few remodelled rooms, but they didn't look much better than the rest of the rooms (we checked them out when the rooms were being \"cleaned\"). Breakfast included 1 stale roll and coffee or juice from a machine. That's it - no fruit, pastries or cold-cuts of any kind. Staff were incredibly rude. If you try to complain, they ARGUE with you and they restart the argument every time you happen to pass by. Something like this would be completely out of the question in any North American/German/Swiss, etc. hotel regardless of the price. Even though the place is adverized as air-conditioned, they charge you extra for the AC (if you agree to pay, you get a remote to your room's AC and there's no way to control the AC without the remote). This place is to be avoided at all costs - a stay at Luciani can spoil your whole vacation!", "Date": "August 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Holland", "Title": "“Fantastic Value and Service Hotel Luciani Rome”", "Author": "CarlK", "ReviewID": "UR18374971", "Content": "Stayed 4 nights, Thursday to Monday. The people at the desk, especially Veronica were fantastic to say the least. Hotel is very conveniently situated right next to the train and bus station. The area was no problem at all. The superior room included air conditioning which was necessary at this time of year (otherwise 10 euro a day!). Breakfast was very simple but a reasonable start to the day. Staff reliable, friendly and honest. The rooms were simple but comfortable for the price paid. It is NOT a rundown place with a few beds and chairs. I had the feeling that they wanted to please so that word of mouth would spread the news of a good place at a very reasonable price with a decent service, which is not the rip off that much of Rome is. Be sure to book ahead for some of the major sites like the Vatican Museum, Borghese Gallery and the Coloseum if you can. In Trastevere there are good meals to be had at reasonable prices. Go to the Piazza Sante Maria in Trastevere and walk upwards through the small alley about 50m to the right of the church. Dont eat or drink (a beer can be 8 euros!) in the square. Carry on for about 600m round a slight bend and then a turn to the left to Taverna della Scala (Piazza della Scala). A litre house wine 8 euros, a menu for 15 euros (4 courses with choices for the two main courses-good Italian cuisine and quality) and an excellent staff. Veronica at the hotel has excellent ideas for walks, visits and ideas of how to do things. There is internet access in the Hotel. Will definitely stay there again and recommend it with 5 stars as an overall fair priced and good package. Carl Koenig", "Date": "July 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“We had a fine stay!”", "Author": "Tracerr", "ReviewID": "UR18014894", "Content": "I was a little wary reading some of the other reviews for this hotel but when we got there we had a great experience. The staff was incredibly helpful. We arrived early and our room was not quite ready so we were offered a different one and it was just fine, we were ready to take a little nap after a long flight. We did pay for the air conditioning which was worth it! With the ceiling fan running at night and the shutters closed, we heard zero street noise. I read a review about stale rolls and they were not stale at all, they were warm out of the oven. This is just the kind of bread they serve in Europe, it’s like a baguette – it’s hard on the outside! The room itself was great for the price – the shower stall leaked on the floor a bit but it didn’t flood the bathroom or anything. I liked the tile floors and the room was very clean. We had to leave early in the morning to catch our flight back and they let us eat breakfast a little early which was nice. I had nothing but a good experience here, we felt safe and I would absolutely stay here the next time I am in Rome.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brewster, NY", "Title": "“Clean, Safe, and Very Convenient to all of Rome's Attractions”", "Author": "lsm3901", "ReviewID": "UR15485048", "Content": "We stayed at Hotel Luciani for almost a week in April 2008. It was a nice experience. Hotel Luciani staff is very personable and hospitable, and make their guests feel welcome. They serve a nice breakfast every morning. They have internet facilities in the lobby for guest's use. They are very helpful with advice, directions, and orientation in Rome. The location of the hotel is excellent in the city. They are only 1 1/2 block from Termini station, which gives you access to the Metro (and all of the tourist attractions), as well as the commuter and Eurostar trains to other Italian cities. Their are also several tourist buses that stop at Termini, so this is a plus. In addition, ther are many restaurants and convenience stores within a 3 block radius. Laundry facilities are just 3 blocks away, and the staff directed us to the laundry facility. There are many excellent restaurants right nearby. You can also go into Termini station, which contains many eating facilities, ATM, shopping, and a bookstore. I was able to make my connections to and from the airport, and to a day trip to Naples from Termini, which makes the Hotel Luciani an excellent location. In addition, my luggage was misplaced at the airport. The Hotel Luciani staff recovered my luggage when it was returned from the airline, and had it waiting for me in the lobby. I recommend them highly for convenience, location, cleanliness, safety, and friendly staff.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, Ma", "Title": "“service and comfort”", "Author": "gcayer", "ReviewID": "UR14213810", "Content": "My two high school age nephews and I stayed 4 days and it was a superior experience. The staff is extremely gracious and proactive about helping a visitor. Rooms were spacious, quiet, reasonably priced and convenient to the central rail station. Continental breakfast consisted of red orange juice cappucino cereals breads and selection of jams. Iternet acces was a big help planning our excursions. This was my 9th stay in Rome and the best hotel experience so far. I highly recommend to anyone.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Glendale", "Title": "“Run as fast as you can!”", "Author": "acdcdesigns", "ReviewID": "UR7927276", "Content": "We recently stayed at this hotel which was classified as a 3s, but when we got there the sign clearly stated 2s, bad classification by our tour company. We were staying only 1 night there and thank the Lord! We were spending 2 weeks in Italy and this was our first stop. We were 2 couples traveling with a total of 6 pieces of luggage and when we arrived at the hotel we were greeted with 2 flights of stairs and no elevator! After we dragged our luggage up the stairs we were greeted by a not so friendly staff. She gave us our room, which was #20, and it was up another flight of stairs with all the pieces of luggage. We booked a quad and once we opened the door we were surprised by 1 full bed, 1 twin and 1 bunk bed, very odd combination. Upon further investigation we notice that the room was dirty, the multi-colored floor hid most of the dirt but trust me it was there. The walls were white with various black marks all over them, the electric sockets were UNCOVERED which was a definite safety risk, and then there was the bathroom! The shower curtain was ripped, how much is a new shower curtain! And the ceiling in the bathroom was made out of some metal mesh material with a huge collection of dust bunnies on it. We all laughed and said to each other, it is only for one night! The only good thing about the room was the streets were clean and it was located directly across the street from the train station. It was rather hot that night so we noticed that there was an air conditioner, however there was no controller. We asked at the front desk and were told that there would be a $10.00 charge? How ever heard of such a thing? After we got the remote for the ac we went up and tried to watch some TV, but the TV didn't work and we didn't bother asking as that was probably another $10.00 charge. The next day we went down for our breakfast with consisted of Cafe, juice, for food there was croissants, hard toast w/Nutella and some cereal which looked like it had been in the serving jars for about a year. Upon check out we gave the front desk staff our key and never received a thank you or come again....don't worry we wont! Before we booked the hotel we did look at pictures on the internet,,,,not sure where the pictures were taken but definitely were not in room #20. There was another corridor of rooms that looked like they had been recently remodeled, but based on the front desk staff and the fact that there was no elevator and the cleanliness of our room I would not recommend staying at this hotel for any long period of time, you can take your chances with a 1 nighter but even that is questionable!", "Date": "June 18, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester", "Title": "“Very pleased, but be careful”", "Author": "HumanManchester", "ReviewID": "UR7827648", "Content": "We are in our fifties and were looking for a cheap few days in central Rome at the end of a longer tour of Italy. For a 2 Star hotel the room was excellent, very clean, air-conditioned and well serviced with a very comfortable bed. The window overlooked a quiet side-street . Service & front desk excellent. Breakfast was a narrow range - bread cake, butter, jam, coffee and two cereals, but for a 2 star it was fine. However, it also seems to double as a hostel for young travellers, with rooms having up to 4 put up beds and a bit of a squeeze. We did the same ourselves once but now do not want the inevitable noise late at night - which in fact we only got the last night when 4 very loud American lads had a loudest talker competition for an hour at 3.30. a.m. \" Lemme tell you... my mom...High School....laugh laugh very loud\" I would have very unhappy to have had that every night we were there, but it appeared that generally the young backpackers had been put together elsewhere. It might be said we should just pay for a 3 star, but no other 2 star hotels we have used in Rome have had this half and half identity, so it is something to be aware of. However, we enjoyed our stay greatly. Good eating nearby, Termini very near and the area is safe, bright and quiet.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Don´t go”", "Author": "kingvicen", "ReviewID": "UR6902713", "Content": "I wouldn´t go again to this hotel. When I arrived they sent me to other Hotel/Pension , I booked a single room with bathroom and TV , and they offer ed me a triple without bathroom and TV in this pension. I complained and they told me that it was saturday night and Rome is too busy so I should stay in this terrible room. Finally they gave a discount and I stayed. I spoke with the pension staff and the comfirmed me that they do this kind of thing very often. VERY BAD EXPERIENCE.", "Date": "March 3, 2007"}], "HotelInfo": {"Name": "Hotel Luciani", "HotelURL": "/ShowUserReviews-g187791-d529994-Reviews-Hotel_Luciani-Rome_Lazio.html", "Price": "$66 - $1,179*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Milazzo 8</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529994", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/af/fd/affd235a5576e05e99b3153950a9e73010large.jpg"}}