{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "NANTES/FRANCE", "Title": "“Quiet & confortable”", "Author": "PIERRE2NANTES", "ReviewID": "UR126951821", "Content": "This was my first stay in that hotel and I recommend it as it is located in a nice area with a lot of restaurant around. Even if it is not a touristic place in Paris, it is typical and chaming.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Slippery Rock, Pennsylvania", "Title": "“Mostly awesome, but a few things you should know”", "Author": "Gloria W", "ReviewID": "UR126407424", "Content": "Most people don't bottom line things here, so please allow us to do that for you: 1) Overall, this hotel is a pretty great deal. It's literally two blocks from two different subway stations, so getting into downtown Paris only takes 10 - 20 minutes. The hotel is very clean and well kept, the public kitchen area is very nice and cozy, the rooms are very clean and very well kept, and the staff was mostly helpful, except... 2) Most Americans like their privacy. We posted the \"Do not disturb\" sign on our door because when we like to be left alone and when we go out, we don't want someone in our room. If we want maid service, we'll call down for it. While we were away, they went into our room even with the DNDisturb sign posted on the door. We talked with the hotel Manager about it and he apologized and told us he'd talk to the staff, but he wouldn't give us any credit. I asked for even $20 to show good customer service and he refused. This lack of customer service is common throughout Europe, however, so fine, we pushed on. Just don't expect the kind of customer service you get in America. In Europe, they will provide you with something decent for a price, but the cost-value is not there as it is in the states and their concept of service is different than ours. 3) The hotel is actually in an alley that's kind of shotty looking, and they don't publicize that anywhere. When we first approached, we were expecting a disappointing hotel, as the area around it on the street is somewhat dirty and unfriendly. However, the hotel IS nice and clean. 4) If you're going to book, do it on-line and get one of their specials so you get a deal on the room. 5) The rooms are SMALL! Don't be fooled. They're cool, and they're cozy and they're well made, VERY quiet, etc., but they are very small. 6) Lastly, there seems to be a policy in Europe that people don't put top sheets on their beds. This is also something that was a real pain the butt, as most Americans sleep with a bottom sheet, a top sheet over them and then the comforter. They have just a bottom sheet and a comforter and that made sleeping a little hot and awkward sometimes. I recommend you travel with your own top sheet (seriously) if you're going to travel around Europe and stay in these cheaper hotels.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel, friendly staff, good location!”", "Author": "georginarachel", "ReviewID": "UR125928608", "Content": "Fred Hotel was just great! The room had nice modern decor, although the door to the bathroom was clear glass, but hey, you've seen one then you've seen them all! The bed was super comfy and I think the walls were soundproofed becuase there was no external noises at all which was fantastic. The staff were warm and friendly which is always nice! There was a safe in the room, and plenty of toiletries for the two of us. The hotel is located a couple minutes walk from two metro stops and so you can get to anywhere in Paris within five or ten minutes! We did not eat breakfast at the hotel but I'm sure it would have been great! The room was perfectly clean! We even checked out a few minutes late and they did not mind at all! There are also plenty of bars and restaurants in the streets surrounding the hotel. There is a temperature and air con system inside the room which was brilliant!!! I found the hotel on booking.com as \"deal of the the day\" although I would happily pay their full prices! A great stay! I would definitely go again!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Exceeds expectations”", "Author": "Nupuvon", "ReviewID": "UR125762538", "Content": "clean and chic at a nice and convenient location Freiendly staff. Good value in Paris", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Utrecht", "Title": "“perfect base for exploring the city”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR125268799", "Content": "We had a wonderful short break in Paris, thanks to Fred Hotel. It is a perfect base to explore the city, located in a lively but safe neighbourhood with great little restaurants and the Sunday famers' market just around the corner. Two metro stations close by make it very easy to go about and discover Paris. The hotel staff is very friendly and will do everything to make you feel at home. Next time we will bring the rest of the family!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Chic, chic, chic! Clean, modern, with a lovely staff - a super steal!”", "Author": "Alexis S", "ReviewID": "UR123438850", "Content": "Fantastic! Clean, modern, with a lovely staff - a super steal! The room was lovely -- cozy, fantastic color scheme. The hotel is well located -- 2 blocks to metro lines that takes you to all of the sights in under 20 minutes and the area is relaxed. We visited in January on a budget (and got the hotel for a steal 60 Euro per night!) but it is worth the double. During the same trip I stayed in hotels that were 3 times the price (and had an additional star) but were not nearly as charming, modern, or well-stafted as this one. The staff was so gracious about letting us use the dining area to have meals.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alcudia, Spain", "Title": "“what a find!”", "Author": "ESCLATA-SANG", "ReviewID": "UR121379744", "Content": "a modern, spotlessly clean hotel. Great decor and colour schemes. Reception staff who spoke perfect English and really cared about your welfare. what more could you want in a delightful area of Paris.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Very good surprise!”", "Author": "FredK1412", "ReviewID": "UR120898229", "Content": "I used to live in the street where the hotel is located and I knew it before it was refurbished. No doubt: this hotel is now at a very good level! The service was very nice and the hotel room, completely new, was very comfortable. The design of the hotel is very modern and I had the chance to have a Deluxe Room on the 6th floor. It was very quiet and there was a lot of space. My only regret was that it was a little bit cold in the bathroom but this is no big issue!", "Date": "November 22, 2011"}], "HotelInfo": {"Name": "Fred Hotel", "HotelURL": "/ShowUserReviews-g187147-d529916-Reviews-Fred_Hotel-Paris_Ile_de_France.html", "Price": "$165 - $267*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">11, avenue Villemain</span> | <span class=\"extended-address\">14th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75014</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "529916", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f7/78/ac/chambre-classique.jpg"}}