{"Reviews": [{"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Blackpool, United Kingdom", "Title": "“Disgusting pit! Do not stay.”", "Author": "ktboo09", "ReviewID": "UR114839938", "Content": "This hotel was the worst place I've ever stayed. What a filthy, disgusting place. The lampshades were hanging by wires, the shower was useless and the staff were rude. There are hundreds of hotels in Rome to choose from....do not make the mistake of picking this dive.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "usa", "Title": "“Centrally located, no-frills hotel for a good price.”", "Author": "wheninrome99", "ReviewID": "UR48600567", "Content": "If you're coming to Rome for the hotel room, you'll miss a whole lot of art and history. The room was clean, comfortable and located near many great sites and restaurants. The walls are somewhat thin and you can hear the sounds from Termini. The 24 hour front-desk staff could speak English which was helpful.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Ontario", "Title": "“worst hotel expereince”", "Author": "LianOntario", "ReviewID": "UR16468977", "Content": "Very very very dissapointed!!!! Did not have a big expectation on a 2 star hotel but this hotel was not even worth 1 star. Upon arrival, we are offered a tiny room that is dirty and with NO BATH. The reservation was with private bath and what we got was a faucet on top of the toilet. To use it, you almost have to sit on the toilet with water coming down washing yourself along with the whole toliet cover with water. With your feet touching the toliet and the bare floor, it better off not to shower. There is a timer switch for the light in the washroom to save energy. But with only 2 minute cycle time, you would need two person to operate the washroom. One person actually using it while the other person help resetting the light constantly. Asked reception to change the room, they advise there is no other room as the hotel was over booked and the person was unfriendly. The room was dirty with little ANTS. The area surrounding was unsafe, upon walking out of the lobby, got bothered by a drunk person. There are also many people who are drunk around the hotel. If it wasn't that being at night, I would have changed to a different hotel. It was the worst hotel expereince I ever had. The pictures from the website is not even close to the actual room we had. =(", "Date": "May 28, 2008"}], "HotelInfo": {"Name": "Hotel Ferrari", "HotelURL": "/ShowUserReviews-g187791-d529978-Reviews-Hotel_Ferrari-Rome_Lazio.html", "Price": "$79 - $264*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Giovanni Amendola 95</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "529978", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bc/45/bc45f27f38e0d207018be1303640332f1large.jpg"}}