{"Reviews": [{"Content": "Hotel Bijou is in a good location but... We booked the Bijou on the Internet and we liked the price, originally... The Hotel is one of two hotels at the same location and owned by the same persons. The Bijou is the cheap side, the Annabelle is the expensive side! However, breakfasts for all hotel guests are served in the same tiny coffee room - 4 tables squeezed in a small space. The owners speak very little English especially if you ask them for something, like how to operate the TV! What is your problem the man said when I asked him to come and fix the TV connection! Then he finally did come and quickly realized there was a problem... There was no apology for his rudeness, just a shrug! I would not recommend this hotel to anyone - there is a big attitude problem with the owners.", "Date": "Jan 4, 2009", "ReviewID": "UR549608653", "Ratings": {"Service": "1", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Denise227"}, {"Content": "Terrible Experience, service lacking We are experience travellers and booked this property solely on cost and location as we needed quick access to the rail termini for a 4 night stay in the Florence area. Location is poor for those who are looking for a quiet night鈥檚 sleep and recommended for a one night stay only. First night we stayed in room 9 and had a rude awakening when a significant amount of ceiling plaster fell from the ceiling. We were not injured and have the pictures to prove the significant damage. The night clerk was helpful and acted fast to move us to another room. Kudu鈥檚 to him, but the next morning the reception management staff shrugged their shoulders and said 鈥渋t鈥檚 an old building, things like this are rare鈥? No compensation for our inconvenience was offered, not even an optional 5 euro breakfast. Pitiful service what else is there to say! Next night we were woken by our neighbours who were checked in at 1am and decided to have late night showers till 3am in the morning. The place was run like a hostel than a hotel as the staff advised us on check-out that they were on commission when we hastily left the next morning a day early than expected. We noticed that room 9 was also rented out the next day and suspect nothing was done but a quick clean up. STAY AWAY!!", "Date": "Oct 11, 2008", "ReviewID": "UR318891708", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "irwanless"}, {"Content": "nice hotel at first i inquired it's sister hotel, Hotel Annabell, but they also quoted this hotel. I picked this hotel because of the price. we stayed there for 5 nights, a triple room and private bathroom (breakfast excluded). the location was excellent, just a 3 minute walk from the train station, so we didn't have to haul our luggage a long way. there was a lift in the building (thank god!!!).the hotel staff was nice but not too helpful. we tried to ask them to help us book the tickets to Uffizi but they couldn't help us. luckily the queue outside Uffizi wasn't too long the day we went. we tried to ask them for a map but they only had ONE map left at the reception.the room was spacious... but the A/C wasn't working properly so we were super hot at night (it was quite hot in June when we went). we asked for a hair dryer but the hotel staff told us they didn't have any. on our 2nd day when we got back to our room at night, we found that the towels weren't changed so we called the reception. we were told that the towels were changed every THREE days (OMG!!!). we were shocked and asked them to give us a few fresh towels and luckily they gave us a few. on the 3rd day (morning), we had no water for almost an hour so we couldn't shower.... this was due to some construction work nearby. overall, the hotel was OKAY, mostly because of the location. i would stay there again if i visih Florence again but hopefully the A/C and supply problem will be better.", "Date": "Jul 14, 2008", "ReviewID": "UR225184496", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "5"}, "Author": "potterh"}, {"Content": "Camere piccole, anguste, arredi...   showReview(18905112, 'full');", "Date": "Jul 7, 2008", "ReviewID": "UR253255671", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d529993-r23268380-Hotel_Bijou-Florence_Tuscany.html", "HotelID": "529993", "Price": "$89"}}