{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“A good hotel not far from the centre”", "Author": "Cardiff_reviewer", "ReviewID": "UR128316424", "Content": "We stayed here in March/April 2012 and found it to be a good hotel. The staff were polite and the in-hotel food was reasonably priced and of a good standard. We would suggest that for breafast you take the short 2 minute walk to the local Cafe as breakfast in the the hotel was 8 euros each compared to about 4 euros each at the local cafe. Great roof top pool. Overall the hotel was of a good standard, in a good location (10 minutes by metro to the centre and metro station 5 mins walk from hotel) and was great value. The only minor niggle I had was that there was no tea/coffee making facilities in the room and as a lover of tea in the morning this was a shame but didn't really mar what was otherwise a good experience.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham, England, United Kingdom", "Title": "“Amazing hotel 10/10 without a doubt”", "Author": "Lynch78", "ReviewID": "UR127874754", "Content": "ust returned back from a trip to Barcelona with my boyfriend, we stayed at the Tryp Condal Mar for 4 nights and we were blown away by this hotel. The room was spotless, modern and very stylish. The bed was very comfortable, we had a nice view, bath and shower was modern and again spotless, the staff were very friendly and helped us out with different places to go etc. Without a doubt this is the best hotel I have stopped in, it is good value for money and we are so glad we chose it. The area seemed a little bit out the way and took us a while to find on the first day however we soon realised there was a nearby tram stop by a shopping mall that takes you into the centre, the stop was a 5 min walk from the hotel. I can not see how people the negative feedback below is possible for this hotel, as I was amazed at how good it was. Definately recommend staying here, look no further.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Disappointing!”", "Author": "Jo C", "ReviewID": "UR127350316", "Content": "This is not a 4 star hotel and i would discourage people from staying here. Whilst the hotel was clean, i feel that is the only positive that i can pull from our recent stay. None of the staff were in any way helpful. The bar was never staffed and when you would go to reception to ask for someone to serve you they would often ignore you (without eye contact) or talk for an extended amount of time on the phone. The area is awful - further out of the city than inferred and in a dirty industrial area. I would certainly not walk through this area in the evening / night. There was no tea and coffee in the rooms - generally disappointing.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Hospitality out of the window”", "Author": "Palls08", "ReviewID": "UR127088551", "Content": "Just back from our holiday after staying in this hotel and frankly, after quite a bit of travel around the globe, this has been pretty awful experience. Having a 1 year old baby, we had requested for a kettle in our room. They refused to provide one and gave us a couple of kettle of luke warm water (which was added to our bill later). After trying to reason it out with the reception and room service, they said it is not there problem and they do not have any spare. Breakfast was good, but the replenishment was slow. Also, on the first night, when our baby woke up and cried for 10 mins, we had a moron next room, who started banging the wall wildly. When we complained to the reception, their answer was Hotel will not get involved, as he is also a guest like us !!!! Situated in a sort of run down industrial area, with no active help and guidance, I thought it was joke for this hotel to be graded as 4 star.. Never again.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Holthees", "Title": "“words of peace global”", "Author": "Hans K Posted by an Easytobook.com traveler", "ReviewID": "UR126078144", "Content": "We visited an event with Prem Rawat in the CCIB forum. Walking distance from the hotel. We were very pleased with the upgrade to a very nice room.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Modern and clean hotel with a remote location and average service”", "Author": "Suns33ker", "ReviewID": "UR125243319", "Content": "We chose this hotel for our 6-day winter break mostly because of the great offer by Solmelia to Mas card holders. We were also already familiar with the city so the location of the hotel was not a major thing for us because we didn’t need to go sightseeing that much. The hotel is very modern and clean throughout, both rooms and other facilities. On the basement they have a rather well-equipped fitness room and sauna which seemed to be very quiet at least during the day. The room is spacious enough for two with an adequate-sized bathroom which interestingly only has a light glass door (not see-through though) without any lock or sound-proof. Also beware of the probably very eco-friendly tap which spills water all around, mainly on the mirror. Despite the complaints of hard beds in some previous reviews, we found the beds very comfortable and firm enough for a good night’s sleep. Our room was located on the fifth floor with views to both Torre Agaba and Sagrada Familia, very small windows but it was a major advantage that you could open them because the room was very hot at times, probably no air conditioning working during winter. Soundproof between rooms and the corridor is terrible, luckily there were noisy neighbors chatting in the corridor only one night. We had a room only –deal but if you have a mas-card, you get 50% discount of the breakfast so we had that every morning. The breakfast buffet itself is really good and worth the price - fresh food, great variety, quick replenishments but we found the service in the breakfast room a bit rude and unequal because the businessmen in their suits and native Spanish speakers were always asked whether they liked to have coffee brought to their table while other breakfast guests needed to get their coffee from the machine. If you prefer to drink tea, prepare for luke-warm water in a huge pot. The lack of smiles on the staff’s faces did not occur only in the breakfast room, the same went for most of the reception staff. They weren’t rude but didn’t bother to tell anything extra or even apologize for their mistake when they accidentally charged for too many breakfasts while checking out. There has been much debate on the location of the hotel and it really is quite remote and the deserted surroundings are not the nicest to walk in at night. Selva de Mar metro station is about 10 mins walk from the hotel and close to the station is also a tram stop for line T4. The closest restaurants are in a big shopping centre called Diagonal Mar, a 10 mins walk from the hotel to another direction and there you can plenty of them, great variety too. The shops in Diagonal Mar, including a huge supermarket Alcampo are open till 10 pm Mon-Sat and also open on Sundays. All in all, for the price we paid we were happy with the hotel but if you are not a regular visitor in Barcelona and would like to do sightseeing, the location is not ideal. Next time we could be looking for a hotel near Diagonal Mar and the congress centre in order to be little closer to the metro and avoid the deserted streets around the hotel.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“Quiet location, abit further out from city but nice and quiet”", "Author": "jenny h", "ReviewID": "UR124866262", "Content": "Visited for my birthday weekend, hotel is slightly out of the area to the city. But there is few things to offer like the shopping centre and local ports. Good for a relaxing stay, service was good. Hotel receptionsist could of been abit more chatty and happy. Overall standard stay.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "somerset, uk", "Title": "“Ok..”", "Author": "0Leanne0", "ReviewID": "UR124718182", "Content": "We stayed here as a young couple for a weekend away during february. An absolute beatuiful, modern style hotel, set on the outskirts of barcelona. Being young the location was fine with us and we found the 10 minute walk to the metro station manageable.Check in..On arrival in barcelona we caught a cab from the airport to the hotel costing around 40 euros, on reflection we'd of rather braved the metro and done the trip for 2 euros each. Check in was fine, fornt of house staff freindly, providing a map and info on which metro lines to take to tourist attractions. Would recommend Tibadbo and Sagarda La FamaliaRoom..As mentioned earlier very modern styled and everything was perfect untill we tried to settle to sleep. The accoustics were awful! and we could here word for word the people next door. This was our only real gripe...Breakfast..Really good, we had it in included in the price of our room so cant comment on cost. Good continental selection with hot eggs and bacon.In all a good hotel and reasonably priced.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“highly recommended”", "Author": "Ismamart", "ReviewID": "UR123890160", "Content": "Location: This hotel stands in a residentian block in barcelona. it's located about 25 min from the airport. A cab ride will cost about 35 euros from the airport. The hotel is walking distance about 5min to the nearest metro stop line 4 that stops in barceloneta, gothic quarter, passaige gracia and very close to plaza catalunya. Theres also a shopping center 5min walk from the hotel. Cab ride to las ramblas or other downtown attractions between 8-10 euros. You can purchase a 10ride metro/bus pass for less then 10euros (smart way to go) Hotel: The staff was friendly and did not have trouble checking in at all. it was all done within 5min. If you ask they will provide you with a complementary 24hr internet code. The rooms are modern standard european size. Bed was not plush but still comfortable white linen. The bathrooms nice and modern with tub/shower. Rooms where nicely cleaned every morning. There is a pool in the roof with a solar deck. pool is closed during winter but the solar deck remains open with 360 view of the city. Food: breakfast buffet will cost you 8 euros if you book when you check in the only downside to this is that to get the discounted price you have pay for the entire stay. if you choose not to eat there every morning it's 12 euros. The buffen was good and fresh, good variety of pastries. cold meats and cheeses. Overall hightly recomended hotel nice and modern and when compared to equal hotel in main town tryp condal mar offer a better value.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Isle of Wight", "Title": "“Thanks to a double booking..”", "Author": "clarewall_iow", "ReviewID": "UR123568463", "Content": "I will admit that this review comes a couple of years late - but reminiscing about Barcelona I looked on her and was quite surprised to see some of the reviews. So I'm leaping to this hotel's defence! When we booked it was through Lastminute's top secret hotels deal, and we booked the Vincci Maritimo. When we arrived late at night we were told our room had been double booked, and would we mind going to the sister hotel? Course we said we were fine with that, and what a great thing it was! I loved the shape of it, the room was modern, bright and with its clean lines had a really cosmopolitan feel about it. LOVED the airy lobby and reception area, and actually thought the location was OK. Condal Mar is an industrial area, but with the tram stop less than a ten minute stroll away, it wasn't so bad. The mall close to the stop is also very convenient if you just want an informal dinner. And make sure you visit the supermarket there - I've never seen so much space dedicated to parma ham and salami in my life! If I was able to go back to Barcelona now, I would book this place in an instant. It's great value, has a pool and is close enough to the action to make it a decent option. PS I've marked that we travelled in Feb 2011 as that was as far back as I could go. We actualy travelled in 2008!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Reasonable for the price”", "Author": "ThePitchers", "ReviewID": "UR123409566", "Content": "As mentioned in other reviews the location is not great. The hotel looks out of place in what appears to be a quite rundown area although it is only a 10 minute walk to the metro. We stayed for 3 nights in December so we left the hotel mid morning and stayed out until the evening rather than traipsing back and forth. The reception staff were helpful and friendly however the bar service was terrible. Due to this tea/coffee making facilities in theroom would have been great. This wasn't the worst hotel we have stayed in but i would not want to stay there again.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Clean, modern and reasonably priced - but take a sponge for your partner.”", "Author": "owenrees82", "ReviewID": "UR122907805", "Content": "Set in what looks like an industrial area of Barcelona, the hotel looks very modern in comparison. From entering the hotel, it certainly looks the part. My experience was somewhat mixed. The breakfast catered for many tastes. However, the amount of hygiene products was minimal. After running out of shower gel, and leaving the empty bottle in an obvious place, it was not replaced until after we highlighted to reception. Also, one tiny bar of soap and one sponge for 2 people is unacceptable. It may sound like I an whining, but for a 4 star hotel this is not great service. I somehow feel they awarded their star rating themselves. On a positive, the hotel was only about 5 minutes walk from Selva de Mar metro, and the view of La Sagrada Familia from out window was stunning. If you want to spend less by staying out of the centre then you could do a lot worse than stay here. However, don't expect all the bells and whistles.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Designer hotel, but located in the middle of nowhere”", "Author": "Trotamundos09 Posted by an Accorhotels.com traveler", "ReviewID": "UR122783478", "Content": "I picked this hotel because I got a deal off the website, otherwise I would have gone closer to the center. As the previous posters have noted, it's in the middle of nowhere situated amongst warehouses, etc. Spooky walking there from the metro station after dark. Beautiful hotel though, with spacious rooms decorated with modern designer touches. Another negative is the lack of free wifi.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great design, great stay but a little far from the convention center”", "Author": "Lamboswede", "ReviewID": "UR122686595", "Content": "This hotel was rather good with an interesting design both externally and internally. The rooms were quite spacious, nice and clean. The only negative thing with the hotel is that it is rather far from the city (it takes time to go with bus, taxi, car because of the heavy traffic) but in the end I would much rather spend a few minutes more in a cab then pay a premium for a downtown hotel with bad room standard. I like the hotel and would definitely go back. I also like the fact that there is now heavy traffic passing the hotel which can be rather annoying in big cities.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Lovely hotel, disappointing location”", "Author": "gbest7", "ReviewID": "UR122389667", "Content": "The hotel was very well furnished and maintained. The description of the property, rooms, facilities, etc fit the bill and we never felt cheated. The location was the only let down. We were warned about it while reading all reviews but for the price we decided to take the punt. To get there from the nearest underground station you do need to walk through a dilapidated industrial estate. If this hotel was two streets down the road towards the sea, there would be no complaints whatsoever. In short no complaints about the hotel; so if you only plan to use the hotel as a base for Barcelona and spend all day outside, its a good choice but if you want an excellent immediate vicinity, not so much.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Jaipur, Rajasthan, India", "Title": "“beautiful hotel, only location letdown”", "Author": "aasthagupta", "ReviewID": "UR121990790", "Content": "We stayed wid this hotel in june, its a beautiful hotel wid a very attractive lobby,and at first we found d hotel very attractive but then there was no bell boy who could take our luggage to the room. We had to carry it ourselves. Our room was on 6th floor, the room was super attractive and i loved the interior which is very modern. Even a normal deluxe room was nothing less.But it was next day when we realised tht our hotel is pretty far from city center... We realised we would not be able to make on time and had to cancel all our city tour. But the staff was very helpful. Would love to stay again. But only when m going thr for more than two days.i didnt like the restaurant which is too vibrant n loud.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“The Good, The Bad And At Time The Ugly”", "Author": "Kensington25", "ReviewID": "UR121499246", "Content": "We stayed at this hotel in early December. The hotel has a very smart reception with very friendly and helpful staff who explained clearly what there was to do and where the nearest metro station was. Loved the design of the hotel too which was modern. The hotel is 15 to 20 minutes from the city centre by Metro and the price reflects this. On reflection we would have preferred to pay a bit more and stay more central. Our eighth floor room was spacious and modern. It looked impressive at first though on closer look not everything was as good as it looked. There was no kettle or tea or coffee provided unlike in almost every other hotel I have stayed in. I felt for the price it should have been included. The television was not working either. Thankfully we did not really need the television as we were out for much of the day and night but if a television is to be included with the room it should be expected to work. There were also a few other problems. The safe did not work plus the sink had a crack and a minor leak. Shower gel and shampoo was an all in one combo and we would have preferred separate toiletries. The walls were also pretty slim and we could hear the couple next door clearly. The wi-fi is also not free though I understand from the hotel staff that it may become free early next year. However, worst of all was my bed. I have stayed in hotels, hostels, Bed and Breakfasts and people's couches around the world and I can honestly say it was the worst bed I have ever slept in. The mattress was far too hard and killed my back. My first night was pretty sleepless. I hope I never have to experience those beds again. The main purpose of a hotel room is to provide a good night's sleep so the hotel failed on that count. On the plus side the breakfast was amazing. Absolutely delicious and plentiful. The staff were brilliant and very friendly. Loved the croissants in particular. Very impressed. Good staff and delicious breakfast but too many problems too so I would not stay there again. Barcelona is an amazing city and I will be back for sure but I will choose another hotel and one closer to the centre. For the money and for a good night's sleep I would rather pay more for something better. Over all because of the friendly staff and great breakfast I will give it a generous three our of five.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hull", "Title": "“Fantastic hotel, would stay again!!”", "Author": "ElaineRed", "ReviewID": "UR121141051", "Content": "Stayed in this hotel for 2 nights and it was fantastic. Very modern and stylish, really friendly staff and the breakfasts were great too! 2 mins from Metro, altough situated in 'business area', quiet and safe area. Was my husbands birthday on the first night and when we returned to our room on the evening there was a bottle of champagne and handmade chocolates! Fabulous, would highly recommend.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Value for Money, Modern, Clean - Location only letdown!”", "Author": "global-traveler86", "ReviewID": "UR121094885", "Content": "Managed to get a room here over the weekend for £40/night through a travel bidding site. The hotel itself is very modern, the rooms are nice, and the beds are pretty comfortable. Definitely more than 3 stars - probably 4. There's also free sauna and gym access in the hotel, which is a bonus. But no free wifi in the rooms or hotel lobby, which is a shame. Buffet breakfast is a bargain of 8-ish Euros if you take it for all the mornings you're staying there. We didn't - but wish we had. However, there's a massive shopping mall next to the Metro station (not the Selva de Mar one) with lots of places to eat there. The only downside, and it can be a big one for some, is that its in the middle of a very quiet, industrial/business area. Its very deserted outside the hotel, although at no time did we feel threatened or unsafe while walking home. But it is a good 10 minute walk from the Metro station. And the Metro is a good 15 minute ride to Passeig de Gracia. So not very convenient, but we were after cheap, modern, quiet, and high quality.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Clean & nice hotel, far from downtown”", "Author": "zsimur", "ReviewID": "UR120525374", "Content": "I have stayed in this hotel a week ago. The hotel was nice, clean and new. The room I have stayed in was a triple room and it was in great condition. The breakfast was good and the service was great. The only downside is that the location is far from the center of the city. Around the hotel there arent much to do. To get to the city center you can take the metro. You have to walk about 10 min to get to the metro station and then take L4 for about 8 stations to reach downtown. I took a cab from Diagonal x Via Agusta back to the hotel and the ride was around 13 euros. Apart from the location, i would recommend this hotel", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "montreal", "Title": "“Very modern , but a bit remote from city center”", "Author": "iogima", "ReviewID": "UR119970027", "Content": "We stay a this hotel before we join in a gang from Trafalgar vacation. Beside is remote location the hotel is very modern and room comfortable. Good buffet breakfast choice. it is reasonnably priced . The personnal were helpfull.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "england", "Title": "“Great hotel dont be put of by distance to city center.”", "Author": "j_stratford", "ReviewID": "UR119553838", "Content": "We have just got back from staying at the Condal Mer for 2 nights.Couldnt find fault,just what we had expected.May be a way out of the center but get a metro ticket ,we got a 10 trip whiched saved about half .Metro trains run every 3-4 minutes so never have to worry about the time,fast and clean.Hotel just 5 or 6 stops from the Rambals.Breakfast good plenty you couldnt leave hungry.Rooms basic but have every thing you need and no added cost when using the air conditioning.Would recommend, but not to anyone with mobility problems,because of the distance into the city,metros all have lifts tho.A great city for a break, hire a bike its so bike friendly.Veiws of Barcelona fron the roof top wonderful.would recommed this hotel even tho area rather strange but felt totaly safe a night.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "France/ Switzerland", "Title": "“Great hotel in Barcelona, perfect if you come by car”", "Author": "AnneMarieTipi", "ReviewID": "UR119283234", "Content": "We went last weekend to this hotel, and were a bit worried about some of the reviews, but a lot of hotels were already booked and as we needed a triple room, the price we paid seemed fair (113 euros/ night). We were pleasantly surprised when we arrived because we had asked about parking at the hotel (reasonable price : 9 euros for 24 hours) but in fact, you can easily park in the street just across the entrance from the hotel and that's what we did. Then the greeting at reception was extremely friendly and they adapated to all the requests I had made beforehand by email. We had not paid for breakfast so at first they offered us a cheaper deal for the 3 days, but we were not sure we wanted to eat breakfast there everyday so then he directed us to their loyalty card which gives you 50% on breakfast price which amounted to around 5.50 euros/ person for a REALLY good breakfast, special mention for the fresh orange juice, no better way to start the day. The room was beautiful and modern with a beautiful bathroom. The swimming pool on the top is great, and the view around impressive. The metro is 10 minutes away from the hotel and for us it was perfect as the area to walk to the metro is safe and quiet (we were 3 ladies). I do admit that if we had not come by car and it was our first time in Barcelona, a more central location would be more convenient, but for us it was perfect, and I would definitely go back ! One last thing : I would recommend to the hotel that they improve the speed of the bar service on the ground level, as there was only 1 staff member and that was not enough", "Date": "October 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Praetorian Marketing in Barcelona”", "Author": "peterrudge", "ReviewID": "UR118939988", "Content": "The hotel was clean and comfortbale bit a little bit basic, great for access into barcelona and at a reasonable cost. Would reccomend staying in the hotel for sure. Peter Rudge - Praetorian Marketing Ltd", "Date": "October 4, 2011"}, {"Ratings": {"Location": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Avoid at all cost!”", "Author": "AlainM13", "ReviewID": "UR118112484", "Content": "The first room attributed to me (302) looked nice but i rapidly experienced power failures which cancelled the A/C system. I was changed to room 502 after being told it was a problem on the 3rd floor. The A/C unit was so weak in room 502 that i was again changed to room 819. I cannot say that the desk personnel was very nice during the whole negociation. Two power failures interrupted the A/C in that room during the night. When electricity came back, lights went on , waking me up!!!!. The hot weather had the room temperature climb above 27°C as the power failure had switched off the A/C. The next day, I asked to meet the manager on duty. He had no solution or no commercial offer to compensate for the trouble. He indeed insisted the problems were under control...... The location of the hotel is in a lousy neighbourhood. There are so many other choices, pass this one!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cambridge", "Title": "“A good value option”", "Author": "Googie_W", "ReviewID": "UR117976180", "Content": "I think when you take everything into account that this hotel offers good value for money. The hotel is not in the centre of town, however if it was it would be twice as much and so you have to make a decision as to what is important to you. The metro is only a short walk away and so getting into town is not difficult or indeed costly. Barcelona is an expensive city and so if you want to be in the centre then you will pay for the priviledge. The hotel is reasonably well presented, the staff are courteous and efficient and the buffet breakfast is very good. I was slightly concerned regarding some of the negative reviews, however having returned from a week’s stay all I can conclude is that the earlier reviewers must have had some slightly unrealistic expectations. There is nothing wrong with this hotel at all. The only thing to consider, which a personal decision is, is the price v location trade off.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Value for money!”", "Author": "elenacon", "ReviewID": "UR117870634", "Content": "Not very close to the centre. However 4-5 minutes away from the selva de mar station. The roads were quite. Seemed safe! Very nice hotel, great rooms!", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "The World", "Title": "“Hotel was nice. Not the best location”", "Author": "rocky197798", "ReviewID": "UR117587357", "Content": "We had a nice time in Barcelona. The hotel itself was nice but the location was a bit far from the main centre. Took about 15 minutes to get to town via the metro. Was not too bad. Used taxi's at night which was a bit costly.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Fab!”", "Author": "traveller06186402", "ReviewID": "UR116904326", "Content": "I booked a weekend stay at Tryp Condal Mar and had a fantastic time! We had a free upgrade to a junior suite that was HUGE! The bed was really comfortable, bathrooms were brilliant and the free 'foot revival kit' was an absolute treat! I read the other reviews and worried that it wasnt in a good location but we thought it was perfectly fine; the walk to the nearest metro station was barely ten minutes and the area was perfectly safe and very quiet. You could walk ten minutes in another direction and be at a fabulous beach or a large shopping centre! The pool on the roof top was pretty chilly but in the afternoon sun it will be just what you are after. The staff were never once rude and gave us plenty of advice on how to reach places we were interested in and would happily show you on a free map :D I would love to go back tomorrow!!!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Read me, this is an accurate description and its positive.”", "Author": "stephanie b", "ReviewID": "UR116898979", "Content": "I researched this hotel well before our 3 night trip to Barcelona, I knew it was slightly out of the centre but that appealed to us as we wanted to see the 'real Barcelona'. We got there easily and quickly from the the airport at a cost of 6 euros (bus to Catalunya, then metro to Selva del Mar), so if you're stupid enough to pay 40 euros for a cab then moan about it then that's your own problem. We were greeted by a friendly and professional receptionist and actually all the staff throughout the trip were very nice. One great thing about the location of the hotel (which is not miles away from the centre as some people say - we know this because we hired bikes and it is appoximately 2 miles away) was the fact that the Mar Bella beach is a 12 minute easy straight walk away. Selva del Mar also hosts a hilton hotel (2 mins from the beach) and an ENORMOUS shopping centre which doesn't look like one from the outside, but in the inside is packed with great shops and restaurants and a supermarket to stock up on drinks, etc. Back to the hotel, the breakfast was superb, continental and yummy. The rooms were lovely and modern (the finishing very slightly tired but certainly nothing to cry about) and the pool area is great with a good view. Bathroom was lovely, everything worked and generally I do not have a single negative. I always felt safe walking around the area and the tube is a 12 minute walk, but once again if you're silly enough to keep paying out for cabs to and from everywhere then this place isn't for you! Otherwise I absolutely recommend it. Enjoy!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Lancashire", "Title": "“Lovely room, everything else average.”", "Author": "MDKlancashire", "ReviewID": "UR116239586", "Content": "My daughter and I stayed for 3 nights. The reception staff really let this hotel down. Slow, rude and very uhappy in the job they do. We signed up for a loyalty card which entitled us to half price breakfast, and 20% off food. When we left the 'lady' on reception tried to charge us full price, I stood my ground as I hate to be overcharged for anything. The pool is small and few beds, no restaurant for evening meal just bar snacks and expensive drinks. Visit the port to eat and drink in the evening, this is brilliant and ony 7 to 9 euros by taxi. The area is not yet finished, never felt at risk and loved the shopping centre. All in all can't wait to go back to Barcelona but would not go back to Tryp Condal Mar.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Lovely Hotel...Strange Surroundings”", "Author": "HayleyandSteve", "ReviewID": "UR116159653", "Content": "We arrived in Barcelona at around midnight so we felt very vulnerable walking along the very dark and desolate streets to get to the hotel with only a few strange characters around to ask for directions. (This wasn't helped as my boyfriend had nearly been mugged as we got onto the metro that night!!) However...Once we arrived at the hotel, the man who met us at the reception was very nice and our room was really lovely. We decided to try out the breakfast buffet the first morning and there was a good selection of nice foods. But VERY overpriced, we got a bill for 23 euros for the two of us as we were leaving :/ The beach was about ten minutes walking distance and was gorgeous. The metro was VERY easy to use and cheap. you MUST use it to get around, although hold on tight to your bags and leave NOTHING in your pockets!! The lack of a kettle for tea and coffee etc in the room was very disappointing . But the mini fridge came in really useful (especially when we found a nearby 'supermercado' and stocked it with cheese and tomato to make up some sandwiches for each day - to save money on eating lunches out) Although the hotel was lovely and very clean, with very easy access to beach, shops and metro, the actual surroundings slightly let the hotel down but don't let it put you off at the end of the day.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Nice Hotel! HORRIBLE SERVICE”", "Author": "ChrisA_tini", "ReviewID": "UR115474760", "Content": "The hotel is very modern and very pretty but that is it! DON\"T Stay here unless horrible service is what you are into. Really its not worth it...unless you want spend your vacation worrying if someone will be in your room when you come back or the staff will tell you one thing and do another.... I read reviews on this hotel from trip adviser and the reviews were mixed but the hotel looked good on the pictures so i booked it anyway. big mistake!! On my trip we happened to arrive at 11:30 pm .. first of all there was nobody at reception. We ended up waiting for 30 mins before someone showed up and then it took almost an hour to get us checked into the room. Ridiculous!! Then the next day i asked to speak to a manger .. there was none on duty at the time at 9am. The worst part was after i got pick pocketed ( so please be aware of pick pockets) on the train i asked to use the phone and i was not not able to dial out from the phone at reception (don't see how that is possible i can't make a toll free call from the front desk phone) so the person on the desk told me i can try from my room and i WILL NOT be charged. Total LIE as i found out when i was checking out and was billed for the calls. Also apparently the do not disturb mean nothing to the staff cleaning the rooms. We went out to breakfast only to return to see the the door of our room wide open and someone in our room. Do not Disturb means do not disturb! come on! Lastly but not a deal breaker it is a basically outside of the city and a bit of a way from the airport so be prepared to spend money on cabs or get well acquainted to the subway. (though the subway is not bad ... actually it is pretty nice and reliable i am from NYC so trust me on that one)", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Good with reservations”", "Author": "Ireland058", "ReviewID": "UR115301131", "Content": "When we booked the hotel, we read the reviews and knew that it was 10 mins from the nearest Metro, so no complaints as this is accurate. However, in the searing heat that Barca boasts, that 10 mins seems like 50 when done even twice in one day. if you have the money, taxis would be a better option but are at least 20 euro per trip - soon mounts up! The hotel is very modern and decorated to a high standard which feels luxurious. the outdoor pool is a real bonus which we made good use of during our stay - practically had it to ourselves for four days. Our room was thoroughly cleaned every day and the hotel in general was very clean. Breakfast which cost 8 euro each (half price apparently) was amazing with a wide range of food to suit all tastes and loads of it! Overall this is a good hotel where the staff are not very friendly.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "home", "Title": "“a big disappointment - wrong room, no free internet, lack of service”", "Author": "ronen2011", "ReviewID": "UR115132894", "Content": "(1) I reserved a double bed room for three nights, and paid extra for it (compared to twin beds room). When my wife and I got to the hotel we found out there were no double bed room left and they put us in a small twin bed room - with no compensation or money return. (2) The Internet is not free - trip advisor site is wrong ! (3) We got only one coupon of beer (for a couple...) (4) There had not been a bartender the whole weekend to serve the glass of beer... (5) One night we returned to the room and discovered the towels had not been replaced and just moved from the floor to the hook on the wall. We asked for clean towels, and they promissed them in five minutes. after an hour we went to shower and used the old ones. We are not going back to this hotel or to any other TRYP hotel.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Clean, Classy and Comfortable”", "Author": "MissRWard", "ReviewID": "UR114871975", "Content": "I decided to book a long weekend away for my boyfriend's 21st birthday. I wanted it to be special and had looked at numerous places on many websites but Tryp Condal Mar had particularly caught my eye. The photographs and description of the hotel were great and when we arrived we were not disappointed. The hotel was extremely modern, clean and classy! When we arrived we were given our room number but when we got to our room we had twin beds rather than a double. We asked to change rooms and it was done straight away. The staff were very helpful and on numerous occasions we asked them for directions to certain places where they advised us on what transport to take and where certain markets were situated etc. The hotel is not in the centre of the city but you can easily travel to tourist places using the tube which is quick and easy to use and also runs throughout the night. We didn't have to wait longer than 10 minutes for a tube to arrive: very reliable. There are numerous facilities at the hotel but we only used the roof top pool (because we were out sight-seeing most of the day) which had plenty of sun loungers and parasols. I really enjoyed my stay here and I would definitely stay here again! Very impressed!", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Sweden", "Title": "“Good looking, a bit out of center”", "Author": "L-Cay", "ReviewID": "UR112914274", "Content": "We actually choose this hotel based on its location, so we can´t complain. For regular tourists, though, it might be a bit out of center. Metro station is only about 500 meters away though, the beach is in walking distance and there is plenty of cafés and bars close by. Rooms where nicely decorated. Might need a bit of freshing up though. The bed was excellent. Never had a better sleep in my life! The roof top pool-area was really nice. The staff where friendly and helpful. We didn't try the breakfast, so cant say anything about that. So: Good value for money, modern and stylish, might be a bit to far out.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Oxford, UK", "Title": "“Nice Modern Hotel In Further Out Location”", "Author": "Muldr4Scly", "ReviewID": "UR110540413", "Content": "I needed a hotel last minute for a couple of nights for the Barcelona Marathon. I was looking less than a week before the event and all of the central hotels were very expensive. I decided to choose a hotel which was a bit further out, provided there was a nearby metro station and it wouldn’t take long to get to the centre. I chose this hotel because it had good reviews, looked quite modern and was close to Selva de Mar metro station. I knew it was in an industrial area and would have nothing nearby so if you don’t mind the location then it is a good hotel. It was a 10 minute walk from to Selva de Mar metro station to the hotel. I booked a room for two nights through booking.com for £100. I asked for a high-up room and was not affected by a quite noisy bar area on the ground floor. The bedroom was a good size with a luggage rack for my suitcase and the bed was very comfy. The bathroom had a bath, bidet and toilet. There was a powerful shower and a hair dyer was provided. I enjoyed my stay and would use this hotel again.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Piraeus, Greece", "Title": "“Do not leave your belongings unattended !”", "Author": "Eksasteros", "ReviewID": "UR107480717", "Content": "Beautiful building, nice rooms etc. However the most important for a traveller is to feel that his/her belongings are safe... Unfortunately this is not the case for TRYP conadal mar.. Experiencing a loss of quite big an amount of money I got the worst impression of the said Hotel. Assured that it was an inside job I was even more disappointed having to face with the manager's and staff's negligence which did not give any assistance at all.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Modern Hotel in bad location”", "Author": "cezandelz", "ReviewID": "UR100026907", "Content": "This hotel was very modern and clean inside with nice bedrooms although they were quite small and the beds were hard. The staff were not particuarly friendly and we had to wait at the bar in the reception area for ages before anyone came to serve us. The view from the roof was nice and the pool area was lovely however due to the time of year it was very windy and the pool bar was closed which was dissappointing. The area the hotel is situated in was not very nice at all and it was about a ten minute walk to the station through grey and dreary streets. Another issue we encountered was no taxi drivers seemed to know where the hotel was and looked at us blankly when we said the name of the hotel! If we were to go to Barcelona again we would stay in the city centre or Barcelonetta as this was a lovely area.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Luxembourg", "Title": "“Good Hotel”", "Author": "Mast_2011", "ReviewID": "UR97189787", "Content": "My stay at the Tryp Condal was good. Room: design, cosy and very comfortable. Service: was good, but nothing special. BreakFast: a good choice of products but for a 4* i was expecting more... maybe i woke up to late Location: after a 5 minutes walk you've the Metro. OK the location is not the most exciting one, but it's a quarter that is changing. Price: Very good Overall: I could recommend this Hotel to people who like to be in a good hotel and don't mind taking the metro to the city centre.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stay away! There are better options around Barcelona”", "Author": "Paperarkitekt", "ReviewID": "UR86160653", "Content": "I want to start by saying that this is a rather nice looking hotel and the breakfast served is by far the best hotel breakfast I have had, but that's all positive aspects. The negatives: - Location; there is nothing close by! - No room service and bar closes early (11pm, which happened to be when we got in) - No business centre (available for a charge) - No free Wifi; cost 16.20 euros per day - No ironing board; charge 6 euros for that service - The neighborhood is questionable - Thin walls! I could hear my next door neighbours and they weren't even loud. The staff aren't rude, but they aren't too helpful and to be honest none of the above are a deal breaker if you are staying at 2 star hotel, but this is a 4 star hotel so you expect some service.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Walldorf, Germany", "Title": "“Good hotel outside the city center”", "Author": "-C_h-e_s-s_y-trip", "ReviewID": "UR81380055", "Content": "The hotel is located outside the city center but still very good if you want to combine city trip and swimming, and ideal if you are travelling by car. The garage of the hotel costs some money but you can find free parking around the hotel. We always parked in front of the hotel. Also the metro station is at 5-7 minutes walking distance. The beach is at 10-15 minutes walking distance and as it is far away from the city center, it is not that crowded like the beaches close to the city center. There is a shopping mall Diagonal Del Mar on the way to the beach, where you can find good restaurants besides typical fast food chains. The hotel is new and modern. At the roof there is a small swimming pool and a bar. The view is great from the roof. You can even see the silhouette of the city even if from the long distance and the sea from the roof. The breakfast was a little bit dissapointing for me. I would expect more from the breakfast and the service. What they had as breakfast was really good, but was not enough for a 4 star hotel. There was no tea and coffee service, one had to prepare himself tee with 2 cans of cold, which is supposed to be hot, water and pour milk to coffee from a can of cold, which is also supposed be hot, milk. And when you ask to have some really hot water and milk, they mostly smiled at you and do nothing, or bring like in 15-20 minutes, which is approximately the end of our breakfast. Some of the personal were really very nice and fastly working but with most of them we had the above experience. Except for that everything was fine.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“Quite decent option”", "Author": "pegasustr", "ReviewID": "UR80984314", "Content": "I read rather negative experiences about hotel before I visit the hotel. However, it is better than my expectation. The hotel is now run by TRYP group that is a good spanish chain. it is close to hilton del la mar and also forum and a big shoppoing mall. and few blocks away from tram and metro. Similarly to the see 10 minutes by foot. I park outside that is free and safe and plenty of parking slots are available, Hotel has also parking facility for 9€/night. Rooms are nicely desinged and normal size not too big or small. It is clean and TV, fridge etc. are all working. swimming pool is nice on top of the hotel small but it is cool... Breakfast is moderate but much better than french 4 star. We had 5 days deal per night less than 100€ that was a great price therefore I am rather positive. no free internet, gym is small but could be usefull. However it is not in the city and you need to take the subway for 10-15 minutes.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Manchester", "Title": "“Lovely hotel, poor location”", "Author": "Puppen", "ReviewID": "UR79263974", "Content": "Went to Barcelona for a 3-day, 2-night trip. The hotel was included as part of a package flight+hotel deal, and whilst it may be advertised at what seems like a good value rate, this is a reflection of the fact that hotel is not centrally located. The hotel itself is very stylish; modern throughout and with a unique design. Our room was a good size with a generous bathroom, but with only a single pillow on the bed, and two sheets for cover (no bed spread or additional blankets in the wardrobe), sleep wasn't what it could be (even in September). It is a 5-10 minute walk to the metro, which is definitely the best way to get into the city centre, albeit through slightly questionable streets when it is late at night. For some reason on our second day, before we had used the bathroom in the morning, our toilet began to backfill with excrement and waste water about a couple of inches from the lid, before retreating again - no explanation, but thankfully no lasting damage either! The roof terrace is nice for relaxing before/after a day of sightseeing and on the whole the hotel is fit for purpose and provides a place to rest your head if that is what you are after.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Stockport", "Title": "“Good hotel, poor location and local facilities”", "Author": "JonathanStockport", "ReviewID": "UR79186567", "Content": "The Condal Mar is now owned by the Tryp Hotels Group. I was in a party of six. We knew in advance about the location of the hotel, so this was not a surprise. The hotel is situated outside Barcelona town centre, on the L4 sub way line, getting off at Selva de Mar. The station is about a 10 minute walk from the hotel. Check in was fine, no issues there. The room was excellent. Very stylish. The air conditioning worked fine and wasn't too noisy. The bathroom glass doors, that have been mentioned in previous reports were smoked over, so no one walking past could see in. Plenty of hot water, but it did change temperature a little while showering, but not to hot that it would burn ! No tea or coffee making facilities in the room, but there was a mini bar. Free safe available in room, worked by credit card. I didn't have breakfast, but my friends did, they stated it was excellent and they paid about 9 Euros, per sitting. I used the gym on one occasion, while my friends were having breakfast. There we to jogging/ walking machines, two cycle machines and one rowing machine. All seemed to be working. The sauna was not on when I used the gym. Unfortunately the next day (A Saturday), the gym wasn't open, so I question this at reception and was told it didn't open until 09.00, which was very disappointing as I wished to exercise before flying home, taxi booked at 09.30. I'm not to sure why they didn't open the gym until 09.00, but as this was a big let down on my part. I was able to take beer from the downstairs bar onto the room terrace, so no problems there. The pool area and terrace was well laid out, plenty of chairs and sun loungers to use. 'Piped' music by the pool, that appeared to be on all day, which personally I found quite annoying, The views from the terrace, looking into Barcelona Centre were stunning, particularly at night. The views a bit more local showed the area to be run down and in need of development/ improvement. The scrap yard was just over the road, with gypsy type people living out of vans on the kerb side. We had no issues with these people as they kept themselves to themselves, but we did walk down an alternative street to avoid them. Again we knew the area the hotel was in wasn't very glamorous from previous reports, but unfortunately the hotel is situated, where there is nothing around within easy walking distance for a quick beer or meal of any great standard. One restaurant we tried close to the sub way was below average at best, but was that expensive. We tried another out of desperation in the Diagonal Mar Shopping Centre (one of our party had a pulled muscle and could walk too far). This was very poor and quite expensive. Overall, it would be hard to fault the hotel, but it's location and local facilities are very poor to poor at best, which might be a big turn off for people. We assumed the hotel had been built in this area to kick start a re-development of the area, but this hasn't really started yet. Also, watch out for pick pockets in Barcelona, particularly on the underground, we encountered this on three occasions in three days, plus once in a restaurant. We got caught out once, but because we had locked our bag packs, they didn't get away with anything! I found Barcelona very expensive, they are really pricing themselves out and I can only guess that tourists will soon cotton on to these extortionate prices and not come back. Our first lunch was £15.00/ 16 Euros each, and nothing special, £4.54/ 5.5 Euros for just less that a pint of beer (500cl), I won't be going back !", "Date": "September 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely looking hotel, shame about the awful service..not a 4 star at all!”", "Author": "cherrybomb_10", "ReviewID": "UR78626825", "Content": "Myslef and 3 friends stayed at the Condal Mar for Sonar Festival Weekend back in June, We had high expectations and were bitterly disapointed. From the moment we arrived the service was awful and the facilites just did not match up to what we would expect at a 4 star hotel. Yes the hotel and rooms look lovey but for us its about the service and being made to feel wellcome which we did not. We wrote a letter of complaint to the hotel and they say it is beacuse there were in a period of transistion and had new systems etc. Well im sorry but I would expect a 4 star hotel to manage the transition better to be honest! Here is a list of the issues we had when we stayed: Request was for twin rooms and we had 1 twin and 1 double Request was for adjoining or rooms near to each other and they were on the same floor but far apart. No food available after 11pm at the hotel so with late arrival were unable to eat, no vending machines even. Bar unstaffed and long wait pretty much every time. On one instance, in the middle of being served, the bar staff went off on another errand and we were left waiting for a further 10mins. Bar shut at 12:00 this is not usual for any hotel bar. No room service Unable to dial other rooms and unable to dial reception from the room to get help. Reception staff were very rude and unhelpful (apart from one guy called Frank) Wi-Fi not working in the room and reception very rude and unhelpful about getting access to internet. Roof Terrace Bar not open as per the advertised facilities. Roof Terrace Area closed until 4pm on the Saturday?! (surely the peak time for the hotel?) Not allowed to take food from the bar onto roof terrace. Overall service was very poor and not what we would expect from a 4 star hotel. We asked the room to be put in my colleagues name, so that she could receive calls. This never happened. Issues with the system in checking in, taking breakfast, at bar, due to new systems being installed. This caused further delays. In summary we would not recomend this hotel and certainly not be staying there again!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "5", "Location": "1"}, "AuthorLocation": "England", "Title": "“Location, Location, Location! Also, where is my cardigan?”", "Author": "Star41", "ReviewID": "UR77002376", "Content": ". Just got back from four nights at the Vincci Condal Mar. We got a good deal on last min with the “secret hotel” which worked out at approx £200. Pros - modern decor and great sized room. I am afraid that’s were it ends. Con's - Hotel name is confusing. Three of the four taxis we used did not have a clue where it was. The hotel is in an industrial area which we found safe and quiet although surely not an ideal place for a hotel!! The staff we encountered were really poor. It took an age to check in (seriously 15 mins). The internet connection/TV was 19 euro’s per 24hrs, without it the TV has virtually no English speaking programmes. I know you don’t go to Barcelona to watch TV but after a day's sight seeing it’s nice to just have it on whilst relaxing and planning evening events. The room had no ironing facilities and did not get cleaned on 1 of the days we were there. This was not due to us being in the room when cleaners came. My partner went to reception to ask for some ice for a bottle of wine and came back with approx 5 cubes of ice and was told he was not allowed any more!!! My partner also cut his foot whilst staying at the hotel, I popped to reception get a plaster to be told they did not have any. On the second to last day of our hol we were up and out early. When we got back the room had been cleaned and we began packing before heading out for dinner as we had an early flight. I soon discovered that my brand new cardigan had gone missing. It literally disappeared!!! It was cream in colour and the hotel staff feel it may have been caught up in the bed linen and taken to be laundered. I am now supposed to be emailing to see if it has been discovered. The cardigan was expensive and will be destroyed after being industrially cleaned!! All in all I would not stay here again or recommend it. The diagonal mar area is lovely. Great beach and shopping, loads of places to eat and Las Ramblas approx 10 mins away. I would really recommend this area if u want to relax, get some sun and dip in and out of the hustle and bustle of Las Ramblas etc", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mays86", "Title": "“Nice hotel”", "Author": "Mays86", "ReviewID": "UR72273700", "Content": "Stayed here for four nights on a trip to Barcelona at the start of July. We arrived in a taxi from the airport so had no trouble finding the hotel obviously. At check in I think the staff were training a new colleague so it was a bit slow and were speaking to each other in Spanish a lot but we got our room keys no problem. The room we stayed in, a twin, was nice and clean. The decor was a bit rough around the edges but it had a lovely feel to it, very spacious and lots of wardrobe space (important for us two ladies!) The bathroom was a great size and very clean. The shower and bath worked really well and we had plenty of towels. I requested an extra one during our stay and this was delivered with no trouble. On a couple of days we used the roof terrace to sunbathe. What a place! The tenth floor 360 degree views of Barcelona were stunning. We never used the pool but it looked nice and clean and there were generally staff nearby if you wanted a drink from the bar. The location is one thing that slightly lets the hotel down. It's a good walk from the metro which some people might not like but we didn't mind. It gave us the feel that we were out and about exploring a 'hidden' part of Barcelona and there was a great cafe nearby where we had 2 euro coffee and croissant every morning - a price I don't think you'd find right in the centre of town! Similarly, a hotel of this design and standard would be able to triple their prices in a central location so for me it was well worth doing an extra bit of travelling in order to stay so comfortably. One criticism was that due to the hot hot weather of July, we decided to leave a room key in the holder next to the door which powers the electricity/air con. We arrived back to find the cleaner had the key out and handed it back to reception, automatically cutting off the air conditioning. I don't know if this was to save electricity but we found it uncomfortable arriving back to a stuffy room after spending all day melting in the heat outside! We never had the breakfast or used the room service. It was always easy to get into the hotel no matter what time we arrived back late at night. Some people have commented on the 'area' the hotel was in perhaps being unsafe, we walked through it late at night a couple of times and never saw anything dodgy or had any real reason to fear for our safety! If I were to come back to Barcelona I would happily stay at the hotel again. However I would not ask them to phone us a taxi to the airport- the drivers levy a 15 euro charge for this on top of your 30+ euro fare, completely cleaning us out, saying this was the call out fee. It would have been kind of the staff to tell us this at the time, as there are plenty of cabs to be hailed on the Diagonal Mar. Oh well!", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Blackpool", "Title": "“Very nice hotel”", "Author": "Grayth", "ReviewID": "UR70180828", "Content": "When my girlfriend and I booked in at the (now Tryp) Condal Mar, we had not yet been able to read any reviews on it. When we eventually did read some, we were a bit apprehensive about its location, in terms of convenience and \"dodginess.\" Both of these factors depend on your expectations. If you want to be slap-bang in the middle of the city, don't book it. If you want to be in a thriving, beautiful setting, don't book it. For the price we paid, (less than £160 for three nights) we were happy to be five minutes' walk from the Selva de Mar Metro station and no more than fifteen minutes' Metro journey from most of the main sights. The Metro service in Barcelona is outstanding and it is near-enough impossible to get lost, though you really do have to keep your hands on your belongings. The surrounding area, as other reviews suggest, can be a little unnerving, with crowds of people on the corners drinking and shouting. But we certainly never felt in any real danger, and the walk back to the hotel is far shorter than many reviews on here suggest. The hotel itself was very impressive. It seems to just appear in front of you as you approach and first impressions are very good. The helpful staff (particularly a man by the name of Frank), clean, spacious rooms, king-size, comfortable bed, striking, modern interior and excellent breakfast deliver on these high standards. One small problem is the odd notion of having glass doors to the bathroom. This seems to me like suicide when you're running a hotel. Not all guests will be couples, and even those couples (in most cases) won't particularly want to see each other sitting on the toilet. A truly bizarre design feature, which could potentially cost them custom. Maybe Tryp will address this. We only briefly visited the pool/bar area on the roof one day, but it was a bit too busy. We were then both victims of pick-pockets on the last night of our trip (far from the hotel, I should add), so didn't have time to visit it in the evening as planned. But it looked like a lovely feature and we certainly would have spent more time there had we stayed at the hotel longer. Overall, I might not recommend the hotel to everyone. If they could drag it down the road to a livelier area, sort the bathroom doors out, throw in some tea and coffee facilities and free internet connection (though this didn't particularly interest us), I wouldn't hesitate - in fact they could have a five-star hotel. It really does depend on what you prioritise in a trip. For the deal we got, it was fantastic.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Houston, Texas", "Title": "“Extremely odd location, just changed management, good value”", "Author": "jason035", "ReviewID": "UR68557552", "Content": "It is now operated under the Tryp brand of hotels and changed management during my stay. I don't know how this will impact what this hotel has going for it - value and quality of staff. If you are looking for a clean, reasonable hotel, 15 min walk to the CCIB convention center and 10 min to the nearest metro in a neighborhood full of warehouses and apartment complexes, this hotel is perfect for you. The rooms are modern and nice and it boils down to are you looking for something more than value at the expense of a poor location. No wifi and wired internet was 15EUR a day.", "Date": "June 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Nice hotel - facilities good but require to be more user friendly”", "Author": "eileen1976", "ReviewID": "UR64064837", "Content": "This is a nice hotel. Location is good a reasonably distance from city centre so buy a travel card. Close to selva del mar metro. It is in the middle of an industrial estate. Downsides swimming pool not heated so not able to use as water freezing! Very restricted hours 11- 8pm. Facilities should be 24/7. We paid for a swimming pool so should be useable 24/. Nothing better than a early morning swim. Roof top views are very good. buffet breakfast recomended. Not sure about the 25 euro charge for entertainment services. Slightly excessive.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good Hotel in general...for business purpose perhaps”", "Author": "SebastienGenet", "ReviewID": "UR62467804", "Content": "We stayed with my wife for four days in Barcelona at the Hotel Vincci. We enjoyed the hotel facilities, the service and room were good and cleaned. The top roof was quite interesting with a good view. The Metro or tube station is 6 min walk and it takes around 15-25 min to get to the center. The beach is not really far away, unfortunately they are doing a lot of works there at the moment. I would recommend the hotel for business purpose but in the other hand I would not recommend it for a romantic city break as we found the location a bit too far away from the main attractions. Down side: - Only few coffees, restaurants and shops around. - Have to pay for the TV (extra channel), film, internet, radio. - Industrial area.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Norway", "Title": "“Great hotel, but watch out for the bathroom - it's only a glas door!”", "Author": "Hennes2", "ReviewID": "UR60514724", "Content": "The hotel was desent, but the bathroom door was only a thin glas door, with NO lock!!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "cheshire", "Title": "“Great value hotel”", "Author": "kuwooli", "ReviewID": "UR59525899", "Content": "I was a bit concerned reading previous reviews about the hotels location and distance from the centre. We however found neither of these things an issue on our recent stay. The hotel was only 10 mins metro ride from the centre and the metro ran until 02.00 in the morning on weekends. We caught it home at 01.00 on a saturday night and felt perfectly safe. The hotel is located in a business district so it is quiet at night but not scary and the metro seems to runs about every 5 mins so getting into the city is not a problem. The hotel was clean and I thought luxourious for the price we paid. I would certainly recommend it if you are planning a trip to the city.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Swiss", "Title": "“Nice spot - great rooms”", "Author": "nixxifocal", "ReviewID": "UR59469152", "Content": "I was wondering about this hotel because some reviews here said it was in a bad area. It's not at all. The area is absolutely fine. Five or six minute walk to Metro station (Selva de Mar), go five stops (to Jaume I) and you're in the city centre. Don't even have to change trains and it takes about 10/15 minutes. The rooms are lovely and are cleaned really well every day. There's a swimming pool on the roof (with amazing views) and great steam rooms in the basement. We got a deal on lastminute.com and it was a fantastic bargain.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "London", "Title": "“Shame about the location and the morning staff”", "Author": "hassyho", "ReviewID": "UR58752638", "Content": "I would totally agree with the reviews previous about the location. Cabs really did add to the cost of the weekend. Clean and tidy throughout the hotel, bar food was poor and we didn't receive what we actually ordered and were overcharged, Note to yourself, check your bill if you sign to your room. The staff when we checked out, would not remove anything from the bill as we had signed it. He was very unhelpful the 3 mornings we saw him, he did not add to the ambience of the hotel. The air con system was random, blasted heat nothing at all or freezing. My partner ran the marathon this weekend and was using the gym for training, his comments were, 'really good spa, shame about the lack of working equipment'. The view from the roof top is stunning and I could imagine that when the pool is open it is well worth using and having a cocktail or two at the roof terrace bar. We were recommended 2 restaurants, one in the harbour which was loud very pushy to get you in, and not for us. We ate elsewhere, which was great. The second recommendation was outstanding, an Italian called 'La Tagliatelle', fabulous, best pizza I have had and great atmosphere. Overall value for money yes, Location poor. Would I stay again no. But would definately go back to Barcelona, awesome city.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lancashire", "Title": "“Good Hotel, Location is honestly fine!”", "Author": "HillsHH", "ReviewID": "UR58741484", "Content": "Me and my partner have just come back from staying in the vincci condal mar. I read most of the reviews on here before we left and convinced myslelf that it was a really bad location and it was only a matter of time before we got mugged! It was totally not the case. I wouldnt bother getting a taxi, seems such a waste of money we didnt use one the whole trip, we bought a 4 day pass each for the metro (20 euros each) which you can use to get all over the city on the sub, trams and trains. Barcelona has a fantastic transport system, most days apart from Sunday the metro comes every 3-5 mins, perfect! The closest metro station to the hotel is Selva de mar, about 5 mins walk. The area could seem dodgey after reading the reports on here, we walked back every night after dark to the hotel and hardly saw anybody, only the fact that it was so deserted made you a bit edgy but it was fine. To the center (plaza de catulunya) only took about 20 mins changing at one stop. It is so easy to get around, we used all the public transport and never cabs, didnt seem a point. Hotel is nice and the staff friendly although we were never really there. P.S eating out.... try The Atick on La Rambla it is a brilliant restaurant, even my partner thought so and he is a skilled chef, we went 2 nights in a row, (3 course dinner each and bottle wine was only 48 euros!) and stay away from Hard Rock, Bill came to 50 euros for two mains meals and 2 drinks, it was 9 euros for a malibu and coke!", "Date": "March 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "jasong1970", "Title": "“Not that bad considering the cost”", "Author": "jasong1970", "ReviewID": "UR58027740", "Content": "Just returned from an extended weekend in this hotel, and have very mixed thoughts on it. Cost wise a bargain…. here’s why: The hotel itself is physically okay and decorated to a high standard unfortunately my particular room had malfunctioning air conditioning which made for uncomfortable sleeping, however the presentation of both the bathroom and sleeping area were of a high quality. The down side being thin walls resulting in the ability to here your neighbour (above, below, and to both sides) doing what people do on vacation. There were no tea & coffee making facilities within the room and a small bottle of water from the mini bar was 2 Euro this together with the lack of English speaking entertainment proved to be quite annoying. The small bar area was adequate however it was not staffed at all times resulting in very slow service and high prices. The food served was okay however I was expecting a higher standard than what I received, the style of the restaurant out ways the quality of food served, the buffet breakfast at 10 Euro however is very good value. The location as previous people have commented is not ideal and is in a somewhat if not very rundown area of town (war torn Beirut) with a taxi into the centre of Barcelona costing between 12 – 15 Euro. Overall I would probably choose not to return to the Vincci Condal Mar but more because of its location than its facilities.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Liverpool", "Title": "“Fab if you get a bargin deal, location not all that bad.”", "Author": "Bx-Liverpool", "ReviewID": "UR53854525", "Content": "I was worried about booking this hotel after reading the reviews but needn't have been. I booked this hotel through easyjet and paid 334 pounds in total for flights and 3 nights accommodation for two people which I think was a good deal. The hotel was located about 15 min metro ride from the center of Barcelona and it was about a 4 min walk from the metro to the hotel. The metro was fab no waiting for trains very clean and always felt safe, would definitely recommend the T10 tickets they cost about 7 euros from the station before you get on the renfe train and can be used on the metro bus and renfe train for 10 journeys. We did get a taxi one night which cost 11 euro and took 5 minutes longer than the metro. Most of the reviews I read before our trip said that the hotel was in a bad area that wasnt safe I don't agree with this, the area looks a little run down and isn't the best tourist area but I felt safe and I enjoyed seeing another area of Barcelona. There are other hotels (Hilton, princess and another vinci hotel) in walking distance, a shopping center and the promenade. The hotel was nice clean tasteful and comfortable but it didnt have the finishing touches of a boutique hotel which is how it was described when i booked it, also take a travel iron the cost to iron a short day dress was 20 euro probably more than i paid for the dress other items seemed cheaper. I would recommend this hotel but only if you dont mind getting the metro to the center and if you get a deal to make this value for money.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great hotel and location not but taxis are quite cheap”", "Author": "Persson-Karlsson", "ReviewID": "UR46440069", "Content": "As most people has written, great hotel but a poor location. The upside is that you can go by taxi to placa cataluna for about 10€. The subway cost 1.35€. According to my friend in Barcelona the plan is to make the area a finance district. So within perhaps 5 years the location will be great too.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "1", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Luxurious hotel, questionable location”", "Author": "Pisceanlady", "ReviewID": "UR46001092", "Content": "It is true that the location does look quite intimidating. I went there with my partner for a city break, and when we found the hotel we initially did find the location quite scary. However, upon speaking to the staff, they informed us that, firstly, the location is actually an industrial estate mostly frequented by the workers. Secondly, the surrounding area/buildings will be getting demolished within the next 2-3 years, to modernise and bring it up to date. The hotel itself is very plush and luxurious. The rooms are spacious and elegant, with exquisite furniture/decor. You can have access to the internet from your room. The staff are very courteous and friendly, and are most helpful, especially with directions and organising a cab for you. It is fairly near to the city centre, you can get on the underground metro, and it will take you to the city in under 10 minutes. I would still recommend this hotel, despite the location. It is still pretty safe to walk around there.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Absolutely gorgeous design hotel, but not the greatest area...”", "Author": "Transient23", "ReviewID": "UR45758703", "Content": "I stayed here for one night with a friend on a stopover in Barcelona - the hotel itself is absolutely gorgeous, beautifully designed, the room and bathroom were wonderful!! Unfortunately it's not in a great area, and not very central to the city... It's about a 10 minute walk from the safest Metro station (closer to one that is apparently in a dodgy area, but hotel staff warned us about this) and takes about 20mins to get into the city proper (although the Metro in Barcelona is great), I didn't feel unsafe there during the day and we got a cab back at night but I probably would have been very cautious if I was walking around on my own... Staff were very friendly and helpful, I would recommend this hotel if you're prepared to get taxis everywhere (not too expensive actually) as it is really lovely.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "manchester", "Title": "“Stay well away the area is a no go.”", "Author": "kelly057", "ReviewID": "UR44218810", "Content": "The hotel is very nice the staff do all they can 4u, very pricey 4 drinks 25euros 4, 2brandys & 2 beers. The location is bad with the gipsy's & pick pockets. U really do need 2 watch urself. On our 2nd night we witness a man beating up a woman right out side the hotel & on the 3rd day we spoke to 2 people who had there wallet stolen. We spoke to some locals who said they had lived there for 35yrs & don't go out after 10pm. I wouldn't go back as I didn't feel safe. I do have some photos that will show the gipsy problem so will get them on asap. Kelly Manchester. [--]", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent Hotel, very friendly staff, 5 mins walk from metro.”", "Author": "EllieB41", "ReviewID": "UR38128053", "Content": "The hotel is lovely and the roof top pool is Fab, its a little breezy sometimes but in August heat it was definately welcome! The staff were great and very helpful. The rooms were lovely and room service was every day. The Hotel is 5 mins walk from the Metro and which runs every 4 mins. There is an amazing little shop selling everything and where you can get hot croissants opposite the metro! Its also 10 min walk from Diagonal Mar shopping centre, which has lots of shops and restaurants in it. If you walk down the Diagonal Mar there are lots of little places to eat and drink. The area around the hotel is residential and a warehouse/car rental/working area, its very quiet and we didnt see any trouble even walking back after midnight. I will definately be going back :)", "Date": "August 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Doncaster", "Title": "“Full of intention, tired décor, terrible location”", "Author": "mcha31", "ReviewID": "UR37243980", "Content": "Was described as being in the business area of Barcelona, more reminiscent of a war zone. Upon arriving at the hotel we saw that the decoration was very tired and fraying in the lobby, although you can tell that the decoration was well designed and thought out when first built! We had been there no longer that ½ hour before some one that was staying there told us that there had been an armed robbery in the lob the evening before. We stayed there the one night and then moved!!", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“DO NOT BOOK WITH BOOKINHOTELS.COM FOR ANYTHING!”", "Author": "VFM10", "ReviewID": "UR36959382", "Content": "Having stayed at Vincci Conal Mar before and been impressed, we knew what to expect with the hotel. Unfortunately, after finding the best rate in the internet through bookinhotels.com, and paid in full, found that they had cancelled our reservation and not paid the hotel! This had also happened with 4 other friend staying there! It was lucky that they had space for us and we had to book in fresh and pay all over again! On calling bookinhotels British number, we went through to Turkey, where the phone just rang out. After a tiring trip from a camping week, this was the last thing we needed. NEVER USE BOOKINHOTELS.COM! They take your money and dont pay the hotel! Luckily the Manager, Roger, was a wonderful gentleman and managed to get hold of them and get them to agree to refund our money (although not yet received) and to give us a favourable rate on the room. The hotel is modern, well designed and has everything you could wish for.Ther are plenty of friendly, english speaking staff and good food and classy restaurant, (if a bit pricy with the exchange rate).It is not very central but there are shops/ cafes nearby and its just a few stops on the yellow metro to Juamie I from selva de mar (5 mins walk from hotel)We would always stay here in Barcelona, just be careful who we book through....", "Date": "August 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Nice Hotel, Shame about the Location”", "Author": "steveB1981", "ReviewID": "UR34443734", "Content": "We stayed here for 3 nights over Easter and overall had a nice stay. The hotel itself is quite an impressive building and looks nice but I'm not sure if it was just our room or whether generally there has been a lack of repair over the last few years. Our room had tears in the panels behind the bed and big chips on the tables. This isn't a huge problem but it does make the room look a bit ugly. The bathroom was very nice and the shower was excellent. The breakfast was excellent with lots of different breads, cakes, fruit to choose from. The staff on arrival were a bit unhelpful (i.e. just idly chatting behind the counter while we waited to be checked in) and when we were told we couldn't check in as we were too early it took 10 minutes to get somebody to serve us a drink even though the bar was supposed to be open and when she did serve us she made it feel as though we were inconveniencing her. The hotel is located a bit out of the centre (20 mins by tube to the centre) and is surrounded by factories and some old housing estates. Although these didn't look particularly nice there was no sign to us as to whether it is a bad area, we thought it is just dated. We walked back from the metro station each night and felt safe although we did always walk together. I was going to give the hotel 4 as we knew about the location before we booked the hotel but the friendliness of the staff (although this tends to be generally OK from looking at other reviews on here) and also the lack of maintenance in the room made us drop a mark. I would consider recommending this hotel to others but would definitely make sure they knew about the traveling involved to get to the centre in case they wanted to be a little closer to the action.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Cornwall", "Title": "“Modern clean and comfortable......location poor.”", "Author": "suzi_woozi", "ReviewID": "UR30377602", "Content": "Having just returned from a short break in the Vincci condal mar i felt the need to inform others of what to expect. The decor and comfort of the rooms was excellent the room was very clean but not everything worked and the views are industrial. The staff, food and public areas were great no complaints there. My main problem was the hotels location it was in a very run down area with nowhere to eat or drink nearby, and although the nearest metro is only a ten min walk its not the type of area where you want to be walking around after dark if you are travelling alone.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "phoenix", "Title": "“Chic, Modern, good service, iffy location.”", "Author": "tomjet3", "ReviewID": "UR29258486", "Content": "Modern and clean rooms although air cond. seems to be lacking, good firm beds. Good am breakfast (added charge). Staff was great and very accomodating. location seemed out of the way but close to other major hotels, a good shopping mall and metro stop (all easy walking distance) only 10 minutes into city center via Metro (which is cheap, safe and excellent but closes at Midnight) always look for hustlers and pickpockets everywhere. neighborhood seems safe and was mostly industrial and empty during our stay.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Mixed Feelings”", "Author": "Cigarfreak", "ReviewID": "UR28513590", "Content": "First of all, this hotel is not bad at all. For the travel who like the contemporary design and style, this place is the spot. However, there are a few down sides. First of all, the hallways are extremely dark. You need a few seconds to adapt once you get off the elavators. I also think the quality of furniture used in the rooms look better than they actually are. Top notch for the looks but the quality and practical usage of the chairs and closet are terrible. If you spend only a few hours duing the day in the room this will not be a problem. There is no way you can unwind in the room. The rooms are not that well insulated. You can basically here everything going on in the rooms beside as well as above you. There was a baby in the room right next door and kept us up all night. Not to mention a very loud couple upstairs. If you are a light sleeper chances are high you will wake up. The bathroom is stylish. Not practical at all though. The sink will have stains all over it after the first use. the whole place looks great if you do not use it. The terrace and the pool upstairs is cool but again not practical at all due to the wind. Location is a bit off too. unless you really need to be in the area, I would not recommend staying in this side of town. It would be a 10€ cab ride to the heart of the activities regardless of the part of town. The subway station is a good 15minutes walk, after which you will ride another 15-20 minutes to reach the Rambla area. Although I did not encounter any major problem with this hotel, I would probably not stay there again due to small issues that created unpleasant moments. If you can bear the issues outlined above, you will have a good stay. If not, all the beauties of Barcelona will come with a touch of an unpleasant hotel experience.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Great hotel!”", "Author": "saffainlondon", "ReviewID": "UR28140412", "Content": "My boyfriend and I stayed here over Easter weekend after we picked up a secret hotel deal on Lastminute.com. This hotel is amazing and the staff couldn't be any more helpful. They were even happy to help with getting ice for a hurt foot or allowing my phone to charge at reception. If you need to know any information about Barcelona, then they were able to answer any question and provide recommendations. The hotel serves a buffet breakfast for €10 pp, it is more of a continental breakfast than a fry up though. However we found it more than adequate. The hotel is located a bit far out and it did take a while for us to get to and from the hotel. I think next time we would stay nearer the central part of town. The area is more of a business area then touristy. However it was very quiet. The room was a bit stuffy and I think the air con could have worked better, but there were plenty of windows to open and no noise from outside. There is a very good shopping centre about 5 min walk from the hotel and it has a wide selection of resturants and shops including Mango and Zara. I think this hotel is aimed at the business travel but I would not have a problem recommending this hotel to anyone else.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Salford", "Title": "“Great hotel, a little out of the way.”", "Author": "nodmans", "ReviewID": "UR26012876", "Content": "After reading the views on Trip Advisor and other sites, I was a little wary when booking the Vincci Condal Mar. Its a great hotel, just a short walk to the metro Station. We went Friday - Monday and on saturday it wasnt a problem getting back to the hotel as the metro runs all night. Only criticism is the pool doesn't open in April. Paul", "Date": "March 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "milan", "Title": "“nice hotel close to the convention center”", "Author": "Rob77Milan", "ReviewID": "UR25913452", "Content": "this hotel is ok if you have to go to the barcelona convention center. It's very close, you can reach the center by foot in ten minutes. you can easly reach the city center by metro or by taxi. the rooms are clean and big and the reception personal is very kind. I advice this hotel if expecially if you are on a business trip", "Date": "March 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Oxfordshire", "Title": "“Fantastic Hotel, would go back again!”", "Author": "lottiehalli", "ReviewID": "UR25863571", "Content": "This Hotel was lovely, very clean and comfortable. very stylish too.The Room was very contempory and the bathroom was really nice too. The main reason why I am leaving a review is because of the location. When I read all the reviews before I went I was very worried about how far away it was, However it was a 8 minute walk to the Metro (Selva Del Mar) Which took you right into the centre or anywhere you wanted to go. A Three day pass for the metro which also included busses trains and trams cost 15 euro's this also included to and from the airport by train and metro. I purchased this ticket from the information desk at arrivals in Barcelona airport. The area around the hotel is more of a business and residential area. so nice and quiet, lovely if you want to get some sleep after a long day or night, sightseeing or partying! The staff at the hotel were very friendly, and helpful. I would definately go again to this hotel. thumbs up from me.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "1", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Elegance, but Stands Alone in Barcelona”", "Author": "GT05", "ReviewID": "UR24708171", "Content": "My mate and I (both in our early 20's) stayed here in January of ’09, on our seventh stop on a round the world trip. We found the Vincci Condal Mar to be an upscale hotel, with elegant new rooms, good staff, but in not such a good location. We stayed in a standard double room, which included two double beds, a work desk, a bar fridge, a couple of cupboards, a widescreen TV, an air conditioner and heater, an in room safe and a stylish new bathroom including a toilet, a bidet, sink and bath/shower. The room was pretty luxurious and had the little extras (eg. bath gel, shower caps, etc) that you would hope for in a stylish hotel. The room was very comfortable and clean. The shower was easily controlled in terms of temperature and had good water pressure. The hotel does offer a mini bar, internet and in-room movies, but all were rather expensive. My traveling companion visited the gym during our stay and reported that it was simply a couple of treadmills predominately. The roof included an outdoor pool and some good views. Unfortunately, the pool was closed during our stay, after all it was winter. Sitting by the pool having a look at the view and hearing the water crash from the beach would probably be rather refreshing on a hot summer’s day, but I don’t know that for sure. In terms of location, my mate and I were trying to decide between this hotel and the Vincci Maritimo Barcelona hotel which is part of the Vincci chain. We chose this hotel as it had the fitness center which my traveling companion wanted. Honestly, during winter especially, I would have preferred to stay at the Maritimo Barcelona as it was a 1 minute walk from the Selva De Mar train station and just over the road from the Diagonal Mar shopping center. The Vincci Condal Mar is further north, away from the beach area, and is about a 5 to 10 minute walk from the nearest train station, Selva De Mar, and about the same from the shopping center. This made the Vincci Condal Mar stand out in terms of its location. It really is just planted in almost a no mans zone, near nothing much. It is also about a 20 euro cab ride from the Estacio de Franca train station (one of the international train stations). In terms of time it takes to get into the city via train, from my memory, it’s not the 30 minutes that some people are reporting. Much closer to 15 or even 10 minutes. The restaurant or bar at the hotel appeared rather expensive, and so we never ate or had a drink at the hotel. Instead we had a couple of meals at the Diagonal Mar food court area where you can find different cuisines to suit your tastes. The other annoyance we had with the hotel was the fact that after asking for separate double beds, we got to our room to find two double beds pushed up against one another. Now, being two guys, it’s not the most comfortable thing having to sleep in such a close proximity to one another. But this again, was simply an annoyance and I’m sure we could have separated the beds a little if we could have been bothered. We booked this hotel through Expedia which offered a very decent rate. I’ve attached a couple of pictures, hopefully helping those unsure of whether to stay here or not. The hotel was very comfortable and had nice views and decent staff members. Unfortunately, the location really lets the hotel down, and so I’d definitely try to book into the Vincci Maritimo Barcelona hotel over this hotel, for convenience purposes. If I couldn’t get a room at the Maritimo, then I’d be happy enough to stay once again, at the trendy Vincci Condal Mar.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "UK", "Title": "“Set Your Expectations Right”", "Author": "DawnCK", "ReviewID": "UR22314877", "Content": "The hotel itself is a modern, aesthetically interesting building. Throughout our 4-night stay there, we are of the impression that the management of this property are doing what they need to do to maintain the bare essentials of the building. However, although it is a relatively new building, it is already showing signs of some wear with apparently no attempt to fix issues whilst they are still easily repaired. For example, the seating in the lobby looked worn, one wall in our room was soiled, lamps looked tired. The place essentially looked unloved. We also felt that the staff, whilst professional and efficient, were not hospitable. They did not do anything to make guests feel welcomed -- everyone was polite but rather impersonal. This hotel would appear to cater to business travellers who would have no compunction with travelling by taxi to and from the hotel. It is, otherwise, a 5- to 10-minute walk to the nearest Metro or tram station. It is not that bad but leisure tourists would probably find this a rather inconvenient place to lodge. On the plus side, the staff were efficient. On our second night, we discovered that there was a problem with the plumbing -- there was no cold (?!) water. When we informed the front desk, we were told that there were problems on our floor and promptly provided another room. Then again, I guess, they should have informed us of the problem since they were already aware rather than have me find out when I was already stripped and bare in the shower. Because it is located in an industrial area of the city, the hotel was also quiet and we were unmolested by noise, hustle and bustle. Not an unpleasant stay in all, certainly helped to no end with the fact that we had booked the room at a ridiculous rate through lastminute.com. Don't expect the world from this hotel and you will walk away surprised by how pleasant the stay actually was.", "Date": "November 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "torquay", "Title": "“walk on”", "Author": "iangoalfar", "ReviewID": "UR22024532", "Content": "very modern hotel with comfottable rooms. directions to the hotel could have been clearer . if u like walking then its fine.", "Date": "November 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York", "Title": "“Nice hotel and a nice area despite some other comments”", "Author": "maffyoo", "ReviewID": "UR21880745", "Content": "I'm sure most people reading the other reviews and looking at any aerial shots of the location of the vincci condal mar may be a bit concerned about its location. all i can say is that its actually not bad at all when you get there... a block toward the diagonal mar from the hotel is a demolished building it isnt too bad though, and the streets are clean and generally quiet. I stayed at the condal mar whilst attending a conference and walked everywhere, including late night/ early evening walks between the hotel and the diagonal mar, as well as towards Avinguda diagonal. Generally i found it very quiet, i was quite surprised by how many families and people walking there dogs there were in the area. A dog is clearly the pet of choice in this part of Spain. Generall the hotel was great, with one exception. Im sure most Brits will be a slightly perturbed that there aren't tea or coffee making facilities in any of the rooms. the rooms themselves are very tidy and extremely nice if you like something more modern. the atrium of the hotel is worth seeing, as is a trip up to the top floor where there is a bar area (used in the summer i assume) and a swimming pool (also used in the summer i assume) the views are great. Generally i was very happy. unfortunately i didnt have time to travel into the city due to the long days at conference, but the diagonal mar has plenty of places to eat and most were reasonably priced and the food excellent. This leads to my only gripes about the Condal mar. 1. The japanese 'fusion' restaurant is VERY expensive for what you get. the food was good but there was very little. i had three courses (max available) and was still hungry 2. The bar area in the reception area, the private-ish seating is great but the service was absolutely terrible, many times myself and colleagues simply paid rather than order more drinks, we also noticed that quite a few locals came in had a drink and then walked off without paying. They really dont seem to be on the ball with that one on reception. If you stay and find it hard to get any service, go to reception, they seemed to be able to get hold of the barman wherever he was", "Date": "November 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Limerick/Cork Ireland", "Title": "“Nice but off the beaten track”", "Author": "NeanderthalBoy", "ReviewID": "UR21183516", "Content": "We stayed here for 5 days in October. It was a last minute trip and I didn't really have much of a choice in hotels. This is a really modern looking hotel from the outside and this continues inside. The room we had booked was pretty small and we were disappointed with the lack of tea/coffee making facilities or an iron in the room. The staff in general were very friendly efficient and helpful. Any problems we encountered were dealt with quickly and politely. The pool unfortunately was closed for the duration of our visit which was disappointing but we later found out that this always happens for the winter months. The gym is small but adequete. The hotel is about a 15 minute (brisk) walk from the beaches and 7 or 8 from the nearest metro and tram lines which service all the major tourist sites in the city with a change or two. Overall the hotel is probably aimed more at business travellers than tourists and is a bit too much off the beaten track", "Date": "October 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bognor Regis", "Title": "“would go again”", "Author": "PaulaPratt", "ReviewID": "UR20139539", "Content": "A lot of people have written about the 15 min walk to the metro all i can say is they must walk really slow the Hotel staff suppied a map and directions to the Metro it took us 3 min to walk there ,jump on the yellow line and 3 stops and you are in the city centre. the area does look run down but this seems to be the norm in the outskirts i loved the Hotel and we never felt unsafe walking back at night.The rooms are very modern and room service was good and not a rip off i cant wait to go back to Barcelona and this hotel", "Date": "September 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Greece", "Title": "“Lower than expectations”", "Author": "Mariagreece8", "ReviewID": "UR20001943", "Content": "We went with my husband to Barcelona and stayed at Vincci Condal Mar Hotel for 6 nights. I had read the comments about the area on your sight and i have to admit I was rather scared. The hotel is situated far from the city center in an industrial area. The metro station was rather far (15 minutes of walking in a dodgy area). We arrived on Saturday and everything was closed, so the area seemed even worse. The trade center DIAGONAL MAR is not far, but you have to go through an isolated part of the city that seems dangerous. The hotel was rather clean but the staff was inpolite and the breakfast was average. Overall I would not stay at that hotel if I visit Barcelona again, not because of the distance but because of the area. There are other hotels situated on the Diagonal Mar at the same price that offer better accessibility to the metro and bus stations.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Stunning hotel, Great ambience”", "Author": "jonkburrage", "ReviewID": "UR19354386", "Content": "What can I say! Some people complain about the walk from the city being a bit far...my partner and I did this trip on a shoestring, really, £0.04 for return flights from newquay, uk to barcelona with ryanair (thats for both of us) and then we got this hotel for £40 for a night on lastminute.com. Saw people complaining about the walk but we enjoyed a leaisurely, if prolonged walk along the waterfront at night with our luggage to get to the hotel, it took 45 mins of so but we were ambling. It was worth it. The hotel is in a stunning location just off the eastern end of diagonal mar near the shopping centre and beach. Its a modern marvel, feels like somthing from thunderbirds! The rooms are great, spacious, the bed was incredibly comfortable, the service was top notch and the price was unbeatable....what can I say, I want to go back now!!!", "Date": "August 25, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Staffordshire", "Title": "“Style over substance”", "Author": "S_G_Taylor", "ReviewID": "UR17431486", "Content": "They made dreadful mistakes with our booking - a good job we phoned them before we arrived - they only had us down for 1 night rather than the 3 that had been paid for. OK looking hotel, modern rooms but very poor quality. Not at all practical and there was a glass sliding door (that had come out of its runners so just hung there and banged when you moved it) between the bedroom and the toilet. Everything else was just about OK. Because of the modern rotunda style of the hotel the bedroom windows were definitely not designed to look out of. They were extremely narrow and poky. Location just about OK. Wouldn't want to be walking around there late at night though. Use a cab. The package we had included F1 Grand Prix tickets and coach transfers. The hotel denied all knowledge of this and from that point on just lied to us. Once we proved the booking they told us they would be getting the tickets but that there was no coach transfer. We were then told to just turn up at the racetrack with our voucher (that would have been fun!!!) and they would let us in (no they wouldn't have and we would have spent over an hour and a half getting to the track). As the whole thing had been booked by El Corte Ingles department store, we decided to go there and they sorted it out. It became extremely apparent that if front of desk and the administrators behind the scenes don't know the answer to something, they just make it up. The tickets were at a sister hotel and there was a coach coming but they just didn't know about it. A very stressful time and a waste of one of our precious days trying to sort it out. Even without this problem the front of house are awkward and obstructive. Very poor customer service.", "Date": "July 2, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "uk", "Title": "“Great modern hotel for a fantastic price”", "Author": "twiggyholly", "ReviewID": "UR14961332", "Content": "Stayed here for just one night at the beginning of April. Alot of the other reviews say it is in a bad area, but I really didn't see that! It is literally 100m away from a very nice redeveloped area, and less than a 10min walk to the beach. Me and my partner arrived late in Barcelona, and decided to walk to the hotel from the bus station in order to get our barings. It is quite a long walk (50mins roughly), but a really great thing to do in order to see some sights that the tourists dont usually see. When we arrived, check in was quick and painless, and the room was really really nice. Fantastic modern design with all the little extras you could want. In order to get around barcelona, me and my partner opted for the bus turistic. It has a stop not too far from the hotel and goes virtually everywhere. Well worth it for a short visit. I wish I had spent longer at this hotel. I also wish I had been there in may when the swimming pool on the roof is open. Overall, this is a fantastic hotel for the price (we paid £47 for the room) Dont be put off by the distance from the centre, there are many many transport options.", "Date": "April 11, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vancouver", "Title": "“Good Hotel...Tough to find...”", "Author": "BrendanVancouver", "ReviewID": "UR14537853", "Content": "Overall it was not a bad experience. I will admit that I spent 20 hours flying and then arriving in Barcelona late at night just o catch the last train to the city centre and then cabbing it from there. The cab ride did cost about 20 Euros but I was hot, tired and sweaty and would have paid twice that. Even the cab driver had a bit of difficulty finding the hotel. Arrived thankfully just before a tour bus and after a little trouble at the front desk with my reservation was up to my room. The rooms have a truly modern design, if you look very closely the wormanship does leave a little to be desired but nothing ghastly. I stayed for 3 nights and received a good deal through a website. Had a nice room on the lower floor, spacious and clean. I have read the other reviews of the neighborhood being dodgy, it is not overly bad. If you are a female travelling alone maybe it would be questionable but as a late 20's male by myself I never felt unsafe. The rooftop pool is pretty amazing and busy during the day as well. I had breakfast in the restaurant all three mornings and if you are looking for the typical amercian breakfast this is not for you. Very European with cold meats and cheese's and different breads with some hot items as well...personally I loved it! The walk to the city centre is a bit of a distance but not out of the questions, if you are a young group or couple it is a stylish hotel.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London, England", "Title": "“Avoid at all costs!”", "Author": "TheBigKoala", "ReviewID": "UR14491529", "Content": "Appearances can be deceptive, this is a poor hotel. We should maybe have known things were not going to be good when the taxi driver told us that this hotel is just on the edge of a \"very dodgy area\", but being from London we are used to dodgy areas so this didn't phase us... We were first given a very substandard room, very dusty, bathroom door handle hanging off, light fittings not screwed in, chipped furnishings throughout... although we had booked through a travel website we were still paying a significant amount of money and so complained and were offered a new room (next door) which was the same style but of a significantly better quality, which led us to believe that the room we had was reserved for the particularly stupid... Apart from this, the hotel is FAR from the centre of Barcelona and you will be obliged to take public transport for at least quarter of an hour (after a ten minute walk) to get anywhere near where you would want to go... can you afford to be wasting a one-hour round trip of your precious holiday time? We thought we were being clever by saving a little money staying further out but the constant taxi fares of ten to an unbelieveable eighteen euros (if they felt like taking an unfeasably long route) add up. Five nights of these cabs took its toll on the pocket. The little piece de resistance for this hotel, apart from the fact that after asking for a late 2pm checkout we were called no less than five times after midday by the reception to remind us to get out, the maid thought it would be nice to steal five euro from us. I know, we should have put it in the safe but it was stolen just the same. I've stayed in some dodgy quarters in Barcelona but never knowingly had stuff stolen from me before but I guess there is always a first time. So, my advice would be, stay somewhere else. Stay central and save on cab fees. Ask yourself - why does this hotel have lots of rooms free in busy periods when the rest of Barcelona is jam packed?", "Date": "March 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“modern through and through”", "Author": "ne-wanderingfree", "ReviewID": "UR11328399", "Content": "Extremely attracted by low price and photographs of hotel. Drove down for a couple of nights from Southern France but didnt find the hotel easily. We were very lucky with the weather for early time of year. A bit concerned over appearance of area at first but the area seems to be enjoying regeneration and lets face it for prices like this for such a stunningly modern, new hotel a bit of road and path restructure can be accepted, at least there was free on street parking. The rooms were fabulous and faultless with attention to detail and quality fittings. The structure of the hotel was a bit daunting when you look over the central open area down to the ground floor, the rooms are on the outside of the round structure, but that adds to the thrill of the building. The view from the rooftop was fabulous across the city, even at night, but be careful out of season walking on the roof, as we walked enjoying the view we almost walked into the unlit open filled rooftop pool, could have been a great funny story, but probably unpleasant at the time. The only downside was the distance from the city centre, quiet a walk if you want to remain above ground and take in the sights. We didnt eat in the hotel so cant help out there.", "Date": "December 8, 2007"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lisbon", "Title": "“Nice hotel, bad service”", "Author": "GosiaLisbon", "ReviewID": "UR11263124", "Content": "I like the hotel: very modern, very design. Maybe the design of the bathroom was a bit exaggerated as the door was kind of transparent and did not close properly. But apart from this yes, it is a nice hotel. It is not in the centre but not far from the metro station and in a few stations you are in Barrio Gotic. On the other side, if you came by car, you will have no problems parking on the street. Now.... the service was bad. There was this woman in the reception who was rude and who did not really make an effort to accomodate our requests as they should in a 4-star hotel. I got better service in 2-star hotels.", "Date": "December 5, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "birmingham", "Title": "“Really mordern and fancy !!”", "Author": "loubirmingham", "ReviewID": "UR10962241", "Content": "Booked through octopus travel, loved this hotel, really good price for the hotel stay , would go back and back again, not in city but across the road is the tube station that gets you to all the site sin 5 mins anyway !!!! I loved it !!", "Date": "November 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "England", "Title": "“BEWARE!!”", "Author": "cant-wait-2-go-NYC", "ReviewID": "UR10318558", "Content": "The location was shocking, we nick named it the Bronx! The staff were most unhelpful especially went my aunt had her purse stolen at the bar(broad day light)!The staff could hardly speak english and would not write a report about the inncident. The best thing about the hotel was the view from the roof , it was fantastic! All in all i would not stop at this hotel again.", "Date": "October 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "nyc", "Title": "“Such a strange building”", "Author": "svandenhoven", "ReviewID": "UR10055824", "Content": "That was a pretty nice hotel, brand new (I'd say 2 years), with a nice view over Barcelona and the hills around. The pool on the roof was closed in February. Why not heating it ? Modern design inside, room was large, bathroom wall made of glass (you can see through, funny!) The only thing to complain about is the location, wich is a little bit out of the main places to visit (not that far from the subway station, and then a few stations from the centre). I won't recommend it for a single lady by night, the area was a hudge warehouse, and they are rebuilding it as residential. So, absolutely no night-life.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "midlands UK", "Title": "“great hotel, shame about the staff”", "Author": "chopper666", "ReviewID": "UR8470438", "Content": "hotel was very nice - quite newly built with a very modern design. unusual or \"modern\" bathroom layout depending on your perspective. brown glass sliding door to bath/shower /toilet /bidet - whole wall made of glass. not exactly see through - but enough so you could see if some one was sitting on the loo. a distinct lack of privacy! wash hand basin out side of this glass area. had breakfast once - food was very good only problem was the staff - reception staff were very very slow to do anything - appeared disinterested in helping us / checking us in or out etc. no-one said hello / good bye as we entered or left hotel - even when we said it ourself. No rush at all - which can be very frustration when all you want to do is check in! a little isolated - easy taxi ride to port vell / olympic. i suggest the tourist bus - gets you to the main areas overall all i would stay there again , at a push, but would have a low expectation of reception!!", "Date": "August 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Alsager, United Kingdom", "Title": "“Easily worth the extra travel!”", "Author": "icecool16", "ReviewID": "UR8108693", "Content": "When myself and my girlfriend were booking our trip to Barcelona this was the first hotel that caught my attention on Expedia. It seemed extremely attractive, both in terms of price and appearence and guess what; it is! The rooms are fantastically modern but not in the sense of them being overpoweringly 'whiter than white' and they provide all the comforts of a top class hotel. As students we wanted to stay in the nicest accomodation we could afford without frittering away our budget on what was basically a bed for the night. With the Vincci being a little outside of Barcelona it was the perfect dichotomy for us; cheap and 4-star! The area (as I remember being commented on before) is a little rough round the edges and I will admit to feeling a little threatend when we first stepped off the metro in the dead of night (my advise; metro by day, taxi by night; simply for piece of mind!) However despite this we were soon accosted by a friendly Catalan whose little English was even worse than my little Spanish but who still tried his best to give us directions to the hotel. We did, however, stil end up lost as the hotel is in the middle of surrounding building works and not easy to find in the dark! However, in the day it is an easy walk to the metro station and a short ride into town. By night the most expensive taxi we paid for was about 15euros - easily worth paying considering the saving on the hotel! The staff were excellent to us but then I attempted (as i do on every trip I've been on) to converse mainly in their language or at least to simply say 'hello' 'good-night' etc. I did observe a manager give a rather rude response and angry glare at a late-arriving Australian who announced himself with a 'g'day mate' but then my personal opinion is he was well within his rights to do much more than give him the evil eye! If you are the sort of person who expects staff in hotels in major cities to speak excellent English 100% of the time though and think this is part of what you pay for to stay in an unpmaket hotel then this is probably not the place for you! However this is the only gripe I would suggest you COULD have about the place. We did not eat the food but it looked fantastic. If money is no option to you then you may wish to stay in central Barcelona and forgoe the extra transport but then what's the point in that when you could stay in luxury, save some money and trade living on Orwell's doorstep with a simple, comfortable, cheap 10minute metro ride?! Highly recommended, I would certainly go back... provided some other Catalan is prepared to give me better directions!", "Date": "July 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Deerfield Beach, Fl", "Title": "“Beautiful Modernista Style building in horrendous location!”", "Author": "AlexRen", "ReviewID": "UR7845661", "Content": "My wife and I picked The Vincci Condal Mar because of its close proximity to the Forum, where we would be attending the Primavera Sound Music Festival. We were quite impressed with the modern, modular look of the hotel from the pictures we saw on the website. And, I will admit, once we arrived at the Hotel, it was quite simply a marvel. Unfortunately, the hotel is located in a very industrial area, with a factory literally right across the street. We were told that it was located in an up and coming part of Barcelona, honestly though, there is nothing “coming up” in this part of Barcelona except for the thick clouds of smoke emanating from neighboring Factory’s chimneys. The Hotel is also about a fifteen minute, seven block walk from the nearest metro line. The hotel’s website states that it is 500 meters away from the metro line, that is an outright lie. On the bright side, the hotel rooms are very clean and also maintain that cylindrical shape of the hotel, which we thought was very neat. The staff is also courteous and helpful, if asked. It is probably one of the better hotels we have stated at this price range; it’s just a shame about the location. A taxi into the more picturesque parts of the city cost about 12 euros. If you are a tourist who plans to see the city, Barri Goti, Gaudi architecture, and Las Ramblas, you are better off staying closer towards the center of town. If you are a business traveler attending a conference in the Forum area, you are still better off finding a hotel closer to the Diagonal Mar Shopping area, as this hotel is nearly one mile away from the Forum area. Overall, the hotel is a wonderful architectural spectacle with good service, clean rooms and comfortable beds, but there is a reason why this hotel is so nicely priced. The Smog! The area is so miserable that it makes it hard to recommend this hotel", "Date": "June 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ireland", "Title": "“Ignore the Critics, our stay was brilliant!”", "Author": "StarIreland", "ReviewID": "UR7197535", "Content": "Before arriving at this hotel, I had my doubts after reading some reviews...The hotel is exactly as it shows on the website, amazing, stylish hotel with the staff being professionally pleasant all the time...The buffet breakfast is something to write home about as it was supurb, whatever took your fancy for breakfast, they had it! I will say it is a bit from the Ramblas but your on holidays! Order a taxi and within 5-10minutes your there with the worthed charge of €10. We extremely enjoyed our stay and would recommend it to friends and family!!", "Date": "March 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, UK", "Title": "“Nice place, shame about the nieghbourhood...”", "Author": "phaeochromocytoma", "ReviewID": "UR7184489", "Content": "Once again, we were seduced by the website photos and didn't look too hard at the location. It's 20 minutes from downtown on the metro, then 10 minutes walk to the station through an industrial area (building sites, warehouses, vacant lots). No cafes or shops nearby. Hotel interior lovely with a very modern design and great rooms. Charges for wifi/ broadband are 15 euro per day - a con when other places in spain provide it free... Service at the hotel bar was a little erratic", "Date": "March 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Hotel”", "Author": "rtwtrip", "ReviewID": "UR6936316", "Content": "I have to disagree with alot of the other reviews on the site as this hotel is a great find. Firstly, I got a real cheap rate which was the best deal in town. The hotel itself is brand new and has first class staff & service. They were really helpful. The hotel itself looks great. While a lot of people complain about the location but I think it one of its best features. Two blocks or so to the Metro or Tram in what is a SAFE area. Maybe a little quite at night but it by no means unsafe or anything to worry about. There is alot of construction going on within the immeidate area, so it going to get even better in a year or two. Glen", "Date": "March 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "London", "Title": "“Hotel fantastic, gypsie site 2 blocks away not so good”", "Author": "samwho", "ReviewID": "UR6606396", "Content": "The welcome my girlfriend and myself recieved was uncomfortable, the staff said very little and we not welcoming.. With exception, a young Brazillian man called Tiago a reception worker pretty much made the hotel experience enjoyable, easy going and he was approachable on helping us out to find places within the city and chatting with us whenever we passed by and very he was very polite , The room was amazing, the mini bar was used and when i came to pay the bill reception staff replied the mini bar was on them,which was very kind seeing through the fact the champayne was cracked open On route to the metro, our means of getting to the city was uncomfortable as there was a pikey camp site 2 minutes away from the hotel which was abit daunting as I was carrying the euro's I Couldnt wait to spend were in my pocket. the breakfast buffet was amazing and worth paying for as the selection and variety was amazing.. the shopping centre 2 mins down the road is great and has loads of resturants attached which i would advise are visited as the view is great. The hotel itself gets 9/10 but the construction site built up around it has affected my overall view of the hotel in more ways than one.", "Date": "January 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Amsterdam", "Title": "“terrible breakfast”", "Author": "ChrisZegers", "ReviewID": "UR6325769", "Content": "This hotel looks new, but is put together very cheaply. Things start to fall apart already. The swimming pool is not heated and was absolutely freezing when I tried it, although the air temperature was a nice 25 degrees. The worst thing is the breakfast; an absolute joke. The coffee tasts like it was made a week ago and reheated 6 times. I will never go here again.", "Date": "December 4, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“A disgusting experience”", "Author": "UKCityCouple", "ReviewID": "UR6133296", "Content": "My wife and I had a terrible experience at this hotel. In the wardrobe in our room, one of the drawers had a large brown smeared mess in it which looked and smelt like someone had gone to the toilet in there! We were disgusted and appalled and called the manager on duty, Nicolas to the room. He looked at it, the head of cleaning came and removed the drawer and later replaced it cleaned. The manager said he would get back to me with how he was going deal with the problem. I expected an apology and some kind of compensation, however, he/the hotel took no responsibility. His response was that he didn’t know how it happened and he implied that we could have done it. Don’t stay at this hotel, it may look lovely and modern but this horrible experience and the insulting service attitude was the worst I’ve ever experienced.", "Date": "November 15, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Woodstock, New York", "Title": "“Thanks but no thanks. Never returning again”", "Author": "mlomagno", "ReviewID": "UR6060394", "Content": "Stayed here for two nights from Oct 10th thru Oct 12th. Hotel was easy to find since we know the area very well and have stayed at other hotels in the vicinity. First, there are people who claim that the hotel is far away from everything. Absolutely not true. They are very spoiled or do not know what they are talking about. The metro is a few minutes walk away as well as the tram. The Diagonal Mar shopping center is a few minutes walk too. True, the hotel is located in a quiet part of town which is going through a complete transformation but I would hardly call it unsafe. There were plenty of people living around the area in all directions. There are many businesses there too so the area is not filled with tons of people but the streets are clean, well light, and no danger present. Check in was fast and friendly. Hotel room was interesting. Despite it being a newish hotel, we noticed in our room many things that seemed to be a sign of poor workmanship. We noticed things peeling, parquet floors that were not measured and cut correctly. Too many signs of wear and tear for a new hotel. Also, not that I am a prude but I found the interior space poorly planned especially the bathroom walls. How can you have walls made of clear glass in the bathroom so that everyone else in the room can see you squatting on a toilet seat. No thank you! Room was clean and sufficient but nothing to rave about. Breakfast was mediocre. The head waitress, Bea was aloft and rude. She was too busy critiqing the other staff than analyzing how she operates. She asks us if we want coffee and then we have to wait several minutes because she was busy making some breakfast for someone in the back area. Several people who came in after us were served first. And it seemed that if you did not come in wearing a suit, you were not worthy of notice. We asked her two more times and each time showed indifference. The food was very bland. Nothing tasted decent. The eggs were water. The tortillas were void of taste. No real selection of fruits or yogurts. Overall, hotel was not horrible but I would search for a better deal elsewhere on expedia when I go back to Barcelona.", "Date": "November 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Excellent hotel, great price”", "Author": "PopPrincesa", "ReviewID": "UR5981792", "Content": "We stayed there for a couple of days in September and it was a lot better than we were expecting. It is modern and clean. For the price we paid, I think it was a fantastic deal. Breakfast was diversed and delicious. I would rather stay in a decent place than in one of the filthy and overpriced hotels in the centre. If you can't be bothered to walk to the tube station (it is a good ten minutes walk), a taxi will take you quickly to the centre for around 7 euros, which is not too bad. Print a map of the hotel area so you will never get lost.", "Date": "October 21, 2006"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London", "Title": "“Bad location and service”", "Author": "Girl_on_breaks", "ReviewID": "UR5903220", "Content": "The location of this hotel is too far away from central barcelona. We booked it as it looked like a nice boutique hotel with a pool at a great price... but the cost and time to travel to port olimpic, plaza catalunya and las ramblas, for example, (10-15 euros in taxi, 20 euros to top of diagonal/tres torres area) made it expensive. It would have been better to pay slightly more for a room in a central hotel. Also if you get the hotel to book you a cab, there'll be a callout charge already on the clock of 1.55 to 4 euros. The surrounding area is underdeveloped, quiet, industrial and not a pleasant walk (10 mins or so) to the metro and tram - definitely not at night. There are people living in shacks on rooftops around and the general area doesn't feel secure. Also, we had a problem in our room and it was handled really badly and rudely by the staff and not resolved.", "Date": "October 3, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bath", "Title": "“Great Hotel”", "Author": "Davej1", "ReviewID": "UR5811998", "Content": "We recently stayed at the Vincci Condal Mar , and I would have to say that we had a wonderful time , the rooms were excellent and staff were very helpful , the only area that was slightly disappointing was the wait at times at the hotel bar , but this was soon sorted by asking at the hotel reception and Lo and Behold someone would appear . For certain you would be able to get a hotel with this standard of accomodation in central Barcelona , but certainly not for the sort of price you pay for the Condal Mar . Likewise to get into seeing all the main sights it is just a 5- 10 minute walk to the Tram and Metro station ( and just 6.65e for a T10 ticket ) or use the Taxis which are very reasonable and can be ordered at reception , of which we never had to wait more than 5 minutes for . If I was to go back to Barcelona it would certainly be worth going back to this hotel .", "Date": "September 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Australia", "Title": "“Great hotel, shame about the location”", "Author": "JessicaBerry", "ReviewID": "UR5809338", "Content": "I stayed at the Vincci Condal Mar from Saturday to Tuesday with my boyfriend. The hotel itself is good, modern, clean, with friendly staff and a good choice at breakfast. Unfortunately what lets the hotel down is its location. The area was extremely quiet and a bit of a ghost town. When we were walking to and from the metro station we felt quite vunerable as we were often the only people around. As a female I would not have liked to have been walking around on my own. We would probably not recommend the hotel to friends and family purely because of the location but otherwise it is a good hotel.", "Date": "September 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sydney", "Title": "“Nice hotel but bad location”", "Author": "senhwei", "ReviewID": "UR5799771", "Content": "I stayed at the Hotel Vincci Condal Mar this weekend. First the good points : - very modern and nicely furnished and equipped boutique hotel - air-conditioned ! - LCD TV in the room - reasonable hotel rates - helpful staff - nice buffet breakfast (cost EUR14) Aspects which can improved - the room I had was on the small side though the bathroom was quite big - the rooftop terrace is very nice and offers a panoramic view of the city but the pool is too small Bad points - by far the Achilles heel of this hotel is its location. It's located away from the city center though there are subway stations nearby which makes the journey into the city a generally smooth. However, walking to and from the subway station, especially at night, can be quite a risky proposition. The general vicinity is a mixture of light commercial / industry and residential. But I did not feel safe walking around after dark and generally took a taxi back to the hotel instead of walking.", "Date": "September 14, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "North-East, England", "Title": "“Steer well clear”", "Author": "sell", "ReviewID": "UR5728554", "Content": "I didn't want to have to write this, but must warn other people attracted by the pictures on the website. Yes, the hotel is stunning, but the area it's in is little more than a slum, and very dangerous. The scary place with people living on the roof is still across the road. The hotels' security is also lax, although they were quick to pounce on us when we went for breakfast. Anyway, the real problem we had was the sneak thief who walked unchallenged into the breakfast room, and then walked out with my mother's handbag, which was on the floor between us. The thief (a woman pretending to be pregnant) then went outside and stole our car as well. While the staff, and particularly the manager, were as helpful as possible, the fact is you should be able to take your handbag with you to breakfast in a four-star hotel without all your belongings being nicked. My advice: steer clear, until the area really is redeveloped", "Date": "August 30, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "england", "Title": "“very dangerous location”", "Author": "mr.g.taylor", "ReviewID": "UR5609689", "Content": "although the hotel was comfortable, it was too remote, we was advised by people on this site to use the metro during the day and taxi by night. on our last night our taxi driver tried to mug us by pepper spraying and beating us and abandoned us five minutes from the hotel. we managed to get back to the hotel and asked for police assistance, the night manager was not interested and told us he was not helping because it didn't happen at the hotel. what sort of hotel does not give emergency assistance to their guest? i would recomend that you look for a safer location and don't put yourself at unnecessary risk. yours g. taylor", "Date": "August 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "EDINBURGH", "Title": "“Friendly, modern and great value”", "Author": "TRAVELASCOT", "ReviewID": "UR5531430", "Content": "We loved our stay at the Vincci Condal Mar, as others have said it is well deisgned, modern and clean. The pool/sundeck area provides great views but it can get busy!!!. We found the staff very friendly and accomodating, please note that you can store your luggage after checkout for that later departure. The hotel is located near the Diagonal Mar shopping centre with lots of fashionable shops and a huge supermarket (ideal for drinks and snacks). We have stayed in the Diaganol Mar area before at the Princess and it is certainly an area that is developing fast both in terms of new hotels and apartment blocks. It is also part of the development of the coast stretching east of the Olympic port. It is now possible to walk, cycle, skate or whatever right along the new coastal boulevard. This is recommended particlularly in the evening as there are a large number of beach bars/restaurants each with their own DJ. Travelling in Barcelona is easy with the Metro (recommend using the El Maresme I Forum stop), bus (number 7) or the tram from Diaganal Mar. Things quieten down later at night in the hotel but thats probably a good thing for most people who have been busy exploring the may sights of this excellent city", "Date": "July 31, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Manchester", "Title": "“Fantastic Find!”", "Author": "JimmyManchester", "ReviewID": "UR5503492", "Content": "I came across this hotel by chance as I generally stay closer to the centre of Barcelona however from now on whenever I am in Barca I will be booking myself into this hotel. I found the hotel to be spotlessly clean, stylishly designed with comfortable living areas and fantastic bathrooms. The rooftop pool and stunning panoramic views of the city are excellent however bar service by the pool is poor (the only bad thing I could say about the hotel). The location as has been mentioned in other reviews is a little industrial however it is a short walk to the metro stop so you are minutes away from all of the main tourist areas. Personally I did not feel unsafe while walking around the area even late at night. Near to the hotel there is a large shopping area with many shops and restaurants, personally I prefer to see the older side of the town but some will love it. This is a great hotel for the money, I think it would suit couples and groups more than families but for the price I would recommend it to all.", "Date": "July 24, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Solihull, England", "Title": "“OK, but not great”", "Author": "orange_traveller", "ReviewID": "UR5493635", "Content": "The hotel has a lovely lobby and magnificent lights hanging from the ceiling, which gives an overall good first impression. The rooms are above average with a HUGE bed, nice TV and bathroom. The only downside is there is only one English channel - but still, not a big thing unless you are planning to stay in the room all day! The selection of room service is not great, and neither is the lunch-time option in the restaraunt, but the food you do get is excellent. The separate restaraunt \"Takenmori\" has amazing food, although quite expensive; about €80 for a meal for two! It is well worth it though. The bar in the lobby also shuts at 11 so we didn't even get a chance to try it! One major drawback is the size of the pool - absolutely tiny and not heated. The views from the roof are quite spectacular, especially at night, however, they do shut the terrace round about 10.30 - 11, so you don't get to see much of them. The staff at the hotel, although being far from rude and unhelpful, are quite unfriendly and speak very little english. Another big drawback is the location of the hotel, however it only costs round about €20-30 to / from the airport which is quite reasonable and about €10 into Las Ramblas. However, if you were staying in a city-centre hotel of the same quality i expect the prices would be a lot higher. Although the area is a little run-down, you feel quite safe walking around there - even at night. About a 10 minute walk away is a really good shopping centre with a massive supermarket and anything else you could possibly need. All in all, its ok, nothing special but definetely good value for money.", "Date": "July 21, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Average stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR5432993", "Content": "I stayed at Vincci Condal Mar for 6 nights in June 06. The Hotel is fine well kept and the Reception and Rooms modern Air conditioned and spotless, the Buffet breakfast was fine and offered a reasonable variety. That is the better parts of the review, the Hotel service is quite poor getting served at the rooftop Pool (which is mobbed if more than ten people are at it ) Bar is almost impossible as it gets staffed for about 5 mins every Hr, do not get fooled by the website claim of view the city by night as the rooftop gets shut just as darkness descends?. The area is largely made up of building yards/sites and what appears to be drab cheap maisonette style housing and areas of waste ground, travelling to city centre is not too bad and can be acheived by Tram, Metro or by taxi ( 12 - 15 Euro). Beware of short taxi rides IE from Metro stop to hotel as some drivers wont take the Hire if its not worth their while!!. There is absolutely nothing in the immediate area for a tourist however a 15 Min walk will take you to Diagonal Mar shoping Mall which has a really good array of eating and drinking establishments and some light entertainment EG 10 pin bowling. Overall the Hotel is probably worth going to as its price is quite attractive but the Hotel itself offers very little in the way of features or services, bear this in mind if you have plans for a night at the hotel itself.", "Date": "July 6, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ireland", "Title": "“Very nice hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5325476", "Content": "Stayed at this hotel for one night, 3rd June 2006. Arrived at 1pm and were promptly checked in. The room was very nice, on the second floor. Double bed, fabulous bath, flat screen tv. The best thing about this hotel was the breakfast, absolutely amazing, anything you could want was there. One not so great thing about the hotel was the location, however. It is about a five minute walk from the Selva de Mar metro station. No way to get into this station if you are in a wheelchair, just steep steps. There is a lot of construction work going on in the area. It is very quiet at night, the area is actually also very quiet, residential. The locals directed us to the hotel, very nice!", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Fantastic... Ideally located”", "Author": "A TripAdvisor Member", "ReviewID": "UR5316039", "Content": "Went with Partner for 40th Birthday.... Although Hotel in an area of regeneration was lovely. The icing on the cake was the beautiful sun terrace, pool and views... About a five minute walk from the Selva de Mar metro but nothing too undaunting if lugging cases. The room itself is very comtemporary and had extremely comfortable beds... Service was excellent... Breakfast outstanding... Only a 10 minute walk from the beach or if you want to cheat catch the tram.. Can't wait to go back!!!!!!!", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Take Care”", "Author": "dsbsolihull", "ReviewID": "UR5183635", "Content": "I have just returned from 4 nights at this hotel and would like to warn those who read this site. The location is opposite a coffee warehouse and 100 yards from a Gypsy caravan site. The 'shopping centre' referred to as being close by is a sprawl of tenement blocks with occasional tapas bars and barricaded shops amongst them. The hotel is some way from a decent tourist area and seems to be there for mainly visiting businessmen to the local factories/warehouses. The nearest Metro is Selva de Mar on line 4 but for goodness sake don't use the Metro. In 16 hours I was mugged once and subject to a pickpocket theft on the Metro. The Police refused to listen to my reports unless I produced my passport thereby reducing any chance of the offenders being caught. It is apparent that such thefts are commonplace as I found out plain clothes police and security work the centre but there are no warnings to tourists on display in the Metro stations or on the trains. The hotel inself is OK and at most 3 star. The buffet breakfast was excellent. One problem was the shortage of HOT water, it was necessary to leave the taps running for 5-10 minutes before it got hot. The consierge will arrnage taxis to get around but seem to favour the Spanish speakers and yesterday, despite being told our taxi was next, 3 arrived and were given to Spaniards but after 30minutes I managed to flag a stray cab down. Another problem I encountered was taxi drivers never hearing of this hotel. Twice we were taken to a sister hotel, Maritimo, and the drivers were adament this was the only Vincci hotel in Barcerlona. One was extremely offensive and abusive that we dared suggest he was wrong. Take a card with your and write out the complete address. The rooms are modern but a poorly cleaned, just look at the dust on the black surfaces when you arrive, it will still be there when you leave. There is a minibar in the room, no tariff is displayed so don't be fooled into thiniing it is complimentary as they charge 1.6 euros for a small bottle of water. If you fancy a good night out and excellent food visit the area of Port Olympic where good seafood restaurants can provide large meals for about 40 Euros each with drinks.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great value for money”", "Author": "A TripAdvisor Member", "ReviewID": "UR5038725", "Content": "We've just returned from a 5 day trip to Barcelona and stayed at this hotel, we all loved it. Yes, the location is slightly out of town, and the area is being developed, but it was a beautiful hotel and is excellent value for money. The staff were very pleasant and spoke english, breakfast was fine for a cold buffet and the rooms were spotless. If you like the minimalistic style and are looking for a modern and clean hotel but don't want the city centre price tag then I highly recommend it.", "Date": "May 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Modern Design at the Vincci.”", "Author": "jazz_puppy", "ReviewID": "UR4986024", "Content": "Wow, what a hotel. This is a beautifully designed hotel, where care and attention has been given to the design from the foyer, upwards. The circular design adds to an intriguing room design, but this doesn't mean the rooms are small by any standards. The room had all the mod cons you would want, except only one 1 English language TV channel (CNN), not that it really mattered to me, but it may to others. The breakfast was a feast, with plenty of variety all for 14 euros. The area outside the hotel was a bit strange as it was away from the hustle and bustle of the city, clearly in the old industrial zone of the city. The area was desolate, but was well lit and you always felt safe walking around in the early hours. The journey from the airport took about 35 mins in a taxi and cost in the region of 28 euros, which wasn't too bad. Alternatively you could take the Aerobus (from the Airport) to Placa Catalyuna and walk (5 mins) to Urquinaona on the L4 (yellow line) and then take the metro from there to Selva De Mar; (you can also take the metro to Catalyuna, but this will mean you need to change which means more walking if you have heavy bags). This will take you around 20-25 mins and will save you some money. The journey on the aerobus is only 3.75 euros and a metro journey single costs only 1 euro (so I'm told). It’s cheaper to get a T10 book which will give you 10 single journeys for around €7, which is what I did. Even though the hotel is not local, you can get into the centre of Barcelona in around 20-30 mins depending where you go. The bonus is that you do get to stay in a great hotel for less than a usual 4 star hotel in the city. The staff was polite and spoke great English and helped make my first time in Barcelona a memorable one.", "Date": "April 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Fabulous hotel!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4975418", "Content": "We've just returned form a trip from Barcelona and stayed in the Hotel Vincci Condal Mar. We'd recommend this hotel to our friends and family. It's pretty modern and it's nice that it's located just outside the crowdy centre of Barcelona. It takes you no longer than 5 minutes to get to Metro 'Selva de Mar'. (If it took you longer you must have been walking backwards...) The rooms are beautufully furnished, they're clean and breakfast is great. The view from the top op the hotel is amazing!! We enjoyed our stay in this hotel very much. Have fun in Barcelona!!", "Date": "April 15, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ireland", "Title": "“Very mod,with cool bathroom door/wall”", "Author": "PJHarkin", "ReviewID": "UR4932263", "Content": "This Hotel Is certainly value for money.4 star,modern and a great buffet breakfast.the problem that some might have that the nearest metro(which runs every 5 mins)is ten minutes walk away with another 10-15 min ride into the city.the hotel is based in an industral area which means after 5.30pm its get very quiet and very weiry for walking alone.bottom line would I go back? most definitly", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "uk", "Title": "“great”", "Author": "A TripAdvisor Member", "ReviewID": "UR4598639", "Content": "having read the reviews before hand i was also worried about my stay. this was totally unfounded. this was an excellent hotel. breakfast was wonderful, and plenty of it! yes it is a little far from the city, but the metro is only 10 mins away and we felt safe walking around at night. i would not hesitate to recommend this hotel to all. the only thing i would have liked was the pool, which was not in use. yes i went in march, but at 18 dgs, i would have liked a swim. but overall, a great little hotel & staff were great too.", "Date": "March 10, 2006"}], "HotelInfo": {"Name": "Tryp Condal Mar", "HotelURL": "/ShowUserReviews-g187497-d530096-Reviews-Tryp_Condal_Mar-Barcelona_Catalonia.html", "Price": "$98 - $245*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Cristobal de Moura 138</span>, <span class=\"locality\"><span property=\"v:postal-code\">08019</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "530096", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ab/c9/abc9c0d114334316f70b65d9a06394d71large.jpg"}}