{"Reviews": [{"Content": "Terrific value We stayed at the Fox Delicias for one night before our trip back to the US from Ponce airport. Some of the reviews on this website scared us a bit, but reviews from the guide books persuaded us to change our mind. This hotel is centrally located in Ponce Plaza, and right next to most of the major attractions. In fact with its quirky history and quaint architecture, this hotel is one of those attractions that tourists would run through on their quick half day visit to Ponce. The entrance is grand (which speaks to its origins to as a theater), and the lobby is like a mall (which was its previous avataar). We stayed in a king suite, which had two rooms wih a total of 3 beds that could fit 6 people in all. The room was clean, TV and AC worked fine, and the front desk staff was very helpful with directions (and fluent in English!). The three or four major attractions of Ponce - the firehouse, church and the old mayor's house - were all right in front of the hotel. Several good restaurants are within 5 minutes. Overall, it was great value for $135 including taxes. Yes, the criticisms of other reviews are valid to an extent. The hotel is being run by a bank now since the previous operator went under (or so I was told by locals at dinner). The ban being a bank is not conected well to travel agents, so the hotel is never full. On our trip, about 8 rooms were occupied out of the 30. They try to save money by dimming the lights and not running the mall escalators, but it is as dark as the fashionably dark Ws, and there are working escalators should one choose not to climb the stairs. My principal quibble was with the free parking lot, which is on a side street and one has to take the key from the front desk. There's strong police presence and we went to the lot at 4.00 AM for our early AM flight without feeling unsafe, but ladies may feel uncomfortable. Overall, I'd say this is a good, quant alternative to the Hiltons and Howard Jonhsons, good value and the location cannot be beat.", "Date": "Dec 30, 2008", "ReviewID": "UR549616854", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "FrmNJ"}, {"Content": "Scary Valet parking as promised was non-existent, fountain not working, lobby musty and so dark we stumbled on the way to dek. Check-in was poor, escalators did not work, lights were out, ice machine did not work, room a/c noisy, shower dirty with almost no pressure. Restaurants were closed as was bar throughout two night stay.Parking lot is three blocks away behind a rusty gate that is almost impossible to open and close.Should have slept on a bench in the plaza!!", "Date": "Nov 21, 2008", "ReviewID": "UR417185232", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "ZSAZSAFlorida"}, {"Content": "to rest a few hours perfect I you are planning to just top bye and rest and keep moving the this is the best place to stay. Room are nice and clean the night is just $ 75.21 that with taxes no breakfast but it is OK. It in the center of ponce there is a lot of attractions like museum,restaurants ect.", "Date": "Nov 18, 2008", "ReviewID": "UR745837995", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "luzayala05"}, {"Content": "Excelent place to have peace and calm!!!! I was really tired from a Turism fair so i decided to search for a hotel online and from the flyers i got from the fair i really was interested on architect structure it had. I made the reservation online and by the time i was on my way to the hotel ,my reservation was in . Its really warm, welcoming and the people that works at the front desk are very helpful. Its clean and tidy. Its in the heart of downtown Ponce.The price they gave me included me breakfast, which it was a really good one!! cant froget about thattt!", "Date": "May 16, 2008", "ReviewID": "UR258547512", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "kirrazombie"}, {"Content": "Fox Delicious only for Folks Desparate At check-in, we were asked to sign an agreement that would add a $75 charge to our bill if the remote control for the air conditioner was missing at checkout. Guess what was not in the room when we got there? Said AC, high on the wall, was running at full blast, though. We had to ask the desk to turn it off. There was no other option - full on or off. Water was lukewarm at best. Room was small with glass blocks imbedded at the top of the wall, e.g., no window, much less a view. We were lucky - most rooms did not have even glass blocks. Doors were flimsy, hollow wood, not fire-rated. Locks were broken. Bed linens were of dubious cleanliness and quality and worn. Furnishings were not well maintained. No services or food in the hotel.Too bad. The building's architecture, like much of Ponce, was interesting, but rapidly deteriorating. This hotel is a case study for creative use of a historic building gone wrong.", "Date": "Nov 14, 2007", "ReviewID": "UR537527260", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "JandJVermont"}, {"Content": "Never again... I stayed in Ponce for 2 nights, and decided to try to Fox Delicias Hotel. Everything looks nice from the pictures, so I decided to try it. However, everything was different when I got there. I am all for conserving energy and whatnot, but when you walk into the hotel, the lights are so dim, that they seem almost off. And the escalator was not working. I figured that was just for the night, but it wasn't on at all my entire stay. My room had a damp and musty smell, as did the other one they put me in.The hotel has a restaurant and a buffet like place, but apparently it is closed on the weekends. They fail to mention that on their website. When I asked the receptionist where to go for food, she could only name a few of places, and most of them weren't close by.Later on the night of my first stay, someone in the room next to me I guess decided to tamper with the smoke alarm at 11pm, so they alarm rang for about an hour. Their maintenance crew decided to work on the problem, but constantly until 530am. The staff at the front desk was not helpful, and did not want to reimburse us, or at least give us a considerable discount on our stay. They had no recollection of the incident, and only gave us a 10% discount. They were not willing to work with us, and honestly could seem to care less about what happened.Definitely if I travel back to Ponce, I will not stay in this hotel. Hoetel Belgica is cheaper, and the staff are very friendly. At least they care about making your stay pleasurable.", "Date": "Nov 6, 2007", "ReviewID": "UR341812920", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "SLIMFLAQUITA"}, {"Content": "My Recent trip to Ponce I read years ago in a Frommers travel guide about the restoration of Ponce in the 1990's at a cost of over 400 million dollars and the rescue of the old Fox Cinema with funds from Spain and its conversion into a mall and was intrigued. I made a special trip last week while on the island to check all this out firsthand. Well the mall went busted some years back and it has been converted into a hotel. The expensive escalators still sit idle in the center of the long narrow building. The rooms are clean and modern but as mentioned in another review sterile, and it is true that the help knows nothing about the surroundings nor about the elegant buildings history. The night of check in I was told the hotel was only half full. The next AM I finally talked myself into staying in Ponce a second day and about 5 till noon which is their checkout time I was informed when I went to pay another night that the hotel was totally booked and I was literally given 5 minutes to pack everything up and get it out of the room or pay another 74.00 late charge! What a shock! It was muggy and humid and I really had my hands full with two heavy suitcases and counting the minutes and an attendant was watching from the corridor! The only good thing that came out of all this is the naive young girl at the desk mentioned Guanica and La Pargera which are sleepy seaside towns about 30 minutes away and they were the most fun of my entire weeks stay on the island! The restaurant and bar remaining in the hotel sit empty as the chef took off for a better job in Miami so there are no hot meals available there. And as already mentioned in a review the whole downtown drops dead at 6 PM and the only activity around the beautiful park at night is the purchase of ice cream. Ninety percent of the shops surrounding the 400 million dollar renovation downtown are tacky dollar stores filled with Chinese junk. Other than the visit to the Seralles Castle the city was a major disappointment. I did not spend a second night in Ponce but made it to la Pargera after the Serralles museum-mansion tour and had a splendid weekend!", "Date": "Sep 27, 2007", "ReviewID": "UR286211635", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Rioguy"}, {"Content": "The Haunted Hotel Fox Delicias is a skeleton of a great hotel. Efforts to conserve energy and staffing are imediately apparent--the darkness of the lobby area, the escalator that never runs, the air conditioner that's set on 85 degrees, and the food court that doesn't ever seem to be open for business. The emptiness creates a creepy vibe. It's possible to spend a whole night there and never see another guest, even though you know they're there. Potential guests should also be aware that many of the rooms do not have windows. Fox Delicias--the ghost hotel. But what the Fox Delicias lacks in amenities and atmosphere it makes up for in its location and price. Situated in the heart of Ponce's historic district, the best restaurants and tourist sites are within easy walking distance. And we felt safe in the surrounding neighborhood. There's a heavy police presence in the area, as well as a police precinct on the other side of the plaza. My wife and I walked around the plaza across the street from the hotel late at night eating our gelados. The hotel's energy conservation can be seen on the bill. We stayed at the hotel for two weekday nights in February (high season) and only paid $59 a night. Other good points were the relaxing courtyard, where we planned our itinerary and wrote postcards. The hotel's art deco facade is also unique and beautiful. The price and location are the reasons why we enjoyed our stay at the Fox Delicias Hotel. For those of you looking for luxury, stay away. For those looking to save money and being in a central location, this hotel is the place to be.", "Date": "Apr 24, 2007", "ReviewID": "UR693791090", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "SeattleRican"}, {"Content": "Monrovia, CA - Staying in the heart of town We arrived in Ponce on a Wednesday afternoon. The hotel seemed empty and dark. Our room was a 2 bedroom suite without windows. The main room was large with 2 queen beds and the second room was adequate with 1 double bed. There was a total of 4 people in our party. The room was clean but sterile. There was no refrigerator, microwave, iron or ironing board that one might expect from a suite. The escalators were not operational and the air conditioning was not on in the public areas. It was pretty hot and humid. The hotel only had food between 11:00am-2:00pm. We had a problem with the temperature control in our room. We were either too hot or too cold for one night. The manager on site compensated us for the night of discomfort.Although the staff was plesant and willing to help, they didn't seem to know much about Ponce. There were no brochures about sights in the hotel. No list of local restraunts. The hotel was centrally located, inexpensive, outside area nicely renovated and they had valet  parking making checking in and out simple.We were there during the week and the town pretty much closes down after 6:00pm. We were told that the weekend are pretty active.Other reviews made us leary of the safety in the area. But we never really felt unsafe at all. I would stay at the hotel again and recommend it to others that want the most from there dollar and stay in the heart of the town. My goal in finding a hotel is to find a place that is inexpensive, clean and polite/friendly staff. My trip to Ponce was all about experiencing the people and the culture and not spending all my money of a hotel.", "Date": "Apr 15, 2007", "ReviewID": "UR268438532", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "JOY53"}, {"Content": "comfortable and good deal It won't win any awards for design but this hotel is very comfortable and centrally located. The staff was very friendly and helpful. The rooms are modern and clean. As other reviewers have mentioned, most rooms lack windows but if you're out during the day, it doesn't really matter. Nice courtyard with live music on weekends and great pina coladas.", "Date": "Dec 30, 2006", "ReviewID": "UR483321648", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cmont"}, {"Content": "Pretty good for Ponce The room was large, although kind of stark. The bathroom was a good size. The downstairs bartender was friendly, and the hotel was suprisingly quiet. In the city center, this beats other recommended hotels. If you're going to the beach, hit the Hilton.", "Date": "Dec 22, 2006", "ReviewID": "UR264050380", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "GlobeTravelin'T"}, {"Content": "not great, not bad We spent one night at this hotel, waiting for an early flight out on a Monday morning. The building was converted from a marvelous old theater and looks stunning outside. It seems a little stale and shabby inside, though. It was first converted into a mall, and now into hotel rooms. Our room was slightly stale smelling, but otherwise comfortable and large. When we went to take showers before bed, we didn't have hot water. I didn't bother complaining, as we needed to get to sleep in order to get up at 3:00 am to return a rental car and get to the airport for an early flight. The hotel is quite convenient to the sights downtown. It's right on the Plaza Delicias, across from the cathedral and down the block from the historic firehouse. The tourist trolley goes right by the hotel. The hotel has a wonderful courtyard and lobby that look like they could be lively, pleasant places in the evening. The hotel was absolutely dead on a Sunday night, though.", "Date": "Nov 18, 2006", "ReviewID": "UR545156107", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "IA_rover"}, {"Content": "STAY HERE!!! Great prices, location, service, staff!! Worth every penny I just returned from a trip to Ponce  then Vieques Puerto Rico. There was a large group of us that went down there for a wedding. We had researched EVERYTHING we possibly could for this trip. I used tripadvisor so much I told myself I'd leave a review to help the future travelers in the same situation we were in. Fox Delicia was wonderful!! Phillipe was the gentleman working at the front desk and was very energetic, helpful, and filled with information. He recommended a great breakfast/bakery just a 1/2 block off the main square, and this amazing ice cream place. He told us how to get around the town and let us know the great shopping and sites to see. Three of us arrived on Thursday in the early evening and checked in. We had to get ready for the wedding rehearsal. My husband called the front desk to ask for an iron and ironing board, b/c there were not any in the room. Within 5 minutes we had one at our door. My husband then asked the gentleman if they also had a hair dryer. (we werent able to bring all of the items we needed due to luggage constrants we had due to a 9 passenger plane we had to fly on at the end of our trip in Vieques) But 2 minutes later we had our hair dryer too. They were so accomodating. The other 6 people from our group arrived at 5am from their flight and the front desk was great enough to let them check in early and not charge us for that extra night or time. We had booked just the 2bedroom suite the first night in case the people couldnt check in, and then needed a place to sleep for a few hours before the checkin time. They gave the other members of our group the adjoined room next to ours and made sure we had everything we needed. It was clean  quiet. It was with in walkind distance to many shops, restaurants,  attractions. I would definetly recommend this place to everyone!!", "Date": "Nov 15, 2006", "ReviewID": "UR719536247", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "andc13"}, {"Content": "nice hotel I recomended the fox for your next stay room are very nice and clean staff is very polite and the food is the best. I am planing in pasing my next vacation in ponce.", "Date": "Aug 29, 2006", "ReviewID": "UR455762426", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gordabella"}, {"Content": "Nice Price, 5 star service I loved the Fox Delicias. Real nice service, awesome food with very nice restaurants. I think the chef comes from work in 5 stars properties within the U.S. The lobby and the bedrooms are very clean and the valet parking all day long is a plus. Congratulations to the manager and all his staff. You guys rock!!!", "Date": "Aug 28, 2006", "ReviewID": "UR326498502", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "nolo"}, {"Content": "We're going back Cool, Clean, Comfortable, and a 5 star staff. I regret that we could only stay 2 nights. Great location. We returned home and began planning a return trip.", "Date": "Jul 12, 2006", "ReviewID": "UR714941493", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Worst Hotel in Ponce This is the worst hotel in Ponce. I visit the city twice each month and have stayed at every hotel in the city except for Fox Delicias. Unfortunately I had made last minute plans to go down on a local holiday weekend and all the hotels were full except for one room at Fox Delicias. I鈥檝e been inside the hotel property before, its relativity new, looks cute, has a restaurant, bar, and an amazing location. How can you beat a 鈥渂outique鈥?hotel? The fantasy ended upon arrival at the hotel.We requested early check-in 2-days prior to arrival. A manager (Pedro) called us back and said that early check in was not a problem. Upon check-out, we were charged for an entire additional day!!The rooms are like those in a nursing home, no character whatsoever 鈥?and no windows. The door had no peephole. The rooms didn鈥檛 have simple hotel items like a blow-dryer. The rooms were put together cheaply and are already showing signs of wear and tear. The rates posted on our door (room 214) were lower than the rates we were charged. The hot water is in no way HOT. It is slightly warm. You are also better off sleeping on the floor than on the cheap mattress with only 2 skimpy pillows.There is an alarm clock, but since the electricity went 3 times one night and once the next night, the alarm clock reset itself and never went off鈥?Wake up call requests for 2-evenings were completely ignored鈥eally scary if you are flying out of Mercedita on the 5:10am flight.Three phone calls finally got a pullout bed.The public spaces in the hotels have no fans, which would be fine if they turned the air-conditioning on. The lobby, bar, and restaurants can actually double as the hotels鈥?sauna.The restaurants and bars are not open during the hours that are posted. They seem to either never open, or close 3 hours early.One sheer joy was the fire alarms going off twice in the middle of the night. However, the 2am pajama attired meet and greet with other hotel patrons in the lobby reassured us that we weren鈥檛 the only ones having problems.The trip ended with the hotel鈥檚 security guard knocking on our door 45 minutes after our requested wake up call because the electricity went out once again 鈥?and there was NO HOTEL STAFF at the hotel or on duty!!!Beware.", "Date": "Jul 6, 2006", "ReviewID": "UR124481732", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Beautiful! I stayed one night at Fox Delicias Hotel and it was wonderful. The hotel is very clean and nice. The restaurants are great. Most of the rooms do not have windows but I had no problem with this. In fact, since the room was so comfortable, I slept like a log! I would recommend it without hesitation.", "Date": "Jun 12, 2006", "ReviewID": "UR659634984", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Nofal"}, {"Content": "Friendly People The hotel is fairly new it opened about 2 years. It's very nice, and the people are very friendly, the food is very good.", "Date": "May 24, 2006", "ReviewID": "UR796886139", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Don't go there Although both of our guide books (Lonely Planet and Let's Go) gave this hotel rave reviews, my boyfriend and I experienced multiple problems here and I DO NOT RECOMMEND IT.The hotel was deserted for our entire stay (Thurs-Sat) and the lobby was dark and creepy with non-working escalators. Our first room had no windows and the TV had no sound. We upgraded to a suite (which the manager refused to give us a discount on, altho it would have gone unoccupied otherwise) that had one window that didn't open and no other amenities that one would usually expect such as a minifridge or coffee maker. The suite overlooked the courtyard. On Friday night, we had to ask to be moved back to another windowless room due to the loudness of a DJ set up in the courtyard playing rave music from 10:30pm-2am. No one had warned us that this would be happening and altho the woman at the front desk was prompt in moving us, there was no offer of discount or ways to make amends for the inconvenience. The best part of the hotel was definitely the restaurant, which has great food but was entirely deserted. We had a delicious meal all alone. Overall, I WOULD NOT RECOMMEND Fox Delicious Hotel OR GOING to Ponce in general, but if you have to go, then the Hotel Melia across the Plaza looked nice and had a pool and free continental breakfast.", "Date": "Apr 2, 2006", "ReviewID": "UR242131518", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Plus and minus at this Ponce square hotel This is a modified cinema with a beautiful facade. Unfortunately, it is uncertain if it will continue. The entire place was set to conserve money. Other people said the food was good, but the two nights we spent there, on Sunday and Monday, the restaurante was closed for breakfast lunch  dinner. The escalators did not work, the lobby was dark to conserve electricity, and our room was dark as a tomb with NO WINDOWS. The AC worked great, and the location is a 10 for Ponce. Cost was $95/night for a very big room. I am not certain I would come back to this hotel, or this town, although the art museum is very good. This may be the best place in a very average town.", "Date": "Feb 20, 2006", "ReviewID": "UR375520067", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "aptbroker1"}, {"Content": "Satisfied I spent new years in Ponce visiting my b/f and I was really happy with the service, rooms were very clean. Valet is free and it's 24 hours! Located in the central area of town. the people were wonderful and the food was great. And you cant beat the price! Only drawback is that the rooms are small and no windows, But I didn't mind, It's not like I was staying in the room all day anyways........", "Date": "Jan 26, 2006", "ReviewID": "UR981145657", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Pretty Good, Overall I would by no means say that the Fox is the best Hotel on earth, but it's not a bad place to lay your head if you find your self in Ponce. The biggest drawback was the lack of windows in the rooms. Otherwise, the service was great, the rooms were clean, the location was right in the heart of Ponce, the AC worked in the rooms and the Valet parking was a nice little extra touch.The hotel itself is actually, I believe, a converted Mall. The space definitely shows its routes and has a fairly interesting layout because of it. The Bar is open late. The restaurant, unfortunately for me, does not offer any vegetarian items, so I'm unable to rate it's quality. Though, for the time I was there, I did not see very many people dining in it at all. The poor hostess was standing outside the empty restaurant for hours on end. On exploring the other restuarants within a close walking distance, it seemed like everyone in the area was having dinner at Marks, in the Hotel Melia, across the square. Again, no real vegetarian entrees, so I moved on. I finally ended up down the block from Fox's at Chef's Creation, which, while they didn't have very much in line of Veg. fare, they were very accomodating and helpful and the Chef and wait staff went all out to make sure that we were well fed. (The Pina Colada's here are awesome too, btw).Anyway, that's just more general info about Ponce than about Fox's, I'll save the rest of those details for the Ponce review. Would I stay at Fox again? Yeah, probably. It wasn't a bad experience at all aside from the lack of natural light in the rooms. Which, if you don't mind that, it's totally fine, otherwise, just be sure to ask for a room with a window when you call.", "Date": "Jan 23, 2006", "ReviewID": "UR826076190", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "ambivalent I am ambivalent toward the hotel.The food is amazing, too bad its not a nice hotel to stay at. The manager has put the business in jeopardy by not willing to face conflicts with clientele and by being rude. I guess its a good enough hotel for those traveling solely for business purposes in Ponce", "Date": "Jan 20, 2006", "ReviewID": "UR133614496", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent service, great food!!!! I live in Coral Gables in Florida but i'm originally from Ponce Puerto Rico. I stayed at the Fox Delicias Hotel in Ponce this new years weekend and it was an excellent experience. I disagree completely with the person who wrote the last review. I stayed with my girlfriend and it was amazing. Everyone was so nice and they gave us great attention. This hotel has an excellent service and they trully value their guests. It is a boutique hotel with only 30 rooms but it's beautiful. The seasons restaurant at the fox was magnificent. Me and my girlfriend loved the food. You gotta hand it to the chef!Excellent food!!The room i stayed at was so comfortable and i really enjoyed it. I will definetly go back to Fox the next time I'm in ponce.", "Date": "Jan 4, 2006", "ReviewID": "UR530382538", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Horrible experience!!!! We had a huge problem with this hotel! The Front desk made a mistake and had us checking out on sunday when it was suppose to be Monday! We were out all day on sunday in san juan and came back to NO ROOM!! Apparently they Took EVERYTHING out of the room in which 4 of us were staying at and threw everything combined into a back room. We came back UPSET and HORRIFIED THAT A MISTAKE WAS MADE AND our PERSONAL BELONGINGS were taking out of the room.. TO TOP IT OFF!!! THE OWENER/MANAGER HAD NO MANNERS AND WAS RUDE. HE knew a mistake was made and didnt even try to accomodate us. it was a horrible experience! WAtch out WITH THIS HOTEL.. WE HEARD SOME HORRIBLE STORIES!!!!!!!!!!", "Date": "Dec 15, 2005", "ReviewID": "UR225880880", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A new jewel in Ponce In Ponce the new Fox Delicias Hotel (http://www.foxdeliciashotel.com) right on the z贸calo turn out to be a fine choice. You can easily walk to see most of the sights in town. The rooms are basic and clean. Bathrooms are large. Breakfast is not included. We ate dinner at their excellent restaurant Seasons. The food was so good that we returned the next night. There is no charge for the valet parking. A room with queen bed was $79 including tax. I definitely would return here.", "Date": "Nov 17, 2005", "ReviewID": "UR431949513", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "chargers"}, {"Content": "Good Central Location Stayed at the Fox for 2 nights in April. Nice hotel and very good location in the center of town. Hotel was recommended to us by our friend who lives in Ponce. Clean and the staff was friendly and helpful. Perhaps would be nice to stay where there is a pool or closer to the beach but we had fun staying in the actual town surrounded by the daily activities of the townspeople. Only one complaint, we only had one small window in our room (in the bathroom) so it was a bit like sleeping in a dark cave!", "Date": "Aug 29, 2005", "ReviewID": "UR649506508", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice Hotel, but needs some insulation I stayed at the Fox Delicias Hotel in July 2005. The hotel is located in the center of Ponce and was very nicely decorated. The hotel staff was great and extremely helpful. I really liked the hotel, but did have some problems. Only two of the thirty rooms have windows. I felt like I was in a closet. The biggest problem that I encountered was the lack of sound proofing in the rooms. I could hear everything that was happening next door. This was specially a problem at 5:00 A.M. when my neighbors decide to make whoopee and let everybody know about it. I do not think this is a great place to take a family because of this. I felt extremely safe around the hotel because of the high police present.", "Date": "Aug 3, 2005", "ReviewID": "UR941487355", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Fantastic! 1. Excellent Food! 2. Quiet comforable rooms3. Excellent service4. Friendly staff5. 2 nice! Bars6. New!!!7. Near everything.", "Date": "Jun 18, 2005", "ReviewID": "UR831914079", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Fantastic Value for Money I spent 3 days in the Fox Delicias Hotel in Ponce, Puerto Rico with my girlfriend.We paid around 75 dollars per night (taxes included) for a room with a queen bed, air conditioning and free valet parking.Both my girlfriend and I agreed this hotel is a fantastic value. Good Points:1. Clean new furniture. Bedsheets, pillows, furniture, bathroom fixtures are new.2. Extremely attentive and polite staff. They gave us maps and guidance on where to visit. No attempt to ask for tips. When we asked to leave the car in the hotel parking even after we checked out, they gave us several hours of grace period.3. Central location directly facing the main Plaza Delicias so you are walking distance to many main attractions.4. Beautiful pink and white art deco facade. The courtyard is guarded by a large iron gate facing the Plaza. There is 24 hour security/valet attendant in front.5. Air conditioning is phenomenal. In your room, you get a remote controlled unit which controls the actual centigrade degree.6. Spacious lobby and open lounge spaces on both floors.7. Excellent security. They use a modern key-card lock system.8. They have excellent laundry service and only charged 10 bucks.Bad Points:1. Inbound phone calls to your room will cost 1 dollar each.According to the Hotel clerk, this hotel was built 5 months ago, so it's not even in the annual editions of your tipical travel guide books. Hurrah.The Fox Delicias hotel is on site of a previous Fox Delicias Mall which went out of business.", "Date": "Jun 6, 2005", "ReviewID": "UR731249010", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "baires"}, {"Content": "Loved the Fox Delicias Loved the newness of it. but if you like a room with a view, this hotel is not for you. There are no windows!! The hotel is clean, good restaurants and an excellent helpful staff. The hotel is great for a short stay (overnight) as we did.", "Date": "Apr 27, 2005", "ReviewID": "UR257357593", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "prettygirl"}, {"Content": "Excellent Choice stayed for a week and everything was perfect. The location is just in the place to be, downtown and in the center of everything. Museums, stores, banks, government agencies, shops, trolleys, ect.  The service and the food very good. The people in the hotel very nice. I really recomended. A lot better than the others downtown hotels.", "Date": "Feb 12, 2005", "ReviewID": "UR832580889", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Unforgetable Excellent location, friendly staff, Food is awsome Pro-Chefs- US rained, quiet, foot steps from The Ponce Cathedral, parque de bombas. Night life within hotel.", "Date": "Feb 8, 2005", "ReviewID": "UR646968687", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent !! Excellent, Brand New Hotel located in Downtown Ponce (historic Zone) . Outstanding service, Excellent food! The hotel has 2 bars and 2 restaurants Breeze Bar located in the hotel private outside Patio under the stars, and Seasons bar which is a mini lounge with tv dvd, food located inside the hotel, there is also 2 restaurants 1)seasons - Fine dining cuisine with a asian-caribean fusion, and el sabor that serves Purto Rican Creole Cuisine Delicious!!. Rooms Are clean and spacious with good air conditioning. There is excellent night life few steps from the hotel and within thie hotel itself from wednesdays to sundays. I will stay there again without a doubt.Valet parking , Hair Salon, room service are few of other multiple hotel amenities THE HOTEL IS BRAND NEW IT OPENED ON NOVEMBER.", "Date": "Jan 5, 2005", "ReviewID": "UR172268934", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g147323-d530339-r23116934-Hotel_Fox_Delicias-Ponce_Puerto_Rico.html", "HotelID": "530339", "Price": "$101"}}