{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“A great spot to stay”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR140006705", "Content": "Would recommend this hotel to anyone looking for a central Madrid location. Not at all noisy (as we expected it could be). great slightly edgy decor, friendly efficient service, a nice 1st floor lobby with a few bookks, cheap coffee. Check out the view from the 9th floor roof garden for great views over the city.", "Date": "September 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Great and cheap hotel”", "Author": "Anacpa", "ReviewID": "UR139878151", "Content": "Stayed here for 2 nights in september 2012 and loved it. Very central (right in front of Gran Vía station), very quiet, very trendy and really cheap. Would recommend to everyone! And don't miss the roof top terrace.", "Date": "September 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“Praktik Metropol is a terrible hotel”", "Author": "jb2000jb", "ReviewID": "UR139761219", "Content": "I booked this hotel because of the positive reviews. I'm not sure if I just happened to get the worst room in the hotel and the worst person at reception, but I had a terrible experience. First of all, the room was the most overpriced room for the size I have ever stayed in. There was space in the room for the bed and that's about it. My wife and I had to close our bags and put them away in order to stand up. Seriously. Checking us in the extremely rude and unbelievably arrogant desk clerk smirked and said our room was \"bad.\" I asked him why that was when i had booked the room weeks in advance. He told me that it made no difference. I told him that the room did not match the description or the photos on the hotel website and he told me (I can't believe it, but this is what he said) \"It's like McDonalds. When you go to McDonalds you don't expect the hamburger to look like it does in the pictures.\" I asked to speak to the manager and he told me the manager was not available and there was no way to reach him. The worst room ever and among the worst service ever. That was my experience at the Praktik Metropol. The hotel is centrally located, but you can find better options for the money and certainly a hotel with better service.", "Date": "September 8, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "london", "Title": "“A very cool hotel at an amazing price”", "Author": "talblet", "ReviewID": "UR139640981", "Content": "For those of you looking for a centrally located, good value option in Madrid - look no further, this place has it all. The reception staff were friendly and efficient and all the communal areas were designed in a cool, quirky way. It was sort of Scandinavian chic meets New York loft! The room was a good size and had everything you needed including very comfortable beds and high power air con - essential! They have also clearly put a lot of thought into how they designed the rooms in terms of making the most of the space. The bathroom wasn't huge and had no bath but again, they've decorated everything so creatively that you don't mind that it's a little on the cosy side. One of the big advantages is the roof terrace where there are sun loungers and tables and you can take your own food and drink up there if you fancy a picnic with a view. Another advantage is that it's right next to the metro making it easy to get around and it's also right next to Chueca, the very cool gay district which has a lot of the best nightlife options. All in all a huge thumbs up!", "Date": "September 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cannes", "Title": "“Great location”", "Author": "Roxxmulus", "ReviewID": "UR139214250", "Content": "Perfect location, in the city center, metro is next to the hotel. The room was clean, the staff helpful. We had a little balcony which was nice. The terrace on the top floor is great if you have no problem with sitting next to some mobile network antennas. Coffee and donuts for 1€ in the morning is enjoyable as much as the breakfast room.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Haven, Connecticut", "Title": "“Loved this place!”", "Author": "Julita16", "ReviewID": "UR139183182", "Content": "This place has a real trendy, young feel about it. Is located in the Plaza de Sol so you have easy access to many touristy places, restaurants, the Metro, and delicious frozen yogurt! The only thing surprising was the many prostitutes in the Plaza which no-one else seemed to notice! The room we stayed in was small but very stylish, very clean and safe, cool air conditioning, and the bathroom was beautiful! The staff were super friendly and there was a computer with internet access and expresso. The best part is that you can go up on the roof and experience amazing views and just hang out. We would definitely stay here again.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Fun and refreshing place to stay”", "Author": "Tomtastic", "ReviewID": "UR139146729", "Content": "This is a hotel that exceeded my expectations. From the warm welcome at the front desk, the designer edge to the lobby and rooms, and the surprise 9th floor roof garden terrace providing a little oasis to relax in the sun in the centre of Madrid. We wend for a superior room (only 4e more a night) and as a result we had a huge kindsize bed and (4th floor) balcony over looking the busy pedestrian street below. With quirky furnishing, wooden flooring and a nice cream/black colour palette the room was very welcoming. The walk in shower and flat screen TV also helped make this a handy home for our 3 day stay. Only disappointment was lack of a refridgerator in the room - it would have been handy for keeping drinks cool. However, the coffee and doughnuts for 1e were a great way to start the day. Some have commented on the 'ladies of the night' on the main street below - it's true, there are a few, but we certainly were in no way bothered by them! The location is excellent for exploring central Madrid, close to the main shopping areas, palace and museums, with great areas (such as Chueca) ont he doorstep for bars and restaurants. All in all I look forward to visiting the Prakik again soon.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Loved it”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR138831345", "Content": "Praktik was incredible and close to Plaza de Sol...I suggest that unless you're a history buff you don't take a bus tour but instead find a walking tour with a local guide. Praktik is very close to major destinations within Madrid. We felt safe, happy and comfortable and truly did not want to leave. Waking up and having espresso (for 1 euro) on the roof top of the hotel was one of my happiest mornings. Gracias!!", "Date": "August 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“best overall value and location - heart of Madrid!”", "Author": "mllevsf", "ReviewID": "UR138259106", "Content": "This hotel has it all- rooftop terrace w/ 360 degree views of Madrid, free easy to connect wifi and the location! Loved this place so much I went back to stay at the tail end of my trip. Staff is Fabulous - Luis and Maria! Definitely would recommend to all my friends!", "Date": "August 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Awesome hotel, awesome location, incredible city.”", "Author": "haywardian23", "ReviewID": "UR137942459", "Content": "I stayed here back in June for 3 nights and loved this hotel. It's right on the exit of the Grand Via tube stop so you couldn't ask for a more central location in Madrid. It's minutes away from the Puerto Del Sol, which is pretty much where you'll go to access all the best of Madrid's mighty fine city centre. I specifically asked for a high room with a balcony if it was possible, and I wasn't let down. I was told room 901 was the best and I'd be inclined to agree. The balcony had an awesome view over the Grand Via and the rest of Madrid that surrounds it. The room was very big with handy hooks to hang stuff, nice chairs, big wardrobe, massive comfy bed with all the pillows you'll ever need and overall modern, clean, simple decor. Gorgeous bathroom with a huge shower and a small window looking out on that spectacular view. The room was just around the corner from the hotels top floor terrace. This terrace has even better views than room 901 and lovely sun loungers and additional seating. You can go up one more floor once on the terrace and you won't be disappointed. There's an almost 360 degree view of Madrid and it's stunning. We spent a couple of sunsets up here with beers from the local Carrefour supermarket. Perfect way to start your evening! The hotel lobby is a lovely place to hang with some amenities available so that's always handy. I really can't praise this hotel enough. For Madrid, their prices are reasonable and there's so much on the doorstep. Lovely cafes and bar are right outside and the shops of the Grand Via surround the whole hotel. I won't use this review to comment on Madrid, but suffice to say, it's my favourite European city and staying at the Praktik Metropole on my second visit even better than my first. Thanks guys!", "Date": "August 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“simple, clean, friendly staff, central!”", "Author": "Mary M", "ReviewID": "UR137837147", "Content": "This hotel is great! The rooms are quite small but they are fine for a city break, and at the price charged I think it is a bargain! The hotel is very clean and comfortable. The decoration of the hotel is quirky, and makes for an interesting walk along the corridors! The terrace is a lovely addition and very comfortable. The staff are so nice - friendly, welcoming and helpful. The hotel is well situated, centre of the city, close to everything! Yes there are some prostitutes in the area outside the hotel, but they cause no trouble and the area is well watched by police on patrol...this made me feel safer as a solo traveller. I will definitely be back here again!", "Date": "August 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hip hotel with a budget price tag”", "Author": "Erintilly", "ReviewID": "UR137522707", "Content": "This place is great value for money! We loved our big sunny room with designer fittings and funky details. Great location and close to cool boutique shops and tapas bars. Very safe area, ladies of the night are no trouble :) friendly staff, very clean, cool rooftop! I'll definately be back!", "Date": "August 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect for a fun stay in Madrid”", "Author": "Emma M", "ReviewID": "UR136388348", "Content": "Great location (if you don't mind the 'ladies' outside). The decor is so cool, I loved it. The staff could not have been more welcoming and helpful. The rooms were mixed, I had a pretty large one but my friends room was a lot smaller so may be ask to see the room first. It was surprising quiet considering the location and the rooms were clean and had everything you need including free WiFi. Not the best view but I would not hesitate to recommend this hotel", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Isle of Wight", "Title": "“Brilliant location.”", "Author": "Bwana-RobW", "ReviewID": "UR136123724", "Content": "We liked the €1 coffee & doughnut before venturing out for a busy day. Fantastic central location next to Gran Via Metro, short walk to Puerta del Sol and Plaza Major. Hotel was clean, comfortable and friendly. wifi and two computers in the reception area for guests use was brilliant. Thanks.", "Date": "August 3, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Purley", "Title": "“great”", "Author": "Lee B", "ReviewID": "UR135968762", "Content": "well worth the money, lovely rooms with very modern feel ... close to town, would go back again def ... has a great area for a coffee/read in the morning before you go out and explore easy drop off from airport, nice friendly people", "Date": "August 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bargara, Australia", "Title": "“Comfortable place to retreat.”", "Author": "Spencer C", "ReviewID": "UR135751645", "Content": "Stayed there early July 2012. It was so good I went back for a final night to finish my trip on a great note. I stayed in the superior (huge, great view, double glazed), the double (yes, it would be a squeeze for two) and the single (a spacious king size single bed). The collective wisdom of the Trip Advisor reviews say it all: + Great location (I walked to everywhere from here - Plaza Mayor, Prado, Plaza Santa Ana, Retiro, etc.). + Rooms are quiet, cool, nice simple but modern deco, and the bathrooms are great. + Staff are friendly and super helpful. Gracias to all at the Praktik.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Just what we look for”", "Author": "ElKochan", "ReviewID": "UR135262051", "Content": "Yes, the rooms are small. Some may think they are too small. I dont really care. I'm not doing a step routine or dressing a deer in my room, so my need for space is minimal. We both had our gigantic suitcases on the floor at the same time and we could *mostly* walk around them (the hooks are a godsend!). Everything else makes up for the last of space. The Praktik was clean and in a great location (albiet \"urban\"). We walked EVERYWHERE! The staff was helpful and friendly. And the bed was much more comfortable than I had hoped. Cannot beat the value. I wish there was a PRAKTIK everywhere, because I have trust that I will have a great place to stay.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Attention to detail and fantastic location”", "Author": "ballerinasa", "ReviewID": "UR134855703", "Content": "If you can get over the ladies of the night who line the Calle de la Montera, coming back to the lovely white rooms of the Hotel Praktik is sublime. We loved the hooks to hang our wrinkled clothes in the room, having vino tinto on the rooftop patio, the friendliness of the staff, and surprising size of our room. (Huge by European standards!) We used the Telefonica building (across the busy Gran Via) as our landmark when venturing out. This hotel is great for walking travelers. Try the Iowa restaurant across the street for a super friendly cafe con leche.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kingston upon Hull", "Title": "“Great place to stay in the heart of Madrid”", "Author": "RnA31", "ReviewID": "UR134793881", "Content": "We’ve just spent a week at the Praktik and had an absolutely great time. The hotel has a lovely minimal design aesthetic and is situated in the very heart of Madrid, within easy walking distance of many key locations and the metro stop is right outside if required. The hotel cannot be faulted especially for the price, even the €1 coffee and doughnut is excellent. Lots of good people watching outside the hotel, especially the working girls who frequent the area although the bars outside the hotel are not the best and its worth the short walk to find better. We opted for the superior room given the length of our stay and I’m glad we did, as it was the perfect size although we will try and get a balcony next time. Highly recommended, will definitely be staying here again.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“good for adults”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR134630755", "Content": "Black and white bedroom decor and nespresso coffee with sights and food/beverage sellers easily accessible by foot or transport and the working girls make this most suitable for adults. We thoroughly enjoyed or stay and recommend this as palace to stay.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Excellent hotel - beautiful, good price, great location”", "Author": "KeltieJ", "ReviewID": "UR134611260", "Content": "We stayed in the hotel for one night in July 2012. The staff are friendly, it is clean, the rooms are very nice. Not huge but we spent very little time there. The room has a great balcony. The wifi worked well and I was able to easily use Skype to phone home. The hotel has a rooftop patio which is amazing! The location is fantastic and is walking distance to everything and right on the train line. We easily took the train from the airport to the hotel. The only con was that it didn't have a pool which would have been nice.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“Worth the money”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR134307201", "Content": "Cons: the ladies of the night that wander around the street where the hotel is located. Pros: location with a metro stop across the hotel Metro is one of the easiest i have ever seen and used. Breakfast consists of coffee and donut for 1€. If you want a larger breakfast there are restaurants enough where they serve large breakfast.", "Date": "July 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Amazingly Praktik!”", "Author": "Lorena S", "ReviewID": "UR134272122", "Content": "This boutique hotel has an excellent location, a very friendly staff and comfortable rooms. I stayed only for two days after a long trip. When arrived to Madrid, it went out that my suitcase was lost and i had to wait until next day for the airline to bring it back to me. They let me check in a few hours before their check in time, so i could rest and enjoy nightlife that day! I am very thankful for what they did.", "Date": "July 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Trendy budget hotel in the heart of Madrid”", "Author": "Lotty24", "ReviewID": "UR134080988", "Content": "Praktik was the perfect place to stay for our first time in Madrid. The hotel is more like a hostel in that it’s housed on several floors of an old building along with a couple of other hostels. The main reception area is spacious and trendy with friendly reception staff and vending machines which came in handy for water etc. as free computers. To be honest my heart sank when I saw my single room, it was the tiniest room I’d ever seen. With a small window that looked into the shaft of the building. My Dad and brother shared a room next door which was a bit bigger being a twin room. After about 5 minutes I settled in nicely, the main reason being is that the rooms are very well designed and there is a space for everything to hide away so I actually got used to my small room and ended up liking it. The rooms are simple, clean with a cool design aesthetic with everything you need including a safe, flat screen TV, big wardrobe, toiletries and good shower. The beds are comfortable and I got a good night's sleep (or siesta) due to the room being an internal one, it stayed dark quite a lot. Although, I could have done with a stronger ligh to do my make-up because of this! They were also cleaned every day which was good, however, I would have liked a fresh towel every day although you can ask for this at reception- they change them every 3 days if not. Yes, the building is located on a street with a lot of hookers, they don’t cause anyone any bother from what we could see and the street was good for people watching from one of the bars outside. However, be aware of pickpockets on Calle Montera (and of course the whole of Madrid). Unfortunately my brother had his new sunglasses stolen by a group of young Romanians whilst he was sat outside one of the bars outside the hotel. They brought over a piece of paper pretending to collect for charity and placed the piece of paper over the sunglasses which were (stupidly) put on the table. This was despite us already telling a couple of them where to go, another 3 girls returned and took the sunglasses. The guy at the bar was very apologetic but it wasn’t his fault. We reported it to the police and we did notice lots of police patrolling the area but it’s just one of those things. The incident wasn’t a reflection on the hotel at all and I certainly felt safe on the street and surrounding area. Which brings me to the location – which was brilliant. Just off Gran Via and up the street from Sol. We walked to most places including Chueca, Malasana, Plaza de Santa Ana, Plaza Mayor and Prado/Reina Sofia galleries. The rooftop is also a highlight; it’s well-kept with plenty of nice sun loungers and views over the rooftops. I wish I’d had more time to chill up there but there’s so much to do in Madrid! All in all if you’re looking for a cool place to stay smack in the centre of Madrid that’s very reasonably priced and aren’t fussed about the extra stuff you get at a ‘proper’ hotel - then this place is for you.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“PERFECT”", "Author": "Sam B", "ReviewID": "UR133738840", "Content": "I stayed for at the Praktik Metropol for a mid week break and will definately be staying there again and for longer! Athough small the hotel is perfectly decorated, clean, excellent location and fantastic service from it's team. The roof terrace was a great addition,spacious and amazing views of the city.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location, service and rooms!”", "Author": "ValenVitols", "ReviewID": "UR133565501", "Content": "We loved the Praktik Metropol in Madrid! The location couldn't be better. If you like to walk, it's close to most of the important sites in the city center: Cibeles, Plaza del Sol, La Latina, Callao, etc. The service was amazing (¡gracias Helena y Mariangeles!) with great staff, and the rooms clean and spacious. We were lucky to have a room with a view to Gran Via on the same weekend when Pride and the 2012 Eurocopa win. Not only we took fantastic photos from here, we did from the rooftop terrace, too. If you're on a budget, you can't beat the €1 Nespresso + donut breakfast, even though the bocadillos de jamón at Iowa next door are cheap and delicious. Yes, it is the \"red light-ish\" district and you will see plenty of \"girls\" over there but they don't bother or approach you and there's a closeby police station. So, other than be cautious with your bag and belongings (due to pick pocketing), you'll be fine. The only thing to consider twice is the laundry service. It's fantastic quality-wise but super pricey. We loved our stay here!", "Date": "July 6, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Wonderful in the heart of downtown”", "Author": "kareros", "ReviewID": "UR133433724", "Content": "Like advertised low budget design hotel. Nicely done. Spacious lobby. Roof terrace. Small but nicely decorated rooms.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Soignies", "Title": "“Very good hotel”", "Author": "Ronny V", "ReviewID": "UR133413832", "Content": "This hotel is a nice hotel with an ideal situation, in the heart of city. Very good price vs quality. Rooms are not big, but they offer all you need. Anyway in Madrid there is so much to see that you need a good bed and this is perfect. I loved the decoration of the corridors and the lobby. I recommend this hotel.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good 3 star hotel with modern features but small rooms! Good value”", "Author": "AlexPtraveler", "ReviewID": "UR133395444", "Content": "Overall: OK budget hotel with some nice design features but tiny rooms.  Location: Gran Via and Montera. Very good location and bang on the center in walking distance to various places. Gran Via has some \"ladies of leisure\" though so if you are offended by any chance then maybe it's not your area. But very safe anyway. Very walking distance to Chueca where bars are.  Internet: it's included and free. But it is quite clunky and dropped at times or didn't connect to certain sites. Probably because it was overloaded from all the people sitting out at the  Gran Via / Montera street making use of the free Internet! Rooms: Small I have to say. You have to develop some kind of traffic light system if you are sharing with someone else as the hotel doesn't have enough space for 2 people to be roaming around the bed at the same time! Terrace: A nice terrace is also available for you. No pool of course though.  Breakfast: The hotel has Nespresso machines where you have to pay 1 euro per coffee pod. Supermarket style donuts (not very appetizing!) are also available for 1 euro each.  Staff: Very polite and smiley.  Towels: We didn't have our towels changed again and they were a bit dirty. Would have expected the cleaners to have done it as they only gave us new towels the first day.", "Date": "July 3, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Arezzo, Italy", "Title": "“Great location , funky design”", "Author": "paolok66", "ReviewID": "UR133151194", "Content": "The hotel is very central in the middle of Gran Via. We were lucky and got a great room (906) on the top floor with a roof terrace. Enormous bed , wifi and very funky design . Booked on line and got a very good rate.will be back", "Date": "July 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pearl City, Hawaii, United States", "Title": "“Great location, price and view!”", "Author": "Monchalee", "ReviewID": "UR132891225", "Content": "This is a quaint hotel that was closer to being a really nice hostel. It had all private rooms and bathrooms, free wifi and printer/computer usage, and an obviously older clientele (by older, I'd say 30+) who are looking for budget accommodations. There is only one staff member working at any time, aside from the cleaning crew, so expect to wait for assistance if there are other hotel guests occupying that staffer's time. The rooms are clean, the bathrooms are nice and the 9th floor veranda has an amazing view of the city. The location is fantastic, right in the Gran Via area, just a 5 minute walk from Puerta del Sol. However, because this is a main drag of sorts, there are always a ton of \"working women\" right outside, even during the daylight hours. Don't let that get to you, though... the price and convenience of location should make all of that seem better.", "Date": "June 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Great Location and Price”", "Author": "cncan11", "ReviewID": "UR132525448", "Content": "Very happy with my stay here! The room was very cheap (I got the best rate by booking on their website) and perfectly located in the centre of the city. I walked to all the major sites in Madrid as you couldn't have picked a better spot to stay (also close to the metro). The staff was friendly and the rooms were clean. Note that the rooms are very small though so don't be expecting a standard size hotel room. Perfect when backpacking and travelling solo.", "Date": "June 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montenegro", "Title": "“Very nice decó, wonderful view!”", "Author": "RaquelPonsati", "ReviewID": "UR132403852", "Content": "This small very nice hotel is just in the corner of Montera and Gran via, it was supposed to be a great point, but in the weekend the pedestrian street Montera is not very well frequented unfortunatelly! Although It doesn`t make any diference for us, we could walk around and do all we want, we came back late and there was no problem, just an esthetics question, like trash and and ugly people", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Excellent!”", "Author": "mrpatterson", "ReviewID": "UR132352276", "Content": "I'm in the middle of a 4 night stay at the Praktik Metropol. I LOVE it! Central location, beautiful common areas (including the 9th floor terrace), nice toiletries (H2O brand), lovely and quiet room with lots of natural light and great shower (I'm in a superior room). The A/C works well. The front desk staff is super nice and helpful too. Based on previous reviews, I thought the 24-hour prostitutes were directly in front of the hotel entrance. Not true. They are sprinkled throughout the plaza, which is not a big deal.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lafayette, IN", "Title": "“Great Value”", "Author": "KeithLafayette", "ReviewID": "UR132345370", "Content": "I stayed here for six nights toward the middle of June. Overall, I thought it was a great value for the money. I got a double superior room for an average of less than 100 dollars a night, one of the better values in all my years of travelling around Europe. I would not hesitate to stay here again. Positives of the Metropol include the location right next to the Gran Via Metro stop, which means that everything most people want to see is within walking distance. From the airport I would take the Aeropuerto express (5 euros) to Place/Plaza Cibeles and walk about 10-15 minutes to the hotel. The ladies of the night (who seem to work day and night) outside the hotel were no bother at all, but I could see why some might rather not see the all the time. The main lobby on the second floor is quite nice in a quirky sort of way. I enjoyed sitting there in the morning with my 1 euro coffee and donut. There are two computers in the lobby with a printer for guests, though the free wifi in my room worked flawlessly. My room was a nice size and spotlessly clean, though this was the top end room and I wonder about the size of the more basic rooms. If you can spare the extra 10-15 euros, splurge for the larger room. The white decor is pleasant and cool. The air conditioning worked very well, which can be critical during the Madrid summer. The glazing on the windows was great and I never heard a sound from the busy street below. The people at the front desk were fine, though the women tended to be a little friendlier than the guys. The only real negative of the room was a slight odor at times, which the management seems be aware of based on responses to some previous reviews. Apparently it has something to do with broken pipes it is trying to get permission from the city to fix. In the meantime, I would suggest they get a few room deodorizers and place them in the bathrooms. That should do the trick as the smell is not that strong. The only thing about the hotel I really did not like was no one at the reception desk from 23:00-7:00. During those hours there is only a security person at the front door. One night I left my key in the room as I left the hotel a little after 11:00, and getting the security person to understand and help me was bit difficult (luckily I found someone at the front desk working a little late). I wonder what happens if someone has to check in very late in as a result of a delayed flight or something. Overall, I think this a great option for central Madrid for those on a bit of a budget.", "Date": "June 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Great choice”", "Author": "TheTravelover", "ReviewID": "UR132270402", "Content": "the hotel stands on a main rambla, with pedestrian traffic at all times, making us feel very safe. Rooms are average but in tandem with the price. Very friendly people at the front desk. i would definetely recommend them. we had a room on the 2nd floor with double glass window so we did not hear the loud crowd on the street despite the celebrations for the Copa del Rey final. There is also a terrace on the 9th floor with gorgeous view from Madrid.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "NY", "Title": "“Worst place I ever stayed”", "Author": "Bapu54", "ReviewID": "UR132195642", "Content": "Rooms are newly renovated but stink like a sewage plant. View out of our room to the courtyard which isn t much more than an elevator shaft, dirty and full of rubbish. We had to sleep with the airicon running on high for the whole night due to the stink. The roof terrace is nice but the staircase is not lit up (no lights at all , not the light turned of !!) which resulted in me missing one step despite all cautions straining my ankle. Next morning I wanted to make a phone call to the airline we were flying out but Juan, an extremely unfriendly and rude receptionist simply refused me the use of the phone at the reception. He told me to go outside and use a public phone boot instead. I walked the distance of nearly 200 meters and found three phone boots all not working. Made my way back to the Hotel with my ankle hurting like … and asked again Juan if I could use the phone for a quick call to the airline office at the airport. He again refused to assist and told that if I have to make a phone call this is not his problem but my problem. Finally a colleague of his came and she gave me the phone without any question. Juan however told me after about a minute using the phone that he needs the phone back as some one might try to call the hotel (they have only one phone in the whole reception area? Juan was the most rude and impolite reception staff I have ever met in 35 years of travelling. Considering the situation on the Spanish unemployment market he should be more worried! This was the first and last time I ever stayed at this hotel or that I have made a booking through AGODA.", "Date": "June 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barcelona", "Title": "“Helpful”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR131940354", "Content": "Very helpful and friendly staff with smiles and tips for our stay in Barcelona. Metro riht outside the hotel and a delicious bakery!", "Date": "June 14, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Clean, great value, great location”", "Author": "MD K", "ReviewID": "UR131929316", "Content": "Fantastic location, right on gran villa and steps from the metro. Easy walk to puerta del sol, plaza mayor, plaza Santa anna, and other great tourist sites, restaurants, bars, shopping, etc. The room was small but they make great use of the space. The minimalist, modern decor had a clean look and avoided the cluttered, dusty look of a lot of other hotels in the area. All the fixtures were moden and the hotel was clean and quiet, despite the location right on gran villa. The rooftop deck is spectacular and a great place to drink a bottle of wine or three. Staff was pleasant and relatively helpful. free wifi. I can see how some people thought it had the feel of a hostel. The downsides: there are few amenities other than those previously mentioned. You cannot get ice and there are not even pens and paper in the room. (with the great location, however, you can find anything you need close by.) Also, there are a significant number of prostitutes that work the area directly outside of the hotel. Even so, it is still a safe area and no one bothered me coming and going, or even sitting at a cafe right outside the hotel.", "Date": "June 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“An enjoyable curiosity - and good value”", "Author": "AlKronos", "ReviewID": "UR131735303", "Content": "Trying to nail exactly what the Praktik Metropole is, and define the ambience of its immediate surroundings is not easy. As someone else has observed, it is somewhere between a hotel and a hostel - but while that might sound off-putting, it actually makes for a very pleasant, relaxed stay. In fairness it is much closer to \"hotel\" - it even has its own rooftop terrace (separated from the hotel proper by 5 floors that manage to contain a further 3? hostals!). The views from the terrace were spectacular. Its location is superb: 10mins from Prado; right on Gran Via and only 20metres from the metro. We found the receptionists to be helpful and friendly, and the whole check-in and check-out process was very easy. The reception also sells the Nespresso capsules for the coffee machine., and we found the 1 Euro coffee + donut deal unbeatable! However, if you don't fancy that, then there's plenty of cafes within 100 metres. Also within that 100 metres is a micro-red light district. In the pedestrianised street outside the hotel (and seemingly ONLY in that part of the street) a number of \"ladies of easy virtue\" ply their trade - morning, noon and night. It is clearly a trade tolerated within this small area, but seems odd to be happening alongside the regular hurly-burly of a busy street. Our room, though not spacious, was comfortable and despite its location, overlooking Gran Via, was reasonably quiet. Our enjoyment of the room was marred by intermittent but prolonged odours emanating from the bathroom and the air con. With the bathroom, we found filling the sink with water tended to reduce the smell. As for the air con, that was more elusive and we never really succeeded in eliminating it. I think we just ended up ignoring it. Despite that, we thoroughly enjoyed our stay and would recommend the hotel - in part because it offers great value for money.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great location!”", "Author": "Tiffany E", "ReviewID": "UR131683118", "Content": "My friend and I stayed here for 3 nights. I was a little turned off at check-in. The receptionist snapped that I did not book a double twin room and when I showed him my confirmation that confirmed a double-twin room, he snapped that it doesn't matter because the room wasn't ready and we couldn't check-in anyway. He was not friendly initially. Since we had a few hours to explore before we could check-in, the receptionist took our luggage to storage and outlined places for us to see. He slowly warmed up. The room was a decent size and the bathroom was great. Everything was very clean. I liked the 1€ coffee near the lobby. The location is near shops and restaurants. Try a croissant at La Mallorquina. There are prostitutes right outside the hotel but the area is not seedy or dodgy. They mix in among the people eating and sitting at the cafes. Overall, we had an amazing stay and a great visit.", "Date": "June 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great room, gross smell!”", "Author": "ellealphabeta", "ReviewID": "UR131628184", "Content": "The building is gorgeous! We loved the design and feel of the interior... the decor is funky, interesting and pleasing. We were also very happy with our room - it was very large with plenty of room for the two of us with a large bed and nice big chairs in front of the huge windows looking out over the square/street. We were very grossed out, however, by the putrid stench of mold coming from the bathroom. The bathroom was pretty gross overall - the tiles and grout were moldy and damp... we wore sandals in the shower. The smell was so bad that we kept the bathroom door closed at all times and tried to hold our breath while using the toilet or sink. Unfortunately, I should also mention that our sheets did not appear to have been laundered before our arrival. We found several hairs and even a piece of garbage under the blankets. The location is fantastic! People watching from the windows is great entertainment if you want to have a bottle of wine in your room before going out... several reviewers have mentioned the prostitutes and they weren't exaggerating. I didn't feel particularly un-safe at night... though I'd likely avoid it if I were alone. The square is pretty well lit and the McDonalds provides some comfort in the young, buzzing crowd it attracts. It's within (short!) walking distance to all the main attractions we visited including the Prado and Plaza Mayor. Overall, despite the bathroom and sheets, we were very impressed with Praktik Metropol and would definitely recommend it. Truly it enriched our Madrid experience by providing an excellent home base for our explorations. The staff that we encountered were all pleasant and professional... and spoke great English.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "intsik", "Title": "“world's fanciest hostel”", "Author": "intsik", "ReviewID": "UR131617649", "Content": "praktik metropol for me is a really fancy nice hostel more than a hotel. it lacks any service aside from check in and check out. the rooms are kept nice and clean and well decorated. we got the biggest rooms with views out to gran via, which were awesome. bathroom was a bit small, and we needed more surface space to put our stuff down. a refrigerator would have been nice too. my main complaint was that the whole time we were there, only one elevator was working for 9 floors, and it only fit 4 people at a time. there was a lot of using stairs. i would recommend this for the decent room size, and the location which was great. yes there were hookers along the entrance, but they dont really bother anyone, so no worries. the subway is right across the entrance, and around the corner is gran via shopping. across the gran via is chueca, which has great restaurants and bars.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great location and price in Central Madrid!”", "Author": "MarkPittsburghPA", "ReviewID": "UR131519456", "Content": "We stayed at this hotel in Central Madrid in late May 2012. Similar to other reviews, we would agree with the comment regarding the location, quality of room, artwork in the hallways, rooftop patio, and the \"personality\" of the \"front desk girl\". Location is great! near expensive and inexpensive shopping, restaurants, museums, subway, many plazas, etc. We took a taxi from the hotel to the train station was less than 10 Euro. (The prostitutes were no problem.) Room was great. (see photos) Great artwork in lobby and hallways! Rooftop patio is a must-see!! Regarding the front desk agent; she was \"cold\" at first but slowly warmed up after you talked to her. The elevator could only hold 2 people without luggage or 1 person with 2 suitcases. We used the stairs often. One recommendation; skip the pastry and coffee provided by the hotel and go to a local cafe or McDonald's next door.", "Date": "June 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing location and cool style”", "Author": "Rocketdogc", "ReviewID": "UR131361339", "Content": "Once we got past the extreme rudeness of the front desk girl (she was mean to every guest, not just us), we ended up loving the hotel. The decor was excellent to the detail. The view from our balcony (or the rooftop if you don't get a balcony) was great, especially at night. And the location is unbeatable, with the metro outside the door, the Puerta del Sol a short walk away, and both Chueca and Malasana districts next door (highly recommended areas for bars/restaurants/plaza sitting).", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Praktik Metropol - small but chic”", "Author": "leoleoleoleo", "ReviewID": "UR131355223", "Content": "5 minutes from all of the shopping along the Gran Via and a short walk to the Prado, this hotel was very hip and had some interesting features. The rooms were spotless, but were extremely small. The air conditioning was very good, however, and there was a welcoming central \"living room/common area\" with a fireplace and library,large sunny windows, and comfortable chairs in which to watch the people walking along Calle de Montero. Interestingly enough, the Calle de Montero was full of prostitutes hanging around. They were not aggressive, but seemed incongruous in such a popular area which is frequented by locals and travelers alike all day, and into the night. We could walk easily to the Prado and shopping were all within 15 minute's walk. Garage parking was an outrageous 40 Euros per day,and the hotel is inaccessible by car, but close to the Gran Via metro stop.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newtownards, Northern Ireland", "Title": "“Loved it!”", "Author": "Liz119", "ReviewID": "UR131338341", "Content": "We stayed in this hotel for 2 nights in April and just loved everything about it! We had a great corner room overlooking the Grand Via and although the rooms are small they are well appointed with everything you need. The reception area is very welcoming and lovely to sit in after a day out sightseeing. We found the local hookers quite entertaining to watch! This is a really quirky modern hotel very funky decor and spotlessly clean. All the reception staff we met were very pleasant and helpful and all had a great command of English. We would definately stay here again.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Caguas, Puerto Rico", "Title": "“Just Perfect!!!”", "Author": "japlaza", "ReviewID": "UR130545564", "Content": "Excellent hotel, right next to the Metro Sta. Gran Vía. Stayed from May 9 to 12. Excellent location, excellent room with every commodity: safe box, hot water, a/c, etc. Got a room with small balcony viewing Gran Vía, probably was a Superior room. The staff was always available and helpful. The lobby has a couple of PC's where you can get addresses, make your flight check-in, etc. Before doing my reservation I did a lot of research and was a little concerned about the night ladies nearby but really wasn't a trouble. The area was very safe including night time and police keep preventive watch aroud at all time. It is an area with people walking around at all times and very easy to walk to Plaza del Sol, Plaza mayor, Palacio Real, the Cathedral and Plaza de Oriente. For sure will stay again in the future and recommend lodging in this Hotel.", "Date": "May 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Central location, in the heart of Madrid!”", "Author": "Julie C", "ReviewID": "UR130539352", "Content": "This affordable hotel is perfectly located in a lively spot for exploring this vibrant city. Grand Via, Puerta del Sol, Plaza Mayor were all within walking distance and the Metro, with its connection to the Atocha Train station made our transfers a breeze. Our room located on the 4th floor was small, dark but quiet and conducive to sleep I like the funky interior design throughout the hotel and the higher end bathroom fixtures add a nice touch of luxury. The reception area and lobby was spacious and inviting and we enjoyed watching the Monteral street action from the armchairs. We had a comfortable stay and would definately recommend this hotel to our friends.", "Date": "May 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampere", "Title": "“Lovely hotel”", "Author": "ninniksi", "ReviewID": "UR130510148", "Content": "Stayed in Praktik Metropol for 4 nights in May 2012. We chose the hotel because of the great reviews from other travellers,,, and luckily we did! The hotel was totally amazing, just like in photos taken from the hotel. The roof terrace was absolutely lovely and the view over the city was breathtaking. Our room on the 3th floor was stylish and it was spacious enough, the traffic noise didn't bother at night, the room was quite quiet thanks to double-doors. The view from our little balcony to Gran Via was very nice. Hot water, air conditioning and free wi-fi worked smoothly. Receptionists were helpful and friendly. I would definetly recommend this hotel.", "Date": "May 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Excellent hotel, right in the centre - loved the roof terrace”", "Author": "JohnHunter1980", "ReviewID": "UR130471797", "Content": "Stayed in this hotel for 3 nights 13 - 16 of May 2012. The location is perfect, right on the Gran Via with a Metro station outside, a shop across the road and McDonalds & other cafes right on the doorstep. There are some ropey looking hookers hanging round outside but they cause no nuisance at all and don't bother anyone. Our room was on the third floor overlooking the Gran Via, it was bright, large and spotlessly clean, had a lovely big shower and balcony. The bed was comfy and had nice big pillows. There is a basic breakfast served for 1 euro of coffee and donut that is tasty enough but for something more substantial you are spoilt for choice in the area. Our friends however were allocated a pokey, internal room with a very of some industrial metal pipes but this did not affect my stay so I will not mark the hotel down for this. They did not complain or asked to be moved so cannot comment on this. The hotel has a fantastic roof terrace off the 9th floor that most guests seem to miss completely - IMO the management are missing a trick here as they should advertise it more and get a little bar up there as they would surrey cash in. The terrace is on two levels and has sunloungers, deck chairs and tables. Its only 2 minutes down in the lift and across the street to the little shop so perfect for a cerveza in the sun! I cannot really fault this hotel.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunderland, United Kingdom", "Title": "“Funky”", "Author": "nurse4cherry", "ReviewID": "UR130351881", "Content": "My partner and I have just returned from a 2 night break (with a Groupon voucher) from this really 'funky,modern' hotel. It is ideally situated for everything in Madrid...takes you about 5 minutes maximum to walk down the Gran Via,where you are central to access most of the popular streets/bars etc. The metro is situated right outside(although we didn't use it). The hotel itself is immaculately clean and it's design is quite unusual.The room we were allocated was a really good size and we were on the top floor(9th),very close to the wonderfully designed roof top terrace...very comfortably furnished,with superb views across the city.Our only critisicm would be the 2 beds placed together to make a double,are not connected,so the next morning,they have moved considerably!!The only other negative is that there are only 2 lifts,which can be a bit slow(when your on the top floor)but that's only a small price to pay for such a lovely hotel. It has an 'Ecclectic' reception area,which is really cosy and comfortable...and the coffee and donuts are a nice touch. The staff were all very pleasant and helpful(we spoke to 3 whilst there)and on our departure day,were offered the choice of storing our luggage whilst doing last bits of shopping.If you stay there,you will quickly spot a number of 'Ladies of the night' hanging around every evening...however,it's true to say,you are never bothered by any of them...I suppose you could say,it adds a little 'extra' to your break? All in all...if we ever returned to Madrid,which we probably will(as it's a brilliant city,with so much to do and see),then we would definitely stay there again. Give it a go...I don't think you'll be dispointed?", "Date": "May 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colwyn Bay", "Title": "“A real find for a Madrid stay”", "Author": "Chris J", "ReviewID": "UR130267303", "Content": "A first for me - the first time I have ever booked a hotel purely on the basis of user reviews (Trip Advisor & Booking.com) rather than Rough Guide, Time Out, Rick Steves etc and we wre not disappointed. I booked directly with the hotel getting an early booking discount unavailable elsewhere and took other reviewers' advice to get a superior double. We were on the 4th floor overlooking the Gran Via and, amongst other things, from our window/juliet balcony were able to enjoy the celebrations after Atletico won the Europa Cup and the city rolled by below. Once closed the windows supressed street noise very adequately and the air conditioning kept us cool in sweltering Madrid. The room was spacious, well equipped and nicely furnished and, whilst we prefer a bath, the double shower (both overhead fixed and hand) was a cracker. Although the hotel was full the room insulation was excellent and we barely heard our fellow guests. The roof balcony complete with sun loungers is a nice bonus. Staff spoke excellent English and were friendly and helpful. Travelling to and from the hotel was a doddle. The new Renfe train service signed \"ferrocarril\" at the airport Terminal 4) takes you direct to Atocha station and from there Metro Line 1 takes you to Gran Via. Use the C Montero exit and the hotel is directly in front of you. Using this route is not only quicker but cuts out lots of steps on the Metro. One final tip - you never know who might be a pickpocket in Madrid or where they might have a go. Women especially should ensure that they can reverse their backpacks so that no zip pockets are easily accessible.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“The smallest of rooms centrally located”", "Author": "GEDLosAngeles_CA", "ReviewID": "UR130137925", "Content": "The only question to ask oneself about this value hotel is: how many nights could one possibly stand being in a hotel with such small rooms? Not too many would be the answer. What this hotel is excellent for is a one-night stop on the way to somewhere else. Why? It is right up the stairs from a subway line. It is a few minutes' walk either to the Prado, the Retiro Park, the Plaza de Espagna, etc. But how many times can one wait minutes for an elevator? How many pivots can one make in a hotel room to step around one's mate so as to get into the bathroom? And how many times does one want to walk past a passel of prostitutes in order to enter the hotel? All the above stated, this hotel seemed to be fine for the many young folks who chose to stay here. Maybe it was the low cost or the somewhat stylish old-style design. Perhaps it was the public computers that a young Mom thought was ok for her little daughter to play with while a line of people waited to print out their airport boarding passes. Or maybe they didn't mind that the damn keyboard on the second, and only other, computer had stuck keys to the point that the very nice person behind the desk had a pen top he regularly used to try to unstick them, unsuccessfully. I mean, a new keyboard costs $20!!!", "Date": "May 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great location, good looking hotel”", "Author": "milkolisette", "ReviewID": "UR129782397", "Content": "Nice and clean hotel, modern, urban furniture, with entr'acte to great rooftop terrace. You may brin your on drinks to The terrace. Excellent location for sightseeing, nightlife, restaurants an shopping. Metrostation entr'acte 20 mtrs from hotel, friendly personel!", "Date": "May 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Yorkshire", "Title": "“practikally perfekt”", "Author": "Edgie", "ReviewID": "UR129610845", "Content": "Stayed here over the uk bank holiday, very good value for money, funky interior, very friendly service - the chap behind reception was very pleasant. The one euro coffee/donut combo is a nice touch. Rooms seem clean, bathroom nice, and even though our room faced onto grand via the noise was minimal due to the effective double glazed balcony doors. For this price, in this location, probably best deal in Madrid.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Amazing Location, Sleek Interior, but Hot Water Sucks!”", "Author": "charcharLA", "ReviewID": "UR129250714", "Content": "Absolutely amazing location right off Gran Via metro stop. If you're trying to find the place, it's right next door to McDonald's. Check-in was on the 2nd floor - there are 2 tiny elevators that you can take. Our room, 314, was tiny, but I guess that's cuz I booked the cheapest room. Even thought it was small, it was enough for the 2 of us thanks to the amazing hooks all around the room. Bathroom was modern, clean. Sheets were clean. Bed was comfortable. Only complaints are the crappy WiFi when everybody else is on and the lack of hot water during popular showering times. The staff speaks enough English to be able to answer most questions.", "Date": "May 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location on the Gran Via”", "Author": "Gryphon1403", "ReviewID": "UR129125472", "Content": "Stayed here for two nights in April during a trip to Madrid. Location can't be beat, right on the Gran Via, within a walk able distance to everything in Madrid. Rooms were decorated in an 'Ikea' style, simple and tasteful. Negative points, bed sheets still appeared to have hairs on them ande when we asked the front desk to help us reconfirm a tour we had booked online with a local number, he pointed us to a payphone downstairs. But overall, value is good.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“good location”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR129018801", "Content": "location is very good, don't look at the hookers on the street. Rooms can be cleaner, sometimes dust on my socks and a strange smell at the bathroom. But the rooms are quiet but if you have a room at the side of Gran Via then you have till 24 hours big lights between the curtens because of a very big billboard at the street. It is near metro Gran Via. The hotel street has no cars so you can shop good!", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Excellent location”", "Author": "witelily", "ReviewID": "UR128420558", "Content": "Located in the centre of Gran Via, the hotel is close to everything: 1. Transport- Gran Via metro just in front means you are link to train station, bus station and airport(yes the metro does go to airport) 2. McDonald just next door, and plenty of restaurants nearby 3. Those who wants to take half or full day escorted tour from Madrid (eg Toledo or Segovia/Avila tour) the hotel is just 5 minutes walk to trapsatur office ie meeting point of the tour. 4. Shopping- I lost count of how many Zara and H&M outlet alone along Gran Via, 5 or 6? Sol also within short walking distance. Hotel itself: room is all white-from curtains to furniture, very clean and modern, simple and stylish (very Ikea), comfy bed, feels more like a service apartment(room) than a hotel. Very friendly and helpful staff, very cozy common room- perfect to lay in the sofa by the window and have a sip of coffee in a rainy day or at night just watching people pass by. I like everything of the hotel. Highly recommended for those who look for a nice place to sleep and use public transport to explore Madrid and nearby cities. Not for those who look for pool or full hotel service.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Best Ever Budget Hotel”", "Author": "carkeyhome", "ReviewID": "UR128215231", "Content": "Loved the quirkyness of the hotel. Its decor was well beyond what you'd expect for the price. No tea making facilities in the room (cafe across the street though) but it was very clean & the towels were changed daily if requested. Breakfast offered was coffee (vending machine) & donuts(prepacked) for 1euro but theres plenty of full cafes on the same street. Dont miss the roof terrace.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Excellent location, value and at the very Heart of Madrid”", "Author": "wcub", "ReviewID": "UR127839944", "Content": "I don't think you can stay anywhere in Madrid as centrally-located as Praktik Metropol - the Gran Via metro station is right outside if you need it, but those with good shoes and an adventurous soul might find walking in any direction a feast for the senses. Turn left and you are in the narrow, medieval streets of a lively shopping district. Turn right and head down the hill to Plaza del Sol and Plaza Mayor. Go forward and explore down Gran Via and end up in the fabulous Parque del Retiro. The other direction down Gran Via will bring you to the Palacio Real. Ideally situated is an understatement. Loved the hooks on the wall surrounding the inside of our room! Honestly, this is the best feature I've seen in a hotel room besides WiFi. When travelling, the biggest challenge in some small hotels is 'where do I hang my stuff?' The multitude of hooks solved this in a simple, yet practical fashion. The rainshower head in the shower was terrific, and the water pressure was superb. After all that walking, it was nice to be able to have a very decent shower. Hint: to activate the secondary flexible shower head, you have to turn the little knob (not the big temperature dial). The bed was comfy and we slept very well. BBC/CNBC, etc. as part of the channel selection was welcome. The decor is nice and appears to have been recently done. Friendly staff at any hotel can make or break a stay and I was not disappointed. Every employee we encountered was the very definition of hospitality.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Very much surprised”", "Author": "eazyeh", "ReviewID": "UR127323374", "Content": "After my stay at the Praktik Hotel in BCN I dreaded coming here but I was pleasantly surprised upon arrival. It is right on the square next to the Gran Via metro and a short walk to Sol. Nice walk to Plaza Mayor and the Royal Palace and other attractions, Many places to eat including Mcdonalds and KFC, The room was very good and next to the rooftop terrace.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crawley, United Kingdom", "Title": "“What a classy place to stay! Great location”", "Author": "Hobbsy14", "ReviewID": "UR127247523", "Content": "My wife and I stayed at the Praktik to celebrate my 30th Birthday and what a great place to stay which is in the centre of Madrid. So easy to get to from the airport as the hotel is right next to Gran Via metro station. The hotel decor is one of the most amazing I have ever seen and I really hope they're able to keep it in order for the next time we visit Madrid. The staff were very polite and always on hand should you require any assistance. We will definitely be returning to this hotel.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Asaph, United Kingdom", "Title": "“what a find!”", "Author": "eleri r", "ReviewID": "UR127144096", "Content": "Fabulous hotel. Excellent location for exploring madrid. Staff were friendly and helpful. Room was of good size with plenty of storage space and spotlessly clean, Little balcony looked out onto the grand via - brilliant for people watching! Beds were big and comfortable. Would definitely book again and recommend to any friends and family.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "evesham", "Title": "“Great hotel at bargain rates”", "Author": "faxEvesham", "ReviewID": "UR126957546", "Content": "Stayed four nights and can't fault this hotel. Our small room was well equiped and beautifully clean. It was at the back so lack of view was compensated by peace and quiet.Rooms have heating/air conditioning and extremely comfortable (long!) beds. Hotel extremely well situated within walking distance of major sights and Metro and bus on the doorstep.Near many local restaurants catering for every taste. Hotel reception staff helpful and friendly. 'Ladies of night' outside adds to local colour!", "Date": "March 30, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sao paulo", "Title": "“great location but no service”", "Author": "nilsontakashi", "ReviewID": "UR126558460", "Content": "I am a little disappointed with praktik hotel metropol. The location is amazing, but no service. The internet connection not works and I couldn’t check my email at room and work as I want. Clean was bad, my bathroom had a bad smell. Check in service was a little confuses, they give me a room, and in the middle of my stay asked to change, next day said to not change. All the times my keys were blocked. They had a very big space at lobby that could have a very simple breakfast. I missed breakfast at hotel.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Chic and Charming!”", "Author": "Catherine X", "ReviewID": "UR126551639", "Content": "I would highly recommend this cute little boutique hotel to my friends who wants to visit Madrid! I love how it stands out for its superb location, neat lounge and thoughtful decor, you feel living in a timeless space in this busy city. The amenities are all in great shape, but the only cons is the unreliable internet --on and off all the time. But still, it served our needs quite well. Catherine Xu San Francisco,CA", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Tiny room, great location”", "Author": "KatWomanNYC", "ReviewID": "UR126518947", "Content": "We booked Praktik Metropol with much trepidation after researching hundreds of hotels in Madrid. We take a trip every year around this time for our wedding anniversary and my birthday. I had narrowed down my choices to just a handful of hotels; however, by the time I was ready to book the airfare prices were going up while my budget remained the same. I called expedia to complete the booking once I found a flight and hotel package that was reasonable. I was able to create a package with two destinations, albeit without regional flights, but I added in a hotel that I was not interested in using in Barcelona (simply to see pricing). The Barcelona apartment that I wanted to book was not available on expedia. As I was on the phone with expedia, the price of the flights kept changing. The price of my 1 hotel and 3 flight package went up by $91 by the time the booking was complete due to flight pricing. I found Praktik Metropol on expedia when opening up my search for more budget friendly hotels. Arrival: We took the train (metro aka subway) from the airport. We are from NYC and have used the NYC subway aka metro often. The Praktik hotel was easy to find, right in the middle of everything, off Gran Via. Transit to hotel from airport requires multiple transfers. We followed the directions on the hotel website: From the Barajas airport take underground Line 8 from the National Terminal (Terminal Nacional [T2] towards the Nuevos Ministerios stop. We later learned that you can get the metro from Terminal 4 which is where our plane landed. Once you reach the end of the line (Nuevos Ministerios station), change to Line 10 travelling towards Puerta del Sur and change trains again at the Alonso Martínez station. At Alonso Martínez, change to Line 5 towards Casa de Campo, and get off at the Gran Vía station. The hotel is directly in front of the underground stop. The route from the airport to the Hotel Praktik Metropol took about 1 hour since we took the free airport transfer to Terminal 2 from Terminal 4. We had to wait on other travelers, one of which seemed to literally be moving his kitchen cabinets from Barcelona to Madrid via the shuttle bus. We paid €2.50 per person. There are not a lot of elevators in the metro so you will need to carry your baggage up and down stairs. A taxi is about 30 minutes and much more expensive. Check-in: The reception for the hotel is on the first floor, shared with several hostels that do not occupy the entire building. Be sure to enter the correct part of the building for Praktik. There was a door person to direct us to the correct location. The elevator is tiny. My husband took up the suitcases in the tiny elevator while I carried the hand luggage up the stairs to reception (2nd floor). Both of us would not fit in the elevator with our luggage (4 pieces). There were a lot of guests hanging out in the lobby reading the paper and on their laptops when we arrived on a Saturday afternoon. We later learned why. Fast and friendly check-in: Check in was fast and although I was trying to practice my Spanish, it was done in English. We were given room 221 which I liken to a prison cell. It is an interior view room that looks out onto the duct work, duct work which could use a good cleaning. We had just come from Barcelona where we rented a 1 bedroom apartment with kitchen, dinette and living room so this tiny hotel room at the Praktik made me feel like a convict locked away in a cell. Within minutes of seeing the room, we tried to move to a larger room but the hotel was fully booked. There was about 1 foot of space around the perimeter of the king sized bed. The bed, two twins (or doubles) pushed together, was on wheels. It made for an interesting night when the beds started to slip apart. The beds were very firm, not a pro unless you prefer a firm bed. I recommend some kind of wheel locks for the beds to keep this from happening to other guests. We kept the bathroom doors open to give the impression of a larger space. Luckily we did not spend a ton of time in our room, otherwise it might have been unbearable to be in such tight quarters. We kept the curtains closed for our entire trip. We figured out that the tiny rooms was the reason so many guests were probably hanging out in the lobby when we arrived. We did use the pegs on the wall to hang up our clothes. My husband enjoyed using the pegs to keep the room less cluttered. Pros: Location – steps away from the metro/subway and bus, walk to Puerto del Sol in 5 minutes, walk to Plaza Mayor in 10 minutes, walk to Calle de Cava Baja in 12 minutes. We walked everywhere and did not use the metro at all in the city except to get to/from the airport and the AVE train to Valencia. I would book this hotel again simply for the location. Price – unsure, part of a flight/hotel package; if booked separately I priced the hotel at 206.81 Euro total for 4 nights (this was equivalent to $331 USD at the time) Newly renovated - everything still looked pretty new (loved the shower head) and it was sturdy/solid construction. Fee wifi – internet access in rooms and throughout hotel (free printing in the reception area) Walking distance to major tourists attractions 1 Euro breakfast (coffee, donut) - we did not partake Police station nearby - about halfway down the block Hair dryer, hand soap, bath gel and shampoo provided (we did not use the hair products) Cons: Very small room by American standards – maybe not by European standards Loud pipes - we could hear toilets flushing pretty often No counter space or shelves in the bathroom to store anything Not enough sound proofing - we could hear the other guests talking on different floors as well as hear doors opening and closing throughout the day and night. We have this same issue at home in NYC so it was not a problem, just an observation. Front door to the building, although guarded, does not seem to close. This makes for a very chilly hallway when the temperature is low. No closet; I hate living out of a suitcase but I knew prior to booking that there was no closet. Instead there is a cubby area with shelves and a couple of hangers. It was sufficient for us. Pro/Con depending on your preference: towels changed every 3 days electricity works only when room key is inserted into the wall slot (this is becoming the norm in a lot of countries) *There are a number of reviews that mention the prostitutes. We did not find them to be a problem at all. They did not approach us. If they do approach you, it is easy enough to decline their services. They are not aggressive by any means, just trying to get work for those who are interested in a “date”. Checkout: Fast and friendly. We left our luggage while we went to grab lunch prior to our flight. Our room key stopped working promptly at 12 pm so we had to get access again to collect our luggage. Train to the Airport: Rather than take the metro back to the airport we decided to try the renfe train. We discovered this option on our trip to Valencia for Las Fallas. The metro (Line 1) to Atocha Renfe is 3 Euros and then you can take the renfe train (C-1) to the airport. That is an additional 5 Euros (2.5 euro per person). It was a more direct route than changing metro trains several times. We never did get to see the balcony on the 9th floor which I understood was public. When we tried to visit, our room key did not allow us to access the 9th floor at all. We did not bother to check with reception for access since we were checking out at the time. All in all we would use Praktik again, but we would probably get a bigger room and maybe a room with a view.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dallas", "Title": "“Well placed and clean”", "Author": "notimetolouse", "ReviewID": "UR126516462", "Content": "We wound up our trip to Spain with three nights in Madrid. The Praktik Metropol was accessible from the airport by subway, and was right across the plaza from the Gran Via station. If you like walking, it is close to the Prado and several other museums and sites well worth visiting. The room was clean and quiet, and the bathroom well appointed with a nice shower. The beds were comfortable for Europe, with real pillows, and the desk staff spoke good English. On the minus side, the room was quite small, with one small nightstand and a clothes cupboard. Numerous pegs provided hanging spots, but horizontal space was minimal. No heating was required--we were tempted to use the air conditioning despite the 40 degree nights. The plaza in front was a favorite hangout for prostitutes, but some may not find that objectionable.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“value for money”", "Author": "Negrila C", "ReviewID": "UR126110596", "Content": "i went there with my boyfriend. it was a city break, and the hotel was really nice. The staff were helpful, they spoke english, the room was clean. it would be nicer to have a better breakfast, but the hotel is situated in the center of the town, so lots of cafes and restaurants around. The layout was a bit strange. I would recommend it. We stayed on the 9th floor, and the view from there was amazing!!!!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lausanne, Vaud, Switzerland", "Title": "“Superb! Love it in every ways”", "Author": "Primaully W", "ReviewID": "UR126024686", "Content": "In the beginning I booked this hotel through the booking site but when I tried to go to their website, they have promotion for autumn/winter hence I got a very good price at EUR 59/night. There was nothing I don't like with this hotel except for the reception which a bit grumpy. The hotel is located in the very heart of Madrid, at Grand Via, surrounded by shopping complex, restaurants, and very close to Plaza Puerta del Sol and lovely Mercado de San Miguel. The room we stayed was very lovely and I love the way they design the hotel and rooms. Breakfast was cheap too since I got 2 Nespresso and croissants for EUR 1. I have no problem at all with the wifi, but there was a bit leak at the shower cabin and the bathroom floor always wet after shower. It was autumn/beginning of winter, so wet and cold bathroom floor is not the best thing to have. Hope they have fixed it (if I'm not mistaken it was room 308). I would recommend this place to friends and if I got a chance to go to Madrid again, I will definitely stay here.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stafford, Virginia", "Title": "“Great Location.”", "Author": "HortDude", "ReviewID": "UR125912833", "Content": "This hotel is one of the most unusual Hotels I've ever stayed. I personally did not like the contemporary/artistic decor and furniture. El Praktik Metropol is well located within Madrid and the metro station is literally in front of the Hotel. The room and restroom were spacious and the room had a nice balcony. The \"King\" bed (two twin beds put together) was quite uncomfortable and would not stay in place (it had wheels). Overall, a good value and surprisingly quiet given the location. Yes, there are \"women of the night\" but never bother us, plus there's plenty of security/police officers around.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "geneve", "Title": "“MINIMUM”", "Author": "TomEGeneve", "ReviewID": "UR125510110", "Content": "ok, the price is not the highest, but apart from the cool lobby, the rest is really minimum.room is smallish, service not existent, the whole seems to be a YMCU with a touch of modern. Nothing to bring your gf or wife, she will leave you.So, better spend a little more and go elsewhere.there are only a few prostitutes in front of the hotel, which is the case in the whole area.but it is definitely no romantic hotel.and for rooms facing the street they charge EUR 25 plus.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“MADRID HOTEL”", "Author": "SanDiegoWayne", "ReviewID": "UR125358273", "Content": "Location Location Location - This wonderful small hotel is right in the heart of Madrid. Virtually steps from the Gran Via Metro stop. Right next to the McDonalds. Super clean and efficient rooms, wonderful beds and the pegs on the walls were perfect to hanging all of your stuff rather than messing up the floor and a bed. The staff was outstanding - Perfect English, Courteous, Helpful and overall charming. Nuno was the best. No breakfast but enjoy the One Euro cup of coffee and a donut. On nice one block walk to the absolute center of Madrid - Plaza Del Sol. Be sure to eat and bar hop in all of the Musuem Of Ham locations. Great local color", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Great”", "Author": "Marie S", "ReviewID": "UR125271582", "Content": "Excellent location - we walked everywhere! V close to Metro - easy to get to and from airport. Cafe opposite IOWE did great food - open all day and nice seating area outside. Don't be put off by the prostitutes outside, they are no bother and its a safe area. Lots of families and older people around. A great room - albeit a hot room!! Great decor, I would stay here again.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Highly recommend”", "Author": "CharlotteWahoo", "ReviewID": "UR125238210", "Content": "We spent 3 nights at the hotel in mid February and would highly recommend it. It is by far the best budget friendly accommodation we've ever stayed in and I only wish that they had hotels like this throughout Europe because it would quickly become our go to. The hotel just opened in August of 2011 and you can still tell that everything is new. The rooms were spacious and everything is finished to a very high standard. The staff at the front desk were very helpful and the while they don't offer breakfast the 2 coffees + donut for a 1 euro can't be beat. The hotel is in a great location and we had no issues with noise or with the crowded streets that surround it. Will definitely stay there again if back in Madrid and you won't find a better value for the money!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Simply the best”", "Author": "Paul I", "ReviewID": "UR124192547", "Content": "I stayed at this wonderful cool hotel in the heart of Madrid last month. It could not be more central, just a few meters from Grand Via, and was very easy for a stranger to Madrid to find. The decor of the whole place, from the street up is great - the room was very smart indeed and the bathroom , although smallish was very stylish. the staff were all very helpful & pleasant and the house keeping was above the usual. I will be staying there on my next trip to Madrid.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seville, Spain", "Title": "“Exceeded our expectations”", "Author": "Beckaboo_12", "ReviewID": "UR123368794", "Content": "We just spent two nights here and enjoyed it very much. Thanks to other reviewers we knew about the \"kupuk kupuk malam\" (\"butterflies of the night\" in Bahasa) and so were not put off by the working girls who line the pedestrian street the hotel - and our room - overlooks. They did not bother us at all, and in fact were fascinating to watch from the comfortable lounge area on the first floor. Our room was very clean and comfortable, with a big shower. The only thing on our \"want\" list would be a chair or two in the room, or on the balcony. The location could not be better; we walked to everything we wanted to see and appreciated having the metro right outside to take us to/from the airport. The front desk staff were pretty good, but I wouldn't say that we were warmly welcomed or thanked, but the young woman was good about getting the in-room safe fixed. I would definitely stay here again.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Just awesome!”", "Author": "Sarah K", "ReviewID": "UR123339516", "Content": "My husband and I found this hotel to be the best one we stayed at in Spain. The first thing we noticed was the retro decor. The reception area is wonderfully decorated, very modern with a young flair. Reception desk was very helpful as well as the cleaning staff. Our room was very spacious with and en-suite bathroom. We also had a magnificent view from our room. The location is perfect. Close to the sub-way and many other public transport options. Gran Via is right on your doorstep as well as the main town square. Negative comments....no breakfast :( and the lift is rather tiny. All in all, we had an awesome stay and we will definitely come back to this hotel!", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kuala lumpur", "Title": "“two thumbs up!!!”", "Author": "monophobia", "ReviewID": "UR122696402", "Content": "We stayed here for 2 nights in Nov 2011, a double sharing room. This is a very nice hotel, extremely clean and modern, one of the most wonderful hotels that we have been to (for the price of E65 per room). Location is right in front of Gran Via metro stop (literally less than 10 steps away). Very convenient if you are using a lot of Metro to travel. There are also a lot cafes, and shopping can be done nearby. Receptionist is very courteous and helpful, the waiting area is gorgeous too. Room - comfy,huge bed and pillows, heater working fine, though air conditioner is slightly down, but it was not a problem for us as there is a window in the room. Toilet and shower - extremely clean. This hotel is very nice and we will definitely stay here again.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Good location”", "Author": "angellove2002ph", "ReviewID": "UR122308332", "Content": "The location is excellent but the lift is so small and the lobby going to the rooms at 4th floor is dirty.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Samut Prakan, Thailand", "Title": "“Good accommodation at reasonable price”", "Author": "misskyo", "ReviewID": "UR122213521", "Content": "We stayed there for 2 nights. The hotel is lovely and situated in a perfect location, though the area is full of prostitutes and can be awkward at night (for men). The bathroom door is see-through and might be a bit odd if you are not travelling with your partner.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Enjoyed it!”", "Author": "Sara923", "ReviewID": "UR121929800", "Content": "I stayed here with my family in December 2011. The hotel was so easy to get to from the airport! The metro stop was right there! I loved the decorations on the walls. Our room was spacious and had a nice balcony. There are \"ladies in waiting\" on the street, but they didn't bother us. We just walked past them...no issue there. And there is a police station further down the street. The hotel was conveniently located near the major plazas...all in all a good stay...", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lanzarote, Spain", "Title": "“Fabulous beds and pillows”", "Author": "Samantha J", "ReviewID": "UR121803761", "Content": "What a fantastic hotel. The rooms were well laid out, clean and the beds and pillows were the best out of anywhere I have stayed before. The shower was fantastic with a seemingly never ending supply of hot water. There was a vast number of channels on the TV, quite a few of which you could watch in english. We also took advantage of the coffee and croissants available in the day room at a very small charge.The only small gripe would be the noise from Calle Montera in the early hours (around 3 am) from the street cleaners and bin men. If the shutters worked that might block the sound out. Would definately stay again, but would need to have be on the other side of the hotel. The rooms were cleaned every day and new towels and toiletries left. And the free wifi was a bonus! Desk staff and doorman were very friendly.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Austin, TX", "Title": "“A different sort of a place”", "Author": "Joe W", "ReviewID": "UR121398467", "Content": "My first impression when I looked at the photos on the TA site was \"backpacker\" hotel, which I still believe it primarily to be. As one can tell from the photos the rooms are very small, there are built in cabinets with shelves and otw there is about two feet of space around the bed(at least in our room. Our friends room had enough space for a small coffee table and chairs). Note the wall pegs in the photos. They are all around the room and actually quite handy in a small room for keeping things from getting so cluttered. The bathroom was about 4 by 8 with a nice walkin shower. They had good fixtures and adequate towels. Bath amenities includes a round bar of soap which was replaced daily, and some shampoo and conditioner. The hotel is ideally located about 300 yards from Puerta del Sol and within waking distance of all the important stuff (Prado, etc.). There are lots of places to eat around although I cannot attest to the quality of most of them. It is in a very active, energetic area and about 50 feet from the metro stop. Now, out side the hotel are a bevy of very young and slender hookers that are there arout 24/7 come he** or high water. Like R. Steves says, they look like high school girls who are sneaking out for a smoke. They are of no bother and if one approaches you, you just say \"no thanks\" and that is it. BTW, there is a police station about 100 yards down the way. Please note in the photos that the hallways , though narrow, are plastered with posters of movies, shows, and the likes which gives the place sort of an energy. The reception is in a big hall sort of a room with couches and two computers(there is also wifi). The\"go to\" girl there is Elena, very energetic, and helpful and speaks good English. The rest of the staff was helpful also. Perhaps the most disconcerting, if not very irritating thing, for our room was that across the street was a building that had a mass of big TV like screens that cast a lot of light pollution into our room until around 2 AM if not later. The two sets of French doors kept out the noise satisfactorily but the curtains were inadequate for the excess light coming through. All the manager would have to do is intall a room darkening curtain and the problem would be solved.( I passed this advice on to the desk clerk so the manager cannot say he is not aware of the problem and a solution). When we were there the place was at capacity and I was told by a desk clerk that it often is especially in the spring. This place was comfortable enough,the residents all seemed to be a happy, congenial lot but is is a bit of a wierd place. I do not feel comfortable in giving the place more than an average recommendation since it seems to be more of a budget type hotel than a full service type of place. I would say that you need a youthful attitude and outlook to tolerate a stay here. We booked though priceline.com and paid 113 for the room.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great Stay”", "Author": "TheTraveler67", "ReviewID": "UR121222655", "Content": "This is a very nice hotel, I got a room with No View but a King sized bed that was very comfortable. Great Pillows!! The room was clean and well cared for. The free WIFI was great and worked at a good speed. The bathroom was good size but had limited counter space. Front desk staff were friendly, the building doorman was very helpful in finding things in the area. This a great area to stay, everything is in a 20 Minute or less walk from the hotel. The rooms are small, but that is common in Europe. The hotel is a good bargin and good place to Stay!!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect hotel”", "Author": "twanny1976", "ReviewID": "UR121197775", "Content": "We stayed at this hotel for 4 nights over a weekend. The room was spotless, big powerful shower, comfortable beds and the location is just perfect. You can walk everywhere. Our room (413) was on the Gran Via but you couldn't hear any noise because the double glazing is excellent. The only slight problem was the light from the screens across the street - even though there are thick black out curtains the light still comes through from around the edges. Will definitely stay here again and recommend.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Close to perfect for this price.”", "Author": "whjh", "ReviewID": "UR121049941", "Content": "Location, design, view, room size, bed comfort, bathroom (though a bit smelly), cleanliness, service, friendly and helpful staff, etc, etc. all above standard in particular for such a good room rate. Also my hotel again the next visit.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, Noord-Holland, Netherlands", "Title": "“Very nice hotel!”", "Author": "Yesmore", "ReviewID": "UR120958035", "Content": "Very nice designed hotel on perfect spot in the city. We had a great room with very large bathroom and nice view over the old city. They even have a roof terrace with a perfect view over the entire city! The beds were amazing, dont know the exact size, but i think 220cm by 220 cm... i almost lost my girlfriend one night :-) In short, don't doubt, just book, perfect hotel!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, Noord-Holland, Netherlands", "Title": "“Great hotel, great location”", "Author": "Joost R", "ReviewID": "UR120907731", "Content": "Stayed here for the weekend in nov 2011. The hotel just opened so everything was shiny and new! The hotel is located very near the city center with lots of shops nearby and a metro station right in front of the doorstep. The interior is nicely designed and practical. Good value for money. I would defenitely stay here again next time we visit Madrid.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "derby", "Title": "“Brilliant Hotel, Better then we imagined!”", "Author": "nav k", "ReviewID": "UR120716463", "Content": "We stayed here for my fiances birthday trip and it was amazing! the rooms were beautiful and clean, with brilliant views of montera and gran via..There were several prositutes outside but you never felt unsafe as there were lots of police around and a doorman always outside day or night. the staff were friendly and catered to all our needs, we had a problem with the hot water and someone came to check it within 15mins also had a little problem with the room safe and this was fixed promptly. The location of the hotel is brilliant, walking distance to everything, puerto del sol, gran via, plaza espana everything is within 15-20 minutes walking, The only little niggles were that an iron was not provided which meant we had to go buy a travel one and having stayed in several places before always had a provided iron and found it a bit odd that the sink was in the bedroom also the king size bed was huge but as it was two beds next to each other they always seperated during the night meaning one of us would have to get out of bed to push the bed back! none of these things majorly affected the stay though and if one thing was to be changed it would be the beds, alhtough they were very comfortable it was quite annoying having to push it back together or back, probably because of the wooden flooring! The room was cleaned well by the time we arrived back to our hotel every evening. Although you come to Madrid to see the sights etc and tend not to spend much time in the room, it was lovely to come back to such a lovely place. The corridors were quirky and everythign is well maintained and deocrated! I Would definetly come back again and my fiance is planning on having his stag weekend in Madrid and going back to praktik metropol. Fantastic place!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“A GREAT hotel in all aspects”", "Author": "Samdhya", "ReviewID": "UR120627203", "Content": "I stayed with my husband for my honeymoon in Madrid for a total of 10 nights. This hotel had me impressed from the get go. The location is the best, right in Gran Vía. The staff was very friendly, from the doorman to the cleaning lady. We got there really early (about 7:30 AM) and they didn't hesitate on giving us a room right away, even if check in was supposed to be at 3PM. When we got to the room we were very happy to find it had a an imppressive view of Gran Vía. Since we traveled around Europe and came back to Madrid, we had a different room the second time around. This time it was even better, since it was bigger and had a balcony with a view to Gran Vía/ Calle Montera. The rooms are extremely nice, clean and modern. The shower is great and spacious. The hotel is far from finished, so I can't wait to see it when it is. I just hope the prices don't skyrocket! There was free internet service in the rooms, and free usage of computers in the lobby. The whole ambience of the hotel was inviting to relax and have a good time. I really can't say there was anything bad with this hotel. I just hope to return to Madrid soon enough to stay in Praktik and repeat that great experience.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Exellent value for money”", "Author": "AndySBBristol", "ReviewID": "UR120251046", "Content": "I have just got back from Madrid and stayed at The Praktik and I could not fault it or the staff one bit! The room was a lot bigger than I thought it would be and it was very very clean, the staff were really friendly too. We did though have a problem one night where there was no hot water but with just one call to reception they got on it straight away and had hot water back on within 30 mins on a Sunday! If you are looking for a central location and value for money then I promise this hotel will be perfect for you. I will definitely be going back.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Excellent location”", "Author": "jellodoctor", "ReviewID": "UR120213749", "Content": "Great location. Walking distance to most sites. Metro stop is just steps away. Very modern decor and very clean. Nice 1 Euro breakfast. The hallways and room were very hot and it was difficult to sleep in the hot rooms. My one recommendation would be to get the cold fan working.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montréal, Canada", "Title": "“Great location, good value”", "Author": "Mona_y", "ReviewID": "UR120136059", "Content": "Room were pretty, they provided us with a free baby cot. The building is really pretty, the location is central. Small elevator. No noise. Bed comfy. The only \"problem\" was that we had a room facing the pedestrian street and there are two billboards in front of the room on that street. The lights were getting in, curtains were to thin. It was really bright in the room at night. Ask for a room facing Grand Via.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Lovely Rooms!! Rude female receptionist”", "Author": "Aashika A", "ReviewID": "UR120011772", "Content": "We stayed at possibly one of the best rooms of Praktik Metropol which had a lovely view of Gran Via with a balcony included. The rooms were white with lovely modern finishes and the furniture and side tables were extremely classy. The soundproofing was splendid and we slept very well despite facing a very commercial street. It is located very well- 2 steps from the metro station and few more from a host of shops and cafes. Also walkable is Sol. We did get a shock when we walked down C/Montera to reach Sol! The red light area completely caught us unaware!! The receptionist later told us that there was ample security and cops so we need not worry! There was a female receptionist who worked in the second half (and i didnt ask her name) who was extremely rude and snappy... and that didnt go down well with me. To conclude, we got great acco at a reasonable price bang on Gran Via.. and no real complaints in terms of comfort...", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Quirky but rather good”", "Author": "JohnandTricia", "ReviewID": "UR119450995", "Content": "Stayed here a couple of nights, it's right beside Gran Via metro station. First impression arriving late was a bit bleak as entrance is shared and with quite a few 'night workers' hanging around in the area, but once inside you find it is an old building revamped in a mixture of old/retro and modern. Takes a little getting used to but nice. The reception and lounge area is comfortable and communal, with coffee machine and free croisants and donuts in the morning. Also free internet access and some vending machines for snacks.Our room had a huge and very comfortable bed, very clean and nice bathroom with shower, overlooking Gran Via. Excellent location and reception staff very helpful. Really good value and you dont miss other facilities such as a bar because everybody is out and about in the city, and there are plenty bars and restaurants around you.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albufeira, Portugal", "Title": "“Excellent location and staff very helpful.....”", "Author": "Adriano N", "ReviewID": "UR119356736", "Content": "The hotel is very well located in front to the Gran Via Metro and 3 minutes walk from Puerta del Sol and thousands of shops .. Hotel very clean and staff very helpful, especially the guy who is always in the afternoon and night .. I recommend this hotel, and next time I come back to Madrid again will stay at this hotel ...", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Alicante, Spain", "Title": "“Clean, cheap, and really practical”", "Author": "Thomas G", "ReviewID": "UR119248042", "Content": "I stayed at the Praktik in mid-september. Arrived much too early for the normal check-in time, but the helpful girl in reception managed to find me a room in spite of being really busy: great plus. The room was neat as a pin, with a big, comfortable bed, and very quiet. The common area was really nice, and I found the free Internet very helpful, as the closest cyber cafes are a good 15 minutes away. On the other side, the view to the inside light shaft was appalling (although I really did not care, being on a business trip), and the cleaning ladies entered my room while I was having a shower. It is true that the street is full of ladies of the evening (and the morning, an the afternoon...), but you never felt annoyed (as a matter of fact, they always seem to have a witty answer when you decline to hire their services). The location is just perfect, right in the middle of Madrid. On the whole, for business trips, a very good alternative to 4 star hotels in the area, such as El Coloso, Santo Domingo or Arosa.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Newer hotel, good location”", "Author": "SunnyDebbie", "ReviewID": "UR119205414", "Content": "Stayed at the hotel one night in September. Madrid was having a heat wave, but the a/c in the room kept it nice and cool. Hotel is a very old building which has been completely refurbished. Rooms are small but bright and fresh. Comfortable beds. Very large bathroom. Free WIFI and safe. There is a large lounge on the 2nd floor, you can get 3 coffee and 1 pastry for 1 Euro - good deal for breakfast. Our room was basically soundproof to the outside, which is good considering it faced a busy square. Hotel staff were friendly and helpful.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Clean and modern, but smallest room ever!”", "Author": "Darron W", "ReviewID": "UR118966773", "Content": "Stayed for a long weekend in late September. The room has only been opened a few weeks so the workmen were still there and it is clearly not finished. That is fine and cannot be helped. The location is great, v. central, but the rooms are what lets it down... I stayed in room 221 and we had approx 1ft (30cm) space between the bed and the walls! It was a bit like a dolls house! The bathroom has clear glass doors and no privacy. OK for brushing your teeth, but not if you are doing a number two!!! We had to resport to tying a bedsheet across the door lol Then we move onto the room location, I wish I had taken a picture to show how bad it was... our view was of the light shaft inside the building and covered in bird droppings. As such we spent the weekend with the curtains drawn and it was v. claustraphobic. We asked for a room move, but they were unfortunately full booked. The free wi-fi was great and the communal areas were nice. Plus the price was v. reasonable for Madrid.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Gorgeous new hotel, great room for the price”", "Author": "GinaZ41", "ReviewID": "UR118902982", "Content": "We stayed 3 nights in September of 2011, shortly after the hotel opened. Checked in around 6 pm and got a fantastic room on the 4th floor with a balcony out over Gran Via. Loved it. Very clean, modern decor, great bed, lovely sheets, towels, rain-head shower, not huge but room to move, very quiet. Very happy with it. Odd things were the door to the bathroom room was clear glass - so if your partner was sitting on the toilet, you could definitely see it from the bed - had to do some communicating and make sure the other person was not looking in...; and room did not have a blanket, just sheets. Was Sept, still very warm, but my huspand likes the air-con on high, so I was cold. Could have asked for a blanket, just kept forgetting. They have a common room on the 1st floor with a coffee machine and while we were there, provided free croissants and donuts, nice touch. Location was great, front door was about 8 steps to Gran Via subway entrance, and only about a 10 minute walk to Puerta del Sol. Felt very safe there at night, lots of people out and about, but noticed that some of those people were prostitutes, which seemed odd as it's not especially seedy. Overall thought it was great value and would totally stay there again.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Tiny”", "Author": "ChristopheDublin", "ReviewID": "UR118744675", "Content": "The room was really small and barely clean. Hookers around but I don't care. A little too expensive for the quality. The hotel has a very nice location in the center of Madrid close to the cultural location and night life area. Everything is new in the hotel and rooms are well decorated with very good equipments.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“A good hotel and an incredible value”", "Author": "Jeff R", "ReviewID": "UR118670601", "Content": "This is a great new hotel that is an outstanding value. It could not be in a more central location. It has superb, design magazine décor. Also a great common area – the ground level lobby/reception area is very small, but the floor above has a huge, wonderfully furnished living room with great light and views. The guest rooms have high ceilings and great fixtures/furnishings. I have never slept in more comfortable beds. The in-room safes are big enough for laptops. Climate controls are responsive. Wifi throughout the hotel is strong and free of charge. My only complaint has been mentioned by others; the bathrooms have clear glass doors. In our room, at least, the toilet was right in front of those doors. So when you sit on the can, you are in full view of anyone in the main room. This is just bizarre, and they need to do something about it. (And yes, as others have mentioned, the pedestrian street right in front of this hotel is sex worker central. It’s not a seedy area by any means; it just has a lot of pedestrian traffic, so this is where they ply their trade. They are forward – at least if you are a man between 15 and 80 – but not unpleasant. This didn’t bother me in the least, but it seems in the spirit of TripAdvisor to mention this to people who may feel differently.) I hope to stay in this hotel on future visits to Madrid.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Cheap, clean but in the prostitute street!”", "Author": "rochelle030", "ReviewID": "UR118426722", "Content": "This is a very cheap hotel and does the job for a few nights stay to see the sights of Madrid. However you get what you pay for. The rooms are clearly new (still smelt of paint/polish) but are tiny. We had around a 2m x 3m area between the bed and the bathroom. Also the bathroom doors are see through! In areas the hotel seemed unfinished as we noticed printed out pieces of paper blu-tacked on the walls to direct you to the room numbers. The upper two floors are hostel rooms. We also got woken up early every day by the cleaners shouting down the corridor. Don't expect a lie in! There is a lovely communal area which has boxes of pastries to help yourself to in the morning and coffee and vending machines and free use of two internet stations which is handy for travelers. However the main thing to note is that the hotel is located on the main prostitute street of Madrid. The corner of the hotel backs onto the Gran Via so it's always a very lively area but there are constant prostitutes hanging around right outside and down the street. For the price we paid however, it was fine but would look for an alternative next time.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Basic, but they get their basics right”", "Author": "PleunBhoy", "ReviewID": "UR118337398", "Content": "Basic hotel on great location in the heart of the city. The very claen rooms have a great bed, some storage room and a great shower.That's about all there is in a room but do you need anything else? We particularly liked the location. Close to the touristy Plaza Mayor and Puerto del Sol but also not to far from bohemian Malasana. Allthough the hotel is on a very busy street, there's is no noise to be heard from outside. The only drawback is the lack of good sunblinds....", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Clean and fresh new hotel”", "Author": "Luv2TravelBookWorm", "ReviewID": "UR118117124", "Content": "Bright and airy rooms. Rain shower head. Great location. Subway entrance right outside the main door, and there is a nice shopping district to the north. At first I was concerned that the hotel would be noisy since it is right on the busy Gran Via, but the double glazed windows arrested the street sounds nicely. You can tell that they are still working out the bugs of running a hotel, but the benefit is that everything is clean and fresh, from the bathroom grout to the paint on the walls. One minor inconvenience is that there is no fridge in the hotel... for medications or for food and wine. We stayed on the fourth floor and enjoyed a balcony view of Gran Via. Side note: my new happy place is the Parque del Retiro. Do as the locals do, and spread a blanket out by the monument overlooking the rowboats on the lake. Fantastic place to journal, read, or just enjoy the setting sun. Can't wait to go back. Happy travels.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sax Spain", "Title": "“Great Location”", "Author": "Johnsaxspain", "ReviewID": "UR117824081", "Content": "This hotel was ideal for my wife and I. It is in the Centre of Madrid and we walked everywhere, it is clean and modern and the beds are really comfortable. We didnt have breakfast at the hotel as there is so many cafe,s so close and we enjoyed trying different places daily. There are no swimming pools, suana, gym etc if thats what you are looking for this is not the place, but for a stay in Madrid for sightseeing or business i would recomend this hotel to anyone.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“What a find - Superb hotel!”", "Author": "smileme2you", "ReviewID": "UR116620542", "Content": "This is a newly openned gem of a hotel - a true joy of a find! My husband and I stayed here for the first four nights of its new existance and loved it! Its position, less than one minutes walk from the Grand Via metro is the first of many things to recommend this hotel. Our Room (401) was large and beautifully decorated in white wood panelling - ideal for those hot summer days! The bed was massive and very comfortable, the airconditionin-marvellous and the shower, out of this world! Our room also had a balcony overlooking Gran Via and the pedestrian area beside it. Ideal for people watching on those warm evenings! The room had two huge french windows which when closed provided excellent sound proofing if you need quiet for a good night's sleep. It is 5 mins walk to Puerto de Sol and easy distances from everywhere else in Madrid. The tourist bus stops just across the road. There are lots of eating places right outside the hotel's front door. The very best feature of this hotel however is its EXCELLENT staff - friendly, energetic, enthusiastic and helpful! A wonderful find and rightly deserves to be much higher up the list in Madrid. I have every confidence with a number of months running under its belt it will rise meterorically - it really is that good!", "Date": "August 12, 2011"}], "HotelInfo": {"Name": "Praktik Metropol", "HotelURL": "/ShowUserReviews-g187514-d530931-Reviews-Praktik_Metropol-Madrid.html", "Price": "$78 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Montera 47 (esq. Gran Via)</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "530931", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/56/d4/0d/superior-room-2.jpg"}}