{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“Great location and excellent service”", "Author": "sammy_ali_10", "ReviewID": "UR128182740", "Content": "We arrived at Conte House after 9pm and were greeted by a smiling Fabio and his friend. He was great- he showed us the sights to see on a map and what we could do each day- we followed his guidance and managed to see everything we wanted and spare time to see extra things. It was really useful and really made are stay. The hotel itself is basic but has all the facilities tv, hairdryer, towels. Breakfast was basic but good- toast, cheese, tomato, croissants etc. The location was just great for the price. One tube stop and you're at Termini and only a few stops to Spanish Steps & Trevi Fountain. Even the Vatican the other side of the city was easy to get to. The best bit the colosseum is 5 minutes walk away. All in all I would recommend Conte House to anyone staying in Rome, the service and location were just perfect!", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greifswald, Germany", "Title": "“A wonderful stay!”", "Author": "KristinH23", "ReviewID": "UR125835640", "Content": "We stayed at the Conte House for four nights, and we couldn't have picked a better location and hotel for the price! The owner, Fabio, welcomed us and immediately gave us tipps of what we should definitely do and what we could pass out on based on our likes and dislikes. He also told us where we could get good food for little money, which was great. He is very helpful and always has an answer for you. The room was good, big enough and if you close the windows properly there is no noise from the street. The bath was small but had everything you need, Breakfast was fine, and we never had to leave the hostel hungry. The colosseum is only about 10 minutes by foot, and other main attractions are also within walking distance. Overall, it was a wonderful stay and we will definitely come back to this place!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Siena, Italy", "Title": "“Great! I can totally recommend this place”", "Author": "wolinek", "ReviewID": "UR120926548", "Content": "I was staying there for 3 nights. The rooms are clean, the towels are there for free, even shampoo and soap. Breakfast is very nice, I wasn't hungry right after eating like usually in low priced hostels. The location is very good, I even walked to Termini with my luggage. Close to the Colosseum and the metro stations. Great value for money!", "Date": "November 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ennis, Ireland", "Title": "“\"Cheap and Cheerful\"”", "Author": "Sunnysidewishes", "ReviewID": "UR118034695", "Content": "Myself, my husband and our two children stayed for two nights at the beginning of July 2011. Fantastic location, only 10 minutes walk from the Colosseum and great value for money. Fabio was very accomodating to the fact that we were arriving at 21:00 due to our flight times, he was very polite and helpful, giving us much valuable information.The room had air condtioning, a balcony and an en suite shower and toilet. It was basic, but clean and comfortable and suited our needs as a base whilst visiting the sights. The breakfast is simple, but you can help yourself to as much as you want. Packaged pastries, cheese, bread, jams, coffee and juice which you eat in your room. This suited us, as it meant we could have our showers etc in order of who finished first, getting us up and out as quickly as possible. I would recommend this hotel for anyone who wants cheap and cheerful in a great location.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“A great stay!!!”", "Author": "christinecrawford", "ReviewID": "UR116944520", "Content": "We loved Conte House!! We stayed for 5 days there and it we absolutely loved it! The owner, Fabio was really nice and helpful! He told us where to go in Rome and the best places to visit.. many great tips! Our room was quiet and we slept really well there. The air conditioning was working well, compared to other places we stayed at! We were about 10 mins walk from the colosseum, which was great! Breakfast was also very good compared to other B&B we stayed at.. We didn't want to leave at the end!! Thank you Fabio for this great experience!!! Christine :)", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Peru", "Title": "“Awesome place with Great Staff and Rooms (Do not listen to Bad Reviews!)”", "Author": "vttraveller93", "ReviewID": "UR115053045", "Content": "The Conte House is an amazing place to stay! They have a new owner named Fabio who is absolutely the friendliest and most accomodating owner we have encountered on our trip backpacking through Europe. The first night he ran us through a map of Rome and showed us all the best places to go and tips on travelling through the city. The building is very centrally located, only 1 metro stop away from the main train station and 2 to 3 stops away from every large Rome monument and tourist attraction. The building is also is on a nice street with lots of supermarkets, bars, and restaurants. The rooms are equipped with balconies and air conditioning, as well as very nice bathrooms. They have breakfast avalible every morning, and they have a mini bar, fridge, computer, and free wifi all avalible for guests to use free of charge. Fabio even gave us his cell phone numbers, and offered to even pick us up at any time of the night. He is super funny and made us feel right at home the minute we stepped through the Conte House door. I more than reccomend staying at this hotel, it is absolutely amazing!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great place to stay! Super friendly staff and nice clean rooms.”", "Author": "JulieEhrmantraut", "ReviewID": "UR114713690", "Content": "A great location about 10 mins walking distance to the Colosseum. The owner, Fabio, treated us like friends and was extremely helpful and welcoming! He gave us some great tips on where to buy things cheaper than in the typical tourist locations, including a supermarket just down the street that has everything you need including alcohol. This was our best hotel experience out of the 5 different hotels we stayed at during our trip throughout Italy. Good breakfast including meat and cheese, coffee, orange juice, etc. There were also some good little restaurants very close by that had decent food at good prices. I would definitely recommend this hotel and will be back soon (I hope)!", "Date": "June 24, 2011"}], "HotelInfo": {"Name": "Conte House I", "HotelURL": "/ShowUserReviews-g187791-d531031-Reviews-Conte_House_I-Rome_Lazio.html", "Price": "$112 - $145*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">191 Via Merulana</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185 </span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "531031", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3f/ec/3fec794b76bcb6dd0905c8a6936167261large.jpg"}}