{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Fine”", "Author": "Zoopzapzipo", "ReviewID": "UR127404514", "Content": "I stayed here in April 2012. The room was nice, but a little dark, so you had to open the curtains/windows the whole time. The bathroom was clean, however we did have a few problems with the shower, and the toilet seat. The towels were fine and clean. The bed sheets were not very nice, they were heavy, and seemed over used and old. The breakfast was not outstanding, but acceptable. There was bread, toast, croissants, yogurts and fruit, and a coffee/hot chocolate machine which was nice. I liked how in the lobby there was comfy sofas, which you could sit on and use the free wifi. The hotel was very near the train station The room was not noisy on the 2nd floor, there was a bit of street noise though, but not bother able.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Ok”", "Author": "bagin1981", "ReviewID": "UR125185729", "Content": "I was in November of 2011 at this hotel. General impression - positive. The rooms are clean, clean every day, but faded white towels. Shampoo, soap, disposable shower caps are changing every day. Note that if you turn off the overhead light, then stop working outlet (charging mobilephone, camera). It is desirable to have an adapter for the outlet. Breakfast is monotonous, but fresh: croissants, bread rolls, kiwi fruit, tangerines, cereal,2-3 kinds of sausages and cheese, tea and coffee. Convenient location - the main advantage of the hotel.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“birthday break”", "Author": "bernard h", "ReviewID": "UR125122288", "Content": "Very clean with helpful staff. The location could not be improved the main drawback for my personal wants was the lack of a bar in the hotel,although there are bars near by. Breakfast was typical continental but plentiful.Very easy access to all forms of transport. We would gladly return to this hotel.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "East midlands", "Title": "“Central location”", "Author": "Mo1Eastmidlands", "ReviewID": "UR124511050", "Content": "We stayed here for a long weekend, the price was reasonable. The location is central and a few minutes from Termini train Station. We had a hire car and there was ample parking outside however there was a charge on the street meter during the day. The staff acknowledged you but that's about it. Wouldn't say they were great. The hotel is clean, the rooms on the small side and the decor a little dated in design, they are comfortable. Breakfast was not great was continental, lots of cold meats, good if you like that. We said we would stay here again but that would depend on the price.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Stay here due to my package with Contiki”", "Author": "Ee Von L", "ReviewID": "UR122501777", "Content": "This is a sister hotel of Noto Rome, so i don't have a high expectation. The rooms are way smaller than Noto. Very dusty... My feet became black after walking around the room. I need a vacuum for my vacuum bag and this is the first hotel which doesn't have a vacuum. That explains the dusty rooms. The bathroom is a bit weird as they don't have any curtain at the bath tub. When you are taking a shower, u have to sit or kneel down. If not, the water will splatter everywhere.....", "Date": "January 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“Visited on the 9th of December 2011”", "Author": "Victorious123", "ReviewID": "UR121617940", "Content": "Pros: -Hotel is near the Termini. -Lots of important things which you should see are near the hotel. -They have WI-FI but the range is lobby limited. -The staff is nice,friendly and helpful,though, they don't speak English very well. -The bathroom is most likely clean. -They have a mini-bar and TV, with Italian synchronized channels. -Quit area. Cons: -Rooms are small. -Towels smell. -The whole hotel is some kind of a labyrinth. You can get lost easily on any floor. -Above the entrance door of the room there's some hole with wires and stuff, the hole is dirty, I, myself, found it scary. -Food is eatable, but not enough for a \"4 star Hotel\". Poor choice of food. -Through the window you could see only a wall! There was no sunshine until 11 AM. -Very old blankets. *It was pretty hot in the room. Overall: It's not bad, but not enough for a 4 star hotel in the middle of Rome.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Good enough”", "Author": "Mila S", "ReviewID": "UR120953759", "Content": "Hotel has the best location, near subway Termini, easy to get to any place in Rome. Our room was tiny but clean with all necessary stuff. Tha bathroom (important place for me :D) also was good. The only one bad thing is breakfast, the same food during the week, terrible coffe. Btw, no iron in the hotel ))", "Date": "November 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Very Bad Hotel”", "Author": "tonderk", "ReviewID": "UR120455395", "Content": "Very bad hotel !!! Where shall I start...Towels were smelling really bad, bathroom is really tiny and unclean, be prepare to hear every kind of noise ---the elevator's noise, people's conversation next to your room--- couldn't open the window because, if you can, you can smell people's smoke (there was a place assigned for hotel's guests to smoke, my room was just on top of that place !!!) Not even 2 stars.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“You really can't tell a book by its cover.”", "Author": "Calgary68", "ReviewID": "UR118584186", "Content": "Nice lobby, which is what attracted us to the hotel on a walk-in. We were just in Rome as a stopover this time, so it wasn't the end of the world. It is well located near the Termini (central rail station) which attracted us to it. But it could stand a good cleaning - everywhere. And the breakfast is pretty bad.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Just Right”", "Author": "mrsperkins657", "ReviewID": "UR117449893", "Content": "OVER ALL WE WERE VERY IMPRESSED WITH THE HOTEL AND THE SURROUNDINGS! IF YOU ARE GOING TO SEE THE SIGHTS OF ROME THIS IS THE PERFECT HOTEL!!! we went here for our honeymoon for 3 nights in august. we had originally booked to stay in the arcadia hotel but due to horrible reviews i changed to archimede at the last minute and i am so glad we did! it was a very peaceful hotel and we did not have disturbed sleep considering it was right in the centre. people had said the rooms were small but they were medium sized not small at all, a large double bed, built in wardrobe and chest of drawers with a bathroom with shower, bath, sink, toilet and bidet, also included in the room was air conditioning(not extra charge), and sky tv (not that you should need it) we used it for music whilst we were getting ready to go out. the maids cleaned every morning and we has fresh towels and bedding everyday. breakfast was very simple and very continental my husband was not impressed but i didn't mind it, croissants, limited cereal, a couple of juices and ham and cheese with rolls. so if you are expecting a full English you will be disappointed. it is a matter of taste. the hotel is a 2 minute walk from termini station which is the main train station in rome so it takes you everywhere! from the station you get coaches, buses, underground and trains. when we arrived at the airport the coach to termini was straight outside the door at bus line 1 and then i saw the hotel as we pulled up at the station so no danger of getting lost! the airport was no longer than 40 minutes from the station and it cost us 8euros each return ticket. there are lots of restaurants and bars around the hotel and the station. on our first night we decided to go for a walk and after 20-30 minutes of walking in a straight line from the station we were at the Colosseum!!! it also took us no longer than 1 hour to get to all the main sights on the 3rd day we decided to go to the Vatican and used the underground which was 1euro per person to go wherever you wanted there was also a choice of an all day ticket for 4euros per person to get on and off as many times as you liked. once on the underground it was 6 stops to the Vatican and we noticed that it was 1 stop to the trevi fountain and all other attractions were a couple of stops on the underground so if you don't fancy walking lots it was easy to get from the hotel to all the sights. the locals were friendly enough if you tired to speak Italian a little they would then help you. there was a \"spar\" shop just by the station to get all sorts of food bits for days out and it didn't seem to be much more expensive than home. we went for dinner every night and there were so many restaurants to choose from we spent no more than 40 euros on dinner each night. we found a few little pizza shops for lunch they are all around or we took a picnic from the spar shop. we found a great little snack bar which served a jug of beer or other drinks and when it came out with it came a cheese pizza, mini sandwiches and crisps this was all for 10 euros and filled us right up till dinner time and we had only stopped for a drink. there was lots of beggers and homeless they could be very intimidating but we were told to keep distance and ignore them at all times. there were a lot of police around so you felt safe. once a man was looking to try and get in to our bag and followed us down the road but after a few feet there were three police cars and he backed off. one thing i would say about the hotel is CHECK whether they are going to charge you roma tax upon check out some people did and some people didn't we were not told anything about it by the hotel or the travel provider until we checked out and had a bill for 24euros (3 euros per person per day) i hope this review helps you :-) mr and mrs perkins x", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Staff”", "Author": "SanDieganTraveler201", "ReviewID": "UR116735284", "Content": "I had a great experience with a helpful staff at the Archimede. I had a big switch up with my tour group and was totally stranded in Rome. Svetlana helped me tremendously. She was calling my group and the other hotel and trying to figure out where I was supposed to be, speaking to people who couldnt understand me because of my english, and ended up providing me with a room at this hotel in the end. She made a very stressful night a lot easier for me. The hotel was well accommodated and perfectly comfortable. Definitely not a 5 star but perfect if youre just stopping by for a night and continuing travel. Very beautiful.", "Date": "August 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Great for a long weekend”", "Author": "jonta7rug", "ReviewID": "UR115409796", "Content": "This hotel is perfect for a long weekend in room. It's clean, in a good location and its cheap. Do not expect a good breakfast and don't expect to much interaction from the staff. It's half hour walk from piaza navona, you right next to the terminus for the tube. I was a bit worried going there after some reviews, but I would stay there again for a long weekend definitely", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Never again”", "Author": "WWF123", "ReviewID": "UR114801083", "Content": "We stayed for 3 nights. 1 night we got room No.3 in the ground floor, the room smelled like drainage and there was no air. As we opened the window we found out that we can not open the blinds. They had a chain and padlock on, so it was always dark. The view was on a small space where the stuff leaves garbage and other bags. The bathroom has no shower curtain. The towels look and smelled like they were not washed for ages. We immediately asked the stuff for another room, wich we got the next night. The second room was on the 3 floor and it was ok, we could open the window and have fresh air. The breakfast was very poor. The only good thing is the location because it is near the Termini station. p.s. when checking out you must pay 3 euros for each person for a night and they accept only cash.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Osijek, Croatia", "Title": "“Good hotel”", "Author": "Vokhee", "ReviewID": "UR114761278", "Content": "Hotel is located 5 minutes from the main train/bus/metro station called Termini. You have to understand that Italian star classification is a little bit different, so if some hotel has 4 stars that is really 3 star hotel. 3 star hotel is really 2 star hotel and so on. Staff is very helpful and kind, they will provide any information needed. Rooms are small, but clean. Nice bathroom with hairdryer, TV, safe, minibar (beverage charged extra), air condition. Linen is changed and cleaned daily. Breakfast is good enough to hold until lunch.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Graz, Austria", "Title": "“an Italian-standard hotel”", "Author": "loveDubai2010", "ReviewID": "UR112681125", "Content": "I dont know what everyone is complaining about. This hotel is an ITALIAN STANDARD hotel, not the Ritz! The rooms were comfy and clean, the bathroom was cramped but you dont live in the bathroom! The breakfast was ok, though the coffee was mega disgusting for Italy. The staff were Italian and that is the standard Italian friendliness you are going to get. Got about the same friendliness from them in Rome, so why should it be different at the hotel? The guests staying there were loud, that was the major problem. The A/C was loud as well and sounding like it was going to take off. The location was perfect for walking around and discovering Rome. All in all not a bad hotel, and people who complain are just spoiled brats who think they booked a room at the Ritz! Get a reality check!", "Date": "June 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Washington, D.C.", "Title": "“Hotel Archimede”", "Author": "IAD_ORD", "ReviewID": "UR110388861", "Content": "We did not feel safe at this hotel. It is located in an undesirable part of town, and we had ground floor rooms. We had to turn our key in at the desk, the safes wouldn't lock, and the door wouldn't some times. Breakfast wasn't very good - walked to Termini 2/3 days. Staff were okay, but nothing special. The beds were uncomfortable and the rooms were tiny. No room for anything. The bathroom was literally unnavigable, but at least unlike others in our group, we had a shower curtain. The hotel smelled funny, and the lobby was unfortunately the nicest part. The TV had the best selection of English channels my whole trip, but was around only 20\".", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ingleton, United Kingdom", "Title": "“Perfect Location”", "Author": "Babsdranny", "ReviewID": "UR101705493", "Content": "We stayed in Rome as part of a Riviera Holiday City break (Daily Mail) and it was really well organised. Our room in the hotel was fairly small but then we only needed to sleep in it. It was adequate for what we needed and although we were on the ground floor it was very quiet. It's location near the Termini meant we could get anywhere in Rome by Bus or Undeground (Metro) very quickly particularly useful at night when we chose to go to some of the Piazza's and the Colosseum to see them all illuminated. A lovely family restauraunt across the road. Just Ideal ~ we loved it.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“the most terrible experience of my life!”", "Author": "eva189473", "ReviewID": "UR99933120", "Content": "Honestly talking i've never been in such an awful hotel in my life!!i really wonder how this can be a 4 star hotel??the rooms were so tiny that you hardly manage to fit in there,everything was dirty and full of dust like they had'nt clean in there for ages!!and to make matters worse it was freezing cold!!you could'nt sleep in there because of the cold!food was disgusting too!!i strongly recomend you never stay in this hotel if you go to Rome!", "Date": "March 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottinghamshire", "Title": "“You get what you paid for.”", "Author": "hamgj123", "ReviewID": "UR96432941", "Content": "This hotel is alright and worth the money. It isn't wonderful but it's not poor either. I went on a school trip and my room was good. I shared with three other people and it was a bit crampt with all of the suitcases. The bathroom was a good size but the shower leaked badly. Everything got soaked so I suggest that you don't put anything valuable in there. The breakfast, in my opinion, was nice. There was a variety of hot and cold drinks available. They served croissants and fresh rolls with a selection of meats and cheeses. Many reviews said that this hotel was horrible but I thought it was satifactory. It's close to a train staiton and many small restaurants/cafes.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“who rated this hotel as a 4 star???”", "Author": "stavrus", "ReviewID": "UR91509946", "Content": "unacceptable services, very old building, extremely noisy, smile less, unwilling and unprofessional personnel.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rome, Italy", "Title": "“Give this hotel a wide berth”", "Author": "lottieo88", "ReviewID": "UR83455271", "Content": "Rooms were cramped, the towels 'grey' and thin. Dangerous in the bathroom no bathmat or shower curtain. Poor breakfast, rolls from the freezer ?, poor selection of cheeses and meats (processed). Coffee from a machine, lukewarm. Could be noisy at night when late guests arrived. Saving grace near the Termini. Mollie & Barbara", "Date": "October 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Swindon", "Title": "“pretty nice overall”", "Author": "BJohnsonSwindon", "ReviewID": "UR78938962", "Content": "Although my room was tight on space, (other rooms are bigger), the decor was pleasant, it was very clean and serviced efficiently. This is mostly a package hotel with the facilities one would expect including normal, adequate Italian (generous) breakfast buffet, don't expect Engish, remember - 'when in Rome!', air con and fridge. The staff had 'normal' Italian manners - sometimes charming, sometimes cursory but efficient and helpful when necessary. No bar or restaurant but there are plenty nearby. The situation near to the Termini is great for transport but within 20 minutes walk of the main city tourist areas, and with some surprisingly good (and value for money) places to eat in the neighboring streets. Overall it is fit for purpose - you don't go to Rome to spent much time in the hotel surely?", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sevenoaks, United Kingdom", "Title": "“Not a thing wrong with this hotel...very pleasant in fact!”", "Author": "joleblonde", "ReviewID": "UR78840643", "Content": "We are bringing a larger group out to this hotel later this year and we had to visit to conduct a recce. I must admit that I was aprehensive reading some of the reviews on this site and my expectations were therefore quite low. I am delighted to say, therefore, that I was very pleasantly surprised with just about every aspect of the hotel. The staff were polite and courteous, being more more than willing to show us a couple of the rooms where we will be staying with the group. Although not huge, the rooms were spotless and very nicely furnished with marble and polished wood throughout. There was a safe which worked well, and the TV had sky, not that we spent any time watching it though! Saying all that, the bathroom did not, in fact, have shower curtains, but as each bath had a flexible hose attached to the shower head, it was easy to sit down while showering...a little weird, but not really that big a deal. I am not a fan of continental breakfasts at the best of times and I have to say that as far as continental breakfasts go, this one was pretty basic, but it did the job. The locatoin was dead on too. With Termini at the bottom of the street the whole of Rome is easy to get to although we tended to walk everywhere anyway as Rome is such a nice city to walk in (apart from the traffic, that is!) I suggest you don't pay too much attention to all the negative reviews here...take them on board, certainly, but prepare yourself to be pleasantly surprised!", "Date": "September 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Least recommendations to stay”", "Author": "Globe_Trotter1809", "ReviewID": "UR72528766", "Content": "The hotel looks good from outside but the MALE staff are very rude and not friendly , female staff is better and approachable . Rooms are TOO SMALL - double bed deluxe. Breakfast is cold and hardly any variety or choice. But definitely the hotel is stones throw away from Rome Termini which is good but there are lot of other decent hotels around termini station which can be opted for. Also i donot recommend this hotel for travellers from Middle East and Asia as the air conditioning is not upto the standard and staff doesnt bother to help or apologize. we had a tough time staying for 4 days in hot summer. Overall , would never recommend decent family crowd to stay there unless one has very strict budget and service doesnt matter.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great Location and Breakfast!!”", "Author": "RAR19", "ReviewID": "UR68279508", "Content": "2minute walk to Termini which is the best place to be to travel around Rome to see everything! Rooms are brilliantly spacious, clean and quiet.. it's located down a sidestreet off a bustling road so you can get a good nights sleep! Breakfast is a cold buffet.. and you could stay there for ages eating if you didn't have a big schedule for the day! We walked around Rome.. and it took us perhaps 30mins to get to the Trevi Fountain and then 15minutes from there to get to the Collesoeum! 5minutes to Republica too.. Staff are friendly enough and helpful.. though if you have everything planned.. you won't really need them!", "Date": "June 22, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "south of 65N", "Title": "“A Great Disapointment”", "Author": "gbcpj", "ReviewID": "UR64452457", "Content": "This hotel is rated as a 4* by any objective standard it should be 1 or 2 star. Lets start with the good point: Breakfast -plentiful if lacking any flair, all heavilly procest with the only fresh or seasonal a few apples. Rooms: dirty and in need of redecoration many fitting hanging of the walls, TV not working Aircon very noisey and ineffective. Room very small even by city centre standards.", "Date": "May 18, 2010"}, {"Ratings": {"Overall": "1.0", "Rooms": "2", "Service": "1"}, "AuthorLocation": "UK", "Title": "“Rude and unhelpful staff”", "Author": "Eathelred", "ReviewID": "UR59861573", "Content": "Helped a friend check-in. Staff made clear that they thought we wanted to share a single room - but quoted an absurd price to upgrade to a double room. They were so rude and unhelpful that we stayed in my hotel instead - much more comfortably and cheaply. Needless to say, we got no refund.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kuopio, Finland", "Title": "“Positivly surprised, that the hotel was so good(location and breckfast)”", "Author": "teacher011", "ReviewID": "UR58025970", "Content": "The location was super, the lobby made a very good impression. The prise was at that time cheep. We liked the hotel very much.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Derbyshire", "Title": "“A nice hotel with nothing to complain about!”", "Author": "peilio", "ReviewID": "UR50403890", "Content": "I stayed in this hotel with a coach group and found the staff there very kind, courteous and co-operative. The breakfast is buffet style with a great choice and refilled well, the breakfast staff are very efficient at keeping everything stocked and never had to ask for anything. I found no problems with the cleanliness of the hotel, I would say that it was very clean and tidy. There was a safe in the room and it was air-conditioned The location of the hotel is near to the train station making it easy to get around the city or even travel to another one! In conclusion I would say that this a good hotel, That I woudl recommend to others and revisit myself.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Derbyshire", "Title": "“Not really a 4 star”", "Author": "RACHJC", "ReviewID": "UR50325566", "Content": "The hotel is not really my idea of a 4* hotel, although the room that we stayed in was small but comfortable and clean. The TV didn't work (apparently not for some time) and the bathroom was frequently flooded by the shower as there was no show curtain. There is no bar or any dining facility - surely a 4* hotel should have that. The breakfasts were OK if a bit chaotic. It is conveniently situated for sightseeing as buses and the metro are close. The actual room rate was 320 euros!! Half that would be too much.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "IRELAND", "Title": "“Bad Customer Service!”", "Author": "kitekat", "ReviewID": "UR46033849", "Content": "I booked this hotel through the booking agent Bookin Hotels and paid for the hotel in full. Two days before I was due to go to Rome I got an email from the agent saying they had problems with their agent and had to cancel our booking. I then rebooked the hotel with Alpharooms and paid for the room again! When I arrived at the hotel they said they had no record of our booking. They were so unhelpful. They said it was between us and Alpharooms. I gave them Alpha rooms number and asked them if they would ring them or at the very least put a call through for us but they refused! We stayed in the hotel for one night for which we had to pay for the room again (this was the third time). We moved to another hotel the next day as we were so annoyed by thier lack of helpfulness!", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chehire", "Title": "“Beware, thieves operate in this hotel”", "Author": "SharkyChehire", "ReviewID": "UR42152928", "Content": "Cash, credit card, mobile phone and even house and car keys stolen from our room. A camera was stolen from another room on the same night. The doors were not tampered with, so make your own assumptions.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Whitley Bay", "Title": "“Very nice Hotel”", "Author": "WhitleyBayApothecary", "ReviewID": "UR31267358", "Content": "Don't let previous reviews put you off. We found it clean, the staff were polite and helpful and the breakfast was adequate.Situated conveniently close to Termini station (for Metro) and many small restaurants nearby.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Not Sure”", "Author": "GerryMotherwell", "ReviewID": "UR28510008", "Content": "We had stayed in the Archimede two years ago and this time we were disappointed that it was in need of a freshen-up in terms of decoration. Was it becoming dirty and grubby.?While we were there decorators were working in the hotel and hopefully it was being re-done. Would like to hear from recent visitors. Great restaurant Piccola Spazio just below the hotel : genuine family run with great food and very reasonabley priced.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Dublin", "Title": "“Pretty average, but better thaan expected”", "Author": "Astja", "ReviewID": "UR24756946", "Content": "Not a bad hotel, located in a rather quiet street, away from train station hustle. Our room was a bit small for our liking, but then again in Rome they tend to be. Hoped for a more frequent change of bed linen - twice in five days. Air conditioner was out of order and in 35°C it is almost a death sentence. All the main attractions are a good walk away but underground is nearby.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Dublin", "Title": "“Blood on the sheets and matress”", "Author": "AndyraDublin", "ReviewID": "UR24756505", "Content": "Very good location near central station. The room was small and very dirty. The matress protector had large blood stains that could be seen through the sheet. This was shown to the managers and on day two the bed was made again with the blood sheets still on the bed. We had to get sheets from night porter when we arrived back from a night out and change the sheets ourselves. No apology from manager - he didn't seem to think it was disgusting. Pillows smelled of smoke and sewage smell in corridors. We do not normally moan but the room in this hotel was very dirty. We would never stay here again. But we will go back to Rome - great city. Go to the Sagrestia Restaurant at the Pantheon.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NJ", "Title": "“Good hotel and location”", "Author": "mctalian", "ReviewID": "UR17813655", "Content": "This is a good hotel, clean and centrally located with easy access to the trains or subways. For those of you NOT used to Italian hotels; they're ALL very small. These are centuries-old buildings turned into hotels, hence; the tiny elevators, small rooms, compact bathrooms (no shower curtains to avoid mildew issues, )etc.. So, when in Rome on a budget, do as the Romans do; take life as it comes; be positive and open-minded! [Don't go expecting US standard lodgings!] The breakfast buffet was simple but good, with a coffee machine that offered a few Italian coffee varieties. Warm milk offered on the side made for a great caffe latte! And the nutella packets were a hit with the kids to have with the croissant pastries. Overall, I'd say this hotel & service was good and the hotel personnel were polite and helpful. If you're looking for a luxury stay, expect to pay a lot more in Rome!", "Date": "July 12, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“4 stars?”", "Author": "Evrim78", "ReviewID": "UR12755628", "Content": "Personally I did not find the hotel 4 star quality. It was clean, the room was not smaller than expected and I can not say that the service was bad really however no little luxuries at all. The breakfast was extremely simple, accompanied with horrible coffee. Given that bit of info, I did not find the room service or the restaurants promising. There were no good restaurants and shops around so had to look at a guide/map in order to spot a good dinner. The hotel is just behind the Termini station, which makes life easy if you are planning to rent a car or take a train to somewhere close. It is easy and cheap-ish to take a cab to the central attractions however I don't think it is walking distance.", "Date": "January 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "ohio", "Title": "“don't waste your money”", "Author": "cphs50", "ReviewID": "UR10417480", "Content": "The only good thing about the hotel was it's location. Stayed three nights and had two different rooms. They both had mold in them and the first you couldn't even get your suitcase in. It had a corner shower with lots of mold and the towels were even rotted. The second one was better but for $217.00 a night you can do better. This is the worse hotel I have ever stayed in in Europe.", "Date": "October 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“excellent base hotel for Rome”", "Author": "carrieswood1", "ReviewID": "UR8382302", "Content": "This hotel was in an excellent position for sightseeing. It was only a couple of minutes walk from Termini from which it is easy to get to any of the major attractions in Rome. The rooms were quite small, but 3 of us shared a room and it was adequate (with all there is to see who spends much time in the room anyway!). The bathroom was a bit of a problem, with no shower curtain but it was easily remedied by pointing the spray towards the back of the bath. Breakfast was fine- a little boring but filling and the coffee was nice. The staff were very helpful and pleasant. All in all a very nice stay.", "Date": "August 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "HoosierPenguin", "Title": "“Location and Comfort In One Package”", "Author": "HoosierPenguin", "ReviewID": "UR7845185", "Content": "After pointing our travel agent to this hotel based on other TripAdvisor reviews, I have to say we weren't disappointed with this hotel at all. The location, two short blocks from the Roma Termini station, makes it very convenient to hop the Metro or bus to visit any location in the city. The rooms were on the smallish side, but our family of four were not interested in anything but a place to sleep and get cleaned up. The main bed were twins stuck together, with two cots on the outer edges of the room for our kids. All of the mattresses were firm, and comfortable. The air conditioning worked well, and our room had a window that could easily open and let fresh air in. Americans who don't travel to Europe much might be thrown off by the lack of shower curtain in the bathroom, or the fact that there doesn't seem to be washcloths in Italy. But we don't blame the hotel; this is a cultural thing. The breakfast was typically Italian continental and decent. The staff was helpful, but sometimes a little too busy to answer questions in detail. Bonus features: there's a laundromat (not self-service) around the corner from this hotel, and try the Trattatoria Gemma alla Lupa around the other corner. It's cash only, but the quattro frommage pizza is excellent. If we visit Rome again, we will stay here.", "Date": "June 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Lovely Hotel, Central Location.”", "Author": "ciaobellaa", "ReviewID": "UR7716012", "Content": "This hotel is wonderful. I went as part of a school trip and they were very accomodating and welcoming. The hotel is a two minute walk from a huge train station that can take you directly to places like the Colosseum or the Vatican, and the station is huge, even including shops like mango. The trains are also direct, which makes travelling a lot easier. The rooms were a bit small but clean, complete with minibar and a safe in the wardrobe. The bathroom was really nice; it was clean, of a reasonable size and nicely furnished. There was no shower curtain, but there was a bath. The rooms and the hotel were very clean. Breakfast was okay, but don't expect anything amazing. It basically consists of hams, cheeses, watery hot chocolate and rolls and condiments. However, the breakfast area was spacious and not bad to eat in. I would definately reccomend this hotel as it is well kept, helpful, clean and in a good area.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen", "Title": "“Great Hotel and central location”", "Author": "Mar007", "ReviewID": "UR7474487", "Content": "We have just returned from Rome and staying at the Archimede Hotel. The Hotel is just as described on previous reviews. Very nice hotel and central. Rooms very comfortable although the beds a good bit firmer than the normal uk. The staff very helpful and courtious. The breakfast the normal continental type although the same everyday still a good selection. We didnt have other meals at the hotel as it if far cheaper to visit some of the local restaurants. Couple of tips dont choose a restaurant or cafe near any of the tourist attractions as you will pay dearly. walk a couple of blocks in either direction and you will get far cheaper and nicer food. The nearer you get to the Vatican city the higher all the prices get. enjoy Rome it is a lovely city...we will be back again soon", "Date": "April 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sotogrande, Spain", "Title": "“Read the other reviews before going so not that disappointed”", "Author": "beverleehills", "ReviewID": "UR6352611", "Content": "We booked this hotel after reading the other reviews and it was basically as we expected. For the money it was not bad value, we have to pay 3 times this for a hotel in Madrid. Definately nowhere near a four star though, around a 2.5. We would not have liked to be there in the heat of summer as the rooms are very small and there was only a small window looking on to a corridor (room 512 near the lifts). There is no where to put your cases without triping over them all the time. The bathroom was as the others have complained, no shower curtain and the towels were so old, I wished I had taken our own. Breakfast was rather basic, same everyday. Rolls at times so stale you could not cut them with a knife. However as it was just somewhere to lay our heads and the main advantage being it was so central, it was just passable and did not take away from our enjoyment. Would not return though.", "Date": "December 9, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Albany. NY", "Title": "“Great room if you get a good rate”", "Author": "jillybeansxo", "ReviewID": "UR6011059", "Content": "I would say .. stay in this hotel if you manage to get a great rate. It has a beautiful lobby and the room was clean. Of course, it was VERy small but all Italy rooms are. We missed breakfast but looked VERY nice. Hotel staff was friendly too. The location is OK...I mean, not the best, but it wasn't in a dangerous neighborhood or anything. You can walk everywhere in Rome so location isn't crucial I think, as long as you feel safe, and we did.", "Date": "October 25, 2006"}, {"Ratings": {"Check in / front desk": "2", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "Sydney", "Title": "“Never got to stay here”", "Author": "KPB1", "ReviewID": "UR5926598", "Content": "I booked, and paid for, the Archimede Hotel 10 months in advance of my stay in Rome. On our arrival, we were told there was a flooding problem, and they had no room for us! They had booked us into another hotel in their chain, the Hotel Noto, which they claimed was equal quality, and four star rating (it turned out to be a dump). Reception staff expected us to find our own way to the Noto, and seemed surprised when I requested that they pay our cab fare there, although they agreed to do so. We had already had a terrible day with transport getting into Rome, and were extremely disappointed to arrive at the Archimede, and be greeted by this news. I could not therefore recommend this hotel.", "Date": "October 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable.... but”", "Author": "SueP365", "ReviewID": "UR5912608", "Content": "Good Points: close to train/metro/bus station. comfortable bed, hot water in the shower, clean room. helpful porters Bad Points: some rooms very small, cupboard on side of bed with a the possibility of hitting your head when you got out of bed. plus if short (like me) had to stand on bed to reach the hangers. No shower curtain in bathtube, so water went everywhere. plug in washbasin did not stop the water. male staff on reception rude and unhelpful. marble stairs upto lifts - while here, another guest from a different party, slipped and broke her collar bone. breakfast not worth it - hard rolls.", "Date": "October 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sta.Venera, Malta", "Title": "“A very pleasant hotel”", "Author": "leroi213", "ReviewID": "UR5798386", "Content": "The hotel is in an excellent position and a short walking distance from Stazione Termini. My wife and I enjoyed the double room we were given. It was spacious and had a very comfortable bed. The airconditioning unit was in good working order. The bathroom had all the facilities one would except. The window was facing the main road and had a nice view. The breakfast was buffet style and had a very varied choice. It was a very welcoming start every morning. I would recommend this hotel without any hesitation to anyone who would like to ensure a happy stay in Rome. The reception staff were very welcoming and polite.", "Date": "September 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "4", "Service": "2", "Rooms": "3"}, "AuthorLocation": "bedford", "Title": "“Beware our room was left unlocked on both mornings....”", "Author": "brookiebubs", "ReviewID": "UR4734501", "Content": "Great position for Termini station, but beware if using metro (lots of pickpockets)but I would of rated a 2/3 star not a 4 star. we stayed 3 nights and on our return t the hotel on both days our room had been left unlocked and on our last day a ring was stolen from our room. When we reported this to reception they completly had no interest in helping us and would not report to the police. The even said there was no way the room could be left unlocked, but it was!! Breakfast was OK, rolls, meat cheese etc, rolls not always fresh. The hotel had no bar which was very disapointing.", "Date": "March 26, 2006"}], "HotelInfo": {"Name": "Archimede", "HotelURL": "/ShowUserReviews-g187791-d535363-Reviews-Archimede-Rome_Lazio.html", "Price": "$92 - $158*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via dei Mille 19</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "535363", "ImgURL": "http://www.orbitz.com//hotelimages/load_24/IT/ROM//ROMARC21.jpg"}}