{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Great room, great location but everything else poor!”", "Author": "Burkem121", "ReviewID": "UR126291496", "Content": "hotel is down a side street off Laietana which makes it a fantastic location. We booked the loft room with the extra bedroom with twin beds. Myself, my husband and 3 yr old. The room was fantastic - plenty of room, clean, comfortable beds, nice bathroom but there were a couple of cons that brought this down from an execellent score. 1. TV in main room had 1 channel - remote didnt work 2. TV in twin bed room had only german channels - remote broken 3. Water in shower was luke warm 4. machine issuing entrance cards for room was broken so everytime we wanted to go in or out of our room we needed an escort from reception 5. wifi available but signal so low that you cannot connect to internet 6. very noisy (to be expected I suppose given location) but still very noisy so bring earplugs if you want to sleep 7. REception upon checkout didnt ask us how our stay was or thanks or anthing really - Most people wont care about the TV when in the Centre of BCN but I wanted it and was fed up not being able to zap. But the room and location are perfect if you dont need wifi and can sleep through laughing and singing group of people making their way home...", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Nice apart hotel. There are plus and minuses to be aware of.”", "Author": "Andrew Z", "ReviewID": "UR122920459", "Content": "This is an apart hotel. Some very good features and some not. Was ok for us, but may not be suitable for other visitors. See below. Pluses: - very good customer service. I would say one of the best I've ever seen. - very clean and maintained. - very good location from sightseeing and dining out prospective - located just in the center. a walking distance from almost all points of itnerest in the central Barcelona. Also its good the hotel is not based on La Rambla (one of central streets in Barcelona, which is too crowdy, too 'tourist' and full of pickpocketers). The location is quite and there is a two corner shops one 10 m away from hotel, another 15m away. The location is in Latin quarter (not in Gothic area as some people write, though very close to it), which means not crowded. Few fantastic restaraunts around. - the rooms are quite good like you would see in a decent 4* hotel, large (they've upgraded us to suite, which we really appreciate). Nice contemporary design plus old 18 century wooden beams left exposed. Kitchen is very useful for travelling with a kid. Minuses: - VERY low ceilings in some places. The main room had very high ceilings but bedroom, hall and the bathroom have them very low, while the doorways are extremely low. I've physically hit my head few times quite bad. I am 1,92m (6,3ft) tall and this was sort of an issue. - Very slow internet connection. Wi-Fi is free but, it is powered by Telefonica, a local mobile provider and it is very slow and connects not always at once. It is so slow so you can forget about things like Youtube there for instance or graphic iPad apps. Ok for simple websites. Also the signal is quite week (we stayed on 3rd floor of 4), and it didn't work in all areas of the suite all time. - No public areas. the hotel is very small only few rooms, so there is no restaraunt, bar, gym and etc. Corridors and elevator are very narrow. I've heard there is like a pool on the roof, but we obviously couldn't use it in January. - The area. Though it is good location from walking prospective, a half a minute walk from large street called Via Laeitana, we couldn't look through the windows - the distance to other houses was just a bit over one meter. You also almost never see sunlight, so the room was always in a dark with curtains down. Was a bit annoying after few days like that. The areas and streets are quite dirty in that area, this isn't a tourist quarter but still seems like a place for cheaper accomodation and there are few bars on that street, which are very low profile. Also the noise proof in rooms is low.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice apartment-style rooms in great location”", "Author": "willcarson", "ReviewID": "UR122268698", "Content": "We booked this hotel after reading good reviews on TripAdvisor and we weren't disappointed. We only stayed one night but it ticked all our boxes. It's the Born district of Barcelona which is very trendy and also very picturesque, lots of bars and shops down a myriad side streets. It's walking distance to so many areas including the cathedral etc. The hotel itself was clean and comfortable, and most importantly pretty good value. We booked through Expedia and got a room for about 70 euros in between Christmas and New Year. Would happily recommend Hotel Boria to anyone going to Barcelona for a short break.", "Date": "December 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Nice location”", "Author": "Brandt1203", "ReviewID": "UR117852336", "Content": "A group of 5 friends stayed here 3 nights in the beginning of September. We were a bit worried as our booking made through hotels.com was cancelled about a month before departure \"due to failure in bookingsystem\". We were not satisfied with the offered alternatives and then suddenly we were able to keep our room at this hotel. No problems upon arrival. A swift check-in and cool cava waited in the room. Placed on the edge of Barrio Gothic and El Born the location is very nice. The hotel standard is good and the apartments very suitable for smaller group who want to stay together. The roof top terrace was nice, but better furniture should be available. Tall scandinavians should be aware of the height in parts of the apartment. Heads clashing in to doors was not rare in the second bedroom, bathroom and kitchenarea.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Maidenhead, United Kingdom", "Title": "“Another cancellation without explanation”", "Author": "The_Allens_UK", "ReviewID": "UR115868378", "Content": "Just read the previous reviewer's comments after coming here to find out more information about why our reservation has been just been cancelled - just 10 days before our stay. Stunned! Something dodgy going on here I suspect. Currently waiting for a callback from Expedia's re-location team - but I'm not that hopeful they'll find anything at such short notice for us. Quite angry and the children will be very disappointed.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Closed when arrived!!!! No advance warning from Thomas Cook.”", "Author": "ManicHobbit", "ReviewID": "UR115843658", "Content": "Having booked via Thomas Cook, were perturbed to arrive and find the hotel closed. No notification prior to departure. After numerous lengthy international phone calls TC have managed to relocate us (a family of 5) in superior accommodation so thumbs up for that; could have done without the hassle and worry of being stranded in an unfamiliar city with the family. Thank heavens we arrived early morning so could at least sit in a square whilst waiting for the situation to be resolved.", "Date": "July 27, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“Last minute cancellation with no explanation”", "Author": "tmartin5", "ReviewID": "UR114943955", "Content": "We would have loved to have stay at Hotel Boria after having booked and paid for it on Hotels.com 4 months prior to our visit. One week prior to our stay, our reservation was cancelled with no explanation from the hotel. Our money was refunded per Hotels.com. They were unable to find similar lodging for the same price, especially at such short notice.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“Great Location and Helpful Staff”", "Author": "TouringTC", "ReviewID": "UR114654330", "Content": "Took the train in from the airport and walked the distance through main streets which wasn't a problem despite large suitcases. A little hard to find the hotel, so make sure you have map/ directions prior to leaving. Location was excellent in that it was not on the Ramblas which is busy, but still close to shopping, eating, transit and not far from the beach etc. Staff was extremely helpful trying to locate lost luggage on a daily basis - 4 days later it did show up and they put it in our room while we were out. The only negative is that we found it to be loud at night and did not sleep well. It was Easter weekend, so I am not sure it would have been much different elsewhere but the sound did travel in the close walled streets. We travelled with two other couples and we all really had a great trip. Enjoyed the roof top deck on a couple of occassions for a glass of wine but it could use a couple extra chairs. Having the fridge helped for breakfast items and cold drinks. Had a great birthday dinner one night at Café de L'Academia. Opens at 8:30 and was full from that time on.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Great location, good sized rooms, clean”", "Author": "Nutmeg215", "ReviewID": "UR67048782", "Content": "Great apartment hotel, modern and clean. We (four friends) stayed in a 2 bedroom suite and there was plenty of space for us all. Great location, so easy to walk to Las Ramblas, the Gaudi Cathedral and the Picasso Museum. We walked past the door initially, as it's not obvious it's a hotel - with its' great big wooden door. Helpful staff too. So all in all great value for money. The only negative was the toilet/shower being open plan too; as the whole loft apartment had large vaulted ceilings it was very difficult to use the facilities without everyone hearing!", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“feeling of resident than a tourist !!”", "Author": "bestenergy", "ReviewID": "UR66169870", "Content": "the grate thing about Boria hotel is the feeling of having your own apartment in Barcelona than beeing just a tourist in a small room hotel room also verry romantic wellcome with prosseco (just little smell from bathroom perhaps all old center of barcelona has )", "Date": "June 2, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Pre-cruise Adventure in Barcenola, Spain”", "Author": "Cookie952", "ReviewID": "UR57249748", "Content": "As a pre-cruise adventure we chose the Boria, a small, quaint, hotel located a few blocks from the busy main streets. We stayed in a loft w/kitchenette that was totally modern, extremely clean, quiet, safe plus it had losts of lounging space. The staff was friendly, spoke english, and was knowledgeable about points of intrest for us less savvy travelers. The only bummer-- NO food or beverages available in hotel, available within walking distance. Overall -- EXCELLENT choice.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Outstanding Hotel in great location”", "Author": "murrpark", "ReviewID": "UR52403883", "Content": "This is an excellent apartment style hotel, very stylish, modern and clean. We stayed in a 2 bedroom with our teenage children and there was plenty of space for us all. It had a full kitchen although we barely used it as there are so many good places to eat nearby. Some reviewers expressed concern about the location. The taxi will drop you at the end of the street as they cannot get down there. It is only a short walk though and despite what others said we found the street well lit and felt perfectly safe. The entrance to the hotel is discrete and it is easy to miss it so look out for the huge wood panel door. The hotel is located in the old part, in the midst of winding narrow streets. Very close to the Picasso museum and an easy walk to Ramblas. There is a big market very close that is ideal for breakfast or lunch snacks and numerous good quality and cheap eateries in the streets surrounding the hotel although not much in the street the hotel is in. In summary an excellent hotel in a great location.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Sherwood Park, Canada", "Title": "“Surprisingly nice given the areas' first impression”", "Author": "BMWtravel", "ReviewID": "UR36744667", "Content": "Couldn't believe it was a hotel ..up a rough looking alleyway. Nice external door and nice inside but tiny...9 rooms or so on multiple floors. Classic tiny european elevator. Very helpful guest clerk. Rooms were very nice, clean and spacious...2 rooms plus a bathroom - an efficiency unit. No restaraunt, but many eating places close by. A little noisey in oine of the rooms due to outside late partying. Walkable to Las Ramblas. Don't expect a chain like environment...but its nice.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“Post Cruise Stay”", "Author": "PreciseTravel", "ReviewID": "UR32156020", "Content": "We stayed at the Boria Bcn for a day after our 13 Day cruise. We already knew to get directions ahead of time, based on our experience with the pre-cruise apartment (FGA Bach). We had two taxi's because we shopped til we dropped at the ports. They also dropped us on the main street, stating that they couldn't go down the narrow alley. Luckily it was 10:00 am, so we didn't have to worry about the purse snatchers that others wrote about. There was a reception area with a very nice lady working. She was quite upset with the taxi drivers for dropping us on the corner. The main reception area was really nice, but it smelled like sewage. The lift was extremely small, but the room/loft was really nice. We loved the location of the little hotel because it was walking distance to everything. We walked through the gothic quarters, to Las Ramblas, and took the Metro to the rest of the hot spots. Don't let the grafitti bother you in the pictures because there is grafitti everywhere in Barcelona...I mean EVERYWHERE! The hotel made sure there were two taxi's waiting for us in the morning to take us to the airport. The hotel let us use their phone to make a call home to the states, and we didn't have any problems going out late at night for dinner. There were a couple of small things with our loft, the windows in the main room looks out on a pigeon infested alley, but the smaller room didn't. Yes, the rooms are quite dark even with the small lights they have. Lastly, the ceiling over the steps down to the main sitting area is VERY low. I'm 5'8 without heals and hit my head hard on the ceiling twice going down into the main seating area. So did one of my friends. I would recommend this hotel to friends (not families with children) for a one or two night stay.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Just Right”", "Author": "JohnLiisaOwenElla", "ReviewID": "UR24506316", "Content": "Stayed here for a week in Sept 07 so this may be a dated review. Good hotel, good location, rooms are fine, free wireless internet worked well. Street noise is an issue if it bugs you but if you are coming from North America just stay on your local time and eat dinner at 11 PM and go to bed really late. There are rooms on the nonstreet side you can get. Staff were friendly and helpful. Street crime is a problem anywhere in Barcelona and requires you to take precautions. We never felt threatened walking around the neigbourhood of this hotel. Its location is really the charm, very cool older district, close to a metro stop. A nice 15 min walk to Ramblas which is great to see but I would not want to stay too near there due to the crowds. Yes the hotel is down a street difficult to access by taxi but we were prepared with a local map (from Google maps) which allowed us to navigate the 100 meters from the taxi drop off. For our return airport taxi the fellow did pick us up at the hotel door in the early AM.", "Date": "February 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Wiltshire, UK", "Title": "“Beware of the Boria”", "Author": "ManUtdRG8T", "ReviewID": "UR16381155", "Content": "Although I recognise the hotel from other very accurate reviews, I feel compelled to add my own. Firstly finding the place proved difficult as there is no sign outside it that shows that it is a hotel. Our taxi from the airport refused to take us down what amounts to a dark alley and so we walked with our rolling luggage and child in a pushchair into what can only be described as 'harms way'. We walked straight past the hotel (as there was nothing obvious to show what it was) and on into the dark depths. We saw a street cleaner and asked directions from her (she sent us completely the wrong way as it turned out - probably deliberately). I eventually asked a cafe owner where we were (I had a map but there were no street signs). The cafe owner said that I was in the wrong part of town and to get out fast, he pointed at several feral looking men and said they were thieves! We took his advice and went for the nearest main street, we were followed by a couple of sinister looking chaps in dark glasses and designer clothes. By now I was boiling hot and very concerned. One of the men made a move to get my wifes handbag but she had the presence of mind not to be distracted. We finally found the place and the security entry is a sure sign that the hotel owners are aware what a dangerous place this is. Although it is in the Born area and close to everything, it is seedy in it's immediate location. The reception lady was very polite and professional and friendly and seemed genuinely shocked when I described our experience of finding them. She told us that she leaves work at 11pm and has never had any bother. The hotel is tiny and has no amenities - no restaurant or bar, it was a squash to get into the lift with just one suitcase. There is no way a disabled person could manage at this place. For a hotel that only opened in 2005, it seems extraordinary for that to be the case. The room (a junior suite) was located on the first floor. Spacious and achingly trendy it was as the saying goes, \"all fur coat and no knickers\". There was a complimentary welcome half bottle of cava in an ice bucket with a few chocolates on the coffee table. The electrics were quite dodgy and the TV was wired into the bedside lamps, so no lamp on meant no TV! The tiny bathroom had no bath! I had to walk sideways into the shower it was so small and I'm not that big..really. The lightswitch for the bathroom (which was up a couple of steps) was behind a heavy glass door. Totally bad design. The cupboards were tatty and on their last legs. This place needs a total rethink and after just three years it already needs a refurbishment. There was no tea or coffee but a reasonably well stocked mini-bar / fridge. A couple of the windows (covered by heavy wooden shutters) were nailed shut and you needed to have several lights on otherwise the room would be in permanent semi darkness. Great if you want to sleep but very gloomy otherwise. Our room was over a side alleyway and the noise was terrible. Every word spoken would echo up and could be heard by us, mopeds and motorbikes constantly buzzing up and down, delivery lorries clattering about and our sleep was completely ruined every night. I love Barcelona and wanted to be close to the main areas but made a big mistake with the hotel Boria. It is very expensive and simply not worth the money. It is in completely the wrong street . I would not stay there again and would urge anyone else not to make my mistake as you will regret it. If you're daft enough not to heed this warning - do not whatever you do take children anywhere near this place, it is not safe but as an adult you can choose, kids can't.", "Date": "May 25, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "LindyLou105", "Title": "“Bad experience”", "Author": "LindyLou105", "ReviewID": "UR15719155", "Content": "I booked this through Expedia expecting it to be vetted. The hotel and rooms are very nice but the area is dreadful. The hotel is sited down an alley off the main road. The alley is full of graffitti and signs warning of thefts. Despite being really careful both myself and my riend was mugged on our way back to the hotel - at 10pm at night, in fact just outside the entrance. We were jumped by young Algerian men who slashed our handbag straps with knives and dragged us along the road. We were extremely upset but the hotel was less than helpful and only rang the police when we insisted. We were charged for calls home to cancel our cards etc. We were robbed on our second night in Barcelona. We returned home the next day as we did not feel safe in this area. Despite asking Expedia not to send people to this hotel - they still do. It is dangerous to stay there.", "Date": "May 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mayo", "Title": "“Great Hotel !”", "Author": "bart444", "ReviewID": "UR15044810", "Content": "stayed at hotel boria in early april and found it to be very good. we booked a suite and it worked out really well for us. everything is in great condition and rooms are cleaned daily. We booked a suite and found it just the trick, really spacious. front desk were extremely helpful and nothing was too much hassle. there is a lot of street noise but other than that i couldn't fault the hotel. its close to everything really, las ramblas beach etc. i think if i were going to barcelona again i would have no problem staying there. just note there is no bar or restaurant facilities at hotel boria.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“stupidest hotel ever”", "Author": "kob", "ReviewID": "UR14845629", "Content": "Booked this hotel due to great reviews on tripadvisor and wanted to be in the Born area. It was expensive and looked good on website. Worst things: lighting - about ten different lights and lamps to switch on. No sunlight. 2 windows had screwed shutters so you could not open. Noisy - not just street noise but we could even hear the lift going up and down. Design of room - it had 3 double built in cupboards that took up a huge amount of space. Result floorspace was minimal. Bathroom light switches were behind a giant glass door so that you had to enter the room, pull shut the door in order to put lights on. No tea or coffee in room although a full galley kitchen. Sewage smell in stairwell. Terraces on roof locked. Everthing was a hassle with the front desk. Have no idea how it could be rated so highly on the hotel ranking.", "Date": "April 7, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "moscow", "Title": "“Too noisy and cold to have your rest”", "Author": "oksa", "ReviewID": "UR14714903", "Content": "I would not recommend this hotel at all. We stayed there for three nights with two kids. First of all I still don't understand why they charged extra 50 euro per kid since we payed already for a family suite. But anyway, the location was good considering how close it is to the major attractions, but the street itself is very scary especially if u get out later then 10 pm. It is some sort of latin distrect, close to the market with small suspitious shops runned by imigrants. And it is a very noisy street too: we had a room on second floor (don't stay there), and we could not sleep at all: all day night some of the locals listened to music quite loudly and had very emotional conversations. I quess it is spring time and they prefer to stay outside all night long. They were bikes too: all night long. The windows were very old and didn't protect from a noise and from cold. The room was so cold, and it wasn't any proper heating system except air conditioner which we tried to use, but due to hight of the ceiling it did not really worked. We were not very happy with our choice of the hotel at all. We are not going to stay there anymore and i would not recommend it to anybody.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ny, ny", "Title": "“not so spectacular boria bcn”", "Author": "agobot", "ReviewID": "UR13999660", "Content": "stayed here for the barcelona marathon. it was a great space for 4 girls, all of which are running in the marathon--the kitchen is a godsend. however, we had quite a few problems--the hairdryer is terrible, blowing lukewarm air and suddenly turning off. the shower doesnt have hot water for very long. internet is free, but spotty. housekeeping decided not to clean our room because \"nobody saw us leave the room\". they didnt even knock or ask us if we wanted our room made up, and we didnt hang a do not disturb sign on the door. front desk wasnt very helpful, when we asked for housekeeping, they told us that they go home at 3pm, so we were out of luck. they did however bring us fresh towels. also they charge 50 Euro per nite for an extra (4th person--expedia website had it for less in US dollars! not sure if the front desk just made up the number or if it was legit). also it gets quite noisy at all times of the night, with pigeons among other things cooing on our balcony in the morning. we chose this place based on the reviews, but were disappointed. will not stay here again.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Lovely honeymoon”", "Author": "JennyHolm", "ReviewID": "UR12344846", "Content": "We stayed at Boria for our 10 days honeymoon in august 2007. A perfect choice for honeymooners with its luxurious and spacious rooms. I found the hotel through a hotel booking site, but since I prefer to book directly at the hotel I did so through their webpage, and it worked very well. I hade some questions before placing the booking and they replied quickly and placing the booking directly at the hotel felt secure. On arrival we hade complimentary cava and chocolates, a very nice touch when on your honeymoon, even thou we knew it wasn’t something special just for us, but that kind of thing really shows it’s a hotel that take pride in the details. Just as always having fresh flowers in the room, changed every third day. And it was fun to se the bed done in different ways almost every day. ;-) The staff was very friendly and helpful, and yes, the guy working the nightshift is just there for security, not as a receptionist. We loved the little kitchenette, one of the reasons for booking the hotel since I have a medical condition making me have to eat very regular and have all that space to prepare easy dishes and a fried and freezer (whit free ice, nice touch to) made it possible to have the ingredient fresh and chilled. The only downside was that the cooker didn’t work (it was not broken, just not in use) and that was a pity I think. Wonder why there were installed when one couldn’t use them. Maybe it hade something to do with security and insurances. You really should take advantage of the fact that you have one of the nice markets (mercat de santa caterinia) just a block away and go there and by fruit, hams, cheeses and prepare a lovely breakfast in your room. And the dishwasher was a nice surprise, no need to take any washing liquid or sponges whit you if you are used to that when renting an apartment. This is a hotel apartment, with all the service. But there could have been one ore two more channels on the telly for us English speaking. Even thou we went there to watch telly, its nice to have it on when eating breakfast and while preparing to go out. After 10 days, you are feed up with news, I promise you. The location is highly central, I and don’t understand how anyone wants to live at La Rambla when you can stay in El Born and La Ribiera. Most things is within walking distains and we found that taking the tube often took to more time than walking directly. But fore the times when you are to go a but further in the city, for example up to Park Gürel or Montjuïc, you have a tube station just around the corner. We highly recommend eating one of your meals on the restaurant Petit Safrà just by the market. Easy, well cooked food to a nice price. We eat there on our first night after recommendation from the receptionist and we returned on our last night as well. When you want to enjoy a real good seafood platter, go to Can Ramonet in the Baceloneta, but whatever you do, pleas just go pass the very nice looking restaurants that you pass on the way there from the hotel at the Historic Museum. The look nice, but the food is that as great as the décor and it’s heavily overpriced. Instead, wonder down in El Born and eat at one of the modern restaurants there, bestiari for example is a very nice one.", "Date": "January 5, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“Great Boutique Hotel - Would do it again”", "Author": "datvader", "ReviewID": "UR11505535", "Content": "Found Boria at the last minute and it was a great find. The location was great as we much prefer El Born vibe to Las Ramblas. That being said, it was a 15 minutes to Las Ramblas so you're actually very centrally located. Also, the street that it's located on is very quiet which was a plus for a good sleep. The rooms were fantastic, much more than I expected. You could easily fit 4 people in the room we stayed in. there was a separate bedroom with a Queen bed (so actually two Queens), a kitchen, a small terrace, and the decor was tasteful and modern. The staff was very nice though they may not be as knowledgeable as some of the larger hotels. But it's a boutique hotel so it has that smaller, cozy feel. Overall, we have no complaints and had a great experience.", "Date": "December 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Awesome place to stay!”", "Author": "AliceMeagle", "ReviewID": "UR10128044", "Content": "This was an awesome hotel at a very reasonable price. The rooms are very modern and boutique-like. Very clean, spacious room. The front desk staff was very friendly and helpful except for the night guy, although I think he was more there for security than anything else. It's a little bit of a walk to las Ramblas, but there are plenty of restaurants and shops in the area. Very close to the subway and Picasso museum in a nice, clean part of the Gothic quarter. I absolutely recommend this place for your stay in Barcelona.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "carlsbad,ca", "Title": "“Beautiful Boutique Hotel”", "Author": "goldielocks2", "ReviewID": "UR8238646", "Content": "This hotel really turned out to be the find of our trip. My requirements when looking were as follows; room to accomidate a family of 4, A/C, and close to major sights. We stayed here twice in July, pre and post cruise First in room 201, 2nd in room 303. Both rooms were huge and beautiful. The decor was sleek and modern, with old world architecture (just like Barcelona) We liked 201 a little better as it had a seperate living room. Both had similar colors. The beds were very comfy and the A/C worked well. We did not hear any noise that others spoke of. It was really nice having the extra space. It was full of extra touches like fresh flowers in 3 rooms, welcome chocolates and champagne. Staff were warm and friendly and spoke great english. I have nothing negative to say regarding this place and would definetly stay here again. However this hotel may not be for everyone. For one we could never get a taxi to drop us off directly in front of the hotel, They always dropped us of at a cross street and we would walk about 150 yards.( If you have alot of luggage this could be a problem) No bellman , again those of you who over pack just know that you must carry those bags up 5 stairs by yourself to reach a very tiny elevator. The 2 rooms we stayed in also had stairs. They were beautful freestanding wood stairs without handrails or lighting, so if you have mobility problems, or you forget they are there chances are good of falling down them, especially in the middle of the night. No , this did not happen to me, but I could see it happening. The cab ride from the hotel to the airport for 4 people and 4 bags was 25 euros. To the cruise port 12.", "Date": "July 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "River Forest, Illinois", "Title": "“Cool boutique hotel”", "Author": "Pierry", "ReviewID": "UR8019401", "Content": "My father started a tradition for my children to give a trip for 8th grade graduation rather than parties,gifts,etc. My daughter chose Barcelona (thank you American television...Cheetah girls and America's Top Models) and I could not have been happier. She invited her older sister and we stayed at the Hotel Boria. In their words, a \"really cool\" hotel. It was in a great location. We stayed in Room 402 and by European standards the suite was quite roomy. The location was absolutely perfect and the rooftop terraces gave all of us a good place to wind down before the 9:00 PM dinner hour. My only complaint is that there wasn't a place inside the hotel to have coffee. There was a coffee maker in the room, but I missed the morning continental breakfast that so many European hotels offer. I would definitely stay there again. The staff was very helpful. They booked a Flamenco dinner and show for us. The hotel was within walking distance of everything and the Jaume metro stop is a block away. A visit to CalPep was wonderful. The tourist bus was a great way to get an overview of the city, too.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monroeville, New Jersey", "Title": "“Great hotel - location can't be beat!”", "Author": "coolbreezeken", "ReviewID": "UR7845532", "Content": "My wife and stayed at Boria BCN for a week in early May 2007 while visiting her daughter and son-in-law, who live in Barcelona. We could not have been happier with our choice. The location is perfect as it's right in the middle of the beautiful Gothic area, across the street from La Seu (the cathedral) and on the threshold of the cool El Born area. There's also a metro station right across the street. We came and went at all hours of the day and night and never once felt unsafe. We stayed on the fourth floor in a junior suite (room 402) and thought that our room was great, with it's high, wood beamed ceilings, king-sized bed, small kitchen area, extra bedroom, and nice sized bathroom. The fact that we were on the fourth floor also helped to cut down on some of the street noise (though given its location you have to expect a little clatter). We also enjoyed the roof top terrace and finished off most of our evenings enjoying the night air while finishing our final glasses of wine. In addition, all the staff at the hotel were friendly and courteous. Given the hotel's amenities and location we felt that the price we paid for our stay was extremely reasonable. All in all, we couldn't have been happier with the Boria BCN and will definitely stay there again the next time we return to the beautiful city of Barcelona.", "Date": "June 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Fantastic Value”", "Author": "member02", "ReviewID": "UR7751267", "Content": "Just got back from a week in Barcelona. Boria was perfect for us, lots of space, seperate bedroom and 2 fantastic roof terraces. Reception staff were helpful and able to reserve tables and book trips. You can hear some noise during the night from the bustling city around, but thats the price you pay for a central location!", "Date": "June 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burke, Virginia", "Title": "“Awesome room!! Great location!!”", "Author": "boganst", "ReviewID": "UR7571070", "Content": "We booked this through a special on one of the travel websites... book 5 nights get 20% off. After 4 nights in a cramped room in Paris, arriving here was a delight. The room, or as most have described as an apartment allowed us to spread out and finally breath. 3 separate areas connected with high ceilings was nice. The kitchenette was nice but the oven never worked. Didn't care... like we were going to cook anything but it was a nice option. Fridge came in handy but don't use any of their mini bar products... there is a mini food mart a few buildings down for .80 water and 4 euro wine. Location was great as a base of operations, but did get loud during the day as stores opened up. Only a short walk to Princessa Street for great little restaurants, bars, shops, and the Picasso Museum. Short walk to the old city and the cathedral. Metro is only a block away. Felt reasonably safe during our stay. Think we heard an attempted purse snatching around 0300 on a FRI night, but that is pretty common throughout the entire city. Staff was great and helpful. Keep your eye out when finding the place for the first time... it does not look like it is a hotel and you will walk by it (we did). Pay attention to the building numbers and you should be fine.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Utmost Luxury”", "Author": "traveller1959", "ReviewID": "UR7406224", "Content": "This is probably the most luxurious boutique hotel in Barcelona. You don't get just a room or suite, you get a full-size apartment - stylish, modern, with contemporary art everywhere, a kitchen with large fridge, freezer, dishwasher etc. And this at the best location in town. This IS a real hotel, although it has 10 \"rooms\" (apartments) only - with 24h-reception, full room service, newspapers in the lobby (British, German and French) and a well-stocked library. They even have a terrace on the roof. Location: The BoriaBCN is at the best location of town, just steps away from the Cathedral and the Picasso Museum. The next Metro station is 50 meters away. If you have a car (not exactly advisable in Barcelona), there is parking garage also 50 meters away from the hotel. The hotel is on a rather quiet side street, however you are in a mediterranean city with people active until midnight - but no traffic, and after midnight it becomes quiet. The BoriaBCN is at the edge of El Born, just in the middle between the Barrio Gothico and the Born. Just around the corner (Princesa and Argenteria) you find lots of trendy bars and restaurants. We did a lot of walking deep in the night and found it always safe. Rooms: See the pictures. Everything is incredibly spacious (even the shower!), brand new, bright and shining. We spend five days in this hotel, and all five days it was heavily raining in Barcelona. You can imagine how happy we were in this huge apartment. We liked to prepare breakfast and lunch on the room, and fridge, microwave and dishwasher helped a lot. Public areas: This is a small boutique hotel that does not have much public space. The lobby is a kind of library with books about travel, art, design and cooking (several languages). They have a nice roof terrace and we would have liked to use it if it hadn't rained to much. Service: Impeccable maid service. Very friendly and helpful receptionists. The do not serve breakfast in the hotel, but there are several breakfast places just around the corner. Value: We stayed with our family of 4 in a larger suite and, given the high price level of hotels in barcelona, found it extremely economical - regarding the degree of luxury which we enjoyed. Our parents stayed in a smaller suite, and for them the price was still okay.", "Date": "April 21, 2007"}], "HotelInfo": {"Name": "Boria Bcn", "HotelURL": "/ShowUserReviews-g187497-d543388-Reviews-Boria_Bcn-Barcelona_Catalonia.html", "Price": "$210 - $383*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Boria, 24-26</span>, <span class=\"locality\"><span property=\"v:postal-code\">08003</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "543388", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/16/9a/169aabcbab851d695564c5415ed965835large.jpg"}}