{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“A friendly but overall basic hotel.”", "Author": "Dorsetreviews", "ReviewID": "UR127455708", "Content": "The staff were helpful and nice, they even opened the pool early for us. The room was fine, but the windows couldn't be opened and the air con was poor so the room did get very warm. The breakfast was ok, little choice in the way of hot food but an ok selection. The pool was small and the jacuzzi was never on. The location of the hotel wasn't central but close to the metro, few stops and you were in the main touristic areas so overall not too bad. I would recommend this hotel if you want a fairly priced ample hotel. But ensure you have a metro map!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "stuttgart", "Title": "“Save the trouble and avoid this dump.”", "Author": "WaywardTravelor", "ReviewID": "UR124176745", "Content": "Sorry for the length but when things are bad, they are really bad. Sunotel Aston Review: Where to start? This place is a dump. Instead of admitting it and letting us get on with our vacation it keeps coming around. My bride is not one to let anything go, especially when someone lies, so it continues. 1) The rooms. Our first room was very dirty. Nothing in particular but overall it did not look or feel clean. The bed was a box spring with a sheet over it. Seriously, not even a mattress, just an old box spring. The TV (although I do not watch TV on vacation) was a 14” (30cm) tube TV that did not work anyway. The remote had crusty stuff on it, the battery door missing, and really too disgusting to touch. The window was broken so the street noise came in fairly loudly even though we were on the back of the hotel. There was no heat or blankets. The bathroom was small and although adequate, it was dirty and had lights that did not work. As we had dinner plans we dumped our bags and headed out figuring we would address the room later. Upon return I requested a different room for the reasons above. The second room was the same as the first except the TV actually worked. From this room we heard a loud groaning noise every minute or so. Being exhausted we went to sleep anyway. In the morning we decided to move on as this was already our second room. If someone has a problem with their room do not move them into the same type room on a different floor! The room we had was not what they showed online, maybe twenty years ago, but not now. It was disappointing. 2) The breakfast. Breakfast is served in a musty basement. They did try to brighten the place a little but after our terrible room I felt they fell short. Someone had a bad hacking cough, another of my bride’s peeves. When she saw him go into the kitchen that was the end of her food. The selection was typical European breakfast nothing special. 3) The hotel. The lobby is very small. It reminded me of 70’s-ish hotel that you rent rooms by the hour. The elevators made strange noises, and shook when in motion. The hotel is located far from the tourist areas and 2-3 blocks from a Metro. Although Barcelona is safe, this area seemed seeder than most others we ventured into. 4) The staff. The young man that changed our rooms was reluctant to do so because we had checked in a few hours before. But he did do it. After we decided to move on to another hotel is when the staff really showed their true colors. First, we were told by Kuoni (travel service) that we would be charged a 115E fee for canceling our room. I was told to take this up with the hotel as they were trying to accommodate us. No one from the hotel contacted us when they knew we were leaving. Once we went to the lobby they engaged. While waiting for the desk manager (a random employee who was sitting there at the time) to contact someone about the 115E extortion the desk clerk explained several things to us. The hotel was a three star but since Barcelona is in the tropics they have a much different rating system. When I said I was from Germany I was told that Germany really doesn’t count as part of Europe as their standards are too high. As I explained about the strange noise every minute or so she offered that the noise is the elevator. She thought our dissatisfaction was from the noise so she was trying to move us to a ‘nicer’ room away from the elevator. I asked why we were put there after we were not happy with our first room but she did not have an answer. As the desk manager could not reach anyone to discuss the 115E after about 20 minutes he decided that we did not have to pay, this time. They again offered us a ‘nicer’ room but I was decided that I had had enough. Two points why I was leaving: 1) I already changed rooms, they should have given us a ‘nice’ room once I complained; and 2) the location, I wanted to be closer to the tourist areas. 5) Travel service: Kuoni and Swiss Airlines. Kuoni was helpful while we tried to change hotels. They offered us a similar hotel with the same rating but further out. We tried to get them to put us in the Rivoli Ramblas as it was available online. I was offered a room there for an additional 70E per night, 185E per night total! Seriously? Instead of fighting I decided to get my own hotel within my own needs. I told Kuoni that 115E for the dump they put us in was not fair. They offered 30E back if the hotel actually cancelled the 115E fee that they were supposed to. And we moved on.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“good hotel”", "Author": "bazik_81", "ReviewID": "UR122289230", "Content": "We stayed at the hotel in October 2011 with my friend. The location is not bad, not really close to the city center but still not bad...There is swimming pool at the roof of the hotel, I guess it's nice during summer period. Our room was nice and clean, staff were friendly and helpfull. We liked breakfast at the hotel (eggs, bacon, fruits, yogurt, etc.)! There are lots of cafes and shops nearby.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tohmajärvi", "Title": "“Got what I paid for and more”", "Author": "Mika P", "ReviewID": "UR121479683", "Content": "We were worried about reviews we read before leaving. Place was nice surprise. Lobby was tired ok, but we didn't come to barcelona to sit at hotels lobby. Rooms were clean. Staff was very friendly and helpfull. Breakfast was great. Metro stop \"hospital clinic\" was near and easy to find.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Very good value!”", "Author": "Nat8980", "ReviewID": "UR120734682", "Content": "I was a bit worried reading all the bad reviews. But it was a good experience :) It wasn't expensive, so you can not complain about the value. Rooms are very clean, there was a TV, A/C, towels changed every day, nice staff. Breakfast was also really good. Also there is a good location, hotel is situated 4/5 minutes from the metro station (Hospital Clinic), and also is not that far away from the Sagrada Familia, the most beautiful building I have ever seen. Lots of shops and cafe around the hotel. Me and my friends we had a great time ;)", "Date": "November 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Orange County, California", "Title": "“Barcelona experience”", "Author": "LakePanorama", "ReviewID": "UR119956162", "Content": "I booked a two star Sunhotel in Barcelona after researching various websites. It was not the least expensive, but was affordable. After finding the hotel I booked (and having booked parking for my vehicle) I was told that I had been moved to another Sunhotel around the block, which was a three-star. The first issue was parking (@ around $15 Euros per day). I spent at least 10 minutes maneuvering my skateboard-sized car into the hotel's underground garage. In hindsight, one does not need a car to see Barcelona--pay for the Hop-On busses that run from morning til night for a daily rate. The hotel room was quite small, but clean. We booked the room due to the hotel having wireless internet in the rooms at no extra charge. Unfortunately, the internet was down for the entire hotel for most of our first evening. To their credit, the problem was fixed late in the evening, and I was even notified by phone of the repair. Also, the hotel was nice to allow an adjustment for the lack of internet. Finally, the breakfast, at 10 Euros, was pretty good, and not a bad price for the selection (eggs, bacon, fruit, yogurt, etc.). All in all, the hotel was reasonably priced, offered a good breakfast, had clean rooms and a friendly staff. I would consider staying there again if ever in Barcelona.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“wish i hadn't booked this hotel”", "Author": "Vishj", "ReviewID": "UR118752346", "Content": "right from even before starting my vacation this hotel and its management gave me an eerie feeling. first they charged the full amount of stay on my credit card 7 days before my arrival, while it was mentioned on the booking site that I can pay at the hotel. next, the hotel is just out of place from the touristic areas. Very small hotel to command a 3-star tag. their room rents are very expensive, not worth the kind of rooms or the customer service. their is no view from the rooms (infact we had a backyard opening with a small window) and the hotel is just bang on the edge of a busy junction. breakfast is ok and the swimming pool on the terrace is smaller than a baby pool.", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "UK", "Title": "“Tired and a bit grubby, needs a make over - staff were helpful”", "Author": "Vantagepoint", "ReviewID": "UR117968219", "Content": "In need of a serious make over, this ought not to be graded as a 3 star hotel. When booking had requested a room at the front of hotel with opening windows. Was given a small room at back of hotel with windows so close to ceiling that I had to climb onto chair to open them. No view/air movement which made the room feel claustrophobic. Requested change of room and was given two more to check but all exactly the same - advised these were only ones available. Air con only worked when card for lights etc was inserted so room very stuffy and hot. No fridge in room and although there was a safe, if wasn't fastened down so useless from a security point. Only one thin pillow each on bed, extras have to be requested from reception. Lock on bathroom door defective. Seating in reception is grubby and carpets in corridors threadbare and stained. Pool terrace was decent size but no umbrellas or bar area and sun beds/chairs etc are old and tatty. More like a hostel than a hotel! Only plus points were helpful staff and the cafe off reception provides a good coffee. This not my first visit to Barcelona and there are genuine 3 star hotels available for a similar cost - I would not stay here again under any circumstances.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“avoid this place”", "Author": "akhan64", "ReviewID": "UR115423685", "Content": "unfriendly staff. location is way off to the central attractions. rooms too small. bathroom too small. average built person cannot sit on the commode. tv size 14 \" and does't work.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“run down filthy hotel”", "Author": "allison089", "ReviewID": "UR114648312", "Content": "receptionist wasnt friendly on any off the occasions we needed to speak to her. we were given the our room key which was on the sixth floor, lifts very rocky, room had only been cleaned !!!! dust still on floor and on tables, room was smelley not a fresh cleaned room smell, air conditioning dial had a screw in it too turn, but there was no chance of it turning. there was no details in room about hotel ex. breakfast or how to contact reception. went down to ask reception about windows in room (did they open) she handed me a handle to open window. couldnt open window properly as curtain was in the way, curtains also not clean. window was slim long so didnt let in much air. tv remote wasnt working, the only channel we understood was the music. beds not very comfortable. the next morning there was small creaturers walking along the side board not very nice!!! hotel very run down and dirty through out. this has to be the worst hotel ever! i have stayed in many hotels that have been basic which is fine but this hotel was stinking. location of hotel not bad 5 minutes to metro or half an hour walk to las ramblas. cant comment on food as we didnt eat in hotel.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Australia", "Title": "“Arguing staff”", "Author": "Leonie99", "ReviewID": "UR113356256", "Content": "We stayed here for three nights. The hotel is in a good position, breakfast was good, the hotel is rather rundown. We were booked into the Sunotel Junior which is adjoining, and were ushered into the Aston without explanation as to why. The wifi could not be picked up in our room, staff kept telling us they'd look into it, but nothing eventuated. Had to go to the lobby to use our computer. One day two staff members were having a rather loud and heated argument at the front desk, this went on for ages and was rather annoying as we were trying to skype at the time.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nizhny Novgorod, Russia", "Title": "“Convenient budget hotel, breakfast excellent!”", "Author": "olegkravitz", "ReviewID": "UR105169180", "Content": "Looking for a cheap hotel near the Barcelona Sants railway station, decided to live at Aston. Walking distance to train station 12 minutes of brisk pace. We left early in the morning, so we do the hotel location was very important from Barcelona Sants. The hotel is not bad, but a small room, TV channels, too, not much, the window does not open, but there is air conditioning. But in the Aston is a very good and tasty breakfast buffet, great selection of dishes. Front desk open around the clock, so if you come at night, get a room key with no problems. Close to the hotel Metro Hospital Clinic.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canberra", "Title": "“Friendly staff, great breakfast”", "Author": "ryancropp", "ReviewID": "UR98461849", "Content": "The hotel is a bit out of the way, but it's great value. We stayed for four nights, the beds are comfortable and the rooms are clean and average to moderately large sized. We were really happy with the service from the staff at the hotel, who were friendly and helpful. The breakfast is fantastic, with lots of healthy options. We had some issues with the free wi-fi on our floor, but it worked well in the lobby.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vilnius, Lithuania", "Title": "“Everything is fine except morning coffee”", "Author": "Mindaugas_Danys", "ReviewID": "UR98317416", "Content": "The hotel is adequate to it's price, maybe even better than expected. Altghough room is quite small but was enough for two of us. Staff was quite helpful, especially when it's your first visit to Barcelona. Breakfast is very good, lots of choice. The only problem is that they don't provide with drinkable coffee and black tea (only camomile one was there). So, each morning we have been bringing coffee to the breakfast room from adjacent cafeteria. Not a big problem, but still. Location was good, only one block away from the blue metro line. Pillows are somewhat too thin and hard.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“very clean and tidy”", "Author": "craignotts1", "ReviewID": "UR91739830", "Content": "A lovely little hotel, friendly staff and very clean rooms. The ones on the front are noisy due to traffic but rooms on the back are quieter. breakfast can be ordered BUT left out of the main door and on the corner is a lovely cafe. All corridors and rooms are laminate floor SO this can make it a little noisy too.. VERY clean and tidy BUT take your own kettle +tea/coffee. Theses are not provided. (milk from a petrol station opposite the cafe)..", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Quality for value”", "Author": "lostapiv", "ReviewID": "UR88006855", "Content": "We (a group of MBA) students from Ukraine had a seminar in Barcelona, so we have been in Sunotel Barcelona for a week. The classes were held in the hotel as well, and the organization was perfect !!! It is really great value for money place, plus - it is very convenient location (metro Hostital Clinic is 5 min walk). Suggestion: We did not recommend the breakfast option, as you will find many better places to eat around.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "canada", "Title": "“the only good thing about this hotel was breakfast”", "Author": "EvtCanada", "ReviewID": "UR83339831", "Content": "Stayed with my husband in September, 2010. The only reason why we booked this hotel is because it was the only thing available and affordable during Marce festival. The location is far from everything but the hotel is 2 minute walk to the subway. The room is clean with lots of closet space but small and has no balcony which is a big drawback specially when you want to see what the weather is like before going on a long day trip or just step out and enjoy a drink and watch the crowd which there isn’t a big one in that location. It has a small pool on the roof which closes at 10pm so we couldn’t use it after coming back from evening’s activities. The queen bed is made up of two single beds put together. The blankets and pillows were very thin. The beds also didn’t have a mattress, just the spring boxes which made for a very uncomfortable sleep. The hotel has 3 star rating but I didn’t find anything to account for the three stars. It was very plain and due to the lack of balcony it was like being in a sealed box. The only good thing was the breakfast. It was 8 euros/day if you reserve it when checking in. Every day there was something different and lots of variety. The front desk staff speaks good English and is courteous. I found it was overpriced for the location, the size of the room, and lack of balcony.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Wakefield, United Kingdom", "Title": "“Awful, don't bother. Checked in, checked straight back out!!”", "Author": "Dwap31", "ReviewID": "UR62382195", "Content": "Booked this hotel on the strength of reviews on Booking.com, however, they must have been about another hotel. We booked this hotel as an emergency when we were stranded in Barcelona due to the ash cloud. Found the hotel, walked into reception and started sweating it was that hot. Receptionist was polite and efficient, she said we were in a good room due to our circumstances, but we beg to differ! The room was even hotter than reception. It had a small uncomfortable bed and bathroom that needed the limescale and mould removing. The air conditoning unit in the room wouldnt actually chill the air, only circulate it. The window opened about 5 inches and wouln't stay open but this may not have been a bad thing due to the traffic noise from below. On a plus point the hotel did have a rooftop terrace that had a very small pool (don't believe the pictures) and a jacuzzi but that wasn't enugh to make us stay. We made spent 30 mins in an internet cafe and found an alternative hotel (the Barcelona Universal) that was actually cheaper and knocked spots off this one. How it could charge what it did and recive the reviews it did is beyond my understanding. We spent a total of about 2 hours at the hotel and that was 1hour 50 minutes too long. Would I go back...never. Anyone thinking about going, I would heartily recommend they thought twice.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“Value for money”", "Author": "Rouwen", "ReviewID": "UR50094476", "Content": "It is clean, safe and well located. That is all you can ask for booking a budget hotel. Even traffic noise is not too bad. Paying less than 70 Eur excl. breakfast this hotel can be well recommended. The bathroom is spacious with a bathing tube. The room floor is covered with laminate which helps to give the room its clean impression. The bed is ok. The next metro station \"Hospital Clinic\" is just two minutes from the hotel.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Good quality and good value”", "Author": "top_gooner64", "ReviewID": "UR37380219", "Content": "Stayed 2 nights at the weekend. Staff were friendly and helpful. Room was clean & tidy. Convenient location 3min walk from Hospital Clinic metro. Unlike others, did not have any problems with hot water or ambulance sirens, though Wi-fi service was v. poor.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Wakefield, Yorkshire, UK", "Title": "“Great Hotel”", "Author": "Ryanair-Jetsetters", "ReviewID": "UR32365968", "Content": "Took my Teenage son for the weekend, I had been before and had loved it. Th emain feature was a Barcelona Home Win. The hotel was exceedingly clean and was to a very high standard. There was minibar in room (take the drinks out put your own stuff in) and there was free wifi. The hotel is probably aimed at Business travellers but would be ok for a romantic getaway, due to it's high quality. It was a twenty minute walk to the stadium and about the same to placa de Catalunya. Not ideal but my suggestion is use the rental bikes that appear on standsat street corners all over the city! I paid £150 Euros for two nights which even out of season is superb value...", "Date": "June 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“An average experience”", "Author": "Stoneblue", "ReviewID": "UR29036661", "Content": "Easy access to the train station (by bus or metro and even on foot) and from there to the airport. There was construction going on on the floor above me so it was noisy during the day. Otherwise the hotel was clean and the room reasonably large and well maintained except for the ugly linoleum on the floor and the lack of a tub in the bathroom. Access to downtown was also unproblematic. So an average experience overall.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Very convenient for all the sights”", "Author": "London_fountain_man", "ReviewID": "UR26122124", "Content": "The hotel is undergoing a renovation at the moment, the restaurant is being rebuilt, so maybe this review should be considered against future ones when the renovation is complete. We arranged for transport from the airport and even though we were delayed quite a long time the driver patiently waited without fuss and there was no extra cost asked for, which was a nice touch. The reception staff were always very pleasant and, as ever, spoke very good English - we really did make the effort to utter a few words in Turkish but it was a pointless excercise. The room was very basic and small but I must admit that generally we're not too bothered about things like that as it is only a place to rest your head. Even though we're not looking for sumptuous surroundings it would have been nice to have a decent shower/bathroom - I'm afraid ours was a bit grotty. Nevertheless, the hotel is in a great position, just 5 minutes walk from the Blue Mosque, Haghia Sophia and Topkapi Palace, and 20 minutes from the Grand Bazaar - an unbelievably great location. Just a word of warning! I had not been to a Muslim country for a while and had forgotten the morning call to prayers. Can you imagine the noise at 5.30am from one of the most holiest churches of Islam. This goes on for about half an hour, you nod off and then at 8am it's all happening again. By then you're wide awake - no need for an early morning call in Istanbul.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“mixed feelings”", "Author": "Montydog", "ReviewID": "UR21927324", "Content": "+ves: central, cheap, pool, helpful staff. -ves: very noisy with ambulances turning up at the hospital next door all night with sirens blaring; located by bus stop and traffic lights there is no peace and quiet all night from traffic stop/starting and buses disgorging passengers. They moved us from 2nd to 6th floor to alleviate probelms but it did little to help. If we had not been in a group staying there I would have checked out to go elsewhere. beds very hard too - great for a bad back, lousy for a good nights sleep breakfast vastly overpriced and mediocre - go to the cafe on the street corner for twice the quality at half the price.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brazil", "Title": "“A bit expensive for what it is. But, good, anyway.”", "Author": "AdrianoAurelio", "ReviewID": "UR19874498", "Content": "I was totally based on Tripadvisor reviews to plan, choose and book three stays in a recent trip to Europe, so, now, I fell obligated in to contribute to this wonderful community. My trip was a budget one, so, Tripadvisor did a great job into help me to find great deals and stay away from traps. Sunotel is a small chain of hotels in Spain. The one I stayed (Ashton - Barcelona) was pretty ok. It is very comparable with other budget chains like Ibis or Holiday Inn, with no frills. The room haves adequate space, with a small wardrobe, a small \"office\" desk, and a small TV set. The bed was good and big. The bathroom was bigger than other budget hotels, but my shower had some problems regarding maintain the correct temperature. Sometimes hot, sometimes cold, oscillating during the bath. Not a huge problem at all. The staff was good and very friendly. They speak English with no problems. Ashton is very well located, near \"Avenida Transversal\", or something like that, which is one of the major avenues on Barcelona. It is located at about 10 minutes walk from the nearest subway station, one hour walk from some of the major attractions, like Parc Guell, the Docs and beach, etc. By taxi you can easily reach those sites under 20 minutes. Some reviews complain about noise coming from the street ahead. I really didn't hear anything. My room was very quiet and welcoming. After all, Sunotel Ashton is a good place to stay. Could be a bit cheaper to reach the same price point as Ibis. Unfortunately, Barcelona does not have any Ibis at a reasonable place (they are all far from downtown) Would I stay again in Ashton? Probably yes, specially with a little price drop. Hope my review helps you to make a good decision, like the others helped me. Adriano A. Araujo", "Date": "September 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“disappointed and over heated”", "Author": "raydenise", "ReviewID": "UR18576644", "Content": "The hotel was both clean and tidy and situated about a 5 minute walk from Hospital Clinic Metro Station.The breakfast buffet was good and had a good selection on offer. There was a choice of an english or a continental breakfast . There is also a swimming pool and sauna on the roof of the hotel. The problem with the hotel was that there was no air conditioning in the bedrooms. This was not very satisfactory when the daily temp was about 30/32. We reported this to reception 3 times but the AC unit was never working The other problem was that we had a maid that in error took my wifes night dress with the laundry and was never seen again. This was also reported but to no avail.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "York", "Title": "“Energy Conservation?”", "Author": "TheTravellerYork", "ReviewID": "UR18090486", "Content": "We chose this hotel due to its location away from the touristy areas, but within easy travelling distance of the main attractions and the Nou camp stadium, the reason for our trip, and were not dissapointed. Exceelent connections to th citys metro and the airport, whilst esasily walkable to the main attractions and shopping. The hotel was very clean and tidy and welcoming. We had a room on the fourth floor at the front of the hotel overlooking the main street. There was some noise intrusion from traffic, which does go on all night. There appears to be a lot of call for ambulancies in Barcelona, due to the constant noise of sirens. The room was spacious with a large bathroom, with bath and over bath shower. Once again very clean and well presented. Clean linen was provided everyday. The room was air conditioned, but not controllable from the room, you needed to make arrangements with reception to have it turned on, which they weer very reluctant to do for some reason. The corridors and receptioon were air conditioned all the time but not the bedroom. Our first night we couldn't have it on at all, and the second night we could only ahve it on for 15 minutes. No explanation was forthcoming. The hotel does have alovely pool sauna and hot tub with sunbed area on the roof offering lovely vies of the Barcelona skyline and providing a relaxing experience at the end of long days sight seeing. Other than the problems with the air conditioning we couldn't fault the hotel or staff, and would probably stay here again if lucky enough to come back.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Teesside", "Title": "“Get what you pay for, but lock your money away!”", "Author": "MrsSheff", "ReviewID": "UR14892778", "Content": "Have just returned from 3 nights in the Sunotel. The Hotel was as much as you would expect for what we paid/a 2 star hotel. The room was spotlessly clean, and bright and modern..... but tiny!!! The bathroom was also clean, which I have very high standards/expectations in that area, and I was happy. The staff were cheerful and helpful. As previously stated, it is only 2 minutes from the nearest metro which is dead easy to navigate, and there are plenty of lovely little bakers/places to get breakfast (for cheap price) locally. The BAD...... It is SOOOOOOO noisy. It is right on a really busy road (like 4 lanes of traffic, which seem to be an inordinate amount of motorbikes all racing away from the lights......... all night.....). There also seem to be sirens all the time, which I think is cos its near hospital. THEFT............ we didn't realise until at airport on way home, but my husband had money stolen from his wallet left in the room, and I had a bracelet stolen. Not sure whether their were safes available, but if there are use them! Overall good stay, but the noise and theft really put a downer on our stay.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Aberdeen, UK", "Title": "“Cheap & cheerful”", "Author": "gill2379", "ReviewID": "UR10746322", "Content": "For what we paid for our 4 night stay, and after reading some of the reviews on here, we were pleasantly surprised on arrival at the Sunotel Aston. Clean & tidy, staff pleasant & mini-bar reasonably priced, we couldnt complain about this in any way whatsoever... Looking very much like the UKs Travel-Inns, it had a comfortable bed, a TV & an exceptionally clean bathroom - what more can you ask for??? A 20 minute walk to Las Ramblas, or 6 Euros by taxi, we would certainly return here should we venture back to Barcelona again!!!", "Date": "November 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne, UK", "Title": "“Not value for money”", "Author": "Michael024", "ReviewID": "UR10532478", "Content": "OK so its not high end expense account but neither is its cheapness good value. The aircon just didn't work in some of our rooms and was occasional in others and the staff could do nothing. To say the bath water was hot would be a breach of trades descriptions. Worst of all the beds were like concrete slabs and as most of the rooms face onto a busy intersection extremely noisy most of the night. The rooms were no better than fuctional but were indeed clean. One plus point: the buffet breakfast (an extra 12 euros plus tax) was fine. However if you cannot find better for your money stay in Sitges and travel in.", "Date": "November 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "london", "Title": "“Birthday in Barcelona”", "Author": "acflyer", "ReviewID": "UR10486169", "Content": "Hotel is easy to find from subway line.Just 2 blocks away We stayed 4 nights,rooms were clean but very small, The air conditioning seems to be a problem, first night it did not work,after reporting it the second night it worked for an hour or so and then never worked again. Rooms at the front are very noisy due to busy road and lots and lots of emergency ambulances all with various sirens The pool is on the roof acsessed by a flight of stairs from the top floor..If you are in a wheelchair this is not for you If you should want ice for your drinks forget asking the front desk. Its better to go to the petrol station at the corner for ice.There you can buy a bag.The front desk will give you 4 lumps in a glass", "Date": "October 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Midlands", "Title": "“Great Budget Hotel”", "Author": "MidlandsBear", "ReviewID": "UR10254582", "Content": "We stayed there 3 nights from Friday to Monday. Hotel is outside the City Centre but is still in a good location. Metro stop is minutes away which can take you to the City\\Beach in 5 minutes. Hotel is clean, rooms are small but ample. We had the buffet breakfast included which is mainly continental but you can have sausage, bacon or scrambled egg. Would recommend to any traveller who wants to stay away from all the hustle and bustle of the City Centre. Definately go back.", "Date": "October 23, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "ireland", "Title": "“good hotel”", "Author": "chubbyIreland", "ReviewID": "UR10032368", "Content": "Our stay at Sunotel Aston was a very good one. The staff were very helpful and friendly,breakfast was very good with a good selection of food on offer. The hotel was very clean and tidy but the rooms were small and compact . Overall a pleasant stay and we would return in the future", "Date": "October 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Just ok..nothing more”", "Author": "celiasavvo", "ReviewID": "UR8711269", "Content": "I have just returned from Barcelona, full of memories, full of colours. The only thing that i can say for the hotel is that it was ok. Nothing else nothing more. I was there with my boyfriend and we have booked a double room..unfortunately the room was too small.The other annoying thing of the room was the air condition. It didn't work properly and as i have noticed from the other reviews it seems that everybody had the same problem! We couldn't switch on or off the air condition and our room was always cold.Besides that the air condition had a strange noise that make our sleep difficult. Despite all of this problems i have to admit that the room was very clean.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hull", "Title": "“Reasonable short stay”", "Author": "Alizz1", "ReviewID": "UR8136423", "Content": "This hotel was a pre booked offer so we did not pick it ourselves. It was fairly clean, although we did have to point out a problem area which took 3 attempts for help before it was resolved. The staff were friendly and spoke good English. The rooms are small and basic and the views are not great. Breakfast is ok, the pool is on the top floor and has a view of the city and a sundeck. (Take you own towels as only the room ones are provided.) It is a fair walk into the centre but the 'bus touristic' stop is a ten minute walk away and you can get discount at the reception. (well worth using as city highlights fairly wide spread and good value for money)", "Date": "July 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "uflgator", "Title": "“Good hotel but a walk to tourist area”", "Author": "uflgator", "ReviewID": "UR7716127", "Content": "Good hotel in a very nice area! But be aware its about a 30 min walk to Plaza Catalunya. (but a nice walk!) There is a metro stop about 2 blocks away and its very easy (and inexpensive!) to use. The rooms are pretty small but very clean with nice bathrooms. The hotel concierge spoke a little English- enough to get basic information. Barcelona is a great city and this is a good choice for a moderate hhotel (we paid 120 euro / night- seemed a little expenisive but I think its fair given hotels are more expensive in Barcelona)", "Date": "May 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Peterborough", "Title": "“Comfy bed”", "Author": "Purrina", "ReviewID": "UR6899700", "Content": "Located a couple of minutes walk from metro stop Hospital Clinic on the blue line. Room was very clean but a bit on the small side. Bathroom was well equipped with a powerful shower. Aircon does work - you need to dial 9 and ask reception to switch it on. Buffet breakfast was lovely with a good choice. And staff were helpful with directions, extra pillows etc. However there is a lot of traffic noise which can be heard even when the window shut.", "Date": "March 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kilkenny Ireland", "Title": "“Hot and Cold”", "Author": "kennymohan", "ReviewID": "UR6133258", "Content": "Went for a 3 night break and whilst the hotel was clean and good value for the price we paid it could be better. we arrived on a Saturday but on Sunday the bar and resteraunt was closed which left little scope for drink and food in the surrounding area!Arriving back on monday night at ten to midnight for a drink the bar staff were not impressed as they close at midnight. Why no resident bar?Buffet breakfast was OK but not cheap at €12.We arrived one morning at 10-45am and at 11 the area was cleared wether or not you had your buffet. All in all not bad but customer relations could be a little better.", "Date": "November 15, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Gatwick, West Sussex", "Title": "“Nice”", "Author": "beauxl2002", "ReviewID": "UR5883445", "Content": "The Sunotel was all you need for a quick break in Barcelona, especially if you intend to spend 90% of you time out in the city. Pro`s : Everything is clean Nice bakery just round the corner for brekkers Despite being the most gorgeous person in the world, my girlfriend liked to spend forever in the bathroom, it must have been excellent Con`s : Busy, busy road outside. Aircon has a mind of its own, appears to switch itself off at night so had to leave the window open with all the traffic noise. Location isn`t the worst, but can be a pain when returning late at night as most cab drivers didn`t seem to have heard of it. Ask for the Sunotel, and not the Aston, and you might get better luck. Overall, all you`d expect for the price, and when you have a city as cool as Barcelona you don`t need much else.", "Date": "September 27, 2006"}], "HotelInfo": {"Name": "Sunotel Aston", "HotelURL": "/ShowUserReviews-g187497-d543385-Reviews-Sunotel_Aston-Barcelona_Catalonia.html", "Price": "$94 - $155*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Paris 101</span>, <span class=\"locality\"><span property=\"v:postal-code\">08029</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "543385", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/dc/7e/dc7ee6afa7262cadffd87fd31a99380d6large.jpg"}}