{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Salt Lake City", "Title": "“Needs basic updating...”", "Author": "Desertbound_9", "ReviewID": "UR125805066", "Content": "We just spent a week in Villa Sacbe #103 and while the location of the unit is ideal, the unit itself needs some sprucing up. The bathroom fixtures are old.The sink doesn't drain. There are curtains over windows that look out to less desirable views. One of the blinds on the door doesn't work. It could benefit from a full size fridge that isn't full of their costly mini bar items. The unit is in the back and has it's own access to the plunge pool. It's very lush and tranquil to come home to at the end of the day. Forget trying to sleep at night because of the party zone just down the street! The music starts around 10 pm and goes until the wee hours. I wondered if they put a more sound proof window in the bedroom area if that would help. My husband used ear plugs and slept fine. I can't use them and found the constant thump thump thump quite annoying. Last year we stayed at El Taj but I found a great deal on this unit at Villa Sacbe and thought we'd try it. If you are getting a great deal on it then go for it. But it is not worth full price!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "saskatchewan, canada", "Title": "“A little piece of heaven”", "Author": "crvisitor41", "ReviewID": "UR124686477", "Content": "We recently stayed at this condo complex and rented villa #12 for a week's stay. The owner, Evelyn, made the rental process easy and fun and made sure we were accommodated in every way possible, even supplying with a cell phone(charged up) for local calls and the free use of a landline so we could call home to Canada. Eveything we needed was in the unit: toiletries, blow dryer, coffee, pop in the fridge, water cooler, access to chairs, towels and umbrellas at a nearby beach. One thing that we didn't have was mosquito repellent and we could have used it. Although the main street, 5th Ave. is only one block away, once you enter the secure gate to the condo, it is peaceful and serene, not to mention beautiful. Unit 12 is on the 3rd uppermost floor and has a lovely wraparound balcony. In the mornings you can sit out and enjoy the beautiful colorful birds flying from tree to tree in the mini-jungle behind the complex, as you drink your cup of coffee. The management company that Evelyn uses greets you on your arrival and sees you off before you leave. The rep, Laura, explained everything to us, including how to secure an extra locked gate near our condo. One more floor up is a private rooftop jacuzzi. The condo itself is clean, beautifully decorated and charming. We were provided with maid service 3 times during one one week stay. We would highly recommend Villas Sacbe and, in particular, unit 12 because it is well-situated, private and has a delightful owner who was just so much fun to deal with.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nassau County, N.Y., USA", "Title": "“Great Value Beautiful town, great service!”", "Author": "Marshall D", "ReviewID": "UR123709147", "Content": "The Villa Sacbe is the oldest of the Condo Hotels properties in Playa Del Carmen. Yet it is well maintained, well appointed, and very clean. As all the other properties, one has access to the beach club, spa, great gym, and all of the facilities. The maid service is great. Any attention needed is graciously given by all members of the staff. The website is very user friendly and very accurate. Great value for large condo/apts. 1 block form the beach and from 5th Avenue.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“The Impression Went Downhill”", "Author": "Evio_E", "ReviewID": "UR122541850", "Content": "Took couple of days to calm down so I can write a review based solely on facts, and not emotions. 1. Property positions itself as \"luxury\", which is far from the truth, I would say that on scale of 1 to 5 stars, Villas Sacbe is 3 firm ... Mind this, it was built 17 years ago, the quality of craftsmanship, perhaps, at that time was 5 stars and luxury, when there was nothing to compare to, but in 2012, it is not luxury at all, I would say it is more of an average in line with lower class inns 2. The proximity to the beach is unbeatable, I have to state that for the record, the fact that you can use Indigo Beach for free is a great savings perk - however, since it is located on the high intersection point, forget about having a peaceful enjoyment ... Indigo Beach is located in the area where fishing boats are parked, and so you know, they use an older technique of anchoring the boat - ropes, anchors, cement blocks in the water ... To compare, walking 15 minutes either left or right would get you to a better beach, with better access to the water, no boats, no ropes in the water to watch for .. I think you get the picture .. 3. Use of gym facilities - not bad, equipment is clean, in working condition, four flat screen TVs, two would be running MTV music (same channel on both screens), however the reception was not the best and it is hard to work out when the music constantly goes in and out, so we opted to working out using our ipods ... 4. Cleanliness of the room - inn level, not luxury by any means ... Towels are overused and tired; ones day we decided to eat on the patio - and noticed that the cleaning crew has left their cleaning tools and chemicals, along with a plastic bag filled with clean and dirty towels right on our patio ... Well, I have stayed in some 5+ start hotels and never ones have I seen something like this ... 5. Indigo Cafe by the Beach - food is not bad, but not your greatest either ... I can understand that they are tailoring their menu to the satisfy largely American population, but french fries on the beach? You gotta be kidding me ... And fresh juices: only two potions - orange or grapefruit ... To compare, when I was staying in Dubai, even the cheapest road cafe had an impressive fresh juice stand with you-name-they've-got it combinations available ... Can't say, however, that Indigo Cafe is overpriced ... Compared to other places, it is not super expensive ... 6. Waiters - it would greatly vary on who get to serve you ... Some speak English and some don't ... but one day the electric power went out and the waiter serving us calculated our food using a piece of paper .. all of a sudden everything was 5-10 pesos more, we just happened to order exactly the same items we did the day before, but our check was 50 pesos more ... 7. Front desk - keep in mind that if you are staying in Villas Sacbe, you are still to required to check in at Porto Playa, which is a short walk down the street ... We checked in without any issues ... The checking out, however was a different story ... Since we don't speak Spanish, it can be frustrating talking to the companies that serve English speaking clients, but don't have staff who speaks English ... We cam to the \"reception\" asking for help when we were trying to call our transfer ride to the airport ... It is too bad, I did not get the name of the girl who was helping us ... She listened to what we were after, took the number, called the company and told us that \"They are closed, but there is a cell phone number to call, try that\" ... We said, we don't speak Spanish and needed her help, as the recoding on the answering machine was in Spanish ... She called the cell phone number, spoke briefly to someone and than hung up saying that she was told that the transfer operator did not have a record of our reservation ... So much for help there ... We were not able to get hold of our transfer operator that day, and decided to wake up early next morning and try calling them again - she told us, that their recording said their business hours was from 9am-5pm ... Our flight was at noon, so we though that if we call them at 9am, we would still be able to make it to the airport fine .. So we go to the reception to check out, she greets us with a smile and says \"Your taxi driver was here at 8am, he waited for your and left, because you were not around, but if you want to, we can arrange transportation for you and that would be $150\" ... To say that I was furious is to say nothing at all ... I had to restrain myself from using profanity, but all I really wanted to say, you stupid b**ch, we were here yesterday and you knew were not able to get hold of them, why in the world did you not call the room when the taxi was there at 8am? Yes, the transfer operator and the condo are not related, but hiring an idiot to run a reception, com'n now ... We called the transfer operator one more time at 9am, and were told that no taxi was coming for us, since we missed our driver at 8am - my question as to why they picked 8am for a pick up time, not 7am, not 7:30am was left unanswered ... And to add an insult to the injury we were told \"You are in Mexico and we don't have to speak English\" ... needless to say, Villas Sacbe or any other property under http://www.condohotelsplayadelcarmen.com/ won't be having us back in the future ... 8. Last but not least - one of the contributors mentioned that proximity to the night clubs ... To provide you with more accurate picture image a street lined up with six night clubs, with Mandala Playa topping the sound system ... The party goes on until 6am, and as much as I respect others right to party, it is impossible to sleep ... To sum it up ... we paid $290 per night ... got front desk that was less than helpful .. could not sleep until 6am ... not a hint of luxury if you ask me .... the only positive outcome of this trip was that we now know where we don't want to stay on our next trip to Playa del Carmen, 'cause we absolutely loved the place minus the boutique-condo experience .. Thank you for reading, hopefully it will help others to make an educated decision ...", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Amazing vacation”", "Author": "Ausra B", "ReviewID": "UR119418823", "Content": "\"“Villas Sacbe is a luxury boutique hotel in Playa del Carmen, surrounded by tropical greenery and charming ponds. It was such as discovery for us to stay at this property, which is also ideally located – just a step away from the main pedestrian 5th Avenue with all the restaurants and bars! Villas Sacbe is perfect for a romantic getaway – you get your own suite with a living room, private terrace and a bedroom, surrounded by tropical plants. We also got free access to Beach Club and gym. Amazing, cute property!” ..Raminta is typing ....", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A wonderful vacation”", "Author": "Lauras G", "ReviewID": "UR119153050", "Content": "My wife and I decided to experience Villas Sacbe, a beautiful boutique condo-style hotel in Playa del Carmen. What a pleasant surprise! First of all, you cannot beat the location. Situated right next to the main pedestrian 5th Avenue with all the restaurants, cafes and boutiques, Villas Sacbe is at the same time its own quiet and pristine tropical oasis, surrounded my lush greenery, fountains and a pool. Moreover, the value of this condo is also unbeatable. For the price of one hotel room, we had our full suite with a large living room, modern kitchen, marble bathroom and bedroom, with the services of a 5-star hotel, including pleasant daily maid, security, front desk and concierge. It was our romantic home away from home! We usually do not right hotel reviews, but I felt we had to share our experience… condo hotels it’s such a wonderful concept. Thank you for a wonderful vacation.", "Date": "October 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Stayed as part of our honeymoon”", "Author": "HouseLover77", "ReviewID": "UR115908386", "Content": "My husband and I stayed here for three nights and four days after a 6 day touring trip of Mayan ruins of the Yucatan peninsula. Our studio was was on the top floor and could not have been more lovely. All rooms have a nice size balcony which is big enough to accommodate a hammock and looks directly towards the ocean. The room was very clean and well maintained daily. Be aware that the sun will definitely find its way into your room as the rooms have this small colored window near the ceiling that does not have a cover, but who wants to be in bed when the gorgeous beach is right in front of you! The hotel does not it's own drink or food service, but the one next door did and was happy to accommodate those who wanted items. One can walk to others nearby, too. There was someone giving massages on the beach under a netted area which my husband thought was great (paid the equivalent of $40 US). There are people selling cloth & leather bracelets on the beach which are cute, but there isn't supposed to be any soliciting on the beach...Definitely check out the main drag of shops and restaurants, though walking a few streets back will get you better beer prices and opportunity for more \"local\" eateries. My husband speaks Spanish so we had an easier go of things, but most of the hotel staff do not speak English. Even the front desk person was a bit off, but this area is so much better than \"American\" Cancun that I didn't mind. This area is/was visited by more Europeans, but now its at least 50/50 if not more North Americans. I suggest taking the boat over to Cozumel which is easily accessible. Don't count on a big swimming pool experience. The pool is more like a fountain separating the hotel into halves. Definitely go back, though. Oh, and highly recommend taking the bus from Cancun airport. Drops off right in the middle of Playa del Carmen.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect Condo for a vacation”", "Author": "sherryd777", "ReviewID": "UR115856331", "Content": "the condo at Villa Sacbe was just perfect...it had everything that we needed...I would definitely stay there again when I go back to Playa", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Superb Service, Accomodations and Ammenities”", "Author": "tntdmuf", "ReviewID": "UR115322743", "Content": "We just returned from our stay with CondoHotels at their Villas Sacbe Property. Unit Number #101 and I am scouring the travel sites for last minute deals to return before the end of the month. Villas Sacbe is a small property and our unit #1 was beautiful. It is a one bedroom with double doors that open up to a spectacular garden and babbling man-made pond/fountain...and just around the corner is the whirlpool that flows over a small waterfall into the private and secluded pool. It's the perfect oasis after enjoying the multitude of amenities offered to every guest of condohotels. We spent our days at sunrise wandering the streets of 1st and 5th avenue then out to the beach to say good-morning with a yoga class on the beach in front of Indigo Beach club and then Breakfast at Indigo. A small rest and then off to The Gym, another amenity offered to every guest!, to work the bod for a little while; then it was off to the Indigo Beach club for the day to play in the water, the pier, the beach and enjoy the most luxurious beach club in Playa del Carmen where every need is catered to immediately. The menu has offerings for the decadent and the calorie conscious...I especially enjoyed their \"house specialty\" flat bread with veggies, chicken and goat cheese. YUM! and their french fries are to die for..hehehe. After we had exhausted ourselves of Beach fun and activity it was back to Villas Sacbe for a break from the hustle and bustle to nap, chill, take a dip in the poll and ready ourselves for the next adventure. The condo was cozy and comfortable. The maid service is impeccable and the towels are plentiful and luxurious. We have been going to Playa for years and adore the city, but Villas Sacbe is where we always return. Villas Sacbe and CondoHotels other properties Maya Villas, Porto Playa, El Taj Oceanside and El Taj Oceanfront have no rival in the city for comfort, beauty, service and amenities offered to their guests. The service is impeccable from the time you make your initial reservation until you check out after your stay. The staff is friendly and extremely capable and responds with lightning speed to each and every whim of their guests. If you want to feel like a \"rockstar\" on your next vacation look no further. No detail is missed.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“A beautiful oasis!”", "Author": "somewhere2goplease", "ReviewID": "UR104094623", "Content": "Let me start by framing the reviewer. We are a middle class family from the KY with two teenagers (14 and 16) who typically stay at medium priced hotels like the Holiday Inn or Country Inn when on vacation. Since the kids had never been to Mexico and I had never been to the Yucatan, I was looking for something that felt like Mexico w/o exposing them to high risk situations. There were so many places to choose but we ended up picking this place based on reviews from this website. Actually, we thought that we were staying at the Maya Villa Condos but realized only later that we were staying at one of their other units (Villas Sacbe). The condo was located on 1st Avenue just 1 block from the beach and 1 block from the main tourist area of 5th Avenue. The main staff spoke excellent english and were very helpful during our stay. You first enter the condo via a locked gate where a very friendly security guard stood post about half of the time. Once inside, you find yourself in a make believe world resembling more jungle than condo. There appeared to be about 12 units covering 3 floors all surrounding this little piece of paradise. Each unit had a balcony facing the courtyard area with tables and chairs. Our unit (no 107) had two bedrooms separated by a nice-sized living and kitchen area. It was the perfect size for a family of 4 with nice furnishings and upscale baths. The pool was small but very enjoyable. It looked more like a stream running through the courtyard but felt really good on those hot days. I have read numerous conflicting comments regarding the noise at this and other hotels in the area. We stayed here 4 nights and experienced a different level of noise each night. In general, this is the biggest downfall to staying at any of the hotels near 5th avenue as the nightclubs are permitted to blast their music at ultra high volumes until about 4-5 am. That said, we left the AC fan running each night and could barely hear anything in our unit. As a result, it didn't keep any of us up. By day, the unit was so peaceful and secure feeling. It was nice to have unlimited filtered water in the kitchen and I am glad to say that none of us got sick while there. The daily maid service was fantastic as a family of 4 can sure mess up a place with towels, sand and dishes. The unit included access to the Indigo Beach Club. This is basically a reserved section on the beach with comfortable chairs, couches with fresh towel and drink service. The beach near the club is very nice but not the best place to swim due to numerous fishing boats tied there. The best swimming would only require a walk in either direction of a 100 yards or so. Overall, this place was a perfect oasis for my family. I would not hestitate to stay here again.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cuyahoga Falls, Ohio", "Title": "“Location, Value, Beach Club! Why stay anywhere else?”", "Author": "HnYMnR", "ReviewID": "UR89370283", "Content": "We rented condo #3 (103 on the website) for one week during December. Got an amazing deal from one of their website promotions! This place is about a block from the beach, and a block from 5th avenue. The condo we rented had absolutely no problem with noise as the last reviewer stated. We like to retire early and were never disturbed by the nightlife. The condo hotels have all the benefits of a hotel and condo rolled into one. The unit had a kitchen, free parking, a gym membership, FREE beach club access, free \"all you can drink\" bottled water, and a very helpful concierge. I cannot overstate how great the free beach club access is. You stroll down one block to the beach, and there it is. The Indigo beach club. Give them your towel cards (you get them on checking in), and pick out a chair, beach bed, or just take your towels and go where ever you want. If you decide to chill in the beach club they'll offer you drinks or food but you have no obligation to accept. You can sit there all day, not drink or eat, no charge! It's perfect if you prefer to explore other places for lunch. The condos are great, with usable kitchens. The maids are extremely meticulous and deserve tips. The concierge speaks perfect English, and is very knowledgeable about the area, how to use the bus, etc... The pool is small but nice for a quick dip if you need to cool off. The condos are great for couples, romantic indeed. I would not hesitate to recommend this place to a friend.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Hong Kong, China", "Title": "“If you like loud Music, this is the place for you.”", "Author": "k00lj", "ReviewID": "UR70096971", "Content": "We booked the Villa Sacbe for the 30st of June till the 5th. Luckily we only stayed there for one night. The villas are located next to some dance clubs. You can enjoy the pumping music all night long in your bedroom or on your patio. When we stayed there we had construction next door, so at night the music keeps you awake, and the next morning the construction workers hammer you awake. So do ask about this before you confirm your booking. When we checked in we got a unit with a double bed, instead of the King bed that it was advertised. The complex is managed by different owners, our villas where managed by the Porto Playa hotel, one block up the street. They have 4 units in the complex, all ground floor. Luckily we only stayed for one night and moved to the main hotel/condo complex after.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Amazing honeymoon at Villas Sacbe # 12!!”", "Author": "JulyPlayaWedding", "ReviewID": "UR36996029", "Content": "We spent a week in unit # 12 of the Villas Sacbe during our honeymoon this July. The experience was an extremely pleasant one from the outset! Evelyn, the owner of the unit, was quick to respond to our emails, very friendly and highly professional. We received all the necessary information regarding our stay well in advance and were put in contact with the property manager in Playa del Carmen. Evelyn sent us a document detailing all the features of the unit, there was even a list attached with her recommendations for the best spots to visit in Playa. We arranged to meet up with the Property Manager on the day of the Check-In and the handover went very smoothly. The representative Monika showed us around the unit and explained everything to us, leaving her contact details in case we had any queries. The unit was absolutely beautiful! It was impeccably furnished and spotlessly clean. Such detail had been paid to equipping the apartment with everything a guest might need during their stay. We were welcomed with a complimentary bottle of wine and breakfast utensils had been left in the kitchen for us - it instantly put a smile on our face. The Jacuzzi on the rooftop was amazing, and we greatly enjoyed our extended breakfasts outside on the porch overlooking the property's garden! As for the location of the unit - you can't beat it! Within 2 minutes walk we were at the famous \"Quinta Avenida\" or down at the beach. Two large grocery stores were within 15 min walking distance, although there's a little store right beside Villas Sacbe that stocks some of the more basic groceries. The maid stopped by three times and each time she left the unit looking perfectly clean and tidy, we were extremely happy with her work. There was also a friendly security gard outside the property at night, so we had no concerns regarding safety at all. We can highly recommend this unit to everyone planning on visiting Playa del Carmen! We have been to Playa many times before and this has definitely been our most enjoyable stay!", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Exceptional stay in Villas Sacbe #12”", "Author": "PghTravelers51", "ReviewID": "UR34165147", "Content": "Outstanding property! We stayed at Villas Sacbe (unit #12) for a week in early June, 2009 and it was everything we imagined (based on all of the rave reviews) and much, much more. From the moment we were picked up at the airport to the time of our departure, the owner, Evelyn, and the property management staff, namely Mikaela, made sure that we were completely satisfied every step of the way. We have traveled extensively in the US and Europe, and our experience with these folks is among the best we’ve had anywhere. Upon arrival at the condo, we were greeted with a complimentary bottle of wine and a welcome basket of breakfast items so we wouldn’t have to immediately go to the grocery store. The condo and the grounds surrounding it are beautiful and spotlessly clean. One of the nicest features is the private rooftop Jacuzzi and loft along with the lovely terrace and balcony that overlooks the lush and well-groomed garden and pool area. It’s absolutely gorgeous and very romantic. The location is also perfectly situated within just a few blocks of the beach, restaurants, shops and nightlife, and about a 15-minute walk to the grocery store. A car is definitely not required, but we did rent one for a couple days to go exploring, and the secured on-site garage made parking very convenient. While it is always wise to be aware of your surroundings in any unfamiliar place, we did not have any concerns for our safety during our entire stay, including the many evenings when we ventured off 5th Avenue during our nightly walk to area restaurants. Given our love of food, we were thrilled with the list of restaurants (especially with the included commentary) that Evelyn provided to help with our selections. With her help, we enjoyed some wonderful meals, going off the beaten path and dining amongst the locals and other well-informed tourists. There was only one downside of our experience in the condo. It was very hot during our visit and the air conditioning unit struggled to keep the kitchen and living room area of the condo cool, although it did help with the humidity. While the bedroom and bathroom areas were very comfortable, we did not use the other rooms much on some of the hotter days. This was not much of a drawback, however, since we did not go to Playa to spend our time sitting in front of the TV. And true to form, when Evelyn found out about the warm conditions, she was upset that our visit wasn’t perfect. She’s written to us apologizing, and indicated that she’s looking into another air conditioning system to solve the problem during the hotter parts of the year. We had an exceptional week in Playa del Carmen and will definitely return to Villas Sacbe #12 in the future.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“A relaxing oasis at the hub of Playa living”", "Author": "WembleyDweller", "ReviewID": "UR27507198", "Content": "My wife and I stayed at Villas Sacbe #12 for 2 weeks in March 2009. The security-gated condominium is on 1st Avenue between the beach and pedestrianised 5th Avenue and between 12th and 14th streets. It just couldn't be more central. #12 is a penthouse unit with air conditioned living accommodation (bedroom, bathroom and huge living area with fully equipped kitchen) at second floor level and private rooftop terrace with jacuzzi and access to a loft area beneath a thatched roof (palapa) with sofa bed and separate lighting. There is a wrap-around balcony with casual seating which means that you can find shade at pretty much any time of day. There's also a series of pools running through the complex, not huge but perfect for that hot day dip when you can't be bothered to stroll to a beach bar. For those hiring a car it has its own underground car park. Staff are totally efficient and always smiling. The Canadian owner is a complete pleasure to deal with. Swift, accurate answers to queries - nothing seemed too much trouble. Thank you Evelyn. You can people watch all day at the beach bars, swim in the clear blue Caribbean, visit any number of Riviera Maya attractions or just browse the shops on 5th Avenue. Expect to be accosted by shop owners and taxi drivers after your business but unlike some parts of the world your smile and a \"no thank you\" brings a smile in response. Mexico smiles!", "Date": "April 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Absolutely beautiful complex - But beware of #2”", "Author": "Dallas_Traveler3", "ReviewID": "UR19995671", "Content": "This is an absolutely beautiful condo complex. The landscaping and pool are well maintained and create a very tranquil environment. The pool is small, but is great for lounging and is terrific for small children. We originally booked Unit #9. The owner was terrific to deal with and her condo is truly first rate. It is decorated beautifully, has a great balcony, and contains many DVDs, books, beach toys, etc. After our first day there, we met the couple who was staying in Unit 2. They had booked Unit 9 for their first week in Playa and had loved it. They had to move to Unit 2 for their second week because we had had already reserved Unit 9 for that period of time. Unit 9 is a one bedroom on the second floor and Unit 2 is a two bedroom on the first floor. The couple loved Unit 9 so much that they offered to trade rooms with us. Because we were traveling with small children, we agreed to the trade because Unit 2 is much more utilitarian in nature (although very nice) and because it would give us an additional bedroom for the kids instead of them sleeping on the huge sofa in Unit 9. I can see why Unit 9 would be better for a couple. It is well decorated and has a romantic ambience to it. Unit 2 was great, but is not nearly as well appointed as Unit 9. We enjoyed our stay tremendously and checked out at the same time as the other couple. The property manager inspected both rooms upon our leaving and found everything to be in order. When we returned home, the owner of Unit 9 promptly refunded our security deposit. I later learned from her that the owner of Unit 2 was refusing to refund the security deposit of the couple that we traded with. Not because of any problem with the condo or the rental terms, but merely because they had traded. Basically, he was banking on a technicality and refused to refund their deposit for that reason only. The owner of Unit 9 graciously returned the couple's deposit to them because she is an honest, responsible owner that understand the value of repeat business. The owner of Unit 2, however, appears not be as scrupulous. While Unit 2 was nice, I would not recommend that anyone who books it be very careful in dealing with this owner.", "Date": "September 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Awesome Location.”", "Author": "GTHPTraveler", "ReviewID": "UR12916479", "Content": "My wife & I stayed here for 2 weeks in November 2006. We had no problems booking on line, very friendly, helpful staff, always there if we needed anything. Close to everything, a block from the beach & the Parrot and then a block the other way from the clubs, shops & resturants of 5th Ave. Quiet, secure (keyed gate entrance from street), clean, beautiful as you see it in the pictures, that's the way it is. We stayed in 10, top unit full kitchen , stand-up shower, king bed, A/C, safe, private gated jaccuzi on the roof & beautiful deck to sit out and relax if you wanted to. I can't wait to go back again and stay there.", "Date": "January 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Loved it!”", "Author": "honeymanseattle", "ReviewID": "UR8661968", "Content": "This property was such a gem to find. We stayed in Playa for one week in November and everything about the Villas was lovely. We stayed in Villa #9 and it was filled with all the amenties we could ask for. Full kitchen, patio, and the cleaning staff was great! The Front Desk Manager, Fernando, was the greatest host! Very friendly with lots of suggestions. He made our stay wonderful!", "Date": "September 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Villa Sacbe is Wonderful!”", "Author": "jmeng", "ReviewID": "UR6832028", "Content": "My husband and I and another couple stayed at Villa Sacbe in February for 10 days. From the moment we stepped out of the airport to our waiting shuttle it was a perfect trip. Fernando checked us in and gave us a map to the city with fantastic recommendations on food, water activities and nightlife. We couldn't have been more impressed with the service we received. I work in the Hospitality industry and I saw nothing less then true hospitality. Paulina was our maid and she did a wonderful job of cleaning the condo each morning. The outside patio was nice in the evening and our neighbors came to visit. We also enjoyed the fact that when we walked out of the front gate you were in the heart of all that Playa had to offer,1 block from 5th Ave and 1 block from the beach. I would highly recommend these accommodations to anyone traveling to Playa! We are looking forward to our next visit!", "Date": "February 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Perfect. We loved it.”", "Author": "sljmay", "ReviewID": "UR6642425", "Content": "My husband and I stayed in villa 12 the first week of January and had a great time. The villa was well equipped with everything we needed. We walked up the street to Super Walmart to get groceries one day. It was a long walk, but worth the money we saved. We were also able to purchase our tequila and wine there. It was nice be be able to make our own meals when we wanted to. The villas are centrally located to all the shops on 5th and easy access to the beaches. There is nightlife all around during the evening hours, but suprisingly the noise in minimal once you're inside your villa. We found the best beach to walk to was north on 1st ave, called Mamitas Beach Club. We hung out there a couple of days and rented a beach bed. It's a good beach location if you want to avoid the hotel tourists at Porto Real. Villa Sacbe is a great option if you like to be independent and live like the locals. You won't be surrounded by tourists or large families and your not sucked into an all inclusive deal where you have to eat gross hotel food. There are plenty of restaurants to try out on 5th avenue in all price ranges so be adventurous.", "Date": "January 22, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "North Carolina", "Title": "“Loved Villas Sacbe and villa #6!”", "Author": "Donnaluv2cruise", "ReviewID": "UR5617655", "Content": "We absolutely loved Villas Sacbe. The cleaning people came in everyday except for Sunday and kept it really clean. We really enjoyed hanging out on the rooftop balcony with wet bar. The villas are nicely spaced so you don't have to worry about being super quiet. The furniture was comfy, and each bedroom had a TV. There was no washer and dryer, but a laundry 2 doors down. The management didn't highly reccomend it, but we found the laundry service to be fine for a few pair of shorts and tee shirts. Done in 3 hours and cheap. The villa is centrally located to the beach and all the great restaurants. On the corner of 1 & 12 there's a great mexican pottery place if you're looking for something unique to take home. We also enjoyed the beach bar on the end of calle 12. El Pirita? Great margaritas and guacamole! 2 for 1 cervezas, too. We would highly recommend the Villas Sacbe.", "Date": "August 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Great Service, Luxury Accomadations”", "Author": "ACruzRamos", "ReviewID": "UR5559151", "Content": "We recently got married in Playa Del Carmen. Villa Sacbe provided the perfect place for our family and friends to stay during the festivities. The management and staff--from Absalon at the front desk, to Maria the cleaning woman--exceeded our expectations. They accommodated every need we had, including the Rehearsal Dinner held in Villa 10, complete with 60 people and a private chef! We rented three villas in all (villa 10, Villa 6, & Villa 12). The accommodations were clean, modern, and luxurious. The location is close enough to all the hip bars and clubs, but far enough to keep it quaint. We can’t say enough about the quality of services we received at Villa Sacbe.", "Date": "August 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very Romantic”", "Author": "A TripAdvisor Member", "ReviewID": "UR5429607", "Content": "Stayed in Villa 12 for a long 4th of July weekend. This unit has its own private plunge pool on the roof - with views of the Sea. Also a small loft room accessable from the rooftop pool area is good for getting a bit of shade when using the pool. Property is extremely well maintained. All of the employees were very friendly and helpful and speak English. Biggest plus was that we were able to take our Yorkshire Terrier with us. It can be difficult to find places that will allow him. Note that this is a 12 unit complex that runs at capacity most of the time - but you would never notice as it is very peaceful. We are already checking availability so we can return. Perfect location - 1 block west of the beach and 1 block east of the 5th Ave. shopping/eating. To those who have complained about the cancellation policy - you need to read the rules before sending your money - you should not have been surprised that you could not get a refund - that is what trip insurance is for.", "Date": "July 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Absolutely Perfect for our Destination Wedding”", "Author": "urbansugar", "ReviewID": "UR5380339", "Content": "I'm almost afaid to let everyone know how amazing this place is because I'd hate for it to become so popular that it's always sold out, but I feel compelled to share this secret hideaway since we had such a great experience. Anyone planning a destination wedding or even a family reunion in Playa del Carmen should definitely consider the entire Villas Sacbe complex because it give a feeling of being in a little village all to yourself. The grounds are beautifully landscaped and condos are kept really clean (the daily maid service was awesome). Each condo is tastefully decorated using local handicrafts and materials, while being completely modern, cozy and stocked with everything you'll need to feel right at home. My guests kept thanking us for choosing such a beautiful place for everyone to stay. Since most of us were for for about a week, we went grocery shopping and took advantage of the fully-equipped kitchens. My unit #6, had a rooftop terrace with an outdoor bar and grill so one night, we barbequed up there. It was so much fun! One of my friend's units even had a rooftop plunge pool with an ocean view. Incredible! The location provides convenient access to 5th Ave. nice restaurants, bars, and shops. What's also great about their location is that even though it's in the city center, it's quiet and peaceful once you enter the property. It was nice for our guests to be able to walk around town and explore without having to hire taxis to get around. Another convenient amenity was the free underground parking because some of us had rental cars and street parking is hard to find. Planning a destination wedding from the States can be very challenging, but the extremely helpful staff, who all spoke English, were eager to help us with anything we needed. The property manager Donna and Absalon went above and beyond our expectations by helping us plan a welcome cocktail party in the pool area, complete with catering, decorations, bartenders and DJs. They even helped us book a tour company to take a big group of us to Tulum to check out the Mayan Ruins, beaches and a couple cenotes. Believe it or not, they even helped me order my wedding flowers directly from one of the best florists in town, saving me hundreds of dollars. Fernando and Egenio, who worked the front desks and were also eager to help with everything from directions, transportation arrangements and even translating for us when we needed it. They even helped book transportation for our wedding party to get to the church in a really nice air conditioned van. Villas Sacbe has definitely raised my expectations of what a vacation should be like. We will definitely return, probably for our 1st year anniversary!", "Date": "June 24, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Stroud, England", "Title": "“Fantastic”", "Author": "A TripAdvisor Member", "ReviewID": "UR4772950", "Content": "My family stayed at Villa Sacbe over Christmas. It was fantastic. Our Condos were all really great. They had fully equiped kitchens with puried water. The cleaning service was also execellent. One night we hired Louis the chef. He cooked some of the best Mexican food I have ever tried. Some people may be disapointed by the size of the pool. It's very small, mostly for kids. But I would definately recommend these condos!!!", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "1", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4251770", "Content": "Great condo and location but front desk are very unhelpful. This condo development is close to the beach and all the restaurants--basically in the centre of it all. The development itself is lovely. We stayed in Condo 10. The bedrooms are a little small. Clean and well kept with brand new appliances and a great rooftop terrance. Nice Mayan decor gives the place character. However, don't go expecting a pool--it's more of a \"dipping\" spot that an actual pool. Also, the front desk people are completely unhelpful--whether it's restaurants or booking a car, you'll have to figure this out on your own (it's easy to do this but would be nice to have some customer service at the condo). Compared to our stay at the Deseo Hotel earlier in the week, the office staff at this condo appeared not care at all about their guests. Would go back for the luxury of the condo and the location.", "Date": "December 19, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ocean City, New Jersey", "Title": "“Loved Villas Sacbe”", "Author": "Zydeco9", "ReviewID": "UR4233576", "Content": "We stayed at Villas Sacbe Nov 20 - 24. It's a charming hotel - very well maintained and has a lot of character. We rented Villa 9 - very clean and looks exactly as the photos on the internet. Full kitchen with all the appliances necessary for cooking. 1 block from the beach - we walked to Mamitas beach which was very pristine. Quiet complex, very relaxing and close to everything. Great rental for the price.", "Date": "December 12, 2005"}], "HotelInfo": {"Name": "Villas Sacbe Condo Hotel and Beach Club", "HotelURL": "/ShowUserReviews-g150812-d545850-Reviews-Villas_Sacbe_Condo_Hotel_and_Beach_Club-Playa_del_Carmen_Yucatan_Peninsula.html", "Price": "$140 - $296*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1a. Avenida # 4, entre 12 y 16, Col. Centro II. CP</span>, <span class=\"locality\"><span property=\"v:locality\">Playa del Carmen</span> <span property=\"v:postal-code\">77710</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "545850", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/13/6f/136f22007401ad859d6f89bf6bc3a79e1large.jpg"}}