{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Basic, clean accommodation for cheap”", "Author": "Nancy L", "ReviewID": "UR126508286", "Content": "I came from Philly to LA to run the marathon this past weekend so it was important to stay somewhere inexpensive that could guarantee a stress-free and restful couple of nights prior to the race. This place did the job. Be forewarned, you will get the bare minimum here (like no bedside lamps!). Everything is outdated, the WiFi is temperamental, and you will be hard pressed to get a smile from the staff. However, none of those factors made the stay here bad. At the end of the day I had a clean, comfortable bed and a spot-on 4 AM wake up call. For under $70/night what more could I have asked for?", "Date": "March 22, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "두바이, 아랍에미리트", "Title": "“Old but seems lots of people stay”", "Author": "Solios", "ReviewID": "UR125627866", "Content": "Don't expect anything because this is a cheap lodge then you'll be happy. :)", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boise, Idaho", "Title": "“Helpful”", "Author": "Mohammad H", "ReviewID": "UR124993276", "Content": "Did not stay at the hotel much. We were away most of the times. However, I forgot my mobile phone at the hotel when I checked out. Later, I called the hotel and a hotel employee named \"Zia\" was very helpful and kind enough to agree to send me my mobile phone back to where I live (Idaho). Waiting for the phone now. Out of gratefulness, I am giving a 4 score. :)", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Quito", "Title": "“The rooms and location will be nice”", "Author": "Nikolay M", "ReviewID": "UR123721384", "Content": "I stayed at this hotel for 4 nights and enjoyed it. The hotel staff is helpfully and nice with the guests. The rooms are spacious and clean, the hotel is changing the carpet, the refrigerator was spacious and there are a desk. The hotel provides free internet access. I am in Los Angeles for business and I received that I expect for the price. The breakfast is basic, It contain: a cup of coffee, bread, cornflakes with milk and glass of juice is it enough for me. Good luck visiting Los Angeles, haaa¡¡¡ the Hotel Location is very good and of course is on budget.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Guastalla, Italy", "Title": "“Cheap motel”", "Author": "Alessandro B", "ReviewID": "UR119658245", "Content": "The motel is 20 min from LAX and closed to Beverly Boulevard. The receptionist is not kind. The rooms are not clean and i stayed there 6 nights and no change of sheets. The breakfast is poor, some donuts, milk coffe and oranje juice. The structure is from the 80s so it's not new. The price-quality is ok. But for the same amount of money in the States you can find higher quality motels. There is a small swimming pool but it's directly on the parking. So no fun. It's not the best place to relax and to stay comfortable.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cocroaches......... Rude staff....really horrible experience”", "Author": "Rachael D", "ReviewID": "UR119395732", "Content": "So Ive been travelling all over the world and i'm pretty laid back....i also dont normally write reviews as i dont mind a bit of dirt or if something is not perfect but we checked in to this motel and i always ask for a room upstars as there are less insects...anyway i was sat on the bed when a huge cocroach ran out from under the bed....i was a bit grossed out but decided to try catch it..... until i pulled the cover back off the bed and found loads of little lice looking things crawling all over the sheets....I have stayed in some awful places in vietnam and never seen anything this bad, so i went down and said at the desk that i was willing to stay there if they could move me to another room which they refused to do and they also refused to give me a refund so we had to leave and pay for another room in another motel! DO not go here", "Date": "October 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“fine for the price”", "Author": "niknak H", "ReviewID": "UR118253359", "Content": "Me and my husband stayed here one night as we were going out in Hollywood, live in the burbs and wanted to relax and have a few drinks. I booked this before seeing all the awful reviews, but it was fine. Whilst I appreciate that other travellers may have had a worse experience than us, I felt I had to provide some balance and respond to some of the criticisms. For $61 incl tax, I think it was fine. Yes the decor is dated (70s/80s), but you can't expect stylish at this price at this location. Our room was clean, bed comfortable with clean sheets, towels, shampoo and soap. We arrived around 7.30pm on a friday and had no problem getting a parking space outside our room. Staff on reception were polite and were happy to direct us to an ATM and call us a taxi. Lots of useful tourist info in the lobby. We came back to the hotel around 2am and didn't have any problems with safety but surely you should be careful almost anywhere in LA at night? We didn't have the included breakfast. Not atmospheric, romantic or a treat, but fine as a place to crash. We will probably use it again.", "Date": "September 18, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Southern California", "Title": "“Major problem with the hotel.”", "Author": "Rosemary50", "ReviewID": "UR117942824", "Content": "We had stayed in November. We called the next month to ask if they had rooms available but did not make a reservation. They charged our credit card for the night! Our bank had to dispute the unauthorized stay. If you stay there, pay cash or you can regret it later.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“a tip”", "Author": "Runo_20", "ReviewID": "UR115554125", "Content": "For al,l those who got victimized by prepaid reservation on this hotel, my frriendly tip for you is \"Do not ruin your vacation by staying just because you already paid them instead DISPUTE!!! with your credit card company. This hotel doesn't deserve to get a penny for their lousy service, freakishly nasty rooms, scary neighborhood!!!Do not be tricked by pictures!!!There's more to it than meets the eye! definitely not kidding!", "Date": "July 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“I booked rooms in advance and when we arrived they told us they don't have it for us. Receptionist was rude!”", "Author": "Hupcus", "ReviewID": "UR115254593", "Content": "We arrived to the hotel before 1pm and receptionist told me that check in time is @2pm but if I want he can give me room straight away for extra 20usd. We decided to wait until 2. When we came back the same guy told me he has no rooms for us!I booked this rooms 2 months in advance via booking.com.(group of 7 people, 2x double bed) He was trying to give me one room with 3qeens and one single room. I told him I booked two double beds and he said that he has no rooms like that and that he can cancel my reservation... ?!?! after 30 mins o argueing with him I said I am going to complaint he told me ha has those rooms for me and we can take them. He couldn't answer my simple question How come he has those rooms now... Please stay away from this place. Ps: \"breakfast\" was really poor.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Chandler, Arizona", "Title": "“NEVER stay here”", "Author": "eicats", "ReviewID": "UR115143248", "Content": "This is a disgusting hotel! We booked two nights online. Upon entering our room, it smelled terrible. There were stains on mattresses, blankets were old, stained, and had cigerette burns. There were pipes exposed in sink area, and paint chipping off bathroom walls. Our children inspected the pool and came back to say they would not be swimming as it was dirty. The continental breakfast was a joke. It consisted of a box of donuts that were already gone when we arrived. We called the hotel front desk within the first hour of being in our room to say that we would pay for the first night, but because of the condititions we wanted to cancel our second night, and booked a hotel elsewhere. They refused to refund our money for the second night. Do yourself and your family a favor and NEVER stay here!!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "San Diego, California", "Title": "“\" Our Nightmare\" please don't stay here..free thieft service!!!!!!!!!!!!!!”", "Author": "Unhappy711", "ReviewID": "UR115071107", "Content": "I really don't know where to start, but this place is the most unsafe place I had ever been. First bad thing in this real story is that one of our rooms we got had this really bad smell like wet carpet but mix with pine sol just to hide the odor..well we ask for another room and at that time he had no problem and change the room.. but at the same time the room service lady was very upset because she got in trouble and ask me what was wrong and all I said I did not like the smell of it and sorry for getting you in trouble, but she was mad and started spraying something all over the room and said how do you like now... next thing I did check the other room where my daughter and friends were staying and somehow the room was kind of scary and dark it might sound stupid to you but instead of a bible or something to read was a pentagram and 666 draw inside the drawer.. well this is only the first incident, next day before we leave we ask for no room service on none of our rooms to this person passing by not knowing he was the manager and he said he will take care of it, but he didn't they still got in and stole my son's nintendo DSI with game and charger!! for sure there was no room service but there was thief service.. no forced entry and the manager was very rude and not responsible about all this. We end calling the police, officer ask to see the video and it was denied because manager was not there, but that was only excuses because before police got there the manager was in and out from the video room and that was our only prove of evidence, I just wonder what was he doing there??. Next day we had to get out and got half of our money back. But really this place turn our nice weekend into a big nightmare.", "Date": "July 6, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Not good...at all!”", "Author": "Annmarie67", "ReviewID": "UR114765298", "Content": "I'm not realy in the habit of leaving bad reviews but I just couldn't help myself with this hotel. We stayed for 2 nights at the end of June 11. Hotel looks good from the outside and the staff seemed friendly enough. We are two women and were asked 'so why only one bed?', bit cheeky if you ask me. We replied that it was the cheapest option on the website we booked through and were told they could give us a twin room for no additional cost. It was terrible. We are not fussy, we only wanted somewhere in a good location that was clean, but the celing in the bathroom had big chunks of paint peeling off, the room had not been vaccumed and my friend found a hair (we are both blonde and it was dark) on her pillow, in addition to this the mattress of my bed was sagging below the bed frame. The next morning we had a phone call at 7:45am from reception saying that we needed to chage rooms as we were given the room in error. After arguing for a few seconds we realised it couldn't be any worse than the room we had already been put in so agreed to move to another room which was much more comfortable. What was annoying though it that rather than the staff apologising and explaining that the room should not have been offered to us, we were told we had to move rooms without apology or explanation. Apart from this though the staff were friendly, although we did hear other people complainig (without an apology being offered) and they let us leave our suitcases in the hotel for the rest of the day after checking out. After eating muffins for brekfast for 2.5 weeks beforehand the doughnuts and cornflakes were a welcome suprise. Also the no 14 bus stops at the bottom of the strett which can take you to the tube/ metro station and then that can take you to hollywood, universal studios, and union station etc.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "los angeles", "Title": "“DO NOT WASTE YOUR MONEY”", "Author": "mccrackenbush", "ReviewID": "UR110113896", "Content": "When i arrived the room smelled of mold. I gave the hotel the benefit of the doubt and assumed it hadnt been occupied in a while. The next morning when I was showering I discovered the root of the mold stench: MOLD GROWING ALONG THE ENTIRE BATHROOM CEILING AND DOWN THE WALLS!!! I immediately brought this to the attention of the desk clerk as I am highly allergic to black mold. He offered me medical assistance (which is grossly unnecessary), asked what he could do to make it right, and when i suggested he refund a portion of my bill he got very rude with me. NEVER AGAIN! Great location, but black mold can kill people!!! Photos have been taken, and the health dept will be contacted! Also, the \"high speed internet\" is a JOKE and pool had much trash at bottom and was unskimmed for what looked like days!", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Nice Hotel! You get what you pay for ...”", "Author": "FelipeSM", "ReviewID": "UR108232484", "Content": "Nice Hotel. The room was clean. Have the metro only 15-20 min walking. The staff was always very nice and helpful. Just have a poor breakfast. Excelent price!", "Date": "May 14, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0", "Rooms": "1", "Value": "1", "Location": "1"}, "AuthorLocation": "california", "Title": "“dont use this motel”", "Author": "eliongirl", "ReviewID": "UR105957567", "Content": "The staff was rude the room was dirty, the beds were hard as if I was sleeping on a rock, the pool was dirty and I paid for a night and only stayed 4 hours in this room. I would not recommend this room for anyone with children. I even had to pay for ice....... terrible motel would not recommend it to anyone....not worth the money We stayed at motel 6 in inglewood and it was better then this motel by a land slide.........what a waste of 80.00", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“No complaints”", "Author": "sunni_6", "ReviewID": "UR94494261", "Content": "We stayed at the hotel in May. We ware looking for the cheap hotel close to Hollywood and comparing 4 or 5 hotels around the area this came the best for the price .The rooms ware big, the bathroom was clean, and the bedroom floor was not perfect but acceptable. The stuff at the desk was very nice as we have a problem with a delivery. They allowed us to use the telephone for free as we needed to call FedEx to sort out the problem. We choose a quiet room with a city view and were really nice in the evenings. The location is good if you have a car .The hotel offers a free parking. The breakfast is basic, donuts and coffee, serial and milk, juice.Has small swimming pool we did not use. It is good for a short stay .I just could advice the management to put some more effort into cleaning the rooms and the whole place.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dumfries, United Kingdom", "Title": "“A cheap, no frills hotel that I'll stay at again.”", "Author": "johnsh70", "ReviewID": "UR91302060", "Content": "I had my doubts about staying here after reading a couple of negative comments and the fact that it is one of the cheapest hotels in LA. I was very happy with the place as it was clean, quiet and well located to downtown LA, Hollywood and the freeways. The surrounding area is mainly residential so not a lot of options for restraunts, clubs, etc but only a very short drive to the busier areas. You get what you pay for and I was very satisfied with this hotel. If you're just looking for somewhere to sleep then you really should consider this hotel.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Great place to stay”", "Author": "Rosemary50", "ReviewID": "UR87228786", "Content": "We stayed at this hotel and enjoyed it. The hotel staff is professional and helpful to guests. The rooms are spacious and clean, the refrigerator was spacious and had a counter on top. There was a table with two chairs and a desk. The hotel is above the street and the rooms were quiet. We will stay there again.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sweden", "Title": "“Okay stay”", "Author": "Sony46", "ReviewID": "UR82304835", "Content": "But the neighbourhood was a little rough. We had a car. I would not recommend anyone to walk around in any bigger circles alone in that area. Good room. Ice machine on the outside. Free internet, free breakfast (not that good).", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lubbock", "Title": "“great place”", "Author": "LubbockTexas", "ReviewID": "UR79431120", "Content": "very nice clean rooms nice pool comfy beds enjoyed my stay.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "los angeles, CA", "Title": "“Why waste your time?....”", "Author": "Paddy_mcg", "ReviewID": "UR72285177", "Content": "Dont stay here if you expect at least some level of common courtesy from the desk/admin staff, working wireless internet (at any speed), a room that doesn't fall apart (faucet falling off, walls peeling and other generic disrepair etc) and a breakfast promise that delivers cornflakes with warm milk in a foam bowl at best.....what a way to end an otherwise brilliant holiday.....", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "ca", "Title": "“Its awful”", "Author": "rnikki", "ReviewID": "UR70428650", "Content": "Dont waste your money coming to this place. It is very very low grade. You should not make the mistake i ve made and booked with money up front with no agreement for a refund. The room I have been provided is dirty with broken tiles on the floor.Shower parts coming off the wall. The room has a mould smell that could not be removed from the noisey AC. I cannot tell you how unhappy I am now that I have spent my money. The mananger is not helpful at all. The whole site needs knocking down and starting again. It is delapatated beyound repair. The tv has the worse reception I have ever seen and I have travelled all over the world.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "turlock", "Title": "“It was so bad we had to make a joke out of it to make it better.”", "Author": "momo5303", "ReviewID": "UR65977875", "Content": "This place was not the worse place I've ever stayed at, but its really close! The beds were comfy and the water was hot and they had a swimming pool, but thats where the good ends. Our bathroom had tons of mildew, there was trash underneath both of the beds, cigarette burns everywhere, people carved on every surface there was(beds, mirrio, entertainment center) our phone didn't work to call out, but the front desk could call us. No radio/alarm/clock radio of any sort. no directory, hotel info or bible in the room. we stayed 3days and 2nights and never had our room serviced. had to hunt down the laundry person to get more towels. They said they had free wi-fi but we never used it because the guy at the desk wouldn't give us the password over the phone. I wouldnt ever consider them again.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Alberta", "Title": "“ewwwwwww”", "Author": "AlbertaCrazycanadian", "ReviewID": "UR60100259", "Content": "I am wondering if I should start a new career as a hotel inspector?? you know just like they have food inspectors...because this one needs to be inspected and disinfected and rejected....never again will we be back but I can assure you if there's a person in my life that I don't care for, I would DEFINATELY reccommend this place!!!", "Date": "April 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "California city, Ca", "Title": "“Our Vacation with our 7 year old at Universal Studios”", "Author": "lap69", "ReviewID": "UR59187188", "Content": "We went into the motel at 11:30am thinking we may be able to get our room early....since there was only around 5 cars in the parking lot and our son had to use the restroom badly. The guy at the front desk said no we couldn't, than we asked if we could use his bathroom and he again said no. We said okay we'll come back. I said theres no rats here is there (i'd read there was in the reviews) and he said yes, we are in LA. What? Are you kidding. the room was okay....comforter was stained...garbage under the bed! As for breakfast it was corn flakes or a donut. Hubby is diabetic so he didn't get to eat. Would not stay again but if you don't care about non-friendly service and garbage under the bed than this is the place for you.", "Date": "March 22, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Las Vegas", "Title": "“Our stay was marvelous”", "Author": "mnaelasvegas", "ReviewID": "UR58225017", "Content": "After reading all the negative reviews we were a little reluctant about staying at the Hollywood Inn. The hotel is nothing like it's described to be in the reviews. The staff is very friendly, the rooms are roomy, and were very clean. It's close to downtown and there's fast food places within miles of the hotel. We were there for two days and enjoyed our stay.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "miami", "Title": "“good experience with this hotel”", "Author": "solange463", "ReviewID": "UR54205475", "Content": "i recomend this hotel because is very clean and quiet place, this hotel is located in a good area, the guy in front desk is very polite everything that i need he always was there to serve us.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Heerhugowaard", "Title": "“Do not stay here”", "Author": "Hotel_Advisor_HHW", "ReviewID": "UR46035065", "Content": "Mostly I am not so negative about hotels/motels, but this is horrible. The district in which the motel is, is not quite good. The breakfast is nothing: just coffee, orange juice and donuts. No friendly staff, they arranged us a very expensive taxi (not a regular one, but one of his friends with a big car, so no taxi meter and he charged us way too much). Subway is 25 minutes walk.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "mexico", "Title": "“STAYED 1 NIGHT, CHARGED ME 2 NIGHTS! DIRTY THIEVES!!!”", "Author": "vipecha", "ReviewID": "UR39700153", "Content": "I booked this motel on the web. In the pictures it looked fine, but believe, in reality it's awful. My wife got depressed when we arrived becaude we were going to stay there 3 nights. They told me it was impossible to cancel the reservation and won't return my money. I got into the room and used my laptop to cancel 2 nights because we were already in the room. I told them several times: you are going to charge me only tonight, because tomorrow we're gone. Anyway I returned to my country and when my credit card bill arrived I was shocked to see they charged me 2 nights!! By any means, don't stay there! Ugly neighborhood, horrible and dirty hotel and worse service!!!!", "Date": "September 3, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Location": "2"}, "AuthorLocation": "Fayetteville, AR", "Title": "“Don't Stay Here! Terrible Dirty Rooms and Service!”", "Author": "tjhawki", "ReviewID": "UR36195211", "Content": "the front desk guy told me I lied when I said I didn't get internet--reffused to fix internet access. Had to drive to a grocery store to use the internet. The walls looked like someone rubbed feces on it. The room was very dirty. The chairs(looked like greese) and bedding had stains. When we first arrived, the room wasnt even ready. I would not recommend it, at all. I have stayed at better places for lower prices.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "miami", "Title": "“Overall was great”", "Author": "hellomia", "ReviewID": "UR36152227", "Content": "The stay was awesome. This hotel was in a great location and had a clean room. The staff helped us and showed us how to get to all the attractions. The room was big and clean and the internet was very helpful.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "santarosa,ca", "Title": "“great deal”", "Author": "Napa_caHappy", "ReviewID": "UR31053254", "Content": "it was nice and clean place for the price i paid,good service and great location.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Germany", "Title": "“Cheap but dirty place to stay overnight”", "Author": "shenn1801", "ReviewID": "UR22396076", "Content": "Do not expect too much from this cheap but dirty place that can be regarded rather as a motel than as a hotel. Many of the past reviews, however, seem to be exaggerated: We did not find any bugs, nor was it too loud (anyway, noise only can be attributed to the guests not to the hotel itself). We liked the parking facilities, the central location but also the size of the room. Obviously some people having reviewed this place tried to save a lot of money but at the same time expected to stay in a standard or even luxury place. This, however, is completely unrealistic when considering the low price. So if you really want to save money or just a need a place to stay overnight, you can go there. If you want to enjoy your stay in LA or relax in a hotel room do not.", "Date": "December 2, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Frankfurt", "Title": "“Not as bad as everybody says!”", "Author": "tanro", "ReviewID": "UR21693436", "Content": "The Hollywood In Express South is not a five-star hotel but it not as bad as many of the reviews say, either. We stayed there for two weeks (two adults, one child) and found most of the the staff members quite friendly. The pool is small but nice, the rooms are not luxurious but spacious and well-equipped. The beds and the bathroom were perfectly clean. After a while one gets a little sick of donuts for breakfast but again, for that price one can't expect a big breakfast buffet. For a change one can try the great Brooklyn Bagel Bakery just around the corner, and there are a few fast food places within walking distance. The rates are certainly good, the location is convenient and we would definitely consider coming back!", "Date": "November 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“Credit Card Fraud”", "Author": "HppyTravels", "ReviewID": "UR17478561", "Content": "Despite all the negative reviews on here, we decided to give this hotel a try. We booked the room on Bookings.com one month prior to our reservation date. We called the night before to confirm and we were told we had one room w.double beds non smoking confirmed. When we arrived to check in we were told we did not have a reservation. When we presented the clerk with the printed conformation, he tried to tell us we had booked it for the wrong date. we pointed out to him the date he was refering to was the date we booked it, but he still said we had no reservation. We sat in the parking lot trying to figure out what to do when he came out again and said he could \"accomodate\" us in a smoking room. we decided to take a look at to see if the reviews were right before we decieded. The first thing we noticed in the room was an overwhelming smell of after shave. I immeditely checked the bed sheets and found them torn and a few black stains on them. the door had what could only be described as severe termite rot. We took this lost reservation as a blessing and got the heck out of there. We discovered on our credit card statement the next day a charge for $98 dollars from this hotel. I called to ask to speak to the manager and was told he was a \"busy man, he has 5 hotels you know!!\" i should have known with the \"NO REFUNDS-DONT EVEN ASK\" sign upon entry. Now im dealing with my bank to dispute the charge and calling trying to contact this runaway manager. I wonder how could i be charged for a room they had lost our reservation to?????? DEFINTLEY do not book at the hollywood inn express south... unless you want to pay for not even staying there.", "Date": "July 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Plano, TX", "Title": "“Regret my stay here”", "Author": "GuiV", "ReviewID": "UR14020009", "Content": "We were on a three day trip to LA, and we stayed at this hotel or 2 nights. Due to bad planning, the whole LA trip was a dissappointment, and the pathetic conditions at this hotel was the last straw. Let talk about the hotel first. The couch, chairs and comforter was stained and very dirty. we were scared to use them for fear of contacting some illness. In the bathroom, there was no dispenser/holder for toiler paper, and the tub wouldnt drain quickly enough. The room had a very strong smell of detergent when we entered, and I had to keep the windows open for about 20mins to make it bearable. The staff are friendly/rude depending on whom you talk to. Atleast one person gave me the wrong information regarding a city tour I booked through them. The hotel is situated in a neighbourhood, that is desolate after about 10.30pm, and made me feel unsafe. So if you dont have a car, make sure you are home by 10.00. Although, since it was my first time in this city, I might have been a little paranoid about our safety. Better be safe than sorry. The breakfast is nothign but some bagels and coffee, and you'd be better off eating out. But unfortunately, there are only fast food places available in near vicinity. There is no coffee maker, fridge or microwave in the room. Given the location, maintenance, unclean rooms, bad breakfast, I dont think its worth paying $80 for a room in this hotel . This is just \"cheap\", and not \"cheap and value for money\". Pay a little more and stay someplace closer to hollywood. Now about the whole LA trip. From my incomplete research, and talking to a few friends, I though it might be possible to avoid renting a car in LA and see the city using public transport. One reason was to avoid commuting in LA traffic, and also to avoid the hassle of finding a parking spot everywhere I go. I was partially right and wrong. The LA Metro rail is quite useful in certain areas of the city like Hollywood blvd, Universal studios etc. But if you want to visit Santa Monica beach, Beverly hills, Rodeo drive etc, be prepared to drive a car. Everywhere you go, you have to pay some $20 for parking. Luckily, we signed up with a city tour, and they took us around to many places which we couldnt access through the Metro rail system. We booked flights that used Burbank airport instead of LAX, and saved time from and to the airport. But you cant reach Burbank by metro rail. I read somewhere that its possible to reach LAX using metro. If I were to visit LA again, I would rent a car while I am there. For some places, I would still use the Metro rail.", "Date": "March 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Worest places I have ever stayed”", "Author": "hills168", "ReviewID": "UR13585781", "Content": "This hotel is even worse than any low developing countries. Dirty room and rude service. What is poorest hotel in LA? come to get the answer.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not as bad as others say”", "Author": "AussieFilm", "ReviewID": "UR13448389", "Content": "This isnt the massive hole in the ground everyone else has been saying. Its a one star hotel in LA that is just that, one star. If you want more go somewhere else. I had no issues at all (I never had breakfast so cant comment on that). Its clearly not a great place but its fine. It is what it is. A cheap hotel. Others may have had bad experiences but I stayed two nights and had no complaints. One advantage is its close to the Metro red line(15mins walk). But the food options nearby are crappy. Fast food pretty much.", "Date": "February 11, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "sl21", "Title": "“don't even think about it”", "Author": "sl21", "ReviewID": "UR12932121", "Content": "a representative on phone got me this hotel and I truly suggest stay away from it. Its the most horrible hotel I have every stayed in my 9yrs of US life. The bedsheets are torn, carpet smells and sounds while you walk, rude staff, not even sufficient toilet paper. when I went told the guy in reception about toilet paper, he is like...\"oh is it? Take this\" thats what was the answer. I vacated after my first night stay though I booked for three nights. NEVER EVER STAY", "Date": "January 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Arizona, USA", "Title": "“Adequate but convenient”", "Author": "loosebrick", "ReviewID": "UR12271902", "Content": "If you are planning a trip to Hollywood/Universal Studios and want a fairly cheap stay and value for money, this is a reasonable choice - quick easy access to Hwy 101 and only 10-15 minutes to Kodak Theatre, U Studios and the Hollywood sign (and 5 minutes from the Charmed House!); It takes about 20 minutes or so to Rodeo and a little longer to Santa Monica but my Garmin got me there easily, fast and direct!. The room and bed was clean and no sign of bugs (as I have seen reviews complain about) but walls were a little dirty and drywall was cracked in a few places. On the down side - room had no coffee maker (coffee only at breakfast), no microwave either but there was a community MW for use (a bit of a joke really) and it seems you have to ask for extra toilet paper. It does have a fridge. The breakfast donuts were not appetizing at all. Staff friendly for the most part, depending on who was staffing the front desk. I would stay here again if I couldn't find better digs for the price. The neighborhood is not great but when you're on vacation and the sights are Hollywood, etc, you don't wander the neighborhood anyway so it shouldn't really be a factor.", "Date": "January 2, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“serious dump”", "Author": "xtinasf", "ReviewID": "UR10209670", "Content": "I have friends that live in LA and I usually stay with them. But this time around my boyfriend and I decided to rent a hotel. We actually booked a room at the Hollywood Inn North, but to our dismay we were re-routed to Hollywood Inn South due to a power outage. Hollywood Inn South is located in the GHETTO. Even some of the hotel guests were scary! If you don't plan on renting a car, do NOT stay here. But if you are going to visit LA, I suggest renting a car as public transportation is not easily available and you need to take the freeway in order to get anywhere in LA. The hotel itself is VERY deceiving from the outside. The guys at the front desk are all disgruntled and I don't like the fact that they photocopy driver's licenses and passports. I asked what their reason for this was and all the guy could say is \"just in case someone's looking for you\". HUH? I didn't understand that, but it definitely made me a bit paranoid. The INSIDE of the hotel room was DISGUSTING. There were workman boot prints on the sheets! The bathroom had mold ALL over the walls. The room itself had stains on the walls. It looked like somebody picked their nose and wiped their big sticky boogers on the wall. There was one by the head of the bed which my boyfriend covered up with a sticker. And of course the sticker was still there when we left as housekeeping is NOT on top of things. The so-called \"clean\" bath towels had pubes and stains on them. *shudder* I felt like Hotels.Com ripped me off for even offering this hotel. This was more like an hourly motel.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Texas", "Title": "“The Worst!!!!!”", "Author": "mikeh33", "ReviewID": "UR8073857", "Content": "This is by far the worst nastiest horrible discusting hotel motel I have ever witnessed. The customer service is garbage and the rooms are the same if not worse. STAY AWAY!!!!!!!", "Date": "July 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“\"I really loved it!!!\"”", "Author": "allyrocks", "ReviewID": "UR7477670", "Content": "I really enjoyed my stay at this hotel! It is a family owned Hotel, and they really made me feel comfortable...The view of Downtown is nice; also this hotel is centrally located so I was able to walk around and I also felt safe. The staff is very courteous, and I had access to the internet anytime...My only complaint is that the pool was not heated...but I still went in it! The water was very clear and clean. I was able to ask the staff anything at anytime, with pleasure. For the price, I strongly recommend this Hotel!!!!", "Date": "April 27, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "los angeles", "Title": "“Keep Going & Don't Ever Stop!!!”", "Author": "nikkidlovely", "ReviewID": "UR6796813", "Content": "My stay was less than enjoyable(to say the least). First off, there's a $10 key deposit (may make sense to some, but a first for me). Second, although the overall appearance of this motel is okay, the inside was not. There were disgusting markings on the floor, wall, and doors (nothing a little time & elbow grease couldn't handle but who can determine what it is?!!!!). The mattresses were terrible and covered with stains. Our toilet paper was out upon arrival (what is that?!). The floor looked worn and dirty, and I could not bring myself to take a bath in th e tub. To be quite honest, I could not bring myself to touch anything in that room! Needless to say, our stay there was suppossed to be much longer, but I couldn't handle the place. Upon check in my qouted rate was different from the actual rate and they pretended to 'do me a favor' with the pricing, despite the fact they were advertising rooms at a cheaper rate in the traveler's magazine. Anyway, I wouldn't recommend the place unless you don't care about any of the forementioned 'unique qualities' of the place. If you do happen to go by, ask for the 'advertised rate'----whatever that may be that day!!! But if you're smart, you won't even waste your time or money here.", "Date": "February 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Not how it looks...”", "Author": "clr37", "ReviewID": "UR6597770", "Content": "Overall the room was nice and comfortable however there was no hot water (and it was freezing outside), the internet connection barely worked and when it did it took forever for the pages to load, and the continental breakfast they claim to have is not really that. It consisted of a few donuts and terrible coffee with powered cream and sugar (no sweet and low or equal).", "Date": "January 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“Not too bad for price!!”", "Author": "Daila35", "ReviewID": "UR6571806", "Content": "Husband and I stayed for a week . Hallways could've been better but we didn't stay in the hall. Room was decent and clean, pool wasn't bad at all. Will stay again, husband and I are planning another trip this year.", "Date": "January 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Davis", "Title": "“Cockroaches in room”", "Author": "RoxyM", "ReviewID": "UR5504600", "Content": "I strongly advise you not to stay at this hotel. I've stayed there for 3 nights, and found 3 cockroaches in the room plus the bathroom. The bathroom seem very dirty, and the staff's service was neutral.", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“It was Fun, convenient and Cheap”", "Author": "A TripAdvisor Member", "ReviewID": "UR5298766", "Content": "Friendly staff, helpful website Cleaned ever two days, we stayed for 9 days, and got a good deal. Internet is near the office, just ask for it. Microwave is there, free breakfast is more like for an emergency, near public transportation (bus), not far from the subway, Only drag was that there was no Voicemail, and the place didnt take messages at all, which we didnt know for several days. So if you weren't there, you didn't get the call. Check out Brooklyn Bagels, though, just around the corner... jalapino bagels and lox cream cheese really rocked! Worked for us!", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Stowmarket, England", "Title": "“Got out as quick as possible.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4689937", "Content": "Well it didnt bode well when the taxi driver who took us here advised us that this was not an area for tourists, we arrived and were asked for $10 for the hotel room key and TV remote control. The hall ways were grotty and the room the same, the mattress was stained badly, we took our most valuble items and set of to find a better hotel; we walked but this as it turns out is not advisable, we were concidering flagging down a police car to help us vacate the area because we didnt see any taxi cabs (our own taxi that took us to the hotel departed quickly from the area). We were glad to find the Marriott and got a taxi to collect our other belongings, the driver said \"he wouldnt stay there for nothing\".", "Date": "March 18, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Manchester, England", "Title": "“oh dear”", "Author": "A TripAdvisor Member", "ReviewID": "UR4153135", "Content": "all the reviews were right, only it was too late as i had already booked in, as i was applying for film school in LA with family and my dad booked without reading the reviews or concidering the area! there were cockroaches in the rooms , not just one, but a colony of them, one which crawled out of my pizza box while i was eating! the hallways smelt really bad, non smoking rooms had burns in the sheets! the sheets smelled really bad and i dont think were changed during my weeks stay, the area is really rough and downtown LA and isnt a place you want to walk around night or day. The toilet was blocked when we first entered our room, but was sorted quickly. The noise from the car park was terrible, i felt like i was in a rap movie, with cars crashing and loud shouting and police sirens! the pool sits deserted and i dont suggest swimming in it. The owners photocopied our passports which is slightly strange and according to another review illegal?! there is a bus stop near by to get you out of alverado as quick as possible this is the hotels best feature. do not stay at this hotel!", "Date": "November 29, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Rooms": "3", "Value": "3"}, "AuthorLocation": "Madison WI", "Title": "“Agree that this place isn't too great”", "Author": "A TripAdvisor Member", "ReviewID": "UR3742593", "Content": "I stayed here a few days looking for a cheap hotel while at a conference since the conference hotels were really booked. Here are some reasons why the place is less desirable: * Run down neighborhood (as noted in previous comment) * The hotel desk has a glass panel in front of it * I had to pay a $10 deposit to get a remote control for my TV. The remote only had about six buttons on it. * The TV only had ~10 channels. Two of them were very graphic porn channels. * To get an idea of the neighborhood, there were signs that said that you cannot have any guests come to your room. * The wifi reception was very poor in my room (I realize that this can be fairly normal...)", "Date": "August 7, 2005"}], "HotelInfo": {"Name": "Hollywood Inn Express South", "HotelURL": "/ShowUserReviews-g32655-d549441-Reviews-Hollywood_Inn_Express_South-Los_Angeles_California.html", "Price": "$58 - $103*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">141 N. Alvarado St.</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90026</span></span> </span> </span> </address>", "HotelID": "549441", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/ca/34/9e/hollywood-inn-express.jpg"}}