{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect for hollywood location”", "Author": "kobeman", "ReviewID": "UR125425958", "Content": "Good location .good rooms for the right price William.. @ fornt desk gives perfect directions too HOLLYWOOD sign.WIll be back.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing place to stay at.”", "Author": "Antwoine86", "ReviewID": "UR125231728", "Content": "Great location. This hotel/motel is located in the middle of the city which occomodated my busy travel schedule. Clean rooms. Most importantly great customer service. I was checked into my room by William with very welcoming service. I'll definitely come back!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tucson, Arizona", "Title": "“What a dump”", "Author": "Bob_101_10", "ReviewID": "UR120613885", "Content": "This hotel is not in the better areas of town. It is old and run down.. The rooms are very, very small; not much larger than a postage stamp. No microwave, refrigerator barely cooled with no temperature control, tv only worked sporatically. Parking is the biggest issue. It is very limited and shared with a restuarant next door. If you drive anything larger than a compact, you are in trouble. Would not stay here again.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Dirty Hotel and Unethical Management”", "Author": "JRichey442", "ReviewID": "UR120510948", "Content": "Paid for five nights through Orbitz. Upon arrival, found my room noisy (person next door drilling and banging on walls), bathtub backed up with water and mold. Asked for another room and none available. Asked for refund and told to contact Orbitz next day. Was never able to get refund, owner never available. Went back second day to get another room and clerk refused to give me a room (they still had my payment for 5 nights). Had to sleep in the park that second night! Went back third day and was given a room. Tried to get refund for the one night they refused to let me have a room and was unsuccessful. Asked desk clerk to call taxi for me day of checkout and he called a taxi that charged a $50 flat rate (normally a $15 fare) to the bus station. This is the worst experience I have ever had at a motel.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Buenos Aires", "Title": "“One week in LA”", "Author": "Ale P", "ReviewID": "UR118470499", "Content": "Great bang for the buck. Excellent front-desk by William. Good security.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“A-OK for the price”", "Author": "DowntownSteve", "ReviewID": "UR117947687", "Content": "Free parking and wi-fi, pool, reasonably clean. This is on the lower end of LA hotel pricing structure. Not bad for the $77 including tax that we spent on this place. Staff was nice. We got there around 11pm and asked the guy behind the counter about late night dining options, after spouting out some chain joints, I asked if there might be something more locally owned or ethnic, he suggested Western Chicken around the corner, turned out to be quite a nice little surprise. Back to the hotel, it's cheap, so don't expect the world, while parking is free...it's T-I-G-H-T! Not complaining, just sayin'. The room was pretty clean, a little dinged here and there, but to be expected for a hotel in this price range in LA. Ironing board and iron in the room, frig and hair dryer too. Neighborhood slightly sketch, but not scary or anything, just not the trendy part of Sunset, still a very convenient location--lots of things to do close by. The ice machine was broken while I was there, turned out not to be too big of a deal as the 99-cent store across the street carries ice for a buck! Sweet! All in all, not bad for an LA cheapo hotel.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "West Hollywood, California", "Title": "“WORST HOTEL EVER!”", "Author": "MYSTICDEE", "ReviewID": "UR116044958", "Content": "I booked three rooms for entire family. I had to asked three times for towels until finally I went to front desk to DEMAND some towels and he told me he gave some towels to the other rooms (we were supposed to share). Also had to ask for an iron in which I received same response - not every room gets an iron! When I finally got the very thin cheap towels, some of them were literaly brown! The room had a stinky sewer smell and now I am afraid to sleep under the comforter....I would not here for even half the price of $40!!! UNBELIEVABLY POOR SERVICE! Also, half of the safety mechanism on the door is gone! I will pass on the breakfast as well!", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Galway, Ireland", "Title": "“Average budget motel, no significant problems.”", "Author": "katelin_87", "ReviewID": "UR111194343", "Content": "We stayed here for 5 nights. Upon check-in, the woman at the front desk told us she had no record of our reservation (which we booked through hotels.com). She told us we had to take it up with them, and did not offer any other assistance. We ended up having to call them in the lobby via Skype! We ended up sorting it out, but we thought service could have been a bit more helpful. Our room was average. It could have been a bit cleaner, but the bed was clean and comfortable. There was a slightly bad smell in the room that we occasionally noticed. The towels were old and shabby and didn't dry your skin. Soap and combined shampoo/conditioner are in dispensers. As always in motels like this, bring thongs to wear in the shower as you can never be sure that the floor is 100% clean. The location is also average. There are many Thai restaurants in the surrounding area and a dollar store and bakery across the street. There is also a bus stop right out the front. The #2 bus takes you up towards Hollywood Blvd (approx. 15 mins) or to Downtown LA (approx. 45 mins). A bit sketchy outside at night. I would recommend paying a bit more to stay at a better hotel - we would not stay here a second time.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Amazing motel, great location and greater staff!”", "Author": "Alison32655", "ReviewID": "UR90528229", "Content": "I came to Hollywood with my husband and children to this motel and was very pleased with my experience. The clerks, especially Anish, were very friendly, welcoming & helpful. They helped us find the local attractions and recommended a great restaurant for my family and me. The rooms were also extremely clean and presentable. I can't wait to come back to Hollywood and stay and this wonderful establishment again!", "Date": "December 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“rude service, unhelpfull, not a nice experience”", "Author": "Natalia075", "ReviewID": "UR84401833", "Content": "We arrived a little after 2 and was told not to come back until they were ready for us to check in. Once checkin in at 4 we noticed we got two crapy little pillow that we laughed at. my boy friend went and asked for more, once he finally decided to get out of the office and go to the room that was next door, he then takes the pillow back to the office and calls us to come get it when he was only next door and we were standing out the front of our room. Getting the pillow from the office, we then relise we only got 1.... and it was just as bad as the others... This motel SUCKS... the area is ok and close but if you dont want thai or asian cuisine for food then you must drive to get out of the area. It's dirty, the pool may as well be a sess pit. This is were customers on hotel.ca and trip advisor should be stoked that they can read reviews cause it's bad ones like this that make me sure never to stay in a motel like this again..", "Date": "October 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Hungary, Budapest", "Title": "“For one night OK”", "Author": "hrefa", "ReviewID": "UR74218701", "Content": "We were here only for one night sleep. The room was not so clean, other guests were not looks like very suspect. The breakfast was one soft drink and one cookie. The staff was very rude with us, I dont know why.", "Date": "August 7, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Not bad..”", "Author": "jsjhines", "ReviewID": "UR71095693", "Content": "Our room was small and needed a little maintenance.. quite worn.. Room clean and tidy.. Close to Hollywood and local restaurants were good.. Sign up direct with their website.. as an ABVI Club Member and get the best rate!!", "Date": "July 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "DC", "Title": "“In all fairness although I got Scabies, they did give send me a full refund!”", "Author": "DcVacationRentals", "ReviewID": "UR58227306", "Content": "Plus they paid for my medicine and doctors co-pay! BUT, I STILL HAVE THE SCABIES AND I AM HAVING A VERY HARD TIME GETTING RID OF THEM!!! If you stay here, it's a chance you will have to take to save money.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Your basic faded motor inn”", "Author": "tobeginwith", "ReviewID": "UR52992633", "Content": "I got dumped here after being turned away from Hollywood City Inn (even though I had a pre-paid hotels.com reservation!). I was assured it was comparable in quality; it was not. The room was clean but very small and had a very sweet and smelly sanitizer odor that was irritating and probably covering up am even worse stench. I had to keep the a/c on at all times to keep \"fresh\" air coming in.. The inn's neighborhood is sketchy as evidence by the reception desk - it's behind bulletproof glass like a bank teller window! Still, for the price (under $70) it's probably one of the better faded motor inns in Hollywood. You get a basic room with free wifi and coffee and danish in the morning. The parking is free, but the lot gets crowded. Skip the skanky swimming pool behind the building. It looked like it was there for show, not for actual use. My advice: check out Hotwire or Priceline and go for a 3* hotel at a similar price (bid $65). Even if you have to pay for parking and the internet it's worth it.", "Date": "January 9, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Alabama", "Title": "“Beware!!!”", "Author": "skelsmith", "ReviewID": "UR32272587", "Content": "I am not sure, but I believe there was some \"strange\" activity happening around us during our stay. The rooms were small, and we heard a lot of \"commotion\" from the other rooms around us. This included, a lot of people using their key-less entry to set off their car alarm horns (a lot!), followed by showering in several rooms, and more \"commotion\" (all night long- which we could hear very well from downstairs- probably until 6 am). When I asked for a possible late check out earlier in the evening (on the last night of our 3 night stay), I was told no....then the night shift guy offered me an extra 10 minutes, then said maybe we could work something out for 15 more minutes.... He initially told me I needed to check out at 10:30...30 minutes before the posted 11:00 check out time, that is, until he realized I was an \"actual traveler\" (if you don't know what I'm getting at, I am girl, but not the type that pays for hotels by the hour...pretty offended). I was confused and thought he was joking with me- until later when we heard what was going on in the rooms (all) around us. I finally got him to agree to a 12:00 checkout (but they called at 11:00 the next day to see if we were leaving!). I pointed out that we were flying out of town the next day when I asked for the extended check out time, and the tone of the conversation shifted, I think at that moment he realized he surrounded us with the \"party\" that was to come (which we were not a part), and felt bad. I don't want to presume anything, but I would not suggest staying at this establishment if traveling with family, if you want to get some sleep, or if you plan to stay on a Thursday night (was definitely the worst of the 3)... I'm no stranger to cheaper/bargain motels, but this one actually made me scared to leave my room at night, and gave me nightmares about the activities that might be going on around us. Perhaps we just stayed during a \"special\" night, but it is one we will not forget. If you do stay, try the right side. Also, rooms smaller than pictures make them look. On the plus side, decent cable, free internet, and they have mini fridges. Also, reasonably priced- I guess, a risk you take. Although located on Sunset, quite a ways from the tourist sites- you might want a car (that is, if you can handle driving in the insane LA traffic), we are young and pretty well-traveled, but didn't want to walk at night around the area-not that there was much within walking distance. The Coke machine was completely empty, but it is across the street from a 99 cent store. Shower was decent. The sounds of the people surrounding us really just ruined it for us, and the smells that entered our room...pretty disturbing. Not sure how this place got so many good reviews, must really just depend on the night you're there. Not a relaxing place after a 2,000 mile drive....I have never reviewed a hotel, but I feel it is my duty to tell others of our experience. I just don't want to see a family with children go through what we did. Hopefully, this was a one time experience and is not typical of this establishment. It did make for a good story...", "Date": "June 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Maryland", "Title": "“Great value and location; fully acceptable”", "Author": "Rick_EMT", "ReviewID": "UR31873561", "Content": "I stayed here for several night in June 2008 and this property was fully acceptable given the price paid (about $70/night for 2 people). Free parking, central location close to all the LA and Hollywood attractions, relatively safe, walking distance to the Red Line metro at Hollywood/Western. Rooms basic but comfortable. Very good budget choice for this area.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great for the price!”", "Author": "Wisconitraveler", "ReviewID": "UR20945580", "Content": "More than acceptable for the price! I wasn't to sure what to think about the motel before I got there, so I just went ahead and made a reservation. So to my suprise, when I pulled up to the motel and found that the area was very decent with plenty of food options, and the motel itself looked nice, my worries faded some. Upon getting checked in and heading to my room, I was once again pleased to find that the room was actually quite nice. I had reserved a king bed room, and the extra ammenities that came along with the room (which I believe are standard for all rooms) were very nice. The room had a fridge, microwave, computer desk with a lamp and all the other standard things. It seemed as though the room had been remodeled somewhat recently, with nice tiling in the desk/sink area, as well as in the bathroom. One thing I was completely blown away by, was the comfort of the bed! For seeming like such a midscale motel, the bed was extremely comforatable. The only one downside really that I would have to say would be the parking. The parking is somewhat limited and they do not have enough spaces for every room. But I was able to get a spot every night, so it wasn't much of a problem. The location of the motel is really nice as well. Close to the freeway, close to all the Hollywood attractions, etc. I've traveled all over the world and have stayed in all sorts of hotels, and I also work in the hotel industry, so I feel I have a pretty good knowledge of a decent hotel when I see one. This was overall a very nice motel with a few added suprises. Very much worth the stay!", "Date": "October 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Minnesota", "Title": "“Clean, safe, inexpensive, convenient, no frills”", "Author": "GammaQuadrant", "ReviewID": "UR18612953", "Content": "Though this hotel is a bit off the beaten track, with a bus stop just outside and about 6 blocks to the metro, for a $5 day pass we could go anywhere easily. Staff were uniformly friendly and helpful. Room was impeccably clean, including the small handy refrigerator. Amenities are very basic (thin rough towels, downscale soap/shampoo, breakfast consists of packaged sweet rolls and harsh coffee) but it is clean, safe, and inexpensive (we paid $83/night). Free wireless internet works okay in rooms very near the office. Neighborhood is very tacky but actually more convenient for a budget traveler than many, there is a 99 cents store, grocery, and pharmacy right across the street; we bought picnic and breakfast supplies. Other guests were foreign students/couples. My teenage daughter and I ended up here after discovering that local hostels do not allow anyone under 16, and some require a foreign passport! we were very happy and felt we got at least our money's worth and somewhat more than we expected. Note that this hotel is NOT in the \"downtown\" district for taxi fares to LAX, therefore our fare to the airport was $61 not the flat rate of $42 from downtown; I'd recommend negotiating taxi fare before heading out to the airport, if possible.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Clean close to everything”", "Author": "papinico", "ReviewID": "UR18225190", "Content": "Stayed here for 3 nights clean rooms and amenities in room. Close to everything. with shopping and food across the street .. but I also smelled some stale urine when I turned on the air conditioner perhaps someone relieved their self in there..and be sure to ask for extra towels seems they are a little stingy with a few worn towels they had.... over all great for the money with friendly front desk service.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, California", "Title": "“Nice Clean, Luxury, stay with great customer service and Well Priced!”", "Author": "HotelCustomer101", "ReviewID": "UR14580604", "Content": "My girlfriend and I stayed. We were on our way to Super 8 Motel just down the street when we came across the Americas Best Value Inn in Hollywood just off of 101 freeway. Super 8 motel wanted $89 plus tax while Americas Best value was just $79 total. When u park your car it is in front of your room. No back parking like super 8 said all they have. This Hotel was luxorious, looks like set up by a Interior Decorator Clean. Like new. Has fridge and Microwave. The staff was very nice. We Checked out 10 minutes late past 11 a.m. they were joking about it with no attitude.. We only stayed one night But if we stayed longer this would be our First Choice! Enjoy if u stay u will know what we mean. See for yourself.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great value”", "Author": "dsatrian", "ReviewID": "UR6816098", "Content": "Me & my wife stayed here for 3 week nights in February. The main reason we picked this hotel was price and it's location. While it's not in downtown Hollywood and I definitely wouldn't walk the streets at night it a short drive to everywhere we wanted to go. I could see parking at the hotel being a factor, as it seemed there was less spaces than there were rooms, but we never had a problem. The staff was very friendly and helpful. Giving us directions and maps to some out of the way places we wanted to visit (Venice Beach was one). Even pointing out different routes, because of traffic. The rooms are very small, however they looked to be newly remodeled. The shower/tub had nice granite tile surround. The only complaint is that the walls are paper thin. We could hear our neighbor's television, and door slamming when they came home at 3 in the morning. Also, the lack of a coffee maker, iron, ironing board should be noted! There's a decent sized fridge so we went over to the market across the way to pick up some items. It was everything we expected, and I'd stay there again.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lincolnshire UK", "Title": "“basic good value”", "Author": "Silvercouple", "ReviewID": "UR6058910", "Content": "Had concerns about this hotel after reading various reports but found these to be unfounded. Check in was easy and the staff very friendly and ready to give advice even ringing the local bus company for times/ routes for us. The room was basic but clean and well maintained with housekeeping done daily. No coffee maker in room but complimentary coffee & danish pastires available every morning in reception OK not a buffet but what do you expect for the price. Did not hire a car but appeared to be planty of parking spaces avialable for those that had. Locality not the best but never felt threatened. Local transport very good with bus stop just outside hotel and underground less than 10 mins walk way $3 a day for unlimited travel. Not many eateries in local area but many available just short bus journies away. Would definately stay at this hotel again a good frindly hotel for the budget traveller.", "Date": "November 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Be aware”", "Author": "A TripAdvisor Member", "ReviewID": "UR4940141", "Content": "This hotel is in a bad area. There are only 28 parking spaces and 38 rooms, the attendant expects you to park behind someone else and leave keys at the desk for them to move your car. The rooms are very small and the room we were in had a very fowl smelling bathroom, dirty walls, sticky floors, broken mirror, broken drawers and (what I believe) was blood on the ceiling. The attendant was very understanding when we asked for a refund.", "Date": "April 5, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“clean room, acceptable for low rate”", "Author": "A TripAdvisor Member", "ReviewID": "UR4443383", "Content": "Clean, basic room. Our first flr room was a little noisy our first night and the walls are a bit thin but for the low rate we paid, I'm not loaded with complaints. No high speed internet, they said they're installing in the next month-there is already a slot for the cable. Coffee, cont breakfast provided. The wall color was more pleasant than usual for a two star.", "Date": "February 7, 2006"}], "HotelInfo": {"Name": "Americas Best Value Inn - Hollywood / Los Angeles", "HotelURL": "/ShowUserReviews-g32655-d549431-Reviews-Americas_Best_Value_Inn_Hollywood_Los_Angeles-Los_Angeles_California.html", "Price": "$72 - $92*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5265 W. Sunset Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90027</span></span> </span></span></address>", "HotelID": "549431", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5b/e1/5be1bb459797c1a6095941310588dab73large.jpg"}}