{"Reviews": [{"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Prestatyn, United Kingdom", "Title": "“Out of the way”", "Author": "Miss_renegade", "ReviewID": "UR121926349", "Content": "We went here one Valentines day for a cheap break. Was ok for what we paid, but the hotel is VERY out of the way, a 10min walk to the train station down a road with no pavement, and we found it unmanned and confusing on which trains went where. We were only B&B and the breakfast was fine, we didn't stay in the hotel much apart from to sleep. The time we spent in Rome itself was amazing. Such a lovely place. If we went again we would definitely go to a more central hotel though.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Abu Dhabi, Abu Dhabi, United Arab Emirates", "Title": "“very misleading”", "Author": "Melissa C", "ReviewID": "UR121859227", "Content": "the website said it had internet, they did not. when asked, the counterperson's response was curt. he said that there was a hotel down the way that did have it - just 2 minutes walking. it's far and remote. our room looked nothing like the photos. it looked more like an old dorm room. there is nothing special about this location that would make you want to go out of your way to stay here. i've never written one of these before but feel so negatively about the place that i wanted to warn other travelers. stay away.", "Date": "December 18, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Gilroy, California", "Title": "“They charged my credit card and we didn't stay there!”", "Author": "t p", "ReviewID": "UR118822092", "Content": "We never stayed at this hotel..never made a reservation but they charged out credit card. There's something fishy with their staff.", "Date": "October 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Hamilton, New Zealand", "Title": "“Transport difficulties”", "Author": "TAtraveller141", "ReviewID": "UR115372004", "Content": "Quoted as near Cornelia Metro. Reality was 5 minute walk to bus stop and over bridge on dual carriageway, variable wait for bus (40 minutes on one occasion although scheduled for 12 minute intervals), overcrowded bus due to large camp site nearby, at least 15 minutes on a good day to Metro. Rooms were fine, good bedding, cleaned and serviced daily. Fresh supply of soap, shampoo and shoe cleaner (for dusty Rome streets) daily. Bar had limited choice and closed at 10 pm. Consisted of one table with 4 chairs. Outdoors was all paved with about 10 chairs outside reception, but no garden or sociable area. Excellent buffet breakfast from 7-10 am Good supermarket next to bus stop and adjacent McDonalds and garage but no local bars shops etc. NO INTERNET ACCESS which was particularly annoying when evening staff were using it for Facebook. Overall timeconsuming to get into Roma and no opportunities for socialising. The journey did not encourage one to shower and go out for the evening but rather stay out for evening meal.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“not as advertised - very disappointing”", "Author": "Pauki", "ReviewID": "UR113393418", "Content": "Myself, my girlfriend and her mother, turned up at midnight to discover that the only rooms left (even though we'd booked months before) were 3 dusty, dirty, badly decorated family rooms on the ground floor (probably usually the last to be given out), which looked nothing like the pictures advertised on the web. After complaining, we were moved, at 1am, to the Black Hotel nearby, which was much better. I gave 3 stars for service because of the helpfulness of Fabio, the receptionist! One last thing, the hotel is at the top of a hill that doubles as a red light district by the way! P.s. We had only seen the bad reviews after booking, but thought that because they were from a year ago, the hotel would have acted on some of them since then. They haven't, unfortunately!", "Date": "June 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens", "Title": "“Would definetely go back (if I had a vehicle as well)...”", "Author": "vasoulinho", "ReviewID": "UR94575929", "Content": "It is honestly a very nice hotel. The room was very clean and cosy, I really enjoyed getting some rest in there. The breakfast buffet was very nice and enough for a good day start. On the floor we stayed there was also a automatic machine for drinks you could buy - really comfortable. The hotel was however a little far from the city center. On the one hand I was very lucky that i was there with a group, so we had a bus transfering us all around. On the other hand, I wish I were there only with my friends (and a personal vehicle), so that I could come in a more direct contact with the hotel personnel.", "Date": "January 27, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“COMPLETE NIGHTMARE”", "Author": "angeloanna", "ReviewID": "UR76853233", "Content": "This hotel was complete rubbish. If someone tells you its close to many historical roman places eg. the vatican, the colleseum, the trevi fontain etc don't listen to them chances are they mentally ill. first of all in order to get to any of these places u have to go down a steep hill then wait for the bus which can take up to half an hour then a 20minute ride on the bus to the metro then u have to take the metro to certain places which can take 10 mins. all together the whole journey is1 hour 20mins minimum. the room was tiny and very dirty also infested with mosquitos and the beds were like sleeping on a rock. dont bother paying for breakfast because we had booked bed and breakfast and we ended up having to pay for cappuccino coffee tea juice etc the crossaints were hard and cold. if u want a decent holiday DONT GO TO THIS HOTEL 3star i dont even think it deserves a star.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Muscat Governorate, Oman", "Title": "“STAY AWAY”", "Author": "KarenTalley-Gates", "ReviewID": "UR72942934", "Content": "Do not stay here!!! It is not as advertised. Not well lit in the parking lot. Absolutely no security! Staff not very friendly. Our car was broken into in the parking lot of the hotel and they were not helpful at all. Wouldn't even call the police for us. The night before when we had come home in from dinner there were people just hanging around on the steps of the hotel (gang like) just outside our room. Like I said no security! I doubt they even had rooms there. Not to mention the rooms are tiny and hardly clean at all.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London", "Title": "“Avoid like the plague.”", "Author": "lab27", "ReviewID": "UR61769017", "Content": "Dirty room - definitely not a 3 star hotel, terrible location, pedestrian access to bus stop into town requires you to walk along a stretch of dual carriageway (and of course there's nowhere to buy tickets). We couldn't bring ourselves to stay, so cancelled on the spot and ended up in a fantastic hotel in the city centre.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "South Africa", "Title": "“NEVER STAY HERE!!!”", "Author": "TravellerSA22 Posted by an OctopusTravel traveler", "ReviewID": "UR45474673", "Content": "This was the worst \"3-star\" hotel I have ever stayed in, and the fact that it's not exactly cheap either doesn't help. Staff were downright rude, unfriendly and unhelpful. The room (walls and floor) was dirty and soiled, as was the bedding. The duvets had holes in them and the dirty spots on the bedding that were there when we just got the room were in exactly the same places 6 days later! The walls had several dirty marks that were never cleaned. We only had hot water in the bathroom for the first day, for the other 5 days cold showers were the only option. To get there by bus (the only feasible form of public transport to the hotel), you need to get off on a highway and then proceed to walk up an extremely steep uphill slope (with all your luggage) for about a kilometre (maybe even more). Definitely not recommendable to anyone!!", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Stockport, England", "Title": "“Great for first timers, and if your not fussy”", "Author": "bremner168", "ReviewID": "UR39394078", "Content": "Like the rest of the reviews i agree that the description of the hotel is far fetched. However the bus stop takes a total of 5 mins to get to after coming down a small hill and crossing a road. The buses are unreliable but once youve caught the bus you need, public transport is brilliant and you can be on the other side of the city within 15 mins. The hotel staff are unbeliveably nice and helpful with their english being near perfect and we wouldnt have been able to find our way around without there help. The room is small, but all we used it for was a shower and bed so for what we paid for it was more than enough. overall cleanliness was great and breakfast was continental so didnt expect much. Admittedly, the hill up to the hotel is an effort if your getting on or if you've just come back from a long day out, but the hotel is in a nice and peaceful place so that your batteries can be recharged for another day. There is a supermarket right at the end of the street, perfect for picking up little snacks and drinks. Overall i'd reccommend this hotel if your just there to see the sights, experience rome, all for a cheap price. If you want a holiday, look somewhere else.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Thessaloniki", "Title": "“What you see is NOT what you get”", "Author": "milosisd", "ReviewID": "UR37540720", "Content": "Although I read the bad reviews on this site, I went on and booked the hotel, mostly for its price (80 euros per night with breakfast for a quadruple room - we were 4, two couples). The thought was that since we would be on the streets all day, we needed the room only for a bath, a night's sleep and breakfast. We were extremely dissapointed. The room was a double room with two added beds, so the free space was minimal, almost extinct. The matresses were like waterbeds with no water in them, the walls dirty, the floor was sticky, there was a large crack on the bathroom wall, the walls were paper thin and you could hear EVERYTHING, and the breakfast was minimal. There was no internet access (either free or paid), and when I asked them to use their computer in order to make the web check-in, they refused and sent me to the nearby Holiday Inn. The distance from the Hotel to the Vatican was 15 minutes BY CAR (we had a rental one). By public transport, it was from 45 minutes to 1 hour. On the contrary, the hotel we booked in Florence with the same specifications and at a cheaper price (60 euros per night) was one of the best hotels we've been (it's the Fleming Novoli Hotel). In conclusion, I would definitely NOT recommend this hotel to anyone. It is not good. One cannot even get a good night's sleep. Pay more and find something else.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "ulm", "Title": "“10 minutes to Vatican???? Maybe by helicopter !”", "Author": "wendyda", "ReviewID": "UR36059837", "Content": "We chose this hotel because they claim it is just 10 minutes to Vatican City. Mayne with the helicopter!!!! It's 15 minutes walk to the bus station. The bus goes only 2x an hour and takes half an hour to the subway stop. From there, its' another 15 minutes to Vatican City. The bath tiles was full with molds. The hotel was fully booked so some of us were sent to another hotel,... we had to pay Euro 30 for taxi because they did not want to shoulder the cost and another thing is that, thex didn't inform us beforehand that the hotel is fully booked! we could have choosen another hotel even REALLY close to Vatican", "Date": "July 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Ireland", "Title": "“Not for families”", "Author": "Merino9", "ReviewID": "UR30243873", "Content": "The most annoying part of our trip was realising when we arrived that their website was an absolute lie. It is NOT a few steps from the Vatician. It is a metro and bus trip which can take 45 minutes to get back to the hotel. We were a family of four with two children. The bedroom was nothing like the picture we saw on the web. We had three single beds squashed together to make space each side of the room for our small suitcases. The fourth single bed was alongside the foot of theses three beds leaving just enough room to walk by. One side light did not work as the electrics were all hanging off the wall. One wall had black footlike markings which gave an overall unkept impression of the place. The bathroom was fine, the towels were clean as was the sheet. Every bed had a very very thin pillow. We used towels under them to raise them up a bit. The wardrobe had three hangers for the four of us. The staff were fine, when we arrived people were complaining because the electricity was not working in their room so I would say people complain a lot. What we decided to do for our stay was not to return to the hotel until bedtime. The metro ended at 9 oclock which suited us fine as we had children but for anyone else they would have to get a taxi back which can be costly. There was a curtousy bus to the metro in the morning but it only took seven. When we tried to book it for 8am the morning we were leaving we were told- too early. It cost us €20 to get to the metro just down the road because when you come down the steep hill from the hotel in order go left to the metro you had to first go right for a mile or two and then come back on the other side of the motorway. Rome itself was lovely, the weather was great and out children really enjoyed themselves. We didn't complain because we didn't think we would get anywhere so we just made the most of a bad location. Bottom line, the owners should be ashamed of themselves for advertising such false and misleading information on their website. Shame on you.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Good value for your money”", "Author": "Tinyo", "ReviewID": "UR26589491", "Content": "I stayed in Hotel Scheppers for three nights with my husband. We did not have much time to decide where to stay in Rome and made a last minute reservation. If you are looking for an inexpensive yet super clean hotel with polite staff I can recommend this place. The staff spoke very good English and were very helpful in giving you advice how to get round the city and find your way back to the hotel :) Even found a similar hotel for us near Florence. To find the place was little challenging though not impossible. (We used an outdated navigation system from 2002 and that mislead us slightly.) If you are not the lazy type 5 minutes walking to the nearest bus stop is not a lot. We found public transport is reliable and you can be at any sight within 30 minutes.", "Date": "March 22, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "England", "Title": "“No,No, No.”", "Author": "MM1England", "ReviewID": "UR23631930", "Content": "Rome. What a place. Beautiful. The people of Rome are fantastic and attempting a little Italian goes a long way. Just a shame that Scheppers Hotel, allegedly 'just a few steps from the vatican' is no where near the Vatican or the rest of the key sights of Rome. This place is virtually on the out skirts of Rome. You'll need to walk 1/2 a mile to get the bus. Then a walk to the tube. Change on the tube. Get another bus and then a little walk. Not just a few steps then. The hotel doesn't handle travellers cheques and the breakfast isn't all that good either. Even the taxi driver didn't know where it was (and they start charging from the moment verbal contact is made). The driver found it by accident because he was turning around in the grounds of the hotel in front of it (The Holiday Inn as I recall). When we got there, the staff were totally disintersted in their customers. My advice would be to book somewhere else, particularly for a weekend break.", "Date": "January 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3"}, "AuthorLocation": "Oslo", "Title": "“Good hotel for a stayover”", "Author": "chruud", "ReviewID": "UR18637311", "Content": "We stayed at Scheppers Hotel for one night, since we arrived at Fiumicino Rome airport quite late. It's a nice, simple hotel, wirh clean rooms, tough quite unpersonal. The staff was proffesional and spoke english well. We had a rental car, since we where to drive to Tuscany the next morning. The hotel was somewhat hard to find. So i would get directions and a map from the rentalcar staff at the airport. (But it's quite close to the airport) The hotel was actually perfect for a stayover if you're just travelling trough Rome. I would not recomend this hotel if you don't have your own car, or is in Rome for a vacation. The hotel have its own parkinglot, just on the side of the reception. It's not a closed parking, so I would recomend bringing all your luggage inside for the night.", "Date": "August 5, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "cornwall", "Title": "“Scheppers”", "Author": "jace2222", "ReviewID": "UR8521309", "Content": "Well, a nice little hotel but as for getting there, absolutely not easy. this hotel is a metro ride and then a bus ride and up the steep hill. if you are thinking of booking this hotel you need to look at travel around as you will need to know where to catch the metro and the buses as the metro closes at 9pm, also look out for the taxis as they seem a little on the expensive side. now for the good bits, the hotel is small and the staff very freindly, asking them for directions is okay and they do have a small minbus (6 seater) that will drop you off at the nearest metro station (cornelia) three times a day (am) and it is on a first come first served basis. overall though the sights of rome more than made up for this part of the holiday, i would next time though book a hotel more central so i could be lazy and walk around thanks", "Date": "August 28, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "north east", "Title": "“ah! roma”", "Author": "sorefeetsussex", "ReviewID": "UR7640124", "Content": "We were in Rome at the end of April, what a wonderful country. It has been 30 years since my last trip but the first time for my partner. He was astonished at the architecture. Weather is best if you don't like to much heat (like me). We reccommend that if you have had enough of the city for a day and would like a break go to Ostia Antica, you can still use the cheap rail tickets it is only 20 minutes from central Rome. This is the ancient sea port of Rome. Beautiful mosaics and architecture, however we reccommend you take your own lunch, food is nice but pricey. Our only disappointment was the hotel. Scheppers in Aurelia, promised so much but delivered little. The room was twin when requested double, this was changed. According to the advert there should have been a safe, cafe, sprawling terrace with bar, views, ample breakfast buffet. None of these were apparent. It is a shame they feel the need to over estimate the attractions. It is also further from the Vatican i.e min 4km. They do however provide a shuttle bus to a metro hourly.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Northeast USA", "Title": "“Forget It...”", "Author": "phy2202", "ReviewID": "UR6018860", "Content": "As mentioned in other reviews this hotel is NOT steps away from the Vatican as it's PR claims! It is far from Rome Center! It almost impossible to find and the steep hill to get to it is beyond words! The hotel itself was pleasent enough but if your in Rome to see the sites and experience the history - DO NOT STAY HERE! Consider instead the Hotel S'Anna it's fabulous and IT IS situated within steps to the Vatican.....REALLY!", "Date": "October 27, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Dublin", "Title": "“Once is enough”", "Author": "Beeton", "ReviewID": "UR5957156", "Content": "Hotel is far removed from the city centre making you reliant on public transport (when not striking) or taxis. Whilst clean, and comfortable (beds especially) the hotel felt more like private hospital than hotel.", "Date": "October 15, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Newcastle, England", "Title": "“Good, Clean Hotel though a bit of a trip to the city”", "Author": "GlenEtchells", "ReviewID": "UR5692259", "Content": "I have recently returned from a stay in this very clean hotel. Initially i was concerned that despite specifically requesting a double room i was allocated a twin. This is a minor concern i agree. Other than this i had a nice stay at the hotel, though there are some things which i would like to point out to others wishing to stay there. Firstly i must comment on the distance from the city!! The hotel is situated just off Via Aurelia a main road leading out of Rome. The hotel website states \"10 minutes from the Vatican\", this is true if you take a taxi which varied in cost depending on where exactly picked up and the time of day/ night. The most i paid from the city for a taxi was about 18 Euros. There is a bus and metro link possible with the buses available quite regularly. This link goes via a place named Corelia where you swap for the Metro on Linea A. Just 4 stops later you arrive at Ottaviano - San Pietro which is close to St Peter's Square. Another 4 stops and you arrive in Spagna near the Spanish Steps. A good idea is to purchase a ticket for the length of time you are there which is valid for all buses and metros. I paid 11 Euros for a 3 day ticket. A word of warning though!! Pick pockets are rife on the Metro so be careful. Whilst i Personally did not have any problems here, i did witness a gentleman who had just been robbed!!! Also the Metro lines stop at 9pm so make sure you take this into account, the only ways back to the hotel from the city are to walk or in a taxi, which can sometimes be difficult to get hold of late at night. All in all i had a very pleasant stay in Rome, and the hotel was well presented and comfortable, with a supermarket nearby. But, i think that if i was to go back i would pay a lttle more and get a hotel nearer to if not in the city itself.", "Date": "August 22, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Galway, Ireland", "Title": "“Basic and clean, but a long way out of town”", "Author": "Galwaychick", "ReviewID": "UR5444880", "Content": "This hotel is located on the outskirts of Rome and is very hard to find - the directions on their internet site are very poor as they omit key turns if you are driving. No interest was shown in rectifying the omissions when we remarked on the problem at reception- we were just told 'yes, it's very complicated'. If approaching from the GRA (motorway ringroad) you cannot simply turn left before Aurelia Railway Station, as the website says, as it's a dual carriageway with a solid barrier in the middle. Instead, you need to exit right, take the flyover and return the other way. Even then the turn is hard to spot as the hotel is not signposted and the road sign is very small (so is the road) - the road is next to a McDonalds, follow the signs for the Holiday Inn. The hotel is in a quiet area, and is quite clean, apart from a lot of scuff marks on the wall. The staff were pleasant. The bedroom was an ok size, as was the bathroom. However the room looks nothing like the picture on the website - tiled floor, cheap furniture, poor bedlinen etc. On the plus side, rooms are air conditioned and have shutters to block out light. The bed was unusually low but comfortable. On the minus side, the rooms seem to have very thin walls and every sound from every side (above, below and to the sides) was audible. We were awoken every day at 6am by what sounded like furniture being dragged around above us. The breakfast was truly awful - very limited in choice, and of some of the sustenance provided amounted to a Crime Against Food - certainly a Crime Against Coffee! It seemed to be mostly foreigners staying here so maybe they thought we would eat any old thing and not complain. I didn't bother eating breakfast after the first morning. My husband did, but as he memorably heard an American visitor remark, 'Man, this really -----!' The hotel is well out of Rome, although there are regular transport links to the city - walk to the bus stop (bus regular but always very hot and crowded), bus to metro, metro to centre. However, the metro (line A) stops running after 9pm, and you would have to get a bus home instead (usually standing room only), which takes a lot longer. It's not that it's difficult to get to or from the hotel, but it takes so long that you wouldn't bother going home to change and shower and go out again in the evening. We ended up staying in Rome all day and eating a big lunch, and not bothering with dinner - fine, but not what we had in mind when we booked the hotel. The hotel website says that it is a 'few steps' away from the Vatican - this is completely untrue, it is nowhere near it. You have to get the bus to the metro, then go 3-4 stops. I don't think you could walk it in under an hour, and it might well take more. I see that the website says a shuttle service to the Vatican is available, but I don't recall it being mentioned when we were there (although we were given a useful info sheet on bus/train links). Overall, the best thing about this hotel is the price - we got a very good deal on the internet. It was quite clean and quiet (apart from the early morning). I would not personally stay there again as it was so far out of Rome, but I would recommend it to budget travellers who don't mind some inconvenience in return for a good price.", "Date": "July 10, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Norwich", "Title": "“Scheppers location a problem!”", "Author": "Julek5", "ReviewID": "UR5189726", "Content": "Modern hotel but fairly basic with small but clean and adequate bedrooms. Breakfast is not geared to British/American tastes, ie no fruit, limited cereals, no toast. However, worst aspect is location. Beware of the PR claims, i.e \"a few steps away from the Vatican etc\". Just not true - how can they get away with that? The Vatican is miles away! The hotel is way out of town and at the top of a steep hill. The hotel shuttle bus service is limited and unreliable. Unless you are going to rely on taxis (and they are not always easy to find when you want one), getting to and from the hotel is a headache. You have to rely on the Metro (underground) and local buses which can be unreliable, hot and overcrowded - and then the steep hill! OK for youngsters perhaps! Virtually nothing in the way of places nearby to eat in the evening. I would not go there again because of the accessibility problems.", "Date": "May 22, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Smart Clean Rome Hotel..that's Scheppers”", "Author": "A TripAdvisor Member", "ReviewID": "UR5029653", "Content": "I stayed in Scheppers late April 2006 for almost a week. All Reception Staff I found to be outstanding, with good bilingual skills and good concierge-type information. Very friendly and professional people. Rooms are very small though thoroughly clean. The bar however, is in the foyer. The breakfasts are ample though Continental only. It is on a hill with lovely views from the Terrace. Very peaceful there, but expect a trek into the City itself via Taxi, (which are always prompt) or take the bus and connect with Metro. Close to the Vatican but required shuttle to Metro. All in all...very good.", "Date": "May 2, 2006"}], "HotelInfo": {"Name": "Scheppers Hotel", "HotelURL": "/ShowUserReviews-g187791-d549494-Reviews-Scheppers_Hotel-Rome_Lazio.html", "Price": "$74 - $144*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Bogliasco 36</span>, <span class=\"locality\"><span property=\"v:postal-code\">00165</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "549494", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/18/b3/18b331cc9ecfcb92e84d443fdafa93b24large.jpg"}}