{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bossier City, Louisiana", "Title": "“Great Place To Stay”", "Author": "travis711", "ReviewID": "UR139756221", "Content": "Ive stayed here twice over the summer months as we drove up to take the kids to Silver Dollar City. The staff is very courtious and polite. The price of the rooms are perfect. Both times I have requested rooms on the bottom floor that ajoin and never had an issue. I like the fact that the pool is seperate from the rooms, it helps keep the noise down. The rooms are clean and well maintained. From now on when we visit this will be our hotel. I have read where some people complain about the breakfast or other little things. There are always negative people who like to grip, and if I have a major issue then I would address it with the hotel staff but I have never found a reason to complain. Life is what you make it, Go out and enjoy yourself.", "Date": "September 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Festus, Missouri", "Title": "“What a great little place......”", "Author": "robert w", "ReviewID": "UR139426709", "Content": "We booked early in May for our stay the last week of August. Arrived conveniently and got checked in by an absolutely professional front desk person. The rooms all enter from the outside, and ours was about center on the back side of the building (224). Nice clean room, no smoking, no smoking SMELL. Very firm beds (a must if you have a sore back after driving), fridge, coffee maker, tv, blow dryer...the usual. Location in Branson is everything and the Carriage House in at about the center of the 'Yellow\" route, which puts you right in the middle of the strip in about 6 blocks. Breakfast was okay, coffee was always on, biscuits and gravy, cereal, bagels...the usual. Tasty but not a full meal. Not really intended to be. Overall, if we go back to Branson, we will go back to The Carriage House Inn.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“super value”", "Author": "two4theroad44926", "ReviewID": "UR139317069", "Content": "I had some family come to branson and i put them up in the carriage house inn due to the reviews we read on line and through trip advisor ive used other hotels in the area and this one was the best thus far have been a visitor to branson for almost 30 years and the staff at the carriage house inn was the most helpful and sufitiant we have seen in branson they helped with theater arrangements and gave us several other opptions to due while in town, showed us some walking trails and areas that didn't require much money. we will and i will most definantly be using and telling outhers about this gem of the ozarks. great clean rooms and well you will just have to see for your self give them a shot and and see for your self.", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Independence, Missouri", "Title": "“Great Hospitality!!”", "Author": "pdonnici88", "ReviewID": "UR139283998", "Content": "The staff here were wonderful. Clean rooms. Indoor Pool. Very reasonable rates. Easy Access to nearly everything in Branson. Not on the main strip which is wonderful! My husband and have been twice (2 weekends in a row) to this hotel and will go again and again. Very Quaint place!", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rogersville, Missouri", "Title": "“Had a wonderful stay!”", "Author": "krissy c", "ReviewID": "UR137933217", "Content": "My husband and I recently enjoyed a weekend to ourselves and booked the jacuzzi room. We normally go a little further south but decided on Branson. We had an outstanding weekend, the room was clean! I'm a very loyal customer once I find a good place to go. I like my room to be clean and spacious, and I was very satisfied. They had a hot breakfast included in the price and a nice pool too! I definitely will return sometime!", "Date": "August 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“The staff was very friendly”", "Author": "Reneepoo1973", "ReviewID": "UR137528507", "Content": "We all loved the biscuit and gravy offered at breakfast. The room was clean and every one was very friendly and helpful / would definitely return! It's got a central location for all the shows and it's easy to bypass traffic from this location . They had a very nice indoor pool, which added extra fun for the kids!", "Date": "August 18, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hollister", "Title": "“kuddos!”", "Author": "Isenhowerusa", "ReviewID": "UR137273656", "Content": "hey! came back during the car show in August and everything was great as usual. not many hotels in branson offer smoking rooms anymore. they have rooms to accommodate all people. friendly and very hospitable and make the stay relaxed and very enjoyable.", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mannford", "Title": "“Very nice stay”", "Author": "Tammy R", "ReviewID": "UR137272919", "Content": "The rooms are very clean, the beds are extra comfy, enjoyed the indoor swimming and found the staff extra friendly and accomodating. I have definately spent more on a room in Branson and found myselft disappointed about one or all the things I just listed. I would recomend to anyone.", "Date": "August 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Alma, Arkansas", "Title": "“Brief stay”", "Author": "Dora D", "ReviewID": "UR137090694", "Content": "For a one night stay it was okay. I prefer doors opening to the inside since some of the traffic noise is filter by outside walls and feel alittle more secure. The rooms were clean and the beds were comfy. Not a breakfast person but I guess was enough to fill your tummy for the morning.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Elkhart, Indiana", "Title": "“Best Visit to Branson”", "Author": "LittleSis3", "ReviewID": "UR136383645", "Content": "Recently spent a sister's weekend in Branson at the Carriage House Inn. The room and property was attractive and very clean. The personnel was extremely helpful and accommodating. They helped make our weekend fun and relaxing. The Inn is in a very convenient location, making it easy to get to any venue. My sisters and I can't wait for our next visit to Branson and it will most definitely be at the Carriage House Inn!!!!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas", "Title": "“Good location for a great stay”", "Author": "sewut", "ReviewID": "UR135335352", "Content": "We booked this motel for a two night getaway for our anniversary. We asked for a ground floor room and got one towards the back. The pool was in a separate building and only a short walk. The pool and building were clean and so was our room. We had their continental breakfast the first morning, as we had an early booking for the Titanic Museum. The biscuits were kind of hard, almost like they didn't rise enough. The gravy was on the watery side. The doughnuts were good though. We went to the Titanic, and spent 3 hours there. We went back to the motel to warm up our Famous Dave's leftovers from the night before for lunch. The room had not been made up, but the maid was next door, so we changed into swimsuits and went to the pool to give her time to make up the room. We could see the room from the pool. We stayed in the pool an hour, then sat in the sun to dry off, and she still hadn't done our room. She must've gone to lunch, so we went back to eat. She came while we were eating and just emptied the trash. So we never got the bed made up or clean towels. No biggie, but if we had had friends with us that had stopped by, it would have looked bad. The room was comfortable, with two comfortable chairs to sit in while perusing brochures. When we checked in, there were lots of brochures and maps in the lobby and a list to order by phone from our room. The tickets were delivered to the lobby later that day. All in all, it was a nice little mini moon until we got home and found out my husband's credit card number had been used in Houston, TX while we were gone.", "Date": "July 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Excelsior Springs, Missouri", "Title": "“Best hotel in Branson”", "Author": "sarah a", "ReviewID": "UR133432446", "Content": "My sister,daugther,my best friend and myself wanted to get away for the week-end. I found this hotel on line. It looked great but as you know things don't look the same when you see it in person. This was one of the nicest hotels I've stayed in. The hotel itself was in excellent condition. The room was very nice and comfortable. The inside pool was in a separate building which was great. The overall experience was wonderful.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best deal in Branson!”", "Author": "tanarra", "ReviewID": "UR132105447", "Content": "Spacious room with king bed, hot tub bath, pool breakfast, and located in the heart of Branson. CLEAN!!!", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Normal, Illinois", "Title": "“Hard to find a place this nice for the price”", "Author": "ductbert", "ReviewID": "UR131977981", "Content": "In my opinion I've never found a better place to stay in this price range. The rooms were neat and well-kept, the A/C could have turned the room into a walk-in refrigerator (that's a compliment; you will keep cool), the pool facilities looked really nice (we didn't use them, though) the continental breakfast was simple but very nice (fresh cake donuts from a local bakery featured each day) and the staff were friendly and helpful. They even had free coffee available during lobby hours. The location is also fantastic; two wineries are next door and Titanic is very nearby. A Panera, Subway and even a nice local Italian eatery are also close by. I will definitely stay here again on my next visit to Branson.", "Date": "June 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Girardeau, Missouri", "Title": "“Nice Clean Room Great Value”", "Author": "joggermike", "ReviewID": "UR131412480", "Content": "We (3-5 couples) have used this motel each June for 10 years and have never been disappointed. The rooms are clean, the beds comfortable and the staff is very friendly. It is in a good location with easy access to Green Mountain Drive which allows for quick travel in an east/west direction in Branson. An adequate continental breakfast is included in the very fair price.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Very clean room at a terrific price”", "Author": "jmills55412", "ReviewID": "UR131307155", "Content": "My wife and I chose to stay at the Carriage House Inn in Branson, based on the reviews on TripAdvisor. We were not disapointed. The room came with twin queen size beds on the 3rd floor facing west. I was fearful that the AC would not keep up, but there was nothing to worry about. The room was very clean, the beds soft and the shower/bathroom immaculate. The man at the front desk even offered to bring us a small refrigerator, which was a total surprise, and very welcome. We got to use the pool on the first day and it too was exceptionally clean and wonderfully delightful.", "Date": "June 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monticello, Illinois", "Title": "“Carriage House Inn”", "Author": "Brian68319", "ReviewID": "UR131002732", "Content": "I have stayed at dozens of hotels in Branson over the years and this hotel is terrific! The room was clean and the mattress and pillows were very comfortable-- I slept like a baby. The staff was very friendly and the kids thoroughly enjoyed swimming in the indoor heated pool. We will stay here the next time we visit Branson!", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ofallon, mo", "Title": "“Nice and clean - family owned business”", "Author": "ttravers", "ReviewID": "UR130896409", "Content": "Placed here by one of the many Timeshare package deals and really didn't know what to expect. We were very pleasantly surprised. Room was very comfortable and very clean. Employees and guest were all very nice. Breakfeast offerings were plenty to get us started and save us some money. Location is very convenient. I'd definetly stay here again.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norwalk, Iowa, United States", "Title": "“A very good value in Branson”", "Author": "Mike H", "ReviewID": "UR130816902", "Content": "This hotel was very clean and the staff was very friendly. It doesn't have alot of frills but it's a nice place and had all we needed for our stay. The continental breakfast was ok so if you are someone who needs really awesome food for breakfast you may want to go out for breakfast but for myself it was totally adequate. I would go back and stay again.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good place to stay if on a budget”", "Author": "Sparky62897", "ReviewID": "UR130709593", "Content": "Over the stay was nice. It is a good place to stay if you are on a budget. The staff was very friendly as soon as you walked in the door and were that way throughout the stay. The breakfast was good with only biscuits and gravy, cereal, toast , and donuts. It would have been nice if they would have had a make your own waffle station. The rooms were clean and the bed was comfortable. The only down side to the room was the AC would not cycle on and off. It did not matter the setting it was placed on. So you either frozen with it on and or got hot with it off. I would suggest bringing a extra blanket.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Girardeau, Missouri", "Title": "“best stay in branson”", "Author": "Beverly S", "ReviewID": "UR130543277", "Content": "really enjoyed stay at Carriage House Inn, rooms very clean, bed very comfortable, great staff, looking forward to staying there again!!!!!", "Date": "May 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mashfield", "Title": "“A wonderful way to start a new life”", "Author": "Saundra M", "ReviewID": "UR128545795", "Content": "We received our stay at Carriage House Inn as a gift for our wedding. When we arrived, we were greeted by one of the friendly staff and given our key and a map of Branson. When we opened the door to our room we were amazed at the how spacious and clean everything was. You could tell that this was a hotel that was \"kept\" clean and not just \"spiffed\" when they had a reservation. The bed was soft and the pillows were probably the best I have ever slept on. The room had a microwave, refrig, comfortable chairs and table. A perfect place to start our new lives together. In the morning we were met by the owner himself, as he explained how the breakfast area was arranged. Yes, hot biscuits and gravy, cereal, fruit, danishes and more awaited us! Great food, warm conversation, and a happy smile started our day. My husband and I will be back again soon. You never forget a great hotel, amazing people and an experience like we enjoyed at the Carriage House Inn.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eagan", "Title": "“Great Place to Stay!”", "Author": "Ruth O", "ReviewID": "UR128486398", "Content": "My husband and I were making our first visit to Branson, and I was just brousing thru the motels on priceline when I came across the picture of Carriage House Inn. It looked so inviting so I made the reservation for 3 nights. We couldn't have been happier. The room was spacious with 2 wing-backed chairs with a table lamp which was great for sitting and reading or watching TV instead of having to sit on the bed. The bed was wonderfully comfortable and the staff was very helpful - even recommending an Italian restaurant that had exceptional food! The only thing I would have liked is a little more variety for breakfast, as I'm more of a protein person than carbs, but what they offered was very tasty. We liked being close to 2 winery's too! Will definiately stay here our next visit!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rocky Mount, Missouri", "Title": "“Wonderful People”", "Author": "William M", "ReviewID": "UR126812730", "Content": "This was the second time staying at the Inn the first was a rushed time we did not get to enjoy the Inn except for the wonderful room we had . This time we were able to enjoy the breakfast and sit in the lobby and enjoy conversation with the gracious owners. The rooms are verry clean the towels are fluffy and landscaping is beautiful. We will refer all to Carriage House if you are going to stay in Branson.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, Oklahoma", "Title": "“BEST PLACE TO STAY IN BRANSON!”", "Author": "Cheryl M", "ReviewID": "UR126779175", "Content": "This is the best place to stay if your going to Branson, Mo.It is a WONDERFUL & WELL TOOKEN care of hotel! I recomend this to ANYBODY! We spent 2 days here and we LOVED it! We even got a discount from www.mwtravelbuddy.com the rooms costed less than $50 a night! The staff was super nice & helpful! The wifi was just as helpful as the staff to see what to do in Branson! And it is very close to ALL the attractions Branson offers! There is a nice heated indoor pool that is open every day! A friend stays here also and he & his wife LOVE it, they recomended it! Thanks For the great stay Carrige House Inn, we will be coming back soon & staying longer!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia mo", "Title": "“Veterans!! Read my review!”", "Author": "Louis L", "ReviewID": "UR126727230", "Content": "Last spring six of my veteran buddies and I got together for a couple days to talk over old times. I had heard that the Carriage House Inn was a good place to stay from a friend of mine. We called and got seven rooms in one area and we spent the weekend. It was great! The rooms were clean the beds were soft, and people were very friendly. They pointed us to good restaurants and what to do and see in Branson. They allowed us to use their meeting room in the evening so we had a place to gather. We were all in Viet Nam together so we had plenty of things to talk about. We had breakfast in the morning and it was very fresh and we all enjoyed it. This hotel is easy to locate and close to everything, but in a nice area. We were treated very well by the staff at the hotel and we are making plans to go back. They really made us feel at home. If you are looking for a place to stay in Branson, call these guys up and they will take care of you. (And yes the wives were there too and they enjoyed it a lot!!)", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Royal, Arkansas", "Title": "“A wonderfull plan to stay”", "Author": "mabel201", "ReviewID": "UR126709124", "Content": "I want to say this is a great place to stay--very relaxing-the people are very very nice and very helpfull. The rooms are very clean---and it is a safe place to be if you have children-As for the breakfest --it is nice and hot ( biscuits and graving) it was very good---If i were going back to Branson that would always be the place for us to go. MABEL LUNSFORD ROYAL AR.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Great Stay”", "Author": "thetravaler", "ReviewID": "UR126658061", "Content": "This hotel is a Great Stay...the price is very reasonable, rooms were clean, and the employees were friendly and very helpful...My sun really enjoyed the pool....I recommend this hotel to everyone especial those of us on a budget", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Ok for the price”", "Author": "Eztrip44", "ReviewID": "UR123724438", "Content": "My family stayed there one night on our way to Kansas...we chose this hotel because the price and it had an indoor pool. The room was ok...nothing special but at least it was clean! The pool was \"in-doors\" but it was detached from the hotel and it was freezing outside! The inside wasn't much warmer and we ended up not swimming long bc it was so cold in their! We then went to have hot coco and cookies...my son burnt the mess outta his mouth with the hot coco and the cookies where stale...next morning at breakfast their wasn't much to chose from and their gravy was like water...there are so many hotels to chose from in Branson I don't think we will be staying at this one again", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Unionville, Missouri", "Title": "“Very good place to stay”", "Author": "Mobojo", "ReviewID": "UR121933614", "Content": "We have stayed here several times and have always had a good experience. The rooms are very clean and all motel personnel are friendly and helpful. The price is definitely a plus. We will definitely come back again.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Cleanest Room, Comfortable Beds & Pillows - What a Good Value!”", "Author": "Laura A", "ReviewID": "UR121786682", "Content": "We usually stay at the Clarion, but our friends always stay at the Carriage House Inn and wanted us to stay there. We usually pay about $100 for our room. Then we have to pay another $30 for our breakfast breakfast for our family of four. We stayed at this hotel for $54.99 our family of 4 and the continental breakfast was included. We had biscuits and gravy, great donuts, tropical fruit, bagels and juice, We enjoyed being with our friends there and will stay there again in the future. Why pay so much more when we can be very comfortable there and the hospitality was great.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Guerneville, California", "Title": "“A decent room for a good price”", "Author": "IQ140", "ReviewID": "UR121593117", "Content": "This is your basic \"Motel6\" type hotel. Yes, it was clean (you should expect that any place). Yes, the front desk was cordial. All in all, OK for a night or two. My room was $57 which is an excellent price -- of course, it was early December. So, a good value for a decent room, but certainly doesn't come even close to being the best hotel I've ever stayed at. There is a small, attractive lobby in the front and a tiny breakfast room with 5 small tables and 4 more tables are in the lobby area. Don't count on getting a seat if all the 98 rooms are booked. The breakfast is really basic. The \"baked daily\" donuts were boxed from the grocery store. Two cereals, biscuits/gravy, toast/bagels, so-so orange juice. The fresh fruit was one large bowl with small cubes of pears and mangoes (I think). The small swimming pool was reasonably warm but the building is not heated. If the hotel was fully booked, it could be very crowded. The tub/shower was actually better than in some big-chain hotels --- two grab bars and the floor textured to prevent slipping. And the water flow was pretty good (if you adjust the showerhead). The rest of the room was fine --- a small, clean frig, a small microwave, decent TV, quiet AC/heat unit. Towels are the really basic type (and there was a linen inventory and price list -- although I can't imagine anyone wanting to take them). A few signs of wear on the furniture, but not excessive.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houson", "Title": "“Great Place!”", "Author": "Ken C", "ReviewID": "UR120978880", "Content": "First time staying there, LOVED It, first very far Prices, found it very Clean and Comfterble, before We went to bed We stopped by the Lobby for some Coffee & My Wife had Coco, a few cookies, JUST FELT AT HOME, I Recomend to all.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lees Summit", "Title": "“Older hotel, but very clean”", "Author": "saiza", "ReviewID": "UR120315472", "Content": "We stayed at the Carriage House Inn for two nights, in early November. We booked our room early for 65 dollars a night, but by late October the room was going for 60 dollars a night. Branson books up fast, so you have to book early. We got there late afternoon on Saturday, the clerk at the counter, was very friendly. She asked us what we were in town for and pointed out some good shows, and coupons we could use. The hotel was older, and it didn't have an elevator that I saw at all, just flights of stairs which was ok. The room was very clean, older, with a great bed. The beds were firm yet soft at the same time. The shower had great water pressure, but very soft water, you never felt you could get all the soap off. Washing your hands, you just had to give up cause it never felt like the soap got all the way off. The air conditioner didn't seem to be working that well, but it worked extremely well. We had it on low cool all night, and it was freezing, we kept getting up to turn up the temperature. It never seemed to turn off, just kept running all night. The tv wasn't so great, it only got around 20 channels, and no movie channels at all.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hiawatha, Kansas", "Title": "“Clean basic room with friendly home feeling.”", "Author": "Lisa K", "ReviewID": "UR118343287", "Content": "My husband and I have actually stayed at this property twice in the past 3 months, both stays where quick overnight visits. Front desk staff very friendly and helpful, quick painless checkin. The rooms are large and most importantly very,very clean. The beds and pillows are both very comfy, I had the best nights sleep both times staying here. The towels however are small and very thin, they could definatley use some upgrading. Soaps and shampoos provided where nice. Location perfect for us, we wanted something off of the strip but yet it is only a few blocks away from many attractions and places to eat. The one drawback we found on this last stay is the lack of television channels, both of us are huge football fans and headed back to the room after dinner to relax and watch a few games and our favorite team that is when we discovered the lack of choices, however not a big deal except during football season. lol. Again lovely property and very reasonably priced. The pool also looked very inviting just no time since they where quick stays.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“HOME-AWAY-FROM-HOME!!!!!”", "Author": "blondie-314", "ReviewID": "UR118242170", "Content": "WOW!!! Found our \"Home-away-from-home!\" in Branson! Perfect location for all theatres, restaurants, shopping and activities.....rooms were very clean & modern....staff TOTALLY friendly & helpful - even recommended the Branson Guest Card which saved us countless dollars!!!!! Breakfast was super --- we will be returning to the Carriage House Inn in Dec. for Ozark Mountain Christmas. CAN\"T WAIT!!!!!", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Will definatley be back, again and again.”", "Author": "Alex B", "ReviewID": "UR117415233", "Content": "I stayed there at the carriage house in at the beggining of the month, on a very busy weekend. I think they were full. Me and my friends I traveled with had no problems finding any parking, and we were checked in very quickly, and with a smile. The customer service was amazing. When we got to our room, it was extremly clean, the beds were super soft, I think they were sealy, and we had more than enough room for the 4 of us. My own room isn't as clean as this room was. In the morning we had to leave pretty early, and the breakfast they served was perfect for that. The biscuts and gravy were very delicious! On our second morning there we had a little bit more time and were a little more hungry. The gentleman at the front desk offered us a coupon for the reasturant just around the corner. $3.99 for a full buffet, so they offered us a great continental breakfast and a great alternative, if we were a little more hungry. It's a lot cheaper than say Mcdonald's or Golden Corral, and it's a local reasturant, not a chain, exactly what we were looking for. They did have a wonderful and clean pool, open late too. I would of thought to pay around $80-$90 for a room like this. But we got all of this for around $60. This place really gives you more \"bang for your buck\", and you don't have to sacrafice quality. I would recomend this hotel 100%. Great location, service, and accomodations. We definatley will be back more than once.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Belleville, IL", "Title": "“Great Hotel for the price !!!”", "Author": "Angel5Devil95", "ReviewID": "UR117234346", "Content": "It is a great hotel for the price! The breakfast is standard fare although they specifically say biscuits and gravy on their sign, the biscuits we had were hard, and the gravy was like water and no taste. It is a packaged gravy so I am assuming to make more they doubled the water. IT WAS AWFUL!!! Of our 3 night stay we ate breakfast there once. The rooms are kept clean, the bath towels however are small. The pillows are thin and old and the pool is in another building across the parking lot. The beds are soft and the air conditioner will freeze you out! I am not sure why but they weren't busy yet we were put in a room almost at the end of the hotel and someone was next to us. The walls are paper thin, you can hear someone talking in the next room in a normal voice. BUT, it is still a great hotel for the price.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Portage, Indiana", "Title": "“\"We loved it and we'll be back!\"”", "Author": "Gary C", "ReviewID": "UR117221642", "Content": "We enjoyed our stay at Carriage House Inn and would definately stay there again. The room was clean and spacious, the house keeper was very friendly. The location could not have been better. The staff was very friendly and polite. The continental breakfast had plenty to choose from and a never ending supply of coffee, and treats. The dining area was very clean and well staffed. The lobby and outside hallway had plenty of brochures to choose an activity to keep you busy on your stay in Branson. Though we didn't use the pool, it was very clean and well maintained.", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Definetly worth the money”", "Author": "Pwilson86", "ReviewID": "UR116988180", "Content": "My fiancee and I just stayed here 8-17-11 thru 8-19-11 the staff is super friendly, knowledgable and really helpful we had a king jacuzzi room and our a/c didnt work right we called the front desk and as I hung up the maintenance guy was knockin on the door he had it fixed in 5 minutes and then he refered us to a really good place for dinner, I wish I would've gotten his name. Do yourself a favor and stay here its well worth the money and right in the middle of the shows. I will always stay here from now on.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Crossett", "Title": "“Fantastic Weekend Getaway”", "Author": "mgreene36", "ReviewID": "UR116362646", "Content": "Out of ALL the many places to stay in Branson my Family and I chose the Carriage House Inn for our weekend getaway and experienced one of the BEST weekends we have had in a long time. We loved the location because we were within just a few minutes from everything we wanted to do and see. There was plenty of room in the King bedroom which we enjoyed with our 2 yr old. Breakfast was very nice and service was wonderful at all times. The indoor pool was so RELAXING after a day of FUN!! We visit Branson about 3 times a yr if possible and we will definitely be making reservations there again. Great choice!!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Loved second time at Carriage House!”", "Author": "grandpa48", "ReviewID": "UR116306777", "Content": "We stayed at Carriage House for the second time. Was a great value--had a special rate for a longer stay. Staff was friendly and helpful as always. We appreciated the 1st floor unit, with refrigerator and microwave. Furnished breakfast had lots of options. We certainly enjoyed the swimming pool!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Muncie, Indiana", "Title": "“July 2011”", "Author": "Rockydaniels", "ReviewID": "UR116208162", "Content": "What a beautiful and clean place. From discount tickets to a free breakfast, we had a blast. My grandkids loved the indoor pool. It was hard to get them out long enough to go somewhere. I give Carriage House Inn an A+ rating when it comes to bang for the buck. Thank you for an enjoyable stay.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“loved it...”", "Author": "nanacarol8096", "ReviewID": "UR116190870", "Content": "Freindly staff, great accomadations, clean rooms, good breakfast and had a wonderful time..", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Pittsburg, Kansas", "Title": "“We won't be back”", "Author": "snoodles60", "ReviewID": "UR116134607", "Content": "It is in a good location to get in and out easily to get to any attraction. After reading the glowing reviews, I was very excited to go there for our family reunion. The rooms were clean and the pool was clean. Even though I didn't get to go in it. My husband asked for a room close to the pool so I wouldn't have to go down any steps, I just had knee surgery. They put us on the other side of the pool and in order to get there I would have to go down the stairs or drive around to the pool. There was not enough parking places for the amount of rooms they have. We stayed there three nights. The breakfast was horrible. We had to eat elsewhere. The owners are rude and blame you for their mistakes. We had asked for their small hospitality room for Friday and Saturday night for our reunion they gave it to some one else to use. We have this booked since March. When our food arrived Saturday night they had another group in there. We asked if we could have some tables to use and eat outside. The lady owner was rude and told us we should have had it written on the calendar, that not our job it is her job. We had a signed contract for this. She told us the other people were going to do the christian thing for us and let us use it for an hour to eat. She was really huffy about it. Her husband then did help us set up the room. She shot daggers at us. The main one in our party also got jumped on to. Then she came back and apologized to her, but not me. Then my cousin who was schedule to catch a plane asked the desk to print out her boarding pass. They told her it was against their policy to do that. Luckily my son had his portable printer there and he did it for her. I have never heard of a place not helping you print out your boarding pass. The air conditioners quit they complained about fixing them. We had three rooms and the toilets had to be flushed several times. All in all our stay was not what we expected. We are business owners and we would never treat our customers they way we were treated. They need a lesson in customer courtesy. There was not a spa or a fitness center. I guess you get what you pay for.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“Fine Place to Stay in Branson”", "Author": "kldav916", "ReviewID": "UR116037044", "Content": "The room, pool and breakfast area were well maintained and always clean. The staff was professional. Even my 11 year old grandson noted how comfortable his bed was. Not a single unpleasant surprise the 5 days we were there. For the price, I would recommend it.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Good place at a great price.”", "Author": "texasgirl0525", "ReviewID": "UR115845607", "Content": "I completely enjoyed speaking with Lisa when making our reservations. I was excited to meet her after our wonderful conversation. She is very friendly and helpful. Once we arrived check in was very easy. Since it was late and the hotel had little vacancy Lisa offered to move her car so that we could have a parking spot. The rooms are very quaint however, the air conditioner kept us more than cool (I even had to walk outside to warm up and I am very hot natured). The room was very clean and provided the perfect place for us to sleep and get ready since we did not intend to spend long amounts of time in the hotel. The pool was also a nice way to end the evenings since my daughter loves to swim. Overall I would say this is the best place for the price and I would consider it first on our next trip to Branson.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Wentzville, Missouri", "Title": "“An average place for an average price.”", "Author": "brightestblue", "ReviewID": "UR115744956", "Content": "Having read all the glowing reviews on here before I left, I suppose that I was expecting way more than what I got. I'm not a picky person or one who is looking for luxury by any means. Carriage House is an outdoor entrance motel with three levels. We had no trouble finding the place. It enjoys a super location on Green Mountain, which is off 76 a little bit so that traffic is not so bad. The place itself is well-kept and clean. I didn't notice any signs of wear and tear. The decor is definitely \"homestyle\"- lots of mauves, paisleys, and floral. Someone at the front desk made a mistake and we ended up waiting quite a while to get through the check-in process. I was surprised that the person I worked with wasn't overly accomodating; almost blaming us for the mix-up. It ending up being fine and it was taken care of, but it wasn't all the glowing hospitality I'd heard about in previous reviews. The pool was nice and open late. I couldn't hear my neighbors, but I could hear outside noise. Beds were pretty hard, but not awful. I think the worst part was the breakfast. Trust me, I'm NOT a picky eater, but this breakfast was disgusting. Fruit tasted sour, biscuits were hard, gravy was bland. The \"juice\" tasted like it was made with powder packets. I specifically chose a place that provided a free breakfast and we ended up having breakfast elsewhere. Overall, this place was just OK- what I would expect for the price I paid. For me, I won't be staying again. I think a different place would probably suit our needs better.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Springfield, IL", "Title": "“Will be back!!!”", "Author": "RissaRoo82", "ReviewID": "UR115251823", "Content": "My boyfriend and I stayed on the weekend of 7/8/11, and I'm happy to say we will be back! From the first time I called them to make arrangements, the staff has been nothing but friendly and accommodating. They gave us a discount, without us asking for one, which I thought was fabulous. We ordered discount show tix (no timeshares!! haha) from a # the front desk gave me, and they were delivered right to the hotel, and we picked them up at check-in. So easy! Saturday morning, we had their breakfast, and they were so nice, and carried our trays for us, and got us a table even though they were busy. Sunday am we used their vouchers for $3.99 breakfast buffet at the Uptown Cafe down the street, which was great! They let us do a late check-out so we could go swim at the lake, and come back &shower after. Very pleased!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Valley Falls, Kansas", "Title": "“Immaculately clean”", "Author": "4travelers4ever", "ReviewID": "UR115023431", "Content": "I have never stayed in a cleaner motel than this. Very nice for the price. We will visit again.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hollister, Missouri", "Title": "“Great Hospitality”", "Author": "isenhower", "ReviewID": "UR114988898", "Content": "Great place! Very nice atmosphere and the friendliest people on earth! Rooms are clean and very nice. Nice indoor pool, open late. Located close to most Branson attractions.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Peters, Missouri", "Title": "“Stayed in June and just booked for July -- Great Place”", "Author": "csstpt", "ReviewID": "UR114967641", "Content": "Our stay at Carriage House Inn was a wonderful experience. Our room was sparkling clean, the staff was extremely friendly and helpful. The swimming pool was clean and conveniently located. The continental breakfast was great. The owners are very interactive with guests and you can tell they take great pride in what they do. The minute a guest leaves a table someone is there to clean the table. Same with where the breakfast food items are -- always clean. The evening snacks that are provided -- popcorn, cookies, tea or coffee was just a nice way to end your day. We had our kids and grandkids with us in June -- we're headed back in July without the kids. If you are looking for a great place to spend your vacation in Branson you can't miss with this one.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denton, Texas", "Title": "“Excellent Service and Spotless Rooms”", "Author": "JJ3110", "ReviewID": "UR111841338", "Content": "I can't say enough good things about the owners of this inn. They went \"above and beyond\" for us. We were traveling with a group on a tour bus, and my mom twisted her knee stepping off of the bus. The owner made a trip to the store to buy her a knee support. Then we had to stay behind one day after the group left so that we could conduct some personal business by fax. After our business was concluded, the owner drove us to meet our group. The rooms were spotless and breakfast was great!", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Wonderful trip and great inn”", "Author": "Meemaw1929", "ReviewID": "UR111797971", "Content": "This is an immaculate inn with an extensive complimentary breakfast owned and operated by the most friendly, kind, and thoughtful couple I have ever encountered in my travels in the USA and abroad. You could not go wrong in selecting this inn for an exciting vacation in Branson.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "nashville, tn", "Title": "“Great Place to Stay”", "Author": "kwalker", "ReviewID": "UR111680231", "Content": "Stayed 6 nights and could not have asked for a better place. Was concerned about how inexpensive it was, thought it might be a dive, but after reading the other reviews, we took a chance. Very clean, very quite, great people, great location. If your looking for a 5 star resort, this is not it, but if your looking for a great place to stay in Branson, it is.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lenexa, Kansas", "Title": "“Very Pleasant Experience”", "Author": "MattyPTatty", "ReviewID": "UR111482816", "Content": "This was a very well kept, clean and pleasant place to stay. We came to do a Time Share mini-vacation and to just get away. The Staff were very kind and made us feel right at home. I would definitely recommend staying here to anyone. I know that we would stay again if we visit Branson. Had not one single complaint. And the shower was the best shower - perfect pressure!", "Date": "June 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "South Bend, IN", "Title": "“A very comfortable stay”", "Author": "Daustin1", "ReviewID": "UR111184434", "Content": "My wife and I just spent five nights at Carriage house inn. We enjoyed our stay. It was in a central location and convenient to many attractions. All of the staff were very friendly. The room was clean and comfortable and it was cleaned well each day. Thanks to everyone for the nice stay.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springville", "Title": "“If I could give it more stars I would!!”", "Author": "Singingstar22", "ReviewID": "UR109527758", "Content": "There is nothing bad I can say about The Carriage House Inn. It feels so much like home to me. Maybe that has something to do with the friendly staff or the kind owners, Bob and Linda. Maybe it has something to do with the promt room service. We left for breakfast and came back the room was already made up and clean! After seeing one of my favorite shows I bought a DVD of the show and wanted to see I saw myself on the DVD. Bob and Linda helped me get it loaded up in the DVD player in the breakfast room and I was able to sit and eat popcorn and relax and watch my DVD. What kind of a motel will let you do this?? Well, the Carriage House Inn, that's where! We went during a busy time period. There were a lot of bus tourists eating breakfast at the same time we were so the breakfast room was busy at times. My dad and I found a little table outside on the beautiful porch to eat and as we were eating, Linda came out to check on us and to tell us they could get some extra tables inside if we wanted. We were okay because it was a beautiful day, but the fact is they took the time to check on us. I like the fact they see their guests as friends. The breakfast is good. The donuts are fresh and made specially for the Carriage House. Linda has started making the biscuits for the sausage gravy. They've added bagels and cream cheese to the spread. The breakfast room is a fun place to go with Bob talking to all the guests. You can see how much he enjoys running this motel. He makes it seems less like a motel and more like a home away from home which is exactly how I feel when I'm there. The location is so convienient. It's not right on the strip in the \"hub-bub\" but just off the busy strip in a cozy area just about 1 min away from all the action. There is a restaurant right across the street if you wanted to walk someplace you easily could. The indoor pool is really nice. I wish you didn't have to walk outside to get to it because it's kinda chilly at night sometimes, but that's nothing!! It's a really nice pool area regardless. But keep in mind there is no whirlpool. Doesn't bother me, but I thought you should know incase that's something that's important to you. Internet works really good...even in our room which was at the other end of the motel. Everything was perfect. Should be at the top of the list. Best place to stay hands down. Has everything you could want in a room. Comfy beds, homey/cozy atmosphere, amazing staff, breakfast, indoor pool...simply the best! One tip...if you want a fridge/micro in your room tell them when you make a reservation. They will put you in a room that arleady has them and you are not charged extra!! I could go on and on all day about The Carriage House...there really aren't enough good things to say about it. What would be even better is if I were there right now!", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mesa, Arizona", "Title": "“Great!”", "Author": "dcordaro", "ReviewID": "UR109481485", "Content": "We had a wonderful time at Carriage House Inn. Bob and Linda were wonderful hosts. The rooms always clean and comfortable. Continental breakfast was great. The gave accurate directions to all the places we visited. When I gom back to Branson I will go back to CHS.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Carriage HHouse Inn Provides Great Hospitality”", "Author": "klein06", "ReviewID": "UR109335333", "Content": "The hospitality was excellent and the staff was extremely accommodating to meet our needs. The rooms and facilities were very clean and well kept. This location enabled us to have easy access to all activities and restaurants. We enjoyed our stay with our friends and family.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jefferson City, Missouri", "Title": "“Carriage House Inn is the best place in Missouri--bar none!”", "Author": "combs2000", "ReviewID": "UR108723403", "Content": "The owners and staff are top-notch. Our stay was superb and we'll make Carriage House Inn our home in the Branson area. Nothing negative to say--our experience was first-rate!", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Donaldson, Arkansas", "Title": "“The Carriage House Inn in Branson is absolutely wonderful!”", "Author": "katmat1231", "ReviewID": "UR101814721", "Content": "We stayed at Carriage House Inn in Branson on a trip with our three young grandsons, ages 8, 4 and 3. We all loved the Carriage House. The room was spotless, the beds were wonderfully comfortable, the employees were exceptionally helpful and friendly, and the pool was the boys' favorite place. They enjoyed the outings we took them on, but the question of the day was always, \"Do we get to swim?\" Breakfast was also very good, with plenty of selections for a filling meal. We definitely will stay there again and will recommend it to family and friends.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico, MO", "Title": "“GREAT”", "Author": "amyd78", "ReviewID": "UR87248480", "Content": "We stayed two nights. The price was excellent and the room was perfect! Breakfast was average, but adequate. One of my top choices to return to in Branson!", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“Overall, our stay was exceptional!”", "Author": "EmmaAllene", "ReviewID": "UR86176259", "Content": "This hotel is great. The rooms are clean, the beds are so comfortable and the staff goes above and beyond to make you feel welcome. Breakfast was very enjoyable - the biscuits and gravy are delicious. They have a beautiful indoor pool that my daughter loved. Overall, our stay was excellent. We will definately make this our hotel in Branson - and the location is perfect, just off the main strip so it is convenient to everything.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Nice quiet Hotel, friendly staff, good breakfast”", "Author": "john398", "ReviewID": "UR84120528", "Content": "After reading some of the reviews I was a little worried however we had a good stay last week. The staff had no issues with us bringing our breakfast back up to the room The staff was very helpful reguarding places to eat as well, and the room was nice and comfy (reserved the room the jacuzzi room which really is just a jetted bathtub but was fine for us) I would stay here again", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clarksville, Tennessee", "Title": "“This will be our home away from home!!”", "Author": "pheflin", "ReviewID": "UR83739762", "Content": "The staff was very friendly and helpful! The night we arrived and got to our room we saw that we did not have the refridgerator that we were to have. My wife called and within ten minutes they had it in the room and plugged up. The breakfast was awesome. The staff was very knowledgable about the shows and restaurants in the area. We had a great vacation! Anytime we go back to Branson this is where we will be staying.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Griffin,GA", "Title": "“What a difference it makes to stay in a family owned establishment; we felt so welcome and at ease.”", "Author": "calio507", "ReviewID": "UR81870817", "Content": "We came to Branson in early September for a little getaway before the kids started school. We desperately needed a break from our routines. We\"ve been to Branson a few times and we usually choose a place to stay based on location. My husband likes to be near the golf courses and I like the outlet malls. The Carriage House Inn was referred to us by my brother in law. He said it felt \"homey\" and we wouldn't know we were right in the heart of town. We were greeted with smiles, our rooms were clean and cozy, I loved the comfy beds, and ther staff was as friendly as they come. We will be back next time we come to Branson. Thanks again!", "Date": "October 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Pocahontas, Arkansas", "Title": "“The beds sheets on all three rooms that we tried looked like they had been slept on.”", "Author": "bseawel", "ReviewID": "UR78372744", "Content": "Where you check in looks great. The rooms are not bad but when I went to turn the covers down on the bed the sheets were pulled off the mattress and big folds and wrinkles were all over looked like someone had slept on the sheets. The pillow cases were twisted on the pillows like someone had slept on them I smelled of them and they smelt like body oder. The lady at the desk gave us another room right beside it and it was musty smelling like it had not been used in awhile the bed sheet looked almost as bad as the first room she gave us another room beside that one and the bed looked ok the room smelled musty bet we were going to keep it. Then came the worst thing of all. The manager called our room at midnight and told me that the sheet were fine and that there was nothing wrong with them and that I could just leave in the morning that we were to get out of his hotel. I tried to say that I just need clean sheets and he said that if I said \"one more word about the sheets that he would \"come up right now and throw us out\" I hung up on him and he called back and said\" Don't you hang up on me so I just sat there and said nothing and he would not hang up so I laid the phone down and we called Howard Johnson and got a room and left. I would not go back to this hotel if I had to sleep out under the stars.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stilwell, Oklahoma", "Title": "“good place to stay”", "Author": "hayleedaugherty", "ReviewID": "UR73517158", "Content": "good place to stay friendly staff/workers best room sevice quiet place to stay and big blue pool and best breakfast with biscut & gravy and juice doughnuts and milk and fun ;]", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Perfect place!”", "Author": "bessiedear", "ReviewID": "UR67229277", "Content": "The Carriage House Inn was the perfect spot for our stay in delightful Branson, MO. The staff was extremely warm, friendly, and welcoming and go above and beyond in making sure your stay is nothing less than ideal. Morning breakfast includes homemade doughnuts which are to die for....and they put them out again during the day for snacks! The location is great for quick access to the theatre district, and the rooms were very comfortable. Carriage House Inn is definitely on our list for a return trip to Branson!", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas city, mo", "Title": "“Great place to stay!!”", "Author": "awb692", "ReviewID": "UR63694128", "Content": "We have stayed here several times over the last 3 years. We always have clean rooms. Resonable rates and close to Silver Dollar City and attractions. The front desk and staff are helpful and friendly. I woud recommend the Carriage House to anyone coming to Branson. Nice Breakfast. We like the indoor pool which we use in the Spring and Fall.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springville", "Title": "“Home Away from Home”", "Author": "Singingstar22", "ReviewID": "UR63439742", "Content": "My only complaint about the Carriage House Inn was that I had to leave. My trip ended and I didn't want to go home. This place is amazing. First of all this place is as clean as you can get. Our room was so nice and clean and spacious. We had a fridge and microwave in our room which was very helpful. The cleaning staff took care of our room on our time, whenever it was convenient for us. The owner of the motel runs the breakfast room. He makes sure everyone knows where everything is, and really makes an effort to get to know all of his guests. By the time we left I felt like we'd been friends with him for a long time. Get ready to have a good time with him...he's one of the friendliest men there is! There are I Love Lucy videos playing in the breakfast room in the afternoon in case you want a break from your room and would like to watch something on TV. He also has movies he'll put in for you. Breakfast was good...he's got a lady that makes the donuts for him, but don't ask for anything specific. She makes what she wants to make and that's that. (I'm sure you'll hear that story) :) He's also got Tropical Fruit, biscuits and gravy, breads of all assortments for toast, juices, coffee, milk...I think I'm missing something, but it was all really good. They also have trays at the breakfast room to make it easier to take coffee back to your room or whatever you want. My dad would go up every morning and get coffee for everyone and there would be Bob meeting him with a tray and a smile at the door. The trays are always washed when they are brought back to the breakfast room. I watched as he made sure everything was clean as it was put back out for the next person. The pool was nice and warm...the only thing is you have to walk outside to get there and we were there in April when it was pretty chilly...so it was a cold walk back to our room. But that's no big deal. Pool is open nice and late so you can go after a show if you want to. 11:30 I think it was. But there is no clock in the pool room...so you better take a watch or something to keep track of time. There were a few pool toys there when we were there if the kids want to play with a ball or something. They were also nice enough to let me print my tickets for the Wax Museum at the desk because it's cheaper when you buy online than when you purchase at the door. They had trouble with their printer, but they got it fixed and were as helpful as could be at getting those tickets printed for me. The whole inn is so well taken care of and landscaped so beautifully. Flowers hanging on the nice white porch. Sitting areas outside. Beautiful. I felt so comfortable there. It really was like a home away from home. I will go back as often as possible. Great job Bob and Linda!! Can't wait to come back and see you again soon!!", "Date": "May 6, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mankato, Minnesota", "Title": "“Good Value”", "Author": "narroweve", "ReviewID": "UR57584789", "Content": "The staff bend over backwards for you! The rooms were clean and the beds were comfortable. The continental breakfast was nice. On our last day the owner gave a care package of extra donuts from breakfast for our return trip home. Sweet people.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston", "Title": "“Excellent!”", "Author": "Luv2Travel1017", "ReviewID": "UR52711349", "Content": "My most recent trip to Branson provided a wonderful stay at the Carriage House Inn. The rooms are very CLEAN, quiet, and well maintained. What a wonderful surprise in this price range!! The staff was very helpful in providing information I needed. My next stay will be with the Carriage House Inn!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "MO", "Title": "“Nice Motel”", "Author": "baileyba", "ReviewID": "UR49239784", "Content": "Rooms were fine, but breakfast needs a big upgrade!!!!!", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "OKLAHOMA", "Title": "“Our stay at Carriage House Inn was a good experience!”", "Author": "LESSUE", "ReviewID": "UR36370912", "Content": "Recently my Husband and I took our ninty year old Aunt on a weekend vacation to Branson Missouri, We were looking for a handy-cap walk in shower. While looking for a Clean, Comfortable, and Convient Motel to stay, and during our search your Motel was refered to us by another business. You offered to us the Cleanlyness that we were looking for, as well as the Comfort Level, and the Staff of Carriage House Inn was very friendly, informative, and professional to us and that was much appreciated! We felt that is was important to take out the time and imform you all of how pleased we were with our stay at Carriage House Inn. Because of this we will refer you to others and we would like to say \" Thank You \", and we look forwards to many more pleasant stays with you at Carriage House Inn. Best Regards, Michael and Renee Owens of Oklahoma City", "Date": "July 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "omaha,Ar", "Title": "“wow what a place”", "Author": "wtjones1", "ReviewID": "UR31184262", "Content": "after many stays in branson over the years we have found our home away from home the rates,staff and cleandlyness its the top. we had some people tell us not to stay there but anyone can have a bad expeience. a lot of the time your vacation is what effort you put into it yourself. if you go with an attitude of disapointment then suffer your own rath. the Carriage House Inn on Green Mountain Dr. needs no changes made they are all ready at the top of their game will be back often and bring lots of friends too. you really can't beat this place.", "Date": "May 30, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "arkansas", "Title": "“best of branson”", "Author": "pleasedArkansas", "ReviewID": "UR29393341", "Content": "would come back here for every stay from now on staff great hotel very clean and talk about easy access to anything in Branson and the price i would rate 4or5 star for location and friendlyness.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois", "Title": "“Extremely pleased with our stay!”", "Author": "AlexMatl", "ReviewID": "UR28964689", "Content": "Everything is as advertised on the site. Personally met will most of the staff and they were very friendly and helpful. We stayed in the deluxe suite and loved it. Very clean, and just an overall pleasant stay. As far as the biscuits and gravy goes, the gravy was amazing, but the biscuits are less than desired. I found that when you eat it though the gravy makes up for any short falls of the biscuit. Also, there is a large selection of doughnuts that are delicious. We will continue to stay at this hotel in the years that we visit Branson, MO", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, UT", "Title": "“Great Value”", "Author": "Family_oriented", "ReviewID": "UR21100446", "Content": "I was more than a little concerned about some of the reviews, but this place looked like a match in most areas. Called and spoke to the manager about the reviews and took a chance. What an outstanding choice! King room with jetted tub was great. Room was clean and accessible. Breakfast won't compete with the buffets in town, but met the needs and saved us a bunch of money over the week. Owners were ON-SITE, gracious, friendly, and attentively took care of their customers personally during breakfast. I would absolutely stay here again. Off the main traffic patterns, but great location.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "liltootle", "Title": "“Very clean, friendly staff and a good price”", "Author": "liltootle", "ReviewID": "UR20503773", "Content": "I always stay at the Carriage House Inn. I tried others but wasn't pleased.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Columbia, SC", "Title": "“Enjoyed our Stay!”", "Author": "TravelerDeb", "ReviewID": "UR20408895", "Content": "We spent 7 nights at the Carriage House Inn in September and were very pleased with our room and the entire staff. We requested a refrigerator in our room and they delivered one within 5 minutes. Daily housekeeping service was good. My elderly parents joined us on this trip and spent 3 nights. They were extremely pleased with their room and the staff went out of their way to assist them. We didn't eat breakfast, but my parents did each morning and were more than happy with the food and selection. When making our reservations, we requested a smoking room and a 1st floor room for my partents. Upon check-in, we received the exact type of room requested. I wouldn't hesitate to recommend this hotel to my friends and family. Thanks for a great stay in Branson.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fairfield", "Title": "“Would not recommend”", "Author": "LisaFairfield", "ReviewID": "UR19200853", "Content": "We stay at this hotel after Branson Tourism Center advised us that the hotel we picked off of their web site was no longer available as a choice and recommended this one. The hotel was somewhat clean. The indoor pool was in a separate building from the hotel, when we were there the temps were in the 90's and the pool house was not air conditioned. The chemical fumes were awful. The light switch in the bathroom had a short in it and had to be wiggled to make the light come on. The air conditioner made a knocking noise. The coffee pot in the room has not seen soap and water for quite sometime. We stayed four nights, on the fourth night after being gone all day our room had not been cleaned and serviced. The biscuits and gravy was awful, the lady tending the breakfast room was rude and not friendly. We go to Branson quite frequently and will never stay at the Carriage House Inn again. This was very disappointing for our yearly family vacation.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Arkansas", "Title": "“Dirty, OLD, smelly, Rude Staff”", "Author": "redwasp", "ReviewID": "UR19088377", "Content": "This place is horrible. Dont be drawn in because of a cheap rate. The staff is rude, the rooms are dirty, the breakfast they brag about is horrible.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Kansas City", "Title": "“Not a fan of this place.”", "Author": "pocorojo", "ReviewID": "UR10427960", "Content": "While the hotel was clean, our room was under the ice machine on the second floor. As a result, the ceiling in our bathroom sprung a leak in the middle of the night. The breakfast was by far the worse breakfast I have ever had at a hotel. The biscuits and gravy that they advertise on their sign was inedible. Their toaster only heated up the food and did not toast it. I will be staying elsewhere on future visits!", "Date": "October 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mexico, Missouri", "Title": "“Very nice Hotel”", "Author": "tprut5", "ReviewID": "UR8438781", "Content": "The Carriage House Inn is really clean and has a great staff. When ever we needed extra towels or even an iron they were there to provide these items with a smile. We stayed 3 nights and they cleaned our room every day and made our beds with no interuption to us or our schedule. I would recommend Carriage House Inn and I will definetely stay there again when we return to Branson. The location is awesome, could get anywhere in Branson quickly from our hotel.", "Date": "August 16, 2007"}], "HotelInfo": {"Name": "Carriage House Inn", "HotelURL": "/ShowUserReviews-g44160-d549753-Reviews-Carriage_House_Inn-Branson_Missouri.html", "Price": "$60 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3015 Green Mountain Drive</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "549753", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/84/ec/0f/carriage-house-inn.jpg"}}