{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“great location on Gran Via”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR139522403", "Content": "Good location rooms need a little more update but overall good. Not an 24 hours hostel. Could use some renovations.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marquette, Michigan", "Title": "“Nice stay.”", "Author": "GregMiller", "ReviewID": "UR119561166", "Content": "If I go back to Madrid I would stay here again. Its a mix between a hostel and a hotel. Its on the 6th floor but there are three elevators. At night a security guard will walk you up, you need to be sure to have your key and a slip of paper saying your a guest. The walls or thin but the set up is splendid. No one bothers you and the rooms have much of what one needs. There is a television, a safe that costs 1 euro a day and your own bathroom. Its small but cozy. My wife and I put two beds together to form a queen size bed. The side tables fold into the wall which gives you the ability to rearrange the room. I would recommended this place. Its in the heart of Madrid and is easy to access.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Nice, quiet, affordable place to stay”", "Author": "voyagerparlermanger", "ReviewID": "UR29251922", "Content": "The hostal was simple, clean and staff members friendly; the location (on Gran Via) perfect. Nearby all shopping, subways, restaurants and historical sites. The room and bathroom was small, but clean, and the price is great for the location.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Give it a miss, better places to stay in Madrid”", "Author": "LF0308", "ReviewID": "UR10706672", "Content": "Booked the hotel directly. Pleasant to deal with via email however thats where it ended. The require you to pay on checking in. I assume this would be because people have left during their booking. Rooms are incredibly small and I have stayed in some small hotels. Rooms have double glazing (internal and external window and blackout shutters in beween that you can lower at night. However it does not block any of the noise and Grand Via is noisy. They have a small terrace - assume this is where breakfast was served as we had a room backing on to it and were woken every morning to people talking loudly at 8.30am (great when you have been out till 4). Bathroom - very tiny! Rooms however were cleaned well each day. Building is secure at night after 11. You have to ring the doorbell and be escorted to the hotel by the night guard. The building contains about 10 hotels of sorts. Owner is more than happy to help you get to the airport as long as you want a taxi. Will not help call the AeroBus, in fact actively discourages you to get the metro, bus, etc. I had asked him to book me a taxi for 6.45am to take me to the train station (while leaving my friend to sleep on before checking out later). Was picked up obviously by some \"mate of his\" who wanted to charge me 17 euro to drive me the 5 minutes to the train station. He actively discourages my friend to get the aerobus (17-20 euro) pushed my friend to get a taxi telling her it would be \"no more than 28 euro\" - maybe a 6am but certainly not 3pm with Madrid traffic. I stayed a few weeks later at another hotel in the same building and had such a different visit. Recommend you stay somewhere else.", "Date": "November 9, 2007"}], "HotelInfo": {"Name": "Hostal Hispano-Argentino", "HotelURL": "/ShowUserReviews-g187514-d550224-Reviews-Hostal_Hispano_Argentino-Madrid.html", "Price": "$57 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via 15 - planta 6</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "550224", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5b/56/5b56bd3db5673b2eaf9bea4d6b6a29d7141large.jpg"}}