{"Reviews": [{"Content": "Nice But Lots Of Mosquitos We recently stayed at one of the Ahimsa Villas (the one near the main road) for one night. We stayed in Villa #5.We were two couples and they provided us with a 3 bedroom villa as the 2 bedrooms villas were full. After checking in, we noticed the air-con in one of the bedrooms did not work and they had to move the king bed from the non- working air con room to the working air con room (which had twin beds). So please make sure the air con is working when you make your booking.The villas is tastfully decorated, well equiped with TV in the common area and surround music sound speakers installed around the villa. Unfortuntely, some of the tastful outdoor decorations also trap water. During my one night stay at villa, total of approx 12 hrs spent (8hrs of it spent sleeping), I caught approximately 35-40 mosquitos. Most resorts and hotels in bali fumigate their properties twice a week and I think the Ahimsa should do the same. (I did not encounter mosiquito problems at my other bali hotels or villas)I also thought the size of our villa was just right for 4 adults (remember I was given a 3 bedroom villa). The villa would be too small to fit any more than 4 adults. There were only couches enough to fit 4 people. We were given a special walk in rate of US$280. I thought the property is worth around US$230.Ahimsa offers a good serivce and its staff are well trained. It has a good breakfast choice selection and they cook it at your villa. The complimentary airport transfer service was also handy. Overall, I can only give the Ahimsa a 3 star based on its little value for money, mosquito problem at our villa and its small size in the common area.", "Date": "Mar 29, 2008", "ReviewID": "UR859271627", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "3"}, "Author": "jcjchung"}, {"Content": "Too High a Price for Location and Facility First, this is a review of Ahimsa Club, one of three Ahimsa properties on Bali. The Hotel is crippled by its location - across from a busy Pertamina petrol station and just off one of the busiest intersections of Sunset Road. For a traveler looking for an idyllic resort experience, this would not be it. The beach is a good 20 minute walk and not easy to find.Each room is actually a villa. This would be similar to an all suite hotel in another market. Think Embassy Suites but with Bali designThe villas are more spacious than a hotel room, with a one bedroom unit consisting of a nice outdoor living area, an indoor air conditioned bedroom and a outdoor style (but indoor) bathing pavilion. However, since the villas are fairly densely packed together, the high walls separating the villas prevent most natural light from penetrating into the villa. The villa includes a small plunge pool and a couple of loungers, and a relaxing fountain of water flowing into the pool provides a BGM of water splashing. Breakfast is included in the room rate. A choice of a number of different menus is given, including healthy choice (fruit plate) and Japanese. Somewhat bizarrely, the breakfast is cooked in the room, rather than in a food service kitchen. It works as there is a small kitchen, but would rather just have the food delivered. The staff are very nice and well trained. They met all of our expectations. The staff are the strength of this villa. Airport pickup was fine. The hotel as a small fleet of APV Suzuki light vans that fit 4 guests and luggage comfortably. This hotel will be an excellent value at about $150-175/night. However there are other hotels with much better location and similar facilities around Bali, so I cannot recommend the Ahimsa Club.", "Date": "Mar 21, 2008", "ReviewID": "UR217207332", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "1"}, "Author": "yamanote"}, {"Content": "Understated luxury       View of villa from garden gate", "Date": "Feb 26, 2008", "ReviewID": "UR685414396", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "GeeJee"}, {"Content": "Wonderful People..........Wonderful Place !!! Ahimsa Villas is well located and away from the busy bali areas but still walking distance to fine dining and good shopping. The people at the resort would bend over backwards to make your stay perfect. The last day after checking out the offered a villa for us to rest and freshen up before our flight. great service great people. i highly recommend this place. stayed for 5 days", "Date": "Dec 5, 2007", "ReviewID": "UR336205663", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "warmjay"}, {"Content": "the ahimsa state,amazing pool villas       pool", "Date": "Nov 20, 2007", "ReviewID": "UR286818440", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "rgarzamarcos"}, {"Content": "Beware the Location The Ahimsa is a great little design-forward private villa complex with great staff and facilities. Unfortunately it's all a little too far from the beach. Tucked up on Kunti Street and off the Kunta/Legian main strip, it's great for some boutiques and a few restaurants, but mostly it's just a long and annoying march from whatever you want to go to. Like others, we glimpsed at the map and figured on a ten or 15 minute stroll from the sand, through the cool part of Seminyak. In actuality it's a good 25 minute brisk walk down the seedy bar st. of Seminyak, and as we discovered - walking anywhere in Kunta/Seminyak is not pleasant. The sidewalks are a dangerous obstacle course of varying grades, open grates and sewers. The streets are choked with traffic and the whine of motorbikes, and touts will harass you everywhere. Anyone in town over a week just gives up and rents a scooter as walking is not an option. The Ahimsa does provide a free shuttle and is very good about taking you wherever you want to go and picking you up. But we found it frustrating to have to call and arrange a ride every time we wanted to go to the beach. The beach is really what it's all about in this town - so you might as well be on or near it. It's quite expensive by most standards, and ludicrously high for Bali/Indonesia. That's fine - you get great service and a nice villa. It's very quite and private and even full you'd hardly know anyone was there. But for much less you could be in a clean and comfortable beach-side unit. It's not even close to ku de ta or the ritzier end of Seminyak near the Oberoi/Legian etc...The only good thing about the location is being close to the Bali Deli, but even that wasn't much use as we had a great kitchen but nothing to cook with in our unit. Ahimsa also offers another property much closer to the beach. If this estate offers the same space, privacy and great design I'd consider staying there next time.", "Date": "Oct 8, 2007", "ReviewID": "UR960636656", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "2"}, "Author": "armie_151"}, {"Content": "Absolutely Perfect We just got back from a wonderful holiday in Bali and stayed in a 2 bedroom Villa at the Ahimsa on Kunti Street for 10 nights. We stayed in Villa 4. The villa was gorgeous and just like the photos the pool runs alongside the living room. I poked my head into a couple of the other two bedroom ones, and their layouts were slightly different with the pool set slighly further away from the villa. I prefered the layout of villa 4. The two bedrooms each have their own idental en-suite bathrooms with huge sunk-in natural stone bathtubs in each. There is also 3 TV's, one in the living room and one in each of the bedrooms.Staying at the Ahimsa is like staying at a 5 star hotel, except there are only about 8 villas so the service is even better. On this trip i also stayed at Sekar Taman 1 off Laksmana Street; Sekar Taman 2 (Villa Kipas); and the Alam Shanti in Ubud. The service and the food at the Ahimsa were by far the best of all the places we stayed. Each morning (at whatever time you decide) they come and cook your breakfast in the villa. There's ample choice: any type of eggs and bacon; omlet; narsi goreng; mei goreng; banana pancakes; japanese breakfasts; fruit, musli and yogurt etc. They clean your villa at whatever time suits you, and each evening just like a hotel, they come and turn down your beds and leave chocolates and flowers on your pillows. There is also the usual array of complimentary toiletries like shampoo, conditioner, body wash, soap, shower caps, ear buds, tooth brushes and toothpaste, moisturising lotion etc. At Sekar Taman 1 and Villa Kipas there was just a bar of soap. Also, at the other villas there was just 1 TV and without all the extra english speaking chanels that the Ahimsa subscribe to. Although you cannot fault Villa 4 in any way, it is one of the villas that remains in the original condition it was built in 8 years ago. They are currently in the process of renovating the villas to an even higher standard, like the ones at the Ahimsa Estate/Beach location which were built last year - although you would never know as the place is so peaceful and quiet. Its like a perect tropical romantic oasis. I did check out the newly renovated villas on Kunti, and the villas at the Estate/Beach, and although it's harder to get any nicer - they were! They are simply stunning. But as the older villas are just so gorgeous too, you wouldnt be disapointed if you were staying in one of them. Location wise the Ahimsa on Kunti is great. It's opposite the Bali Deli which has everything you might want: from alcohol, fresh fruit and veg; toothpaste; sunscreen; bread; cheeses; parma hams; sushi; oysters; hot dogs; bread etc, and a cafe attached. It's next door to Prana Spa, which has gorgeous spa packages. Although its quite expensive by Bali standards, its still cheap by Australia/English/American prices. Its also in easy walking distance to lots of shops, restaurants, spas, etc. The Ahimsa Estate/Beach would probably be my prefered location though. Although it's a short drive to shops and spas, its only a minutes walk to the beach; its opposite Ku De Ta; and in easy walking distance to all the trendiest bars and restaurants in the area. Both Ahimsa locations are great though. Unlike many of the other villas, the Ahimsa also offers free transport within the Kuta/Legian/Seminyak area. This was so handy and saves you a small fortune on taxis. All in all, although the Ahimsa is a little more pricey than some of the other villas, it definately seems worth it. The villas have no cheap finishings or furinshings. Attention to detail is obvious as is every modern comfort and luxury. The staff are so relaxed and friendly, nothing was too much trouble. We would definately love to stay here again!", "Date": "Jul 10, 2007", "ReviewID": "UR440441874", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "lucya82"}, {"Content": "perfect       the beautiful spa next to Ahimsa", "Date": "Jul 9, 2007", "ReviewID": "UR338551035", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "MJMJMJ"}, {"Content": "Excellent Villa  The Ahimsa Beach was impressive and I consider it a good value in the villa segment. The accommodation features a private plunge pool with cascading waterfall, outdoor living area and kitchen, air conditioned bedroom quarters; and, outdoor bathroom. The staff is very courteous, knowledgeable and helpful. If you desire peace, tranquility and a modern appeal, The Ahimsa Beach is your destination. It is difficult to categorize the property as a hidden gem due to the high price point; but, a value within the mid-luxury villa segment.", "Date": "May 6, 2007", "ReviewID": "UR790627846", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "mjcasta"}, {"Content": "Second time around - not disappointed For those who dont want the hustle and bustle of hectic [----] Kuta, and want to be close to the hip cool crouds at the multiple beachside bars/restuarants and boutique clothing shops in trendy Seminyak, The Ahimsa is second to none. This was our second stay at The Ahimsa in less than a year, and well worth the visit once again. We stayed there in April 2006, just the two of us, but this time took two friends with us to share the experience.Both friends were a bit sceptical that The Ahimsa website accurately represented the facilities (many hotels put their absolute best rooms in their marketing and leave you disappointed when you check into your room), but they had no reason to be. They were blown away by the privacy, tranquility, and sheer size of our three bedroom villa with private pool. It was sheer bliss. The staff are always smiling, respect your privacy so much so that they are almost invisible until you call for them, and provide prompt, professional service that would rival some of the best hotels in the world. All staff have excellent English speaking skills for those of us who cant speak a word of Bahasa Indonesian, and are more than happy to arrange absolutely ANYTHING you could want. Breakfast is included in the room rate and is cooked/prepared for you every morning in your villa at whatever time you like. Transport within the local Seminyak/Kuta area is free and provided in clean, new, fully airconditioned comfortable mini vans that can also be booked for a small fee for longer trips around the island. The staff will make your restaurant and spa bookings, and the security staff will even stop the traffic in front of the villa to allow you to cross the road!!Bali Deli is literally 50 metres away, and fantastic restaurants like Ku De Ta, Cafe Warisan, La Lucciola, Gado Gado and many many more excellent places to eat. There's a plethora of great shopping in the area as well....everything from outdoor furniture and water features and stone carvings, to boutique clothing and jewellery stores. We'll definitely be back!", "Date": "Jan 10, 2007", "ReviewID": "UR955459415", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Golfygolf"}, {"Content": "Ahimsa - so sad leaving! We stayed at The Ahimsa for 6 nights over Easter and loved every bit of it. We were met off our flight with cold towels and bottles of water for the trip to Seminyak. We stayed in The Ahimsa Club part, a one bedroom villa. The beds are big and comfortable, the private pool is inviting and the living areas well appointed. Breakfast was prepared every morning in the villa, and for $20 you could get a relaxing one hour Balinese massage by your pool! It鈥檚 location is very handy 鈥?right across the road from the Bali Deli (full of delicious imported deli items and a great caf茅 and garden) and a short walk to shops, boutiques and restaurants. The complimentary car service will also drop you off and pick you up from other places like KuDeTa and local shopping centres, or the beach. Each night someone came through and turned down the bed, lit mosquito coils and cleaned up. And the staff were so friendly, nothing was a problem.For us, we don鈥檛 go to Bali for the beaches 鈥?there are better ones elsewhere (such as Nusa Lembogan - off the coast of Bali - or over on Lombok). It鈥檚 about staying and being pampered in such luxury villas like The Ahimsa - with easy access to restaurants and shops and your own private pool and deck for a few days of RR. We would definitely stay at The Ahimsa again, and are converted to the Seminyak area of Bali.", "Date": "Apr 24, 2006", "ReviewID": "UR156415372", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Ecuatoriana"}, {"Content": "The Ahimsa itself is the destination! The main thing I liked about the Ahimsa was the tranquillity. Apparently the Ahimsa was full during the 2 weeks we stayed there however it felt at times as though we were the only people there! The Villas are large, comfortable and are refurbished to a high standard - the privacy of your own swimming pool is fantastic you never have to leave. We have been to many places over the globe - but this was just surreal. The staff are fantastic - they are so friendly and not overbearing. You have to take a tour with the staff around the island they will take you to the most beautiful sights, and ones that the normal tour guides wouldn't take you. We also tried the Ahimsa BBQ, you have to love sea food, but it was sensational. You have to try the various different spa treatments offered to you in your own villa... we just got a massage but it was so relaxing. I really recommend staying at the Ahimsa Villa's its the best place to stay for getting away from the hustle and bustle of city life. But if you want to Party Kuta is only 20 min away and you can organise your own driver, my friends and i felt like celebrities while we stayed there, i'm just glad we choose to stay there, and we have already booked our second trip next summer!!!", "Date": "Apr 12, 2006", "ReviewID": "UR599208268", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "No Retreat Having never been to Bali before and looking at the maps, you would be convinced that you were a stroll from the beach, and 10 minutes from the Tahna Lot temple, famous for its sunsets. We booked for two whole weeks and stayed 4 nights! The beach was at least 30 minutes away, so take fresh water for the trip, and the temple, well expect 1 hour each way in a taxi ! Believe no one and barter for everything - nothing is 'fixed price'.The Ahimsa is directly on a busy road; so do not expect any silent nights. Whilst there were security guards around the entrance, we could open our door in a millisecond using a credit card, so this left us uneasy. And by the way, get out around 4pm as they 'fog' the whole area to aggravate the mosquitoes - it certainly didn't get rid of them - we had 78 after one short spray of Baygone in our bathroom alone!Instead, head to Ubud - much closer to the real Bali, with more genuine trustworthy locals, a slower pace of life and padi fields for your back garden - far better recommended.", "Date": "Oct 6, 2005", "ReviewID": "UR717946660", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "銉忋儘銉犮兗銉?#x201d;   showReview(19956545, 'full');", "Date": "Aug 18, 2008", "ReviewID": "UR782574499", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儝銉犮偟   showReview(19955739, 'full');", "Date": "Jun 2, 2008", "ReviewID": "UR223624699", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偩銉笺儓銉淬偅銉?#x201d;   showReview(19955424, 'full');", "Date": "Nov 14, 2007", "ReviewID": "UR664314017", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "琛屻亶灞娿亜銇熴偟銉笺儞銈广伄銉撱儵   showReview(19955204, 'full');", "Date": "Aug 2, 2007", "ReviewID": "UR355478813", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鑷垎娴併仹姘椼伄鍚戙亸銇俱伨銇?#x201d;   showReview(19955006, 'full');", "Date": "Jan 5, 2007", "ReviewID": "UR533486521", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儍銉椼儷銇曘倱銇綋楱撹珖...   showReview(19956280, 'full');", "Date": "Feb 13, 2004", "ReviewID": "UR398145209", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈兗銉椼兂銉儞銉炽偘銇偣...   showReview(19956279, 'full');", "Date": "Feb 13, 2004", "ReviewID": "UR542502739", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鏈€杩戙€併偄銉掋儬銈点偍銈广儐...   showReview(19956065, 'full');", "Date": "Aug 26, 2003", "ReviewID": "UR727056904", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "7/12銆?4銇俱仹3...   showReview(19956014, 'full');", "Date": "Jul 28, 2003", "ReviewID": "UR117319264", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偙銉笺偡銉с兂銆併偆銉炽儐...   showReview(19955994, 'full');", "Date": "Jul 9, 2003", "ReviewID": "UR790818133", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g469404-d556737-r14628552-The_Ahimsa-Seminyak_Bali.html", "HotelID": "556737", "Price": "$235"}}