{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Clean, Cheap, Basic Base for Holiday in Berlin”", "Author": "Sarah H", "ReviewID": "UR127455781", "Content": "Stayed here as part of Easyjet holiday deal and wanted somewhere cheap to stay in a good location. I really recommend staying here if on a budget! Excellant location, 2min walk to U bahn and near loads of cafe/restaurants. Great for getting around by public transport. Room was lovely, cleaned daily, amazing shower, spacious room with ample storage, huge wardrobe a safe deposit box and free wi-fi if you ask at reception for password. Had breakfast one day here- usual spread of breads, meats, cheeses, cereal, juice and coffee. Nice enough but a bit pricey at 8 euro pp when you can eat far cheaper outside of hotel. The hotel itself was clearly being renovated at the time so I expect it will be far more modern soon. The only points that are a bit down is 1- a dodgy lift. Very small and old and creaky- I took the stairs when I did not have luggage. 2- the staff on desk. Do not stay here if you want helpful friendly reception desk staff. We stayed 5 nights and none of the staff over this time were anything but rude to us even when asking simply for a map of area or even the nearest post box!! Having said that though the hotel room itself is the perfect base for exploring Berlin. Buy a day rider pass for 6.30 euro and ride the tube all day!!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Cheap, Cheerful, Excellent Location!”", "Author": "Gibs1012", "ReviewID": "UR126291813", "Content": "I stayed here in December with my boyfriend for 3 nights, to visit the Christmas Markets. The hotel was a bargain at 40 euros per night. It is very basic, with outdated decor, but it was absolutely spotless, which is the most important thing! The hotel location was absolutely amazing. It is just off Kurfurstendamm, which is great for shopping (any designer you can think of has a shop along there!) and is about 20/30 minute walk to the Kaiser Wilhelm Memorial Church. It is close to the Adenauerplatz train station, which is just 1 stop along from Charlottenburg Palace. It is also pretty easy to navigate your way around to areas such as the Brandenburg Gate and Museum Island. Overall, for the price I don't think you can beat it. If you are looking for a hotel you want to relax in and watch TV and eat nice food, this isn't the place for you. But, if like me, and you just need a place for sleeping & getting ready for a day out sightseeing, then it is perfect.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hasselt, Belgium", "Title": "“Basic but clean, good location”", "Author": "bvanmaele", "ReviewID": "UR126031189", "Content": "I was in Berlin for the ITB Trade Fair. AGON Lichtburg is well located in the city centre, near the Ku'dam. The desk clerk was friendly and helpful, offered to call a taxi when I needed one. The breakfast was nice, with a quite large choice. The room was very basic and could do with some renovations, but at least it was clean. My colleagues had problems with noise, especially the rooms close to the elevator. When you need a clean place to stay at a affordable price, without any luxury, then this is an option for you.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pamplona, Spain", "Title": "“Good hotel”", "Author": "Miki_10", "ReviewID": "UR124736396", "Content": "Nice warm and clean. Breakfast buffet. Situated in a quiet area.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“No complaints whatsoever ever”", "Author": "Annie52", "ReviewID": "UR120864755", "Content": "We have just returned (yesterday 19 th Nov 2011) from spending two nights at The Agon Lichtburg Hotel in Berlin. We paid an incredible £13.50 per night each on a room only basis-obviously! The hotel is charmin.Yes it IS a little dated,but it's fine.Our room was on the first floor at the front of the hotel,we used the old lift -as we had our cases -but used the stairs the rest of the time. Our twin room had a long mirror just inside the main entrance door,to the left and opposite this was the bathroom-with a frosted glass door( a tad unusual!) then there was another interior(glass door ) into the bedroom. We had lovely beds with fresh laundry,a wardrobe,two easy chairs and a desk.Also a flat screen tv. If I'd have remembered I would have packed a travel kettle as there were no tea coffee making facilities( but in fairness to the hotel-none are mentioned in the description) The bathroom had a white suite,a smallish bath,with an adequate shower,also toileteries(for men?!) and a hairdryer. The very neat and quiet,parquet floored lounge area had two comfy settees next to the tv and Internet point.One criticism-I wish the hotel had provided free wifi - we would have stayed in to use our laptops and had a beer or coffee,instead we went out to The Hard Rock cafe(a good 10 min walk away) The staff were very helpful and quite pleasant. Outside there's a sign saying that the hotel offers bike hire.Turning left out of the hotel and 200 yards up the road,was a supermarket (Netto) turn right and there was a very nice cafe almost next door,we had pastries and coffee here for just under €4 as we were on room only tarrif. €8 for breakfast we thought a tad expensive. Within a 5 min walk is one of the shopping streets.....be warned....they are all the top brands,with security people on some of the door entrances!! You can catch a tour bus on this street...there are lots to choose from.We bought a €20 ticket from on of the newspaper stands for The Yellow tour bus,which takes approx 2 hrs to get around this very large city and lasts 24hrs. if we was to return to Berlin,we would stay at this hotel again,but would allow extra spending money for taxi fares or be prepared to hop on the metro to get to more popular areas at night time,as it was quiet in the location of the hotel. Oh and one last thing,we flew from Manchester with Easyjet into Schonfeld airport-we thought we'd read that we could catch a 109 bus almost to the hotel....we were wrong,the 109 runs from a different airport! As we had arrived on a Friday night after work and at 21.20 we decided to plump for a taxi which cost just over €40 (€35 going back to the airport on Sunday)", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Good value, excellent location.”", "Author": "Allthingshorsey", "ReviewID": "UR118415994", "Content": "We stayed for four nights, the rooms were clean and comfortable, some small cosmetic repairs were required (ceiling paint in the bathroom dropping off, broken wardrobe locks). Breakfast was excellent, it was included in our package, and consisted of juices, cereals, 5 meats, 5 cheeses, scrambled egg, boiled eggs, good selection of breads. Beer could be purchased at a reasonable price and the lounge area where the public computer was located was comfortable. Absolutely no complaints at all.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Vantaa, Finland", "Title": "“Tunnelmaa a´la aus der Reihe Derrick”", "Author": "Timo A", "ReviewID": "UR118255485", "Content": "Hyvä perushotelli matkaajalle jolle hotelli on vain yöpymispaikka. Huone oli siisti (tosin hieman kulunut) ja näkymä ikkunasta Paderborner Strasse:lle. Liikenteen melu ei häirinnyt kun ikkuna oli kiinni. Aamiainen hintansa arvoinen (8 €). Henkilökunta erittäin ystävällistä ja avuliasta. Ensi vaikutelma hotellin ulkonäöstä ja sisätiloista toi mieleen suomessakin esitetyt Derrick ohjelmat. Yleisissä tiloissa olisi voinut nähdä Derrickin istuvan pöydän ääressä haastattelemassa epäiltyä jne... Yhteys Tegelin lentoasemalta suoraan hotellin läheisyyteen Adenaurer Platzille bussilla 109 (nopea ja kätevä). Muut yhteydet kaupunkiin bussilla M29 tai U:lla vaihtaen jollain asemalla toiseen U- tai S-linjaan. Kaiken kaikkiaan hyvä valinta. Vinkkinä niille jotka eivät raaski maksaa aamiaisesta, hotelli kadun päässä sijaitsee NETTO-myymälä josta saa kaiken tarvitseman TOSI edullisesti.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "", "Title": "“Medium hotel”", "Author": "arhipbogdan28", "ReviewID": "UR117853093", "Content": "The staff, service & breakfast were ok, but the aspect of the hotel is very rusty. (old communist hotel). For one or two days it's ok but definitely not for a longer vacation.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Loved It & Great Value for money!”", "Author": "Kie-and-Cris", "ReviewID": "UR112065585", "Content": "Although this hotels decor is dated slightly, it is not as worn and tired as you would think, the hotel has a charm about it that you cannot help but warm to! the staff were extremely friendly and helpful and the location was impeccable just of the Kuffurstendamm and short walk from the Adenaurplatz station, great value for money! my only complaints would have to be: the expensive inhouse breakfast available at Eight Euros a piece with nothing but corn flakes and some somewhat stale looking bread, the only other complaint would be the expensive room service, one euro a can of fanta from the front desk for example works out at about 3 euros if delivered to room!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kharkiv, Ukraine", "Title": "“OK”", "Author": "snowtanya", "ReviewID": "UR73167794", "Content": "The Hotel is in a nice area, close to a subway station, a bus stop and Kurfuerstendamm and is quite easy to find. It takes about half an hour by public transportation to get to teh Reichstag area. The hotel definitely comes from the 70's and its decor and room equipment & furniture have not been changed since. However, the bathroom was newly renovated and clean. The breakfast was plentiful and good. The staff was friendly.", "Date": "July 31, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "northen ireland", "Title": "“nothing fancy”", "Author": "snowball123", "ReviewID": "UR57703978", "Content": "we stayed here for 3 night recently the rooms are very 70's style but clean the breakfast was great with plenty of choice. The tv in the room only has cnn in english which isnt good for when you get back from some sightseeing. I would not say this is not a 3 star hotel but more like a 2 star but we got a really good deal £100 for 3 nights so couldnt really complain it is very close to u bahn stations and we found it very easy to get about from the hotel.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glyfada, Greece", "Title": "“nice but nothing to exciting”", "Author": "magistros", "ReviewID": "UR56831277", "Content": "From the airport take bus 109 and get of at the square very close to the hotel. Very good location, near the metro station. The staff very helpful and fast. They change a lamp in the bathroom within 5 minutes. Breakfast plentiful. Room standard, but clean.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Norfolk,England", "Title": "“Exelent value”", "Author": "betty58", "ReviewID": "UR49644006", "Content": "I booked on lastminute.com for just £ 67.40 for 2 night double room. Very clean, good location, nice breakfast. If You flight to Tegel airport 21 min by bus 109 to stop near hotel. From Schonefeld bus and U-bahn 7about 50min. Close to Potzdam and lake Wanasee.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bath", "Title": "“Straightforward 3 star hotel. Pleasant, helpful staff in a quiet yet easy to find location”", "Author": "IgnatiusJBath", "ReviewID": "UR48810553", "Content": "£42 per room per night including breakfast, booked through last minute.com. Situated just off the K'damm by Adenauserplatz in Charlottenburg & 250 yards from the U7 line U'Bahn. Couldn't fault this place and will definitely go back. Easy to get to/from Schonfeld airport via the U7 line adds another incentive. Good bars and restaraunts nearby yet its tucked away in a quiet side street and with 24 hr reception it caters for all ages.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Tel Aviv", "Title": "“Not worth the money value”", "Author": "chen_yac", "ReviewID": "UR46514124", "Content": "I didn't expect much but I was disapointed, we had no light in the bedroom and even though we asked everyday it wasn't fixed until we left. Breakfast was OK, the room was small but clean. comparing to freinds that stay on the same dates in a hotel with the same reating - they piad less and got a lot more (bug rooms, very good location and great breakfast).", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“comfy beds and 4 star breakfast”", "Author": "scallywag22", "ReviewID": "UR27917893", "Content": "We stayed one week and we heartily agree with previous reviewers. While not a 4 star hotel by any means- there's no chair in the bedroom and the TV shows only CNN, for a tourist they probably don't come any better. We have stayed in 4 star hotels at double the cost and you still have to pay for breakfast on top of that! The bathroom and linen were spotless. 8am seems the busiest time for breakfast so it's much more relaxed between 7and 8, or after 9 if you are feeling lazy. We used the S line much more often than the U as that goes North and South, while most sights are East of the hotel locaton. Although you can take the Adenauer U up to Wilmersdorf, which onlt take one minute, there is sometimes an 11 minute wait between trains. It takes only 10 minutes to walk directly , on level ground, up to Charlottenburg station for the S train [Wlmersdorf and Charlottenburg adjoin] We arrved and used the U as Adenauer was so near but realised that not only is the airport express faster [38 mins v. 1hour] but you can see the countryside as it is not underground. It is a few minutes walk between the terminal and airport but no need to catch the bus as you do to the U at Rudow. The location means it is excellent for a trip to Potsdam-less than half an hour, with some nice views and a rest for weary feet on the journey Probably the only gripe is the 8 euro an hour charge for wifi in the hotel. It costs only 40 cents per half hour at the internet cafe on the main sqaure by the U, 50 cents elsewhere. Although there is free access to the net on the hotel PC it is on a first come first served basis and is very very slow. Any time we were lost and looking at a map we were offered assistance to find our destination We saw all major and many minor sights of interest without organised tours, and with the ABC card, there was no extra cost for Potsdam and Sashenhausen Concentration camp.[ we spent 4 hours there- it is a 'must-experience'. The area of the hotel is a 'comfortable' one for walking out in the evening. A good choice unless you want to go quickly back to your hotel from the major sights during the day. It takes about 20-25 minutes to get back from Friedrickestrasse station, which is quite central. Do walk a lot. We happened upon local events and places of interest simply because we did so.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "cork", "Title": "“Excellent value basic 3 star Hotel”", "Author": "mick0214", "ReviewID": "UR25262738", "Content": "Stayed in Agon Lichburg from 22/02/2009 for 4 nights. Hotel decor needs updating but bedroom and bathroom were very clean and warm.Fine big double bed and ample wardrobe and dresser space. TV was limited to 1 english speaking channel ie CNN. Breakfast buffet was excellent with a wide selection ie Juices,cereals, cheese, cold meats, scrambled & boiled eggs, fruit, breads and cakes. Reception desk very friendly and free internet access in lobby. Buy your 3-day or 7 day pass at machine outside Airport Terminal (7 day costs €32 and is valid on all S train, U train, Buses , trams and Ferries) Validate ticket in machine as soon as you get on board bus and put in safe place as you will not have to use it again unless asked to show it by ticket inspectors. Directions to Hotel from the Airport Schönefeld with bus 171 in direction Rudow and with U 7(Metro)in direction Spandau until the Adenauerplatz.Head south down Brandenburgische for 300M and Hotel is on your RHS. Step outside Hotel front door,turn left and walk 60M to a \"PLUS\" supermarket where you can get all your needs at good prices...bottles of beer for 70C etc. Get on bus 100 or 200 at Zoological gardens to get free bus trip to include all major attractions.You can get on/off as many times as you want, just take note of stops to catch bus again. The Sachsenhausen Concentration camp is to the north of Berlin Take U metro from Adenauerplatz in direction of Rudow until Yorckstrabe where you can take S-bahn line S1 to its northern terminus Oranienburg (make sure that your ticket is valid for zone C):it takes about 50 minutes. Then it takes about 20 minutes to walk from the station to the camp but it is easy found,or there is a bus 804 which leaves from the square outside Oranienburg station (take the bus towards Malz as far as the memorial - Gedenkstätte), but the service is not very frequent (hourly, or every 2 hours on Sundays). Take S-bahn line S1 in other direction to its southern terminus Wannsee where you can get a free AGV ferry with your ticket on the lake.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Warsaw", "Title": "“A nice hotel with a good location”", "Author": "Vannegen", "ReviewID": "UR24494640", "Content": "The main reason why I chose to stay at this hotel was its bargain price; the other was it's good location. It's easy accessible from the Berlin main central station (a few stops by S-Bahn and then about 10 min. walk, or yet another stop by U-Bahn and several minutes walk), it also has an excellent connection with the Tegel airport (5 minutes walk from the hotel to the Adenauerplatz, then a direct bus 109 to Tegel). The hotel itself is a kind of a grey, easy to overlook building with absolutely nothing special about it. The lobby is small and in a style of 70s modest, nowadays outdated look. The same applies for a tiny funny elevator that seems to barely move (but it does), as well as for corridors. The room I stayed in was OK. Spacious enough, with a nice bath. The breakfast was good, with enough variety of food. One of big pluses of this hotel is also its proximity to the famous Ku'damm street, as well as the surrounding area that is quite elegant and has a lot of beautiful, well kept buildings (just take a walk through the side streets around the hotel!). It total, this spot seems a good place for its value. If you look for an extraordinary hotel experience, you should rather look elsewhere, but if having a nice, clean place to stay overnight is the main issue for you, you should rather not be disappointed.", "Date": "February 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hamilton, United Kingdom", "Title": "“Basic, but ok if you're on a budget”", "Author": "saoirsechick", "ReviewID": "UR24231619", "Content": "On arriving at the hotel we found the room to be basic but clean and functional. The beds were comfortable and we had a fairly large tv in the room which had CNN as the only english speaking channel (but who goes on holiday to watch tv?). The breakfast was substantial with cereals and fresh fruit, breads meats and cheeses as well as scrambled and boiled eggs and hot dog sausages. The only problem we had during our stay was that after 2 days our room had not been cleaned. I went down to reception to ask for clean towels and she said that the room had not been done because we had taken the key out with us. However the next morning the maids let themselves into the room with their own key while we were still in it! The other couple we were travelling with had no problems though. Their room was cleaned daily! The hotel is only 5 minutes walk to adenauerplatz u bahn station and outside that is the bus stop with frequent buses to zoo station where you can get the s bahn to all of the main sights in the east of Berlin. The Ku'dam is only a 5 minute walk away for all of the designer shops etc. 5 minutes on the bus will take you to the other end of the Ku'dam for KaDeWe and the Kaiser Willhiem Memorial Church. The hotel does not have a bar but there are plenty of pubs and restaurants near by as well as a supermarket and a 24 hour shop, so there is always something available!", "Date": "February 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dundee, Scotland", "Title": "“Beautiful Berlin”", "Author": "sarah82dundee", "ReviewID": "UR24185677", "Content": "Stayed in this hotel when we were visiting the city of Berlin for 4 nights. Was really impressed with the location of the hotel. In a quiet and seemingly affluent area also near to lots of shops & restaurants. The hotel is a mere 3-5min walk from the nearest Ubahn station. Public transport in Berlin is second to none and definately made my trip all the more enjoyable allowing us to see everything including the more far away attractions. The hotel has a small reception which is manned 24hrs. The staff all spoke English and were always very helpful. Breakfast was served between 7am & 10am and there was a huge choice of cereals; bread; rolls; cold meats;fruit;eggs etc. The rooms were quite small and basic but the rooms were incredibly clean and the beds comfy. Our rooms were cleaned everyday and the maids did a fantastic job with changing towels and linen etc. We had fabulous time in Berlin and would really recommend this hotel for a good central base. There is also a great restuarant at the bottom of the road right opposite the Ubahn station called Block House. Best Steak i've ever tasted!!", "Date": "February 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“Outstanding value; very good location!”", "Author": "EmmaRew", "ReviewID": "UR20067567", "Content": "The public transport links in Berlin are so good that all areas of this beautiful city were quickly and easily accessible. The hotel is basic but scrupulously clean - the equivalent in terms of facilities to a British Travelodge. Incredibly good value, especially as the prices include an unlimited buffet breakfast. My husband and i would certainly stay there again!", "Date": "September 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "doncaster", "Title": "“Great Value”", "Author": "holsmanDoncaster", "ReviewID": "UR19340189", "Content": "We stayed at the Lichtburg in August and i have to say that it offers great value for money and is very close to public transport to get to all parts of this massive city. The breakfast was great , offering hot and cold food and the rooms were comfortable and clean. Not the most modern of hotels but very conveniant and helpful staff when we required more pillows.Would deffinatly reccommend this for people looking for good value for money. The hotel is situated on a quiet side street so a good nights sleep is guaranteed.", "Date": "August 25, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brighton", "Title": "“Great location and great breakfast....”", "Author": "nicsie", "ReviewID": "UR17365855", "Content": "Just had a long weekend in Berlin with my mum. Hotel location was excellent with a U-bahn station 5 mins walk and bus stops near by. The public transport is incredibly easy to use with most bus stops showing which buses leave, where they go and how often. Can get single/return or day tickets and is cheaper than public trasnsport in England. Once you have a decent map you will negotiate the buses no problem. You can buy tickets on board or at machines which have an english option on the screen. This hotel was located just off the kurfurstendam, which is a long road leading to the Europa Centre - shoppng area and square with buskers, fab ice cream cafe's and amazing old church with modern chapel attached, which looks ugly from the outside but is amazing inside. The kurfstendam starts with the most designer shops and becomes more high street the further towards the Europa centre you get. Eating - recommend Charlottenburg area- try and wonder off the beaten track and find some great authentic german cuisine and beers. Restaurants off Kurfurstendam are more expensive. Visit the statue in the centre on a big roundabout -forgotten its name. Climb it and get the most amazing views at the top, also check out the rebuilt cathedral- beautiful. The hotel was basic but adequate and we were hardly there, en-suite bathroom was fresh and clean and tv in room. Breakfast was great - fill up ! No bar in hotel. There are bars and restaurants nearby if you do not want to stray too far....", "Date": "June 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "CO", "Title": "“Okay, Okay, Okay”", "Author": "Matt_in_CO", "ReviewID": "UR16294118", "Content": "I told my travel agent to find someplace clean, affordable, and near a metro stop. This was exactly that. The place was clean, but the decor could use some freshening. The beds were comfy. The breakfast was included and exceeded my expectations. It was pretty much everything you would want in a continental breakfast and even had some additions like scrambled eggs. Food in Berlin is expensive so it was nice to not worry about one meal daily. I would recommend this place and overall it was exactly what I expected.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Oxford UK", "Title": "“Did not care much for the place”", "Author": "splithairs", "ReviewID": "UR10390552", "Content": "From Oxford UK Date Oct 2007 The place was not so clean. The room had a bad smell. There was hair on my sheets. Only some of the staff were friendly. I did not feel real comfortable here. I had to clean the room myself. It was good we did not spend much time in the room. The breakfast was nice!", "Date": "October 28, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manchester", "Title": "“Good base but nothing special”", "Author": "DAMC", "ReviewID": "UR10248005", "Content": "I stayed here last month and found the hotel to be OK if nothing spectacular. The carpets are a liitle worn and the hotel has a slightly tired feel to it but it was clean and the staff were helpful and spoke good English. The rooms were a good size (as all German hotel rooms seem to be) but there was no Enlish language channel on the TV. Breakfast was fine and overall the hotel is pretty good value for 68 euros a night. Sitauted just of Kurfurstendam and 5 mins from U-bahn Adenauerplatz, it is well located for exploring the city. If I was staying in this part of Berlin again, I would give the hotel some consideration.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol, UK", "Title": "“Basic but OK”", "Author": "Bantamspaul", "ReviewID": "UR8091846", "Content": "Went with a bunch of lads to celebrate a 40th birthday (perhaps \"lads\" is stretching it!) Hotel is basic but comfortable enough and near enough to the U-Bahn to make it easy to travel around. Staff are friendly and breakfast alright. Berlin itself is great.", "Date": "July 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, New York", "Title": "“Good Location, Friendly Staff, Excellent Value”", "Author": "TravelGal58", "ReviewID": "UR7193500", "Content": "Although not fancy, the accomodations were clean, comfortable and in an excellent location which was both attractive and convenient to shopping, restaurants and public transit. I found the staff to be helpful and friendly - they tolerated my poor attempts at German with good humor and fair English. We arrived quite late, well after midnight and found that the night clerk had been on the lookout for us as he walked out to meet us when I pulled up in front. The downstairs lobby is small but functional and the hallways are spartan, no extra money was spent on furnishing/decorating - my boyfriend wanted to know if we were staying in a barracks. However, once in the room, we were comfortable with feather comfortors, platform beds, a squeaky clean bathroom and shower gel provided by the hotel which I liked so much, I have been seeking to buy it for myself. The buffet breakfast provided is very good - a full buffet with a variety of hot & cold food items - and an excellent value, especially if you consider the price of the room. If you exit the lobby to the street, turn left and proceed one block, you will find a convenient, well stocked little grocery store which should have just about anything you require at a reasonable price. Just before crossing over to the store, you will see a bistro/restaurant on the left - I don't recall the name but the food smelled wonderful and everyone inside appeared to be having a good time. Unfortunately we did not get to eat there but I was told that it is quite good. If/when I return to Berlin, I will stay here again.", "Date": "March 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Good value for money, considering ....”", "Author": "Belfasttravellers", "ReviewID": "UR6775112", "Content": "We both stayed at this Hotel for 3 nights in February 2007. The hotel is located in the Charlottenburg area, which is a 40 minute train journey from Schoenefeld Airport. The Hotel Agon has a three star rating, which I found to me a bit misleading. The hotel has seen better days, and is need of a complete refit. It has a tired, '70's Eastern Bock' feel about it. The rooms are large, and basic. Bed, table, television, wardrobe and a chair. There are no tea or coffee making facilites. This said, the room fitted its purpose, just someplace to sleep and get ready. It was clean, tidy and warm. The bathroom had a bath with shower above it, and no shower curtain or screen, which meant that if you took a shower, the whole bathroom was soaking wet. Breakfast was pretty good. There was a selection of meats, cheese, bread and fruit as well as eggs and juices, tea and coffee. All this said, I feel that this hotel makes a good base to go and explore a city. If you see a hotel as just some place to say and keep warm, sleep and eat, then it will suit fine. I havent stayed in any other berlin hotels, so cant compare it with others, however, if we return, we'll probably stay someplace else.", "Date": "February 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“A good value for the money”", "Author": "BerlinFan", "ReviewID": "UR6093674", "Content": "This hotel is located in the western part of the city, two blocks south of Adenauer Platz on the Kudamm. The hotel's proximity to the bus and subway lines was a real plus. Our room was small, but this was made up for by other amenities such as the recently remodelled bathroom and generous closet space. We stayed in November and the room temperature was quite satisfactory. The reception area was brightly lit and the breakfast room was easy to find on the first floor of the hotel. There was free internet service available near the lobby area. Although the broadband connection was a bit slow, at least there was internet service available and we rarely had to wait in line to use it. The breakfast was served at 7 AM, which was a plus since we had a busy schedule planned each day. There was a plentiful variety of food and an excellent choice of beverages. The morning receptionist was quite helpful and she was familiar with our name right away from the reservation list when we checked in the first day. We were able to check into our room by 10 AM, which was an unexpected plus. The evening guest clerk wasn't as friendly and felt compelled to correct any mispronunciations of our broken German. We would definitely stay at this hotel again based on the value for the money and the excellent location. A bit of quick advice on the bus service: You can buy your tickets in the subway station at Adenauer Platz. Use bus #109 which will take you a mile or two east to the Zoologischer Garten (Zoological Garden) transportation hub where you can get off and catch a bus or use the above ground S-Bahn rail system to travel practically anywhere in the city. Bus #100 takes you to most of the popular sites such as the Reichstag and the Brandenburg Gate. Bus line #200 takes you to the Potsdamer Platz area and other sites to the south. There are plenty of free maps available that show the bus, subway and rail routes. A Tageskarte (one day ticket) works for all three transportation services.", "Date": "November 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Great base”", "Author": "A TripAdvisor Member", "ReviewID": "UR5343555", "Content": "This hotel was great as a base if you are wanting to do all the sightseeing and nightlife of Berlin. It is a 4/5 min walk to the nearest tube station and main bus stops and the tube network in Berlin is excellent and works the exact same way as London but is much cleaner, safer and generally more pleasant! (Oh and really cheap - the tickets you uy on the tube also work for the buses - but no one checked ours once over the whole 3 days we were there! - ut buy one anyway just incase - there are machines on the platforms and outside at the main bus stations) The Hotel itself was fine - what you would expect for a 75 pp hotel, pretty basic, very large room to single beds to make a double, but serioursly weird pillows so Id ask for an extra one on arrival as u are bound to need! Also no ironing facilities and it looks like they only have one iron and board for the whole hotel so if you know you are going to need it ask for it in good time! Admittedly becasue we had such good nights out in Berlin we embarassingly didnt manage to get up for the included breakfast - but from what we saw it looked fine - dining room very traditional , clean, no problems. Theres a mega slow PC in the lounge area if you need to check email or anything. Be warned that the room we were in had no shower curtain - the shower was fab with really high pressure and good temperature at all hours but it was very easy to flood the bathromm first time round so be careful! Overall though the hotel was absokutely fine as a base, very clean, comfortable and in a good location, Id stay there again. Onto Berlin itself, a few tips we would like to have had beforehand that we can now pass on!; - The tube network runs througout the night which was excellent and they come about every 20 mins after 11pm and constantly througout the day so dont worry about paying for a taxi if you go out (and there didnt seem to be the usual weirdos you get on tubes at 3am in the morning!) - To get to the hotel from the airport get the bus to RUDROW and then the tube to ADENAUERPLATZ (the light blue line on the map U7 line) - Theres a relaly nice Italian resytaurant a little further uo the road from the entrance to ADENAUERPLATZ tube - You can get the bus 100 from Zoo station (major station you will see on tube map) and the 100 will take you around the whole of Berlin so you dont need to pay the sightseeing tour prices if you are happy to go to the places by yourselves - a weird one.. dont be surpirsed if shops dont put your goods in a latic bag once you have paid - we asked for one and told we had to pay! - BEST NIGHTCLUBS!! (If you like rnb & hip hop ) you will be in your element at H2O CLub [-]h2o-club[-] and 2Be [-]2be-club[-] - none of the ususal London attitude it was brilliant and SO cheap to get in as a female I didnt have to pay either nights! Hope you have a great time !", "Date": "June 14, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“friendly hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5335319", "Content": "Stayed at this hotel june 2006 the hotel stairways a bit tatty rooms dated but really clean towels clean bathroom was immaculate, the restaurant was nice with an adequate selection of food could not fault the staff on reception they were really friendly the hotel was in a good location for shops bars and eating places also for transport the taxi cost us 5 euros for 5 of us to the zoo gartens where we got the hop on hop off tour bus for 20 euros which was worth it as it took us to all the main sights where you could get off and look around then jump back on the next bus which were every 15 mins. I would recommend the graffitti bar up from the hotel on the ku dam road it was excellent for food staff friendly cocktails were great for 5 Euros. I think this hotel is ideal for a couple of nights in Berlin if your just there for the sights it was clean and cheap and i would stay there again if i go back to Berlin", "Date": "June 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "5", "Service": "2", "Rooms": "3"}, "AuthorLocation": "DUNDEE", "Title": "“Basic but Good”", "Author": "MUMSIE31", "ReviewID": "UR3639673", "Content": "Good location round corner from K'dam although not within walking distance of most sites. Public transport is very good and frequent though. Take the 109 from the airport to Adenaur Plaz and save yourself some taxi money. Nice clean room, average size with a telly. Breakfast in the hotel is good and abundant and the morning receptionist was very helpful. The same could not be said about the afternoon receptionist who was very unhelpful and did not smile once. Rooms were not airconditioned which would have been a bonus in the heat of July, but the overall package was a bargain so we cannot complain. If you are looking for somewhere to stay for two or three nights, and not expecting luxury, this is your place. We would go back, on price alone.", "Date": "July 6, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“Good hotel”", "Author": "Michelle71", "ReviewID": "UR3616271", "Content": "When my taxi parked up outside this hotel, I wasn't impressed, but found that first impressions are usually not the best. Nice spacious, clean room. Selection of food for breakfast. In a good location with good transport links and some great restaurants in the surrounding areas.", "Date": "June 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "tyneside england", "Title": "“good value easy access”", "Author": "david.russell", "ReviewID": "UR3434654", "Content": "excellent value we only paid £96 for 3 nights via last minute. varied breakfast plenty of it and decent quality. location a little too far west but only 5 mins from zoo station on the bus which seemed every 5 mins. 400 m from audenau platz underground but line wasa bit restricted however a furthe 400m got you to charlottenburg which was on main line for airport and east berlin.afew bars and restaurants in walking distance. staff english good and all seemed friendly and helpful. rooms ok for the price.", "Date": "May 3, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "ottersum", "Title": "“Excellent price-quality-ratio”", "Author": "jwmpet", "ReviewID": "UR3349793", "Content": "It was the 2nd time we stayed in this hotel. It is situated in a quit street near the Kurfürstendam. There are some rather good restaurants in the surrounding. The staf is very helpful and if you have certain wishes concerning your room they realy try to realize these. The breakfast was very good and abundant. Use of the internet is free. We booked via BOOKINGS, so there were no additional costs. Very recommandable.", "Date": "April 11, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Very nice stay”", "Author": "ErinF73", "ReviewID": "UR2289843", "Content": "This hotel is close to Adenauer Platz subway station, so it provides quick access to the rest of the city in just minutes. It is a more residential area, so very calm and quiet. Lots of little restaurants around. Easy access from the airport. The rooms are very clean and the breakfast is very good.", "Date": "July 11, 2004"}], "HotelInfo": {"Name": "Agon Lichtburg", "HotelURL": "/ShowUserReviews-g187323-d557165-Reviews-Agon_Lichtburg-Berlin.html", "Price": "$54 - $129*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Paderborner Strasse 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">10709</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "557165", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d1/0c/d10c63508b4effdb071e220479ef26aa6large.jpg"}}