{"Reviews": [{"Content": "okay for what you paid for This hotel was one of the hotels included in our JAL package to Tokyo. We stayed there for 2 nights and the only thing we were happy were the breakfast that came with it. The room is tiny but I'm okay with. The thing that bothered me was the bedsheets. Looks like there were little black dots on the bedsheets and I felt very uncomfortable in it. Like the other reviewer, I could smell smoke in my room eventhough it's supposed to be a non-smoking floor. Could be coming from ventilation. Location was extremely hard to find. Highly recommend you take a cab from Shinjuku station (if there's where you're coming from - and it costs you only 660 yen and saves you from the 20 minutes walking and dragging your luggage with you!) Took us an hour to walk all the way from Shinjuku station and finding our way!!", "Date": "Jul 21, 2008", "ReviewID": "UR613450242", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "1"}, "Author": "theforgetful"}, {"Content": "Good for Smoker.. My first impression of the my single room is ok since as you know everything is small in Japan. Wore up in the middle of the 1st night due to the strong odor of smoke in my room. I couldn't believe how bad the smell was so I left the room to go outside for some breathable air. Next morning request to move to a non-smoking section/floor. To my surprise, it was the same. Guess next time I'll stay somewhere else. Maybe back to Asakusa where I had my best hotel experience at the Asakusa View hotel in 2007.", "Date": "Jul 13, 2008", "ReviewID": "UR825431676", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "flyer181"}, {"Content": "Best hotel we stayed in in japan This was the best hotel we stayed in when in Japan in April last year. We payed $125 per night and included breakfast.Not a five star luxury hotel however if you are like us and want to spend most of your time out  about then it is more than sufficient. We had a map with us and walked with our suitcases to and from shinjuku station - not ideal but do-able. Walk without the suitcases takes about 15 minutes. Included breakfast was great. Combination Japanes and western (japanese version of western - eg. sweet bread not savoury, and the scrambled eggs tasted a little sweet). We left every day with plenty in our stomachs to keep us going. Hotel also had a couple of computers with free internet in the lobby that we found very helpful.There is also a great restaurant on the same street as the hotel when you exit/enter from the back. A korean bbq - was one of the best food experiences we had in Japan and the woman who ran it was lovely! We tried it one night when too exhausted to head out back into shinjuku looking for somewhere for dinner and very glad we did.Basic room a little cramped (as were all budget/business japanes hotels) we had a semi-double bed but fine for a couple - my boyfriend is 6-foot tall and no complaints. We also recommended to some friends who were travelling together and they had a twin room which they liked as well. I belive it also had broadband in the room if you had a laptop. Bathroom also very small but same as all hotels we stayed in. Rooms all across Japan are really heated - however with the mini clothesline you could pull out across the bathroom we found with teh heating our clothes would dry overnight or while we were out during the day. Shinjuku is also a great suburb to stay in!! on main JR line and only two stops to harajuku. I booked through asiarooms.com.", "Date": "May 17, 2008", "ReviewID": "UR253107927", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Annabel161"}, {"Content": "Good hotel, bad management Hotel was just what right for what i needed. Was cheap by tokyo standards, near the bars/clubs of shinjuku and very much a 'local area'. The hotel itself was great for singletravellers. Its small compact, but very clean and fairly modern. All tv channels were in japanese but was too busy exploring tokyo instead! Make sure you ask for a room in the main building and not the annexe part. The main thing that this hotel fell down on was service. I expereinced great hospitaility everywhere i went in tokyo (even if they didnt speak english!) but the staff in this hotel were very un-friendly and not wishing to help. I arrived at the hotel at 10am but the room wasnt ready until 2pm. I was made to wait as were all the other guests. Then suprisingly enough right on 2pm ALL the rooms suddenly became available! Miraculous! You can pay extra to check in early, and i would have done but for the way they went about it. Brisk 10-15 min walk to the main shinsuku station which is a great platform from which to explore tokyo.Oh and dont bother paying extra for breakfast. It was very poor!!!", "Date": "Apr 16, 2008", "ReviewID": "UR164838605", "Ratings": {"Service": "1", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "qprjames"}, {"Content": "Great location       The other half of the room", "Date": "May 20, 2007", "ReviewID": "UR277200891", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "David1220"}, {"Content": "Not My Cup of Green Tea I chose this hotel because I found a couple of reviews on the web that said it was a decent hotel. Although the room was typical for Japanese standards (very clean, small, hard bed, toilet that squirts warm water), the overall experience was uninviting. The worst thing for me is the 10:00 am check out time. When I'm on vacation, that's usually the time I wake up. And at 10:02 that day, I got a call from the front desk that it was check out time and I needed to come down now.Also the map on their website might as well be a diagram of the New York sewer system for all the help it gives you. Even the policeman I stopped couldn't figure it out. I finally had to pay a taxi driver to go a few blocks because I was tired of dragging my luggage around Shinjuku trying to find it.And finally, when I would come back to the room it was uncomfortably hot because there is no air conditioning until you stick your key in the slot next to the door. And it took over an hour for my room to finally get comfortable. I completely understand trying to conserve energy, but lying in bed covered in sweat trying to sleep is not the experience I want when I'm on vacation.I did find the breakfast provided was pretty satisfactory though. and it is not too far away from the subway. But I'm guessing there are much better hotels for tourists in the same area.", "Date": "Sep 24, 2006", "ReviewID": "UR471383452", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "DLCharactr"}, {"Content": "Fantastic value, good location!       single room with all my junk", "Date": "Aug 29, 2005", "ReviewID": "UR506371046", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Boop2"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066457-d557561-r18113970-Hotel_Listel_Shinjuku-Shinjuku_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "557561", "Price": "Unkonwn"}}