{"Reviews": [{"Content": "Great spot       room", "Date": "Nov 16, 2008", "ReviewID": "UR292291583", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Operation_panda"}, {"Content": "Mediocre stuff The hotel was mediocre. First, I made my booking 4 months in advance (in August) for a Japanese-style room (without bath with toilet) for 2 persons at 11000 yen per night. However, when I arrived for check-in (in November), the man at the front desk told us that the room was under repair but that he had a room for us (without bath or toilet). We were charged 9400 yen per night. I had a feeling that our room had been given away to a large group staying on the 2nd level. I felt very taken advantage of because there was no prior notice of this change in my booking. Hotel Fukudaya had my contact information and could have easily contacted me before I arrived in Tokyo. I would have appreciated having the option to find alternate accommodations, had I been given the chance to do so. I felt this was a very bad business practice.We did not complain as we had no choice but to accept the room change - what else could we do at that point? The room we received was called the back room on the main floor. It was located at the end of the main hallway. We could hear people in the room above us, entering the hotel lobby, and going up the stairs. The door to the room was a very thin japanese screen (unlike the more secure 2nd flr rooms). You cast shadows onto the screen door when you moved around that side of the room. You could clearly see your silhouette from the outside of the room (like when you were changing - so stand clear!). It was not private. The room also had no mirrors and no closet for hanging clothes. In fact, all of the closet space (3 closets in total) were storage spaces. I definitely felt like we were staying in the back room storage space! There was also an adjoining sub room that the staff went in and out of - it had glass windows that they could see through. One of the older women walked into the sub room when my partner was changing out of his clothes. I felt it was not secure or private (I had my new MacBook Pro with me).We timed the walk from Shibuya Station and if we had no luggage and walked quickly it was 15 mins. With luggage (or after a very tired day) it was 20 mins. The saving grace is that the walk up Dogen-zaka dori took your mind away from the long walk as there is a lot to look at along the way. The area of Shibuya around the station is amazing! The Starbucks is great to have your morning coffee around 8 am. Just watching the people streaming out of Shibuya Station is hypnotizing.I stayed at Hotel Fukudaya for my first time in 2006 and had a much better experience - that is why I booked it again. The first time I stayed on the 2nd floor and had a single room (without bath with toilet) - this is what I booked for my 2nd time. However, next time I travel to Tokyo I will not be staying at Hotel Fukudaya. If you do stay there, bring your own slippers! They have not changed their shared slippers in years (and the shoe room smells bad). This is a very honest account of my 2nd experience at this hotel and I was very disappointed.", "Date": "Nov 12, 2008", "ReviewID": "UR242677006", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "2"}, "Author": "CanadaTrippy"}, {"Content": "Musty, classic inn I must say that Hotel Fukudaya is very *brisk* 15-minute walk from Shibuya Station. I'm a fast walker and it's more like a 20+ min walk and probably even slower while pulling your luggage. I did not look forward to trekking up Dogenzaka at the end of a long day of walking. It's even worse when you need to pick up or put back something midday.While the aging owner and staff are friendly and helpful, their retro rooms are seriously worn out and musty. My single western-stye room had lingering smoke from its previous occupant. Dust is everywhere.True, it's near Shibuya but do you really, absolutely want to stay near Shibuya? There are better, cleaner and nearer choices to the JR station in other suburbs such as Ebisu.", "Date": "Nov 20, 2007", "ReviewID": "UR432881067", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "2"}, "Author": "gauntlet"}, {"Content": "15 minutes walk to the centre of youth culture in Japan. Fukudaya Hotel is not really a hotel but a Ryokan (Japanese Inn). We stayed in a traditional Japanese Family room which was great. It really gave you the feeling of being in Japan. My mother booked a western style room which was very basic. If you want a western style hotel look else where but if you want to experience a little bit of culture then the Japanese rooms were good . The big positives with this place is the price, the little old lady and man that run the place, the price and the location. Fifteen minutes walk to Shibuya which is the youth capital of Tokyo. If you only see one thing in Tokyo you have to see Shibuya at its busiest around 7pm to 10pm. It'll blow your mind. If on the other hand you have no interest in Shibuya at all. Then see Kimi Ryokan reviews in Ikebukuro. It has nicer Japanese rooms than Fukudaya Hotel, it also has a little eating area with a very relaxing Japanese bath. Both places are on the circle line which is a plus.", "Date": "Jun 7, 2007", "ReviewID": "UR645051482", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "AFJones"}, {"Content": "Not highly recommended There certainly are some positives to staying at this hotel and the location, 15 minutes walk from Shibuya Station, is one of them. The staff are also pleasant enough and speak English so the initial signs are good.The reason why I would not recommend staying at this hotel however is due to the quality of the rooms. When I stayed at the hotel there were numerous scuffs and tears to the wallpaper and screen and it clearly needed a makeover, the pillow was so uncomfortable that I didn't use it and the room had no air conditioning. The room was hot even in March and during the Summer months it would have been unbearable. There was also a problem with the noise as the staff were clearly audible until well after midnight and then the rooms were cleaned from shortly after 9 o'clock the next morning. There is also a very busy main road less than 50 metres away.I think that are far better places to stay in Tokyo and would recommend this hotel only as a last resort.", "Date": "Apr 5, 2007", "ReviewID": "UR230227297", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "4"}, "Author": "Crescent_Glow"}, {"Content": "Nice place near Shibuya The hotel is conveniently located near Shibuya (JR/subway). It takes about 10 - 15 min. to walk but do not use the map from Hotel Fukudaya website as it is really bad one. Just walk uphill from the Shibuya JR station (if you go overpass, just walk straight until you'll see Lexus building on your left hand side (it is the first large crossing after Shibuya). There is AmPm store on your right. On the other side of the crossing, walk ~200 m and turn right. You'll see Hotel Fukudaya sign from the mainroad.The hotel is really nice though if you have a room near the entrance you'll hear everything what's going on at the reception. But that really do not bother that much as it is a small hotel. The staff is really nice and friendly and the place is clean and in a very very nice quiet area. If you want stay within a walking distance from Shibuya but would prefer some calmness Hotel Fukudaya is the place to be.", "Date": "Aug 1, 2006", "ReviewID": "UR383654258", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "soppa"}, {"Content": "Ok, but there are much better places to stay The Fukudaya is definitely a budget hotel and makes no appologies about it - but the rates come close to those of a regular business hotel which have much better value for money in my opinion. Stayed in one of the Western rooms as the Japanese were fully booked, I found it rather run down but it was clean and had the basics in order. Was not too fond of the location as it is a 15 minutes walk from Shibuya in a residential area which does not have much interesting to offer. Staff was very nice and made us feel very much at home, but this did not really compensate for the price/quality ratio. There are better deals in Tokyo than the Fukudaya - but nothing wrong with the hotel and very nice people.", "Date": "Jul 25, 2006", "ReviewID": "UR157255480", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "eurotripster"}, {"Content": "This is a great budget hotel This is a great budget hotel near a cool neighborhood (Shibuya). It's a small place, and offers both Western style and Japanese style rooms. We slept in a Japanese style room and really liked it. It was pretty spacious. There was a sitting room and a separate room with the futons. The staff is wonderful--very friendly and helpful, though their English was limited. I would stay there again, though after 3 days we got tired of the 15-minute walk into the center of Shibuya.", "Date": "Jul 30, 2005", "ReviewID": "UR509109008", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Claire55812"}, {"Content": "Un posto tranquillo, non lontano da Shibuya       Camera japanise style", "Date": "Aug 30, 2008", "ReviewID": "UR230078987", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "simmy_78"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066450-d557531-r21887517-Hotel_Fukudaya-Meguro_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "557531", "Price": "Unkonwn"}}