{"Reviews": [{"Content": "Our oasis in Sanur This charming, almost intimate hotel is an oasis of peace amongst a lot of basic and corporate hotels which we originally looked at in Sanur. The location is perfect for couples, with bungalows set in tropical gardens, set back from the main tourist strip and only yards away from the beach. Nice touches included the daybed within a stone's throw of the hotel's private beach, but far enough away from the persistent sales ladies trying to persuade you to have a massage or visit their market stall. The food was a good standard and freshly cooked to order (no awful buffets which we have experienced in some large hotels). Highlights included the wonderful breakfasts, especially the banana pancakes and the crispy made to order pizzas. The tables on the beach for a romantic dinner were perfect. On our last night, being serenaded whilst the waves crashed within 10 feet of our table was a highlight. We found all of the staff amazingly helpful and friendly. This is an older hotel and whilst the gardens were well kept and provided a brilliant setting, some of the rooms are basic but have rustic charm and features. However the public areas are ready for an overhaul. Overall, our best experience in Bali and we would not hesitate to return. Our only tip would be to negotiate the price, especially in low season. As with most things in Bali, you have to haggle. We did and got very good value for money.", "Date": "Nov 17, 2008", "ReviewID": "UR615419757", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "Appycouple"}, {"Content": "Incredibly rude staff I was staying out of Sanur and wanted to move to a location in Sanur instead. I went into Sanur to have a look and choose somewhere for my family to move to the next day. While I was taking a stroll walking on the public footpath next to the beach, I stopped by La Taverna as the gamelan performance got my attention. I was still on the public footpath when an incredibly rude security man from the hotel came up to me and loudly asked me over and over again if I wanted to eat at the hotel's restaurant. He seemed angry that I didn't want to go into the restaurant. When I ignored him because of his roughness, he told me I had to move over to the other side of the public footpath. I was not at all happy with his rough manner and then being told I couldn't choose where I wanted to stand on a public footpath. The duty manager came over and was equally rude-mannered. I told him I wanted to talk to the GM. He said he was the duty manager. I insisted on talking to the general manager. I went to the front desk and the duty manager followed behind me telling me to 'go to hell'. I spoke with a very pleasant lady at the front desk and left. I have serious reservations about this establishment. We stayed elsewhere and had wonderful treatment. Thankfully we will be writing a glowing review about the other hotel.", "Date": "Aug 7, 2008", "ReviewID": "UR175332442", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "JackPerth"}, {"Content": "A classic old hotel       Gardens", "Date": "Apr 20, 2008", "ReviewID": "UR177516897", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "oswaldS"}, {"Content": "Beware! We were shocked to arrive at La Taverna and to be charged an additional US$10 for airport pickup, (We had already paid $20 to the driver) as we were told the original driver hadn't been the hotel driver, despite having my name on the board. This may be an elaborate scam set up by the hotel. Upon paying our bill, we were also extremely upset to discover we had been charged for our 'complimentary' drinks, breakfasts, as well as food and drinks we hadn't ordered. The hotel manager was rude and aggressive, and hounded us by telephoning the next hotel we stayed at. It was a thoroughly unpleasant experience.", "Date": "Jan 24, 2008", "ReviewID": "UR237606815", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Debyule"}, {"Content": "Family room was a Hobbit Hole! La Taverna was one of the few Sanur hotels that offered connecting rooms for a reasonable price. The staff were very kind and helpful, but it didn't make up for the hotel. Unfortunately, we had just been at three other gorgeous, and cheaper, villa/bungalow hotels in other areas in Bali and were thoroughly shocked and disappointed when we arrived at La Taverna. Yes, it is on the beach which is a huge bonus, but the room was horrific. I was able to touch the ceilings in our rooms, and I am only 5'3 tall! My husband and I had to duck to get into the room or bathroom. There wasn't enough room on either side of the double bed to actually stand. The room was so dark that with all of the curtains open at noon, we still needed overhead lights. We couldn't lock the door from the inside. The sheets were torn and the comforter looked like a K-Mart special circa 1976. The room next door was under renovation, being chipped away by hand, and a dog barked all night. We would NEVER return to the hotel. Possibly, the regular rooms are better, but there was nothing remotely Balinese about the style or feel of our rooms. They were more like run down European farm house attic rooms.", "Date": "Oct 14, 2007", "ReviewID": "UR613972791", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "AsiaMom"}, {"Content": "OK but a little tired Great location and enjoyed the Legong show. Hotel is a bit tired compared to some in the area.", "Date": "May 22, 2007", "ReviewID": "UR320208791", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "travman999"}, {"Content": "Very romantic It is avery nice hotel, somewhat simple but kept very well, right on the beach of Sanur. Rooms are Ok and clean. The poool is not huge but fairly nice. The restaurant is good and at night it is extraordinary romantic to have a candle-light dinner on the beach, a few steps away from th sea. I would definitely stay there again.", "Date": "Apr 11, 2007", "ReviewID": "UR373946656", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "bruges00"}, {"Content": "A place of contradictions Just back from 11 days at La Taverna hotel in Sanur. THE HOTEL WAS LIKE THE LOCATION. Bali is sufferring from a drop off in visitors, so many places like La Taverna have seen better times, and does not receive the income to keep on top of its needs at present. Having said that, the effort of the staff to make our stay as pleasant as possible was exemplary, and the peace and quiet of our stay was marvellous in the context of our usual busy lifes.Sanur is currently very quiet, only the street vendors, taxi drivers, and stallholders cause a distraction from what would otherwise have been a very peaceful area. Certainly this is the case if you compare it with the babylon that is Kuta.Sanur has a long pedestrianised beach area, not on par with many European seafronts, but enough for a wheelchair user to be accomodated. The South part of Sanur has amazing views when the cloud lifts (to the volcano area), but the North beach area is resticted to views across to the nearest island group. Watersports, diving, snorkelling, etc. are available but not in your face. Beach sellers are a pain until you explain quite firmly that you are not interested in their wares.Beach and sea were sandy, clean, and swimmable (but care should be exercised when the wind blows onshore and the tide is high). Generally, an extremely enjoyable stay amongst very pleasant locals, but remember, the rainy season is not called thus for no reason.", "Date": "Mar 28, 2007", "ReviewID": "UR505961811", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MANTJOURNEYS"}, {"Content": "ok but great location I am in general a bit disappointed with hotels in Sanur. Of course I am only speaking about the price level that I can afford, but you can have much nicer places in Ubud and the North (we rented a huge villa directly by the sea for same price). We firstly stayed in Sari Sanur but didn't like it, so we shopped around, and in such a low season, almost all hotels have rooms to offer and with much lower price then what they claimed before. We finally decided for La Taverna for its beautiful beach in front of the hotel restaurant and its ok room. Room is rather simple although with looking-anti design, but nothing spectacular really. The restaurent is very expensive compared to the nearby seafood resterant, for example Bonsai Cafe is a good option. The breakfast was great with the view of sunrise-on-sea. there are quite a few nice day bed where you can hang out lazily for most of the time in the heat, and jumped into the blue ocean or the pool every now and then. The staff were friendly and helpful, understood all your requests. I would recommod this hotel if you can get a bargin price, we had a room for 55$ incl. Continental breakfast, which is quite cheap comparied to the published price.", "Date": "Mar 15, 2007", "ReviewID": "UR343363702", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "muwing"}, {"Content": "Beautiful Memories in La Taverna We are Mr.Kawaguchi snd family.We have staid La Laverna(room No42)from13July to 19July.We would like to express our hearthy appreciation to you for your warm and kind hospitality for our family.It was a pity that our children(Koki and Shunki) could not say good bye to Mr.Coman(Koman?restaurant staff).They are like him very much.We will never forget our beautiful memories as long as we live.We would like to thank you again from the bottom of our hearts.We are hoping that we are able to stay La Taverna again.", "Date": "Oct 26, 2006", "ReviewID": "UR328029125", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "dreamingwith"}, {"Content": "Lovely but basic hotel We stayed here for four nights at the start of our stay in Bali. The staff were very friendly and helpful. The rooms were fairly basic, but furnished with antique furniture to add character. There was no breakfast buffet, and everything was freshly prepared. The fruit juice was like a smoothy - blended fresh fruit which was wonderful. The eggs florentine are to be recommended. We felt sad when in Sanur, how empty it was of tourists. There are many lovely hotels and restaurants on the beach, with hardly patrons. They had perfect locations, and food, but no visitors. I would highly recommend Sanur", "Date": "Aug 18, 2006", "ReviewID": "UR559346246", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "mag1calspider"}, {"Content": "Fulfilled my dream of Bali !!! I have stayed at La Taverna 4 times in 5 years. And had a wonderful stay each time. Very cute duplex like cottages, furnshed with wonderful old pieces , hutches, chairs, with private patio. Great resturant, reasonably priced, right on the beach, nice pool, beautiful grounds. But the best was the staff, friendly, helpful, and everyone knows and calls you by name. Hire a driver and have a wonderful time. Its a beautiful, quite, peaceful, safe place to stay even by yourself. I was surprised by the posted rates because it was about 1/3 of that I payed ask for a better rate and I bet you can get it! ( after my first trip I took a suitcase of used childrens clothes and crayons and paper and pencils to give to the staff and it was much appreciated)", "Date": "Feb 5, 2006", "ReviewID": "UR869316241", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "銉撱兗銉佹部銇勩伄鎵嬮爟銇儧銉嗐儷       銉淬偅銉╁娉婅€呭皞鐢ㄩ鍫傦紵", "Date": "Oct 30, 2008", "ReviewID": "UR460042051", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "Ayam-tama"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297694-d557517-r21936400-La_Taverna_Hotel-Denpasar_Bali.html", "HotelID": "557517", "Price": "$104"}}