{"Reviews": [{"Content": "A home away from home My family of four stayed here for 5 nights. It was wonderful to be in the same room, instead of having to stay in two rooms. One of bedrooms had 2 twin beds, the other, a queen bed. It is very spacious - comfortable living room, dining room and decent sized kitchen. They provided everything - a few dishes, utensils, pots, towels, soft blankets and linens, toiletries, cable tv, DVD player, iron, washer and dryer. It is convinient - near 2nd ring road. It is about 1 block from the Dong Si Shi Tiao subway stop, and taxis are easy to hail from the street in front of the hotel. There is a grocery store downstairs, along with a health club, bowling alley, massage, theatre, bank and several restaurants.No breakfast included, but it's no problem - we ate fruit and pastries from the grocery store downstairs.TIP: keep both receipts for the 200Y telephone deposit. You'll need it to get your money back.PLUS: 24 hour front desk/doorman. Spacious and clean. Convinient and safe location. LOVED the 50Y, hour foot massage!MINUS: Hard beds. Washer leaked a little , used towels to soak up water. Dryer took forever - probably faster to line dry and then toss in the dryer when barely damp.", "Date": "Nov 15, 2007", "ReviewID": "UR526227288", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "alice063"}, {"Content": "I will never NOT stay here - the best place in BJ!!! I am an expat living in China and always loathed taking trips to Beijing - traffic jams, unfriendly locals and feeling out-of-place just got under my skin too much. My parents came to visit my family and we booked a 3-bedroom apartment at East Gate Plaza and my entire Beijing outlook has been changed. First of all, in my opinion, the location can't be beat. It is within a 10-minute walk to a Beijing Subway stop, and McDonalds (for quick breakfasts), within 20 minutes walk to Workers Stadium and Outback Steakhouse and in a location where it's easy to get a taxi and easy to find when coming back in a taxi. The greatest part is the abundance of amenities the apartment complex itself offers: in the basement is a great supermarket, movie theater, DVD store, bowling alley, Subway Sandwiches, and several other stores and restaurants. The entire complex - apartment units and stores/restaurants were all kept very clean. The 3-BR that we stayed in was perfect for my young children, husband and my parents (we were all staying together). Both bathrooms were large, clean and in great working condition. Rooms were not huge but adequately big. The beds were typical chinese beds - very, very firm, but that's to be expected anywhere. The kitchen was furnished with a microwave, stove, range, refrigerator. The living room had a DVD player with the TV. Staff service was always courteous and prompt when we needed help or directions or had questions. The outdoor play areas require a key from the front staff to be opened, so there were not millions of children trying to play in the play area...I feel like I could go on and on about the place; it really was that great. It was convenient, clean, a great value, perfect location, good service - unlike anything else I've ever found in Beijing! SO very worth staying at!", "Date": "Nov 2, 2007", "ReviewID": "UR740018569", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "yuqiu"}, {"Content": "Home away from Home       Living area", "Date": "Aug 20, 2007", "ReviewID": "UR765673472", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "Dare-to"}, {"Content": "live like an expat I have stayed in many places in Beijing from top-rated tripadvisor tourist hotels to small budget (see my other reviews) and this is thebest! Three of us stayed in a two bedroom apartment, which seemed to have been recently renovated. I booked the hotel on Sinohotel.com foraround 798 RMB (104 USD). The apartment was spacious and clean, with a stocked kitchen, washer/dryer, dining-living area, TV/DVD, and freeinternet. The view at night from the 23rd floor was lovely. The room came with a 鈥渨elcome鈥?manual that included bilingual instructions on how to use all the appliances and information on the shopping facilities in the building. Some of the facilities we found particularly useful were 鈥?the gym, market, clinic, and travel agent.(We did not try out the pool hall, bowling alley or movie theater.) We ate some tasty meals at the zhou 鈥?porridge restaurant in the complex and across the street at a truly excellent Hunan home-style place. The location is VERY convenient 鈥?near the dongsi shi tiao subway stop (get off at exit B and it鈥檚 behind the big Poly-plaza theater). Every taxi I took knew where the place was, which is quite rare in Beijing. As a backup you can always guide them to the Poly-plaza. My only complaint would be that we were confused about what tower to enter when we arrived. It鈥檚 apartment tower A. The hotel is about a half hour walk from Sanlitun and the Yaxiu market. Though we speak Chinese anyway, we found the English level at the front desk to be adequate and were surprised to find that even some of the chambermaids spoke English! The staff might not be as attentive as some hotel concierges. From my experiences in China they were above average. I鈥檝e already booked a three-bedroom for guests next month!", "Date": "May 28, 2007", "ReviewID": "UR981084590", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "raku"}, {"Content": "Expat home for 1 year       family room", "Date": "Aug 31, 2006", "ReviewID": "UR983944639", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Tbuse"}, {"Content": "Good for families We stayed at the East Gate Serviced Apartments recently. It was a positive experience overall but is not for first-time visitors to Beijing/China. The check-in and initial experience was less than smooth. It took them a few minutes to find our reservation but more importantly they did not explain anything about the hotel. There was no welcome or information package at all. For example, we found out about the supermarket and underground mall from a resident. They didn't have a map of the area or directions on how to get around the neighbourhood. There was no instructions on how to operate the stove or washer/dryer. English ability of the staff we encountered was limited.The apartment was clean but beginning to show its age (peeling paint on the walls, stained carpet). For a family, it was more convenient to have an apartment rather than two rooms at a hotel.The location was okay. Taxis are cheap so that's how we got around. Be careful about living too far from sights as the traffic can easily take up most of your day. There is a gentleman who will arrange transportation for you just outside the lobby. He's not a staff of the hotel but is more helpful than they were. Unfortunately, he does not speak English.If you're going to stay at this hotel, get their phone number and directions ahead of time. Our taxi driver from the airport did not know where it was and had to call them repeatedly for directions. This might have been the driver as all the others didn't have any problems.", "Date": "Apr 28, 2006", "ReviewID": "UR813304184", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "abcabc440"}, {"Content": "Great place The East Gate Plaza Service apartment is ideal of families or a large group of travelers. Although, it is not in the heart of the city, the place is still a nice place to come back from sightseeing. There is a supermarket in the basement and a few stores, bowling alley, gym and pool. There is a foot massage place next to the bowling alley, really reasonable price, I think we paid RMB48 for 1 hour foot massage. The only thing I didn't like is that the pool is located on the other side of the complex. We stayed in tower A and the pool and gym facility is located under tower B. And they only gave us 2 free passes to get to the pool/gym facility. If you want an additional pass you had to pay RMB50 for it. Other than that we had a really great time here. I will want to come back and stay here on my next trip to Beijing.", "Date": "Apr 24, 2006", "ReviewID": "UR824165094", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "ggnang"}, {"Content": "Nice place for a family 5 days trip in Beijing for Xmas. We rent a 3 bedrooms apartment for 5 people. Very good place, clean, cheaper and more convenient than an hotel.Not far from city center with a metro access 1 block away.We advice the large Hot pot restaurant on the other side on the street.", "Date": "Apr 17, 2006", "ReviewID": "UR937411654", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great stay at the East Gate Plaza I just visited Beijing with my mom, sister and aunt. We stayed at the East Gate Plaza for 5 nights and had a great time. The hotel itself is VERY hard to find at first. Don't expect taxi drivers to know exactly where to go. Once you figure out where you are you will be able to get dropped off by the main door but the ride there from the airport is a bit of a challenge (the main door is in the back of the building). They also don't have very specific signs (but that seems to be common in China).The rooms are great. We had a 2 bedroom apt with a pretty cool view. We had friends also staying there in a 3 bedroom apt. Both suites were very spacious and comfortable. Below the hotel is a shopping mall with a grocery store and gym (which belongs to the hotel). The hotel is situated close to many sights including Sanlitun (bar street) and the subway. I would stay there again any day! I highly recommend this hotel.", "Date": "Apr 5, 2005", "ReviewID": "UR150465569", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Lad2005"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294212-d561033-r10846372-East_Gate_Plaza_Service_Apartment-Beijing.html", "HotelID": "561033", "Price": "Unkonwn"}}