{"Reviews": [{"Content": "Great place, great price we decided to stay at the bumas as it was recommended to us by our driver we were pleasently surprised on arrival. The room was nice and large with a very comfortable king size bed and still plenty of space. Bathroom was large but in need of a upgrade.The hotel also had two swimming pools nothing spectacular although very nice to relax in and get out of the heat.The breakfast was adequate one morning we were given table service and had some eggs, toast and fruit. Although the next morning was buffet style was very yummy had some wonderful pancakes. not exactly sure why it was not buffet both mornnings.The location of the hotel was also great even though not beach front was only a few blocks from the beach. Also a short walk up an ally and we were at a very popular street in sanur. Plenty of wonderful shops, restaurants and pubs.Great place at a great price!", "Date": "Dec 28, 2008", "ReviewID": "UR197752921", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "crystal_bs"}, {"Content": "Peaceful Retreat We chose to come to Bali to relax after a hectic stay in Kuala Lumpur and the Bumas is certainly relaxing. It's a small friendly hotel set down a back street in Sanur which is really peaceful. We chose to upgrade to a suite and were suprised at how roomy it was.On top of the extra space we had a huge beautifully carved four poster bed and a large terrace to relax on. The furnishings were fairly sparse although this did help to keep the room cool as the air conditioning wasn't over efficient in such a large space.The hotel has 2 pools ....one is an even depth throughout and the other is newer and was too deep for our taste. If you want a refreshing swim then do it in the morning because by early afternoon the water is very warm !!! Whatever the time of day we found no problem getting a sunbed and parasol.Breakfast is taken in the open air restaurant and although of a reasonable standard a bit of variety wouldn't go amiss. We chose to eat out evenings as there's plenty of choice and it's a lot cheaper than the Bumas restaurant.The rooms are set in lovely gardens which are well tended and have a tropical feel. If you feel the need to drag yourself away from the pool the beach is only about 5 minutes stroll and there are shops and restaurants within a couple of minutes walk. . We found all the staff to be extremely friendly and helpful.... from the reception staff through to the cleaners there was always time to chat to us and nothing was too much trouble. Overall we had a pleasant stay in a really charming little hotel.", "Date": "Dec 7, 2008", "ReviewID": "UR146169168", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ExeterWhizzy"}, {"Content": "Enjoyed this hotel       Other view of hotel", "Date": "Jun 7, 2008", "ReviewID": "UR895902080", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Sally307"}, {"Content": "We love the Bumas Hotel This was our fifth time of staying at the Bumas. We hadn't been since the Bombings and were really pleased that the staff remembered us and were so welcoming. Nothing was too much trouble and the receptionist saved us money - she booked us onto a trip that we were going to book via internet and saved us quite a lot of money, also advised us to put our luggage in storage at the hotel for 3 days and we saved 3 nights accommodation and got our room back again. There are problems on occasion, but say something and it will be sorted out quickly. We are returning in November for two weeks.", "Date": "Feb 14, 2007", "ReviewID": "UR143842078", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "elliesgran"}, {"Content": "Bit off the beaten path       View of our room", "Date": "Sep 22, 2006", "ReviewID": "UR526095885", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "mandyclan"}, {"Content": "Bumas is brilliant What a delightful hotel. The staff are friendly, the place is clean and lovingly tended and guests are made to feel at home. It lost nothing by being away from the beach. In fact, that added to the tranquility.If you want a change from eating in the hotel, there is a fantastic little restaurant - JJs - near at hand which serves magnificent breakfasts and meals for tiny prices. An excellent holiday.", "Date": "Feb 7, 2006", "ReviewID": "UR444541474", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "sloughbucks"}, {"Content": "Loved Bumas This small hotel is amazing. A great find for the price. The staff is friendly, room was clean and I could not complain for the two small size yet beautiful pools either. Although this hotel doesn't have a beach front view, the beach is only a couple of blocks away. Wonderful hotel! I'd recommend it.", "Date": "Jan 30, 2006", "ReviewID": "UR682508100", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "NOTCLEAN AND NOT FRIENDLY I'm rather disappointed with this hotel.the staffs are not friendly at all and besides the room is not clean the toilet we stay was flooded after we shower.", "Date": "Jan 4, 2006", "ReviewID": "UR586811203", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "maggie008"}, {"Content": "A lovely friendly place to stay Bumas Hotel Saur Bali28th August 2005Have just returned from my first trip to Bali. I am a lone traveller but the Bumas is a Balinese style family run hotel, the staff were charming - nothing was too much trouble, the rooms are very well kept - lovely gardens and both pools although small were adequate. It is also in a central position and within a few minutes you find the main street with an abundance of good restaurants and shops. I am a lone traveller but never felt alone as the Balinese people convey so much warmth and charm. If you intend to visit Bali and are looking for a small hotel with a family atmosphere please consider staying at the Bumas - I will certainly go back to Bali and will once again enjoy another stay at this charming small hotel. I travelled with Kuoni arriving on 12th August - 27th August", "Date": "Aug 28, 2005", "ReviewID": "UR646433098", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "pinacoladobabe"}, {"Content": "Loved Bumas! I traveled all over Bali, and I stayed in multiple hotels. I even stayed in the five star Putri Bali. Through all that, I still loved Bumas the most out of all of them. The best part about the hotel is how quiet it is. The landscaping is also beautiful. Although there is no direct beach access (you have to cross only one street to get to the beach), the trees, lovely pools, and statues make one feel relaxed. The people there are very friendly. Since the hotel is pretty small, they always greet you when you leave and when you enter. The rooms are kept pretty clean, and since Bali is warm for many people, the air conditioning was much appreciated. The breakfast in the morning is the same every morning, but it is yummy nontheless. If you are looking for extreme fru-fru luxury, don't come here, but if you something want nice, simple, and friendly (and not too expensive), I would whole-heartedly recommend this place.", "Date": "Aug 13, 2005", "ReviewID": "UR794154715", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "璩礌銇犮亼銇╂竻娼斻仹銉曘儸銉炽儔銉兗銇儧銉嗐儷   showReview(19170498, 'full');", "Date": "Apr 20, 2008", "ReviewID": "UR124631161", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Ideal para parejas que buscan tranquilidad   showReview(10988198, 'full');", "Date": "Nov 22, 2007", "ReviewID": "UR830145304", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Drenik"}, {"Content": "Peut mieux faire", "Date": "Jun 4, 2007", "ReviewID": "UR762981001", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "sasinequanon"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297700-d563643-r23045021-Bumas_Hotel-Sanur_Bali.html", "HotelID": "563643", "Price": "$91"}}