{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“comfortable stay, excellent location”", "Author": "Bhakti_11", "ReviewID": "UR62712016", "Content": "we stayed here as part of a group tour and were quite happy with it. its basic, clean and comfortable. from entry doorway you have to climb some stairs to get to reception hallway, there are some room on this floor and more rooms up more flightes of stairs, no lift. luckily me and my partner got a room on the reception hallway so only needed to carry bags up one flight of stairs. our room was decent, not too small, with ok functional bathroom. windoes looked onto the street which got a little noisy as there was a bar next door. but we stayed out at the bar our selves so not too fussed. breakfast was in a ncie little cafe next door which was ncie, continental food, plentiful and decent. location is excellent, near zoo, local attractions, plenty of shopping, bars and restaurants. plus only a few of minutes from the underground metro which is fast and efficient, so very convinient location. loved being so close to everything", "Date": "April 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location, nice breakfast.”", "Author": "TimmyJamesB", "ReviewID": "UR33766336", "Content": "My girlfriend and I stayed here with a 'Topdeck' bus tour and it was just fine. The rooms are small and basic but had what we deemed the absolute essentials - clean bathroom, TV with some English channels, comfortable beds and it wasn't too loud at night so we got plenty of sleep. If you are traveling on a budget this location is great, nice and central to the Zoo and some sight seeing, but more importantly 5 minute walk from the underground. Breakfast was plentiful and quite nice - even though it was basic.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Newcastle", "Title": "“Awful!”", "Author": "Shoppymad", "ReviewID": "UR14509609", "Content": "On arrival to this hotel I was horrified from the start! There is a front door on a street between bars that was desperately in need of a coat of paint. We had planned Easter Weekend in Berlin with our children and this 3 star (should be 1 star) hotel seemed great. The family room itself was large and the beds were clean. But the room was also very smelly, noisey from the floor above and extremely basic. We left the children in the car and went up the thread bare carpeted stairs to the reception. I speak a little german so the language barrier was fine. The receptionist showed us our room which was up another flight of thread bare, ripped carpeted stairs (complete with the odd beer bottle), there weren't any lights working so I fell into the corridor much to the receptionists amusement! As I said the room was clean and large and if that's all you want then this querkey hotel could be for you! Breakfast was providied by the restaurant out side the hotel (this was lovely) the restaurant was a cosy and friendly place and it was a lovely buffet that suited the whole family. I really didn't feel safe in this hotel there were locks everywhere and it was dark and very worn down everywhere. We paid €100 per night for a family room and for the price I suppose we got what we paid for. It was within walking distance to the train station and there restaurants within walking distance too. I would never reccomend this hotel to families but maybe for couples who have every intention of spending as little time as possible in the hotel. There was a television and that was all. No drinks available in the hotel or food and the mini fridge was broken but heh Berlin is beautiful and despite the hotel being very Faulty Towers we had a superb time.", "Date": "March 25, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Twickenham", "Title": "“Friendly, central and very good value”", "Author": "simonherbert", "ReviewID": "UR6035809", "Content": "This is a compact pension just 5 minutes' walk from Charlottenburg's Ku'Damm (eg. Zoo station, the Kaiser Wilhelm Gedaechtnis Kirche) and the KaDeWe department store. Rooms all have good en-suites and are very clean, if a little plain. Breakfast is plentiful and the coffee lovely and strong! The staff are exceptionally helpful and quietly friendly. The low price for such a convenient location means I don't hesitate to recommend the Aurum. NOTES: There's a fairly steep set of stairs from the front door to the 1st-floor entrance to the guest-house. Reception may not speak much English, so be prepared to try out your German. NEARBY: There's a great cafe-bar on the street-corner below the guesthouse. There's also a wonderful traditional Berlin 'Kneipe' (pub) over the road. Both are welcoming, and serve great value food and Berlin's superb beers. Nearest U-bahn stations: Augsburger Strasse, Wittenberg Platz, Zoologische Garten.", "Date": "November 1, 2006"}], "HotelInfo": {"Name": "Aurum Hotel", "HotelURL": "/ShowUserReviews-g187323-d564676-Reviews-Aurum_Hotel-Berlin.html", "Price": "$53 - $357*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rankestrasse 23</span>, <span class=\"locality\"><span property=\"v:postal-code\">10789</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "564676", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/cf/99/cf99be2dd633271943ad8860078b13ac1large.jpg"}}