{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Typical english B&B”", "Author": "Favre67", "ReviewID": "UR126377758", "Content": "Classic english bed & breakfast hotel. Tiny staircases, small rooms, average breakfast and not very serviceminded staff. Prices are not too bad to be in Paddington, but pay 20% more in central London and get at least 50% more value is my preference.. A quiet central area is the best with Linden House Hotel, the rest is so-so...", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cork", "Title": "“loved it”", "Author": "mollflops", "ReviewID": "UR126136632", "Content": "We stayed here for three nights in total. When we arrived the guy at reception was really friendly and gave us a room with 2 double beds instead of 3 singles. The room was pretty small but it was perfectly clean, the beds were really comfy and the shower in the en-suite was just to die for!! We only used it for sleeping mostly so the crampness didnt bother us. The hotel is really close to Paddington station and is a great base to get around London. Id def stay here again.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lake Balboa", "Title": "“Actually very nice”", "Author": "Amelia S", "ReviewID": "UR125047507", "Content": "We showed up at 7:30pm on the night of our arrival and the hotel clerk told us we could pick out of three rooms so after looking at all of them, we chose the basement family room that would fit us. Yes, it's in the basement but it had a great view of the street level which is pretty cool if you have a great attitude about it. We knew we would only be there for sleeping so thank goodness the beds (all three of them for four of us) were comfortable. The staff was helpful. The only negative thing was the breakfast which was not enough selection. All they had for food was cereal, toast and boiled egg but the kids and hubby seemed fine with it so I can't complain too much. The best thing was how close to Paddington station the hotel was which made getting everywhere in London so easy since we could get on the tube or the bus. Definitely would recommend.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ann Arbor, Michigan, United States", "Title": "“Do not stay here!”", "Author": "Diane R", "ReviewID": "UR124073885", "Content": "Whatever it takes, do not stay here! I am not fussy about where I stay but we were on the top floor with no elevator. The staff seemed amused that we had to carry our bags up. The room smelled horrible and there was one tiny little window. Since there was no air conditioner, we were unbearably hot and I felt like I was in a tiny attic. I hated this hotel and would not wish it upon an enemy.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Disgusting”", "Author": "Ladylaurendh", "ReviewID": "UR122731943", "Content": "You would be better off staying in a 20 bed dorm of a hostel. No elevator, unfinished, dirty walls, terrible service. DO NOT STAY HERE", "Date": "January 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Do NOT stay here, Simple as that.. Please!”", "Author": "Tom E", "ReviewID": "UR121257955", "Content": "Where do you start?? Stayed here for one night - so glad it wasn't two. Left ASAP!!! Upon arrival - not a very pleasant greeting. (happy to take Â£70 a night off you though). Left to find your room (2nd floor basement) through a maze of narrow hallways and staircases. wasn't possible.. NEWLY REFURBISHED!! - Great, wouldn't you think??. Most things were broke.. Taps, shelf's, shower, kettle, fan, few lights etc. Utter disappointment. (fan was needed even on the coldest of winter nights due to the room heated so much its just stuffy and uncomfortable). Room itself - livable for one night granted. Would have had a better sleep in Paddington station though. Walls are so thin you hear every rumble and squeak from the tubes (all hours), as well as the kitchen staff early hours (dunno what they were cooking/ doing as breakfast was a shambles, but that comes later) Rats - yes rats... payed us a surprise visit at 3am (multiple times). Must have came under the front door. (blocked it with a towel and this seemed to stop them...) Probably had free range of the corridors (even the kitchen's) seeing as though a basement door is left open to air the place out. Breakfast - (B+B would imply some breakfast), brilliant choice if you want stale corn flakes or stale corn flakes. That's literally it. Being crammed in a room catered for 5/6 people isn't pleasant after a long night of no sleep. Staff were very ignorant, We decided to eat elsewhere. Checked out first thing in the morning. Overall - The place was generally just filthy and horrid. God knows how Â£70 is justified. Save your money please!", "Date": "November 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“This Hotel is Less Than Perfect...”", "Author": "NAS5", "ReviewID": "UR121257668", "Content": "Me and my other half spent a night in this hotel on our 2 day trip to London. Needless to say we were very disappointed, yet glad we were only staying for a single night. We were in a basement room which had been 'newly' refurbished- the fixtures and fittings were very cheap shown by the broken shower door handle and the broken sink tap in the bathroom. On a positive note the room was clean but not to an exceptional standard. To save typing, here are some of the negative reasons, advising why this hotel should be avoided unless you're on an extremely tight budget: - The reception staff were impolite but rapid at taking your money from you (language barrier as the staff are not English) - The rooms are small and are a bit of a tight squeeze even for 2 people. -WIFI can't be picked up in the basement. - There is a rodent problem with the basement rooms (we got woken up at 2.30am by scuttling and rustling)... The breakfast room and kitchen are also in the basement so this raises concerns. - The breakfast is very disappointing (there was only a choice of toast or cereal) - The breakfast room is tiny and there is no space to move. - The catering staff are extremely noisy at 5.30am clattering plates, shouting and such, yet there's no cooked food in the morning. - The walls are very thin. - The place is like a maze of stairs and doors. - The location is not perfect. It took us around an hour to walk from Euston, then another 45 mins to walk to Regent street/Oxford street. If you plan on spending alot on taxis or know the transport routes then this may not be problem. Also I left an item of clothing at this hotel, I rang to see if there was any way of getting it back and the reception simply hung the phone up after telling me they would \"check to see if it was there\"... Still haven't heard off them. In all, I'm glad we were not there for 2 nights.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great location but not perfect hotel”", "Author": "deanfp", "ReviewID": "UR120695494", "Content": "Stayed here on a three day business trip this week. Hotel was in a great location. Staff were very friendly. Room was smaller than I thought, wallpaper was peeling off the wall and there was damp in the bathroom. The walls were very thin and the girls in the room next door seemed hell bent on partying until 3am. WIFI only seemed to work after 8am and it was almost impossible to get a reception on the phone if you are in the basement rooms. Good enough hotel for me to consider visiting on a solo business trip again but if you want a romantic weekend away in London there are far better.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“NIGHTMARE, SWITCHED HOTEL IMMEDIATELY!”", "Author": "Sirikh", "ReviewID": "UR120311901", "Content": "The room was not to bad, beside really filthy floors, did NOT take my shoes off in there.. I actually think it were blood on the floor!! bathroom was not clean, the toilet had not been cleaned (really disgusting), hair inside the shower, we got a room on the top floor, tiny really steep stairs, lots lots of stairs, exhausted when we arrived! We did not get to see the room before we paid and found out why, switched hotels anyway, and stayed in Westpoint hotel a really nice hotel only a few meters away.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, England, United Kingdom", "Title": "“Terrible”", "Author": "EB287", "ReviewID": "UR120190165", "Content": "From the moment we arrived at the hotel, the whole thing was a bad experience. I paid on card when I arrived and the receptionist was quite aggressive with me when I pulled the receipt out of the card macine before it had finished priniting, claiming that the transaction had not gone though (even though when I checked, it had.) Every time we needed to leave the hotel (even for five minutes) we needed to hand the keys to the room over and then ask for them back when we returned, which is something I have never experienced. The room itself was so small it was difficult to move around the bed, which routinely slid away from the wall it was against, making it difficult to relax. This was made more difficult by the fact that there was not a table or a single chair. On one side, the bed was pressed against a door that led to a dirty alleyway. Throughout the night, there was the continuous sound of running water and early in the morning the staff were noisy in the corridor. When my partner asked for an iron, he was told to go down a corridor (that was lined with various cleaning items) and get it himself, even though there wasn't a light in there. In the morning, the corridor was lined with bin bags and, at that point, we decided not to brave the breakfast.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“A total nightmare”", "Author": "AtlStew", "ReviewID": "UR120101555", "Content": "I live and work in Europe, and I am frequently in hotels in cities across Europe. However, this hotel gets the award for one of the WORST I have ever stayed in. On check-in, I was given a single room in the basement. The basement is not bad, but the window looks out on an air shaft that smells. The room is miniscule. It's not possible to open my suitcase except on the bed. Two of the four lights in the ceiling were burned out, and I had to ask two individuals to change them out. The bathroom is Italian style. The shower is totally open, and when one showers, the water goes everywhere....the floor, the sink and the toilet. There are no drinking glasses in the room, no Russell Hobbs coffee maker, and the WORST part is that the walls are paper-thin. The noise volume is TERRIBLE. Last evening, I finally got to bed around 1A after calling the front desk. The three Italian youth next door were screaming at each other, and it was as though they were in my room. The morning included breakfast was substandard. I arrived to find COLD coffee in the pot, stale corn flakes and dirty tables everywhere. This place is more of a HOSTEL than a hotel Avoid, Avoid, Avoid.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“You get what you pay for”", "Author": "Southborolass", "ReviewID": "UR119336683", "Content": "Great location value for money but don't expect luxury. Not ideal if you have lots of luggage as lots of stairs. However location is fantastic for exploring London and getting back to airport. We had very friendly service.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Not a hotel, not even an average B&B”", "Author": "NoeIreland", "ReviewID": "UR119101934", "Content": "I have never stayed in any hotel half as bad as this. I would have been better off sleeping on the streets of London. First room that they gave us was in the basement, with a tiny little window and it was filthy dirty and I complained so they gave us a new room that was two floors up. It was cleaner, but still very small, less than six foot wide with a double bed pushed up against the window and with only a little space to get out on one side. Also the bathroom door was hitting off the sink when I opened it. The breakfast room was so small and cramped and it was in the basement and all they had on offer was orange juice, cheese, eggs, coffee, toast and corn flakes and I had to get it myself or else I could eat nuttella from a jar that everybody else had their spoons in!!! Also there were no cutlery or egg cups for the boiled eggs. I stayed for three nights and I never went down for breakfast after the first morning. Don't trust the photographs that they show you on the website because they are completely false!!!!!", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Tiny rooms with spartan accomodations”", "Author": "Skeezix1", "ReviewID": "UR118630038", "Content": "My daughter and I rented 2 different rooms: hers was larger than mine. Mine was very tiny with a double bed. The bathroom was extremely tiny but newly remodeled, as was the one in my daughter's room. No chairs were available as they wouldn't fit in the room anyways! Both of us had older uncomfortable beds. The rooms were very clean and no odors were present. The staff was friendly and very attentive, immediately replacing a light bulb in the bath when I called. The building is narrow and the stairs steep. The TV only had 3 or 4 stations. The rooms are not air condtioned but a circulating fan kept it comfotable. Wi-fi is free, but quite slow. The breakfast bar had cereal, fruit salad, toast, and hard-boiled eggs. The rooms were very inexpensive by London standards and the location is outstanding! Paddington station is a short walk and has an express train to Heathrow. I only stayed 3 nights and wouldn't care to stay longer as it was too spartan for me. I do recommend it for the budget traveler: just don't expect any amenities.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“One of the worst hotels I have stayed in”", "Author": "Dianne1505", "ReviewID": "UR118396371", "Content": "I stayed here for one night only and was horrified at how old fashioned this hotel is. I am fairly open minded about what to expect but this was bad. The room was so small the bathroom door did not open as it was so close to the bed. There was no wardrobe, the door looked like it could be opened easily from outside. I could go on but could be here all day. I will not stay here again.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“NEVER AGAIN!!!!”", "Author": "SarahAllsup", "ReviewID": "UR116828358", "Content": "We stayed in a 5 bed family room, which was in the basement room101. The outside and reception area of this hotel looked great - modern and clean. But as you went to your room it was not the same.The room was tiny with no air con , only a shabby fan. The windows opened , but had to be kept open with a cup. The bedroom smelt of damp and the view was of the kitchen door! There was no storage facility and we had to ask for a hairdryer.to top it off there was no plug to the sink in our tiny shower room , that had paint peeling off the ceiling and a shower that was useless. When it came to breakfast there was no room for us to eat , we waited 10 mins , gave up and went out for breakfast. A very poor hotel and I would be embarassed to work there. Never again!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Very good service”", "Author": "marte192", "ReviewID": "UR115397986", "Content": "We were three girls who stayed here in late june, and were happily surprised. We've stayed in some bad places in London, so we weren't expecting much due to the price we payed, but upon arrival we could choose between four rooms. There's not much space, but it is clean and plus for the fan cause it was very warm outside. Very nice staff. This is a good place to stay if you're on a budget. The location isn't very hard to find either.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Good”", "Author": "Lukhino", "ReviewID": "UR115378712", "Content": "The room was clean but small. The hotel is 5 minutes walk from Paddington station :-) I would recommend this hotel for anyone who is looking for a budget hotel in a very convenient location.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Leiden", "Title": "“Nightmare!!!”", "Author": "boookgirrl", "ReviewID": "UR115337670", "Content": "Absolutely appalling little hole of a motel - 3 stars in my private black book of worst hotels ever. Tiny, smelly, claustrophobic cell of a room, with bed only just fitting into it. Bears no resemblance to the photos published online - can't imagine they were taken at any of the other rooms. On top of that, the doorman/receptionist must have been completely new to customer service and got offended when we questionned the origin of the photos and the quality of the room. Not to mention he offerred no help or apologies for the nightmarish cave we were supposed to sleep in. NEVER BOOK A ROOM THERE!!!", "Date": "July 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Not bad value for money”", "Author": "Beep123", "ReviewID": "UR114975728", "Content": "We stayed here when we went to see take that as it was the cheapest and nearest hotel we could find. It was very clean, small rooms newly decorated and clean but extremely hot. They had a fan on the wall which helped a little. It was easy to find and about a 3 min walk from paddington station. Didn't stay for the included breakfast as we had an early train booked. Bargain at Â£ 43 per person. I would stay again.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Cost-effective”", "Author": "jorgecrem", "ReviewID": "UR114733916", "Content": "Ok, it is not the best hotel in London if you are looking for spacious rooms, lots of services and a complete breakfast. I just got an incredible rate (see: you are in London, a not so cheap city to stay) and the hotel is truly clean, in a great neighborhood (a block from Paddington sub station) and with a nice staff. I recommend if you are looking for a hotel just to sleep, to take a shower and to rest for a couple of minutes during your day.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Paris, France", "Title": "“prison cells?”", "Author": "leskieur", "ReviewID": "UR114333575", "Content": "basement rooms, no windows, no door between the room and the bathroom, bed just next to the toiletâ€¦plastic walls about 1 cm thick, you can hear every word your neighbour says, breakfast not worth a name...internet not working...there might be a few *** rooms in the hotel, well I gues you must personally know the owner to get one...a joke about a ***", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Hmmm”", "Author": "l1heaton1991", "ReviewID": "UR110795772", "Content": "When arriving in London the hotel is only a short walk from the tube, which is really handy if you donâ€™t have a lot of time or do not know your way around London, close by are bars and eating venues - take away and eat in, also a news agents for little gifts. When we arrived at the hotel the lobby area was decorated nicely and was clean and modern with lovely leopard print chairs, the man behind the counter was friendly and welcoming. Once we got into the room (a 5 bed room) we noticed the view was awful.. a ladder a door and a window.. The ladder lead onto the street above, although there was a gate protecting anyone from climbing up that ladder I donâ€™t know how safe parents would feel bringing their children into that room. The room had 2 double beds and a single, one of the double beds was clearly a camp bed and felt like concrete, it only had one pillow on (same as the other beds) and no duvet only blankets, there were more blankets in the wardrobe though if someone got cold. There were 4 towels for a five-person bedroom, 4 cups and 3 saucers, although washing supplies are provided. When leaving the hotel to go out shopping etc guests have to leave their keys with the hotel staff, this I assume is for safety reasons, although some people may not feel comfortable with this seeing as there is a sign in the room stating \" hotel staff will not be responsible for any lost or stolen property\". Also there was not hairdryer in the room as stated when booking the room so my cousin had to go up to reception with dripping wet hair in her pjs to get one! When leaving another member of staff was on the reception, he was really helpful when asking for directions etc but when two of the girls came back there was a weird comment made - 2 of the girls came back alone and the receptionist and his friend said \" you have one girl I have the other\", this could make people feel very unsettled, especially as they knew we were in London without any men, and it was a room of 5 girls, so to be honest I didnâ€™t sleep very well, not helped by the make shift bed making so much noise it sounded as if someone was trying to open our door. In the morning breakfast is served between 7.30-9.30 which I felt was really good as it allowed people to have a lay in, there is a choice from cereal, toast or an egg, the breakfast room is small but clean and homely. When we got in the room it didnâ€™t say if it was self service and as there was kitchen staff in the room we didnâ€™t know so my cousin asked one of the ladies who just ignored her, when asked again she replied in a moody manner, my cousin had to get her own water out of the kitchen which from studding health and safety I know is not suitable. The lady then made 10 rounds of toast which I assumed was for the guests (maybe that was me being lazy ) so when she placed the toast on a table I got up and went to get some, but as she saw me she picked up the plate and stood in front of me waiting for me to move, she didnâ€™t say \"excuse me\" or make any attempt to let me pass, she just stared blankly at me. Working with the public in my job I know this would not be acceptable in my job. I would not stay at this hotel again, all together we paid Â£150 for the room, got a rubbish view and rude breakfast staff. I would recommend this hotel for a stay of 1 night, you can not hear traffic noise.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Keep looking”", "Author": "Geocamper", "ReviewID": "UR107904197", "Content": "Stayed a few nights here as pickings we slim by the time we booked. Staff we friendly enough in a mute kind of way, room clean enough to not be infectious, bed was comfy, but the real issue was being housed in a dungeon room with floors above so thin that EVERY movement by other guests made floors creak and resonated through our room. Little sleep here. Location good but there are a lot of options in Sussex Gardens area.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Not a pleasant stay.”", "Author": "Karlsson11", "ReviewID": "UR103126747", "Content": "The hotelroom was super tiny, we got a triple room and it was both a physical and a mental struggle to stay there. The room was really strange decorated. The beds were horrible you could feel the bedsprings in the bed. The room was also very cold, the window didn't shut properly and the radiator didn't really work. The bedroom only had one window, but the only thing you could see out from it was into the neighbours room which was just straight ahead with under a meters distance. There were a small kettle in the room, but no hairdryer. The bathroom however was quite nice, it was tiny but clean. The showerhead was to low though, I'm only 173 cm's but I kept hitting my head on it. The bathroom window was really small. The breakfast was really basic, toast with jam, hard boiled eggs, corn flakes and coffee. The breakfast staff didn't seem to be very friendly. The breakfast room which was located in the cellar, was tiny, people were basically walking on eachother. There was only one toaster and one coffee maker (!). The hotel staff was neither brilliant nor bad, they did their job but not anymore. No smiling here! The hotel was nice located, 3 mins walk to Paddington tube station. There were some alright restaurants nearby. It took about 15 mins to walk to Oxford St. and 7 mins to Hyde Park.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "portsmouth", "Title": "“good for the money, great location”", "Author": "whatithink11", "ReviewID": "UR102542644", "Content": "perfectly good as a clean functional hotel, polite staff, great location, if are not paying top prices, dont expect top hotels, this is fine, with a basic breakfast", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“good value for money”", "Author": "Marina0805", "ReviewID": "UR100247980", "Content": "I stayed for 3 days at Linden House Hotel. I was a little concerned because of the bad reviews I had read here. However, I had a good surprise. The staff was really friendly and offered 2 rooms to choose. The room we chose was clean, the bathroom was nice and clean and sheets and towels were changed every day. Big window and a lot of light coming through. Perfect location, near 3 tube station (paddington, marble arch and lancaster gate). 5min form hyde park. However some points need to be said. 1. The other room offered was on the basement, with small window. The bathroom was small and without a separate area for the shower. That shows that the rooms have no standard, and maybe I had just luck to be in a good room. 2. the breakfast is horrible, only black coffee, toast, one cereal and milk, and boiled eggs. So, don't expect to much of the breakfast. It is better to eat somewhere else. 3. If you have any kind of disability, make sure you have booked a ground floor room. As the building is an old building, the stairs are hard!!!! I am young, but after go up to my room on the last floor, I was breathless. In the end, if you are going to london to visit the city and walk around, this hotel is a good value for money. It is a hotel to sleep, not to stay in.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Doesn't worth it”", "Author": "aytuncdulanik", "ReviewID": "UR97751508", "Content": "We've stayed in Linden House for 3 days in February. Location is good and hotel staff is friendly. But they've tried to charge commission to my credut card which is not honest as I've made the reservation and payment over booking.com. Breakfast was horrible, rooms are too small but clean, no isolation on windows and unfortunately we've freezed. All can be better with some modifications but overall I'm not recommending this guesthouse! anyone.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Coffs Harbour, NSW", "Title": "“You get what you pay for!”", "Author": "TravelWiz_85", "ReviewID": "UR94822238", "Content": "Due to a certain volcanic eruption we had to find somewhere to stay in London at very short notice. We found this hotel online for under 50 pounds and were very happy with what we got. Were the rooms teeny tiny- absolutely!! But they were clean, we had a recently renovated bathroom and a functional TV. The beds were comfortable enough to sleep in and it was in a very quiet area. As travellers to London we didn't care for a huge and luxurious room as we were spending the majority of our time exploring the city. If you were (stupidly) intending on spending your time in a hotel room whilst in this beautiful city then maybe dont stay here, but if you want somewhere clean, comfortable, convenient and VERY cheap, value for money-this IS the place for you.", "Date": "January 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“HELL ON EARTH - MAKES FAULTY TOWERS LOOK AMAZING!!”", "Author": "rocky184", "ReviewID": "UR93955241", "Content": "This was the most awful, terrible experience i have ever had in my life in a hotel. On check in we were told we had to pay to use a card or pay cash. We were then told our room was in the basement, which was a complete building site, with building work going on everywhere. The room was so small only one person could stand up at a time, and we could hear the people in the room next door using their toilet. We asked to be moved, and were given 5 rooms keys to choose a room, however every single room was either smelly or had broken showers. We staayed in a second room which had broken cups, it stank of damp and we were woken by the builders drilling and hammering at 7am !!! Breakfast was terrible, hard boiled eggs with their shells on, a toaster that made warm bread, no staff to help, luke warm horrible coffee, empty juice cartons, dirty tables, no spoons for coffee, plastic chairs from the 1970s it was terrible. NEVER EVER STAY HERE ITS AWFUL !", "Date": "January 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Linden hotel ..Stay away from this hotel is best for you”", "Author": "alsa7ab", "ReviewID": "UR93903442", "Content": "May be a simple experience in the worst hotels in London, but when I lived in this Alinvdq will have all the news in the worst hotel inhabitants in your life Do not think of sleep because the bed is broken and bumpy sit on it, how to sleep, spend the most miserable of Houdat your life when you think about staying in your room you will need to be stunted short tall and skinny or a size smaller than human beings The room will not be enough even for your luggage, \"Be careful not to hit your head When the door opens Internet only works in the hotel reception and only sometimes works and sometimes does not work I go back to bed broken, which Cioqdk every hour of sleep that I was able to sleep so as not to find yourself in the toilet of the bathroom because he slash to the bathroom in the room No. 8, which is in the third round and there is no elevator either the receptionist is very nice and does not have only that promises a room the other day tomorrow, and if the day tomorrow and the day after the promise to leave the hotel Nsahip do not think in this Alinvdq so as not to regret as I regret", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A good hotel for touring London”", "Author": "TravelswithJiji", "ReviewID": "UR91797033", "Content": "Linden House Hotel staff were very friendly and accommodating. The rooms were very small, but I was busy seeing the sites of London and only used the hotel for sleeping and bathing - I had no intention of spending a great deal of time in my room. We were there at the beginning of winter and I found the rooms to be overheated - thankfully my heater did not work and the room was a perfect temperature. Breakfast was provided every morning, and while it was basic, it was more than adequate for our needs. The rooms were serviced every day and were spotlessly clean - even the floors were mopped. If you are a tourist to London, this is a perfect location. It is close to the centre of London and only 5 minutes from Paddington Station.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Falmouth", "Title": "“Never Ever Stay at Linden House Hotel”", "Author": "iz58Falmouth", "ReviewID": "UR84173766", "Content": "The worst place I have ever stayed in my life! I needed to be near Paddington to meet my husband the following day. Although I had read the reviews on Trip Advisor I couldn't find any other Hotel that was available, it was Fashion Week in London. The reception area was small and run down, the man that checked me in was alright but I had to pay in full right then and there and if I used a credit card was charged a fee. I went up to my room that was, if I remember correctly, up 6 flights of steps and it felt as though the floor was going to fall through the ceiling on the top floor. The bathroom was foul and the shower over run with mildew....the shower current even worse. I did shower twice and the bathroom flooded a bit because I didn't want the shower curtain to touch me. I did have towels on the floor so it didn't get to wet, I didn't want my feet to have to walk on the bare floor. Bedspreads were stained and the overall room was just so pathetic it makes me ill to think about it now. There was a gap between the door and the floor, several times during the night someone was walking around outside my room...I could see their shoes. Rather unnerving since my room was at the end of the hallway and there was nothing else around my room. My rate ncluded breakfast but I just wanted to get out of there so left at 6:30AM! I would never ever recommend this Hotel, I can't even call it a hotel.", "Date": "October 20, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Lee, Massachusetts", "Title": "“Bait and Switch”", "Author": "johnmcoulter", "ReviewID": "UR83752298", "Content": "It wasn't as awful as I can lead myself into believing it was, but really... stay somewhere else. Anywhere else. Free wireless? Website says yes. Experience says no. Hairdryer? No. Completed renovations? Not in our room. They didn't promise a mouse in the room or exposed wires coming out of the wall over the nightstand, and we did get those, so I suppose one couldn't say they didn't surprise. Does the website mention that paying via credit card on arrival carries a 4% surcharge? No it does not. But when you get there, it's there. That's a pleasant surprise for those of you that weren't planning on paying for your hotel in cash. At best, you won't totally hate it. But if you are reading this before you book travel, choose somewhere else. Anywhere else... really. You will never ever regret not staying here. I very much plan to return to London. I will never return to the Linden House Hotel. Ever. Ever ever ever. Never.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“Budget Hotel - Just about OK but not great”", "Author": "demisecco", "ReviewID": "UR82579236", "Content": "It cost me Â£79 for a night, so I suppose I can't complain too much. Room ok-ish, wifi didnt work, silly things like no tea spoons and milk for tea opened in room. Breakfast was just toast, ceriel, juice, tea, coffee and bioled eggs, I was looking forward to a nice English Breakfast.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brescia", "Title": "“Never EVER!”", "Author": "Cauthon_82", "ReviewID": "UR81924382", "Content": "Don't trust websites about this hotel. Dirty moquette and old furniture. Continental breakfast was selfservice toasted bread, jam, and boiled eggs. Ask for some hot milk, and look at their faces.. As if it is a forbidden request!!! We were given the choice of two rooms. one in the basement and one on the third floor. The both of them had a tiny bathroom. We opted for the one with a shower box (in the second one we could drown the room...). Free wi-fi connection is utopic. I asked them FOUR TIMES for it. The answer was always \"I'llcheck it for you\". Well.. I checked out without the sight of their wi-fi network. No, No and NO. The only positive note was the distance from Paddington Station. Not worthty the price.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Awful”", "Author": "mkenny0904", "ReviewID": "UR77465535", "Content": "Avoid like the plague, my wife and friends stayed. Never again! Sleeping rough at Paddington station would have been a better option. There was more of a pattern on the plate than breakfast.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“hotel from hell, never again!”", "Author": "babsh57", "ReviewID": "UR77463270", "Content": "this hotel is bares no resemblance inside to the photos on their web site, my friends & I didn't want to use the shower as the grout on the tiles and shower base had orangey brown stained marks looking really dirty. booked as a tripple room, It had two three quater sized beds and no room to swing a mouse never mind a cat, we were given an attic room which took us up five+ flights of stairs (not easy when carrying a heavy suit case). the window had only one curtain which looked more like a sack. The continental breakfast was actually toast which you had to make yourself, a hard boiled egg and one choice of cereal (cornflakes).will never stay there again and would never recommend to anyone. the only plus is the location for paddington station", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Centrally located OK hotel”", "Author": "Skygirl81", "ReviewID": "UR77451817", "Content": "I got what I expected - a tourist class hotel. The location is very good, near Paddington and the Heathrow Express - I walked to Oxford Street and there were plenty of restaurants and cafees nearby. My room was not fantastic, but it was reasonably priced. My room was very quiet facing the back and a got a nice nights sleep in a comfortable bed.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“hell hole”", "Author": "niamhy068", "ReviewID": "UR70676173", "Content": "rooms filthy and tiny. no air con. changed room 3 times. dirty carpets. ant infestation. shower plug blocked. bathroom flooded. staff unhelpful and rude. poor breakfast. no proper ventilation. We had to prop open a window with a coat hanger to let some air into room. Our room was next to kitchen. very noisy. ruined our stay in London. I am well travelled and i'm not being picky!! DO NOT STAY HERE! Disgusting", "Date": "July 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ireland", "Title": "“linden house should be BINden house !”", "Author": "juliemaile19", "ReviewID": "UR65417420", "Content": "Hotel was in a fairly good location near to the tube and shops. The room was very small and the light fitting in the bathroom was hanging out the ceiling and was not working, there was no plug in the sink. The carpet in the room was filthy and the window had a hole in it which was covered in paper!! The bin in the bathroom still had litter in it and the bedding was smelly with very very flat pillows. Not once did we see a maid in the building. The breakfast was very disappointing and the area where we got our breakfast was cramped and everyone was bumping into each other. We only stayed one night and was glad. We would not stay there again. The owner of the hotel should really put more of an effort into this hotel as it could be a gold mine as the location is pretty good.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Location": "4"}, "AuthorLocation": "Preston, UK", "Title": "“shabby, grubby never stay again and wish i'd checked trip advisor!”", "Author": "Streffords", "ReviewID": "UR61127129", "Content": "as with previous review the hotel looked nice from outside but once past reception very shabby. but it was not cheap! Â£119.60 with surcharge for using debit card. The first room offered was not cleaned or made up with new sheetsetc. Supposed to be triple room but 2 x 3/4 beds took up entire room. dirty plates from previous occupants stay. shower room had mould and dirty towels. I returned to reception and asked for better room. I was given room on top floor, shabbier as we ascended the stairs. Bleak room with 1 curtain pulled across a small window. bigger room than previous room but mouldy shower cubicle and broken shower door as well as broken electrical socket in bedroom and piece of metal to open wardrobe (cupboard). Went to bed fully clothed for fear of being bitten. queued for breakfast and choice was cornflakes, white or brown bread toast, eggs. very busy, surly staff who could not even provide a glass of water.I booked through booking.com and felt this offered a bit of assurance - obviously not! will not be making that mistake again. p.s haven't stopped itching since i got home and my daughters have bites on their bodies.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“You get what you pay for- Â£56 for 3 people, what was I expecting?”", "Author": "galwaygirla", "ReviewID": "UR59850483", "Content": "Just got back from a nights stay at Linden House Hotel. First of all, I am COVERED in itchy red marks which I'm assuming are from the bed bugs. The hotel looked so chic and lovely on its website, what a shock when we arrived. Its on a lovely little avenue so close to Paddington station. Even the outside of the hotel is nice, but once you enter its a different story. The fresh flowers at reception were so old the petals had literally turned to slime. The man at reception wasn't very friendly, I asked him to check the trains for us and he said he'd give the schedule to the nightporter to give to us- never happened. We too were told there would be a surcharge if we paid with credit card so chose to pay with cash. We were told how to find our room, it was in the basement- still didn't mind, some lower level rooms can be nice. The stairs down were dingy and dirty, all signage was worn out or faded. When we got to our room, it was pitch dark as the curtain was closed. My friend opened it and we saw why it was closed- lovely view of a ladder and a wall. The room looked like it came out of a swingers hotel- cheap red 'satin' bedspread and leather headboard! There was no hairdryer, the desk was filthy and the chair was actually a luggage rack! The towels in the room were threadbare. The shower pressure in the bathroom was excellent but the shower was on the same level as the rest of the bathroom so it was completely flooded when we washed. You needed a pin number for the TV. My friend opened the curtain in the morning and was greeted by a builders crack up on the ladder! Quite funny actually. We went out that night and I had earplugs so slept quite well, but my friends were awoken at 7am when breakfast was going right next door. We tried to get breakfast but it was full, and when we were waiting the staff didn't even greet us, they just said 'excuse me' when we stood in their way. None of the staff seemed to have uniforms either, they were all in casual clothes, including the night porter. Definitely need to burn the mattresses as I'm really itchy! Horrible hotel & staff but we DID only pay Â£56 for three of us including breakfast so can't really complain. Also, we asked if we could store our luggage for the morning and it was Â£5 per bag!", "Date": "March 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Tiny rooms - Cheap - Central”", "Author": "easytraveller92", "ReviewID": "UR58230185", "Content": "First time traveling alone, staying three nights at this hotel, which I stayed at the last time I went to London with my friend feb'09. Got a single room in the basement, but with a doublebed (nice thought, but it was on wheels.. annoying.) Tiny room, tiny bathroom, but as for one person it was okay. Had no place to leave my clothes, but a shelf. Shower had awesome pressure, always warm, good thing as the \"windows\" wasn't properly locked. I had my own fridge on the floor by the window, my coke stayed cool during the whole stay. ;) The breakfast is kind of.. boring. Bread and cornflakes is pretty much all they serve, so if you're staying longer than my 3 nights you're probably getting bored with it. But brilliant servers, always kind and lovely ladies. :) The internet-access was good, but in my room I had to sit on the end of my bed, next to the window, to get the best speed. Probably because of the basement-location. Location is GREAT. I used both Paddington station and Lancaster Hall Gate, depending on where I was going, no more than 5 minutes walk to either one. Hyde Park is right around the corner, and about a 10-15 minutes walk to Oxford Street, Marble Arch. A lot of great restaurants in Paddington, bus to London Zoo by Lancaster Hall Gate etc etc. Quiet area, pretty safe for a 17 year old girl on her first trip alone. :) When I got back to the hotel the second afternoon the receptionist actually offered me a bigger room on an upper floor, which I politely declined, as I was happy with my room. All in all, based on my stay this year and last year, I am happy with this hotel. The bathrooms are always clean, though a bit small, the beds are okay, tv is gooooood, breakfast is just.. fine. And of course, sooo cheap. Paid around 60-65 pounds for a weekend-stay. :):) I would absolutely recommend this hotel to easy travellers as myself.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norge", "Title": "“dont think this hotel is so bad”", "Author": "lulunorway Posted by a Finn traveler", "ReviewID": "UR57393164", "Content": "dont understand all the negative comments on this hotel. But I guess it depends on what you are expecting. For me its just a hotel to sleep at on a low budget, for this its perfect. The location is great too. I think the staff is friendly. The only thing not good is the breakfast and if you get a room at the top...", "Date": "March 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Poole, Dorset", "Title": "“What a complete dump - stay away”", "Author": "Bluefrog3", "ReviewID": "UR56789580", "Content": "Believe the reviews on here - this place is shocking and do not stay here. We booked a family room - what a joke - the cot wouldn't fit in the room. You pay an expensive charge for paying with a card which isn't mentioned anywhere. I said I would walk at that point but was told my card would be charged for a nights stay - it was a familiar routine for the very surly member of staff, Rooms look absolutely nothing like website - they are tiny and just awful. Beds look filthy, place hasn't been decorated for years, wardrobe door missing, loo seat hanging off. No lift and a long flight of stairs - watch your step - the carpet on the stairs is frayed and hanging off. Fire doors throughout the hotel are jammed open with fire extinguishers and the fire exit downstairs was blocked with a mountain bike, boxes and an ironing board - this place is a disaster waiting to happen. This place is an absolute tip and thank God we were only there for one night - this is the worst hotel I have ever stayed in and next time I will check the reviews on Trip Advisor!", "Date": "February 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Huge disappointment...comparable to a hostel”", "Author": "fader101", "ReviewID": "UR56083354", "Content": "So many things about this experience should have caused me to walk away but like an optimistic fool I continued. First, was the website - in hindsight very misleading. We went to book online and the whole thing locked up - a bad omen, or possibly a being greater than us warning us of the consequences of proceeding! Let me start with the positives - location, location, location. You really are a stone's throw from Paddington. Here endeth the positive feedback. Upon approach of the hotel, everything seemed in order - nice area & nice externals. Reception wasn't bad either. Although, I'm referring to the reception area with that statement - as the verbal reception we received was less than acceptable. What was supposed to be Â£240 as a telephone booking weeks before magically transformed into Â£265.20, as a questionable surcharge for using a debit card was applied. I was very very unhappy about this - also about paying in advance. First time I have ever paid for accommodation at reception in advance! We were given the roomkey and directed to the 5th (yes, I did say 5th) floor. The receptionist didn't attempt to move from his chair as we lugged our baggage up 5 winding, narrow staircases. As I opened the door I could have cried - the room was appalling. I do not say that lightly. Dirty brown curtains were drawn, which when opened exposed all manner of sins - heavily soiled carpets, filthy walls (upto about 5ft from the floor, the walls were covered in scuff marks and general grime) and the most awful crimson bedspreads I have yet encountered. Electrical sockets were coming away from the plasterwork which led to a blown fuse in the supplied hairdryer. Bathroom was modern, although a leaking shower soaked the adjacent floor. The supplied 19\" TV was easily the most attractive of the room's qualities. We booked a double room but were supplied with a triple. As soon as I so much as looked at the doublebed it squeaked...we were not long in coming to the stark reality that we would be spending the night on the single. The double bed was simply unusable. I have never experienced such noise from a piece of furniture. When provided with such a grim reality upon entering the room I was compelled to check this website...suddenly everything made sense. Had I ignored the positives we would have undoubtedly been in much more pleasant surroundings - whether that be in another hotel or most likely at home. All in all - avoid like the plague. The only comfort I could take was from the likliehood that we were in one of the better rooms, as alternative reviews have since suggested. This could easily be a holiday breaker. Only the location and the fact we had plenty to do during the day saved me from packing up and leaving.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Quantocks Somerset", "Title": "“Don't go near it”", "Author": "mikecopleston", "ReviewID": "UR53545939", "Content": "A budget hotel near Paddington with clean sheets. That is all that is good to say about it. A minute room in the basement with a plastic bathroom door and a shower which spread water everywhere. Plastering not finished and ony room for one person to stand up at a time. Breakfast - a grey hard boiled egg and a piece of toast, juice from a carton. A real fawlty towers. Advertised with tea and coffee making facilities and telephone - no room for tea and coffee making and a broken telephone socket. It can't get much worse than this. A foreign gentleman complaining at reception that they had no heating, and his girlfriend was fed up as this was their London Holiday, was treated with disdain. A sad reflection on hotel booking companies who will list any hotel, even trip advisor, if they can make money and on hotel grading systems.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Manno", "Title": "“terrible”", "Author": "supercuzzi", "ReviewID": "UR53260561", "Content": "I'm not a rat, incredible, never seen an hotel like this with 3 stars. Bad rooms, bad mobile (if any), bad heating system, bad bathromm, bat breackfast romm, bad breakfast food.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "sunderland", "Title": "“Please Please don't waste your money - itchy place”", "Author": "clarafreya", "ReviewID": "UR53224719", "Content": "Website is misleading, standard rooms do not look like that. Breakfast is disgrace, cheap cereal, cheap marg and hard boiled eggs. Rooms appear clean at first glance, but hotel is riddled, could not sleep properly through being very itchy from bed - yuck!. Only good thing was the location. A month later stayed at the euro hotel in hammersmith and found it to be very clean and breakfast really nice - scrambled eggs were eggcellent. Also very noisy so if the itchiness did'n stop ya sleeping,the constant movement of other guests moving about will keep you awake. Please don't go you will be very tired and possibly fested after your stay.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Finland", "Title": "“Avoid this hotel”", "Author": "A_Finnish_triple", "ReviewID": "UR52572392", "Content": "We stayed in this hotel for a week. We had made a reservation for a triple room and they gave us two alternatives, a room in the basement (with a terrible smell) or a room in the 4th floor (no elevator, very narrow stairs). We chose the one in the 4th floor. The room was dirty overall, the shower didnÂ´t work properly etc. The window couldnÂ´t be closed properly so it was really cold in the room especially during nights. They didnÂ´t change the sheets at all during the week. We wouldnÂ´t recomment it to anybody, stay away from this hotel.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Reykjavik, Iceland", "Title": "“Great value for money”", "Author": "hjossi", "ReviewID": "UR51639359", "Content": "Stayed there for two nights on our way back home for Christmas. We wanted a hotel that was near Oxford Street without it having to be to expensive. We almost skipped this hotel because of some bad reviews but we are so glad we didn't. This hotel has everything you need if you need a cheap place to stay for a few nights. The rooms are small but in our case it was very cozy. When we arrived we were hungry so we asked for help to order a pizza and the guy at the desk called them for us. The electricity is a little different there so when I asked at the desk they gave us a converter. The beds are perfect and it is hard to get up from them, just because they are so comfortable. We stayed at the top floor of the hotel but there is no elevator so don't travel too heavy. The location is good. We didn't use the underground system but we walked downtown and it took us about 15 - 20 minutes to reach Oxford Street . Staff is very friendly and the hotel has free wifi internet. In the end.. Great value for money and a great location.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "gothenburg", "Title": "“A stay for breakfast haters”", "Author": "aglassoflukewarmcoke", "ReviewID": "UR48824425", "Content": "The double room was very small, although the bathroom was quite large. It was mentioned on their home page that there would be hair dryer in the rooms, but in ours it was omitted. When we asked the reception about this, they told us there were only five hair dryers in the hotel. Breakfast was not a happy moment for me since it lacked a lot of ingredients that constitutes a breakfast according to my opinion, such as cheese. The eggs were so over cooked that it did not taste like eggs, but something else. I guess this is the English way to prepare eggs for eating, but in those cases I have eaten eggs before in England, I have been lucky since it has tasted good. Even tough the staff did not say much, they were friendly. If you look away from these trifles, this place is a fairly good place to stay since it is located near the subway. It only takes a few stops to arrive at Oxford Circus.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fawlty Towers eat your heart out”", "Author": "MelissaInAU", "ReviewID": "UR48813775", "Content": "We (2 adults, children aged 10 & 6) stayed here for a total of 4 nights. I wish it had been fewer! We were misled by photos on the website that showed a nice, modern room. What we got was a surprise. On arrival, we were told that we had to pay for our room in advance. And there would be a surcharge for credit cards. Ouch! We scrabbled together the cash and were then told where our room was - up FOUR FLIGHTS OF STAIRS (no lift). Of course we were not offered any help with our heavy bags or tired children. Our room had a double bed (a real \"double\" - 140cm wide bed) and two singles, one of which mostly blocked the door to the bathroom. Our bed was so close to the window (which was always open - either they were trying to conceal a smell or it was stuck) that I was worried I might roll over and fall out! There was a TV in the room but no heater/cooler and no phone. (This was important when we were exhausted after a day's sightseeing and really couldn't face the thought of walking down 4 storeys and then up 4 storeys again!) The tiny bathroom (toilet, sink, shower) looked nice, although the dark green tiles made it impossible to tell whether it was clean or not. The shower head had good water pressure, but unfortunately the drain was not big enough and so we could only shower for a minute or so at a time, then had to turn it off and wait 2 minutes for the shower cubicle to drain before we turned the water back on. Yikes! Breakfast was in the basement. The flight of stairs to the basement was beyond poky - I think it was about 90cm wide - and there was a huge queue from about 7:30, all the way up the stairs, because the breakfast room was too small. Breakfast itself was included but very basic - a couple of hard-boiled eggs on each table, two types of cereal and toast (I think 2 types of bread). There were also 69p tetra-packs of orange juice. The staff in the hotel were friendly but not really helpful, and the one time we actually asked them for anything (to ring a taxi) it did not arrive - maybe not their fault. We had the feeling that a group of students had got together and said, hey, why don't we, like, run a hotel or something? - the place was not professional but nor was it particularly comfortable. Internet access was free but I could not get a signal. The location was good, but I would not stay here again.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "cardiff", "Title": "“Do not stay here!!!!”", "Author": "xx_blonde_me_xx", "ReviewID": "UR48561885", "Content": "greeted by a miserable rude receptionist, and was told that we would have to wait to check in, no reason given, although check in time is 12pm, reservation details were incorrect even though i booked through laterooms, After the long awaited check in we recieved the room key, and made our way up to the room, all 5 flights of stairs that is, with rather heavy suitcases. After eventually reaching the room, we found that we had been given the wrong room type, I had booked a double room not a quad room.Also very strong smell of sewage in the room. back to reception as the phone in the bedroom did not work. Again it was the same person who checked us in, told him of the problem, and was i seen to be acting rather ungrateful as the quad room was larger than the double, exact words '' i don't know why you are complaining since the room you are in is much bigger''. After 10 long minutes of trying to explain that not what i reserved, the receptionist reluctantly gave me another room key, which was luckily enough right next door, back up the 5 flights of stairs, to have a look at the new room, opened the door and the most awful smell hit me!! Was certaintly not impressed. Opted to stay in the original room. Afer the stress of the whole checking in process decided to have a nice hot shower, only to find that the whole bathroom had flooded(which is exceptionally small) as the shower drain was blocked. Explained the problem to a different receptionist this time, and said he thought someone was due to go up and unblock it, which was news to me as this was the first time i ahd complained, obviously an on going problem. Receptionist said he would come to unblock the drain within the next 10 minutes, half hour passed and still no sign, so we had a go of blocking the drain, it was totally bloacked with all sorts of rubbish, and after getting no where, we gave up. some time later the recpetionist turned up to clear the drain, poured some strong smelling liquid down it, said he would return 10 minutes to see if it had worked. left the solution in the room while he went, which was Sulphuric Acid!! after half hour or so it eventually unblocked, but still leaving an horrendous smell in the room, leaving me unable to sleep. No apologies given!!!!!!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Cardiff", "Title": "“Great location but rooms are too small”", "Author": "Lambsontour", "ReviewID": "UR48264825", "Content": "After reading very negative comments on Trip Advisor we were expecting the worse. However the bed linen, towels and new ensuite was clean. Bedroom was very small and basic with hardly any storage space. As we were at the back of the hotel it was very quiet. We requested extra pillows which were provided immediately. Staff very polite. Breakfast also basic and a bit manic when crowded, as it's self-service. Extra charge for storing luggage but only minutes from Paddington. Good gastro pub 2 mins away.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Aberdeen", "Title": "“Impossible to stay”", "Author": "havefeetwilltravel71", "ReviewID": "UR46883860", "Content": "Please please please, take note, this hotel has got to be the worst I have ever had the mis pleasure of coming across. I booked via last minute .com and paid up front, bad move, I walked in and walked out. I am very very well travelled across the world from States to Asia and have never witnessed anything so poor. I would honestly say that I had major concerns about letting my family stay here, both for health and security, I got an immense feeling of mis trust about the place. There was fungi growing in the corner of the room, the shower head had a whole community of its own growing, the first room I was offered had no floor coverings, take my word and give a very very wide berth.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Liverpool", "Title": "“Would not let a dog stay in this hotel”", "Author": "hcblue", "ReviewID": "UR46555363", "Content": "I had booked this hotel for my wife as she was due to have an operation in London the next day. we arrived and were sent to a basement with pots of paint in the corridor open. the room was dirty and dark, nothing like the vitual tour or photographs. i was then offered 2 better rooms to look at but one look in 1 room was more than enough! this room may have been very slightly better but not worth the money they wanted. the staff were rude and i have never been spoken to in thisway in any hotel i have stayed in. And i stay in hotels all year round for business and pleasure.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "essex", "Title": "“very nice hotel”", "Author": "yiddo999", "ReviewID": "UR43683818", "Content": "stayed in this hotel for 1 night and would have been happy if was there for a week, it was clean, comfortable big beds (2 queen size). nice clean bathroom probably just been renovated. although breakfast very basic with just toast and cereal available. would definitely stay again. excellent location", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Excellent Budget Hotel - Would Definately Stay Here Again”", "Author": "WeWereTheSpecialTwo", "ReviewID": "UR41354342", "Content": "Whenever I book a holiday, I always check out the reviews on TripAdvisor first and usually the put me off booking the holiday. Whilst looking for a budget hotel in London, the reviews on Trip Advisor made it a complete and utter nightmare - most budget hotels have horrendous reviews. When I found this hotel, with mixed reviews, I decided to just go for it and I am extremely glad I did. My advice would be to make life easy for yourself and believe what the positive reviews say. NOTE: The pictures attached to this hotel must be old ones because the interior of the hotel has been completely modernised. I travelled to London with three friends for four nights and we had two non-deluxe rooms between us: one double and one twin - although both rooms had two double beds. For each room we paid Â£216 through lastminute.com i.e. Â£54/night which is pheonomonal value and I believe you would struggle to find anything better than this hotel for under Â£65/night. The good things about the hotel: - Exceptionally comfortable bed. I have stayed in Hilton/Ramada/Marriott hotels and their beds and on a par with this hotel. - Maid service daily with fresh towels. - Swanky, modern bathroom. - Spacious rooms. - Flat screen TVs in all rooms, including the non-deluxe ones. - 24 Hour receptionist who checks out everyone who enters the hotel. - Security cameras in the hallways for safety. - Breakfast is included: Toast, Boiled eggs, Cereal, Tea, Coffee, Orange Juice, Jam etc. - Excellent location: 2 minute walk to Paddington Underground & Train Station. 4 underground lines run through Paddington so you can basically travel to anywhere in London from Paddington with a maximum of 2 line changes.Having 4 lines is also great as it gives you alternatives when lines are delayed or cancelled. - Lots of restuarants, cafes, shops, take-aways nearby. - 5 minute walk from Kensington Gardens/Hyde Park. - Busy location at night full of tourists until around 1am i.e. safe to walk around/come home to late at night if you have been to see a show etc. The hotel itself I think is 2 stars, but remember stars refer to facillities and not quality. I really would strongly recommend this hotel and suggest that you ignore the negative reviews. It was a great find and if I went back to London I would most definately stay here again and the location of Paddington is probably amongst the best locations in London for tourists.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "scotland", "Title": "“Go to another hotel”", "Author": "lori999Scotland", "ReviewID": "UR36075764", "Content": "When you arrive at this hote ASK TO SEE YOUR ROOM FIRST BEFORE YOU PAY We paid Â£300 for 4 nights for a room that we could hardly move in it was SO SMALL I ended up having to pay another Â£90 for a bigger room Breakfast is a joke Only had it once I have stayed in a lot of hotels but this has to be the worst Some reviews you read are over the top with complaints so i always take them with a pinch of salt BUT NOT THIS TIME we could have booked into a travel lodge for cheaper and it would have been a hundred times better This is the first time i have ever left feedback for a hotel and i have been in hundreds Please take my advice Look at the room before you pay !!!!!!!!!!!! I can guarantee you will leave and look else where", "Date": "July 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "sweden", "Title": "“Really simple room but good location”", "Author": "sandmusslor", "ReviewID": "UR35863964", "Content": "Travelled with my two teenageers so I booked a tripleroom. When we had placed our bags on the floor it was no space left!! No wardrobe to put our clothes in and no room for our suitcases. A big hole in the window so a lot of noise during the night. A very simple breakfast but nice people working there. But we told ourselfes that we are only going to sleep here. Good with this \"hotel\" was the location. Near to the tube and the buses. If you can stand a simple living you can stay here because it was clean, anyway in our room...", "Date": "July 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "USA", "Title": "“STAY AWAY FROM THIS HOTEL”", "Author": "Maxman1", "ReviewID": "UR34451913", "Content": "If you are planning to listen to the positive reviews about this hotel, the best advice I can give anyone is to ask to see the room before you pay. There is a reason that they require you pay upon check in. Quite honestly I don't understand how anyone could rate this hotel as a nice place to stay. My wife and three children were planning a day and overnight in London coming off a wonderful trip fom Ireland. We flew in from Dublin and arrived at another hotel( Olympic House) to check in...they lost our reservation and had no rooms available. We asked if they could find us two rooms at another hotel. We went to breakfast and they called us to tell us they found a room at the Linden House. When I first walked into the lobby I couldn't believe it and then they showed us the room. I went from \"couldn't believe it\" to \"shocked\". The carpet was stained and so dirty it looked like it hadn't been vacuumed in a month, the walls were stained and dirty. We did not stay and you shouldn't either. This is a flop house for college kids.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cambridge", "Title": "“Great value for money”", "Author": "traveltime59", "ReviewID": "UR33339909", "Content": "We had a great stay at the Linden House. The bed was clean and comfy, the shower brilliant, the TV nice and new, the location brilliant (five minutes walk to Hyde Park, 10 to Oxford Street). We arrived early and tired and were given a room immediately. Had a great breakfast in the morning, and overall it was a great stay. Thanks!", "Date": "June 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "West Midlands, UK", "Title": "“Bathroom smelled like meat, breakfast poor”", "Author": "ChrisD39", "ReviewID": "UR32817943", "Content": "I, like another reviewer, feel it my duty to report what is an awful hotel. There are probably worse hotels, but certainly much better ones. The one good aspect is location, but the room in the attic was exceptionally stuffy, and bizarrely, the bathroom stank of kebab meat or something similar. The shower went off and on when trying to use it, and when it was on was a dribble that fluctuated between hot and cold. The 'breakfast' was a joke: cereal in tupperware tubs, a pile of bread and a toaster, boiled eggs in a dish on each table, and plastic cups for 'pour-your-own-from-the-carton' orange juice, and that's it. Staff were friendly, as they took our payment in advance. I've stayed in some suspect places, but unfortunately this is the worst hotel I've ever stayed in, or at least the worst room.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "United States/London", "Title": "“Perfect for budget hotel,has private toilet,nice staff,PERFECT LOCATION!”", "Author": "Del33", "ReviewID": "UR32653232", "Content": "I spent two weeks at the Linden House and I was not disappointed! The staff was friendly, but not underfoot, and there was always someone at the desk, which was nice. Our room was small, which is to be expected, but it was large enough to suit my friend and I. We had a private toilet for our room with a shower and sink. One piece of advice I would offer, is to ask for a room not facing the street, as it is a very busy traffic area and is quite loud all night and through the wee hours. One thing was that my bed was broken, the box beneath the mattress was jacked so badly that I had to stuff a bunch of blankets between the mattress and the box. It was extremely uncomfortable! I think that I just had an unlucky sleep area, though. My friend said her bed was fine. They offer a continental breakfast, but I never used it. You can use the internet in the lobby, but it's a pound for 20 minutes. The location is perfect, couldn't get better! Overall, I would definitely recommend this place and would stay there again.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "plymouth", "Title": "“DON'T EVER GO THERE AND EXPECT TO BE PLEASED!!”", "Author": "bettinabungle", "ReviewID": "UR31547835", "Content": "I am sorry that I am so negative but I am being 100% honest. My friend and I booked a room there for 1 night as we were taking part in the London Moonwalk (based in Hyde Park). The only positive thing was the location from Paddington and into Hyde Park, it was perfect. Apart from that the room was appalling, right up in the attic and not particularly clean, although bathroom was fairly new. I certainly would have not wanted to sleep there (we were using the room as a base as we were walking through the night). There was no fridge in the room and the staff were not singing from the same hymnsheet at all - one told us there was and another told us no rooms had them. They would not keep us breakfast if we were slightly late back from the Moonwalk, and merely said that it finished at 9.30am, no extensions! Unfortunately for us we were back in time to sample it and the cereal was housed in dirty Tupperware containers and the whole basement area which was supposedly the breakfast dining area looked as if it could do with a good scrub. All that was on offer was white bread for toasting, tea, coffee and fruit juice plus manky looking cereals. I feel that it is my duty as a good citizen to tell people of our experience because if you were going there for a holiday I believe you would be gutted. Sorry but there it is.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lancashire", "Title": "“No problems at all, convenient, cheap and good location!”", "Author": "NatFlanders", "ReviewID": "UR29912707", "Content": "My partner and I stayed here for 2 nights in September 2008 and found that the place was clean and it is in a good location as you are easily accessible to places of interest in London as the tube station isnt very far away. Breakfast was basic, just what you expect from continental breakfasts I suppose. If your booking a stay in London in advance however, why not try travelodges as you can usually get those for 29 pound per night and at least you know what to expect. (this is what I booked when I went to London again in January 2009)", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hanover", "Title": "“All of us enjoyed it”", "Author": "Julcia", "ReviewID": "UR28731081", "Content": "I have been to London with my childrens ( daughter 11 and son 9 ). My first good impression was at the reception desk. The receptionist was very kind, polite and helpful, which made me feel safe with my children. We have had booked a Triple room and paid 95 english pounds for night. We have been offered room 14 on the top floor. We didn't see the room but on my request I was accommodated on a lower floor ( we had too many bags and intended to have more - shopping in London :) . Room 107 was a surprise. A very very very clean room with 2 big double beds nice newly refurbished bathroom, plasma TV and internet we could forget that we were in a two or three stars hotel. It was much better. I have asked about the price if we would make coffee or tea which were already in the room and been told : ( it is free and please ask for more when ever you need ). I have stayed in two, three and four stars hotels in europe and even for a cup of water I have been charged. But this time it was different. Instead of paying for tea or coffee in nearby restaurants, we could make more shopping hehehe. The breakfast was served in a small restaurant, but we went there early ( previusly I used to have breakfast in hotels at the last minuts before breakfast time ends and it was always crowded because most people waits till the last minuts). There was only few people there so it was ok. We had white and dark bread, jam, butter, eggs, cornflex, mussli, coffee, tea, milk, orange juice. My children enjoyd it. I drank only coffee and it was good. We stayed in Linden House Hotel 4 nights. I wish we could stay more. I have recomended this hotel to my friends and they were satesfide and thankful. Julcia", "Date": "April 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Reading Berkshire", "Title": "“Website images are miss leading”", "Author": "myname85", "ReviewID": "UR27441499", "Content": "I stayed here for a two-night stay, for a birthday get away for my boy friend. Having searched and searched for modernised London hotels that were at an affordable price for my budget. I kept finding conflicting images of the hotels interior, so I called them and was assured all the rooms were 'beautifully refurbished'. So I went ahead and booked with the friendly man on the phone paying Â£90 for two nights (Thurs night and Sat night). The location of the hotel is a three-minute walk from Paddington underground station, which was perfect for us and anyone with suitcases. The hotel is easy to find and a good location for public transport. There is an array of restaurants on the doorstep of the hotel if you don't wish to venture far. The area seems ok and safe. The exterior of the hotel was positive, however upon entering the hotel my heart sank, I was expecting fresh and modern, but I was received with, a poor lick of paint and cheap trimmings! The place had been refurbished but on a very tight budget. They have spent all their money I think on the many CCTV cameras found around the hotel. We were in room 9, which was a double; you could see it had had a lick of paint but not much else. The double bed dominated the room leaving little space to put your suitcase down. If you kept the light off the room looked ok, it was a far cry from the images the hotel websites provide. However the room was clean the carpets were stain free, just more time and consideration could have been spent on the over all appearance. You got the impression it was an unfinished rushed job. The bathroom was good, time and effort had been spent here, although it was very very compact. If you were of a bigger build you would struggle moving around the bathroom. The only thing was the grouting in the shower was cracking at the shower tray, which let the image of the bathroom down. We understand that rooms in London are going to be small especially if you are on a budget, but it was far smaller than I had expected. Our bed was the real down fall, every time you moved even slightly the bed would squeak. On the morning of our departure we lifted the mattress up to find that 2 metal slats were broken and a metal rung from the headboard was broken. This was unacceptable regardless of the budget; you should not be given a broken bed. The breakfast was awful; you had the choice of white or brown bread and or cornflakes or cornflakes. To drink you could either have tea coffee or orange juice. The breakfast area was untidy, orange juice was spilt over the counter and cornflakes littered everywhere. The staff were all foreign and had a 'Iâ€™m not bothered attitude'. This is the most limited continental breakfast I have ever experienced. If you are planning to leave your suitcase at the hotel while you pack in some last minute sight seeing before your journey home be warned they have a charge of Â£5 per suitcase. We should have complained at the time of check in about our room but from the stairwell and other interior we has seen we failed to see that any other room would have been better. All of the reception staff were polite and friendly but I would not stay here again. I think you could find a much better hotel for the budget.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Hong Kong", "Title": "“Getting more than what I paid”", "Author": "hoohooo", "ReviewID": "UR27438698", "Content": "The title of this review pretty says it all - from this hotel I got more than what I paid. Yes the triple room (room 17) I booked is small but is sufficient for me and my parents' 3-night stay. The services are not good but I don't expect a 5-star hotel service from this little hotel. The room is clean and seems to be recently refurbished. One thing to complain is there is no soap holder in the shower (but I found the same problem in other London hotels as well). I saw previous reviews saying this hotel has poor baggage storage service (where baggages are placed in the lobby or down the stairs). Thanks to those reviews I first got all the valuables out, then requested the staff to keep my baggages at the lobby without moving it and nothing happened. The location is excellent, within a few minutes of walk from the Paddington Station and Hyde Park. The breakfast is fine as cereal and toast are basically my typical breakfast. There was no bad experience from this hotel after all. My advice is to read through other previous reviews, get a picture of what might happen and then make your choice. With this price in this location, I would definitely visit this hotel again.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Gruiten", "Title": "“Small, freezing rooms & arrogant service”", "Author": "neanderthaler", "ReviewID": "UR27208183", "Content": "Despite the hotel's excellent location, I would not stay there again. The arrogant \"service\" at the front desk was disrespectful and rude rather than helpful. And although I was given a triple room (as a single traveler), the room was so tiny that I could not open my suitcase anywhere -- it would have been a mess staying there in three.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Cheap and cheerful”", "Author": "thedeeg", "ReviewID": "UR25524004", "Content": "As with most budget hotels in the area, this one is a bit tired â€“ the room I had was certainly nothing like the ones that I saw on the website. I only stayed there for a night, and they couldnâ€™t give me a double room, so had a twin instead. However, the reception was very friendly, I got checked in quickly and easily. The room itself was tired, however it was clean. My only real gripe would be that there were no curtains in the bathroom. The hotel is 2 minutes walk from Paddington station, so very handy. I would recommend this hotel for anyone who is looking for a budget hotel in a very convenient location.", "Date": "March 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lincs, England", "Title": "“Brilliant value fr money”", "Author": "MrsPLincs_England", "ReviewID": "UR25360602", "Content": "Really surprised by this hotel. Only paid Â£40 for a triple room, but got two double beds. Great location, 300 mtrs from paddington station, and hyde park. Room really clean with comfy beds. Brand new shower room, small but very clean, and well appointed. Breakfast fine, toast, cereal and eggs, great little cafe few doors up that does a great breakfast. Would definatly stay again.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Newcastle", "Title": "“Try a hostel instead”", "Author": "johnnycardy", "ReviewID": "UR23984742", "Content": "We usually stay in hostels but thought we'd try a budget hotel this time, since it was around the same price. However we weren't impressed. The room was small, almost filled by the double bed. The TV was precariously attached to the wall directly above the bed. The furniture was old white chipboard stuff (classy!) and falling apart. The bed sheets were clearly very old with a few holes in them. The curtains were ancient net curtains, again with holes. Moving on to the bathroom, there was no room to move; literally one adult could fit in there, and a skinny one at that. The toilet seat was detached from the toilet. We had three nights booked. They wouldn't refund us but we left after the first night anyway. I am used to staying in hostels so I don't have particularly high standards - at least hostels do what they say on the tin!!", "Date": "January 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "crikvenica", "Title": "“croatia”", "Author": "nana2301", "ReviewID": "UR23976870", "Content": "me and 3 of my friends stayed at this hotel for 7 nights. we booked the room through venere.com. we got a great price with a discount and each of us payed 150euro for a week. it was even cheeper than on the hotel web site. i expected less, but we got a clean, renovated room with a fridge and our own bathroom. the breakfast was continental but a good start of every morning. the recepcionist was a really nice guy. the location of a hotel was great, 2 min walk from paddington station, and few more from hyde park. near the hotel there are few pubs, kfc, burger king and shops. the neighbourhood was guiet and pleasent. i think this hotel represents a good value for money. i think i will come this year again, but with my bf. i am looking forward to it!!! a+a+j+m", "Date": "January 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Didn`t sleep a wink!”", "Author": "k8lib", "ReviewID": "UR20926446", "Content": "We needed a hotel for one night`s accomodation before flying out of London. We weren`t expecting luxury, but we were still very disappointed with what we found. It took us a little while to locate the hotel, and the checkin service was satisfactory, but the room was small, dark, noisy and downstairs (without a lift! Not good when you`ve got 6 weeks of luggage to cart around! When I asked the staff if there was a lift, he replied `it`s only one floor!`) We were woken up at 3:30am by fellow guests - we could hear every word of the their conversation from the room across the hall! Then, after we`d finally got back off to sleep at 5am, we were woken by the kitchen staff at 6:30am setting up for breakfast and having a very animated conversation to boot! The breakfast was tasteless and unsatisfactory. The quality of the room, particularly its fixtures and fittings, left a lot to be desired. As did its cleanliness. There is a frameless shower that managed to wet everything in the bathroom, including the toilet roll (which didn`t have a holder, so was sitting on top of the cistern) Although the location of this hotel works in its favour, and the staff weren`t directly rude just not overly helpful, I wouldn`t recommend this hotel.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Great location, basic”", "Author": "rjm3003", "ReviewID": "UR20629869", "Content": "The hotel is located apporx 300m from Paddington Tube station making it a great location to sight see. The area felt safe and places to eat and drink locally. The reception area was very welcoming but we were in room 16 which was up 5 flights of narrow stairs - the decor on the way up was not as nice as the reception and it looks like they are carrying out some refurbishments. Our room was clean and the bathroom newly refurbed. Unfortunately our water was cut off one night at midnight meaning we couldn't shower or use the toilet and it was too late to call anyone out. The night receptionist gave us bottled water, a full kettle of water and told us not to use the toilet!! Breakfast was cereal, toast and boiled eggs but the breakfast room was compact. All in all, for the price, we got what we paid for. I would stay again purely for the location. THE PHOTOS ON THE LINDEN HOTEL WEBSITE DO NOT REFLECT WHAT THE ROOMS LOOK LIKE!!", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“An intristing experience”", "Author": "DanSBucharest", "ReviewID": "UR19097713", "Content": "I was really scared when I read about the hotel AFTER I booked for it on Net. First I wanted to cancel the reservation, but the price and the location (5 minutes walking to Hyde Park or Paddington Station) determined me to go for at any risk. We are 3 adults and stayed 14 nights at a very low price for Zone One in London, in July and August 2008. We had a triple room with a double and single bed, refurbished, nice looking, very clean, with no wardrobe, but with air conditioning and flat screen TV (TFT). The bathroom was a little too small, but new, clean and functional. The windows were old, not sure, and I thing the noise could penetrate through, if the room had been placed to the street. All the staff was very friendly, welcoming and accommodating. The only animal protein was one egg at the â€žContinental Breakfastâ€�, but with toast, butter, jam, tee, coffee, orange juice, milk and 3 kind of cereals, a little crowded after 8.15. We really enjoyed this hotel.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Trondheim", "Title": "“Indoor rain and fleas”", "Author": "girlinoslo", "ReviewID": "UR18236405", "Content": "Really terrible! It rained down from the roof into my bed and from the roof over the toilet. Beds filled with fleas. Breakfast room is a big sauna with queues and mess. Breakfast is toast, butter and jam on the tables, but no avaliable tables. When we asked the owner is we could change room, he answered \"But they are all bad\". Find another hotel!", "Date": "July 25, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Bucharest", "Title": "“The worse hotel i ever stayed”", "Author": "Bogdani7", "ReviewID": "UR18075882", "Content": "My name is Bogdan from Romania and i visited London in June 2008. Please read this and forget about choosing this hotel. Don't try this hotel. It is dangerouse. I staied with my girlfriend for 4 nights and was terrieble. We were robed in the hotel. The people from frontdesk didn't called the police. We really belive that this hotel has a huge problem. We think that they are involved in steeling stuff from people from hotel. They stolled our laptop. And other three rooms were robed. For sure some of the stuff is involved. The frondesk people seems to understand english but actually they don't. There are imigrants from India that don't have a clue about english. It is the bad place i ever staied and i'm from Romania. Don't check in this hotel. Is worse than what i write here. They took our stuff out from the room and we didn't check out. The room was paid but they took all our luggage out and checked somobody else in our room. When we came back from the city all of our stuff was in the lobby. Really the rooms are with no protection. The rooms can be opened easilly. They actually have 5 rooms renoviert but all others are old and easy to broke in. Pay more because you will be safe and also your luggage. This is a dangerous place. Don't go there. Find another hotel. If not better cancel your trip. Serios, is better so.", "Date": "July 20, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Wales", "Title": "“Avoid, or be very carful with your credit card details!!”", "Author": "StrawberryWales", "ReviewID": "UR18003874", "Content": "Comments: I have not stayed here so can not comment on the hotel itself but can comment on the problems I have encountered with a cancelled booking! I booked a room and used my credit card to secure the booking however the management said they would charge me more than the standard or deluxe rates shown on the website, stating it was because it was a weekend! I was annoyed at this so I decided to cancel. I emailed the hotel a month before the date I was due to stay asking them to cancel the booking and confirm they'd done this and that they had destroyed my credit card details but didn't receive a reply. I emailed again two weeks before the booking and finally received a reply confirming the room had been cancelled. I then booked a room elsewhere. When I checked with my bank after my visit to London , Linden House Hotel had debited my credit card with Â£150 on the date I was supposed to stay despite the fact that I had cancelled well in advance. The cancellation policy states 48 hours before the date of arrival or the first night stay will be charged. When I telephoned to query this, I allegedly spoke to one of the managers and was advised I was charged as we didn't show up. I have forwarded all the emails to the hotel showing that they acknowledged the room had been cancelled well in advance. That was three days ago and after several phone calls and emails, to which I have had no response, I am now going to follow this up with my bank. When I have telephoned, I have asked for the details of the person/company that actually own the hotle but could not get the details from the person I was speaking with. If you are desperate enough to book this hotel, make sure you get the advertised rate and if you cancel for whatever reason, make sure you cancel the credit card that you give them to secure your booking!!!", "Date": "July 18, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "nottingham", "Title": "“value for money”", "Author": "samnotts112233", "ReviewID": "UR17765633", "Content": "i read some of the previous reviews expecting very little when i went. but seriously, it is great value for the amount of money i was willing to fork out. the staff was friendly and helpful when needed and i encountered no problems at all. the location's excellent as well.", "Date": "July 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "West Midlands, England", "Title": "“try elsewhere.......”", "Author": "lonewolf_534", "ReviewID": "UR17609535", "Content": "First of all let me say if you have a few extra pounds to spend then take my advice & stay somewhere else. I have stayed at this hotel on previous occasions (when it was run by the previous owners) & before the so called 'complete refurbishment' (which is a blatant exaggeration of the truth!) Since its takeover by the new proprietors let me point out a few details that may be of importance. The hotel website advertises a double/twin room at Â£70 per night, however on a couple of occasions I have called to book I was told the price was Â£95, when I questioned why, I was informed that due to special events or circumstances the price is put up! However, a mid week stay with no special events that I knew of cannot constitute the hotel adding an extra Â£25 to the price they advertise. It goes against advertising standards - BE WARNED of this little matter. The hotel website also claims that the hotel has been completely refurbished! That may be so for the reception area, but as for the double room I had the 'pleasure' of staying in, it was of a very sub standard condition. There was paint peeling, the decor was akin to something from the 1970's as were the curtains & bed sheets. The rooms are quite small, this I knew of from my previous stays, I am not after luxury, just something thats value for money & convenient. The pictures on the website were nothing like the room I stayed in. Dirty magnolia walls with paper peeling at the edges is something I would liken to one of those 'motels from hell' you would see in a horror flick. Next comes the breakfast room, which seems to be smaller than I remember. Forget a traditional English breakfast as was the case with the previous owners, all you have now is a continental breakfast which you have to queue for. There was no free tables when I visited between the given times of 8.30 - 9.30am, I had to queue as did other people & there was no clean tables or cups. I suggest the hotel proprietor rethinks the window on breakfast times as the one hour period just causes queues & chaos! The waiting staff, although I do not lay the blame with them, did very little to offer any help even though they saw people waiting for a table. Needless to say, I did not wait & went further up the road into Paddington for breakfast. I did make a point of this at reception, but my comments that were written on an A4 piece of paper will no doubt have found its way into the waste paper bin! In summary, I will NEVER stay at this hotel again & I feel sorry for anyone who has the misfortune to believe this is what British hospitality is really like. The standards of this hotel leave alot to be desired & I would suggest they be a little more forward with the truth on their website regarding price of rooms & the complete refurbishment of the hotel is quite obvious to me that they are not being totally honest with their customers. I will wait to see if the nature of my complaint is acknowledged but somehow I dont think it will.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Watch out”", "Author": "Rickii", "ReviewID": "UR16486787", "Content": "I booked to stay for 3 nights at the Linden House after checking it out on the net. But when we reached there and being shown the room, we saw it was really very tacky and not anything like what was expected. The Quad room was tiny with barely room to move around. There was one window in the room which opened into a little space (maybe 10 x10) which was boxed on all sides. So could only see a blank grey wall. The bedside table had a huge hole in it which rendred it unusable. When my wife and kids absolutely refused to stay at this place, the receptionist offered to show us other rooms, but these turned out to be even worse than the first room. Apart from this the hotel had a really creepy and wierd atmosphere and definitely not a place you would take your wife and kids to. At this point I informed the receptionist that we would not be checking in and my wife walked out to look for rooms in other nearby hotels which all looked better than this one. I had paid GBP 300/- for a 3 day stay at 100/- a day. When I asked for a 200/- refund as I was ready to loose the 100 pounds but not stay there, I was informed that I was going to be charged 200 pounds as cancellation. When I argued that this was not as per guidelines recieved with my confirmation as it was specified there that in case of a 'No Show' the hotel 'may' charge a 1 day cancellation, the person called up the owner who apparently told him to inform me that I was lucky that I was getting any refund at all. I want to warn everybody who is booking this hotel, that there are many many other much better hotels all around at comparable rates and please don't book this one.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Location”", "Author": "ronnie22London", "ReviewID": "UR15584110", "Content": "My wife and I booked this Hotel through an agent, unfortunately they did not pass this onto the hotel. However on arrivial staff were were most helpfull ensuring that we were looked after. The room was clean and tidy and was pleasent. The location is great and we found it a great place to stay. I will recommend this hotel to others as it is certainly value for money. Jeff and Phillippa", "Date": "May 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cheshire UK", "Title": "“Good Night's Stay”", "Author": "Crisvar", "ReviewID": "UR13753893", "Content": "Stayed for one night 18 February 2008 in Double En-Suite with Continental Breakfast at very reasonable rate. Friendly receptionist greeted our arrival and showed us to room. Room was located in the basement, but had been recently refurbished and was warm, clean, and comfortable. Air conditioning was available but only required for a short time. Tea/Coffee facilities in room. En-Suite was a fully tiled 'wet room' with open shower and modern sanitaryware. Choice at Continental Breakfast was limited to Tea/coffee, cereals, fruit juice and toast / jams. A nice touch were the pots of hard boiled eggs on each table! Conveniently located for Lancaster Gate Tube and Paddington Stn The hotel rooms are currently being refurbished, and we understand that approx. 50% are complete. Would recommend requesting a refurbished room as there is a significant improvement. Would also suggest that for more than two nights, an 'above ground' room be requested. Recommended for a short stay in London", "Date": "February 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LONDON", "Title": "“Great Hotel”", "Author": "SAM123LONDON", "ReviewID": "UR13750868", "Content": "We were a little scared after reading other reveiws here and on the hotel website but.........................we were pleasantly supprised!! we received a very warm welcome.As we checked in early, we were happy to store our luggage though we had to pay Â£5 .we were on the first floor the room looked newly decorated the beds were new and everything was spotlessly clean!! The hotel is very close to subway which is very safe !! it was great. no problems at all.", "Date": "February 22, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Website is pure fiction, this hotel SUCKS”", "Author": "ppyrgic", "ReviewID": "UR13483646", "Content": "This hotel is the worst i've ever stayed at. The rooms were filthy and small. The \"double\" bed was so worn that when you sat on it the mattress squashed until you were sitting on the base. The sheets were dirty. The wallpaper had mould and was flaking off. The bed filled half the room, and was squashed into the end of the room surrounded by 3 walls. Barely enough room to get dressed. The website is PURE FICTION. They simply must have taken pictures of another hotel. The rooms are HOSTEL style, not as described on the website. If you pay more than 20 quid a night, you've been turned over. I promised my wife next month we'd find somewhere nicer.... there's an underpass underneath the hammersmith flyover that would qualify..........", "Date": "February 12, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Plymouth", "Title": "“Never Ever Stay Here!”", "Author": "Fairylicious", "ReviewID": "UR12928187", "Content": "This is the worst hotel I have ever been in. We had seen on their website which looks very fancy with nice rooms as they said they had just been refurbished. We decided to ring them and book the room and were promised one of the new rooms. All that seemed great until we got there. We had been told there was parking nearby but it was 20 min walk away. On arrival, we collected they keys, filled out the form and went to the room. We were given one of the old rooms, when we queried it we were told there was no way we would of been told we could have a new room, and for the money we paid, that is all we are getting. That was the only reason we booked this hotel! If you can call it that! The room was absolutely horrible! The mattress was so old and stained and totally lumpy. Extremely old decor. The bathroom was not nice, crap toilet and no hot water in the shower!! The shower tap was falling off the wall. Walls were paper thin, Rude staff and a very rude young receptionist who has the attitude that he is better than you and makes you seem to be in the wrong. Please to not ever stay in this lame excuse for a hotel. For the same price there is alot better for money!", "Date": "January 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "uk", "Title": "“Oh my god its a horrible!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!”", "Author": "joekiwi99", "ReviewID": "UR12404200", "Content": "rude staff, unclean rooms, rats, toilet falling off the wall, towels& bedding stained and torn, black mouldy shower, wall paper torn...............I only wish I'd had the stomach to stay long enough to photograph this hole. ps: having been flatly refused a refund by the management as I walked out 5minutes after walking in, for the 2 nights prepaid thru lastminute.com. Lastminute.com have contacted them and been told that I stayed both nights... a blatent lie.", "Date": "January 13, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Cornwall UK", "Title": "“Ok for a night”", "Author": "KT2006", "ReviewID": "UR10988354", "Content": "Excellent location, friendly reception, and dining room OK. Bedroom small and a bit old, but needs modernising, especially the shower. Evidence of some work going on around and about the place,, but seems it could do with a major refurbishment top t0 bottom? Do wish they provided continental style quilts instead of those old fashioned sheets and blankets. Ok for an overhight stay for an early start out of Paddington station, though, or perhaps a later night arrival there, but really not a very good standard overall, even for the so-called 'special' prices on the internet.", "Date": "November 22, 2007"}], "HotelInfo": {"Name": "Linden House Hotel", "HotelURL": "/ShowUserReviews-g186338-d564847-Reviews-Linden_House_Hotel-London_England.html", "Price": "$119 - $392*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6 Sussex Place</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 2TP </span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "564847", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f3/85/f38581baf35ebb7faaf8c3480c3366e81large.jpg"}}