{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nice, France", "Title": "“Very nice hotel, well located with a nice/friendly/helpful staff”", "Author": "AleXTrip009", "ReviewID": "UR128000409", "Content": "This 2 stars hotel, is has vey good ratio quality/price for Roma, very well located in the city centre, near the Colloseum, close to public transport. The refurbished rooms are modern, spacious, with a nice bathroom. The classic rooms with separated bathroom, are correct and very adequate for a 3 or 4 nights stay. For the breakfast, it is pleasant to have it already included into the room rate, and even if the room is small, the quality is very correct. Last but not least, the staff, is very sympathic, helpful, nice, ... only positive comments on them !", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“The staff make the experience of staying at this small classic Italian hotel very special”", "Author": "SmithAtlanta", "ReviewID": "UR127527678", "Content": "I cannot say enough nice things about the staff...all of them...at this small hotel on a side street very near the Termini, a very convenient location. They went out of their way to make us feel welcome and to help us any way they could. Some of the rooms are small but we were fortunate to have a top floor bedroom that was larger than most and with a balcony that we very much enjoyed. The rooms were very clean with modern conveniences perhaps not found at all hotels in their price range. We choose the option with a private bath and breakfast included for convenience. Given the prices for accommodations in Rome, I thought this hotel was a good bargain. I would most definitely choose to stay there again if for no other reason than the outstanding staff.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California Hot Springs, California", "Title": "“First Knight!!!!!!!!!!!!!!!!!!!!!!& amazing stay”", "Author": "darkmoonlight", "ReviewID": "UR127308741", "Content": "we selected Saturnia, through Trip advisor ratings and we are very glad we did. On arriving we were greeted by the most nice and lovely Concierge we have ever met !he was extremely nice Charming, and helpful. He gave us very helpful, clear instructions and gave us a map showing all the points of interest in the city which was very helpful . that made it very easy for us to see everything. Then helped us with our luggage,also let us use the front desk computer and printer to print our boarding passes for our flight and to book the Vatican museum . he seemed to really like doing his Job, and enjoy doing it!!!!. unfortunately we don't know his name, but he looks like Richard Gere 20 years ago!!!!!!!!!and always smiling, really fantastic also the staff at breakfast were very helpful and attentive. Breakfast itself was very good, there was bread, ham, cheese, and orange juice, cookies, etc. The cappuccinos were delicious , lots of choice, The room was very pleasant and clean. It was truly well worth the price. These are small things which can easily be fixed,But the location, the spotless cleanliness, the atmosphere and the welcome- all make it a wonderful place . The location of the hotel was very convenient ,We walked everywhere from the hotel, all points of interest was within a reasonable distance.We even walked to the Vatican! If you want to buy beer, wine, cheese, bread there are many stores nearby. We checked out and our flight home was late. the hotel looked after our luggage for the day so we could spend the day sightseeing. Everybody who works there really cares for the guests and we were made to feel very welcome. Thanks all Saturnia staff (specially the guy with Richard Gere eyes) We were very sad to leave and look forward to our next visit. We cannot wait to go back Highly recommended", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Huntingdon, United Kingdom", "Title": "“Fantastic staff”", "Author": "Raj R", "ReviewID": "UR126988292", "Content": "This hotel is incredibly good value for money, the staff were so friendly and went out of their way to help us, recommending places to see and eat. I can honestly say that I have not encountered more friendly staff in any hotel we ve ever stayed. A great family friendly hotel, would definitley stay again.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“A really pleasant stay!”", "Author": "Karl M", "ReviewID": "UR126912618", "Content": "We arrive at Saturnia early in the morning, about 11:00 a.m., and the man at reception advised us that our room was maybe ready. Time for a lovely cappuccino maid from a young lady and as promised our room was ready. We've really appreciated this because for an only two days stay in Rome time is precious. Room are perfect for a couple, all needs are inside. The location is the other advantage of Hotel Saturnia. You can walk everywhere, to Colosseum (amazing), to the Vatican (incredible), to Spanish steps (wonderful) and best shopping area is also 5 minutes walking. At least we recommend this place to all people want to visit Rome.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raleigh, Nc", "Title": "“A Great Base to Explore Rome”", "Author": "Globe_Searcher", "ReviewID": "UR126093106", "Content": "We booked this hotel based on the reviews on tripadvisor. We were not disappointed. We arrived early and were offered breakfast while our room was cleaned. We received our room at 9:30 AM, which was much earlier than the official check-in. Breakfast was good. Ask for coffee from the lady behind the counter. The room was as advertised, clean and with all the necessities. It was not large by any means, but this is expected in Europe. The hotel is on a side street off of Via Cavour, so the noise was not an issue. Make sure you have the address handy for the cab driver. The front desk was always willing to help with any request. We chose this hotel because of its location to the train station and the metro, proximity to the Forum (and other sites), and cheap eats. I would re-book if we return.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pulborough, United Kingdom", "Title": "“Truth be told.. It's pretty average!”", "Author": "Claire R", "ReviewID": "UR124303453", "Content": "After reading all the positive reviews of this hotel I was fairly excited about the trip and thought my boyfriend had chosen rather well! However it's fair to say that I was underwhelmed and quite disappointed. LOCATION The hotel has a relatively central location, within walking distance of the main sights, however any hotel in the city centre boasts this trait! You don't need to stay at the Saturnia for that! STAFF The reviews on hear state that the hotel staff are outstanding.. I'd have to disagree I'm afraid. On arrival the hotel staff were not overly welcoming, and after attempting to ask where a nice restaurant would be for dinner (and getting no help!) we quickly developed a bad impression of them. This was somewhat rectified the following morning when one of the staff members kindly helped us find our feet and plan our route around Rome. However this was the only time that we saw him and the rest of the staff just weren't up to the same standard. ROOM We had a standard double room. However it was not a double, it was two single beds pushed together. Now I work for a Travel Agent and I understand that this trait is applicable in Europe as you often get two beds pushed together BUT this should only occur when you book a 'standard room' if the room type is stated as DOUBLE that is exactly what it should be. One of the beds was also damaged, the shower broken and the heating in the room failed to work. FOOD The breakfast at the hotel was awful. I'm sorry but there's no other way to describe it. They had croissants, ham and coffee. That really was the extent of the breakfast. Needless to say I only ate the breakfast once. ROME IN GENERAL Rome however is amazing! And I'd recommend it to anyone! Beautiful city and so much to see! Me and my boyfriend went from the 3rd of February - 6th February and we experienced Rome in the snow which was so pretty! Unfortunately a lot of the attractions were closed due to the freak weather, but hey, how often does in snow in Rome?! Makes for amazing photos! :) TOP TIP: There are some amazing little restaurants near the Trevi Fountain definately worth a try, Al Picchio was our favourite. OVERALL I would recommend Rome to anyone! I just wouldn't recommend the Saturnia. If you're looking for a cheap but lovely little hotel perhaps look at the Columbia or the Amalfi (excellent 3* stars) or if you're looking for something more upmarket try the Capo D'Africa (4*+ stars).", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Wonderful service, great location”", "Author": "CarrieinDenver", "ReviewID": "UR124154868", "Content": "I had the pleasure of staying at Saturnia for business for four days in January. This little hotel is a wonderful find and great place to stay. It is certainly small and simple, but I would absolutely recommend it to anyone. The staff are incredible and made me feel like I was in my own home. They could not have been more accommodating. The location of the hotel is also ideal as it's within walking distance of the Stazione Termini and the Colosseum. Its location right off Via Cavour makes it easy to find without having all the noise that a large street brings. If I were to ask for any improvement, it would be the breakfast. It was very basic and certainly not bad, but I would have appreciated some fresh fruit. However, this is a minor complaint. Overall, a wonderful experience.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Little hotel, huge service!”", "Author": "Pedro C", "ReviewID": "UR124094389", "Content": "This hotel is very close to most historical sites as Il Colosseum, Fontana di Trevi, Forum and the metro/train station. It is a very good choice as it is not expensive and it is really worth it! The service is awesome, the receptionists are very kind and help you in anything you need, specially Alessandro, a 22 year-old man born in Rome. This is a hotel I would recommend to a friend.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Very nice basic hotel. Central to all main sights”", "Author": "C4er", "ReviewID": "UR124050858", "Content": "We had a single room with double bed/bathroom on the first floor overlooking the side street. The room was small but was clean and tidy - just what we wanted for a 3 night stay. Our room was overlooking the side street and although we left the windows open, we didnt experince any noise from the street, it was pretty quiet. The breakfast lacked a little - coffee wasnt very nice, neither was the choice of food but was adequate to start the day. Reception staff were friendly and overall a very nice hotel if you just want somewhere to sleep. The hotel is about a 10 minute walk to the colloseum and about 20 minutes to Trevi fountain. We caught the Metro to the Vatican but it wasnt a very nice experience so we walked back to the hotel from the Vatican and saw some lovely sights that we wouldnt have know about if we had caught the metro. Took us about an hour to walk back. Also the hotel is only about 15 mins from Termini station and has a few metro stops around. I would definately recommend this hotel due to its location. Lots of nice restaurants nearby and everything was within walking distance.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sidney", "Title": "“sin go home”", "Author": "angus670", "ReviewID": "UR123535485", "Content": "we were very good in this hotel, where we found staff friendly and reliable. our room was on a mezzanine floor and there was no lift, but the very friendly Mr. Virgilio accompanied us and brought us our very heavy suitcases. advised us where to eat our meals and how to visit the tourist areas. we hope to return soon", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "moss", "Title": "“a good place”", "Author": "arild b", "ReviewID": "UR123535053", "Content": "small hotel in a good position to rome. very convenient to be able to visit the city, very close to the train station and bus station. Staff very efficient for a good cleaning. typical Italian breakfast, but Buna, also good coffee and juice or chocolate. a good appreciation for Mr. Virgilio", "Date": "January 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Phillipsburg, New Jersey", "Title": "“Just Don't”", "Author": "kingstupka", "ReviewID": "UR123253542", "Content": "Its a little difficult to write this because the people running the desk at this establishment were very nice and I feel a little badly for them. I felt worse for myself after having slept here for a few nights and the point of this site is for people to get real opinions. I've travelled all over Europe and North America and have never seen a hotel this bad. I have slept in cabanas and tents on beaches in Mexcio and am not a princess by any stretch of the imagination. The rooms were dirty, the mattress 20 years old, the floors made of laminate that were extremely noisy all night long. The floor in the room was actually partially tile and partially laminate with big gaps in between. The windows were uninsulated and the street noise was terrible. There was no thermostat to control the heat. This entire hotel needs to be redone and maybe should close until then. The doors to the rooms and the baths don't open fully; they hit the raised floors and scrape along. The pillows were the flattest I had ever seen and when we asked for extras, the ones we received were so old and dirty I was afraid to use them. Half of the outlets in the room did not work which mad me wonder about the wiring. The shower had no shelves for your soap and shampoo and was about 18 inches wide. For the price, I did not expect much, actually our expectations were extremely low but we were still dissappointed. I could go on but overall it was so bad it seems silly to go into every detail. This place might be okay for the backpacking crowd if they can get a bed for less than $20 a night that they will likely not use much. There are much better places for the same money very close by. If you are tempted, just don't, trust me. A place this bad can really ruin your vacation as if you can't sleep, you will not have the energy to see all the amazing sights in Rome.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Very Impressed, friendly staff and great location”", "Author": "SamT1801", "ReviewID": "UR123223381", "Content": "As this was a last minute holiday I was quite concerned as to what our accommodation would be like. My sister and I chose this hotel as it had good reviews and was said to be in a very good location. These reviews did not let us down. The rooms (although very basic) were clean, the location was fantastic, and the staff were very friendly and helpful. We found ourselves out for the entire day enjoying the sights of Rome and so only needed somewhere to sleep. This Hotel definitely served the purpose. I would recommend this hotel to anyone who is only looking for a hotel that is reasonably priced, good location, but away from the hustle and bustle. It is also a 10 minute walk from the Termini, so easily accessed from the airport without using too many modes of transport. Breakfast was average but it is Rome so you tend to eat a lot of Pizza in the day anyway. I hope this helps to anyone looking to go to this amazing city. Enjoy Roma.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Orange, CA", "Title": "“Great Little Hotel”", "Author": "Jayda L", "ReviewID": "UR122863769", "Content": "This hotel was fantastic we paid for the price. The walk to the coliseum took about 10 - 15 minutes and it was not that far from the main train station. The hotel staff were so friendly and the best thing about the breakfast was that when you wanted a coffee they made it there and then for you to go with your breakfast. We really enjoyed our stay here and would go back.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Trip Advisor is broken”", "Author": "m c", "ReviewID": "UR122639024", "Content": "I placed a search in Trip Advisor for the best hotel in Rome - business purposes - located near the main city train station and the number 1 result was this pile called the Saturnia. The room was so small...... ( how small was it?! ) that i could barely open the door before smacking the flophouse era bed. The toilet was so small.....( how small was it??) that I could barely squat to enjoy my morning constitutional before banging my knees on the pathetic excuse for a shower stall.... Breakfast was a treat - they had a monster cappucino machine with a snarly lady who said that there was no such thing as a cafe latte The good news was that they had an automated crappocino machine as an optional alternative for lousy espresso but without the attitude. Overall: Overpriced and only good for a quickie with a Tuscan Ho Shame on Trip Advisor for letting this one get the #1 ranking Rank", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "boden", "Title": "“New Year in Rome”", "Author": "kerstin b", "ReviewID": "UR122478725", "Content": "We stayed three days at the hotel saturnia, although is very small and old construction, lacked the necessary comfort. breakfast was included in the price and was plentiful and varied. last year, the Concierge, Mr. virgilio, before going to the concert offered us sparkling wine to toast the arrival of the new year. upon return, about four, we were cold and offered us a good hot tea, hoping a good year, we were really good.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bombay", "Title": "“unforgettable”", "Author": "pancay", "ReviewID": "UR122423822", "Content": "I was with my family saturnia hotel, we enjoyed the Roman culture very different from our own habits, educational archaeological, rome is wonderful, beautiful, and has been for us to be an emotion on Roman soil. see the monuments so ancient it's exciting. Our hotel, small but efficient for comfort. Mr. tiziano and Mr. Virgilio, friendly and kind to our requests. breakfast to Mrs. lilly very helpful. were it not for the distance, we will return willingly.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“amazing journey”", "Author": "nancy f", "ReviewID": "UR122087979", "Content": "thought for a long time to grant a holiday in Rome, but we have postponed many times. This hotel gave us a good room with a bathroom at a great low price. The breakfast was typical European, but all very fresh and plentiful. the staff were very friendly, even Miss Mikela. great staff in reception, thanks to Mr. Virgilio very nice and helpful", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Top-Notch Service”", "Author": "StephCain", "ReviewID": "UR122034752", "Content": "The service at Hotel Saturnia was top-notch, especially for a small hotel. Everyone was kind and spoke English as well as Italian. The front desk employees could answer all sorts of questions, from where to buy wine to the shortcut to the Metro. The breakfast was the standard European hotel breakfast, but the items were fresh and they hotel had a barista making fresh espresso, americano, and cappucino. Sure beats the automatic machines!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Errmmm...”", "Author": "puxadoraz", "ReviewID": "UR121994914", "Content": "This is a rather difficult review to write. I was swayed to try this hotel by all the wonderful reviews it received by other travellers on Tripadvisers. I did not read the room description and missed the fact that it offers shared bathroom facilities - no wonder the room was so cheap! If you are adventurous enough to share bathrooms that are not sparkling clean with starngers, you should be okay with staying there for a few nights. BUT, the beds are soft, and is not conducive to a good night's sleep. You are screwed if, like my partner, you have back problems. Breakfast was okay, nothing to rave about. Staff was polite and nice. Location is not very great, you have to walk a distance from the railway station.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hyderabad, India", "Title": "“The hotel was OK”", "Author": "Geetanjali85", "ReviewID": "UR121872753", "Content": "We visited Rome in August 2011 and stayed at hotel Saturnia. The rooms were quite small and felt very dark. You can hear people climbing the stairs or talking. It is close to Roma Termini and two other metro stations which is why we probably chose it. It is also close to the Colosseum and there are enough places to eat nearby. The location is good but we didn't really like the hotel and our room. We'd prefer to try a different hotel when we go back to Rome.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“cheap and comfortable hotel”", "Author": "taimot t", "ReviewID": "UR121615888", "Content": "conveniently located for any displacement. Welcoming staff. small rooms. Riccardo very kind to recommend restaurants, Michela and Palmira carine either in the breakfast room which in cleaning the room. Thanks to the hospitality and kindness of Mr. Virgilio, in particular the art exhibited in this small hotel.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "europe", "Title": "“Quaint and convenient hotel”", "Author": "nomadEurope", "ReviewID": "UR121409421", "Content": "This was not our first visit to Rome but one of the best. Best because we stayed at a reasonably priced hotel but with a 5 star service. The Saturnia had everything that we could wish for; helpful staff, clean room and good breakfast and our requests were genuinely attended to. We shall return.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“convenient to visit Rome”", "Author": "jhonsoon m", "ReviewID": "UR121361207", "Content": "We stayed at this small hotel very convenient for visiting Rome. We visited the city on foot. The links were very indicative. Rome is wonderful at night, thanks to the indications given by Mr. Virgil to availability and we came back at three in the morning. Breakfast can be done until ten o'clock. Mrs. Michela is very courteous. The downside of this hotel is that it has no elevator and some noise in the work to improve the hotel.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Value, but noisy halls, neighbors”", "Author": "kingbobIII", "ReviewID": "UR121318239", "Content": "Pros: 10-minute walk to train station, Colosseum, and 15-20 minute walk to many wonderful Roman plazas; nice breakfast with terrific cappucino; friendly, accommodative staff; upscale decor; quiet street; private sink/mirror. Good base for all of Rome's sights. Cons: 2 of our 3 nights here, we were seriously disturbed by noise from neighbors at all hours. The rooms evidently have little sound insulation. And, because we had a shared bathroom, we could frequently hear others using the facilities in the middle of hte night. Also, because the bathroom was shared by at least 3 rooms, I suggest they clean it more multiple times a day. Other cons: A tight room, even for Italy, and a b'dei at the foot of the bed (strange and seemingly unsanitary); no elevator or assistance to carry luggage up 3 narrow flights.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great little hotel”", "Author": "ESBurr", "ReviewID": "UR120813881", "Content": "Hotel Saturnia was a really good place to stay in Rome. The staff was incredibly helpful, the rooms were clean and had everything I needed. Price was reasonable. I'd stay there again for sure.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Banff, Canada", "Title": "“long live the pizza”", "Author": "lilly t", "ReviewID": "UR120731274", "Content": "really good hotel. very nice to see Rome in pleasant walks. services offered are functional, good wifi, good cleaning staff. Mr. Virgilio advised that good for us a good pizza, white hen, where we enjoyed pizza Buna. we will return.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "middle", "Title": "“a good holiday”", "Author": "loreen s", "ReviewID": "UR120731088", "Content": "because it was a good holiday hotel Saturnia is very good location for walking to visit Rome. Saturnia is a comfortable hotel has good clean and good breakfast. staff very polite and kind. Mr. Virgil thanks for great restaurants and tips", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Good location on a budget”", "Author": "janet r", "ReviewID": "UR120637955", "Content": "Hotel Saturnia was walking distance to all main attractions and close to great restaurants. The staff was very helpful. Breakfast was good and the latte/cappuccino/hot chocolate machine is available free of charge all day. There is no elevator, so getting large bags to the third floor is challenging. The double room with a shared bathroom was small but cozy. The shared bathroom was a little run down. Overall, had a pleasant stay due to the location and staff. Would stay here again on a budget.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sparta, Greece", "Title": "“PERFECT FOR SOLO TRAVELER ON A BUDGET!!!!”", "Author": "SpartiGreeceMichael", "ReviewID": "UR120450575", "Content": "I visited Rome on November 7-10 as a solo traveler and wanted a cheap descent hotel for a couple of hours rest and a good night sleep.Based on trip advisor reviews, I chose Saturnia and through its official website chose a single basic room with shared bathroom for only 29.58 euros per night! (add 2 euros per night Rome City Tax) which was a real bargain!The hotel is close to Roma Termini rail station on foot (about 10 minutes) just follow Via Cavour and after you see the Santa Maria Maggiore church on your left, turn the first right on the small via Ruinaglia. The reception men are very polite and willing to help on every need. Ricardo that I talked mostly, replaced immediately the tv set that was not working properly, gave me guidelines and suggested a closeby restaurant with very good prices(pasta 6 euros). My room (room 210 second floor) was small but adequate for one person, clean, one window, overlooking the small Via Ruinaglia and a bit of Via Cavour with double glass, so you could hear no noise at night and sleep deeply!It has a wash basin and the toilet-bathroom is at the end of the corridor and it is clean and perfect for a shower.They provide towels and soap-shampoo.Breakfast served 7-10 am is continental and has a choise of fresh croissants (go at 7.00 to catch the best) and a coffe machine with a choise of 6 hot drinks.The location is perfect for exploring the sights of central Rome on foot.There is a small super market at the end of Via Urbana (3minutes on foot) so you can buy basics in good price (e.g. bottle of new season wine \"novello\" for 1.79 euros) Overall hotel Saturnia met my expectations and contibruted to my pleasant three days trip to Rome!", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“We found a good service”", "Author": "jonathan w", "ReviewID": "UR120412506", "Content": "our stay in this hotel was very nice. we arrived very late, but the keeper, Mr. Virgil has been very kind to us, and offered to carry our luggage and show our camera.abbiamo found everything very clean, the bathroom that we shared with others. the breakfast was good, Italian, but abbondante.la morning of our departure Mr. Virgil has prepared a great breakfast even though the schedule was too early. really thanks", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredericton, Canada", "Title": "“Absolute gem in the centre of Rome!!!”", "Author": "Lita L", "ReviewID": "UR120126826", "Content": "Rome overall was an incredible experience for me, much due specifically to Hotel Saturnia! The staff was incredibly lovely and attentive as well as patient, and helped me find my way around, give me insight on what to do and see, and actually made me feel so at home at the end of each day. I literally walked everywhere from the hotel, they are that centrally located! My room was a single basic and although I had to share a bathroom, I was given this choice in advance and everything was so clean! The staff not only looks after this place as though they own it but they really enjoy people and love their city. Breakfast was big, with lots of selection, and I enjoyed many espressos during my stay there. Many many thanks to to Alejandro and Virgilio specifically, but an overall kudos to all the staff. I cannot wait to go back to Rome and I will definitely book Hotel Saturnia in advance. Highly, highly recommend.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great stay in a very convenient location in Rome”", "Author": "hummingbirdy", "ReviewID": "UR120050207", "Content": "We had such a great time in Rome, and part of it was this cozy hotel. It is very conveniently located close to the train station, you can save money and walk from it (you will be able to catch train to/from the airport as well). Alessandro was so attentive and gave great recommendations to the restaurants and places to see. I initially had some technical problems booking the hotel online and we kept writing emails to each other but the management was very courteous and held the room for us for a few days even without having my credit card information (until I was able to submit it properly). Our room was very clean, nice and big, we even got lucky to have a good view. Breakfast was basic but good to have before a busy day of sightseeing. This place is perfect for budget or value travelers so I would definitely stay here again!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Martinez, California", "Title": "“Great B&B, great staff, geat breakfast, great location”", "Author": "david f", "ReviewID": "UR119758134", "Content": "The room was comfortable, the whole staff was warm and friendly. The owners Tiziano and Riccardo helped me at every turn. I had a nice air-conditioned room which is really needed in August. The breakfast was outstanding and made available even when I was late. Coffee is always available for free. The hotel is within walking distance of most attractions. Pleasant owners and staff make a hotel experience really worth-while. I for sure will stay there again. Rome is the place to study art. David Fugere, davidfugereart.blogspot.com", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Redcar, United Kingdom", "Title": "“excellent”", "Author": "smon g", "ReviewID": "UR119682526", "Content": "we stayed here for one night only because our intended hotel had a plumbing problem,and they asked if we'd mind staying here for one night. what really makes this hotel special is the hospitality of the staff, especially trizano, who was extremely helpful & friendly. (He turned down my offer of a tip, saying it was his pleasure to be of help). The hotel rooms are clean and have all you need if you, like me just used it as a base to stay. It's just a short walk to the coloseum, 20>25 mins walk to the treivi fountain, 30mins to the Spanish steps & maybe about 45mins walk to the Vatican. there is a metro station close to the hotel. I would definately reccomend staying here.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fantastic Location!”", "Author": "Carolyn B", "ReviewID": "UR119603127", "Content": "We even discovered a Basilica right around the corner! Saint Pudenziana's Basilica which has a lot of interesting history. We purchased the booklet for 3 euro. This hotel and staff were completely wonderful! We had a great first floor room, not 0, and our own bathroom. PS - at each hotel in Italy I asked for the best room since we were celebrating our anniversary. The breakfast was fantastic! The gal who made us our coffee each day was so nice and she actually cleans the rooms too! We stayed for 3 nights and walked everywhere.....found a fun Irish pub - Druid's Rock and ate a few blocks away one night at a wonderful restaurant which was recommended to us from friends here - Ristorante Fulvimari (closed Sundays).", "Date": "October 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“The only good part was the breakfast”", "Author": "abeille323", "ReviewID": "UR119433337", "Content": "We had one bad experience after another at Hotel Saturnia. First, we arrived at the hotel only to have them tell us they had to send us to another hotel for a night because of some problems with the room. They assured us that the other hotel was of comparable quality, but it turned out to be even worse than Saturnia (see Hotel Tre Stelle reviews)! When we returned to Saturnia, we were given the smallest hotel room we had even seen, even by European standards. There was barely room to walk around the bed to the bathroom, let alone having space for our suitcases. The bathroom was similarly tiny, with a toilet, bidet, shower and sink all crammed into a room that could not have been more than 4 feet by 4 feet. We couldn't turn around without smacking into something. The bathroom also smelled awful, as though there was mold and mildew growing out of control. The shower was tiny & the shower curtain was broken and didn't cover the whole area so water went everywhere. There was no bath mat so we had to use one of our hand towels to mop up the mess. To make things worse, the toilet seat broke the first night we were there (and we are not large people - 140 lbs each). They told us they would fix it but didn't until the last day of our stay. It was also extremely noisy at night if anyone was talking outside the hotel. We could hear a man across the street from inside his apartment. It was ridiculous. This hotel is a terrible value for money in my opinion. We paid 129 euros a night and I have stayed in cheaper places in Rome in the past and had much better experiences. The only real positives this place has going for it (other than proximity to Termini Station) are the food options. The breakfast at the hotel was reasonably tasty and included enough food to fill us up until lunch (hardboiled eggs, ham, cheese, buns, pastries, cereal & yogurt). There is also a great gelato place around the corner called Gelateria Santa Maria Maggiore. If you choose to stay at Saturnia against my advice, you will likely need to drown your sorrows in a cup or two of gelato and Gelateria Santa Maria Maggiore is the place to go.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Close to Roma Termini and Colusseum”", "Author": "HungryJack32", "ReviewID": "UR119006216", "Content": "Had a good stay at the hotel. Make sure you know how to get to the hotel....we walked from the termini station (which is super close), but we arrived very late at night and the street names are not easy to read (this was true all around Rome, street names are etched into building sides) and we would have walked past the short little street it's on had I not seen pics of the outside of the hotel on this site. Hotel staff is super nice, very accommodating and knowledgable. Wifi worked great in the room and was included. Breakfast was also included and was not the best (not a ton of selection and pastries weren't wonderful) but over the few days were there I figured out what I liked and it was enough to get me going till a late lunch (plus they will make you little cappuccinos). Hotel seemed typical for Rome for the price...in an old building, no A/C in our room (although the fan we had helped when the window was open), close to noisy street (but once we closed the window the noise reduced significantly). Our room in particular was a little bizarre. We had a shared bathroom, which ended up meaning just a toilet down the hall because our room had a shower in the corner. Was not private so might be awkward for 2 friends, but was fine for me and my husband. There are minimal room amenities (no hair dryer, no safe, no coffee maker). However, it was very clean and safe, and someone came to clean everyday. I would stay here again for the value and we were about a 20-25min walk from everything except the Vatican, which took us a 40min. to get to walking speedily (found out metro was on strike so we had to book it to the Vatican for our tour). So if you plan to spend minimal time in the room and want to be able to walk everywhere (metro/buses are very close too) it's a good deal. But if you are more comfortable in a hotel with more amenities and more modern, don't kid yourself, pay more to stay somewhere else (but it'll be expensive I bet).", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Amazing find in the centre of Rome”", "Author": "sciscio", "ReviewID": "UR118948000", "Content": "I was here for 4 nights at the beginning of the summer with my girlfriend. The first night we were given a very small room (one of those some other posters complain about), but as soon as we asked for a bigger room they immediately accommodated us. Make sure you get a room not facing Viale Cavour, as they are very quite. The managers are very nice; we felt well taken care every moment we were there. The rooms are not perfect, but they are clean, and the price and location are great for what you get. I would go back there in a heart beat! The buffet breakfast is wonderful, especially considering how stingy places in Rome can be. All considered, I found this place to be an excellent choice.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great staff and great service”", "Author": "RomaPHILE33", "ReviewID": "UR118922210", "Content": "We stayed at the Hotel Saturnia in August and September. August is very hot and it is true that you can't sleep without the windows closed and the airconditioning on, but that's the result of its location being so central. It is right near the Via Cavour equidistant from Termini and Cavour stations. The rooms we stayed in were small but the hotel is an older style hotel and installing the bathrooms reduced the original size of the rooms. There is basically enough room to walk around the bed and the bathroom is very small however the beds were comfortable and clean, the rooms were well maintained and the bathrooms were reliable and clean. It's a base for exploring Rome. What makes this hotel is the quality of the staff. Tiziano is friendly, helpful, efficient and impossibly handsome! Michaela who runs the hotel from the breakfast room, views everything that goes on with a smile playing about her lips. Vergilio, who mostly was on nightshift when we were there, painted the paintings (in a sort of school of Caravaggio style) in the hotel. These people will bend over backwards to make your stay in Rome memorable. They aren't just doing a job, they behave as if you are someone they know and they really care about making your stay enjoyable. The staff all work together as a team and really seem to get on well together. Breakfast is good and the coffee is really enjoyable. The facilities are basic but good but the staff are fantastic.", "Date": "October 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "1", "Location": "4"}, "AuthorLocation": "Fredericton, Canada", "Title": "“Worst hotel I never stayed in - I can't believe the positive reviews”", "Author": "troy k", "ReviewID": "UR118760432", "Content": "Please read this review before booking! I've stayed in some pretty seedy Super 8 hotels in the US and similar low cost hotels in Canada, and I've been to England, Ireland, the Netherlands and Cuba before - and have never left a hotel and taken a loss (388 Euro) before. My wife's last trip to Italy she stayed in hostels. I made the mistake of prepaying to save a little money which meant I was stuck. This was supposed to be the 3rd hotel in our Italy trip (stayed in 5 other hotels total, all good) but this one was so bad that my wife (we were on our honeymoon) literally sat on the bed and cried. We were supposed to have a double bed, air conditioning and a private bath, but when we got there the clerk (who was actually very nice, no complaint there) said that for the 1st night at least they'd have to give us a room for four as it was the only room they had left (really it was the only room with air conditioning and a private bath left). I asked if we had to move our stuff the next day and he said if we wanted to we could stay in the room for all 3 nights - at first, I thought wow we lucked out and got a bigger room. Well, the room wasn't actually in the hotel, he lead us out into the alley (the picture doesn't show it, but the hotel entrance is really in an alley) and opened a metal gate and walked down the stairs into the basement where he opened the door to our room - a decent size room with a bath and air conditioning, but NO windows, no other exit (so it was a fire hazard and wouldn't even be legal in NA, not sure about Italy but I assume it is), and the stench was absolutely unbelievable. It smelled as if they poured a few litres of cheap perfume in the room to cover up the smell of the mold. Although my wife has asthma I've never in two years seen it act up, but it did when we went into this room. So we asked if there were any other rooms and he said he had one that had no air conditioning and no toilet but we could have that. We decided to change rooms but the heat and noise from the other room was just too much. We told the bell clerk we couldn't stay and would have to leave and find something else. He urged us to come back the next day since the room was already paid for and he'd have another room available but really once we found another hotel and got settled it would have been a pain to have to only get the other hotel for one night in hopes that they had anything better (which I'm highly doubtful of) - and if they didn't we'd have to go find another hotel again. What a mess. Besides what I've mentioned above, I don't think the rooms in the hotel have been updated in 30 years or more. The lobby looked fine as did the breakfast area, but the two rooms we saw were awful. Here's the kicker - about 2 blocks away we found a Relais hotel, 4 stars, the Antico Palazzo Rospigliosi Hotel and the regular price of 130 Euros was the same as the discounted price at Saturnia. Do yourself a favor, stay elsewhere!", "Date": "September 29, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "West Bloomfield, Michigan", "Title": "“La Dolce Vita!”", "Author": "mary c", "ReviewID": "UR118131282", "Content": "Just got back from Rome and booked the hotel through www.entertainment.com/expedia. My companion and I got a room with twin beds. Plenty of room for the two of us and our large luggages. Perfect location to everywhere. We saw 80% of everything on the map in 4 days. The guys that work there are terrific. Tizianno and Francesco are so helpful! Very close to the Termini station. A short walk up the street. We didn't know that and a taxi driver charged us $25 euros. Getting to the airport, the guys booked a driver for only $40 euros. Tizianno also booked us a spot for the Borghese Museum. I would highly recommend it. The breakfast every morning was great too. The guys will make you a fresh espresso or capochino. Ciao!", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Auckland", "Title": "“Great basic hotel for sight seeing”", "Author": "Jockluva", "ReviewID": "UR118099676", "Content": "I wanted a reasonably priced hotel close to the Central Station for two nights. The Hotel Saturnia fit the bill perfectly. It was a ten minute walk just off Via Cavour. My room was spacious and included a shower, bidet and (cracked) sink. It was not air conditioned but a large electric fan was provided, though it was missing its protective cover. The toilet was down the hall way. The staff were all friendly, pleasant and spoke good English. The small breakfast room was intimate and the breakfast was good. There is no lift so be prepared to lug your suitcases. The room window faced Via Cavour which is very busy and noisy and had to be closed at night. The hotel is excellently located for sight seeing being walking distance to the Colosseum and Palatine and a plethora of sight seeing buses.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Awesome staff, quiet location, worth the money!”", "Author": "LauraV1215", "ReviewID": "UR118018776", "Content": "Upon researching hotels to stay at in Rome, I came across Hotel Saturnia. Location and price were ideal. After a few emails to confirm 2 rooms would be available next to each other for our stay, I proceeded with booking. Due to extraordinary circumstances, I was able to book the first double room, but when I went to book the 2nd room....not available! I was going nuts, worried about the deposit and what to do. I emailed and Ricardo - bless his heart - called me! He apologized for the inconvenience and was able to credit my card without any penalty. We then opted to have all 4 of us stay in the quad room. AMAZING! Large room in Italy for what I have been used to, large bathroom, gorgeous terrace, mini fridge in the room and cute little breakfast room. They were all so kind and accommodating. Even when my mom's suitcase broke they offered to pay for the cab to the hotel. This is a quaint hotel, located on a quiet street (note - not all of the cab drivers knew where it was located so be sure to have the name and address handy at all times as well as a map). Restaurants weren't that plentiful, but easily walkable to the Colosseum. I recommend this place and the quad room! Tell Ricardo hi :)", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Great hotel near the Colosseum (rooms are a bit small though)”", "Author": "BullzEyezz", "ReviewID": "UR117972670", "Content": "The hotel is great and the staff is extremely friendly. It's a 5min walk from the hotel to the Colosseum. 5min walk from the main metro station (Termini) and 2min walk from another metro station (Cavour). The hotel was perfect as I was on a backpacking trip, the rooms are a bit small so is the bathroom but it didn't bother me at all. Would definitely stay there again if I go to Rome again.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great central hotel”", "Author": "PiermaBoy", "ReviewID": "UR117902342", "Content": "We stayed there for copule of days and we found the location perfect.the room was great, spacius and clan with Air condition and free wifi.the people at the reception were professional and very helpful. The breakfast was good,fresh coffee eggs boiled chees ham etc. I'd still definetely reconmend it as it was the perfect base for our holiday.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Framingham, Massachusetts", "Title": "“Great hotel and excellent location”", "Author": "vista7777", "ReviewID": "UR117896396", "Content": "Great hotel within easy walking distance of the major sites and metro. The hotel staff was friendly and helpful. They suggested a great restaurant to us that served amazing pizza.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Terrible! Never Again!!”", "Author": "ferenzliszt", "ReviewID": "UR117508570", "Content": "After arrival we got a double room without toilet, a shower was placed inside the room one about 1,5 meter from the bed. As we didn't make reservation for a shared toilet, we went to the frontoffice clerk. When we complained about this, they said it would only be for one night. The clerk didn't understand why we did not want to accept it as it was only for one night. Our money was not refundable and they finally offered a very small room. It had no double bed, as we reserved, but only a twin. Tired from the journey we accepted it. We better should have not. The room was extreme noisy. At night we could hear everyone coming in. But it also had fungus in the bathroom, doornobs fell off, the safe was unusable, 2 lights did not work and it had a little fridge that didn't work properly. But the worst thing was the night clerk who had his friends over during the nights and had loud conversations below our window. We didn't sleep 4 out of the 7 nights. When we made reservation this hotel had about nr 90 in the tripadvisor scale, but to our opinion it should be about nr 900! To my opinion a hotel should be about 3 main things: 1) clean 2) gives you a good night sleep 3) location The location is okay, but the others....well...", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kuching, Malaysia", "Title": "“convenient!”", "Author": "Andytt", "ReviewID": "UR117475308", "Content": "Hotel is near to the city's train station, about 10 minute's walk. Friendly staff. I checked in to a single bed room, there was no city view from room window but hey, it's cheap and value for money and location is in middle of city, so not a problem for me. My room has a small TV and wardrobe, just basic facility. Nice and comfortable place to stay if you just want a place to sleep in your trip.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Saturnia gets top marks because of the amazing hospitality!!!”", "Author": "islanders_709", "ReviewID": "UR116916911", "Content": "We were initially booked into the sister hotel of Saturnia but upon arrival realized there had been an issue with our booking (to no fault of the hotel). As it was our first time visiting Rome we were crushed about the booking error. The Hotel receptionist (who works between both locations) really went over and above in helping to get us get booked into Saturnia last minute. The continued hospitality of the hotel staff was so refreshing. What a great experience! Because we were booked in last minute we did end up staying in 2 different rooms. Night 1 we were in a room with 3 single beds. It seemed spacious enough for 3. For the next 3 nights we stayed in a double room on the top floor. The floor is up a very small spiral staircase but it has a little outdoor terrace! What a treat!! The bathrooms are tiny but we had our own ensuite so were happy. We would stay here again!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Dobrá lokalita za nízkou cenu”", "Author": "Tereza D", "ReviewID": "UR116859443", "Content": "Hotel se nám líbil po všech stránkách a mile nás překvapil. Velmi dobrá lokalita, příjemní recepční, čisté pokoje. Každý den vyměňují ručníky a uklízí pokoj, což je velkou výhodou. Jediná nevýhoda je hluk z ulice, ale jak jsme mohli pozorovat, tak prakticky všechny hotely v centru města leží na velmi rušných ulicích a ani více * Vám nezajistí klid. Snídaně byly dostačující. Všechno předčilo naše očekávání.", "Date": "August 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Aircon needed!!”", "Author": "Phvin", "ReviewID": "UR116728228", "Content": "Booked 2 nights in August. Great price but the only advice I can offer is make sure you get a room with aircon even if it costs more. You can't sleep with the window open thanks to the noise outside from city life (Restuarant, sirens,notions etc) and the fan I had in my room was very noisy so it was a case of which poison was going to keep me awake. The single rooms are extremely small but I found this a motivation not to sit in my room as I was there to see the sites. Enough of the bad, the good; service was extremely good (worthy of a 5 star), very clean, centrally located, free wifi, tasty breakfast. Would I stay there again? Yes, but if in summer only if I could get a room with aircon. Rest is probably the most important aspect you need to rate a hotel on and unfortuantely me being a light sleeper (ear plugs req), I left Rome more tired than I got there. Although I suppose some of the blame rests with Ibiza....", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, Kentucky", "Title": "“Nice with amazing staff!!!”", "Author": "Pit P", "ReviewID": "UR116681215", "Content": "The hotel is very central, making access to any part of the city very easy - located just near Colosseum, everything is within walking distance. When I arrived at the hotel, I was greeted by a very friendly guy who gave me a map and showed me all the points of interest in the city which was very helpful. Throughout our stay, all the staff were very kind and helpful which made our stay all the more pleasant. The room was a great size and provided all we needed - we had a private bathroom which was newly built & very clean, a comfortable double bed, air conditioning and a TV with a few English channels. For the very reasonable price we paid, we couldn't have asked for more.", "Date": "August 13, 2011"}, {"Ratings": {"Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "airdrie", "Title": "“small but functional”", "Author": "lau-bert c", "ReviewID": "UR116551564", "Content": "This hotel is very small, but it doesn't miss to be functional. And' near the station of the trains and with a walk I can reach the most meaningful places in Rome. The breakfast has satisfied me as also the cleaning of my room. The personnel is cordial and I has been able to speak my language. A regard to the Signor Virgilio", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Amazing hotel”", "Author": "aboard89", "ReviewID": "UR116431235", "Content": "After spending a horrible couple of nights in a hotel in Blois before coming to Rome, I was a bit worried about coming to the hotel Saturnia. However there was no need for worrying because the Hotel Saturnia was perfect. We were greeted by Alesandro (one of the employees there) who couldn't have been friendlier or more helpful. The location was great, the breakfast buffet was very good and the staff are amazing. I fully recommend this hotel.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great 5 day stay!!”", "Author": "Elizblan", "ReviewID": "UR116321002", "Content": "We stayed at this hotel for 5 nights. The quality of service we had there was unbeatable. Very polite and helpful staff. The room we stayed in was a double, with the coldest air conditioner we have encountered in all of Europe, which blew our minds because in the two months we have been in Italy, we haven't been in an air conditioned room. The room was a bit small, but we only needed it for sleep. There was also a mini fridge in the room. The hotel is very centralized. Ten to fifteen minutes walking to all the sites, three minute walk to the Termini station, and the hotel very close to two different Metro stations. Overall, we loved this place!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Set your expectations low, and you'll be okay”", "Author": "Breukleen", "ReviewID": "UR116283877", "Content": "Okay, so the staff is friendly and attentive, and you get a decent breakfast and free wi-fi. The location is convenient, as you are a few blocks away from Termini bus terminal. However, the hotel decor and standard are probably from 1970's, and not in a good way. Our room, number 212, came with two floor-standing fans and old tv set. The sheets were clean, and the bed was okay. The room faced the main street, and you either had the option to close the windows and suffocate, or leave it open at night, and hear the loud street noise. I should have known that something wasn't right when I booked it, since it was advertised as a room with a shared bathroom, but I must say that the TripAdvisor ranking of this place as a #1 for business travel in Rome let my guard way down. There must be better options in Rome for the money, and those who were raving about this hotel make me wonder what other places they must have stayed at in the past.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Fine...”", "Author": "taytayalis", "ReviewID": "UR115551268", "Content": "This place satisfied our requirements - a bed to sleep on, a toilet to pee in, breakfast, and walking distance to Colosseum and train station. Beyond that, it was not terrible and not extraordinary. The staff was nice and breakfast was fine. But they had no elevator and our room was on the fourth floor. And our shared bathroom needed a renovation...about five years ago. Beware that Rome forces the hotel to charge an extra tax in cash for staying at a hotel (one euro per star per person per night). Just in case you are on a tight budget!", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“It just felt Italian...”", "Author": "setter1vb", "ReviewID": "UR115229819", "Content": "We stayed for four nights in June and the only two things I could say negative about the place were a faulty AC unit (which they replaced before we left - issue solved) and the small size of the room (however based on other experiences in Europe in the past, this was not a surprise). We were greeted with a smile each day, most of the staff was very amicable to speaking other than Italian as needed, free wi/fi, and a free breakfast in the morning. The front desk bent over backwards to make certain you had anything you needed that they could provide. Location was only a 10 minute walk to Termini and was easy to find even for someone who had never been to Rome. There are certainly higher end hotels, however for the price, Saturnia was the place to stay.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“LOVED IT and will be back!”", "Author": "mgg222", "ReviewID": "UR115049651", "Content": "The hotel was beautiful, on a quiet kindof street, clean, the free breakfast was amazing each morning, the hotel staff was so unbelievably nice and helpful. We loved our visit to Roma because of our hotel staff and our great experience with our hotel. We would highly recommend this hotel and would love to come back again and again and stay at Saturnia!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Good Location but EXTREMY warm room!”", "Author": "meliscl", "ReviewID": "UR115029213", "Content": "The hotel is middle class in centre of Rome. On arrival they gave us a room with a shared bathroom, and we booked a private bathroom, they also gave us the option of another hotel 7km away, which is a bit strange. No parking near hotel! The room was big but EXTREMELY hot with a fan on!", "Date": "July 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location and value”", "Author": "Kfarnham", "ReviewID": "UR114935175", "Content": "Awesome location right next to the train station and subway. The room was really big but was more than enough. The hotel staff spoke English and was great. Breakfast was really good and there was a ton of food. Some of the reviews of the hotel have not been as good and I have no idea why this place was a great value and totally clean and again in a great location.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“Wonderful Wonderful Wonderful!”", "Author": "actus0rea", "ReviewID": "UR114786397", "Content": "This hotel was simply amazing--I can't think of anything to criticize, really. My boyfriend and I stayed here for three nights as a side trip during our study abroad session in Firenze. The staff was extremely helpful and friendly, too. The second we checked in, they gave us a map and circled the main sites, which were within walking distance. The Trevi Fountain, Colliseum/forum, and the Scalinata di Spagna were all within easy walking distance. The Pantheon and Piazza Navona were a little farther out, but still walkable (20-30 minutes walking, I'd say, if you took your time.) The only thing not easily reachable was the Vatican, but the front desk gave us all the metro information and bus info we could need, again marking the map. The train station and Santa Maria Maggiore were about five minutes away as well. The rooms are very comfortable, and most of all spotless. I'm a big cleanliness person, so that was a big plus for me. The room was a bit small, but we were nowhere near cramped or uncomfortable. I thought it was cozy, haha! The bathroom was small too, but new and very very clean. The breakfast was good too. Via Ruinaglia is right off of via Cavour, a main road with lots of restaurants and shops. It's also close to a more local-feeling street with little boutique restaurants, and a cheap internet cafe. It was quite a convenient spot! We'd stay again, definitely!", "Date": "June 27, 2011"}, {"Ratings": {"Overall": "4.0", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good Hotel, Great Staff”", "Author": "AmandaSpez", "ReviewID": "UR114685205", "Content": "We had a wonderful stay here. The hotel has a great location, walking distance to lots of places, and the Metro. Our rooms were a good size for two people, and everything was extremely clean. Every staff member was so helpful, we felt extremely lucky. I would stay here again, no hesitations.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "UK", "Title": "“Definitely recommended and value for money”", "Author": "lynetteUk", "ReviewID": "UR114679812", "Content": "We booked this hotel following the reviews on trip advisor and have absolutely no complaints. We had a twin room - it was clean and well presented. The hotel is in a great location - just off the main road, with metro nearby and all of the attractions are within walking distance. We stayed for 5 days, breakfast was good quality - a typical continental breakfast, staff were helpful and friendly. As with all the hotels in Rome - the roads outside are noisy at all hours however the room has air conditioning so it was easy to keep the window closed and that completely blocked out the noise. If we were going back to Rome we would definitely stay here again.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Bethpage, New York", "Title": "“Horrible and dirty - never again!”", "Author": "montymamma", "ReviewID": "UR114659188", "Content": "When my husband and I arrived, we were told that we had two choices of rooms, either on the fourth floor (no elevator) or the one outside the hotel next door. The one next door, was underground with no windows,no minibar and dirty. We decided to see the one on the fourth floor. We had to walk up three flights and then take narrow spiral stairs for the fourth. When we finally got there, the room was extremely tiny and dark, so we decided on the outside one. Because this room was close to ground level, i the sounds of the street were amplified. Being a New Yorker this really did not bother me too much, what really kept me up was how dirty it was. I could not wait to leave, luckily we were only there for one night to take a flight home.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderful hotel”", "Author": "SeaofCyn", "ReviewID": "UR114607184", "Content": "So glad we chose this centrally located hotel. We slept-in and missed breakfast! Front desk staff were wonderful with thorough directions and his English helped us find our way! Room was spacious and just right for 2 of us. When I'm in Italy next time, and I hope that's soon, I'd stay here again :o)", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Convenient 10 minutes walk from central train station. OK for the money for Roma”", "Author": "aristo777", "ReviewID": "UR113777844", "Content": "My expectation for Roma hotels following 2 stays are not too high, so this one was OK considering my reduced expectation. Convenient if you arrive/depart Roma by train (about 10 minutes walking west-ward). Be aware that some rooms do not have in-room shower & toilet; others have tiny shower, but no toilet, and others have it all. No A/C and the fan in my room did not work, so I had to open the window and get some street noise. I think the better (and higher priced rooms) are facing the quiet side street and should not have a problem. Staff was friendly. So if the price is right and you get the desired restroom components, it should be OK as a base for your stay.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“a good weekend”", "Author": "marten0", "ReviewID": "UR112011476", "Content": "we spent in this hotel a really good weekend. The hotel is located in a strategic area to visit Rome by public transport or on foot. the service is really excellent, the staff is very friendly and the night porter a very helpful and very nice. We started very early, and Mr. Virgil has given us a very rich Italian breakfast although the service was still chiuso.quando come back, definitely book this hotel again.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boise, ID", "Title": "“Unhesitatingly Recommend”", "Author": "Sam_I_Am_Boise", "ReviewID": "UR110141155", "Content": "I did a lot of research before choosing this hotel with our travel package from Expedia. I paid $13 extra/night for a standard double (attached bath was very important for us). The final rate included breakfast. The hotel also had free wifi which is the most important amenity these days. Room: I read a lot of reviews of Rome hotel both here on trip advisor and Expedia that got me a bit worried about the size of the room. I knew European hotel rooms would be small but how small? One reviewer said that their Saturnia room was so small they couldn't even properly open their suitcase in the room. That got me into panic mode. I need not have worried so much. The room was adequately sized for two people with two carry on size bags. (Frankly, I have experienced far worse much close to home in San Fran but that's a different review for another day.) Even though there is no elevator, we got a second floor room which was not too difficult to manage with the bags - stair case was standard width. The most challenging thing about the room was the shower stall. Very tight but in the end, manageable. And I would recommend that you consider taking a travel hair dryer although the room does come with one but it is awkward to use and not efficient (see photo and you will understand what I mean). Another small issue was that the bed had two mattresses side by side instead of a queen size mattress, and that meant that I, who tends to drift into the middle of the bed, always ended up on the spine and it did cause minor discomfort. The room had its own AC and even a small fridge. At night the road outside can be noisy. Just street sounds. You can close the windows and turn on the AC and be oblivious to all that. We chose not to - because the fresh breeze felt nice but Rome appears to stay loudly awake all night so this may not work for most people. :) We got used to it. Staff/Service: The staff were very friendly and helpful. On the day we arrived we were allowed to check in at 11 am. And then we were offered a cup of coffee. Very much appreciated after a long overnight flight. All except one desk staff spoke English. And the one who didn't - he tried his best to understand us and be understood. Very amicable. They let me use their computer to get tickets to museums in Florence and print out receipts. (Although I recommend that you do not go this route - make all reservations ahead of time from the US). Bathroom was small but had everything including a bidet. Breakfast was great - saved us both time and money every morning. Not the big greasy American style breakfast though - but lots of choices and healthier. Made to order coffee, various kinds of croissants, jams, nutella, cheese spreads, hard boiled eggs, rolls and yummy cheese slices for a quick sandwich, three kinds of cereal and milk, juice, and yogurt. Location: Best thing about the hotel is its location! Termini is a 5-minute walk. You will discover that this is the best amenity of ALL. BTW< in getting to hotel once you arrive into Termini from the airport (Leonardo express for 14 euro one-way, 30 minutes), do not follow google maps direction to hotel. Instead just find the Piazza del Cinquecento exit and get onto Via Cavour. Walk straigh down Via Cavour and Via Ruiniglia is on right (hotel has a sign visible from Cavour. Area amenities: Lots of eateries in the area (favorite hole in the wall - Forno da Milvio on Via Dei Serpenti - cheap, fast, but yummy food). Also in the neighborhood, one of the most charming places in Monti area - the piazza madonna dei monti. At dusk locals of all ages gather here and just sit and chat. Very cool. You can walk from here to the Colosseum in 10 minutes. There are at least three groceries nearby for water, juice, fruits, etc. As well as a pharmacy within a block. Area seems quited safe. We were out till about midnight every night and we never felt ill at ease. What else does one need?", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Excellent!”", "Author": "kateejack11", "ReviewID": "UR109989921", "Content": "I definitely recommend this hotel. It is centrally located, clean and the staff all very friendly and helpful. It was basic however this was OK given my friends and I were out enjoying Rome!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Very well located little gem in Rome”", "Author": "tangomamma", "ReviewID": "UR109629040", "Content": "Stayed at the Saturnia from May 10th to May 15th with my mother. We were impressed by the kindness and efficiency of the staff and the location of the hotel - only 5 minutes to the Colosseum! Exiting the hotel, when you make a left, there is a nice long street full of restaurants, shops and an Internet Cafe - walking in the neighbohood at night was also very safe. The breakfast was served in the room adjoining the reception and the selection was good - of course, not your typical bacon-and-eggs breakfast, and I challenge anybody to find this type of breakfast in Europe, but a good selection of bread, pastries, cheese and meats. We are already plan ing on returning to Rome next year and we will book ourselves at the Saturnia again.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monterey, California", "Title": "“Just what we wanted in Rome!”", "Author": "Walk_n_Eat", "ReviewID": "UR108575586", "Content": "When we travel, we don't spend a lot of time in a hotel, so what we care about is a clean room and bathroom, a comfortable bed and friendly and helpful staff - and a nice breakfast is a bonus. The Hotel Saturnia was perfect for our stay in Rome. The location was terrific - not far from the train station and metro, and within walking distance of almost everything in the historic area. Beds were comfortable, everything was clean, the breakfast array was very nice, and the staff was THE BEST. Tiziano - and Kali - were wonderful, kind and helpful gentlemen! They went out of their way to take care of us, and we will always appreciate that. We would definitely stay there again.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prince Albert, Canada", "Title": "“Nothing fancy, but a good value for those who need it.”", "Author": "Paripatetico", "ReviewID": "UR107597019", "Content": "A five-minute walk from the Termini train station, 10 minutes from the Colosseum, and many other attractions. Very helpful staff fluent in English (during the day); small rooms with good basic amenities, but nothing fancy. Noisy at night; not for light sleepers.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Small rooms, no lift”", "Author": "Molendinari", "ReviewID": "UR104613067", "Content": "In general, we were happy with the quiet location just off the main street. The rooms were clean and neat, the beds were comfortable and the air conditioning worked. But the lack of a lift and narrow stairway made moving the bags quite difficult, and the rooms were so small there was no space to open a suitcase!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sussex, Wisconsin", "Title": "“Nice hotel”", "Author": "AmyV919", "ReviewID": "UR104495383", "Content": "My husband and I stayed at Hotel Saturnia for 3 nights during our 2 week stay in Rome. We really enjoyed this hotel. Our room was located off the main road which made made it a little noisy but we never found it to be too big of an issue at night. We booked a room with a detached bathroom, which was the first time we've done this and didn't find it weird at all. Our room had a sink and a bidet. The toilet and shower were just across the hall. There may have been another room sharing the bathroom with us but we never ran into them or found it to be an issue at all. The staff was very welcoming and warm. They pointed many things out on the map for us when we arrived. We were a lot closer to the Colosseum than we had thought. We pretty much walked everywhere we went. We did take the metro to the Vatican but walked back so we could see some other things along the way. This might be a little much for some people but we found it perfectly manageable.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brandon Manitoba Canada", "Title": "“Kind and helpful Ricardo”", "Author": "coldcanuck", "ReviewID": "UR103318045", "Content": "Without a doubt the hotel has a lot of things going for it. The staff really can really make a stay enjoyable even in mediocre conditions. I must thank Ricardo especially for his kindness and help throughout our stay. They honestly seem to be trying to do some upgrades to the place but I can tell you honestly that dragging luggage up three flights of stairs is not my idea of fun but the one really bad part of the stay was we had a room where the toilet seat kept falling off its hinges.The furnishings were what I would call Spartan but we did not come to Rome to sit in our room. This was quite uncomfortable for a family with two teenage girls. Ricardo was a great host and recommended restaurants and helped me book reservations at the Vatican museum online. This hotel is almost perfectly located on a quieter side street in the center of Rome. Breakfast was enough to get your day started and the free wifi really was very reliable and simple to access. If you want luxury this is not the place for you...The value of this place is the location and its staff.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "surrey", "Title": "“5 star service and a friendly welcome”", "Author": "now555", "ReviewID": "UR102787429", "Content": "Stayed here at the beginning of April 2011 and can certainly recommend it. Affordable clean rooms and only a short walk from the terminal station and collosseum. We were greeted on entry to the hotel with a very warm welcome as well as being given a map and a quick run through as to the location of the hotel and places we can reach on foot and of interest. I have stayed in hotels that have more stars but came no were near the personable friendly service and welcome we received. Rooms are simple and clean, continental breakfast was fresh and a great location to explore the wonderful city that is Rome.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "salinas", "Title": "“perfect”", "Author": "noah026", "ReviewID": "UR101639264", "Content": "a trip truly unique. we arrived at this hotel and we were really good. the staff is efficient and gentle cleaning and very pleasant. the doorman of the night showed us also how to get to the beach and it was very nice. Rome is great and is fun to visit, without much difficulty because the hotel is well connected by public transport, and many things you can also visit with a walk. will definitely return", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly staff, good value, excellent location”", "Author": "lindasnell1955", "ReviewID": "UR101035277", "Content": "Very friendly staff at reception and breakfast where the woman insisted on making fresh coffee rather than letting me use the machine. Room was quite small but fine for two nights city break and bathroom tiny but again adequate for purpose. Very good value for money and easy to find from the main Termini Station which is where bus from Ciampino airport drops passengers. Walking distance to most main attractions.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fullerton", "Title": "“the bad weather, beautiful roma”", "Author": "costas28", "ReviewID": "UR100420989", "Content": "Sin,the weather was not very good, we visited rome in the rain. People are much sun,roma wonder that we have done a lot and we were hikingsensation words. The colosseum and the ancient streets take you have the time to dream so close but so far we have come out very soon from the hotel to go to pompei. The night porter, gave us the alarm and made us a delicious cappuccino, was very kind, given that the time was not suitable for breakfast. In particulargave us good indications pompei for traveling to our hotel has a friendly staff, roomsa bit small but clean Mr. Kali very nice but kind a fiery sicilian", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Good value for money”", "Author": "drgirlfriend74", "ReviewID": "UR99650428", "Content": "The staff were lovely, friendly, helpful and polite. We were allowed to check in at 12.30 PM ( a rarity anywhere) and we were offered coffees while we waited. The coffee (regular, one espresso) were to die for! They perked up right up. The room was very clean and the lovely housekeeper showed up us. In my broken Italian I made out what she was showing us. The only minor issue is that the bathroom pipes smelled. As I had lived in China, this did not bother me at all. But we realized that if you left the fan running in the bathroom with the door closed, it faded away. The room was small. As was the bathroom. Very small. I am 5'7 and my husband is 6 feet and we found it cramped. But the room was very warm which was good as it was cold and rainy in Rome. We ran the air conditioner at night to remove the stuffiness of the room. Through no fault of the hotel, some guests decided to use the hallways as a meeting place in the middle of the night and were very loud. Fortunately for me, I heard nothing the second night we were there. The benefit to the noisy guests was, I could not hear any traffic noise or street noise. We were on the second floor, facing the back, beside a court yard and although there was noise during the day, it was quiet at night. We paid only £98 for two nights in Rome and for the most important reason why I am rating this hotel well: location. You can walk from the main terminus or jump on the subway and go one stop. You can walk to the Colloseum as well. Variety of restaurants around the hotel, and an amazing gelato / pancake cafe nearby. The area felt safe, the people around the area were all very smartly dressed and generally one got a sense that the properties around the area were expensive. There were some posh little delis close by as well and small bars. Breakfast was continental but delicious. I had some juice (not sure what kind but it was ruby in colour and sweet). The pastries were very good and the coffee, amazing. If you have a budget or don't fancy a hotel further out of the city, I recommend staying here. One or two nights is perfect for this type of hotel.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boise, Idaho", "Title": "“kindness and cordiality”", "Author": "steflovely", "ReviewID": "UR99348711", "Content": "we stayed in this hotel for three days,we really appreciated the friendliness of the staff. a small hotelsituated in a strategic area for travel, very comfortable. the night porter was a courtesy only, absolutely recommend it. excellent breakfast, clean rooms, nice hotel.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Excellent service, very friendly and helpful staff”", "Author": "xxBettyxx", "ReviewID": "UR98269836", "Content": "This is as stated a 2 star hotel, however we were really happy we chose this hotel for our stay. Location is excellent, close to main termini and most of the main attractions are within walking distance. Rooms were cleaned daily, fresh clean towels were provided daily. The staff did all they could to make our visit to Rome a succesful one and were happy to answer questions or queries about travelling to different destinations etc. We had an early flight and had to leave at 6am, the hotel arranged a taxi and breakfast was provided for us on asking in the morning. We slept well every evening. I would recommend this hotel for it's location, cleanliness and helpfulness of staff.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Nice Hotel with good location.”", "Author": "Clau_y_Mati", "ReviewID": "UR97338054", "Content": "The location was very good. It was cose to Termin central station so the bus, the subway and the train were nearby. Breakfast was good with variety of things to choose. If you want to have breakfast early, the girl wasn't there to make you an expresso. So, you have to make it yourself with the automatic machine. When we arrived, they offered us a room with shower. The shower was inside the room, without privacy. While you were laying on the bed, you could see your partner taking a shower... And the bidet also was inside the room, between the shower and the closet. That was a strange thing, but nothing to worry about. The street was very noisy, but if you let the window closed you could sleep like a baby.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Average rooms, but great location and friendly staff”", "Author": "Trodnog", "ReviewID": "UR95039223", "Content": "Me and my girlfriend were in Rome for 4 days in january. We chose this hotel out of the more budget friendly options that were available through a package deal. It's located not far from Termini (the central station), and only a few steps away from Santa Maria Maggiore. More or less walking distance to everything in central Rome. The staff was very friendly and helpful. Our room was nice and clean, albeit it didn't have it's own toilet (only shower and sink), and the double bed was actually two single beds put together. These were only minor concerns however. Breakfast was simple but nice. The breakfast room was tiny, but since we stayed during low season it didn't get awfully cramped. The main attraction of this hotel is it's great location, and the friendly staff makes it very easy to overlook it's flaws. Recomendable for a weekend stay.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glendale, Arizona", "Title": "“Great stay with excellent service and staff”", "Author": "Sandy6320", "ReviewID": "UR94515164", "Content": "My husband, 20-year old daughter and I stayed at the hotel for 2 weeks. Extremely kind and professional staff. Breakfast was great with buffet style offerings of cold meat/cheese tray, hard rolls, pastries, coffee/hot chocolate, 3 kinds of cereal, and hard-boiled eggs. You could have as much as you wanted. Recommended several local good restaurants. Rooms and bathrooms are small but adequate, very clean. Would definitely recommend for budget travelers.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Simply and comfortable!”", "Author": "jimtmimt", "ReviewID": "UR92711080", "Content": "I found this hotel on internet and i choose it for location and price. Staff ver helpful at arrival and for all the stay. Free internet connection well working too. very good breakfast every morning. Romm cleaning every day. And location is perfect. I recommend this hotel always.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Penmaenmawr, United Kingdom", "Title": "“A hidden gem. Lovely little hotel, clean and welcoming in a great location.”", "Author": "AndiePe", "ReviewID": "UR92266950", "Content": "When the cab driver dropped us off he said we'd chosen a great hotel and he wasn't wrong. 5 minutes walk to the train station and only ten minutes from the Colosseum Nice bars and restaurants just a stones throw away. The staff were all really warm and friendly and gave us a map on arrival and lots of good advice. Breakfast was all you could eat - cereals, breads, pastries, cheese, meats etc and great coffee obviously. The hotel was spotless and really nicely decorated. Our room was small but had everything we needed, again, it was clean, warm and nicely decorated. Don't expect a view because of where the hotel is situated - on a side street surrounded by buildings but we only went back to the hotel to sleep. I would definitely recommend the Saturnia and can't wait to return. You won't need a wake up call, the bells of Santa Maria Maggiore will do that at 7am which just added to my wonderful Rome experience.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zadar, Croatia", "Title": "“Best it can get”", "Author": "antonella1985", "ReviewID": "UR90719345", "Content": "Excellent service at this hotel, delicious breakfast, big choice of food, very helpful staff. I expected much worse room, but it turned out really fine. You can judge by my photo! Hotel is in a great location maybe 5 minutes walking from Colosseo and Vittorio Emanuelle. I highly reccomend it.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“I didn't expect much from a 2* hotel and I was still disappointed”", "Author": "hayden43", "ReviewID": "UR89807841", "Content": "I didnt expect much from a 2* hotel, just a clean comfortable room and friendly service, but I was disappointed. Negatives -Room was in the middle of being renovated. There was plaster on the walls and part of the door frame was missing (however the room was clean) -For 2 days, they continued renovations in the hallway outside our room during the day (banging on walls etc). At one point, a guy knocked on our door and came into our room to inspect what needed to be renovated. -Bed was extremely uncomfortable and I could feel all the springs. They also made the bed with a top sheet and something resembling a table cloth. A blanket was in the cupboard which we used, but it looked unclean. -Room had a shower and bidet, but no toilet. The room didnt have a bathroom - the shower was literally at the end of the bed and all a part of the same room - weird. -The hotel staff had limited english and didnt have much knowledge of the local area. -It was advertised that there was free wifi, however we were told only 1 hour per day was free and after that is was about 5 Euro for a few hours. Also, the wifi on our floor didnt work and we had to go into the lobby to use it. At one point the cleaner was mopping the floor in the lobby and she made me get up from my table and wait while she mopped underneath. -There was free breakfast which included stale bread and croissants. Later in the day I saw the croissants on a plate uncovered which explained why they were stale. Positives -They let us have a late check out (at 6pm) -Towels were big I would NOT recommend this hotel. The location was ok, but in hindsight I would stay closer to the river in future.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Very helpful & nice staff, centrally located, aromatic coffee and tasty breakfast”", "Author": "SexysuzyWong", "ReviewID": "UR89380755", "Content": "I stayed in this hotel for 4 nights. The location is very good: minutes walk from the train station, walking distance to major attractions and subway. The front desk staff and maids were all very professional and helpful. They allowed me to use their front desk computer to book the Coliseum and had the booking printed out. I had a very good impression of Rome mainly because of this hotel, as it was my 1st destination of my one month long honeymoon. Very good coffee and good breakfast buffet. (I was later really disappointed in this trip when I was in Venice, regretted spending 3 nights there and spending almost 10 thousand dollars for this whole Europe honeymoon trip to find out that I was the last one to know that Italian men are well known for being disrespectful to women.So, my comments was Venice was nice, but the men......) Beware when you go to a restaurant, try to stay away from restaurants with staff waving for your business, stay away from English menu, and know to check itemized bill on your receipt and count your change when you purchase anything. I had plenty of experience shop keepers gave me a wrong receipt with items I did not purchase and bill me more, intentionally gave me less change back. Some shops they intentionally \"forgot\" to put items I purchased when I bought a lot of things. Some restaurants asked for a 25% tip. Only disadvantage of this hotel: No elevator, no fridge inside the room, bathroom was small. I requested a quiet room so I was assigned a room at the top floor which was the only room at that floor. At night there were smokes came in. Since I was at the top floor it was relatively quiet. The good staff and good coffee are the best of this hotel.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful hotel with amazing service and location...great value!”", "Author": "Traveler9879", "ReviewID": "UR89084394", "Content": "Hotel Saturnia was a wonderful place to stay in Rome for an ideal price. The rooms were simple and clean, everything you needed and clean sheets and towels each day. The front desk was extremely welcoming and accommodating with directions and helpful advice. Location was an easy 10 minute walk from Termini Station and within walking distance of major destinations (Coliseum, Trevi Fountain, Pantheon.) We felt safe in the location and the security was good. Breakfast was perfect and included cereal, breads, meat, hard-boiled eggs and of course cappuccino. No complaints at all and would recommend to anyone visiting Rome!", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Valencia", "Title": "“Basic hotel, great service BUT....”", "Author": "lupilove04", "ReviewID": "UR86221243", "Content": "We stayed 4 nights in September in this hotel. One of my first surprises was reservations via internet. Although their booking engine states that they will NOT actually charge your credit card and will only do so when you arrive, this was completely false. They charged me one night's stay in July (as soon as I made the online reservations, although we arrived in late September). I wrote them right away, worried about my credit card limit since I was out of the country at the time and did not want to have unexpected charges...they assured that the charge was \"reversible\" but that was false also, and to prove it, I took my bank statement with me, showing the one night they charged plus the foreign currency fee. Once we got over that initial bad impression, we were greeted late at night upon arrival, only to learn there were no elevators and we were in a unit in the fourth floor. Stairs are wide enough up to the third floor...but later, from the 3rd to the 4th floor, the stairs are challenging for anyone...spiral, narrow metal stairs. The rooms are very basic...barely any decoration and just o.k. Beds are simple and mattresses were a bit hard. Our A/C did not work and although a gentleman from the front desk came to check on it, it never did work. We were changed to the \"family room\" the next day, which was nice because it is on the ground level and more ample, but even more \"basic\".,nevertheless the bathroom was nice and clean and beds had mattresses just as stiff as the firs unit. A/C did not work here either. In summary, here goes my personal pros/cons list: PROS: - Excellent location, very close to public transportation and a walking distance to some attractions - VERY basic rooms which are clean - Santa Maria Maggiore church is half a block away, with a tourist center across the street and it is also a stop for all double decker tour buses, which are an excellent value in Rome - Free wi-fi - Great dining options nearby - Wonderful breakfast, with hot and cold selections although room is tiny - Staff is very friendly CONS: - They will probably charge you for one night when booking online, regardless of their reservation/cancellation policy!! - Avoid 4th floor if you have mobility issues - Avoid rooms facing the main street...there are a few restaurants with live music that can be noisy - Make sure your A/C is working and cooling as soon as you check in your room, if you travel in a warm season - Mattresses are uncomfortable Although in the end I was glad to have stayed in Hotel Saturnia, I will stay elsewhere in Rome next time I visit. I would only recommend it for those that want a BASIC room close to the main attractions.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Small, friendly and perfect location.”", "Author": "BarryZ27", "ReviewID": "UR86076062", "Content": "Stayed here for 2 nights in late October. Booked pretty much blind, apart from browsing the reviews here on Tripadvisor. A very reasonable price, and a very handy location, about 5 minutes walk from the central Termini train/bus/metro station. Another 5/10 minutes walk to the Colesseum, and within 30 minutes to Trevi Fountain, Pantheon, Spanish Steps, etc... Very friendly and helpful staff, a most acceptable breakfast provided ( no cooked food, but cereals, croissants, fruit, yoghurts, tea/coffee). The room was small (but certainly not so much so to be a problem), clean, and perfectly suitable - As said elsewhere, you don't really go to Rome to spend the day in a hotel room anyway, no matter how wonderful that may be... In conclusion, I hope to return to Rome someday, and I know for sure I won't be looking any further than here to stay.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "geelong", "Title": "“a carefree journey”", "Author": "australiageelong", "ReviewID": "UR85978872", "Content": "We stayed in this hotel for two days and although our room was a bit small, were very hospitable. The bed was very comfortable and clean, the bathroom always with hot water, and there was always a good smell. The breakfast well stocked with various foods, and gustosi.Il friendly staff, and Mr. Virgilio was very kind to give us good information on where to eat and how to take public transportation. The room was not very expensive but excellent service.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Friendly staff, clean rooms, and great location”", "Author": "beccagrumpus", "ReviewID": "UR84828094", "Content": "Overall, we enjoyed our stay at the Saturnia. The room and bathroom were very small, but clean, and the staff were very helpful with travel tips. I do wonder if we paid too much, but at the same time, it was a last minute stay and we do not regret staying at the Saturnia. We especially liked the location, close to the Termini station and the Colloseum.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“basic rooms but really good location”", "Author": "robdavid1", "ReviewID": "UR83443036", "Content": "We stayed at the Saturnia for 4 nights while visting Rome. Rome will keep you so busy that you wont even realize you have returned to your small basic room . Its a budget hotel in a very good location (a really short walk to the colleseum and the train station )and doesnt try to be anything else. For us, Rome wasnt about the hotel and more about the sites. The bathrooms are tight but everything worked and was clean. The bed was a little uncomfortable but acceptable. The staff were very friendly and helpful - calling to make reservations or giving direction. side note 1 : the borghese museum requires a reservation a few days in advance but you can get cancelations at the door - we fell into that category - but well worth it. side note 2 : eat in trastervere - across the bridge- its way easier to find a table and cheaper. side note 3: there is a guided tour outside the colleseum for 8 euros that includes the pallatine and the forum. Im not a big tour group guy but it was worth it as the pallatines not clearly signed (in fact there are none) and jason our pallatine guide was excellent. So stay at the Saturnia if you dont mind basic and cheap. I thought the breakfast was good. I didnt look to see if the food was left out over night - but i dont look at kitchens in restaurants either - its easier that way. oh and ask for a coffee to be made at the bar its better than the machine. Rome can be expensive so why pay for a hotel that youre hardly be in. oh and the Roma pass turned out to be a good deal - using the subway many times .. have fun. Rob", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Lovely stay”", "Author": "Huitui67", "ReviewID": "UR83082484", "Content": "This hotel is great. People very helpful and clean room. Breakfast in the morning was nice. Location is the best. I highly recommend this hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent service!”", "Author": "pillorobu85", "ReviewID": "UR83045825", "Content": "The service was the best i've found in Europe. We travel all Europe in five and four stars hotel but we've never found this service. People smiling every day. Receptionists helps you for everything....restaurant, monuments, advise and all you need. This is important for me. The rest was also nice, two more stars than they have. Thanks to Virgilio and Ticiano.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Corner Kick”", "Author": "Guy_Rotem", "ReviewID": "UR82569942", "Content": "Walking from Termini station to Saturnia I could understand why people wrote that \"it's not the best neighborhood in Rome, but still it's impossible to expect the entire place to look like one big tourist attraction. Snug comfortably in a tiny no-car street makes Saturnia a quiet hotel and a decent option for those who don't require much from their mattress but do need a quiet sleeping environment. I don't recall the amount of rooms in this small hotel, but my only suggestion would be to make sure you do NOT get a corner room. All of the rooms are small , that's acceptable, but the corner room we got was so small that once both our medium suitcases were on the floor we barely had a square meter to stand on. A double bed, a small closet, decent AC and a tiny but clean bath made this room a place to keep our luggage and go to sleep. Staying awake in it is not for the claustrophobic visitors. Wide-shouldered people will find the shower a bit problematic, but having as much hot water as I wanted was a good thing to have. Once that's over and done with I can say that outside the (corner) room the place was nothing but great. The people were nice, the breakfast was satisfactory and all our questions and requests were answered fast and with a smile. The staff in Saturnia are well aware of their weaknesses and work hard to even the odds with a good and thorough service. If your hotel room is meant for a luggage keeping and sleeping at night - Saturnia is a good selection and great value for money. If you require more from your room, make sure you don't get a corner room or book someplace else.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Ok hotel”", "Author": "prozerran", "ReviewID": "UR81894871", "Content": "2nights in September 2010 Pros Good Location close to Rome Terminal Railway station 10-15min walk. Close to the Colosseum 15min walk. 15-20min walk to Trevi Fountain and Pantheon. All sites are in reasonable proximity. Bus system a little hard to decipher – so walked most of the journey. Metro at Rome Terminal can get you to the Vatican City easily. Friendly staff all with good english Cold simple breakfast – average enough to get you started for the day. Fridge in room Cons Room very small – may be the Rome standard? No lift Booking indicated free wifi in public areas. When I arrived internet the rate was 5Euro/3hours – however they did offer me 1hour free pass (it was accessible in room). Airconditioning unreliable – keeps switching off every so often. Overall a simple no frills place which does the job in a good location. However, for the price around 150AUD per night (although i have heard Rome is very expensive accommodation wise) I kind of expected a little more. Nothing majorly wrong with the hotel, just very small rooms and the fact that they changed their policy on internet usage without informing the client.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“A plate to love”", "Author": "kikko4", "ReviewID": "UR81603764", "Content": "This place is amazing. I loved it. All people quiet and smiling all days from the front desk to the ladies of room cleaning. Thanks to Riccardo, Kali and Virgilio and thanks to Michela and Palmira. Rooms are ok clean every day. Breakfast excellent and fresh every morning. I will came back to Rome to stay in Hotel Saturnia. Thank you", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bilbao, Spain", "Title": "“Discrete hotel, excellent service”", "Author": "Jator-C", "ReviewID": "UR81252292", "Content": "After staying in the hotel one full week, the service can be considered excellent, taking into account that the majority of time I was visiting the city. Some thing needs improvement, but respecting to the personnel responsible, excellent in attendance, in helping and in chatting. The breakfast is correct, taking into account that we are talking about a 2-star hotel. Bed comfort and DBT are part of the room. Special attention from Riccardo was appreciated.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Room clean and spacious”", "Author": "tyrygi48", "ReviewID": "UR81052697", "Content": "I booked this hotel in internet and after reading all rewiews i decided to book a two star hotel for my first time. So was excellent. Some times little hotel are really better than a big one. Room was cleaned every day, breakfast rich and fresh all mornings and staff really friendly and helpful. I will recommend this hotel to all.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Cheap hotel in every sense”", "Author": "elliot72", "ReviewID": "UR80865213", "Content": "I stayed with my wife for 4 nights in Sept 2010. When we looked at hotels in Rome we came to the conclusion that we should expect the worst and we were still disappointed. The room had the minimum of the cheapest furniture. We paid for private facilities and got a shower, sink and bidet! - no toilet. There was no bathroom in the room they were just fitted in the corner of the room. The toilet was private between everyone on the second floor! Some people did not have a shower in the room so were using the bathroom with the only toilet making it even worse. We had a block of wood with a light bulb sticking out of the top for a bed side light. The noise of the fan kept us awake at night but was slightly better than the noise from the open window. The dining room was half the size of my dining room at home and had just 4 tables which were crammed in so you had to queue. The only good point was that it was clean, not too far from the sights and the staff were helpful. This hotel is stuck in the 1950s and is desperate for an upgrade.Try and find somewhere better or perhaps if not dont go to Rome.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great little place”", "Author": "little_wing123", "ReviewID": "UR80823471", "Content": "This is a great place to stay if you want to be slap bang in the middle of town. A short walk from Termini, the Colosseum and the Palatine, as well as a few Metro stops, it's a great location. It's down a tiny side street that's not on many maps, so make sure you Google Map it before you leave, or get a taxi. We couldn't find it when we arrived, but once we got there by taxi and knew where it was, we had no trouble. There's no lift, so be prepared to carry your bags up a few flights of steps. The double room we stayed in was very small, but neat, clean and all we wanted for our stay. Not really a place for romance, but perfect for sightseeing. The staff were lovely (the concierge looked exactly like Antonio Banderas!), the continental breakfast was very nice and there are plenty of snack bars, cafes and restaurants in the surrounding area, if you get peckish. In short, a lovely little hotel for a short stay in bella Roma :)", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Canada", "Title": "“You can find better in Rome”", "Author": "Juli Z", "ReviewID": "UR80780053", "Content": "Stayed here for 3 nights. Had a double room on second floor facing a very noisy street. No A/C, a must in Rome in summer. The room was supposed to be en suite, but had only a shower and sink. The shower was in the middle of the room. Very awkward. The toilet was down the hall... Was often occupied in the mornings as guests from rooms with no shower were using the shower. The staff was very friendly, the location central and the breakfast basic. With so many choices in Rome, there is surely better for the price.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Powder Springs, Georgia", "Title": "“Great staff, decent rooms, overall experience was great.”", "Author": "Gipsytravler", "ReviewID": "UR80769872", "Content": "The staff was excellent and very friendly. The room was small, kept up, with a little bit of mildew in the bathroom. Every morning we had a complimentary breakfast with choices of cereal, milk, yogurt, danishes, toasts with jams, along with coffee, teas, and other drinks that were often offered. I will stay there again when I should visit Rome.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "edmonton", "Title": "“good hotel”", "Author": "edmonton32", "ReviewID": "UR78155427", "Content": "I was a guest in this hotel two days and I was fine. Breakfast excellent, staff polite and friendly, clean room. a salute to Mr. Virgilio, really nice", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "edmonton", "Title": "“appreciable”", "Author": "panda031", "ReviewID": "UR75670779", "Content": "Thanks to Mr. Virgil have found accommodation in this fantastic hotel. We arrived at the station terms without reservation and without knowing the city. He gave us a comfortable and maps, without which we would have lost in this great city. All very nice and helpful, all wonderful, very fast internet to communicate with friends and family. We had great fun.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Kentucky", "Title": "“Nice location and helpful staff”", "Author": "lopacchius", "ReviewID": "UR75276489", "Content": "I thoroughly enjoyed my stay at Hotel Saturnia. It is a quaint, comfortable hotel with a price that can't be beat. Even better, it is in close walking distance to all major attractions in the city of Rome. There are numerous shops and restaurants close to the hotel, and you can find several authentic restaurants and experiences that aren't too touristic. I agree with the writer about everything. The Hotel Saturnia is a family run hotel with some of the best service I have had anywhere. The staff are friendly and always happy to do what they can to help.There is a laundromat and small supermarket very close by, and an autobank and post box across the street. The free wi-fi in my room was very welcome and the speed was fine for research and writing emails. Nice breakfast too. I would stay there again without hesitation. We were there for eight days and were sad to leave... it was like leaving family!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Palo Alto, California", "Title": "“Excellent service, good rooms, good location.”", "Author": "sftraveler99", "ReviewID": "UR73257691", "Content": "The hotel is close to the train station. Kali at the front desk is very helpful and friendly. The room was good--the AC worked, the bed was comfortable, and everything in the bathroom worked, although the bathroom was tiny. Breakfast was fine. Overall, a very good hotel.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carrollton, Texas", "Title": "“Hotel Saturnia's staff are most helpful”", "Author": "MTC212", "ReviewID": "UR71467057", "Content": "We traveled to Rome, Italy for 10 days. My husband, myself and our two grown children. We stayed on the first floor, which was nice due to there only being stairs to the 2nd, 3rd and 4th floors. Our room was quiet, had a small refrigerator and was convenient and comfortable. Our two boys stayed on the 4th floor which was fine for them. They had a small balcony that they could walk out on that overlooked a small pub and a few shops below. The continental breakfast as good, although you get tired of eating the same thing day after day. Breakfast consisted of bread, pastries, cheese, ham, cereals, hot cocoa, coffee, orange juice and hard boiled eggs. The location is very convenient. Only a 10 minute walk to the main Termini subway/bus station which makes getting all over Rome very easy. However, the most impressive part about the hotel is the staff. They speak English very well and know the city inside and out. They can direct you to any place you want to go. I strongly recommend this hotel due to it's location but mostly because of the staff. I would not recommend traveling to Italy during the summer months. It is very hot and humid and most places do not have air conditioning. The hotel has air although it is not what we are used to in the U.S. Other than the heat, Rome is an awesome trip to see historical sites and experience a different culture and great food. Hotel Saturnia will make you feel like you are a VIP traveler.", "Date": "July 19, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ascoli Piceno, Italy", "Title": "“Close to Colosseum, average rooms”", "Author": "colin_read", "ReviewID": "UR70877940", "Content": "The Saturnia is close to the Colosseum, with restaurants and bars nearby. It can be noisy (not necessarily their fault, as one day a truck decided to unload its contents at 6:00 in the morning outside the windows). The rooms are small, but they have a fridge - however it was not working in either room, and neither was repaired throughout our 3-day stay. Overall, it was an average experience, and my single room was good value for somewhere simple.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York", "Title": "“No a/c in July”", "Author": "cosmo-the-dog", "ReviewID": "UR69582459", "Content": "Staff brought us a fan and said they don't like a/c anyway. They gotta be kidding!", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bruges, Belgium", "Title": "“Wonderful hotel: clean, very friendly&helpful staff, great location!”", "Author": "Michele0046", "ReviewID": "UR69077547", "Content": "Normally, I never write reviews of hotels, but for this one, I want to take the effort to do so, because the people who run this hotel really deserve good reviews like this one. First of all, the hotel is located at only 10 to 15 minutes walking from Termini station, so you don't have to take the metro to get there. It is located in a sidestreet of Via Cavour, but we weren't bothered by noises at all. Our room wasn't very big, but it was comfortable and perfectly cleaned. Outside, it was 33 degrees, but we had airco in the room. The shower worked very well and there is also a tv. The staff was VERY friendly! It is a team of enthusiastic people who seem to come along very well. They gave us great advise about Rome (e.g. where to go, where to eat, where to hang out, ...). They were always in for a small chat and some jokes. We really liked them. So a special thanks to Kali, Diogo, Riccardo, Virgilio, Palmira, Lilly and Michela! The breakfast was perfect. Not a huge amount of things to chose from, but there were a lot of croissants, toast, boiled eggs, cornflakes, coffee, tea, orange juice, milk, ham, confiture, butter, nutella, .... Anything you need! Thank you very much for your service! You were great!", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ballwin, Missouri", "Title": "“Excellent, friendly staff and a great location!”", "Author": "JenP1980", "ReviewID": "UR68355956", "Content": "We arrived at the hotel a few hours before check-in time. Titiano (I'm sorry if I've spelled it wrong), greeted us with a smile, offered to hold our bags, let us use the restroom , and offered us coffee and tea right away. He also got out a map to give us, circled the main attractions he thought would be worth seeing, and even made some dining recommendations. This was our first stop in our first trip to Europe, and we couldn't have felt more welcome. Titiano was fabulous! The hotel is a short walk (about 10 minutes) from Termini Station, and it's also a great location for site seeing. We walked from the hotel to every site we wanted to see in Rome, even Vatican City (though this was quite a long walk, about half an hour). Everyone we dealt with at the hotel was quite friendly and spoke good english. The breakfast was nice, breads, cold cuts, hard boiled eggs, etc. The room had a ceiling fan, which was a blessing. The room had a shower and bidet, the toiled was shared. bathroom was kept quite clean. I highly recommend this hotel, we had a great experience!", "Date": "June 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Ideally located”", "Author": "ry0_Saeba", "ReviewID": "UR67615522", "Content": "+ Ideally located, next to the train station clean rooms nice breakfast - Small rooms Expensive for the provided service", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "amsterdamm", "Title": "“holiday in rome”", "Author": "john22amsterdamm", "ReviewID": "UR67565782", "Content": "small and beautyful hotel in rome downtown, close to colosseum and few minuts from termini station, but at the same time in a silent little road (this is really special in rome...)people of the hotel very friendly. good price, nice breakfast.we suggest this place.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice staff!”", "Author": "marine1234", "ReviewID": "UR67322258", "Content": "This hotel is famous for the staff and for people working there....and is true. We received a nice welcome at arrival and for all the stay they are so friendly. Very good breakfast and nice comfortable room. We recommend this hotel.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“A great base for a Roman Holiday”", "Author": "advaitin", "ReviewID": "UR64060735", "Content": "We came to Rome in May 2009 for a two week stay, arriving at the Termini, since we prefer train travel whenever possible. Because of bags, we took a taxi--although it really is only a ten minute walk down Via Cavour to the hotel. Walking or in a taxi, the problem is spotting the side street that the hotel is on. I include a view from Via Cavour to help. Via Ruinaglia was in the process of being permanently blocked to vehicles turning in from Via Cavour, so the taxis either have to stop on Cavour or go down the parallel Via Urbana. It's not as complicated as it sounds. The street being blocked makes for a quieter night's sleep. Do not expect to sleep late however, as a school and a service entrance is directly across the alley and they start making noise fairly early. This would only affect party-types, not families and tourists interested in seeing the sights and getting an early start. Ricardo was very helpful from making Email reservations and throughout our stay as was Virgilio. The fact that there is no elevator made for good exercise getting to the breakfast each morning. The food was more than adequate, although it typifies the \"Continental\" style. Most Americans would have no problem satisfying their morning appetite. Coffee could be either self serve or made by the staff and I seemed to be offered coffee day or night as I often used the desk in front of reception or the breakfast room for editing my pictures and blog (better WiFi reception). Speaking of that, if the hotel's WiFi was down, there was good reception to a public network exactly at the corner by the restaurant on Via Cavour. The hotel is old--sort of like Rome is old. But the amenities are fairly new and work--the plumbing and electricity, that is. The staff are extremely helpful. My only untoward event was the loss of my primary set of eyeglasses. I attribute that to no one but myself, as I am careless about where I set things down--and remembering to pick them up. In this case I am certain that the stylish but small prescription glasses with non-glare lenses and thin black wire frame were swept into the trash but by the time I realized they were gone, so was the trash. Fortunately, I am a belt and suspenders guy, so I had a backup pair of glasses in my suitcase. As another reviewer said, many of the places to eat along Via Cavour cater to tourists and are expensive for what you get. Because of our long stay, we were treated to a meal at the restaurant next door. We ate there a few times and we learned that a small deceit was employed to increase the bill. If the charming waiter says, \"would you like to sample this?\" or \"try a taste of ... while you wait for your meal.\" He does not mean that it is really a sample or just a taste, it will be a charge on your meal. On the other hand watching the waiters flirt with every passing woman and even more with those at the tables was well worth the price of admission. Because I did not see this behavior regularly at other places we ate, I suspect it was mostly for show--but who knows. We found our least expensive meals by going into the neighborhood behind Basilica di Santa Maria Maggiore, where there were ethnic (and authentic) places, plus a few restaurants offering Italian regional specialties. We also ate at Turkish-run pizza stands on side streets and snacked at interesting wine bars. My opinions and findings are posted at http://www.travelblog.org/Bloggers/Advaitin/ if you are interested in more pictures and ramblings about Rome. Suffice to say that you can shop around and find reasonable prices both in the neighborhood of the hotel and in Rome. Much is within walking distance of the hotel, including the subway, which we rode once, and the bus system, which we used constantly, usually going to and from the bus station in front of the Termini. I would be remiss if I did not mention the gelato stand just a block down Via Cavour on the right. Perfecto! Also the Gelato place on the right side of the Pantheon as you face the entrance. That one is in the travel guides.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Vert helpful staff, great breakfast, great location!”", "Author": "Travelbug3411", "ReviewID": "UR63515440", "Content": "My husband, 13 year old daughter and I stayed here for 3 nights in March. The first nights of our first ever visit to Europe! What a great first impression of Rome and of Italy! This hotel is very easy to get to from Tremini and affords easy access to the subway and buses to get around the city. On our last day we rented our car at Tremini and were heading up to Tuscany. Ricardo (I think that is his name!) was so very helpful with detailed directions to get us through the Roman streets to the Autostrada. We only got lost once (our bad!) and found driving in Rome to be kind of fun! Room was large and clean, bathroom smallish but functional and breakfast was great!", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "canada", "Title": "“\" REALLY STUPENDOUS\"”", "Author": "hannett", "ReviewID": "UR62756249", "Content": "This hotel is really stupendous. My companion and I had never been in a place of the kind. And' extraordinary, different from the other hotels where we have sojourned in past. Furnished with good taste and clean, personal kind, abundant and mixed breakfast, all perfect. The signor Virgilio is really a good person, hospitable and ready to any application. We will also send our friends.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ro", "Title": "“Nice stay in Rome”", "Author": "obliocu", "ReviewID": "UR62289340", "Content": "We enjoyed our stay at Hotel Saturnia and to be honest we can't complain for nothing. The quality of service is very good and the personal is helpful (thank you guys for everything!). Also the breakfast is very good. We must say that they have a nice arrangement in the hotel, lots of nice paintings, beautiful decorations. The rooms are offering all the comfort that you need in a trip but this it's a matter of taste. We liked it! The hotel's location is nice - very close to Termini or Cavour metro station, Colosseum or other objectives. Grazie a lei signori!", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“The Best Staff in Rome, maybe Italy!!!!!”", "Author": "TangyEvents", "ReviewID": "UR62151133", "Content": "Overall a great experience at this hotel, 5 min to 10 min walk to everything. Coliseum, trevi fountain, termini train station, etc... is only a 5 to 10 min walk. Free WiFi, Breakfast, juice and coffee are available in the lobby 24 hrs. Good restaurants and bars within walking distance(stay away from L'angolo Di Napoli, the service was awful and the food was worse. Stop by Druid's Walk bar, you will find a Guiness sign outside, a block away from the hotel. Tell Fargus that Richard Tang sent you.) The hotel is a more boutique style hotel but the staff is amazing! Kaly, Ricardo and Tiziano are probably the best staff in Rome, actually I believe they are the best! For a 2 star hotel, the staff are 5 star caliber. EXAMPLES: 1. The flights of steps weren't exciting but the staff were will to run anything up to you. 2. My girlfriend and I woke up a little late for breakfast(2 hours late lol...) and Tiziano opened breakfast back up, as my gf said she was a little hungry to me. 3. I got stuck in Rome because of VOLCANO, and not only did they not gouge me but they actually gave me a better rate then when I original booked on expedia. Before I left I told Kaly I might be back because of the ash clouds Kaly responded \"just come back and I will find you a room and if I can't Ricado can find a room somewhere else it is easier for us to make deals for you guys.\" Ricardo's response to the situation was \"in situations of crisis we shouldn't gouge people we should help them.\" We came back after getting gouged at THE AIRPORT PALACE HOTEL/THE SATELITE PALACE HOTEL and they welcomed us with open arms. Ricardo found us a room at the Residenza Ki Hotel(a sister Hotel), where I found Diego waiting for me downstairs to welcome me to the hotel and grab our bags. Glad to be back home but these guys are amazing, and if you do decide to check into this hotel tell the staff Richard Tang says hello and Thank you!!!!", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Small but beautiful”", "Author": "marcellenew", "ReviewID": "UR61067179", "Content": "The Saturnia is found next to the station termini, from which can be gone for all Roma. And a small hotel, very acrative where gentless is of hause. The connection internet is fast, the breakfast is very good and the really clean room. The Mister Virgilio to the recepsion is an extraodinary person. To whatever time it is always available and kind and you has given us some good information on every thing that served us. This hotel is excellent to sojourn us.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "londra", "Title": "“pleasant”", "Author": "paulinesse", "ReviewID": "UR61066227", "Content": "We have sojourned to the Saturnia after pasqua and we have been really well. The breakfast includes a variety of food that satisfies. The S. Virgilio, very cordial and kind person, has furnished us information to visit the most beautiful places of roma. The evening always offered us juice of orange before we withdrew there in our room. We are found very well there and we will surely return.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "oslo", "Title": "“Great location, clean and nice”", "Author": "krilndl", "ReviewID": "UR60972318", "Content": "We enjoyed a very nice stay with good breakfast and nice staff with pleasant service. Situated in a side street this hotel provided quite peaceful nights. Good firm bed! Rooms are small as in most Italian hotels.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Friendly place to stay”", "Author": "Ezekielette", "ReviewID": "UR60139810", "Content": "This was the last stop on our Honeymoon. We turned up early so they let us leave our stuff there, and were very friendly; they gave us a map and showed us all the attractions and told us about a market that was on that day, so we went and explored. When we got back they said we would be one room for one night and then change our rooms for some reason; we had a choice between two rooms. One next to the hotel through an iron gate (it smelt like sewrage) or one at the top of the hotel up a spiral staircase (smelt better) so we chose that one. The rooms were suitable but if you looked closely it was a bit run down. The toilet in our first room didn't work too well (made me afraid to use it) and the shower was a bit mouldy. Our first room had a double bed plus two single beds, a TV and a mini fridge. They moved our stuff in to our second room the next day so we could explore. The room was quite small, it had a desk and chair, TV and clean bathroom. The rooms were serviced daily. However our bed was on a base with two single matresses pushed together which was incredibly uncomfortable (being on our honeymoon!). We complained to the staff, but they were so nice about it and we couldn't be bothered to change rooms that it really wasn't a big deal. I wasn't a fan of the breakfast, but my husband loved it. It was all sweet breads and cheeses, cereal, tea and coffee and juice. I don't like sweet goods for breakfast, but it would be good if you did. The location was absolutely wonderful. Heaps of shops and restaurants around, and a 10 minute walk from the Colloseum. The Hop on Hop Off bus stops right by the hotel as well. When we left the staff gave us a bottle of olive oil which was lovely, they were incredibly friendly and nice. I'd consider staying here again.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kit Carson, Colorado", "Title": "“Staff makes you feel like family!”", "Author": "Mom-bird58", "ReviewID": "UR59461770", "Content": "We selected this hotel based on previous reviews and were very happy with it. Super clean with a decent continental breakfast: boiled eggs, ham slices, croissants & rolls. Like most hotels in Europe, rooms and bathrooms are small - you can book a room with a shared bath or a private bath - we went with a private bath. Plenty of hot water, soap, shower caps and towels. No washcloths. Small flat-screen tv's with satellite. The staff is what makes this place extra special. No surly service here; everyone is so nice and willing to help. I was a woman traveling alone with a 13-year-old daughter; we spoke no Italian and it was our first visit to Rome. The staff speak very good English and were super helpful with info about getting around Rome and to Pompeii and Ostia Antica. Free in-room internet is nice; ask at the desk for the access code. About a 15 minute walk to Termini (the main rail station) and to the Cavour Street stop on the Metro (subway). Also, those huge double-decker hop-on/hop-off tour busses have a stop just about a block away, next to Santa Maria Maggiore - very convenient if you want to take a tour of the city and you can purchase a tour bus ticket at the hotel's front desk. It takes about 15-20 minutes to walk to the colisseum from the hotel. There's a tobacco shop nearby on Cavour where you can purchase bus/metro tickets. The hotel is actually located on a narrow slip of a sidestreet, just off of busy Cavour Street. The street is blocked off from traffic. The hotel faces the wall of what appears to be a small convent. The hotel itself is quiet, but the church bells peal loudly every morning at 7:00 a.m. You can also hear the garbage trucks come rumbling along Cavour St. in the middle of the night, especially if you have your windows open, but they're gone soon enough and I think this is the case for many hotels. The first night, we stayed in a room on the top floor, which was kind of neat because there are only two rooms on this floor - one was our hotel room and I'm not sure about the other - the door is simply marked 'Private' and has no room number. This top floor room has its own small balcony that looks over the walls of the convent and across some rooftops, which is a pleasant place to sit. This room also has a large king-size bed and a very small bathroom with what has to be the world's tiniest shower. But this room is on the 5th floor (they call it the 4th floor, but it's actually the fifth) and there is no elevator, so it is NOT for people with lots of heavy luggage or who have difficulty climbing long and steep flights of stairs. Definitely a cozy and private little nook, though, so ask for the 4th floor room if that's what you're looking for. Apparently it was booked for someone else the next night, so we were moved to the second floor, and that was good, too. No balcony, but the room was large enough and the shower was a bit larger, which was nice. This place is small, cozy, intimate and very clean. The staff takes a lot of pride in their service to guests and in the overall quality of this hotel. There's a great little restaurant just down the street - about a 15 minute walk in the direction of the colisseum, across from the Metro stop. You can dine outside on the sidewalk or inside. Intimate and cozy, very clean, beautiful and great service. The staff is super pleasant and we thought the Fetuccini Alfredo was great. They also have pizza and many pasta dishes and the menu is in Italian & English. We dined there twice and both times were the only Americans - everyone else appeared to be Italian, so this isn't your typical tourist trap. The name of this little gem is L' Archetto at 195 Cavour St.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "drew o", "Title": "“Friendly, excellent service with warm and welcoming staff, in a great location”", "Author": "plastics101", "ReviewID": "UR59363307", "Content": "I was at the end of three months of travels when I stayed here, and was able to go home truly relaxed and well rested.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "londra", "Title": "“A BEAUTIFUL VACATION”", "Author": "vivienne061", "ReviewID": "UR58956459", "Content": "We have arrived in the hotel with beautiful day of sun and he has alredy been a good sing. Our room was dean clean and wel furnished. The evening the signor Virgilio has recommended us a good place where have eaten very well. He has also prepared us a map with which to visit Roma. We are found really well there.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "langenfeld", "Title": "“Very confortable and clean!”", "Author": "tangone1", "ReviewID": "UR58249960", "Content": "This hotel looks good. Location is perfect for visit the old city and the best monument area. Rooms confortable and clean every day. At least staff is really welcoming. They find all information for you and are helpful to all questions. Breakfast in the average. Recommendable", "Date": "March 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "montral", "Title": "“\"Saturnia: very pleasant hotel\"”", "Author": "solinas", "ReviewID": "UR57954156", "Content": "I they have been in this hotelwith my companion for three days and we are found very well there. Mister Virgilio, to the reception, she has been kind with us and she has helped us with our baggages, the evening it welcomed us with a good warm coffee, and she has given us useful information to visit this magnificent city. We will surely return because in this hotel we have found really a good service.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Ask for Virgilio!”", "Author": "mikel6430", "ReviewID": "UR56871980", "Content": "This place has great potential and great intentions. Unfortunately these things alone, won't make for a good stay. I was here for 2 nights earlier this month, and the second night was hell!! First thing in the morning when i was getting ready to leave to go check out some sights, i turned my key in to the reception. I was informed that my reservation for the second night, which was made 3 weeks prior to me arriving, had to be juggled a little cause of \"system errors\". They would have to move me to a smaller room, but at the same rate?? i didn't want to deal with it, as to not waste any time, so i figured \"as long as i have a place to sleep\". When i returned, a little bit after noon, sure enough my things had been moved to a much much smaller room (rm 104), but i was content to have a place to rest in. I relaxed for a bit and got ready to head out again. I turned my key into reception once again, and when i returned at about 10pm, i asked for my key (rm 104). I was informed that room was occupied by someone else!!! Where are my things?! i asked. They had to scrammble until they figured out where they were. By the time everything was resolved, it was almost midnight!! Fortunately, Virgilio, the man at the front desk, was extremely helpful. He refunded me for the second night stay and paid my cab to the airport the next morning. Aside from the confusion, this place is in a great location and has great rooms. Stay away from Tiziano, a hotel employee, total jerk who shouldn't be working in customer service!! You just don't raise your voice at clients!!!", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "patterson", "Title": "“\"under the rain\"”", "Author": "patterson090", "ReviewID": "UR56766402", "Content": "We have been in this hotel for a couple of days and found wery well there. Our room was furnished with simplicity and good taste.The bat not too much great but clean. The very kind and cordial personnel the breakfast was abundant, and they also served us when we were late whit the schedule. Roma is a really enchanting city to visit, also under the rain.This hotel is well connected a lot ,and whit the help of the signor Virgilio there are not lost a monument. You has know how to give us precise indications on as to move us to visit the whole city. This hotel is a small rare pearl and theavailability of the personnel and the Signor Virgilio they do in way to feel you to haus", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“Good comfort.”", "Author": "strudele-leon", "ReviewID": "UR56652286", "Content": "The hotel is well located near Termini station, you can reach it in 10 minutes walking from there. Rooms not so big, anyway is a two star hotel not four! Breakfast in the morning with sweet and salted, very good. Excellent wi-fi, important for me.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Somerset", "Title": "“Everything came with a big smile.”", "Author": "mattdwilson", "ReviewID": "UR56644816", "Content": "From being picked up from the airport to going back to the airport you were looked after all the way through. Everyone working in the hotel had a smile and couldnt do enough to make sure you enjoyed your stay. The hotel is close to the Colosseum and the central train station and metro, but rome has most sight seeing place within walking distance. There are alot of resturants and shops just round the corner. The rooms are comfortable with the managers own painting decorating the hallways, rooms, breakfast bar and entrance hall. This hotel is perfect for anyone who wants to stay in Rome and sightsee with family or partners or on your own, and if you need anything just ask. You will be made to feel welcome.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Metro NYC", "Title": "“Small in size, HUGE in hospitality!”", "Author": "Big_Jelly_Belly_Baby", "ReviewID": "UR56100566", "Content": "Stayed here for 4 nights in Feb. 2010. Hotel is a 5-minute walk from Termini (the main public transport hub of Rome) and very easy to find, tucked away on a quiet side street off Via Cavour. The room we stayed in was tiny but clean. Breakfast was terrific and filling. Consisted of ham, croissants, rolls, boiled eggs, assorted pastries, juices and an awesome cappuccino made with love by the super nice signora behind the bar. The entire staff definitely made you feel very welcome and were very accommodating. They always had a smile on their face. Ricardo even went up to our room to personally show us how to work the safe! Kali was especially memorable as he always took the time to chat with us after our long days and helped point us to some great food places and the best routes to take when walking to the sites. We loved it so much here that we ended up sleeping in late on the morning of our departure even after Kali's wake-up call and almost missing our train. We would have loved to said our thank you's and goodbyes properly (and have that last awesome breakfast too!). It will have to wait til the next time. Definitely A+++++ will do business again!", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Cozy little hotel where there's no limit for the level of service”", "Author": "Cirkeline1980", "ReviewID": "UR56009132", "Content": "From the moment you step into the hotel, you can feel the warmth and the friendliness from the people that works there. If you the kind of person that want luxury then go to the hilton, but if you're in Rome to see all the beautifull things this city has to offer, and \"just\" need a bed to sleep in, and a friendly face that will do everything in there power for you to fell welcome and have a good holiday, then this is the hotel to stay.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“The best 2 star in Rome”", "Author": "HugoMelbourne", "ReviewID": "UR55445990", "Content": "The hotel was in a great location, close to the central station and an easy walk to all the sites that you want to take-in in Rome. Our airline had lost our bag and the staff at the hotel were increadable, they pushed the airline in italian to help us recover our bags. The experience in Rome was made enjoyable by the very helpful and friendly staff at the hotel. The room was exceptinaly clean and had all the facilities that you needed. The breakfast was included in the price and the coffee they made was incredible as well as the view from the window. We would recommend it and would stay there again when we visit Rome. looking forward to Retuning to Saturnia", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "norway", "Title": "“Staff make it difference!”", "Author": "norimba2134", "ReviewID": "UR55081009", "Content": "We enjoyed the hotel very much. It was clean, friendly, perfectly located, and reasonably priced. But for me, the biggest asset of this hotel are the guys of reception. They are lovely!!! It is great to lodge at a hotel in busy Italy and forget about carrying guides... These guys have got all the information on restaurants, events, enotecas, you name it! They are your agenda for the stay!! They know the best places for food, where you want good value or top rated restaurants, they know it all! Dont look for luxury in this hotel, this hotel is to enjoy Rome. Anyway, if you want to stay in the centre this is the cheapest option, and it is worth it.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "albertpound", "Title": "“good hotel”", "Author": "albertpound", "ReviewID": "UR55073223", "Content": "I you they have been in this two days. Small but attractive, it dind't miss of any confort .I will also returne in this hotel for the vacations whith my family. A special thanks to Virgilio and whole staff.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“I agree with the best rewiews!”", "Author": "murphy1204", "ReviewID": "UR55005731", "Content": "I agree with the best rewiews regarding this hotel. Ok is a two star but don`t believe it. The service and the staff you can compare with a four star hotel. I travel a lot in all world but is hard to find this treatment. Virgilio and Riccardo makes your stay different and charming. A smile everytime at reception from them, that`s seems a good start in the morning. Breakfast over the average with eggs, ham, fresh rolls and croissant, yogurt and lovely home made cakes. Rooms are not so big but confortable and very clean everymorning. The hotel is central located and well connected with the best part of Rome. For sure i recommend this hotel to all people love a friendly stay in Rome.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "norvegia", "Title": "“GOOD HOTEL WONDERFULL STAFF”", "Author": "martinsado", "ReviewID": "UR54655148", "Content": "I stayed in hotel saturnia 5 nights. the hotel which was very clean and comfortable. the breakfast was more adequate and the coffee was great. well virgilio and kali your frout desk is helpfull, provided a map if roma. i would definitely stay there again.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "annakarenina1981", "Title": "“Just loved it!”", "Author": "annakarenina1981", "ReviewID": "UR54185261", "Content": "I had a wonderful stay at the hotel Saturnia. Me and my friends enjoyed the pleasant location situated just in the center of the eternal city. Few blocks away you can find lots of good restaurants and nice shops. Rooms were comfortable and clean. Breakfast was ok. The people at the front desk were very polite and available for all our requests. I really recommend this hotel for those who travel with friends.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“All you need....”", "Author": "murshi1980", "ReviewID": "UR54159999", "Content": "We stayed in a triple room for 1 night in Jannuary 2010. This hotel is just within 15 minutes walk from Termini Station in rome, three blocks to the shopping area at Via Nazionale. location is great. The room has new fornitures, with two reading lights by the side of the bed. water for shower is hot and with good pressure. The bathroom is well decorated. Breakfast is of good value, fresh made coffee, boiled brown eggs, pastries, cakes, yogurt, bread, juices and fresh fruits. The receptionist and staff all very enthusiastic to help. We arrived earlier than check-in time and they allowed us to check in early. Also we left hotel before breakfast time at departure but they arranged just for us a full breakfast. we really appreciate it.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "madrid", "Title": "“two stars asf our stars”", "Author": "senador", "ReviewID": "UR54151214", "Content": "In a historical building a few distance of via nazionale ,quirinale and santa maria major justo to have an idea in 15 minutes you can arrive in colosseo.good welcome.Rooms of good comfort,clean,quiet and superior expresso at breakfast.the staff was friendly and helpfull", "Date": "January 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san francisco", "Title": "“Friendly and very well located”", "Author": "shinyshiny33", "ReviewID": "UR53113402", "Content": "We had a fairly pleasant stay at the hotel Saturnia. The decor was appealing and breakfast was delicious. We were made to feel at home as soon as we arrived, the hotel is very comfortable and clean, our room was great. The hotel is full of old furniture and interesting ornaments....paintings are greats. Excellent base for touring the city. Happy and cooperative English speaking staff made email bookings and personal enquiries a delight. All in all we were very satisfied with our stay - especially considering the fantastic price.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Affordable and efficient!”", "Author": "petery1975", "ReviewID": "UR53035979", "Content": "My wife and I stayed at Saturnia for the last ofthe year. I am very familiar with Rome and I have stayed in several more blazoned hotels and was pleasantly surprised by the size and furnishing of the room (simple yet elegant) by a very modern and well equipped bath room and especially by the manager Virgilio who was very attentive and did everything possible to make our stay a remarkable experience. Situated about ten minutes walk from the Trevi Fountain and about the same to the Spanish Steps and also to the nearest metro station Cavour. Nice stay!", "Date": "January 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "india", "Title": "“Homely feel”", "Author": "prashant_gov", "ReviewID": "UR52426490", "Content": "I was totally new to Rome when I booked this hotel . With a thought to just sleep at night we thought its good in that price. But i reached there and developed the personal interaction with Hotel staff, I came with wonderful memories. I feel like I was at my home. The atomsphare was completely homely . everything was filled with emotions. wehn we were about to vacate the place i left with reomrse that I did not know much Mr. Virgilio . A grea human being , passion for art and serving people by working in hotel industry. I hope any body who would like to go visit rome have a trial there. i can surely say you will not feel its a hotel, but for sure you will receive a essence of home . love affection. In fine I can only say A small wonderful cottage with very close emotional bonding. Note: Do not miss to explore Mr. Virgilio . From out side he is just handeling a front desk but if you dig inside him he is a great painter(You can see his painting all around the hotel reception area, dining area and 1st floor), A great human being and a perfectionist. Prashant India", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Madrid", "Title": "“Good quality/price relation, clean and very well located”", "Author": "Amy2999", "ReviewID": "UR52180233", "Content": "It is a good choice for those aiming to visit Rome historical centre with a low budget and without a car, because it is just in the city centre, only five minutes walking from the railway station and at walking distance to some of the main tourist attractions. It is basic (some of the bedrooms don´t have private WC, some others do have) but the rooms are clean, it is quiet, the service is correct, rooms are properly equipped (they have everything which is neccessary) and the included breakfast is more than good for the price. Summarizing: good quality/price relation.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Auckland", "Title": "“Better than what you think it will be like”", "Author": "caleypl", "ReviewID": "UR52030905", "Content": "We stayed in a room which was recently re-furbished, it was a pretty good room. We enjoyed staying at this hotel. The breakfast was good, nothing out of the ordinary for Italy, ham and cheese. This location was close to Central Termini the train station, about 10 minute walk. There are no good places to eat around here, you will need to walk to get to good places, as all the restaurants around this hotel are tourist traps! Otherwise good stay. The free internet was good as well, but we had to ask for it, and it doesn't work in your room the wireless connection only works in the lobby.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ginebra", "Title": "“very good hotel”", "Author": "marsgo", "ReviewID": "UR51655089", "Content": "This hotel was exactly what we were looking for. Quiet, safe, confidential....we spent there five unforgettable days. Very friendly and helpful staff. We are planning to come back next year in may with our friends!!!!", "Date": "December 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Nice stay in Rome”", "Author": "beatrix4819", "ReviewID": "UR51070111", "Content": "This hotel is really nice located close to all monuments and to metro station \"Cavour\". All staff very helpful. Rooms clean everyday and spacious. Excellent breakfast in the morning. Recommendable", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "denmark", "Title": "“great staff, poor rooms, great location”", "Author": "travellingisliving", "ReviewID": "UR50230334", "Content": "My husband and I stayed at this hotel in nov. 2009. We arrived by bus from the airport to central station and it was easy to find (we had our own map and checked the address in advance). The location was very nice: we easily reached the colosseo and many others sightseeings by feet; there were to metro stations 5-10 minutes walking distance, one of them in the central station. The staff of the hotel was nice as well, helpful and friendly, from the receptionists to the cleaning ladies. The breakfast was good and satisfactory. The room was bit disappointing. When we arrived we slept in a very small room with a tiny bathroom. We asked to get a new one and without problems we got a bigger room with bathroom inside (there was the shower and the sink inside the room without any wall of separation) and the toilet was outside on the floor (common toilet). We managed of course with the second room - it was better and definetly less cloustrofobic. The rooms and the rest of the hotel were cleaned, but it didn't look like the building is well taken care of. I can recommend to sleep here if it is for a short stay as we did (4-5 nights).", "Date": "November 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago, IL.", "Title": "“I will stay here again!”", "Author": "itsbritbiotch", "ReviewID": "UR50071787", "Content": "The staff was soooo helpful! I miss them. The hotel itself is with in walking distance of many attractions. I hope to stay there again!", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "belgio", "Title": "“very convinient.”", "Author": "federick81", "ReviewID": "UR49887206", "Content": "Roma is fantastic. the staff is wonderful. Great maneger!", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“CHECKED IN AT 2 STARS, CHECKED OUT AT 5 STARS”", "Author": "OOFA2", "ReviewID": "UR49709181", "Content": "I don't even know where to begin? I only have positive things to say! Well, me and 2 other girls stayed in the triple room. Small, but served the purpose of a trip to Rome which was a bed to sleep on and a shower to clean up! Shower is really small, so if you are of an larger size it maybe tight. We arrived to the hotel via shared shuttle service about 6 hours prior to check in and they greeted us with a cup of coffee while we waited maybe 30 minutes for our room to be ready. Allowed us to check in early which was great after a long flight. Great location and you could walk to ALL the main attractions. We actually walked all the way to the vatican! What a great way to see the beautiful city of Rome. Very safe area for hotel location, food and basically anything else you need. Hotel staff was great. Loved, Loved, Loved the gentlemen that worked the night shift. What talent he has!!! All the paintings you see in the hotel he did himself! My girlfriend didn't have a european adapter for a 3 prong for her computer and the staff went and bought one for her to use and said they should have one at the hotel anyways for future guests!!! OMG!! How fantastic is that?? Breakfast was plentiful and simple beverages were always available for free. I would highly recommend this place and plan on coming back! I got a big hug good bye and kind of got teary eyed to say good bye to the wonderful staff. The bond was immediate! Great shopping, so bring some extra bucks girls! Public transportation was fairly simple as well. No wash clothes, so bring a spongy for the shower. Rooms were quiet only heard the noise of other guests once in awhile. The only thing I think needs attention would be: Needs to add some fresh fruit for breakfast Give public transportation directions on the confirmation email when booking the hotel I give this hotel high scores!!!", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Limassol", "Title": "“I feel like home”", "Author": "chrisyer", "ReviewID": "UR49578734", "Content": "I had nice time staying in that hotel and the people working there Virgilio and Ricardo as also the other staff makes me feel like i was at my house. Theeir service was excelent and always try to help and answer to all my questions. The breakfast the rooms are excelent. I dont have other words to describe it and of course when am back in Rome am sure i return back. The only must improve the internet and also have a good wi-fi also to the rooms. All the other are excelent!", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“wonderful magic staff with a heart”", "Author": "sweetgirl6", "ReviewID": "UR48910307", "Content": "I had doubts when my friend wrinz asked me this hotel without the lift. I concerned but not yet booked entrusted me with good luck. When we arrived at the airport it started raining, and this seemed to be not a good sign. arrival at the hotel I was impressed by the availability of goalkeeper who offered us two hot cup of tea while he was a Checkin . when we went down there showed the itinerary of Rome by telling a story of this magic city!, providing information on how to move and restaurants catering to our needs. He was very kind . We were very sad when we were going.Good breakfast, rooms very clean. You will find a the staf of dream , when you arrive to find him. small hotel but with a great service, good as in a great hotel! thanks to the manager.", "Date": "November 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "madrid", "Title": "“little hotel in Rome city center”", "Author": "marlyn1467", "ReviewID": "UR48814681", "Content": "This hotel is really well located. Room are comfortable but not so big. Breakfast in the morning was rich with ham, cheese, fresh croissant, rolls and fresh fruit every morning. If we came back to Rome we definetely stay there. Thanks to Kali.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "berlin", "Title": "“Nice staff, nice hotel”", "Author": "mincigirl1981", "ReviewID": "UR48719701", "Content": "I booked this hotel for only one night on the internet but at least i decided to spend there three nights more. This was because the hotel was more than i expected. Very clean room, nice staff, great and quiet position and all new furnished. Don't believe to all rewiews my experience was great!", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Iowa", "Title": "“Very helpful, spacious room”", "Author": "pavoneblu", "ReviewID": "UR48612014", "Content": "My favorite part about this hotel was the concierge at the front desk. Immediately upon arrival he answered all of our questions and gave us a fantastic map. Every day when we left, the person at the front desk would explain in detail how to get where. Breakfast was great, lots of options, good service. Room was a good size, the shower was IN the room, which I thought was odd, but it worked out for us, maybe not for some people. No private bathrooms on the floor we stayed - if that is a problem for anyone.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "madrid", "Title": "“Everything nice”", "Author": "losamigos1973", "ReviewID": "UR48184757", "Content": "Hotel Saturnai is a two star hotel but everything was really nice....consider it as minimum a three star! Room is good and cleaning was really the best i've found in Italy. I saw not good review on internet connection but they change it for sure, mine was excellent. Breakfast in high standard. The staff help you in any case you need, ok maibe english is not perfect with all of them but this is not a good matter for a two star Hotel.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "helsinky", "Title": "“Very helpful staff.... how to visit Rome in the best way”", "Author": "silverblaze1972", "ReviewID": "UR48086787", "Content": "First of all we just arrived early in the morning in this small quiet hotel and they gave us our room at 10 a.m., we were very tired and this was a very good service.They also offered us an extra buffet breakfast at the arrival time. Riccardo at the front desk helped us in finding out everything we were looking for also arranging for us a tour of the city at a very fair price. Room was new furnished and the bathroom was spacious and clean. Fresh towels every day. Virgilio in the evening shift always suggested us not touristic and very good restaurants. We definetely recommend this hotel to whom doesn't need a five star hotel but want to visit Rome in the best way.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cuba", "Title": "“Exactly what i expected”", "Author": "patapata19", "ReviewID": "UR48008469", "Content": "A little gem in Rome. Hotel has some rennovations in common areas and for sure in our room. Nothing compares with some old reviews i've read before booking. Comfortable room with nice new bathroom and all amenities. English speaking staff always helped us to find everything in the city and very good suggestions for restaurants and sightseeng. Breakfast in the morning was rich. Room cleaning and fresh towels every day. we definetely recommend this hotel for a nice stay in the center of Rome close to all monuments.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Auckalnd", "Title": "“Very helpful staff - nothing was too much trouble.”", "Author": "RubblesAuckland", "ReviewID": "UR47741791", "Content": "We arrived on a Sunday afternoon after driving up from Sorrento. We had no idea where we were and had nothing booked. Riccardo was on the desk and assured us we were in the centre of Rome and booked us in for 4 nights. The room was clean and comfortable. We were able to walk to the Colesseum, the Trevi Fountain, Pantheon and lots of other attractions easily. The train station was a 5 minute walk. The staff were very friendly and helpful and the breakfast provided was plenty to start the day off. Anytime of the day were were able to help ourselves to coffee. Thanks for a great stay.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great Location & Helpful Staff”", "Author": "global_food", "ReviewID": "UR47019332", "Content": "Hotel Saturnia is clean, comfortable and centrally located. We stayed at Hotel Saturnia on 2 separate nights (when we arrived in Italy and on our last night). The hotel is close to the central train station (10 min walk) and many other sights (Roman Forum, Coliseum). Breakfast is included in the rate. The staff at the hotel is extremely helpful. They stored our luggage when we arrived early, provided maps/directions to where we were going, and Riccardo helped us ship our package back home!", "Date": "October 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "milano", "Title": "“fantastic hotel in rome”", "Author": "lloydkristy", "ReviewID": "UR46524635", "Content": "i've been travelling in Rome with my wife and we found this beautiful hotel down town very close to piazza di spagna and piazza navona.i found the stuff very helpfull the breakfast was very good and the rooms very confortable i really recommend it even the price is quite cheap.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Relaxing & Comfortable”", "Author": "bhornet_1046", "ReviewID": "UR44941239", "Content": "After touring Rome and viewing all it has to offer, it was comforting to know that we could relax in the comfortable rooms we rented. We originally planned on staying for two nights. After such wonderful rest in the comfortable beds and friendly hotel staff, we decided to remain for another 4 nights. We highly recommend those viewing other hotels to consider this hidden jewel within easy walking distance to some of the best sights and public transportation in Rome. It was an easy walk from the Metro Station to the hotel after we quickly learned our way around the city. We're booking again for our next vacation in Rome.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto, ON", "Title": "“Good Value”", "Author": "Mike_8530", "ReviewID": "UR40053152", "Content": "Stayed at the Saturnia in late August 2009. Booked via the website without issue. The hotel is nicely located about 9 blocks from Stazione Termini, and a few blocks from Cavour subway station. The neighbourhood is safe and it's quiet in the rooms because the hotel is located on a short street off Cavour. I arrived on an extremely hot day, and after checking-in & realising that I had one of the 'basic' rooms without A/C or private bath, I returned to the desk where I was helpfully offered an upgrade for an additional €20 per night. This second room did have A/C, a small private bathroom, and a generally improved finish over the basic room. (Having now returned and re-consulted my original booking, it seems as though I did in fact book the upgraded room to begin with, so not sure why I had to pay the extra on arrival. Water under the bridge - this was still a cheap stay.) The rooms were clean, and although there was a bit of mildew around the shower door as others have described, it's nothing to get excited about. As the private bathroom is small, and has to include a bidet, the shower is therefore quite tiny (one thing it could benefit from would be a shelf to put soap/shampoo on). I can't imagine anyone even remotely obese being able to use it. The bed was certainly not the most comfortable I have used, but it did the job. Some of the reviews have mentioned the staff, and I have to give a shout-out to Riccardo. He was always smiling, welcoming and spoke English quite well. He also set me up at a neighbouring hotel during the following week when I would be back in Rome and Saturnia was fully booked. Although lacking in some minor details, Saturnia is a good hotel, well-located, reasonably-priced, and with a pleasant staff.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "rome", "Title": "“comfort”", "Author": "romesammy", "ReviewID": "UR39499751", "Content": "very nice hotel ,rome downtown,staff very polite.Very good breackfast .5 min from the railway station. Comfortable and clean.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "california", "Title": "“Nice stay for a two star hotel”", "Author": "solvinyuu", "ReviewID": "UR38849678", "Content": "I spent there five nights for a meeting in Rome and i was luky to find this place. My room was really quiet and good air conditioning, important in August. Cleaning everyday. Excellent breakfast in the morning eggs, ham all kind of croissant marmellade and juice and for sure wonderful espresso coffee, i love it. People at reception very friendly and professional, they try to do the best for sure. But the best is the location. You can go walking everywhere Trevi , Spanish steps, Colosseo and Vatican, really nice location. I recommend this hotel to everyone want to be central located in Rome (that is for sure important) and to everyone want a clean and nyce room paying a reasonable price.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver", "Title": "“The best staff, great customer service and a fabolous location!”", "Author": "EcoBee", "ReviewID": "UR37940564", "Content": "This Hotel in the heart of Rome is small, old and needs renovation - no doubt about it! But the exceptional friendliness and determination of the Saturnia staff members to make your stay as pleasant as possible makes up for it! The Hotel is especially great located. Only a 5 minutes walk to Termini Station were one can reach any bus, train or metro but also walking distance to the Collosseum and many other interesting sites. Also right there are small convenient stores, good and economic pizza and food take out places as well as many restaurants and evening entertainment. The Hotel is as i mentioned old and really needs a make over. It does not have an elevator and the bathrooms are shared. The rooms are small, basic and simple but are clean. We had fresh towels every day! The first night i stayed in a single room which was very small and i would recommend to book a double even if you travel alone. After that we had a double room in the 4th floor with pretty steep stairs, but the room was very nice, had it's own bathroom and terrasse with a view over Rome. Breakfast was included and we were pleasantly surprised about the variety of cereals, breds, even mortadella, eggs and cheese as well as juices. Wireless internet signal was free of charge but the connection is not always good. Parking is a challenge around the hotel as the streets are very narrow but valet parking is available from the hotel for a few euros. Best of all - the staff members of the Hotel are real gems! One morning i had to leave at 5am for a business meeting and even tho the breakfast is served from 7am, the night concierge prepared the full breakfast just for me. Kali \"Banderas\" :-) the daytime concierge went more than once out of his way to research transportation options and other inquiries for us! I have to travel frequently to Italy and the next time in Rome, i will for sure stay at the Saturnia again!", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great value for money!!!”", "Author": "KaratheTravelAgent", "ReviewID": "UR35205116", "Content": "We found this hotel to be fabulous for the money we spent. I am a travel agent so I know that you usually get what you pay for- but I was pleasantly surprised by this hotel. Location: Great. Close to Termini station. Jump on the Leonardo Express from the airport to Termini Station and it is not hard to find from there. It is down an alley way (not 'dodgy' as some suggest). 10-15 min walk to Colosseum. Rooms: We booked a shared bathroom room but we lucky enough to get an upgrade the first night to a room with bathroom. The room was clean, modern and very spacious. The bathroom was newly updated. Although the bathroom was small it was everything we needed. The second room we had was also fine. Although not as modern, it was still spacious and clean. The A/C in both rooms was perfect for the hot days. Our rooms were very quiet and the beds were comfortable. We slept very well! Staff: Friendly and helpful when we needed it. Breakfast: The best we had on our whole Europe trip. They had a great selection- eggs, ham, rolls, cereal, juice and best of all specially made coffees/tea. Shared facilities: Not the greatest, but still bearable. The shared bathroom wasn't upgraded which wasn't really a problem. The only thing was the shower door/cover was a little faulty, but we didn't care. There are no lifts so you do have to lug your bags up the stairs, but this is pretty normal in Europe. All in all, I really enjoyed staying at this hotel and would stay here again in a heartbeat. If you are expecting the Ritz then you should stay somewhere else. This is a budget hotel, so you if are aware of this you will have a fabulous time!!", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "achel", "Title": "“i love it . It`s very nice”", "Author": "veroon", "ReviewID": "UR33282690", "Content": "nice hotel, nice rooms, very helpful staff well located close to the station and close to coluseum. certainly advisable to hotel we love it . very clean and were cleaned every day. very good breakfast i love it. Its very nice", "Date": "June 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "shellysumit", "Title": "“Worst hotel room of our two week trip to Europe!!!”", "Author": "shellysumit", "ReviewID": "UR31963800", "Content": "We booked this hotel online after reading a lot of good reviews for it. After staying in 6 good hotels in Switzerland and Venice, when we reached Rome, we were not expecting such a shock. The hotel wasn't very far from the Termini (train station), which was a good thing. But if you have luggade, then its best to take a cab, its still a good 10- 15 minute walk to it. The lobby of the hotel was very nice and the guy at reception seemed nice too. When we said we were on our honeymoon, he assured that he given us one of their best rooms. The room he gave us was on 2nd floor (2nd in Europe is 3rd in US), and there was no elevator so we had to lug our luggage all the way up. The room was really small, with the bathroom so small that it was impossible to stand and brush at the sink. The toilet seat had a crack in it. Believe me, we had been to small family owned B&B rooms which were much bigger than this room. There was one far to reach window, which was closed. Their was no ventilation in the room. And the sheets smelled of dust. The breakfast was average, what we had been getting everywhere else. The staff was helpful only to a certain extent. After telling you one thing, if you asked a few more questions, they would curtly reply that its best we find it ourselves. We won't recommend this to anyone. Its not that it was very cheap hotel that we wouldnt mind staying there.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Livingston", "Title": "“Good wee cheap hotel in great location”", "Author": "sobaan", "ReviewID": "UR31782587", "Content": "For a 2 star hotel,i was very suprised, the customer service of the staff was great especially Virgilio, who was vey helpful. Location of this hotel is fantastic smack bang in the city centre, close to all the main attractions. The hotel advertises shared bathrooms but i had a room for four and we had own bathroom which was great for us. The price also meant this no frills hotel showed good value for money.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Washington DC", "Title": "“Great Location, good staff, perfect as a place to stay will sightseeing”", "Author": "ploftusDC", "ReviewID": "UR31650118", "Content": "Only a 10 min walk from Termini Station and easy to find. The area seemed perfectly safe. About a 10-12 min walk from the Fora Romano and Imperilli and Trevi Fountain. There is a nice gelato place just a block down on Via Cavour. Staff speak English and her accomodating. They are perfectly content with letting you come and go as you please. Breakfast is nice and adequate, continental style. You can walk to many of the city's sights and a metro stop is about a 5 min walk away.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“They made a spontaneous arrival in the city so easy!”", "Author": "IslandGirl6789", "ReviewID": "UR28355415", "Content": "The desk staff for the three hotels in this group - in particular, the staff at Saturnia and the Fellini - were wonderfully accommodating! They worked to find available rooms when we appeared without a reservation; they stowed our gear when we took at overnight jaunt to the coast, and the two restaurant recommendations they gave were the best two meals we had in Rome - and the most affordable ones, too!", "Date": "April 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "USA", "Title": "“Kudos to the wonderful staff”", "Author": "some_trekkers", "ReviewID": "UR26344958", "Content": "We found this hotel by wandering into it when we were in Rome, exasperated that we could not find a reasonable place to stay. It turned out to be a fantastic discovery for us. The thing that makes this hotel is its kind, generous and helpful staff--which can be a big bonus after a long day of being shuffled here and there in an unfamiliar and sometimes unwelcoming new city for a tourist. We were pleased by the breakfast selections, as well. It's not a fancy place, but it's comfortable and again, smartly staffed. We were so happy with our hotel that we actually planned the remainder of our stay in Italy around staying here because we felt like we were getting such a good value for our money.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "london", "Title": "“Do not believe the website!!”", "Author": "sianydahling", "ReviewID": "UR23050908", "Content": "The Hotel Saturnia is in a great location (although it is down a dodgy alley of the main road!!), however do not be conned by the website, I do not believe the rooms they have pictures of are actually in this hotel!! If you are looking for a cheap and basic place to crash then this is ideal but I wouldn't plan to spend any time here other than to sleep as it wasn't particularly clean and the room was very small and cramped!! I have stayed in hostels that are more luxurious!!", "Date": "December 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "santa barbara", "Title": "“Family running hotel”", "Author": "silverblaze72", "ReviewID": "UR21299404", "Content": "What a nice place to live Rome! We spent there one week and we really feel like home. This place is managed from a family, they told us, so everything is well done. They take care about clean, about breakfast (fresh croissant and rolls every morning, ham, cheese, fresh fruit, yogurt and homemade cake) so they doesn't leave nothing casually. Room are good, is a renovated 2 star hotel so is fine to stay in Rome (consider you don't stay in room many time) and for sure is clean (we didn't understand the reviews saying is not clean, anyway we found this place more clean than avg). The staff was ok, they help you with maps and suggestion for restaurant and museum, all what we needed. But the best quality of Saturnia is the location.....remember location location location!!! Is located in a very little street walking distance from all you need. You can forget the bus and the metro if you like walking, like us. Just in case to go to Vatican you can take metro, but for the rest forget it. And also is near the station but not in the station area, so we find this location perfect for all the week spent there. We definetely recommend this place to all people want save money choosing a good quality.", "Date": "October 27, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sligo", "Title": "“Very Please with Hotel, Great Location, Nice Room and Friendly Staff”", "Author": "JoirishSligo", "ReviewID": "UR20925608", "Content": "I stayed at the hotel in September, after doing alot of research on hotels in Rome that were in our budget (€80 per night), this was the best option I found. Reviews were varied on alot of sights so I was a bit worried but for the price I couldn't resist, €80 B&B for a shared facilities room. The hotel turned out to be great, very central-less than a 5 minute walk to Termini and a 10 minute walk to the Collesseum. The hotel is located on a busy road but the small road at the back of the hotel is great with loads of small bars and restaurants. Our bedroom was newly decorated with sink, TV and minibar! The bed was comfy and the bathroom was only down the hall with a great shower and seemed to be free most of the time. The only drawback was the road - Via Cavour was quiet loud but because we had a ceiling fan we could close the window/doors which were double glazed and blocked out most of the noise. Breakfast was one of the best we had in our 2 weeks in Italy, the cappucinos are great, however I would avoid the eggs-they do seems to be left there overnight. There is cereal which I didn't get in anyother place I stayed in Italy. I would definatley go back to this hotel as you cannot beat the location and price.", "Date": "October 16, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "California", "Title": "“Ok but noisy room”", "Author": "CaliforniaLance", "ReviewID": "UR20769245", "Content": "We stayed here for a night to catch a flight the next day. It was cheap and clean and very central. HOWEVER- our room face Via Cavour and was so noisy that I didn't sleep. So it could be fine- could be noisy.", "Date": "October 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "miami", "Title": "“Lovely stay”", "Author": "dominz6841", "ReviewID": "UR20437063", "Content": "We booked on internet and we didn´t realize how was central located this Hotel. You can walk all Rome from there. Room was ok, basic but new forniture and not too big but ok. Breakfast was more than the average, eggs, several juice, rolls, ham, salami, fruit, yogurt and croissant. But the staff make your stay special. They explain all about Rome and you can join all the city with their suggestion.", "Date": "September 28, 2008"}], "HotelInfo": {"Name": "Hotel Saturnia", "HotelURL": "/ShowUserReviews-g187791-d564821-Reviews-Hotel_Saturnia-Rome_Lazio.html", "Price": "$77 - $1,307*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Ruinaglia 4/6</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "564821", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/30/a2/5a/facciata.jpg"}}