{"Reviews": [{"Content": "Stay away! I was in SF last year to study for a couple months. The school people chose this hotel for me, saying it was ok, not 5 stars, but decent, lots of foreign students, long term residents, etc... [--]! They forgot to say that the long term residents included people on parole, ex-cons, etc... not my kind of ideal student trip to SF! Not to mention the hotel itself is hedious, old, dirty, with a disgusting filthy bath; dust all over the room. I couldn't barely sleep, because the matress was probably at least 40 years old. Do I need to add it was dirty and smelly as well?I guess even homeless people (who, by the way, gather in the neighborhood) could stand this hotel. They deserve more than this!Stay away! I couldn't stand it more than 2 days. The new hotel the school book me in was not that good as well, but at least I felt secure there.", "Date": "Oct 25, 2008", "ReviewID": "UR181872585", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "1000faces"}, {"Content": "Just what we were looking for!       Our bath", "Date": "Oct 16, 2007", "ReviewID": "UR182562223", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "FloridaMagnolia"}, {"Content": "awful place to stay Just returned from a holiday in san francisco,Unfortunately I happened to stay at this hotel! due to all other hotels I wanted to stay at being full.the location was not too bad for getting around the city.But the hotel itself was awful shabby and looked very uncared for,the best part of it was the reception area after that it was all downhill.Trying to sleep in room was impossible due to traffic noise as hotel was at a crossroads of 2 main roads all night long lorries and motorbikes passing below window. asked to change room but told there was not any avaiable,At reception was told to leave t.v on with sound turned up to drown out noise,But even t.v did not work as there was no aerial.I would advise anyone not to stay here there are much better options about the area for the same rates.The Grant hotel also the Mayflower hotel are so much better to stay at.", "Date": "Sep 22, 2007", "ReviewID": "UR856932491", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lightfoot27"}, {"Content": "Very Bad This is primarily a residence hotel, and should not be used for usual hotel accomodations.It is a very old building with no new upgraids, not very clean, very shabby. The only amenity is a dining room with a microwave for residents to heat their meals. The location, the appearance, the clientele, all give the impression of a run down flop house in the seadiest part of town. Most of all, our confirmed reservation for a room with a private bath was not upheld. They gave us a room with no bathroom, and they could not rectify that. We were left out on the street with no place to go. Their offer was to charge us only the rate for a room without bath - for the room without bath they gave us.A terrible experience I never want to relive.", "Date": "May 11, 2006", "ReviewID": "UR497673256", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Residence hotel -- Great for those of us on a budget The Harcourt is a great hotel for those who plan to stay for a few weeksor months in downtown San Fran on a budget. I stayed for the entiresummer while I did an internship between my Junior and Senior years ofcollege.The four great things about the Harcourt are: the price, the location,the people, and the food. The price: Rooms are rented weekly or monthly and include breakfast anddinner in a communal dining area. You get access to a TV, reading room,and a deck on the roof. The rates very reasonable (especially for ashared room.)The location: It is walking distance to the financial district (about 10blocks), walking distance to the library (about 5 blocks), and only ashort bus ride away from the Marina, the Mission, or pretty much anyother part of San Fran. It is on the edge of the Tenderloin (the roughdistrict) but far enough out to avoid trouble.The people: You get an eclectic mix of students, foreign visitors, andlonger term residents. Since you have meals together you'll end upgetting to know them pretty well.The food: Surprisingly good in my opinion. Not a heck of a lot of choicefor any given meal, or very much variety for breakfasts between days.There really wasn't anything that I thought was bad. Several steps abovewhat my high school cafeteria served. That isn't to say it is worldclass. The food is a favorite gripe of the residents, and many enjoyskipping out on free dinner and eating at one of the surroundingexpensive high class restaurants.The three bad things about the Harcourt are: sharing a bathroom, sharinga room, and the decor. For about double the price you can upgrade to aprivate room, but I'm not sure that any of the rooms have a privatebath. While clean, none of the rooms have had any renovation in about 50years. The paint is thick, the hallways are dark, and the windows areheavy.", "Date": "Aug 22, 2005", "ReviewID": "UR245350098", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "2", "Location": "-1"}, "Author": "deadsea"}, {"Content": "Lieber ein paar Euros mehr bezahlen...   showReview(13196954, 'full');", "Date": "Jan 4, 2008", "ReviewID": "UR305657854", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d565629-r21187698-Harcourt_Hotel-San_Francisco_California.html", "HotelID": "565629", "Price": "Unkonwn"}}